[
  {
    "title": "Foltyn Reacts - YouTube",
    "url": "https://www.youtube.com/@FoltynReacts",
    "snippet": "Welcome to FoltynReacts. Where you can sit and relax and watch videos with me such as Youtube Shorts, Viral content, and Funniest videos on youtube. ENJOY!! Welcome to FoltynReacts. Where you..."
  },
  {
    "title": "Foltyn Reacts - Facebook",
    "url": "https://www.facebook.com/61570241520294/",
    "snippet": "Welcome to FoltynReacts. Where you can sit and relax and watch videos with me such as Youtube..."
  },
  {
    "title": "Foltyn Reacts - Shapes, Inc",
    "url": "https://shapes.inc/foltynreacts",
    "snippet": "Foltyn Reacts brings contagious happiness to the table, reacting to viral videos and youtube shorts with a 23-year-old's energy and wit. this happy-go-lucky personality loves making people smile and hates horror videos. expect short, punctuation-free responses in lowercase, always aiming to put a smile on your face with fun reactions and ..."
  },
  {
    "title": "REACTING TO MY OWN DHAR MAN VIDEO! - YouTube",
    "url": "https://www.youtube.com/watch?v=AQ-31WDGxGo",
    "snippet": "Each player starts by choosing an avatar and giving it an identity. They can then explore ROBLOX — interacting with others by chatting, playing games, or collaborating on creative projects."
  },
  {
    "title": "Foltyn | Wikitubia | Fandom",
    "url": "https://youtube.fandom.com/wiki/Foltyn",
    "snippet": "Channel where Foltyn reacts to videos. Channel dedicated to shorts. Note: The following dates are according to Social Blade. Dates may vary by one or two days due to differences in time zones. Community content is available under CC-BY-SA unless otherwise noted."
  },
  {
    "title": "15% Off | Viking Direct UK Voucher Codes | Feb 2026",
    "url": "https://couponfollow.com/site/viking-direct.co.uk",
    "snippet": "3 days ago · New customers get a special deal—15% off with a Viking Direct discount code—on their first order. Don’t miss out on promotions by visiting the Viking Direct homepage."
  }
]