[
  {
    "title": "Descargar y usar el Traductor de Google",
    "url": "https://support.google.com/translate/answer/6350850?hl=es&co=GENIE.Platform=Desktop",
    "snippet": "Descargar y usar el Traductor de Google Con la versión web o la aplicación del Traductor de Google, puedes traducir texto, frases escritas a mano, fotos y voz en más de 200 idiomas. Puedes obtener …"
  },
  {
    "title": "Descargar y usar el Traductor de Google",
    "url": "https://support.google.com/translate/answer/6350850?hl=es&co=GENIE.Platform=Android",
    "snippet": "Descargar y usar el Traductor de Google Con la versión web o la aplicación del Traductor de Google, puedes traducir texto, frases escritas a mano, fotos y voz en más de 200 idiomas. Puedes obtener …"
  },
  {
    "title": "Traducir imágenes - Ordenador - Ayuda de Google Translate",
    "url": "https://support.google.com/translate/answer/6142483?hl=es-419&co=GENIE.Platform=Desktop",
    "snippet": "Traducir texto de imágenes Puedes traducir el texto de las imágenes de tu dispositivo en el Traductor de Google. Importante: La precisión de la traducción depende de la claridad del texto. La traducción …"
  },
  {
    "title": "Traducir por voz - Android - Ayuda de Google Translate",
    "url": "https://support.google.com/translate/answer/6142468?hl=es&co=GENIE.Platform=Android",
    "snippet": "En tu teléfono o tablet Android, abre la aplicación Traductor . Toca Menú Ajustes . Configura estos ajustes en función de lo que quieres hacer: Si quieres que el texto traducido se lea en voz alta …"
  },
  {
    "title": "Traducir texto escrito a mano",
    "url": "https://support.google.com/translate/answer/6142478?hl=es&co=GENIE.Platform=Desktop",
    "snippet": "Traducir texto escrito a mano Con la aplicación Traductor de Google puedes traducir palabras o frases escritas. También puedes usar la versión disponible para navegadores web como Chrome o Firefox. …"
  },
  {
    "title": "Traducir documentos y sitios web - Ordenador - Ayuda de Google …",
    "url": "https://support.google.com/translate/answer/2534559?hl=es&co=GENIE.Platform=Desktop",
    "snippet": "Widget de traducción de sitios web Si eres una institución académica o gubernamental, una organización sin ánimo de lucro o un sitio web no comercial, quizá puedas usar el acceso directo al …"
  }
]