[
  {
    "title": "What does calve exactly mean? - English Language Learners Stack …",
    "url": "https://ell.stackexchange.com/questions/269526/what-does-calve-exactly-mean",
    "snippet": "Dec 21, 2020 · The verb \"calve\" is also used when an iceberg breaks off from the parent glacier, as by analogy the iceberg is \"born\". \"Calve\" is also used in some other cases where a smaller thing breaks …"
  },
  {
    "title": "\"Stucked\": Is it correct? [closed] - English Language Learners Stack ...",
    "url": "https://ell.stackexchange.com/questions/85624/stucked-is-it-correct",
    "snippet": "Mar 26, 2016 · For most verbs, we form the simple past and the past participle by adding -ed to the verb, for example kick - kicked - kicked. Stick is irregular: the simple past and past participle are formed as …"
  },
  {
    "title": "What is the person who takes minutes in a meeting called?",
    "url": "https://ell.stackexchange.com/questions/73113/what-is-the-person-who-takes-minutes-in-a-meeting-called",
    "snippet": "Nov 12, 2015 · For the sake of providing an answer, the appropriate answer is \"minutes taker\", which you provided in your question. Minute taker A minutes taker is the attendee at meeting whose role it …"
  },
  {
    "title": "Which is the proper way (Just only) or (only just)?",
    "url": "https://ell.stackexchange.com/questions/361008/which-is-the-proper-way-just-only-or-only-just",
    "snippet": "Jan 7, 2025 · In this context only and just mean the same thing. Using both words conveys no extra information and is completely unnecessary. Native English speakers wouldn't use it. Use one word or …"
  },
  {
    "title": "What's a preferred alternative to the phrase 'do the needful'?",
    "url": "https://ell.stackexchange.com/questions/17278/whats-a-preferred-alternative-to-the-phrase-do-the-needful",
    "snippet": "It's obscure to the native English speaker, and I've personally experienced it being used out of exasperation. It's a poor substitute for spelling out what one is asking for, and implies something to …"
  },
  {
    "title": "Look, someone's eaten/someone ate all of the cake!",
    "url": "https://ell.stackexchange.com/questions/360929/look-someones-eaten-someone-ate-all-of-the-cake",
    "snippet": "Jan 4, 2025 · In both scenarios, the polishing up of the cake has relevance to the present (John and Sarah won't get a second helping.) So the present perfect is a good option regardless of whether the …"
  }
]