[
  {
    "title": "Huda - New York - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/4505-huda/",
    "snippet": "Jun 2, 2025 · A bowl of cherries! Which life is not. Fluke carpaccio, refreshing and light. Smoky, oily pita. One of the stars of the evening: rakakat (cheese-stuffed phyllo with muhammara). Dandelion, which …"
  },
  {
    "title": "On cheese - Page 3 - Dairy and Eggs - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/page/3/",
    "snippet": "Feb 24, 2024 · A cheese event at a vast warehouse in Queens. Multiple bars, cheese-related events on stage and a massive, endless all-you-can eat cheese buffet curated by Tia Keenan. I ate as much as …"
  },
  {
    "title": "On cheese - Page 4 - Dairy and Eggs - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/page/4/",
    "snippet": "Feb 24, 2024 · Formaggio Kitchen cheese buyers discovered Ekiola Ardi Gasna back in 2010 on a trip to the Basque Country. Since then it has become an all-time monger and customer favorite."
  },
  {
    "title": "On cheese - Dairy and Eggs - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/",
    "snippet": "On 4/18/2024 at 1:47 PM, voyager said: Cheese is difficult. It is alive and constantly morphing. Like they say you never dip your foot in the same river, you never eat the same cheese. We've had cheese …"
  },
  {
    "title": "Canned fish - Fish and seafood - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/3447-canned-fish/",
    "snippet": "Oct 3, 2024 · @small h Moving this responsibly from the cheese thread, the La Curiosa spider crab pate: also included mussels, hake, mayo, eggs. Not the most appetizing color. A slightly grainy texture that …"
  },
  {
    "title": "Doritos Nacho Cheese Liquor - Wines and liquor - Moutfulsfood",
    "url": "https://mouthfulsfood.com/forums/index.php?/topic/653-doritos-nacho-cheese-liquor/",
    "snippet": "Jan 4, 2024 · Seriously? https://www.today.com/food/drinks/doritos-flavored-liquor-rcna129380 And if you act now you lucky New Yorkers can get your hands on some for a limited time."
  }
]