[
  {
    "title": "Mr. Mercedes - watch tv show streaming online",
    "url": "https://www.justwatch.com/us/tv-show/mr-mercedes",
    "snippet": "Find out how and where to watch \"Mr. Mercedes\" online on Netflix, Prime Video, and Disney+ today – including 4K and free options."
  },
  {
    "title": "Mr. Robot (TV Series 2015–2019) - IMDb",
    "url": "https://m.imdb.com/title/tt4158110/",
    "snippet": "Mr. Robot: Created by Sam Esmail. With Rami Malek, Christian Slater, Carly Chaikin, Martin Wallström. Elliot, a brilliant but unstable cyber-security engineer and vigilante hacker, becomes a key figure in a complex game of global chaos when he and his shadowy allies try to take down the corrupt corporation his company is paid to protect."
  },
  {
    "title": "Mr. Mercedes",
    "url": "https://m.imdb.com/title/tt4354880",
    "snippet": "By season two (2) the serial killer is identified and by season three (3) there is a new story line which is indirectly tied to the first two seasons as some of the surviving victims of Mr. Mercedes who were at the job fair try to get on with their lives."
  },
  {
    "title": "Netflix Bangers | Mr. Mercedes does it take a dive after ...",
    "url": "https://www.facebook.com/groups/NetflixBangers/posts/2838043626582747/",
    "snippet": "Mr. Mercedes does it take a dive after season one? The conversation revolves around the TV show, with many viewers expressing their disappointment with the later seasons, while some encourage others..."
  },
  {
    "title": "直播训练开源大模型** + + - GitHub",
    "url": "https://github.com/Jiaxin-Wen/CPM-Live/compare/8c74cda...OpenBMB:CPM-Live:8ad7aa6.diff",
    "snippet": "+ beam_size (int, optional, defaults to 3): beam size of beam search. + generate_length (int, optional, defaults to 100): maximum generation length."
  },
  {
    "title": "WhatsApp Web",
    "url": "https://web.whatsapp.com/",
    "snippet": "Log in to WhatsApp Web for simple, reliable and private messaging on your desktop. Send and receive messages and files with ease, all for free."
  }
]