[
  {
    "title": "I’m the Prime Minister of Spain. This Is Why the West Needs ...",
    "url": "https://www.nytimes.com/2026/02/04/opinion/spain-migrants-europe.html",
    "snippet": "2 hours ago · In Spain, it is our duty to become the welcoming and tolerant society our ancestors would have hoped to find on the other side of our borders."
  },
  {
    "title": "Spain will ban social media for under-16s | CNN Business",
    "url": "https://www.cnn.com/2026/02/03/tech/spain-under-16-social-media-ban-intl",
    "snippet": "2 days ago · Spain will ban social media for under-16s and require platforms to employ strict age verification tools, joining Australia, France and Denmark in moves to curb the influence of digital platforms ..."
  },
  {
    "title": "Spain mulls protecting teenagers from 'digital Wild West'",
    "url": "https://www.dw.com/en/spain-mulls-protecting-teenagers-from-the-digital-wild-west/video-75805560",
    "snippet": "Spain's Prime Minister Pedro Sanchez has announced plans to ban social media for youths under the age of 16, following in the footsteps of Australia. Elon Musk reacted to the plans with insults on ..."
  },
  {
    "title": "I’m the Prime Minister of Spain. This Is Why the West Needs ...",
    "url": "https://gb.news/im-the-prime-minister-of-spain-this-is-why-the-west-needs-migrants/",
    "snippet": "1 day ago · Opinion & Editorials I’m the Prime Minister of Spain. This Is Why the West Needs Migrants. In Spain, it is our duty to become the welcoming and tolerant society our ancestors would have hoped to"
  },
  {
    "title": "Elon Musk Calls Spain’s PM ‘Tyrant’ Over New ... - Yahoo",
    "url": "https://www.yahoo.com/news/articles/elon-musk-calls-spain-pm-204100021.html",
    "snippet": "4 hours ago · Spain’s Prime Minister, Pedro Sánchez, has vowed to protect children from the “digital wild west,” drawing criticism directly from Elon Musk. Elon Musk calls out Spain’s PM"
  },
  {
    "title": "Canva: Visual Suite for Everyone",
    "url": "https://www.canva.com/",
    "snippet": "Canva is a free-to-use online graphic design tool. Use it to create social media posts, presentations, posters, videos, logos and more."
  }
]