[
  {
    "title": "Winter Olympics 2026 - News, Schedules, Results - Milano Cortina 2026",
    "url": "https://www.olympics.com/en/milano-cortina-2026",
    "snippet": "Welcome to the Milano Cortina 2026 Winter Olympic Games website. Follow the world's top athletes as they go for gold in Italy (Feb 6 - 22, 2026)."
  },
  {
    "title": "Schedule - 2026 Winter Olympics - Team Canada",
    "url": "https://olympic.ca/schedule-2026-winter-olympics/",
    "snippet": "Official Milano Cortina 2026 Winter Olympics schedule. Get the event timetable, medal sessions, and venue details for February 4-22, 2026."
  },
  {
    "title": "2026 Winter Olympics - Wikipedia",
    "url": "https://en.m.wikipedia.org/wiki/2026_Winter_Olympics",
    "snippet": "The 2026 Winter Olympics (Italian: Olimpiadi invernali del 2026), officially the XXV Winter Olympic Games and commonly known as Milano Cortina 2026, is an upcoming international multi-sport event scheduled to take place from 6 to 22 February 2026 at sites across Lombardy and Northeast Italy."
  },
  {
    "title": "2026 Winter Olympics: What you need to know - dw.com",
    "url": "https://www.dw.com/en/2026-winter-olympics-what-you-need-to-know/a-75716782",
    "snippet": "This Friday, the 25th Winter Olympics will open in Milan and Cortina d'Ampezzo. How big will the Games be? Will Russia be allowed to participate in the competitions — and what about security and ..."
  },
  {
    "title": "Winter Olympics 2026 Schedule, & Timings for Each Event",
    "url": "https://wintersports2026.com/schedule/",
    "snippet": "The Winter Olympics 2026 in Milano–Cortina bring together snow and ice sports across northern Italy, packed into a tight February schedule. Over a little more than two weeks, fans get 116 medal events, daily competitions, and ceremonies in some of the most iconic stadiums and mountain venues in Europe."
  },
  {
    "title": "Quote Of The Day (Robert T. Weston) | James McGrath - Patheos",
    "url": "https://www.patheos.com/blogs/religionprof/2012/10/quote-of-the-day-robert-t-weston.html",
    "snippet": "Oct 4, 2012 · Patheos Explore the world's faith through different perspectives on religion and spirituality! Patheos has the views of the prevalent religions and spiritualities of the world."
  }
]