[
  {
    "title": "",
    "url": "https://www.facv.org/2025/interclubs/of_Narovella.pdf",
    "snippet": "Orden de Fuerzas del Atlètic Club Narovella."
  },
  {
    "title": "",
    "url": "https://mont-roig.cat/wp-content/uploads/Conveni-collaboracio-pel-Centenari-del-Club-Atletic-Mont-roig-.pdf",
    "snippet": "L’objecte d’aquest conveni és la promoció de l’esport i concretament de la marca L’Ajuntament de Mont-roig del Camp amb l’esport, mitjançant la col·laboració amb el Club Atlètic Mont-roig per aquesta anualitat 2022 amb motiu del Centenari de l’esmentada entitat."
  },
  {
    "title": "",
    "url": "https://editorial.uefa.com/resources/026d-135b72f742e1-bfb6da961b7a-1000/1st_division_clubs.pdf",
    "snippet": "1 Lori FC announced its withdrawal from the competition on April 5, 2021. All of its remaining games are counted as 3-0 technical losses. 2 Gandzasar Kapan withdrew from the competition at the..."
  },
  {
    "title": "",
    "url": "https://cagranollers.com/wp-content/uploads/2024/09/informacio-escola-2024-2025.pdf",
    "snippet": "No importa si has fet esport abans o no, el CLUB ATLÈTIC GRANOLLERS acull a tots els atletes . Vine al CAG on a part de practicar l’atletisme, coneixeràs a un munt de gent, participaràs a les activitats del club (sortides, esdeveniments socials, competicions). Podràs conèixer altres llocs de Catalunya i compartir aficions amb altres clubs."
  },
  {
    "title": "",
    "url": "https://clubatleticmanresa.cat/wp-content/uploads/2025/02/REGLAMENTCAMPIONATSESPANYACLUB_sh_all.pdf",
    "snippet": "ampionats d’Espanya de lu s de short trak i aire lliure en ategoria, a solut, Su20 i Su 16: L’entitat aonarà el 100% del desplaçament i allotjament, sota l’organitzaió del lu , a tots els atletes que siguin onvoats a aquestes ompetiions."
  },
  {
    "title": "Google Earth",
    "url": "https://earth.google.com/",
    "snippet": "Create and collaborate on immersive, data-driven maps from anywhere with the new Google Earth. See the world from above with high-resolution satellite imagery, explore 3D terrain and buildings in hundreds of cities, and dive into streets and neighborhoods with Street View's 360° perspectives."
  }
]