[
  {
    "title": "Prague - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prague",
    "snippet": "Prague, located on the Vltava River, has a population of about 1.4 million, while its metropolitan area is home to approximately 2.3 million people. Prague is a historical city with Romanesque, Gothic, Renaissance, and Baroque architecture."
  },
  {
    "title": "History, Map, Population, Language, Climate & Facts - Britannica",
    "url": "https://www.britannica.com/place/Prague",
    "snippet": "Jan 14, 2026 · Prague, city, capital of the Czech Republic. Lying at the heart of Europe, it is one of the continent’s finest cities and the major Czech economic and cultural centre. The city has a rich architectural heritage that reflects both the uncertain currents of history in Bohemia and an urban life extending back more than 1,000 years."
  },
  {
    "title": "THE 15 BEST Things to Do in Prague (2026) - Tripadvisor",
    "url": "https://www.tripadvisor.com/Attractions-g274707-Activities-Prague_Bohemia.html",
    "snippet": "See what other travelers like to do, based on ratings and number of bookings. Book these experiences for a close-up look at Prague. These rankings are informed by Tripadvisor data—we consider traveler reviews, ratings, number of page views, and user location. 1. Staromestske namesti."
  },
  {
    "title": "Prague: Gem of Europe with 100 Spires | VisitCzechia",
    "url": "https://www.visitczechia.com/en-us/destinations/prague",
    "snippet": "Experience Prague like never before! Step into the capital of the Czech Republic, a UNESCO World Heritage gem, where history, culture, and charm come alive. Wander through stunning architecture, indulge in world-class dining, and catch unforgettable classical music concerts."
  },
  {
    "title": "12 Things To Do in Prague (2026 Travel Guide) · Salt in our Hair",
    "url": "https://www.saltinourhair.com/czech-republic/prague/",
    "snippet": "Aug 29, 2023 · There are so many things to do in Prague, that you can spend at least 3 days here discovering its history, wandering the charming cobblestone streets, eating delicious food, and admiring the fairytale architecture. Spend your first day enjoying the beautiful contrasts of Prague."
  }
]