[
  {
    "title": "Key & Peele: The Complete Series - TV on Google Play",
    "url": "https://play.google.com/store/tv/show/Key_Peele_The_Complete_Series?id=LRn21yktHI4&hl=en-US",
    "snippet": "Jan 30, 2012 · Buy Key & Peele: The Complete Series on Google Play, then watch on your PC, Android, or iOS devices. Download to watch offline and even view it on a big screen using Chromecast."
  },
  {
    "title": "Key & Peele - watch tv show streaming online - JustWatch",
    "url": "https://www.justwatch.com/us/tv-show/key-and-peele",
    "snippet": "It is also possible to buy \"Key & Peele\" as download on Apple TV Store, Fandango At Home, Amazon Video. Besides streaming, the series is also available on Blu-ray from Amazon DVD / Blu-ray, Barnes & Noble. You can also stream the title for free on Hoopla."
  },
  {
    "title": "Watch Key & Peele for Free Online | Pluto TV",
    "url": "https://pluto.tv/us/on-demand/series/60112c1ace98800013ecc1bb",
    "snippet": "Keegan-Michael Key and Jordan Peele take on everything from 'Gremlins 2' to systemic racism in their cringingly accurate sketches, featuring classic characters like Wendell and President Obama's Anger Translator. Stream Key & Peele for free on Pluto TV."
  },
  {
    "title": "Key & Peele - Comedy Central - Watch on Paramount Plus",
    "url": "https://www.paramountplus.com/shows/key-and-peele/",
    "snippet": "Mar 12, 2012 · Keegan-Michael Key and Jordan Peele star in this sketch comedy series, leaving no stone unturned in their search for laughs. The actor-writers examine life through a mix of filmed sketches and live stage segments, showcasing their unique chemistry, camaraderie and point of view."
  },
  {
    "title": "Key & Peele: The Complete Series - Amazon.com",
    "url": "https://www.amazon.com/Key-Peele-Complete-Keegan-Michael/dp/B01D1J58C6",
    "snippet": "Aug 2, 2016 · Key & Peele showcases the fearless wit of Keegan-Michael Key and Jordan Peele as they take on everything from Gremlins 2 to systemic racism."
  },
  {
    "title": "HTTP - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/HTTP",
    "snippet": "HTTP is the foundation of data communication for the World Wide Web, where hypertext documents include hyperlinks to other resources that the user can easily access, for example by a mouse click or by tapping the screen in a web browser. HTTP is a request–response protocol in the client–server model."
  }
]