[
  {
    "title": "Maryland State Retirement and Pension System - MSRA",
    "url": "https://sra.maryland.gov/",
    "snippet": "Nov 2, 2018 · To administer the survivor, disability, and retirement benefits of the System's participants."
  },
  {
    "title": "Maryland - mySRPS",
    "url": "https://mysrps.sra.maryland.gov/",
    "snippet": "mySRPS is a secure platform for Maryland State Retirement and Pension System members to access their accounts, manage benefits, and plan for retirement."
  },
  {
    "title": "Forms - Maryland State Retirement and Pension System",
    "url": "https://sra.maryland.gov/retiree-forms",
    "snippet": "Nov 2, 2018 · The process to change your beneficiary varies depending on the benefit option you chose at retirement. Your option selection is listed on the Notice of Retirement Allowance you received upon retirement."
  },
  {
    "title": "mySRPS - Maryland State Retirement and Pension System",
    "url": "https://sra.maryland.gov/mysrps",
    "snippet": "Nov 2, 2018 · It’s a secure website for State Retirement and Pension System members and retirees that enables you to get account information, make transactions and send secure messages to the Maryland State Retirement Agency."
  },
  {
    "title": "Contact - Maryland State Retirement and Pension System",
    "url": "https://sra.maryland.gov/contact",
    "snippet": "Nov 2, 2018 · The SRPS Virtual Assistant, also known as Chatbot, can answer general questions about retirement benefits. You can access this resource by clicking on the Chatbot icon in the bottom right corner of our webpage."
  },
  {
    "title": "Re: Offline Installer for 64-bit Acrobat Reader. - Adobe Product ...",
    "url": "https://community.adobe.com/t5/acrobat-reader-discussions/offline-installer-for-64-bit-acrobat-reader/m-p/15628365",
    "snippet": "Dec 11, 2025 · Hello, where can I download the 64-bit offline installer for Acrobat Reader? On the Enterprise website, when selecting a non-MUI version, only the 32-bit version is offered - the 32/64 option is only available for the MUI version. Thanks and regards, Martin"
  }
]