[
  {
    "title": "301 Moved Permanently",
    "url": "https://www.troublefreepool.com/threads/how-to-drain-the-pool.282873/",
    "snippet": "301 Moved Permanently nginx/1.18.0 (Ubuntu)"
  },
  {
    "title": "Skimmer part identification - Trouble Free Pool",
    "url": "https://www.troublefreepool.com/threads/skimmer-part-identification.76086/",
    "snippet": "Hi everyone, I am new to Trouble Free Pool but have had a pool for 10 years mostly trouble free. Last year I ran out of time and had a pool company close my..."
  },
  {
    "title": "Pick A Number! - Trouble Free Pool",
    "url": "https://www.troublefreepool.com/threads/pick-a-number.94461/",
    "snippet": "May 25, 2015 路 We smashed our all time record online last weekend with 2510 users online. The previous number was 2485. As of this posting there are 2558 online right now. I chose 2688 for our peak today. Anyone want to pick a better number?"
  },
  {
    "title": "Closing Pool for Winter - Further Reading | Trouble Free Pool",
    "url": "https://www.troublefreepool.com/wiki/index.php?title=Closing_Pool_for_Winter",
    "snippet": "Jan 8, 2025 路 Contents 1How to Close a Pool for the Winter 1.1How to Close an Above-Ground Pool 1.2How to Close an In-Ground Pool 1.3How To Use Polyquat 60 in Pool Winterization 1.4Connecting Air Through Pump 1.4.1Modified Pump Cover to Connect Blower for Closing Swimming Pool 1.4.2Connecting Compressor to Pump Using Drain Port"
  },
  {
    "title": "Planning a DIY inground - Trouble Free Pool",
    "url": "https://www.troublefreepool.com/threads/planning-a-diy-inground.60856/",
    "snippet": "Jun 16, 2013 路 Hello all, lots of good info to be found here. I'm a plumbing and building contractor in Ohio. My plumbing company is my \"bread and butter\" and my construction company typically builds 1-2 custom homes a year. I have 3 kids, 13,10, and 7. We've always wanted a pool and we aren't getting any..."
  },
  {
    "title": "Yahoo search instead of Google (browser hijacking?) : r/chrome",
    "url": "https://www.reddit.com/r/chrome/comments/fvin0v/yahoo_search_instead_of_google_browser_hijacking/",
    "snippet": "Apr 5, 2020 路 Hi all, When I open a new tab (or use an existing one) to search for something, I get redirected to Yahoo search. I'm having this problem for 2 months now I think, even though I haven't downloaded any suspicious lately I can't find out what the cause is. I don't get any other weird things like a changed homepage or random tabs, just the once in a while Yahoo redirect instead Google search The ..."
  }
]