[
  {
    "title": "Como exibir o ícone “Meu computador” na área de trabalho do Windows 7 ...",
    "url": "https://maisgeek.com/como-exibir-o-icone-meu-computador-na-area-de-trabalho-do-windows-7-8-ou-10/",
    "snippet": "Existem duas maneiras diferentes de adicionar o ícone de volta. No Windows 10, o ícone Meu computador se chama “Este PC” e é muito fácil de adicionar. Continue lendo as instruções para Windows 7, 8 e Vista abaixo."
  },
  {
    "title": "COMO ATIVAR ICONE MEU COMPUTADOR NA AREA DE TRABALHO WINDOWS 11",
    "url": "https://www.youtube.com/watch?v=dIuaV4bMr7A",
    "snippet": "Neste vídeo, você aprenderá passo a passo como ativar o ícone \"Meu Computador\" na área de trabalho do Windows 11. Mantenha seu desktop organizado e tenha ace..."
  },
  {
    "title": "Exibindo o ícone de \"Meu Computador\" na área de trabalho do Windows 10",
    "url": "https://ajuda.rmbinformatica.com.br/sistemas-operacionais/microsoft-windows/exibindo-o-icone-de-meu-computador-na-area-de-trabalho-do-windows-10",
    "snippet": "Este artigo descreve como exibir o ícone do Meu computador na área de trabalho do Windows 10, tanto pelo método da interface gráfica do windows quanto através de linha de comando ou script."
  },
  {
    "title": "Onde está ‘Meu Computador’ no Windows 11? Como encontrar 'Este PC ...",
    "url": "https://whileint.com/pt/tech/stephane/where-is-my-computer-on-windows-11-how-to-find-this-pc-easily/",
    "snippet": "Sep 16, 2021 · No Windows 11, ‘Meu Computador’ atende pelo nome de ‘Este PC’. Mas não é fácil encontrá-lo se você não souber onde procurar, já que a Microsoft retirou esse atalho muito utilizado na área de trabalho e no menu Iniciar."
  },
  {
    "title": "Explorador de Arquivos no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/explorador-de-arquivos-no-windows-ef370130-1cca-9dc5-e0df-2f7416fe1cb1",
    "snippet": "Para localizar ficheiros relevantes do seu PC e da nuvem, pesquise a partir do Explorador de Arquivos Home Page. Observação: Inicie sessão nas suas contas na cloud a partir de Iniciar > Definições > Contas para ativar a pesquisa na cloud."
  },
  {
    "title": "BCGE | Banque Cantonale de Genève Pour particuliers et entreprises",
    "url": "https://www.bcge.ch/fr/home",
    "snippet": "Banque Cantonale de Genève - BCGE offre pour particulier ou entreprise, une gamme complète de services bancaires traditionnels ou en ligne"
  }
]