[
  {
    "title": "NABat",
    "url": "https://www.nabatmonitoring.org/",
    "snippet": "NABat is a muli-national, collaborative conservation monitoring program aimed at understanding status and trends all 47 species of bats common to the U.S., Canada, and Mexico."
  },
  {
    "title": "North American Bat Monitoring Program (NABat) - ScienceBase",
    "url": "https://sciencebase.usgs.gov/nabat/",
    "snippet": "The NABat Partner Portal provides role-based access to data. Data use and sharing elections are determined upon project creation by the data contributor and may be updated at any time."
  },
  {
    "title": "North American Bat Monitoring Program",
    "url": "https://www.batcon.org/our-work/research-and-scalable-solutions/north-america-bat-monitoring-program/",
    "snippet": "The North American Bat Monitoring Program (NABat) unites government agencies, researchers, and NGOs to improve the state of conservation science for bats in North America, serving as a powerful role model for collaborative and science-based bat conservation."
  },
  {
    "title": "What is Nabat? Understanding the Differences Between Regular Sugar and",
    "url": "https://www.sadaf.com/blogs/guides/what-is-nabat-understanding-the-differences-between-regular-sugar-and-persian-sugar-cubes",
    "snippet": "Feb 24, 2023 · Nabat is a unique and flavorful type of sugar that is commonly used in Middle Eastern and South Asian cuisine. While it may look similar to regular sugar, Nabat has a distinct texture and flavor that sets it apart."
  },
  {
    "title": "A plan for the North American Bat Monitoring Program (NABat)",
    "url": "https://research.fs.usda.gov/treesearch/48442",
    "snippet": "The purpose of the North American Bat Monitoring Program (NABat) is to create a continent-wide program to monitor bats at local to rangewide scales that will provide reliable data to promote effective conservation decisionmaking and the long-term viability of bat populations across the continent."
  }
]