[
  {
    "title": "Hospital Reforma Durango: cuidando tu salud y bienestar",
    "url": "https://www.hospitalreformadgo.com/",
    "snippet": "Además, nuestras instalaciones están en perfectas condiciones para brindarte un servicio seguro y de alta calidad. En el Hospital Reforma contamos con distintas especialidades como cirugía general, cardiología, oncología, pediatría, medicina interna, urología, angiología, entre otros."
  },
  {
    "title": "Hospital Reforma | 618 818 7847 | Victoria de Durango - AllBiz",
    "url": "https://www.allbiz.mx/hospital-reforma_134-618-818-7847",
    "snippet": "¿Dónde se encuentra Hospital Reforma? Hospital Reforma se encuentra en Santa Maria Esq. con Scop S/N Fracc, Reforma, 34277 Durango, Mexico, Victoria de Durango."
  },
  {
    "title": "HOSPITAL REFORMA en Durango: (618) 818-79...",
    "url": "https://www.guiatel.com.mx/empresas/hospital-reforma-victoria-de-durango-centro-durango",
    "snippet": "Opiniones, teléfono y dirección de HOSPITAL REFORMA en Victoria de Durango Centro, Durango. Tel : (618) 818-79..."
  },
  {
    "title": "Hospital Reforma S de Rl de Cv (Hospital Reforma) en Durango, Durango",
    "url": "https://www.directorio.gratis/Durango/durango/37472/hospital-reforma-s-de-rl-de-cv-hospital-reforma/",
    "snippet": "Hospital Reforma S de Rl de Cv (Hospital Reforma) - Teléfono, Domicilio, Opiniones y mucho más."
  },
  {
    "title": "Hospital Reforma en Durango - mexicoo.mx",
    "url": "https://mexicoo.mx/hospital-reforma-de-durango-s-de-r-l-de-c-v--1077583",
    "snippet": "Hospital Reforma - Hospital Reforma en Olga Margarita, Victoria de Durango, Durango, ofrece servicios en Hospitales generales del sector privado en la Calle Carlos Santamaria. descubra más sobre nuestros servicios."
  },
  {
    "title": "Consulta los horóscopos diarios en el amor, trabajo, dinero y salud",
    "url": "https://horoscopop.com/category/horoscopos/page/5/",
    "snippet": "Descubre el horóscopo diario actualizado, y además utiliza la calculadora para los signos zodiacales o la calculadora para la compatibilidad."
  }
]