[
  {
    "title": "Euro Stoxx 50 | Quotazione indice STOXX50E - Investing.com",
    "url": "https://it.investing.com/indices/eu-stoxx50",
    "snippet": "3 days ago · Ottieni informazioni dettagliate sulla quotazione in tempo reale dell'indice Euro Stoxx 50 inclusi grafici, analisi tecniche, componenti ed altro."
  },
  {
    "title": "EURO STOXX 50® - STOXX",
    "url": "https://stoxx.com/index/sx5e/",
    "snippet": "The EURO STOXX 50 Index, Europe's leading blue-chip index for the Eurozone, provides a blue-chip representation of supersector leaders in the region. The index covers 50 stocks from 8 Eurozone countries: Belgium, Finland, France, German"
  },
  {
    "title": "EURO STOXX 50 Price, Real-time Quote & News - Google",
    "url": "https://www.google.com/finance/quote/SX5E:INDEXSTOXX",
    "snippet": "Get the latest EURO STOXX 50 (SX5E) value, historical performance, charts, and other financial information to help you make more informed trading and investment decisions."
  },
  {
    "title": "Indice Euro STOXX 50 Index quotazioni in tiempo reale - borsa ...",
    "url": "https://it.marketscreener.com/quotazioni/indice/EURO-STOXX-50-INDEX-7396/",
    "snippet": "3 days ago · Euro STOXX 50 Index: prezzi di Borsa, grafici, quotazioni, consigli di Borsa, dati finanziari, analisi e notizie in tempo reale Indice Euro STOXX 50 Index | | EU0009658145 | Switzerland"
  },
  {
    "title": "Indice Euro Stoxx 50 — Grafico e quotazioni — TradingView",
    "url": "https://it.tradingview.com/symbols/STOXX-SX5E/",
    "snippet": "Visualizza il grafico live di EURO STOXX® 50 Index – EUR (Price Return) per seguire le ultime dinamiche dell'indice. Sono a tua disposizione anche idee, previsioni e notizie di mercato su STOXX:SX5E."
  },
  {
    "title": "Vídeos Pornô Grátis e Filmes de Sexo - Pornô, XXX, Porn Tube | Pornhub",
    "url": "https://pt.pornhub.com/",
    "snippet": "A Pornhub disponibiliza a você vídeos pornográficos gratuitos e ilimitados com as artistas adultas mais gostosas. Curta a maior comunidade de putaria amadora na internet, assim como cenas completas dos principais estúdios do pornô. Atualizamos nossa lista de vídeos pornográficos diariamente para garantir que você sempre receba os filmes de sexo da melhor qualidade."
  }
]