[
  {
    "title": "18 descobertas e invenções feitas por mulheres - Nathy",
    "url": "https://nathy.com.br/18-descobertas-e-invencoes-feitas-por-mulheres/",
    "snippet": "Aug 4, 2025 · Quais foram as descobertas científicas fundamentais atribuídas a mulheres, transformando nosso entendimento do mundo em nível molecular? Qual é o legado duradouro dessas 18 descobertas e invenções femininas na sociedade moderna, e como elas continuam a nos impactar?"
  },
  {
    "title": "Mulheres na ciência: conheça 8 cientistas que fizeram história",
    "url": "https://www.nationalgeographicbrasil.com/ciencia/2023/02/mulheres-na-ciencia-conheca-8-cientistas-que-fizeram-historia",
    "snippet": "Feb 10, 2023 · No Dia Mundial das Mulheres e Meninas na Ciência, confira algumas das mulheres cientistas cujas contribuições deixaram uma marca na história da ciência."
  },
  {
    "title": "10 importantes descobertas científicas feitas por mulheres",
    "url": "https://www.dci.com.br/dci-mais/cultura/10-importantes-descobertas-cientificas-feitas-por-mulheres/111095/",
    "snippet": "Mar 27, 2021 · Ada Lovelace, Marie Curie, Vera Rubin e Hedy Lamarr: conheça 10 enormes descobertas científicas feitas por mulheres pioneiras."
  },
  {
    "title": "18 descobertas e invenções feitas por mulheres - Selecoes",
    "url": "https://selecoes.ig.com.br/cultura-lazer/conheca-18-descobertas-e-invencoes-feitas-por-mulheres/",
    "snippet": "Mar 19, 2021 · Confira a nossa lista de 18 descobertas e invenções feitas por mulheres incríveis que talvez você não conheça!"
  },
  {
    "title": "7 descobertas científicas que foram feitas por mulheres",
    "url": "https://www.fatosdesconhecidos.com.br/dia-da-mulher-7-descobertas-cientificas-que-foram-feitas-por-mulheres/",
    "snippet": "Mar 8, 2016 · Sabia que as mulheres também fizeram descobertas importantes para a humanidade? Fizemos uma lista com 7 descobertas científicas feitas pelas mulheres."
  },
  {
    "title": "NFL Super Bowl Winners Quiz - Sporcle",
    "url": "https://www.sporcle.com/games/g/superbowls",
    "snippet": "Feb 9, 2025 · Can you name the Super Bowl winners? Play this fun quiz and test your trivia knowledge."
  }
]