[
  {
    "title": "Dekker helps to publish 80-year-old Jean Toomer manuscript - Finlandia ...",
    "url": "https://finlandia.edu/news/dekker-helps-publish-80-year-old-jean-toomer-manuscript/",
    "snippet": "Apr 25, 2016 · Dr. Carolyn Dekker teaches writing and American literature at Finlandia University. She holds a PhD in English Language and Literature from the University of Michigan, where her dissertation research focused on how American literature responds to the atomic bomb."
  },
  {
    "title": "17-18 JOB POSTINGS - Finlandia University",
    "url": "https://finlandia.edu/financial-aid/financial-aid-forms/17-18-job-postings/",
    "snippet": "Home » Financial Aid » Financial Aid Forms » 17-18 JOB POSTINGS"
  },
  {
    "title": "Laplander Named President-Elect of Michigan College ... - finlandia.edu",
    "url": "https://finlandia.edu/news/laplander-named-president-elect-of-michigan-college-access-programs-personnel/",
    "snippet": "Mar 12, 2019 · Finlandia University’s Kailee Laplander has been named President-Elect of Michigan College Access Programs & Personnel (MI-CAPP). Laplander serves as TRIO Pre-College Programs Coordinator and has been at Finlandia since the fall of 2014."
  },
  {
    "title": "Business students reflect on value of internship experiences",
    "url": "https://finlandia.edu/news/business-students-reflect-on-value-of-internship-experiences/",
    "snippet": "Dec 8, 2020 · A few notable exceptions have been positions with Finlandia’s Business Office, Marketing & Communications and Athletics. Internships are either performed locally during the academic year, or in many cases, during the summer as many students find positions in their hometowns."
  },
  {
    "title": "",
    "url": "https://finlandia.edu/wp-content/uploads/2020/03/Student-Resources.pdf",
    "snippet": "On-Campus Resources: The Table Student Needs Pantry and Services TRIO Student Services Finlandia Campus Ministry"
  },
  {
    "title": "You are not Alone: Mental Health Awareness Week with ... - finlandia.edu",
    "url": "https://finlandia.edu/news/you-are-not-alone-raising-awareness-to-mental-health-with-pastor-sarah-semmler-smith/",
    "snippet": "Feb 4, 2022 · On this episode of Finlandia Fridays, Campus Pastor Sarah Semmler Smith sits down with the team to talk about the upcoming Mental Health Awareness week happening on campus from Feb. 6 – 12."
  }
]