[
  {
    "title": "Duke Energy - Home",
    "url": "http://duke-energy.com/my-account/sign-in",
    "snippet": "Everything you need to know about energy savings and information regarding energy service for your home from Duke Energy."
  },
  {
    "title": "Pay Bill Online - Duke Energy",
    "url": "https://www.duke-energy.com/home/billing/pay-bill",
    "snippet": "Sign in or pay your Duke Energy bill as a guest using credit card, debit card or bank account. Making an online payment is simple, secure & convenient."
  },
  {
    "title": "Billing & Payment Options - For Your Home - Duke Energy",
    "url": "https://www.duke-energy.com/home/billing",
    "snippet": "Choose from a variety of billing and payment options designed to make paying your Duke Energy bill simple, secure and convenient."
  },
  {
    "title": "Sign In - Duke Energy",
    "url": "https://ms-sso3.duke-energy.com/adfs/ls/?wa=wsignin1.0&wtrealm=urn:federation:MicrosoftOnline",
    "snippet": "JavaScript is required. This web browser does not support JavaScript or JavaScript in this web browser is not enabled. To find out if your web browser supports JavaScript or to enable JavaScript, see web browser help. Sign in User Account Password Keep me signed in Sign in"
  },
  {
    "title": "My Account - Duke Energy",
    "url": "https://www.duke-energy.com/my-account/public-light-authentication",
    "snippet": "Privacy California Consumer Privacy Statement Do Not Sell or Share My Personal Information (CA) Terms of Use Accessibility © Duke Energy Corporation. All Rights Reserved."
  },
  {
    "title": "Low Cost Pet Insurance For Seniors - [Vet Explains Pets]",
    "url": "https://vetexplainspets.com/low-cost-pet-insurance-for-seniors/",
    "snippet": "In summary, low-cost pet insurance for seniors is essential in ensuring that aging pets receive the quality healthcare they deserve. With tailored plans, flexible payment options, and a growing awareness of the benefits of pet insurance, seniors can provide the best care for their beloved companions without breaking the bank."
  }
]