[
  {
    "title": "Get started with Google Maps - Android - Google Maps Help",
    "url": "https://support.google.com/maps/answer/144349?hl=en&co=GENIE.Platform=Android",
    "snippet": "Get started with Google Maps This article will help you set up, learn the basics and explain various features of Google Maps. You can use the Google Maps app on your mobile device or Google Maps on your computer."
  },
  {
    "title": "Buscar ubicaciones en Google Maps",
    "url": "https://support.google.com/maps/answer/3092445?hl=es&co=GENIE.Platform=Desktop",
    "snippet": "Abre Google Maps en el ordenador. Escribe una dirección o el nombre de un sitio. Pulsa Intro o haz clic en Buscar . Para filtrar los resultados de búsqueda, utiliza los menús desplegables situados debajo del cuadro de búsqueda. Los resultados de búsqueda principales aparecerán marcados con minimarcadores rojos y el resto con puntos rojos. Los marcadores cuadrados son anuncios. Más ..."
  },
  {
    "title": "Routebeschrijvingen opvragen en routes tonen in Google Maps",
    "url": "https://support.google.com/maps/answer/144339?hl=nl&co=GENIE.Platform=Desktop",
    "snippet": "Met Google Maps kun je routes opvragen voor de auto, het openbaar vervoer, lopen, ritdiensten, de fiets, het vliegtuig en de motor. Als er meerdere routes zijn, is de beste route naar je bestemming blauw en zijn alle andere routes grijs. Bepaalde routes in Google Maps zijn nog in ontwikkeling en kunnen daarom beperkt beschikbaar zijn."
  },
  {
    "title": "Ver rotas e mostrar trajetos no Google Maps",
    "url": "https://support.google.com/maps/answer/144339?hl=pt-BR&co=GENIE.Platform=Desktop",
    "snippet": "Você pode ver rotas de carro, transporte público, a pé, transporte por aplicativo, bicicleta, voo ou motocicleta no Google Maps. Se houver vários trajetos, o melhor para seu destino será destacado em azul, e os outros ficarão em cinza. Algumas rotas no Google Maps estão em processo de desenvolvimento, e a disponibilidade delas é limitada."
  },
  {
    "title": "Pesquise localizações no Google Maps",
    "url": "https://support.google.com/maps/answer/3092445?hl=pt&co=GENIE.Platform=Desktop",
    "snippet": "Pesquise localizações no Google Maps Pode pesquisar locais e localizações com o Google Maps. Quando inicia sessão no Google Maps, pode obter resultados da pesquisa mais detalhados. Pode encontrar locais que pesquisou anteriormente e pesquisar os seus contactos por nome."
  },
  {
    "title": "calculator.com®",
    "url": "https://calculator.com/",
    "snippet": "All clear button clears the calculator, tape, and resets any functions. Memory recall button retrieves the number you have in memory and places it in the display field. Memory plus button adds the number displayed to the contents of the memory. Memory minus button subtracts the number displayed from the contents of the memory."
  }
]