[
  {
    "title": "Balanza Fenix Trumax Fenix - BCI Ingenieria SAS",
    "url": "https://www.bci.co/productos/balanza-de-mesa-trumax-fenix",
    "snippet": "Balanza solo peso Trumax, fabricada en ABS de alta resistencia, display LCD con luz de respaldo tipo LED, plato en acero inoxidable de 27x21cm, bateria recargable con adaptador. Funciones como cambio de unidades entre gramos y libras, peso porcentual, conteo de piezas por muestra, limites de peso."
  },
  {
    "title": "Balanza Trumax Fenix - MercadoLibre",
    "url": "https://listado.mercadolibre.com.co/balanza-trumax-fenix",
    "snippet": "La balanza Trumax Fenix cuenta con un diseño compacto y resistente, ideal para su uso en diferentes entornos. Su pantalla LCD de fácil lectura facilita la visualización de los resultados de pesaje. La función de tara permite restar el peso del recipiente, asegurando una medición precisa."
  },
  {
    "title": "Balanza Trumax Fenix Pro Precisión Certificada para tu Negocio",
    "url": "https://measuremeter.com.co/producto/balanza-trumax-fenix-pro-precision-certificada",
    "snippet": "Descubre la balanza de solo peso Trumax Fenix Pro, diseñada para ofrecer precisión y durabilidad en tus pesajes. Ideal para comercios, laboratorios y aplicaciones industriales, esta balanza está equipada con características avanzadas que garantizan un rendimiento excepcional."
  },
  {
    "title": "Balanzas de mesa – Marca: Trumax Modelo: Fénix (Cuenta Piezas)",
    "url": "https://www.distriequiposbogota.com/producto/balanzas-de-mesa-marca-trumax-modelo-fenixdistr/",
    "snippet": "Balanza solo peso Trumax, fabricada en ABS de alta resistencia, display LCD con luz de respaldo tipo LED, plato en acero inoxidable de 27x21cm, bateria recargable con adaptador."
  },
  {
    "title": "Balanza de Solo Peso Trumax Fenix Pro | Plato de Acero ... - COMEK",
    "url": "https://www.comek.com.co/equipos_para_alimentos/156/8/medicion/balanza-fenix-pro-certificada-1-detail",
    "snippet": "Descubre la Balanza de Solo Peso Trumax Fenix Pro, una herramienta de pesaje confiable y certificada para uso en Metrología Legal en Colombia. Fabricada en ABS de alta resistencia y equipada con un robusto plato de acero inoxidable de 29x23cm, esta balanza ofrece durabilidad y precisión."
  },
  {
    "title": "Gmail - Email from Google",
    "url": "https://mail.google.com/mail",
    "snippet": "Gmail is email that's intuitive, efficient, and useful. 15 GB of storage, less spam, and mobile access."
  }
]