[
  {
    "title": "Create your first document in Google Docs",
    "url": "https://support.google.com/a/users/answer/9300311?hl=en",
    "snippet": "The Insert menu lets you add different features to your document. Here are the highlights: Image —Insert an image from your computer, the web, Drive, and more. Table —Select the number of columns and rows to create a table. Drawing —Create shapes, pictures, and diagrams right in your document. Link —Add a link to another page or to a header or bookmark in the same document. Bookmark ..."
  },
  {
    "title": "How to use Google Docs",
    "url": "https://support.google.com/docs/answer/7068618?hl=en&co=GENIE.Platform=Desktop",
    "snippet": "Docs (mobile) How to use Google Docs Visit the Learning Center Using Google products, like Google Docs, at work or school? Try powerful tips, tutorials, and templates. Learn to work on Office files without installing Office, create dynamic project plans and team calendars, auto-organize your inbox, and more."
  },
  {
    "title": "What you can do with Docs - Google Workspace Learning Center",
    "url": "https://support.google.com/a/users/answer/9300503?hl=en",
    "snippet": "With Google Docs, you can create and edit text documents right in your web browser—no special software is required. Even better, multiple people can work at the same time, you can see people’s changes as they make them, and every change is saved automatically. What you need: 10 minutes Google Workspace account — Don't have one?"
  },
  {
    "title": "Google Docs training and help",
    "url": "https://support.google.com/a/users/answer/9282664?hl=en",
    "snippet": "Docs quick start guides Quickly learn how to create and edit a document, move to Docs from another online word processor, and more. Get started with Docs Switch to Docs"
  },
  {
    "title": "Utiliser Google Docs",
    "url": "https://support.google.com/docs/answer/7068618?hl=fr&co=GENIE.Platform=Desktop",
    "snippet": "Google Docs est un service de traitement de texte en ligne. Il permet de créer des documents, de les mettre en forme et de les modifier en collaboration avec d'autres personnes. Découvrez nos meilleurs conseils pour utiliser Google Docs."
  },
  {
    "title": "Notes - Apple iCloud",
    "url": "https://www.icloud.com/notes",
    "snippet": "View, edit, create and share your notes with Notes on the web. Changes will sync across your devices with iCloud."
  }
]