[
  {
    "title": "The Galil- History, Information and Everything You Need to Know!",
    "url": "https://www.uzitalk.com/forums/index.php?threads/the-galil-history-information-and-everything-you-need-to-know.64893/",
    "snippet": "Feb 19, 2012 · Inside of Guatemala the Galil is called a \"Kell\". By 1994 these \"KEL\" Galil's where modified back to a Galil SAR configuration and added M203 40MM grenade launchers. In the Latin American Media they actually refer to a KEL as a variant as AR,ARM & SAR. I hope this information is of use to your thread."
  },
  {
    "title": "Seeking Guidance On Adjusting Galil Gas For Suppression",
    "url": "https://www.uzitalk.com/forums/index.php?threads/seeking-guidance-on-adjusting-galil-gas-for-suppression.99828/",
    "snippet": "Jan 19, 2024 · After receiving an Omega 300 from the BOGO, I wanted to try it on my Galil Ace Gen II 7.62x39 with 8.3” barrel. Folks online seemed to really talk up the KNS piston so I installed one of those. The trouble is I can’t seem to find a number of clicks where the gun cycles reliably both suppressed..."
  },
  {
    "title": "Need a definitive answer: ok or not to shoot 5.56 through pre-ban Galil?",
    "url": "https://www.uzitalk.com/forums/index.php?threads/need-a-definitive-answer-ok-or-not-to-shoot-5-56-through-pre-ban-galil.95853/",
    "snippet": "Jul 25, 2021 · I've have received equally strong YES and HELL NO to shooting 5.56 out of a Galil. My new to me Galil is an Action Arms pre-ban import circa 1986 or so with a 1-in-12 twist and stamped .223. Jeff Miller of Tenngalil fame says, GO FOR IT, others also knowledgeable say NOPE, could be risky given..."
  },
  {
    "title": "KNS precision/adjustable gas piston for Galil? - UZI Talk Forums",
    "url": "https://www.uzitalk.com/forums/index.php?threads/kns-precision-adjustable-gas-piston-for-galil.95290/",
    "snippet": "Apr 28, 2021 · Per strong recommendation of Jeff Miller of Hillbilly Firearms, I've swapped-out the original gas piston for my new to me pre-ban AA Galil 386. Piece of cake with just one roll-pin to punch out. I'm looking forward to shooting and adjusting it this weekend. On my first shooting session, as..."
  },
  {
    "title": "308 Galil Barrels AVAILABLE - UZI Talk Forums",
    "url": "https://www.uzitalk.com/forums/index.php?threads/308-galil-barrels-available.97996/",
    "snippet": "Oct 14, 2025 · Just wanted to put it out there for anyone looking for a 308 Galil barrel. I have a large quantity coming in within the next few weeks- SAR 16\" and ARM 20\" and potentially 18\" as well. These are US made, 41V50 chromoly steel with M25x1.5 receiver threads. Custom profiles and threads will be..."
  }
]