[
  {
    "title": "Mover archivos a la papelera y restaurarlos - Google Help",
    "url": "https://support.google.com/files/answer/10607740?hl=es",
    "snippet": "En tu dispositivo Android, abre Files by Google . Selecciona los archivos que quieras mover a la papelera. En la parte superior derecha, toca …"
  },
  {
    "title": "Quitar y restaurar papelera de reciclaje: Windows 10, 8, 7 - CCM",
    "url": "https://es.ccm.net/ordenadores/windows/2356-como-quitar-o-recuperar-la-papelera-de-reciclaje-en-el-escritorio/",
    "snippet": "Mar 18, 2022 · La papelera de reciclaje aparece por defecto en todas las versiones de Windows, desde el mismo momento en que se instala el …"
  },
  {
    "title": "Cómo restablecer fotos y videos borrados recientemente",
    "url": "https://support.google.com/photos/answer/9343482?hl=es-419&co=GENIE.Platform=Android",
    "snippet": "Cómo restablecer fotos y videos Importante: Solo puedes restablecer las fotos y los videos si aún están en la papelera. En tu dispositivo Android, …"
  },
  {
    "title": "Cómo recuperar un archivo eliminado en Google",
    "url": "https://support.google.com/docs/community-guide/309913262/cómo-recuperar-un-archivo-eliminado-en-google?hl=es",
    "snippet": "PAPELERA DE RECICLAJE Indiscutiblemente, el primer paso para recuperar un archivo borrado es visitar la “ Papelera ”. Allí aparecen los …"
  },
  {
    "title": "Cómo recuperar archivos borrados de OneDrive - CCM",
    "url": "https://es.ccm.net/aplicaciones-e-internet/internet/9626-como-recuperar-archivos-borrados-de-onedrive/",
    "snippet": "Nov 7, 2022 · ¿Eliminaste un archivo o una carpeta de OneDrive por error? No te preocupes, el servicio de almacenamiento en la nube de …"
  },
  {
    "title": "Nijlcruise met strandvakantie | 12 dagen | Kingfisher Tours",
    "url": "https://kingfishertours.com/rondreizen-egypte/nijlcruises/nijlcruise-met-strandvakantie/",
    "snippet": "Onze Nijlcruise met strandvakantie is een ontspannen manier om de culturele hoogtepunten van Egypte te ontdekken en te genieten van …"
  }
]