[
  {
    "title": "Taylor Swift – Wikipédia, a enciclopédia livre",
    "url": "https://pt.m.wikipedia.org/wiki/Taylor_Swift",
    "snippet": "Taylor Alison Swift (Reading, 13 de dezembro de 1989) é uma cantora, compositora, produtora musical, diretora e empresária americana. Conhecida por suas composições narrativas que geralmente concentram-se em sua vida pessoal, ao qual recebem ampla cobertura midiática."
  },
  {
    "title": "35 fatos sobre Taylor Swift para seus 35 anos de idade",
    "url": "https://www.cnnbrasil.com.br/entretenimento/curiosidades-sobre-taylor-swift/",
    "snippet": "Dec 6, 2019 · Dia especial para os fãs de Taylor Swift! Neste 13 de dezembro, a cantora completa 35 anos de idade. Presente na indústria da música desde muito nova, a estrela tem muito o que contar sobre sua vida e carreira."
  },
  {
    "title": "Cantora completa 36 anos com patrimônio bilionário e mansão de luxo",
    "url": "https://www.metropoles.com/celebridades/cantora-completa-36-anos-com-patrimonio-bilionario-e-mansao-de-luxo",
    "snippet": "Dec 13, 2025 · Taylor Swift completa 36 anos neste sábado (13/12). Ao longo do últimos anos, a cantora protagonizou momentos marcantes da história da música e acumulou sucessos e fortunas, chegando a um patrimônio estimado a 1,6 bilhão de dólares (mais de R$ 5 bilhões)."
  },
  {
    "title": "Taylor Swift Idade, Vida Pessoal, Biografia | Famous Birthdays",
    "url": "https://pt.famousbirthdays.com/people/taylor-swift.html",
    "snippet": "Cantora e compositora que aos 18 anos se tornou a artista solo mais nova a escrever e gravar uma música que atingiu o topo da parada country americana, com o single \"Our Song\". Ela lançou o seu quarto álbum country, \"Red\", em 2012, e o seu primeiro álbum pop, \"1989\", saiu no ano de 2014."
  },
  {
    "title": "Idolatrada, cantora chega aos 36 anos com fortuna de 1,6 bilhão de ...",
    "url": "https://caras.com.br/datas-especiais/idolatrada-cantora-chega-aos-36-anos-com-fortuna-de-16-bilhao-de-dolares-e-mansao-de-r-97-milhoes.phtml",
    "snippet": "Dec 13, 2025 · Taylor Swift completa 36 anos neste sábado, 13, idolatrada como um dos maiores fenômenos da história da música e do entretenimento global."
  },
  {
    "title": "Optical Profilometers - KEYENCE America",
    "url": "https://www.keyence.com/products/3d-measure/roughness-measure/",
    "snippet": "KEYENCE offers a wide range of optical profilometers that provide exceptional imaging in industrial applications. Click here to learn more."
  }
]