[
  {
    "title": "MACSA MOLINOS ANAHUAC en Chihuahua: (614) 417-36... - Guiatel",
    "url": "https://www.guiatel.com.mx/empresas/macsa-molinos-anahuac-chihuahua",
    "snippet": "Datos de contacto Dirección SARA PEREZ DE MADERO 1938, FRANCISCO I MADERO, 31030 Chihuahua, Chihuahua Como llegar Teléfono (614) 417-3614"
  },
  {
    "title": "Molinos Anáhuac | 614 417 3652 | Chihuahua (desambiguación) - AllBiz",
    "url": "https://www.allbiz.mx/molinos-anáhuac_5f-614-417-3652",
    "snippet": "¿Cuál es la dirección web (URL) de Molinos Anáhuac? El sitio web de Molinos Anáhuac es www.macsa.mx. Christian Alonso Soto Soriano es el contacto principal de Molinos Anáhuac. Puede contactar a Molinos Anáhuac por teléfono al 614 417 3652."
  },
  {
    "title": "Macsa - Harina de Maíz Nixtamalizado",
    "url": "https://www.macsa.mx/",
    "snippet": "Fundada en 1995, Macsa es una empresa mexicana reconocida por su alta calidad en harina de maíz y compromiso con sus clientes."
  },
  {
    "title": "Molinos Anáhuac - Chihuahua (Chihuahua) - 614 417 3652 - Cybo",
    "url": "https://es.cybo.com/MX-biz/molinos-anáhuac_5f",
    "snippet": "Molinos Anáhuac está trabajando en actividades de Manufactura de comida, bebida y tabaco, Toda la comida y bebida, Dirección corporativa. Puede contactar la empresa al 614 417 3652."
  },
  {
    "title": "Molinos Anahuac, S. A De C. V. - Macsa: teléfono - Calle Sara Pérez De ...",
    "url": "https://www.planetamexico.com.mx/molinos-anahuac-s-a-de-c-v-macsa-F100DC80113D3",
    "snippet": "Miguel Hidalgo - el centro de estudios ofrece escuela primaria en turno matutino - pertenece al ámbito de la educación pública y se en cuenta en zona rural - dirección: Avenida 16 De Septiembre..."
  },
  {
    "title": "Your Cox.net email is moving soon to Yahoo Mail - Reddit",
    "url": "https://www.reddit.com/r/CoxCommunications/comments/1ayodjx/your_coxnet_email_is_moving_soon_to_yahoo_mail/",
    "snippet": "Feb 24, 2024 · We wanted to share that your Cox email will soon transition to Yahoo Mail. With this transition, Cox's email service and your cox.net account will move to Yahoo Mail, but you'll keep using your same cox.net email address."
  }
]