[
  {
    "title": "SEC.gov | Home",
    "url": "https://www.sec.gov/",
    "snippet": "Our plan calls for the continuing operation of certain Commission systems, including EDGAR. We plan to post any changes in operational status on this page. Additional information is available from the Division of Corporation Finance, the Division of Examinations, the Division of Investment Management, and the Division of Trading and Markets."
  },
  {
    "title": "SEC.gov | Search Filings",
    "url": "https://www.sec.gov/search-filings",
    "snippet": "Some specific ways to access filings based on time, type, or other categories."
  },
  {
    "title": "SEC.gov | About",
    "url": "https://www.sec.gov/about",
    "snippet": "The federal securities laws empower the Securities and Exchange Commission with broad authority over all aspects of the securities industry. The SEC’s mission is to protect investors; maintain fair, orderly, and efficient markets; and facilitate capital formation."
  },
  {
    "title": "SEC.gov | Newsroom",
    "url": "https://www.sec.gov/newsroom",
    "snippet": "Jan 26, 2026 · The SEC's Small Business Capital Formation Advisory Committee is holding a public meeting regarding matters relating to rules and regulations affecting small and emerging businesses and their investors under the federal securities laws."
  },
  {
    "title": "SEC.gov | EDGAR Full Text Search",
    "url": "https://www.sec.gov/edgar/search/",
    "snippet": "The new EDGAR advanced search gives you access to the full text of electronic filings since 2001."
  },
  {
    "title": "ChatGPT getting very slow with long conversations. : r/ChatGPT",
    "url": "https://www.reddit.com/r/ChatGPT/comments/13yrmuu/chatgpt_getting_very_slow_with_long_conversations/",
    "snippet": "Jun 2, 2023 · Starting a new chat is obviously giving chatgpt amnesia unless you do a bit of a recap. I'm exploring an alternative like using a native GPT client for Mac and use chatgpt through the api instead."
  }
]