[
  {
    "title": "Vaishnavism - Wikipedia",
    "url": "https://en.m.wikipedia.org/wiki/Vaishnavism",
    "snippet": "According to Bhandarkar, Vaishnavism formed in the Purnaic period through the identification of Vishnu with Narayana and with Vasudeva-Krishna, following his elevation as the \"Supreme Spirit\"."
  },
  {
    "title": "O que é o Vaishnavismo? – ISKCON Brasil",
    "url": "https://iskconbrasil.com/index.php/o-que-e-o-vaishnavismo/",
    "snippet": "O Vaishnavismo é uma das principais tradições da cultura espiritual védica ou hindu mais ampla. Ao contrário de algumas tradições védicas, os Vaishnavas acreditam que a realidade última é pessoal. Assim, eles entendem que Deus é a pessoa Suprema e todo-atraente, ou Krishna. Eles reconhecem que todos os seres vivos são pessoas eternas e que todos os problemas da vida estão ..."
  },
  {
    "title": "Vaishnavism | Hinduism’s Most Popular Sect | Britannica",
    "url": "https://www.britannica.com/topic/Vaishnavism",
    "snippet": "Vaishnavism, one of the major forms of modern Hinduism, characterized by devotion to the god Vishnu and his incarnations (avatars). A devotee of Vishnu is called a Vaishnava."
  },
  {
    "title": "",
    "url": "https://periodicos.pucminas.br/horizonte/article/download/441/438/1372",
    "snippet": "A Índia muito além do incenso: um olhar sobre as origens, preceitos e práticas do vaishnavismo (India much beyond incense: a look at the origins, precepts and practices of Vaishnavism)"
  },
  {
    "title": "Vaishnavism - New World Encyclopedia",
    "url": "https://www.newworldencyclopedia.org/entry/Vaishnavism",
    "snippet": "Vaishnavism represents one of the largest branches of contemporary Hinduism. Vaishnavism stands out among the other major branches in that it represents the closest continuation of the Vedic tradition, and therefore speaks to the staying power of that ancient system of thought."
  },
  {
    "title": "List Of Premier League Teams Finishing With 50 Points Or Less 2015 2016 ...",
    "url": "https://www.statmuse.com/fc/ask/list-of-premier-league-teams-finishing-with-50-points-or-less-2015-2016",
    "snippet": "Aston Villa earned 17 points in the Premier League in 2015-16."
  }
]