[
  {
    "title": "Prince (musician) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Prince_(musician)",
    "snippet": "Prince Rogers Nelson (June 7, 1958 – April 21, 2016) was an American singer, songwriter, musician, dancer, and actor. Often credited as an influence on music and one of the greatest musicians of his …"
  },
  {
    "title": "Prince | Biography, Songs, Music, Purple Rain, Significance, Death ...",
    "url": "https://www.britannica.com/biography/Prince-singer-and-songwriter",
    "snippet": "Jan 19, 2026 · Prince was an American singer, guitarist, songwriter, producer, dancer, and performer on keyboards, drums, and bass who was among the most talented musicians of his generation. His …"
  },
  {
    "title": "Prince | Official Website",
    "url": "https://www.prince.com/",
    "snippet": "We aim to immerse fans, old and new, in Prince's story, explore the role of Prince and his work in today's cultural landscape."
  },
  {
    "title": "Prince - Songs, Death & Life - Biography",
    "url": "https://www.biography.com/musicians/prince",
    "snippet": "Apr 2, 2014 · Famed singer, songwriter and musical innovator Prince was born Prince Rogers Nelson on June 7, 1958, in Minneapolis, Minnesota. His parents were John Nelson, a musician whose stage …"
  },
  {
    "title": "Prince - Greatest Hits | All The Official Videos Playlist",
    "url": "https://music.youtube.com/playlist?list=PLrwXzbX3SWnu1H2yesZA0-28anAKGK6ZE",
    "snippet": "In the 1980s, Prince made history by being one of the first black artists to have their videos in heavy rotation on MTV. The Prince Estate is proud to present these groundbreaking videos..."
  },
  {
    "title": "Prince's Death, 9 Years Later: Revisiting the Singer's Shocking ...",
    "url": "https://people.com/prince-death-legacy-what-to-know-8572558",
    "snippet": "Apr 21, 2025 · Prince died following a self-administered accidental opioid overdose caused by “fentanyl toxicity,” according to the Midwest Medical Examiner’s Office. The dangerous drug is sometimes …"
  }
]