[
  {
    "title": "Etymology of using \"ya\" instead of \"you\" - slang",
    "url": "https://english.stackexchange.com/questions/457450/etymology-of-using-ya-instead-of-you",
    "snippet": "Jul 26, 2018 · 9 I have noticed that some people in parts of Maryland, Pennsylvania, Ohio often say \"ya\" instead of \"you\"? As in \"Didya do your homework?\" instead of \"Did you do your homework?\". Does anyone know the etymology behind this pronunciation? I am wondering if this could be evidence of the influence of a large population of people that still speak ..."
  },
  {
    "title": "What is “Who are ya?” and whence it came?",
    "url": "https://english.stackexchange.com/questions/117705/what-is-who-are-ya-and-whence-it-came",
    "snippet": "2 \"Who are ya?\" is a rhetorical question asking the other, lowly team to justify their presence at a match or level they don't deserve to play at. It's a mark of lack of repect to the other team. Yes, it's a fair assessment that it means to diminish the opposition as unknown and insignificant. The top Urban Dictionary definition gives guidance ..."
  },
  {
    "title": "\"Y'all\" or \"ya'll\"? - English Language & Usage Stack Exchange",
    "url": "https://english.stackexchange.com/questions/3312/yall-or-yall",
    "snippet": "Sep 21, 2010 · If anything, isn't ya'll a contraction of you will (where you is written as ya, as in \"ya know\")? Otherwise, the only explanation I can come up with for why someone would ever spell it ya'll is through (mistaken) analogy with contractions like I'll, he'll, etc."
  },
  {
    "title": "punctuation - Should \"ya\" have an apostrophe? \"Doin\"? Etc - English ...",
    "url": "https://english.stackexchange.com/questions/299167/should-ya-have-an-apostrophe-doin-etc",
    "snippet": "Jan 11, 2016 · In \"ya\", the \"ou\" vowel has been replaced with \"a\". We don't have punctuation to indicate that, so we just write it. This is also generally the case where a replacement slang/informal word is missing letters, but others have changed. When this happens, we usually just transcribe the sounds rather than using an apostrophe."
  },
  {
    "title": "Football | Yappi Sports - THE Ohio Prep Sports Authority",
    "url": "https://yappi.com/forum/index.php?forums/football.9/",
    "snippet": "Oct 21, 2013 · Article 2025 End of season interview with Lucas Scott Cannady from St. Bernard Elmwood Place High School"
  }
]