[
  {
    "title": "Sam's Club - Support Home Page",
    "url": "https://help.samsclub.com/",
    "snippet": "Sam’s Cash Your Sam's Cash Earn with Bonus Offers Learn more Sam’s Club Credit Member’s Mark Meet the Brand Made for You Shop the Products More"
  },
  {
    "title": "Sam's Club Hours",
    "url": "https://help.samsclub.com/app/answers/detail/a_id/171/~/sams-club-hours",
    "snippet": "Sam's Club Hours Find any club's location or directions, contact details by department, hours by department like pharmacy or optical and more by using the Sam's Club Finder."
  },
  {
    "title": "How to sign in and out of my online account - Sam's Club",
    "url": "https://help.samsclub.com/app/answers/detail/a_id/2865/~/how-to-sign-in-and-out-of-my-online-account",
    "snippet": "If you are not yet a Sam's Club Member, join now Can't remember your password, reset your password now To Sign out: Highlight the Sign In / Account dropdown right of the Search bar and select Sign Out at the bottom of the account options."
  },
  {
    "title": "Benefits of Club & Plus Membership - Sam's Club",
    "url": "https://help.samsclub.com/app/answers/detail/a_id/382/~/benefits-of-club-&-plus-membership---sams-club",
    "snippet": "Free Delivery from Club: Plus members receive free select same-day or next-day free delivery from your local club on eligible orders over $50 ($12 fee for Club members). Early Shopping Hours: Plus members can shop up to an hour early in-club & avoid the crowds, select exclusions apply. See Sam's Club Hours."
  },
  {
    "title": "Create a new Sam's Club Membership",
    "url": "https://help.samsclub.com/app/answers/detail/a_id/389/~/create-a-new-sams-club-membership",
    "snippet": "Create a new Sam's Club Membership Select the Join Sam's Club link at the bottom of any SamsClub.com page to compare the benefits of a Club ($50) or Plus ($110) Membership and instantly create a new membership. Complete all required fields; fields with a * must be completed."
  },
  {
    "title": "Customize recap summaries in Microsoft Teams",
    "url": "https://support.microsoft.com/en-us/office/customize-recap-summaries-in-microsoft-teams-04c45d0b-a729-4013-8351-beaa0dc2031c",
    "snippet": "Customize recap summaries to decide exactly what your summaries include. Choose a ready-made template or create your own by giving AI clear instructions or sharing an example that worked well before. Let AI do the heavy lifting, so every recap fits your style and workflow. Create a custom recap summary To create a custom recap summary: Open a meeting chat in Teams. Select Recap. Select Custom ..."
  }
]