[
  {
    "title": "Roblox",
    "url": "https://www.roblox.com/",
    "snippet": "Roblox is the ultimate virtual universe that lets you create, share experiences with friends, and be anything you can imagine. Join millions of people and discover an infinite variety of immersive experiences created by a global community!"
  },
  {
    "title": "‎App Roblox - App Store",
    "url": "https://apps.apple.com/mx/app/roblox/id431946152",
    "snippet": "Descarga Roblox de Roblox Corporation en App Store. Ve capturas de pantalla, calificaciones y reseñas, consejos de usuarios y más juegos como Roblox."
  },
  {
    "title": "Roblox - Aplicaciones en Google Play",
    "url": "https://play.google.com/store/apps/details?id=com.roblox.client&hl=es",
    "snippet": "En Roblox hay algo para todo el mundo. Ya sea que quieras explorar, crear, jugar a juegos de rol, competir o pasar el rato con amigos, hay una cantidad infinita de experiencias inmersivas por..."
  },
  {
    "title": "Roblox - Windows - Descarga gratuita y reproducción en Windows ...",
    "url": "https://apps.microsoft.com/detail/9pmf91n3lz3m?hl=es-es&gl=US",
    "snippet": "Sep 11, 2025 · Roblox es el mejor universo virtual para crear, compartir experiencias con amigos y ser todo lo que puedas imaginar. Únete a millones de personas que exploran una gran variedad de experiencias inmersivas creadas por una comunidad global."
  },
  {
    "title": "Get Roblox - Windows | Xbox",
    "url": "https://www.xbox.com/en-us/games/store/roblox-windows/9pmf91n3lz3m",
    "snippet": "Roblox features full cross-platform support, meaning you can join your friends and millions of other people on their computers, mobile devices, Xbox One, or VR headsets. BE ANYTHING YOU CAN IMAGINE Be creative and show off your unique style! Customize your avatar with tons of hats, shirts, faces, gear, and more."
  },
  {
    "title": "NFS-e | Portal Contribuinte",
    "url": "https://www.nfse.gov.br/EmissorNacional/Login",
    "snippet": "Acesso com Certificado Digital Se você já possui certificado digital, clique na imagem abaixo Acesso via certificado digital Saiba como obter o certificado digital"
  }
]