[
  {
    "title": "heating entire house from basement | Hearth.com Forums Home",
    "url": "https://www.hearth.com/talk/threads/heating-entire-house-from-basement.91257/",
    "snippet": "Feb 15, 2009 · we are looking at buying a house that has a stone fireplace in the living room and a place in the basement to connect a woodstove, the house is 1456 sq ft on one floor and the basement is same sq. footage and completely open. was wondering if placing a woodstove in the basement wood supply..."
  },
  {
    "title": "Will a Wood Stove Smell-up The House??? - Hearth.com Forums",
    "url": "https://www.hearth.com/talk/threads/will-a-wood-stove-smell-up-the-house.50265/",
    "snippet": "Apr 22, 2010 · The latest road block on my way to burning wood in the house is that my Wife is afraid that the whole house will smell like wood smoke - everything, clothes, clothes in the closet, funiture, carpet, the dog, etc., and if she ain't happy, nobody is happy! Will a nice modern wood stove smell-up the house?"
  },
  {
    "title": "Tips on if Your pellet stove is burning lazy and or getting smoke in ...",
    "url": "https://www.hearth.com/talk/threads/tips-on-if-your-pellet-stove-is-burning-lazy-and-or-getting-smoke-in-the-house.11413/",
    "snippet": "Jan 6, 2006 · If you are getting smoke in the house or you stove just don’t seem to be burning like should. Check the door seal and latch for a tight fit. Check the ash pan for shut tight and latched If all doors seals are good and latched. MOST pellet stove are Negative air. (Inside of the Firebox is..."
  },
  {
    "title": "Creosote running down outside of pipe, inside of house",
    "url": "https://www.hearth.com/talk/threads/creosote-running-down-outside-of-pipe-inside-of-house.42298/",
    "snippet": "Nov 28, 2009 · The past few days, creosote is running down the outside of the pipe that is inside the house, between the ceiling and the stove. The exterior pipe looks fine. Also, this fall we had resealed around the pipe where it meets the roof. I appreciate your thoughts and suggestions to help us figure out what is going on. Englander 13 - This IS our furnace."
  },
  {
    "title": "Vermont casting dauntless | Hearth.com Forums Home",
    "url": "https://www.hearth.com/talk/threads/vermont-casting-dauntless.206923/",
    "snippet": "Feb 18, 2025 · I will start by saying that I have never spent so much time and effort into something and still lack proper understanding of operation. My frustration with this stove has been immeasurable. I just bought this stove, without a cat,this year as I moved into a new house, and replaced the old stove..."
  }
]