[
  {
    "title": "Finn | Adventure Time Wiki | Fandom",
    "url": "https://adventuretime.fandom.com/wiki/Finn",
    "snippet": "Finn Mertens (also known as Finn the Human) is the main protagonist in Adventure Time. He also appeared in the spin-off series Adventure Time: Distant Lands and returned in the spin-off series Adventure Time: Fionna & Cake. He was voiced by Jeremy Shada in most appearances."
  },
  {
    "title": "Finn HydroSeeders & Equipment - Finn Corporation",
    "url": "https://www.finncorp.com/",
    "snippet": "Today, FINN Corporation has a worldwide presence with more than 175 North American dealer and service locations, plus others in Australia, South America, Africa and Europe. Even as our network continues to expand, we will not forget our humble beginnings and our Midwestern roots."
  },
  {
    "title": "Finn the Human - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Finn_the_Human",
    "snippet": "Finn Mertens, better known as Finn the Human, is a character and one of the two protagonists, alongside Jake the Dog, of the American animated television series Adventure Time and its franchise created by Pendleton Ward."
  },
  {
    "title": "South Fin Grill - New American Restaurant",
    "url": "https://www.southfingrill.com/",
    "snippet": "From small weddings, Sweet 16s, and milestone birthdays to corporate galas, holiday parties, and team gatherings — our seaside setting, chef-inspired menus, and attentive event staff bring your vision to life. Make your next private or corporate event one to remember with the waves as your soundtrack and the Verrazzano Bridge as your view."
  },
  {
    "title": "Finn the Human - Adventure Time Wiki",
    "url": "https://theadventuretimepedia.fandom.com/wiki/Finn_the_Human",
    "snippet": "Finn the Human 'or and formerly known as Pen' in the Animated Short is the main protagonist of the series Adventure Time. As shown in \"Memories of Boom Boom Mountain,\" Finn appears to have been abandoned in the woods during infancy."
  }
]