[
  {
    "title": "bluelock.11manga.com",
    "url": "https://bluelock.11manga.com/comic/blue-lockchapter-155/",
    "snippet": "Nous voudrions effectuer une description ici mais le site que vous consultez ne nous en laisse pas la possibilité."
  },
  {
    "title": "I Am the Greatest (Athlete) Quiz | Britannica",
    "url": "https://www.britannica.com/quiz/i-am-the-greatest-athlete",
    "snippet": "Take this Encyclopaedia Britannica Sports and Recreation quiz to test your knowledge about the greatest athletes, across sports from boxing to swimming to basketball to athletics."
  },
  {
    "title": "Bing Sporting Greats Quiz – Test Your Sports Knowledge",
    "url": "https://mcqstestprep.com/bing-sporting-greats-quiz/",
    "snippet": "The Bing Sporting Greats Quiz challenges users to identify legendary athletes, iconic moments, and historic achievements from the world of sports. This quiz covers football, cricket, tennis, boxing, …"
  },
  {
    "title": "Bing Sporting Greats Quiz: 60 Questions and Answers",
    "url": "https://questmix.com/bing-sporting-greats-quiz/",
    "snippet": "Mar 11, 2025 · Ready to test your sporting knowledge against some of the greatest competitors who ever lived? The following quiz covers legendary figures from across the sporting world – from tennis …"
  },
  {
    "title": "Sporting Greats Quiz | Wide World of Sports | 15 Questions",
    "url": "https://www.funtrivia.com/trivia-quiz/Sports/Sporting-Greats-114595.html",
    "snippet": "5 days ago · This quiz will give you some details on some famous sporting figures from the world of sport, and you will have to guess who it is. A different sport is mentioned in each question."
  },
  {
    "title": "80 Sports Legends Trivia Quiz",
    "url": "https://triviaplane.com/80-sports-legends-trivia-quiz/",
    "snippet": "Test your knowledge with this fun trivia quiz questions with answers on some of the greatest sports legends of all time! From baseball to basketball, football to hockey, see how well you can identify …"
  }
]