[
  {
    "title": "USAJOBS - The Federal Government's Official Jobs Site",
    "url": "https://www.usajobs.gov/",
    "snippet": "USAJOBS is the Federal Government's official one-stop source for Federal jobs and employment information."
  },
  {
    "title": "USAJOBS - Search",
    "url": "https://www.usajobs.gov/search",
    "snippet": "Search features SEARCH FOR REMOTE JOBS Search for jobs that allow you to work full time from your home or an approved alternative worksite. What is a remote job? KEYWORD AND LOCATION Enter a keyword or location—Start typing and we'll offer suggestions to narrow your search. If you search by a city, we'll include jobs within a 25-mile radius. FILTERS Use one or more filters to search for jobs ..."
  },
  {
    "title": "USAJOBS Help Center - Open to the public",
    "url": "https://help.usajobs.gov/working-in-government/unique-hiring-paths/public",
    "snippet": "USAJOBS Help Center If you're a U.S. citizen or national you can apply to jobs that are open to the public."
  },
  {
    "title": "USAJOBS - Unique Career Paths",
    "url": "https://opm.usajobs.gov/explorecareerpaths/",
    "snippet": "We protect America from cross-border crime and illegal immigration that threaten national security and public safety."
  },
  {
    "title": "USAJOBS - Career Explorer",
    "url": "https://www.usajobs.gov/careerexplorer/",
    "snippet": "Find your fit with the USAJOBS Career Explorer You take a 32-question quiz that lasts 10-15 minutes We'll match you with careers in the federal government based on your interests You get science-based results and explore new opportunities"
  },
  {
    "title": "Change the size of text in Windows - Microsoft Support",
    "url": "https://support.microsoft.com/en-us/windows/change-the-size-of-text-in-windows-1d5830c3-eee3-8eaa-836b-abcc37d99b9a",
    "snippet": "Here's how to change the size of text, images, and apps in Windows. To change your display in Windows, select Start > Settings > Accessibility > Text size. To make only the text on your screen larger, adjust the slider next to Text size."
  }
]