[
  {
    "title": "Payrolls - SeeThroughNY",
    "url": "https://www.seethroughny.net/payrolls/",
    "snippet": "The Payrolls section provides a database of names, positions, salaries and/or total earnings for individuals who have been employed by New York State, New York City, state and regional public authorities, public school districts, and New York's county, city, town and village governments."
  },
  {
    "title": "SeeThroughNY :: New York City",
    "url": "https://www.seethroughny.net/data-notes/new-york-city/",
    "snippet": "DATA NOTES: New York City Payroll The New York City data (provided by the city Office of Payroll Administration, New York City Police Department and District Attorneys) includes names, positions and salaries of employees who worked for the city. NYC Payroll data reflects information that is current as of June 30 for the years 2008 through 2022. Other Notes: (1) Under the \"agency\" grouping for ..."
  },
  {
    "title": "SeeThroughNY :: Home",
    "url": "https://www.seethroughny.net/",
    "snippet": "WHAT'S NEW JANUARY 8, 2026 - Public authority payroll records for 70,342 employees in 2025, 93,487 employees in 2024, 88,194 employees in 2023 have been updated. DECEMBER 18, 2025 - FY25 Payroll data for 390,906 employees in New York School Districts (outside NYC) was posted today. DECEMBER 12, 2025 - Pension data for 21,170 members of the NYC Board of Education Retirement System has been ..."
  },
  {
    "title": "SeeThroughNY :: Contracts",
    "url": "https://www.seethroughny.net/contracts/police",
    "snippet": "The Contracts section allows users to search collective bargaining agreements between public employers and public employees, including teachers' unions, school superindents, police departments, fire departments, and public authorities. Click \"Download Contract\" to view the contract in PDF format."
  },
  {
    "title": "NYC Police Pension Fund - SeeThroughNY",
    "url": "https://www.seethroughny.net/data-notes/nyc-police-pension-fund/",
    "snippet": "DATA NOTES: NYC Police Pension Fund The New York City Police Pension Fund data, as provided by the New York City Police Pension Fund (NYCPPF), includes actual benefit rates (the actual amount they received during the year), retirement dates, and last known employers for every individual who collected benefits."
  },
  {
    "title": "Google",
    "url": "https://www.google.com/",
    "snippet": "Search the world's information, including webpages, images, videos and more. Google has many special features to help you find exactly what you're looking for."
  }
]