[
  {
    "title": "What is 2 plus 5? - Addition calculator",
    "url": "https://fractioncalculator.pro/calc/What-is_2_plus_5",
    "snippet": "Here you can find a addition calculator to add 2 to 5 or to add any other amount."
  },
  {
    "title": "Math Calculator",
    "url": "https://www.mathway.com/Calculator/math-calculator",
    "snippet": "Enter the expression you want to evaluate. The Math Calculator will evaluate your problem down to a final solution. You can also add, subtraction, multiply, and divide and complete any arithmetic you need. Click the blue arrow to submit and see your result!"
  },
  {
    "title": "Calculator",
    "url": "https://www.calculatorsoup.com/calculators/math/basic.php",
    "snippet": "Oct 29, 2025 · Use this basic calculator online for math with addition, subtraction, division and multiplication. The calculator includes functions for square root, percentage, pi, exponents, powers and rounding. How to do repeating operations, higher powers and roots, memory and clear functions for this standard calculator are explained below."
  },
  {
    "title": "2 + 5 | What is 2 plus 5? - calculeitor.com",
    "url": "https://calculeitor.com/2-plus-5",
    "snippet": "What is 2 plus 5? The sum of two plus five is equal to seven. We can also express that 2 plus 5 equals 7 as follows: What is 2 plus by other numbers? Find out what is 2 plus 5. Add 2 + 5. two plus five."
  },
  {
    "title": "What is sum of 2 and 5 | Number Line & Place Value method",
    "url": "https://www.askmathguru.com/addition/what-is-2-plus-5",
    "snippet": "What is sum of 2 and 5? The answer is 7. Add numbers using number line and place value method, video tutorial & instructions for each step."
  },
  {
    "title": "Cool Math Games - Free Online Games for Learning and Fun",
    "url": "https://www.coolmathgames.com/",
    "snippet": "Coolmath Games is a brain-training site for everyone, where logic & thinking & math meets fun & games. These games have no violence, no empty action, just a lot of challenges that will make you forget you're getting a mental workout!"
  }
]