[
  {
    "title": "Canberra weather in February 2026 | Canberra 14 day weather",
    "url": "https://www.weather25.com/oceania/australia/australian-capital-territory/canberra?page=month&month=February",
    "snippet": "Full weather forecast for Canberra in February 2026. Check the temperatures, chance of rain and more in Canberra during February."
  },
  {
    "title": "Canberra, ACT - Daily Weather Observations",
    "url": "https://www.bom.gov.au/climate/dwo/IDCJDW2801.latest.shtml",
    "snippet": "Canberra, Australian Capital Territory February 2026 Daily Weather Observations Observations from Canberra Airport."
  },
  {
    "title": "Weather in Canberra in February 2026 - Detailed Forecast",
    "url": "https://www.easeweather.com/oceania/australia/australian-capital-territory/canberra/february",
    "snippet": "19 hours ago · Discover the most accurate weather forecast for Canberra in February 2026. Insights into temperature, precipitation, and weather trends."
  },
  {
    "title": "February 2026 Daily Weather Forecast for Canberra, Australian …",
    "url": "https://www.weathertab.com/en/c/02/commonwealth-of-australia/australian-capital-territory/canberra/",
    "snippet": "Our Canberra, Australian Capital Territory Daily Weather Forecast for February 2026, developed from a specialized dynamic long-range model, provides precise daily temperature and rainfall …"
  },
  {
    "title": "Weather in Canberra in February 2026 (Australian Capital Territory ...",
    "url": "https://world-weather.info/forecast/australia/canberra/february-2026/",
    "snippet": "Canberra Weather Forecast for February 2026 is based on long term prognosis and previous years' statistical data. Wind direction chart for Canberra (daytime), based on February 2026 …"
  },
  {
    "title": "Canberra February 2026 Historical Weather Data (ACT, Australia ...",
    "url": "https://weatherspark.com/h/m/144442/2026/2/2026年2月-澳大利亚、澳大利亚首都领地、堪培拉-的历史天气",
    "snippet": "It features all historical weather data series we have available, including the Canberra temperature history for February 2026. You can drill down from year to month and even day …"
  }
]