[
  {
    "title": "PC não baixa e nem abre aplicativos. O que pode ser?",
    "url": "https://forum.techtudo.com.br/perguntas/328902/pc-nao-baixa-e-nem-abre-aplicativos-o-que-pode-ser",
    "snippet": "Olá! Não consigo mais baixar e nem abrir apps no meu PC. Não são todos, mas especialmente o aplicativo Discord e o jogo League of Legends. Já restaurei o PC, digitei comandos no cmd. Tô quase compr..."
  },
  {
    "title": "Não consigo iniciar o Windows. Erro:  system32/hal.dll",
    "url": "https://answers.microsoft.com/pt-br/windows/forum/windows_xp-windows_install/não-consigo-iniciar-o-windows-erro-windows/6a57728f-b260-4991-adaa-6e9a600e9b94",
    "snippet": "AO LIGAR O PC APARECE A SEGUINTE MENSAGEM:  system32/hal.dll . (DIZ QUE PRECISO INSTALAR UMA CÓPIA DESSE AQUIVO). AONDE ENCONTRO A CÓPIA DESSE ARQUIVO ? O QUE DEVO FAZER PARA TER O MEU WINDOWS COMO QUANDO COMPREI MEU PC ? DESDE DE JÁ, MUITO OBRIGADO."
  },
  {
    "title": "Microsoft Community",
    "url": "https://www.answers.microsoft.com/?dg=microsoft.public.windowsupdate&p=1",
    "snippet": "Microsoft Community"
  },
  {
    "title": "Windows 10 não reconhece drive cd/dvd? - Fórum TechTudo",
    "url": "https://forum.techtudo.com.br/perguntas/216241/windows-10-nao-reconhece-drive-cddvd",
    "snippet": "Se diz sobre o Windows 10, ouve-se dizer que o mesmo não reconhece o drive cd/dvd, que temos de usar programas adicionais pra isso, enquanto que no Windows 7 o drive funciona normal. Se sim, será q..."
  },
  {
    "title": "Configurar repetidor Bright - Fórum TechTudo",
    "url": "https://forum.techtudo.com.br/perguntas/196488/configurar-repetidor-bright",
    "snippet": "Desculpem-me, não consegui conectá-lo, conforme o manual e apenas conectei um cabo de rede nele e liguei na tomada elétrica. Funcionou como um extensor do sinal, porém não atendeu totalmente as necessidades. Agora tentei ligá-lo novamente e nem os leds que tem acendem. Tentei em um botão tipo reset que existe e nada. Alguma dica? Já perguntei ao fabricante também e aguardo resposta ..."
  },
  {
    "title": "Download the YouTube mobile app",
    "url": "https://support.google.com/youtube/answer/3227660?hl=en&co=GENIE.Platform=Android",
    "snippet": "Download the YouTube app for a richer viewing experience on your smartphone."
  }
]