[
  {
    "title": "Ativar ou desativar o Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/ativar-ou-desativar-o-bluetooth-no-windows-9e92fddd-4e12-e32b-9132-5e36bdb2f75a",
    "snippet": "Saiba o passo para ativar ou desativar o Bluetooth no Windows com a aplicação Definições, as definições rápidas e o centro de …"
  },
  {
    "title": "Emparelhar um dispositivo Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/emparelhar-um-dispositivo-bluetooth-no-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
    "snippet": "Emparelhar um dispositivo Bluetooth Emparelhar uma impressora Bluetooth ou um scanner Emparelhar um dispositivo Bluetooth usando o …"
  },
  {
    "title": "Pair a Bluetooth device in Windows - Microsoft Support",
    "url": "https://support.microsoft.com/en-us/windows/pair-a-bluetooth-device-in-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
    "snippet": "All kinds of Bluetooth devices can be paired with a Windows device including: Keyboards and mice. Phones. Speakers and headphones. …"
  },
  {
    "title": "Corrigir problemas de Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/corrigir-problemas-de-bluetooth-no-windows-723e092f-03fa-858b-5c80-131ec3fba75c",
    "snippet": "Executar a resolução de problemas do Windows Bluetooth Se estiver a utilizar um dispositivo Windows 11, comece por executar a resolução …"
  },
  {
    "title": "Encontrar e configurar dispositivos Bluetooth próximos ao seu aparelh…",
    "url": "https://support.google.com/android/answer/9417604?hl=pt-BR",
    "snippet": "Confira se a localização e o Bluetooth do smartphone estão ativados. Dica: seu smartphone não consegue encontrar e …"
  },
  {
    "title": "Gmail - Email from Google",
    "url": "https://mail.google.com/mail",
    "snippet": "Gmail is email that's intuitive, efficient, and useful. 15 GB of storage, less spam, and mobile access."
  }
]