[
  {
    "title": "Matches | ICC Men's T20 World Cup, 2026 | ICC",
    "url": "https://www.icc-cricket.com/tournaments/mens-t20-world-cup-2026/matches",
    "snippet": "Official ICC Men’s T20 World Cup, 2026 website – live cricket scores, fixtures, results, teams, rankings, news, videos and exclusive updates from the International Cricket Council."
  },
  {
    "title": "ICC Men's T20 World Cup 2026 - Cricket Schedule & Results",
    "url": "https://www.espncricinfo.com/series/icc-men-s-t20-world-cup-2025-26-1502138/match-schedule-fixtures-and-results",
    "snippet": "Track latest match scores, schedule, and results of ICC Men's T20 World Cup."
  },
  {
    "title": "ICC Men's T20 World Cup 2026 schedule, live scores and results",
    "url": "https://www.cricbuzz.com/cricket-series/11253/icc-mens-t20-world-cup-2026/matches",
    "snippet": "ICC Men's T20 World Cup 2026 Schedule, Match Timings, Venue Details, Upcoming Cricket Matches and Recent Results on Cricbuzz.com"
  },
  {
    "title": "ICC T20 World Cup 2026: Check Full Schedule, Teams, Groups ... - News18",
    "url": "https://www.news18.com/cricket/icc-t20-world-cup-2026-dates-venues-full-match-schedule-released-aa-ws-bl-9875674.html",
    "snippet": "17 hours ago · ICC T20 World Cup Full Schedule: The 20-team competition will be held across venues in India and Sri Lanka over a four-week window."
  },
  {
    "title": "ICC T20 World Cup 2026 schedule: Dates, fixtures, groups and full list ...",
    "url": "https://www.cricketnews.com/en/cricket/news/icc-t20-world-cup-2026-schedule-dates-groups-matches-t20-wc/58c95fecc3a35da6729e03d4",
    "snippet": "ICC T20 World Cup groups and schedule announced The countdown has begun for the upcoming edition of the T20 World Cup, which will be co-hosted by Asian giants India and Sri Lanka."
  },
  {
    "title": "Argos | Order online today for fast home delivery",
    "url": "https://www.argos.co.uk/",
    "snippet": "Argos Care policies are provided by Domestic & General Insurance PLC, who are an insurer not an intermediary. They have not given you a personal recommendation as to whether this policy is suitable for your needs."
  }
]