[
  {
    "title": "The world's best hospital - Mayo Clinic",
    "url": "https://www.mayoclinic.org/",
    "snippet": "Mayo Clinic is the No. 1 hospital in the world according to Newsweek. Learn more about our top-ranked specialties. We make it easy for patients around the world to get care from Mayo Clinic. Learn more about Mayo Clinic locations or choose a specific location. We solve the world's most serious and complex medical challenges. Double your impact!"
  },
  {
    "title": "Mayo Clinic Patient Portal",
    "url": "https://onlineservices.mayoclinic.org/",
    "snippet": "Access Mayo Clinic's online services for appointments, medical records, and more."
  },
  {
    "title": "Patient portal: Connect to care online - Mayo Clinic Health System",
    "url": "https://www.mayoclinichealthsystem.org/patient-online-services",
    "snippet": "Refill Mayo Clinic prescriptions at select Mayo Clinic pharmacies. Share Mayo Clinic health information with a non-Mayo Clinic app. Need help? If you need support for the patient portal or Mayo Clinic app, visit the Mayo Clinic Patient Portal Assistance page or call us at 1-877-858-0398."
  },
  {
    "title": "Log in to Mayo Clinic",
    "url": "https://test.onlineservices.mayoclinic.org/patientportal",
    "snippet": "Forgot username or password? Don't have an account? Create one now. Online support can be found under Account help. Use of this site signifies your agreement to the terms of use. © 1998 - 2026 Mayo Foundation for Medical Education and Research. All rights reserved."
  },
  {
    "title": "MAYO.ORG",
    "url": "https://www.mayo.org/",
    "snippet": "Copyright © MAYO.ORG. All rights reserved. Privacy Policy."
  },
  {
    "title": "ChatGPT Desktop Application (Mac, Windows and Linux) - GitHub",
    "url": "https://github.com/lencx/ChatGPT",
    "snippet": "Thank you very much for your interest in this project. OpenAI has now released the macOS version of the application, and a Windows version will be available later (Introducing GPT-4o and more tools to ChatGPT free users). If you prefer the official application, you can stay updated with the latest information from OpenAI."
  }
]