[
  {
    "title": "No o Nó - WordReference Forums",
    "url": "https://forum.wordreference.com/threads/no-o-nó.1564724/",
    "snippet": "Oct 16, 2009 · No se trata de ningún «truco mágico»; son, simplemente, lógica y razón lingüísticas. Podría explicarte todos mis métodos o «trucos» (lo cual me llevaría un tiempo y un esfuerzo... ), pero preferiría que los descubrieses por ti mismo (se aprende mejor así). Si no eres capaz, envíame un mensaje privado y haré los honores. Saludos."
  },
  {
    "title": "No sé por qué / No sé porqué - WordReference Forums",
    "url": "https://forum.wordreference.com/threads/no-sé-por-qué-no-sé-porqué.3415837/",
    "snippet": "Jan 21, 2018 · Es No sé por qué. En esta oración, por es una preposición que expresa causa o motivo y qué es un pronombre interrogativo 1 que representa aquello que se ignora. Esta frase es equivalente a por cuál motivo, por cuál causa. La palabra porqué es un sustantivo que significa razón, motivo, causa y no se podría usar en una oración como la que propones. Sí sería posible en cambio en una ..."
  },
  {
    "title": "no ... no ... no / no, no, no [punctuation] - WordReference Forums",
    "url": "https://forum.wordreference.com/threads/no-no-no-no-no-no-punctuation.2613140/",
    "snippet": "Apr 8, 2013 · The first one tells me those are two desperate no's cried out in isolation with a big time gap between them. That seems logical in view of what follows. In the second sentence the time gap between the no's looks smaller to me and I am left with the impression that those are your casual every-day no-no's that indicate the speaker, while disagreeing, is unimpressed by the prospect of being ..."
  },
  {
    "title": "No, they won't. / No, they're not. - WordReference Forums",
    "url": "https://forum.wordreference.com/threads/no-they-wont-no-theyre-not.3996894/",
    "snippet": "Jan 8, 2023 · A: No, they won't. Both forms express something that the speakers currently believe {will/will not}/ {is going to/is not going to} happen at some time in the future."
  },
  {
    "title": "Punctuation: No. - omit full stop or not? - WordReference Forums",
    "url": "https://forum.wordreference.com/threads/punctuation-no-omit-full-stop-or-not.2769510/",
    "snippet": "Jan 15, 2014 · There is a thread that discusses the abbreviation for 'number': Abbreviation of number - N, N°, Nr, Nbr, No? where the punctuation is discussed peripherally. I write Mr, Dr, etc. without full stops but I generally still write No. with the stop. I have also seen it without."
  },
  {
    "title": "Google Help",
    "url": "https://support.google.com/?hl=en",
    "snippet": "If you're having trouble accessing a Google product, there's a chance we're currently experiencing a temporary problem. You can check for outages and downtime on the Google Workspace Status Dashboard."
  }
]