[
  {
    "title": "Best Amazon Layoffs Posts - Reddit",
    "url": "https://www.reddit.com/t/amazon_layoffs/",
    "snippet": "Amazon CFO Celebrates a Record-Breaking year after mass layoffs So Amazon posts revenue of 170 billion but laid off over 27k workers (and counting) in the past year? Wondering who else saw this …"
  },
  {
    "title": "Anyone have any experience with Amazon Used? - Reddit",
    "url": "https://www.reddit.com/r/BuyItForLife/comments/192rd4f/anyone_have_any_experience_with_amazon_used/",
    "snippet": "Amazon has like 83,423 products with many of them having used versions for sale. Aunt Tilly's experience with her used television is 100% not going to help you with your experience with your …"
  },
  {
    "title": "Why is Amazon so bad now? What happened? : r/amazonprime - Reddit",
    "url": "https://www.reddit.com/r/amazonprime/comments/1aqz3kg/why_is_amazon_so_bad_now_what_happened/",
    "snippet": "Feb 14, 2024 · Amazon used to be so good years ago. Then it seems like overnight, everything started coming from China and was really bad quality. Anyone can sell on Amazon, and there are sellers …"
  },
  {
    "title": "Amazon - Reddit",
    "url": "https://www.reddit.com/r/amazon/about/",
    "snippet": "Welcome to /r/Amazon Please try to focus on community-oriented content, such as news and discussions, instead of individual-oriented content. If you have questions or need help, please use …"
  },
  {
    "title": "Tip To Download Amazon Order/Return Information, Chat History, etc.",
    "url": "https://www.reddit.com/r/amazonprime/comments/197rgdm/tip_to_download_amazon_orderreturn_information/",
    "snippet": "Tip To Download Amazon Order/Return Information, Chat History, etc. Ever since Amazon got rid of order report functionality last year, I’ve been trying to find an easy way to export my order history."
  },
  {
    "title": "Scary mail from ofm@amazon.com? : r/amazonprime - Reddit",
    "url": "https://www.reddit.com/r/amazonprime/comments/128otcb/scary_mail_from_ofmamazoncom/",
    "snippet": "Why is Amazon blatantly lying about damaged or used goods when the items I sent back were still sealed in original manufacturers packaging? And the end of the email they specifically said \" …"
  }
]