[
  {
    "title": "Pesquisa de Jurisprudência",
    "url": "https://www.stj.jus.br/sites/portalp/paginas/Sob-medida/Advogado/Jurisprudencia/Pesquisa-de-Jurisprudencia.aspx",
    "snippet": "Aqui você encontra a jurisprudência do STJ disponível nas bases de acórdãos, súmulas, decisões monocráticas e Informativo de Jurisprudência. Também é possível consultar alguns acórdãos do extinto Tribunal Federal de Recursos – TFR."
  },
  {
    "title": "Pesquisar Jurisprudência do STJ (Superior Tribunal de Justiça)",
    "url": "https://www.jusbrasil.com.br/jurisprudencia/stj/",
    "snippet": "Você pode consultar e pesquisar a Jurisprudência de mais de 96 tribunais, inclusive do Supremo Tribunal Federal (STF) e dos Tribunais Superiores (STJ, TST, TSE, TSM), em uma busca unificada, diretamente no campo Jusbrasil."
  },
  {
    "title": "STJ - Jurisprudência do STJ",
    "url": "https://scon.stj.jus.br/SCON/",
    "snippet": "STJ - Jurisprudência do STJ"
  },
  {
    "title": "Jurisprudência | Pesquisar e Consultar no Jusbrasil",
    "url": "https://www.jusbrasil.com.br/jurisprudencia/",
    "snippet": "Jurisprudência é o conjunto de decisões dos tribunais que, ao se repetirem sobre o mesmo assunto, formam um entendimento jurídico que serve de referência para casos semelhantes. Na prática, ela funciona como um \"norte\" interpretativo: mostra como a lei vem sendo aplicada em casos semelhantes."
  },
  {
    "title": "STJ - Superior Tribunal de Justiça",
    "url": "https://www.stj.jus.br/sites/portalp/Inicio",
    "snippet": "O Superior Tribunal de Justiça é o órgão do Poder Judiciário do Brasil que assegura efetivamente a uniformidade à interpretação da legislação federal."
  },
  {
    "title": "什么是design in？design win？_百度知道",
    "url": "https://zhidao.baidu.com/question/1587493290878514940.html",
    "snippet": "Nov 3, 2024 · 设计在（Design In）与设计赢（Design Win）是设计领域中两个重要的概念，它们描述了设计过程的不同阶段，以及设计在产品开发和市场竞争中的角色。 设计在（Design In）指的是设计公司或设计团队向客户提供设计解决方案，供客户选择。这种合作关系中，设计团队负责提出具有创新性和功能性的设计 ..."
  }
]