[
  {
    "title": "Parts per Million (ppm) and Parts per Billion (ppb) - UCalgary ...",
    "url": "https://chem-textbook.ucalgary.ca/chapter-3-main/parts-per-million-ppm-and-parts-per-billion-ppb/",
    "snippet": "Very low solute concentrations are often expressed using appropriately small units such as parts per million (ppm) or parts per billion (ppb). Like percentage (“part per hundred”) units, ppm and ppb may be defined in terms of masses, volumes, or mixed mass-volume units."
  },
  {
    "title": "PPB - Online Services Portal",
    "url": "https://practice.pharmacyboardkenya.org/",
    "snippet": "Pharmacy and Poisons Board Online Services Portal. Apply for the following services online: Indexing, Exams, Registration, Retention/Renewals among other services. Update your professional details and contact details and stay updated by subscribing to regular updates from the board."
  },
  {
    "title": "PPM and PPB Formula Explained (With Examples and Conversions)",
    "url": "https://ppmcalculator.com/ppm-and-ppb-formula/",
    "snippet": "Nov 4, 2025 · If you’ve ever seen measurements in ppm or ppb and wondered what they mean, you’re in the right place. These two units — parts per million (ppm) and parts per billion (ppb) — are essential in chemistry, water testing, and environmental science."
  },
  {
    "title": "ppm to ppb conversion | number conversion - RapidTables.com",
    "url": "https://www.rapidtables.com/convert/number/ppm-to-ppb.html",
    "snippet": "ppm to ppb conversion calculator & how to convert."
  },
  {
    "title": "PPM to PPB Converter - Inch Calculator",
    "url": "https://www.inchcalculator.com/ppm-to-ppb-converter/",
    "snippet": "Use our ppm to ppb calculator to convert a concentration in parts per million to parts per billion, plus learn the conversion formula."
  },
  {
    "title": "Parts per billion (ppb) Definition - Intro to Chemistry Key Term | Fiveable",
    "url": "https://fiveable.me/key-terms/intro-chem/parts-per-billion-ppb",
    "snippet": "Parts per billion (ppb) is a unit of measurement used to express the concentration of one substance in a solution. It denotes one part of solute per billion parts of the total solution."
  }
]