[
  {
    "title": "Leverock's Great Seafood - St. Petersburg, FL",
    "url": "https://leverocks.com/",
    "snippet": "Since 1948, Leverock's has been providing quality, value, and service. Our dining room is casual, so come as you are. We are located just off of St. Pete Beach in the South Pasadena area of St. Petersburg, Florida. See you soon!"
  },
  {
    "title": "Leverock's Great Seafood - St. Petersburg, FL - Yelp",
    "url": "https://www.yelp.com/biz/leverocks-great-seafood-st-petersburg",
    "snippet": "Specialties: We are a casual seafood restaurant with full service and full bar. Established in 1948. Johnny Leverock opened an oyster bar in 1948, after winning local oyster beds in a poker game. It grew into a full service family restaurant over the years. In 1978, following Johnny's death, the Leverock family acquired a management team which bought the restaurant in 1980. Over the next two ..."
  },
  {
    "title": "LEVEROCK'S GREAT SEAFOOD, South Pasadena - Tripadvisor",
    "url": "https://www.tripadvisor.com/Restaurant_Review-g11695415-d1901530-Reviews-Leverock_s_Great_Seafood-South_Pasadena_Florida.html",
    "snippet": "Leverock's Great Seafood, South Pasadena: See 957 unbiased reviews of Leverock's Great Seafood, rated 4.4 of 5 on Tripadvisor and ranked #1 of 13 restaurants in South Pasadena."
  },
  {
    "title": "Menu for Leverock's Great Seafood in St. Petersburg, FL - Sirved",
    "url": "https://www.sirved.com/restaurant/south_pasadena-florida-usa/leverocks-great-seafood/540339/menus",
    "snippet": "Dive into the menu of Leverock's Great Seafood in St. Petersburg, FL right here on Sirved. Get a sneak peek of your next meal."
  },
  {
    "title": "Leverock's Great Seafood, Saint Petersburg - Restaurantji",
    "url": "https://www.restaurantji.com/fl/saint-petersburg/leverocks-great-seafood-/",
    "snippet": "Latest reviews, photos and ratings for Leverock's Great Seafood at 840 Pasadena Ave S in Saint Petersburg - view the menu, hours, phone number, address and map."
  },
  {
    "title": "Helvetica Font Family Fonts - 16 Free Fonts | Download Free ...",
    "url": "https://www.cufonfonts.com/kurt-lorenz/collection/helvetica",
    "snippet": "Font-Face Web fonts & TTF-OTF Download Add to List"
  }
]