[
  {
    "title": "O que fazer em Miami – 42 dicas incríveis para aproveitar a cidade!",
    "url": "https://www.melhoresdestinos.com.br/miami-dicas-o-que-fazer.html",
    "snippet": "Feb 4, 2021 · Confira nossas dicas de Miami, saiba o que fazer por lá, onde se hospedar e muito mais!"
  },
  {
    "title": "Miami: Dicas de quando ir, onde ficar e comer, o que fazer",
    "url": "https://www.viajenaviagem.com/destino/miami/",
    "snippet": "Encontre aqui dicas para curtir a Miami dos outlets e das artes, dos bons restaurantes e hotéis."
  },
  {
    "title": "Pacotes de Viagens para Miami | Pacotes Turisticos na Decolar",
    "url": "https://www.decolar.com/pacotes/mia/pacotes-para-miami",
    "snippet": "Comece a sua viagem com tudo já pronto e prepare-se para guardar lembranças eternas. Faça as suas reservas no Decolar, a maior agência de viagens do Brasil e da América Latina, e desfrute de experiências únicas com os seus pacotes de viagens para Miami."
  },
  {
    "title": "Voos para Miami desde BRL 2811.01 com a LATAM",
    "url": "https://www.latamairlines.com/br/pt/destinos/estados-unidos/voos-para-miami",
    "snippet": "Explore as melhores ofertas de voos para Miami, Estados Unidos. Reserve sua viagem para Miami com a passagem aérea mais barata e viva a experiência LATAM."
  },
  {
    "title": "Miami: o que visitar e fazer | Roteiro 2, 3, 4 e 5 dias",
    "url": "https://www.vagamundos.pt/visitar-miami-roteiro/",
    "snippet": "O que visitar em Miami | Flórida: guia com o que ver e fazer, roteiro de 2, 3, 4 e 5 dias para visitar Miami, onde ficar, mapa, dicas viagem."
  },
  {
    "title": "XVideos: The best free porn site - Reddit",
    "url": "https://www.reddit.com/r/xvideos/about/",
    "snippet": "Porn from xvideos.com, nothing else. All posts must be either a link to xvideos.com, or an image/gif with a link to xvideos.com somewhere in the post or comment section. OC creators may flair their posts as OC. Only post links in your own posts' comment sections. Posting links in comment sections on posts that are not yours will be considered spam. No incivility or trolling. Follow Reddit's ..."
  }
]