[
  {
    "title": "Steam Workshop::WITCHES' REVEL Deckbuilding Table",
    "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=3491852748",
    "snippet": "Jun 1, 2025 路 This mod is a table that contains playsets of every card in WITCHES' REVEL, a card game currently in playtest. You can use this table to create & save your deck, and then play with it in the main WITCHES' REVEL Playtest mod."
  },
  {
    "title": "After patch soldier ability revel in slaughter not working",
    "url": "https://steamcommunity.com/app/2186680/discussions/0/591758807774794418/",
    "snippet": "Dec 27, 2024 路 After 1.3.1.6 on Rykad Phili the ability revel in slaughter does not count kills. Anyone noticed this bug?"
  },
  {
    "title": "Grand Revel Party Setup :: Idle Champions of the Forgotten Realms ...",
    "url": "https://steamcommunity.com/app/627690/discussions/0/3377008022034268875/",
    "snippet": "Feb 18, 2018 路 Grand Revel Party Setup So far, I've found two really good party setups for the Grand Revel, so I figured that I'd share, and see if other folks have their own arrangements that they'd like to share. The two party setups are a starter, and one for late-game. Starting Setup (listed from back to front, top to bottom): Back Row: Tyril 2nd Row:"
  },
  {
    "title": "The Darkest Dungeon 101 - All You Need to Know - Steam Community",
    "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=2813244137",
    "snippet": "May 28, 2022 路 Everything a beginner needs to know when starting their first gameplay. Tips, tricks, strategies, dungeons and curios descriptions + effective party builds. All that will save you from a lot of grindi"
  },
  {
    "title": "Steam Community :: Idle Champions of the Forgotten Realms",
    "url": "https://steamcommunity.com/app/627690/",
    "snippet": "Idle Champions of the Forgotten Realms - Recruit legendary Champions for the ultimate endless adventure!Idle Champions of the Forgotten Realms is a strategy management game that unites iconic Champions from D&D TRPG campaigns, video games, novels, actual plays, comic books, and shows into a grand adventure. Optimize formations using over 140 Champions, each with unique abilities, to defeat ..."
  }
]