[
  {
    "title": "Welcome to DBPR Online Services (login.login) - MyFloridaLicense.com",
    "url": "https://www.myfloridalicense.com/datamart/loginFLDBPR.do",
    "snippet": "Need Help Creating An Account?"
  },
  {
    "title": "MyFloridaLicense.com – License efficiently. Regulate fairly.",
    "url": "https://www2.myfloridalicense.com/",
    "snippet": "Do I Need a License? Search DBPR records for businesses and professionals licensed by the department. Users can verify licenses by name or license number."
  },
  {
    "title": "Online Services – MyFloridaLicense.com",
    "url": "https://www2.myfloridalicense.com/online-services/",
    "snippet": "To apply for a business or profession license. Verify a business or profession license. Search and find applicants, licensed individuals and businesses within the Food and Lodging industry that are regulated by the Department of Business and Professional Regulation. Request public records."
  },
  {
    "title": "General DBPR information: - myfloridalicense.custhelp.com",
    "url": "https://myfloridalicense.custhelp.com/app/answers/detail/a_id/2218/~/general-dbpr-information:",
    "snippet": "Dec 17, 2014 · How do I find the renewal requirements for a previous renewal cycle on the Department’s portal at www.myfloridalicense.com? Is the 60 months counted from the post mark date or the date of receipt of the application?"
  },
  {
    "title": "MyFlorida.com - The Official Portal of the State of Florida",
    "url": "https://www.myflorida.gov/",
    "snippet": "An online telephone and email directory for State Government agencies and employees in Florida."
  },
  {
    "title": "Como entrar direto na caixa de entrada do Hotmail - CCM",
    "url": "https://br.ccm.net/faq/18241-entrar-direto-na-caixa-de-entrada-do-hotmail",
    "snippet": "Mar 22, 2022 · Assim, sempre que você quiser entrar na caixa de entrada do Hotmail, basta digitar Outlook na barra de endereços e clicar sobre a página para que a caixa de entrada abra. Para ficar ainda mais fácil, você pode salvar a página da caixa de entrada aberta nos favoritos do navegador (ou navegadores)."
  }
]