[
  {
    "title": "Georgian College - Experience MORE.",
    "url": "https://www.georgiancollege.ca/",
    "snippet": "Georgian’s 17 new programs—a mix of certificates, diplomas, graduate certificates and degrees—will help get you job-ready for today’s workforce, and meet the demands of local employers!"
  },
  {
    "title": "Georgian College: Accelerate your success",
    "url": "https://www.georgiancollege.ca/georgian-college/",
    "snippet": "Georgian's leadership in co-op, student work experience and entrepreneurship education will accelerate your learning, your career and your future."
  },
  {
    "title": "2026-27 Programs < Georgian College Academic Catalogue",
    "url": "https://cat.georgiancollege.ca/programs/",
    "snippet": "This page lists all Georgian College programs in alphabetical order. To access a program outline, click on the desired program link. Academic and Career Entrance Acupuncture Addictions and Mental Health Advanced Care Paramedic Advertising and Marketing Communications Anishnaabemowin and Program Development Architectural Technician Architectural ..."
  },
  {
    "title": "Georgian College and Meta collaborate on intelligent tutoring system ...",
    "url": "https://www.georgiancollege.ca/blog/newsroom/georgian-and-meta-collaborate-on-intelligent-tutoring-system-using-ai/",
    "snippet": "Jan 21, 2025 · Georgian is among the first Canadian colleges to team up with Meta to advance the development of Intelligent Tutoring Systems (ITS) using Generative AI (GenAI) and extended reality (XR). From left to right: Brunilda Xhaferllari, Rob Theriault, Dr. Sean Madorin and Sanjeev Kumar."
  },
  {
    "title": "How to register for full-time or part-time courses - Georgian College",
    "url": "https://www.georgiancollege.ca/admissions/register/",
    "snippet": "If you are a new or returning student, getting ready to register at Georgian is an exciting period of time. Find out everything you need to know about registering for your courses in Banner."
  }
]