[
  {
    "title": "Health Insurance Premium Payment Program (HIPP)",
    "url": "https://medicaid.georgia.gov/programs/third-party-liability/health-insurance-premium-payment-program-hipp",
    "snippet": "Georgia Medicaid members who are employed may be eligible for health insurance premium assistance through a Medicaid program called the Health Insurance Premium Payment Program (HIPP)."
  },
  {
    "title": "Apply for Medicaid Health Insurance Premium Payment Program (HIPP ...",
    "url": "https://www.pa.gov/services/dhs/apply-for-medicaid-health-insurance-premium-payment-program-hipp",
    "snippet": "HIPP helps families with at least one person enrolled in Medicaid pay for private health insurance offered through an employer. Through HIPP, the state purchases cost-effective, employer-sponsored health insurance for Medicaid recipients."
  },
  {
    "title": "Welcome to HiPP International",
    "url": "https://www.hipp.com/",
    "snippet": "That is the reason why our organic products are of extraordinary quality and produced without genetically modified raw materials according to the European Union’s regulation for organic production. HiPP organic quality. HiPP sustainability management."
  },
  {
    "title": "Health Insurance Premium Payment Program - Health & Human Services",
    "url": "https://hhs.iowa.gov/medicaid/plans-programs/fee-service/health-insurance-premium-payment-program",
    "snippet": "The Health Insurance Premium Payment (HIPP) program is one of the services available to people who get Medicaid (Title 19). It saves the State of Iowa money."
  },
  {
    "title": "Cost Avoidance / Health Insurance Premium Payment (HIPP) - DHCS",
    "url": "https://www.dhcs.ca.gov/services/Pages/TPLRD_CAU_cont.aspx",
    "snippet": "Jun 9, 2025 · The Health Insurance Premium Payment (HIPP) program is a voluntary program for qualified members with full scope Medi-Cal coverage. HIPP approved Medi-Cal eligible members shall receive services that are unavailable from third party coverage and offered by Medi-Cal. Members with restricted Medi-Cal coverage are not eligible for the HIPP program."
  }
]