[
  {
    "title": "Microsoft – AI, Cloud, Productivity, Computing, Gaming & Apps",
    "url": "https://www.microsoft.com/en-us",
    "snippet": "Explore Microsoft products and services and support for your home or business. Shop Microsoft 365, Copilot, Teams, Xbox, Windows, Azure, Surface and more."
  },
  {
    "title": "Microsoft account | Sign In or Create Your Account Today – Microsoft",
    "url": "https://account.microsoft.com/account",
    "snippet": "Get access to free online versions of Outlook, Word, Excel, and PowerPoint."
  },
  {
    "title": "Office 365 login",
    "url": "https://www.office.com/",
    "snippet": "Collaborate for free with online versions of Microsoft Word, PowerPoint, Excel, and OneNote. Save documents, spreadsheets, and presentations online, in OneDrive."
  },
  {
    "title": "Microsoft campus - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Microsoft_campus",
    "snippet": "The Microsoft campus is the corporate headquarters of Microsoft Corporation, located in Redmond, Washington, United States, a part of the Seattle metropolitan area. Microsoft initially moved onto the grounds of the campus on February 26, 1986, shortly before going public on March 13. The headquarters has undergone multiple expansions since its establishment and is presently estimated to ..."
  },
  {
    "title": "Microsoft Redmond Campus Refresh",
    "url": "https://www.redmond.gov/386/Microsoft-Redmond-Campus-Refresh",
    "snippet": "Jun 28, 2025 · Microsoft’s 500-acre campus is a unique asset to the company as well as the community. Neighboring a vibrant urban core, lakes, mountains, and miles of forest, it’s one of Microsoft’s crown jewels. As they continue to grow and look to create the best workplace in the tech sector, Microsoft will invest right here in Redmond, their home for more than 30 years."
  },
  {
    "title": "Dow Jones INDEX TODAY | DJIA LIVE TICKER | Dow Jones QUOTE & CHART ...",
    "url": "https://markets.businessinsider.com/index/dow_jones",
    "snippet": "1 day ago · Dow Jones Today: Get all information on the Dow Jones Index including historical chart, news and constituents."
  }
]