[
  {
    "title": "Haifa - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Haifa",
    "snippet": "Medieval Haifa, or Haifa el-Atika, is the former site of Haifa as it existed during the Fatimid (11-12th centuries), Crusader (12th–13th centuries), Mamluk (13th–16th centuries) and early Ottoman …"
  },
  {
    "title": "Haifa | Israel, Map, History, & Facts | Britannica",
    "url": "https://www.britannica.com/place/Haifa",
    "snippet": "Jan 17, 2026 · Haifa, city, northwestern Israel. The principal port of the country, it lies along the Bay of Haifa overlooking the Mediterranean Sea. The city is situated on the northern slopes of Mount …"
  },
  {
    "title": "Haifa: History & Overview - Jewish Virtual Library",
    "url": "https://www.jewishvirtuallibrary.org/israel-wing/geography/other-34/history-and-overview-of-haifa",
    "snippet": "Haifa is Israel’s third largest city and the main port and the commercial and administrative center of the north of the country. The city extends over the northwest side of Mt. Carmel and the coastal strip at …"
  },
  {
    "title": "Is Haifa Worth Visiting? Best Things To Do in 2025",
    "url": "https://mukikapupstravels.com/must-see-spots-haifa-israel/",
    "snippet": "Feb 20, 2021 · Haifa is the third largest city in Israel after Tel Aviv and Jerusalem. It’s located on Mt. Carmel in Northern Israel, about an hour by train from Tel Aviv. Haifa is a great place to start …"
  },
  {
    "title": "Haifa - Visit Israel",
    "url": "https://israel.travel/Haifa/",
    "snippet": "Haifa is Israel’s third-largest city, Israel’s chief port and home to 400,000. Draped around the slopes of biblical Mount Carmel, it is a 100-year-old city whose importance burgeoned in the 1920’s and 1930’s …"
  },
  {
    "title": "Haifa – Travel guide at Wikivoyage",
    "url": "https://en.wikivoyage.org/wiki/Haifa",
    "snippet": "Haifa is an important transportation, industrial and cultural center and one of Israel's most important maritime trade centers. Haifa is home to Jews, Muslim and Christian Arabs, as well as small …"
  }
]