[
  {
    "title": "Editar hojas de cálculo en línea de forma gratuita | Microsoft Excel ...",
    "url": "https://excel.cloud.microsoft/es-es/?wdOrigin=MARKETING.FREE.GO-TO-EXCEL",
    "snippet": "Crea y edita hojas de cálculo en línea con Microsoft Excel para la Web. Formato, análisis y colaboración en tiempo real fáciles desde cualquier dispositivo."
  },
  {
    "title": "Software de hojas de cálculo gratuito online: Excel | Microsoft 365",
    "url": "https://www.microsoft.com/es-ar/microsoft-365/excel",
    "snippet": "Microsoft Excel es la aplicación líder en hojas de cálculo y análisis de datos en el sector. Descubre herramientas gratuitas de hojas de cálculo con funciones avanzadas en Excel."
  },
  {
    "title": "Microsoft Excel - Descargar",
    "url": "https://microsoft-excel.softonic.com/",
    "snippet": "Dec 19, 2024 · Microsoft Excel para Windows es la herramienta de hojas de cálculo más popular disponible. Es sinónimo de organizar y analizar datos de manera eficiente y es tan valorado por las empresas que la competencia en Microsoft Excel a menudo se requiere en las ofertas de trabajo."
  },
  {
    "title": "Office 365 login",
    "url": "https://www.office.com/",
    "snippet": "Collaborate for free with online versions of Microsoft Word, PowerPoint, Excel, and OneNote. Save documents, spreadsheets, and presentations online, in OneDrive."
  },
  {
    "title": "Microsoft Excel: Spreadsheets - Aplicaciones en Google Play",
    "url": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel&hl=es",
    "snippet": "Usa las plantillas modernas de Excel para iniciar presupuestos, listas de tareas, análisis de contabilidad o financieros. Usa las fórmulas que ya conoces para hacer cálculos y analizar datos."
  },
  {
    "title": "YouTube Help - Google Help",
    "url": "https://support.google.com/youtube/?hl=en",
    "snippet": "Official YouTube Help Center where you can find tips and tutorials on using YouTube and other answers to frequently asked questions."
  }
]