[
  {
    "title": "Carnaval 2026: saiba se é feriado, dia normal ou ponto ... - G1",
    "url": "https://g1.globo.com/carnaval/2026/noticia/2026/02/01/carnaval-2026-saiba-se-e-feriado-dia-normal-ou-ponto-facultativo-na-sua-capital.ghtml",
    "snippet": "3 days ago · Carnaval não é feriado nacional, mas ponto facultativo. Cabe a governos locais e empresas decidir se haverá ou não liberação do expediente."
  },
  {
    "title": "Carnaval 2026: datas e feriados confirmados - O POVO",
    "url": "https://www.opovo.com.br/trends/carnaval-2026-datas-e-feriados-confirmados/",
    "snippet": "4 days ago · Uma das festas mais aguardadas do ano já tem data marcada. Em 2026, o Carnaval será celebrado oficialmente na terça-feira, 17 de fevereiro, mas a programação se estende por vários dias e ..."
  },
  {
    "title": "Carnaval 2026: confira datas, folgas e feriados de fevereiro",
    "url": "https://www.metropoles.com/vida-e-estilo/carnaval-2026-feriado",
    "snippet": "2 days ago · Carnaval 2026: confira datas, folgas e feriados de fevereiro Apesar das celebrações em todo o país, o Carnaval não é um feriado nacional por lei federal; confira em quais dias cai a festa neste ano"
  },
  {
    "title": "Carnaval 2026: Data oficial, feriados e tudo sobre o calendário da ...",
    "url": "https://gazetamercantil.com/carnaval-2026-data-feriado-bancos-calendario-oficial",
    "snippet": "5 days ago · O carnaval 2026 acontece em 17 de fevereiro. Confira o calendário completo, saiba se é feriado nacional ou ponto facultativo e veja o funcionamento dos bancos durante a folia."
  },
  {
    "title": "Quando é o Carnaval em 2026? - Exame",
    "url": "https://exame.com/pop/quando-e-o-carnaval-em-2026/",
    "snippet": "Mar 2, 2025 · Mesmo com o festejo já ocorrendo, a data oficial do Carnaval de 2026 é apenas terça-feira, 17 de fevereiro. A folia começa no sábado, 14, e se estende até a Quarta-Feira de Cinzas, 18."
  },
  {
    "title": "Microsoft – AI, Cloud, Productivity, Computing, Gaming & Apps",
    "url": "https://www.microsoft.com/en-us",
    "snippet": "Explore Microsoft products and services and support for your home or business. Shop Microsoft 365, Copilot, Teams, Xbox, Windows, Azure, Surface and more."
  }
]