[
  {
    "title": "Multicanais Brasileirão: saiba como assistir ao campeonato ao vivo",
    "url": "https://www.techtudo.com.br/guia/2025/04/multicanais-brasileirao-saiba-como-assistir-ao-campeonato-ao-vivo-edsoftwares.ghtml",
    "snippet": "Apr 19, 2025 · Multicanais é uma plataforma ilegal que transmite jogos de futebol ao vivo, de times brasileiros e internacionais, além de outros esportes, como lutas de UFC e partidas de basquete da NBA."
  },
  {
    "title": "Futebol: Em streaming ao vivo e na TV hoje | JustWatch",
    "url": "https://www.justwatch.com/br/futebol",
    "snippet": "Descubra hoje no JustWatch onde você pode assistir à Liga dos Campeões, Bundesliga, Europa League e todas as outras partidas de futebol ao vivo!"
  },
  {
    "title": "Multicanais - Multicanal - Futebol Ao Vivo HD - Jogos Ao Vivo",
    "url": "https://multicanaistv.click/",
    "snippet": "3 days ago · Veja os principais jogos ao vivo no multicanais tv. Futebol online em tempo real, nba ao vivo, ufc ao vivo, f1, bbb 26 ao vivo 24 horas."
  },
  {
    "title": "Multicanais Oficial – Futebol, Filmes & Séries Ao Vivo! ⚽",
    "url": "https://multicanais-web.bitbucket.io/",
    "snippet": "Bem-vindo ao Multicanais, a maior central de TV online grátis do Brasil! Aqui você encontra transmissões ao vivo de futebol, esportes, UFC, NBA, Fórmula 1 e os principais canais de tv aberta. 24 horas no ar, acessível de qualquer dispositivo e com a melhor qualidade de imagem em HD."
  },
  {
    "title": "Multicanais - Assistir Futebol ao vivo grátis HD",
    "url": "https://futemaxhd.wtf/p/multicanais",
    "snippet": "O Multicanais é uma plataforma de streaming bem popular no Brasil, oferecendo uma vasta gama de transmissões ao vivo de televisão, filmes, séries e eventos esportivos de forma totalmente gratuita."
  },
  {
    "title": "Se connecter | CORPIQ",
    "url": "https://www.corpiq.com/fr/se-connecter.html",
    "snippet": "Zone de connexion pour les membres de la Corporation des propriétaires immobiliers du Québec."
  }
]