[
  {
    "title": "Mount Sinai Health System",
    "url": "https://mychart.mountsinai.org/",
    "snippet": "Forgot login information? Need help? Sign up Access Trouble? Click Here Paying without a MyChart account? PAY BILL AS GUEST GUEST ESTIMATE"
  },
  {
    "title": "Oops! - Mount Sinai Health System",
    "url": "https://mychart.mountsinai.org/mychart/accesscheck.asp",
    "snippet": "Sorry. Your request could not be carried out because of an error. Please log out and sign in again."
  },
  {
    "title": "MyMountSinai - Sign Up - Mount Sinai Health System",
    "url": "https://mychart.mountsinai.org/mychart/signup",
    "snippet": "Please note that MyMountSinai Self Signup is only available for current Mount Sinai patients that are 18 years of age or older. Please add donotreply@mountsinai.org to your safe senders list in order to receive MyMountSinai notifications in your email."
  },
  {
    "title": "",
    "url": "https://mychart.mountsinai.org/mychart/en-US/docs/TipSheet_MyChart_Login.pdf",
    "snippet": "For safety reasons, please note that three 3 incorrect password attempts will result in your account being locked, and you must contact our MyChart support line to have it unlocked – this phone number appears at the bottom of the last page of this document."
  },
  {
    "title": "MyMountSinai - login recovery page - Mount Sinai Health System",
    "url": "https://mychart.mountsinai.org/mychart/recoverlogin.asp",
    "snippet": "Interoperability Guide FAQs Privacy Policy Terms and Conditions High Contrast Theming MyChart® licensed from Epic Systems Corporation © 1999 - 2026"
  },
  {
    "title": "Solitaire Draw 1 Challenge (2025/12/11)",
    "url": "https://solitaireforum.com/2025/12/11/solitaire-draw-1-challenge-2025-12-11/",
    "snippet": "Dec 11, 2025 · MobilityWare Solitaire, Spider Solitaire, TriPeaks, Free Cell, Crown, and Addiction Daily Challenge Solution Hints and Feature Reviews : We are a community that enjoy playing the MobilityWare Solitaire Apps and try to make it to the Leaderboards. If that describes you, welcome home."
  }
]