[
  {
    "title": "Jaime Lannister (Game of Thrones) vs Boromir (LOTR) - Worstgen",
    "url": "https://worstgen.alwaysdata.net/forum/threads/jaime-lannister-game-of-thrones-vs-boromir-lotr.7661/",
    "snippet": "Oct 8, 2020 · Boromir the Tall kicks Jaime Lannister's ass in either iteration. In the movies, he's fighting better than Uruk Hai from Isengard and taking them out with ease despite being one man against many. Jaime Lannister never really has anything like this in the show. In fact, he's captured during the battle of Whispering Woods (an ambush I know) and taken hostage by multiple regular men. Round 2 is a ..."
  },
  {
    "title": "Questions & Mysteries - Fenrir or Nidhoggr? | Worstgen",
    "url": "https://worstgen.alwaysdata.net/forum/threads/fenrir-or-nidhoggr.76600/",
    "snippet": "Dec 27, 2025 · Which devil fruit do you think Loki ate? I strongly think it is Nidhoggr because he clearly has a serpentine neck and his hands don't transform into paws as a wolf would have. These are the panels we see of it @centurion @King7 @sanjikun @MonsterKaido @Garps tekkai @Garp the Fist @nik87..."
  },
  {
    "title": "Questions & Mysteries - How did they destroy Polar tang?",
    "url": "https://worstgen.alwaysdata.net/forum/threads/how-did-they-destroy-polar-tang.77747/",
    "snippet": "Jan 26, 2026 · - Blackbeard Powers should destroy the entire thing rather than breaking in thr middle. - burgess is strong, but throwing things is the best he could do underwater. - Van Auger is a good option given how explosive his attacks can get once Haki is involved. Saber of Xebec, though a ship..."
  },
  {
    "title": "Speculations - Elbaf is our way back to Mariejoa | Worstgen",
    "url": "https://worstgen.alwaysdata.net/forum/threads/elbaf-is-our-way-back-to-mariejoa.75682/",
    "snippet": "Dec 2, 2025 · Honestly felt compelled to make this thread before we find out anything about Heaven's Realm but I think there is a strong possibility the following is legitimate. TLDR: Essentially I believe Elbaf (containing Treasure Tree Adam) and Mariejoa (containing Sunlight Tree Eve) are inherently..."
  },
  {
    "title": "Spoiler - One Piece Chapter 1169 Spoilers Discussion",
    "url": "https://worstgen.alwaysdata.net/forum/threads/one-piece-chapter-1169-spoilers-discussion.75774/page-65",
    "snippet": "Dec 5, 2025 · Oda usually cook in for the final chapter in December Hopefully he don’t miss in 2025 DEC 2024DEC 2023 DEC 2022 DEC 2021 DEC 2020DEC 2019 DEC 2018DEC 2017 DEC 2016DEC 2015"
  }
]