[
  {
    "title": "How to Open the Control Panel on Windows 10 - How-To Geek",
    "url": "https://www.howtogeek.com/436985/how-to-open-the-control-panel-on-windows-10/",
    "snippet": "Sep 2, 2023 · Still, launching the Control Panel on Windows 10 is very easy: click the Start button or press the Windows key, type \"Control Panel\" into the search box in the Start menu, and press Enter."
  },
  {
    "title": "Open Control Panel in Windows 11",
    "url": "https://www.elevenforum.com/t/open-control-panel-in-windows-11.481/",
    "snippet": "Jul 9, 2021 · This tutorial will show you how to open the Control Panel and change to Category, Large icons, or Small icons view in Windows 11. You can use Control Panel to change settings for Windows."
  },
  {
    "title": "How to Open Control Panel in Windows 11: A Step-by-Step Guide",
    "url": "https://www.solveyourtech.com/how-to-open-control-panel-in-windows-11-a-step-by-step-guide/",
    "snippet": "Aug 29, 2024 · Discover how to access the Control Panel in Windows 11 with our step-by-step guide. Simplify system settings navigation with these easy instructions."
  },
  {
    "title": "How to open Control Panel in Windows 11 - The Windows Club",
    "url": "https://www.thewindowsclub.com/open-control-panel-in-windows-10",
    "snippet": "Jan 6, 2025 · Here are 8 ways you can open Control Panel in Windows 11/10 using Explorer, This PC, CMD, Run, Settings, Start Search, WinX or Desktop Shortcuts."
  },
  {
    "title": "How to open the Windows Control Panel - Computer Hope",
    "url": "https://www.computerhope.com/issues/control-panel.htm",
    "snippet": "Apr 9, 2024 · Discover how to access the Control Panel on various Windows versions. Follow detailed instructions for Windows 11, 10, 8, 7, and beyond to manage settings."
  },
  {
    "title": "PJe em Pernambuco - Processo Judicial Eletrônico - TJPE",
    "url": "https://portal.tjpe.jus.br/web/processo-judicial-eletronico/pje-em-pernambuco",
    "snippet": "PJe em Pernambuco O TJPE já implantou o PJe em 146 órgãos julgadores do 1º Grau, entre Varas Judiciais, Centrais de Conciliação, Mediação e Arbitragem e Juizados Especiais. No link: \"Órgãos julgadores com o PJE\" disponível nesta seção, é possível conferir quais são essas unidades."
  }
]