[
  {
    "title": "Marlboro Rewards Codes : r/Cigarettes - Reddit",
    "url": "https://www.reddit.com/r/Cigarettes/comments/15ai72y/marlboro_rewards_codes/",
    "snippet": "I have a 6 dollar off coupon for marlboro comes to 2.61 -4.54 a pack pending on what one you get. Can be used multiple times Reply reply Expensive_Problem966 •"
  },
  {
    "title": "Opinions on Marlboro Reds? : r/Cigarettes - Reddit",
    "url": "https://www.reddit.com/r/Cigarettes/comments/1bxwl6x/opinions_on_marlboro_reds/",
    "snippet": "Marlboro reds have good packaging, strong buzz if it's the first cigarette of the day and they burn fast but not too fast. The residual smell is there but as long as you don't chain smoke, most of it goes away in 10 minutes if you smoke outside. All of these make them one of my favorites."
  },
  {
    "title": "Do the Marlboro reward points expire at the end of this year ... - Reddit",
    "url": "https://www.reddit.com/r/freebietalk/comments/rt2o9g/do_the_marlboro_reward_points_expire_at_the_end/",
    "snippet": "Dec 31, 2021 · Do the Marlboro reward points expire at the end of this year? I'm trying to figure out if I need to use them before the new year or not."
  },
  {
    "title": "Canadian Marlboro: what to know! : r/Cigarettes - Reddit",
    "url": "https://www.reddit.com/r/Cigarettes/comments/ojo828/canadian_marlboro_what_to_know/",
    "snippet": "The brand name Marlboro belongs to Imperial Tobacco Canada, which now makes 2 variants of his brands with Burley, Oriental and Virginia tobacco. According to its website marlboro (dot)ca, those to variants are: A) Marlboro B) Marlboro Smooth PICTURES HERE The two other variants (Marlboro Full and Marlboro Select) only contain 10% burley)"
  },
  {
    "title": "Camels vs Marlboro: Your opinions? : r/Cigarettes - Reddit",
    "url": "https://www.reddit.com/r/Cigarettes/comments/xwm1sj/camels_vs_marlboro_your_opinions/",
    "snippet": "Marlboro are classic ones. Camel is very good smoke. One of the best cigarettes these two. Reply reply [deleted] •"
  }
]