[
  {
    "title": "Nosotros – MB",
    "url": "https://mbasociados.com.pa/nosotros-2/",
    "snippet": "Nuestro objetivo como firma de Contadores Públicos Autorizados en Panamá es brindar un servicio profesional a nuestros clientes cumpliendo con la normativa local y los estándares internacionales."
  },
  {
    "title": "MB & Asociados - LinkedIn",
    "url": "https://www.linkedin.com/company/m-b-asociados",
    "snippet": "Nos complace presentarnos como un prestigioso estudio contable integrado por un equipo de profesionales altamente calificados y especializados en el asesoramiento contable e impositivo."
  },
  {
    "title": "MB Y ASOCIADOS (PERSONA JURÍDICA) Folio Nº 34354 (M) - persono.io",
    "url": "https://persono.io/apps/profiles/4b1f0a25b552eb0f3a2d3dff3c3f3d0f",
    "snippet": "MB Y ASOCIADOS (PERSONA JURÍDICA) Folio Nº 34354 (M) - Accede a información sobre el registro mercantil, licencias, multas, demandas, comercio internacional y personas relacionadas."
  },
  {
    "title": "Mb&asociados (@mbasociados_) • Instagram photos and videos",
    "url": "https://www.instagram.com/mbasociados_/",
    "snippet": "137 Followers, 32 Following, 208 Posts - Mb&asociados (@mbasociados_) on Instagram: \"Nos especializamos en Derecho Civil, Comercial y Laboral. - Facturación - Monotributo - Liq de formulario 2002 IVA - Liq de formulario 931\""
  },
  {
    "title": "MB Y Asociados - Facebook",
    "url": "https://www.facebook.com/mbyasociados2021/",
    "snippet": "Oct 31, 2022 · Empresa dedicada al mercado de negocios y asesoramiento de imagen, politica, muestreos y seguimientos. Encuestas de rendimiento..."
  },
  {
    "title": "What Are EMRs and EHRs, and Why Do They Matter to Therapists?",
    "url": "https://www.goodtherapy.org/for-professionals/software-technology/ehr-emr/article/what-are-emrs-and-ehrs-and-why-do-they-matter-to-therapists",
    "snippet": "Nov 12, 2019 · Learn more about electronic medical records (EMRs) and electronic health records (EHRs) as well as what makes them so important to mental health professionals."
  }
]