[
  {
    "title": "How To Take Pictures of Stars & The Night Sky - AstroBackyard",
    "url": "https://astrobackyard.com/how-to-take-pictures-of-stars/",
    "snippet": "Aug 20, 2024 · This post describes how to take pictures of stars with your DSLR camera. I'll cover the basic camera settings, and what to expect your first time out."
  },
  {
    "title": "Star Photography Settings for DSLR and Mirrorless Cameras",
    "url": "https://www.slrlounge.com/photographing-the-milky-way-ideal-camera-settings/",
    "snippet": "Apr 22, 2025 · ISO settings should be kept as low as possible to reduce noise but high enough to capture the stars (ISO 400-800 is a good starting point). Finally, turn off any image stabilization and …"
  },
  {
    "title": "Star Photography – The Definitive Guide [2026]",
    "url": "https://www.davemorrowphotography.com/p/tutorial-shooting-night-sky.html",
    "snippet": "Step 1: Set your f-stop to f/2.8 or your widest setting above f/2.8. This will be where you keep it for all your star shots. Step 2: Set your ISO at 4000. This is not the actual ISO you will use for your images. …"
  },
  {
    "title": "How to Take Pictures of Stars: An Easy 5-Step Tutorial",
    "url": "https://skiesandscopes.com/star-photography/",
    "snippet": "Jun 9, 2023 · Learn how to take pictures of stars with our easy 5 step guide. Covering everything you need including gear and settings to take the best night sky photos."
  },
  {
    "title": "How to do astrophotography with a DSLR camera",
    "url": "https://www.skyatnightmagazine.com/astrophotography/astrophotography-with-dslr-camera",
    "snippet": "Feb 21, 2025 · If you're a complete beginner, we'll show you how to take and process your very first astrophoto with a DSLR. After that, you can experiment with settings and composition to make your …"
  },
  {
    "title": "How to Take Pictures of Stars: An Astrophotography Guide",
    "url": "https://www.findingtheuniverse.com/astrophotography-how-take-pictures-stars/",
    "snippet": "Jun 30, 2023 · Detailed guide and advice to help you take pictures of stars, including camera settings, photography gear you need, how to take pictures of stars with a smartphone, how to take star trails …"
  }
]