[
  {
    "title": "users and staff who love fresh (Please read)",
    "url": "https://forum.fresh-hotel.org/showthread.php/3392-users-and-staff-who-love-fresh-(Please-read)",
    "snippet": "Feb 28, 2016 · Since the beginning, Fresh-hotel started out small and continued its glory to becoming the best and longest running retro on the internet. To this day most users want fresh to become bigger and grow into a larger community, these things come through and everyone is loving what Fresh has become. Now join the party and play Fresh till the end of ..."
  },
  {
    "title": "Excellent New Furni For Fresh Hotel",
    "url": "https://forum.fresh-hotel.org/showthread.php/4686-Excellent-New-Furni-For-Fresh-Hotel",
    "snippet": "So that's one benefit. I know that kane is more concerned with the fresh economy then adding in more furni, but there are those of us who can definitely benefit from new furni in the hotel, and i constantly find myself having an idea and not being able to find the furni to make it work."
  },
  {
    "title": "Fresh Forums",
    "url": "https://forum.fresh-hotel.org/forum.php?s=07c589f6581fd9343a450bb41d0ea2ca",
    "snippet": "Fresh Forums Threads / Posts Last Post News and Announcements News and Announcements regarding the forums and hotel updates and downtimes will be posted here."
  },
  {
    "title": "Fresh Lab",
    "url": "https://forum.fresh-hotel.org/showthread.php/533-Fresh-Lab",
    "snippet": "All the bugs that were going on, I honestly thought fresh was done for. But, staff and the technicians have made the extra effort to fix the bugs and provide fresh with the best community."
  },
  {
    "title": "Rooms Were Wiped! Any Way Of Restoring Just Rooms?",
    "url": "https://forum.fresh-hotel.org/showthread.php/4599-Rooms-Were-Wiped!-Any-Way-Of-Restoring-Just-Rooms",
    "snippet": "Rooms Were Wiped! Any Way Of Restoring Just Rooms? Username: Chouhdry Been a member on Fresh since 2012, in 2016 I went off for a few months and came back on, all my the rares including the ones I paid for went and my rooms were wiped however the rooms were there just empty."
  }
]