[
  {
    "title": "Helvetica Neue Font Family : Download Free for Desktop & Webfont",
    "url": "https://www.cufonfonts.com/font/helvetica-neue-55",
    "snippet": "Aug 2, 2007 · Download Helvetica Neue font for PC/Mac for free, take a test-drive and see the entire character set. Moreover, you can embed it to your website with @font-face support."
  },
  {
    "title": "Helvetica Neue Condensed Bold : Download For Free, View ...",
    "url": "https://fontsgeek.com/fonts/helvetica-neue-condensed-bold",
    "snippet": "Helvetica Neue Condensed Bold bold condensed neue helvetica Download Font ZIP file By downloading the Font, You agree to our Terms and Conditions"
  },
  {
    "title": "Discover the Helvetica Neue Condensed Font Benefits",
    "url": "https://fontorbit.com/helvetica-neue-condensed-font/",
    "snippet": "Sep 5, 2024 · Download Helvetica Neue Condensed Font, a sleek sans-serif typeface designed by Max Miedinger. Ideal for professional, corporate, and editorial design projects."
  },
  {
    "title": "Helvetica Neue Black Condensed Font : Free Font Download",
    "url": "https://freefontdownload.org/en/helvetica-neue-black-condensed.font",
    "snippet": "Discover the free Helvetica Neue Black Condensed font at Free Font Download ! Installable on PC, Mac, Linux, iOS, and Android platforms. Elevate your designs with Helvetica Neue Black Condensed font."
  },
  {
    "title": "Helvetica Neue Font Family Download for Desktop & WebFont ...",
    "url": "https://www.cdnfonts.com/helvetica-neue-5.font",
    "snippet": "Download Helvetica Neue font from free CDN or use it on your website as webfont."
  },
  {
    "title": "Hardware - Wikipedia, la enciclopedia libre",
    "url": "https://es.wikipedia.org/wiki/Hardware",
    "snippet": "Por ejemplo, hardware también se refiere a herramientas y máquinas, y en electrónica hardware se refiere a todos los componentes electrónicos, eléctricos, electromecánicos, mecánicos, cableados y tarjetas de circuitos impresos."
  }
]