[
  {
    "title": "Amazon.com. Spend less. Smile more.",
    "url": "https://www.amazon.com/",
    "snippet": "Amazon Business Card Shop with Points Credit Card Marketplace Reload Your Balance Gift Cards Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Recalls and Product Safety Alerts Information about the FTC Prime settlement Registry & Gift ..."
  },
  {
    "title": "Amazon Prime Membership",
    "url": "https://www.aboutamazon.com/what-we-do/prime",
    "snippet": "Dec 1, 2025 · An Amazon Prime membership comes with much more than fast, free delivery. Check out the shopping, entertainment, healthcare, and grocery benefits, plus updates available to members."
  },
  {
    "title": "Amazon Shopping - Apps on Google Play",
    "url": "https://play.google.com/store/apps/details?id=com.amazon.mShop.android.shopping&hl=en-US",
    "snippet": "Whether you’re buying gifts, reading reviews, tracking orders, scanning products, or just shopping, Amazon Shopping app offers more benefits than shopping on Amazon via your desktop."
  },
  {
    "title": "Amazon (company) - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Amazon_(company)",
    "snippet": "Amazon has a number of products and services available, including its digital assistant Alexa, Amazon Music, and Prime Video for music and videos respectively, the Amazon Appstore for Android apps, the Kindle line of electronic paper e-readers, Fire and Fire HD color LCD tablets."
  },
  {
    "title": "Amazon Sign-In",
    "url": "https://amc.amazon.com/",
    "snippet": "By continuing, you agree to Amazon's Conditions of Use and Privacy Notice. Need help? New to Amazon?"
  },
  {
    "title": "Inicio - Ministerio del Interior",
    "url": "https://www.mininterior.gov.co/",
    "snippet": "El viceministro para el Diálogo Social y los Derechos Humanos, del Ministerio del Interior, Gabriel Rondón Olave, visitó el departamento del Cauca para presentar un informe sobre el acompañamiento que han hecho el Gobierno nacional y el gobierno regional en la región del Micay."
  }
]