[
  {
    "title": "Send Money, Pay Online or Set Up a Merchant Account - PayPal",
    "url": "https://www.paypal.com/",
    "snippet": "Paypal Home. Shopping online shouldn't cost you peace of mind. Buy from millions of online stores without sharing your financial information."
  },
  {
    "title": "Log in to your PayPal account",
    "url": "https://www-v2.sandbox.paypal.com/us/signin",
    "snippet": "Already set up to use your mobile number to log in? Type it below. Otherwise, click the link to log in with email. Forgot your email address? Go to the PayPal website to recover it."
  },
  {
    "title": "PayPal",
    "url": "https://www.paypal.com/us/mobile-app/dashboard?intent=login&pp_web_dl=custom",
    "snippet": "Help Contact Fees Security Center Privacy Center Shop Apps Enterprise Partners See all countries/regions"
  },
  {
    "title": "My Account | PayPal US",
    "url": "https://history.paypal.com/us/cshelp/topic/help_account_personal",
    "snippet": "Why am I receiving emails or texts from PayPal when I don’t have an account? What is the difference between Personal and Business accounts? What should I do if I'm locked out of my account? Why do I have to complete a security check? How do I block or unblock another PayPal user? Show more"
  },
  {
    "title": "Login & Security | PayPal US",
    "url": "https://www.paypal.com/us/cshelp/topic/help_login_and_security_personal",
    "snippet": "How do I manage my personal data and privacy settings on my PayPal account? What is PayPal's approach to privacy and the Privacy Statement? How long does PayPal retain my data and can I request to erase it? How can I correct my personal data? I'm not receiving the SMS or text to confirm my identity. What should I do? How can I access my ..."
  },
  {
    "title": "Welcome to the Florida Center for Students with Unique Abilities",
    "url": "https://fcsua.org/",
    "snippet": "Welcome to the Florida Center for Students with Unique Abilities Students and Families Are you looking for college opportunities for students with intellectual disabilities? Let's help you get started."
  }
]