[
  {
    "title": "Pages - Frequently Asked Questions - New Jersey Division of Consumer ...",
    "url": "https://www.njconsumeraffairs.gov/mft/Pages/FAQ.aspx",
    "snippet": "May 9, 2023 · How many Continuing Education Units (CEU's) does an LMFT need for each biennial renewal period? Pursuant to N.J.A.C. …"
  },
  {
    "title": "New Jersey Marriage and Family Therapist Continuing Education ...",
    "url": "https://ce4less.com/mft-ce/new-jersey-marriage-family-therapist-requirements/",
    "snippet": "Fulfill your New Jersey marriage and family therapist license renewal requirements today. To complete your marriage and family therapist …"
  },
  {
    "title": "New Jersey Counselor and Therapist Licensure Renewal Dates and CE ...",
    "url": "https://agentsofchangeprep.com/blog/new-jersey-counselor-and-therapist-licensure-renewal-dates-and-ce-requirements/",
    "snippet": "Sep 25, 2024 · Essential guide to counselor and therapist licensure in New Jersey: License renewal procedures, continuing education …"
  },
  {
    "title": "New Jersey State Resources - American Association for Marriage a…",
    "url": "https://www.aamft.org/AAMFT/Advocacy/State_Resources/New+Jersey.aspx",
    "snippet": "In order to renew a license, a licensee must complete continuing education every two years. To renew an LMFT license: 40 hours. Read …"
  },
  {
    "title": "N.J. Admin. Code § 13:34-15.1 - License renewal and continuing ...",
    "url": "https://www.law.cornell.edu/regulations/new-jersey/N-J-A-C-13-34-15-1",
    "snippet": "Code § 13:34-15.1 - License renewal and continuing education requirement. (a) All licensed professional counselors shall …"
  },
  {
    "title": "O streaming do século XIX: o que foi o romance de folhetim?",
    "url": "https://blog.literaturaclassica.com.br/cultura/o-streaming-do-seculo-xix-o-que-foi-o-romance-de-folhetim/",
    "snippet": "O streaming do século XIX: o que foi o romance de folhetim? Entenda como o hábito de maratonar séries tem tudo a ver com os …"
  }
]