[
  {
    "title": "Introducing SharePoint Premium – the future of AI powered content ...",
    "url": "https://techcommunity.microsoft.com/blog/sharepoint_premium_blog/introducing-sharepoint-premium-–-the-future-of-ai-powered-content-management-and/3981076",
    "snippet": "Nov 15, 2023 · SharePoint Premium brings AI, automation, and added security to your content experiences, processing, and governance. With SharePoint Premium we’ll be transitioning the services already released as part of Syntex, including SharePoint Advanced Management, to join the growing family of SharePoint services along with brand new content experiences."
  },
  {
    "title": "SharePoint in the Era of AI: Spring 2025 Updates | Microsoft Community Hub",
    "url": "https://techcommunity.microsoft.com/blog/spblog/sharepoint-in-the-era-of-ai-spring-2025-updates/4411598",
    "snippet": "May 7, 2025 · SharePoint in the era of AI- Collaboration, Automation, Communication It’s been a community-fueled 2025 for us on the SharePoint team. We started off the year with a January online event about the General Availability of our new AI-fueled UX for site creators."
  },
  {
    "title": "Microsoft SharePoint Blog",
    "url": "https://techcommunity.microsoft.com/blog/spblog/top-10-most-important-powers-of-your-sharepoint-team-sites-in-office-365/355598",
    "snippet": "Feb 22, 2019 · SharePoint lists collect data, just like you might collect information in Excel. Lists enable you and your teams to gather, track, and share information within SharePoint libraries. With SharePoint lists and libraries, Microsoft Flow, and PowerApps, you can create rich digital experiences with forms, workflows, and custom apps for every device."
  },
  {
    "title": "Microsoft SharePoint Blog | Microsoft Community Hub",
    "url": "https://techcommunity.microsoft.com/category/content_management/blog/spblog",
    "snippet": "6 days ago · Welcome to the SharePoint Blog! Learn best practices, news, and trends directly from the SharePoint team."
  },
  {
    "title": "SharePoint | Microsoft Community Hub",
    "url": "https://techcommunity.microsoft.com/category/content_management/discussions/sharepoint_general",
    "snippet": "2 days ago · SharePoint Welcome to the SharePoint group! This is the place to discuss best practices, news, and the latest trends and topics related to SharePoint."
  },
  {
    "title": "Free Online Games at Poki - Play Now!",
    "url": "https://poki.com/",
    "snippet": "Poki is the #1 website for playing free online games on your mobile, tablet or computer. No downloads, no login. Play now!"
  }
]