[
  {
    "title": "Stabroek News - Guyana's Most Trusted Newspaper",
    "url": "https://www.stabroeknews.com/",
    "snippet": "The Stabroek News and Sunday Stabroek deliver the latest news and features from Guyana: business, politics, opinion, entertainment, sports and more."
  },
  {
    "title": "Stabroek News - January 31, 2026 - PressReader",
    "url": "https://stabroeknews.pressreader.com/stabroek-news",
    "snippet": "4 days ago · Exxon awaiting ICJ decision to step up exploration in Stabroek Block - Woods Man injured in bridge accident had been sleeping in back of car"
  },
  {
    "title": "Stabroek News - Facebook",
    "url": "https://www.facebook.com/stabroeknews/",
    "snippet": "Stabroek News. 226,888 likes · 29,753 talking about this. The Stabroek News and Sunday Stabroek are Guyana's leading daily newspapers and online news source."
  },
  {
    "title": "Guyana News - Stabroek News",
    "url": "https://www.stabroeknews.com/news/guyana/",
    "snippet": "The latest Guyana news from Stabroek News including oil and gas coverage, crime, politics, culture, business and more."
  },
  {
    "title": "Stabroek News - February 03, 2026",
    "url": "https://stabroeknews.pressreader.com/stabroek-news/20260203",
    "snippet": "1 day ago · Articles Anna Catherina care centre now open: President says Guyana, Belize should lead regional food security Gunmen attack employees at G Mining Ventures CJ defers ruling on challenge to Mohameds extradition proceedings MPs feud over impact of budget -as 2026 debate takes off US to cut tariffs on India to 18%, India agrees to end Russian oil purchases SpaceX acquires xAI in record-setting ..."
  },
  {
    "title": "Croisières : aubaines sur les vacances avec Norwegian Cruise Line | NCL",
    "url": "https://www.ncl.com/ca/fr/",
    "snippet": "Chez Norwegian Cruise Line, nous sommes convaincus que les vacances doivent être une rupture avec la routine quotidienne. Des horaires, des obligations et des itinéraires qui dictent notre quotidien. Selon nous, vous devriez avoir l'espace nécessaire pour respirer et goûter toutes les saveurs de notre restauration de renommée mondiale."
  }
]