[
  {
    "title": "Juego 2048 - Jugar 2048 en línea",
    "url": "https://www.game-2048.com/es/",
    "snippet": "Juega al 2048 online de forma gratuita. Esta es la versión clásica del juego de puzle. Une los números y llega al azulejo 2048, y haz la puntuación más alta."
  },
  {
    "title": "Play Double 2048 2048 Game",
    "url": "https://custom2048.com/double2048/",
    "snippet": "How to play: Use your arrow keys to move the tiles. When two tiles with the same number touch, they merge into one! Tip: Press and hold H to view information about each tile. Join the numbers and get to the 2048 tile! Careful: this game is extremely addictive!"
  },
  {
    "title": "Double 2048 - GitHub Pages",
    "url": "http://baiqiang.github.io/2048-double/",
    "snippet": "How to play: Use your arrow keys to move the tiles. When two tiles with the same number touch, they merge into one! Double 2048 Added by . Created by Based on and conceptually similar to."
  },
  {
    "title": "Juego 2048: edición estilo Google — Jugar en elgooG",
    "url": "https://elgoog.eu/es/2048/",
    "snippet": "Cuando dos fichas con el mismo número se tocan, se fusionan en una con el doble de valor. Juega al clásico rompecabezas 2048 con un estilo inspirado en Google. Desliza para unir fichas, trata de alcanzar el 2048 y aprende con el modo de juego automático con IA opcional. ¡Juega gratis en línea!"
  },
  {
    "title": "Juegos de 2048 ️ Juega en CrazyGames",
    "url": "https://www.crazygames.com/es/t/2048",
    "snippet": "¡Descubre los Juegos de Combinar 2048 más nuevos y populares utilizando el Filtro de Página! Los juegos de 2048 son rompecabezas de combinación de números en los que deslizas fichas para llegar a 2048."
  },
  {
    "title": "Routenplaner & Fahrplanauskunft des ÖPNV Berlin/Brandenburg | BVG",
    "url": "https://www.bvg.de/de/verbindungen/verbindungssuche",
    "snippet": "Dein Routenplaner für Berlin & Brandenburg: Start, Ziel & Zeit eingeben und zwischen Bus, Bahn & Fahrrad deine schnellste Route wählen."
  }
]