[
  {
    "title": "National Organization for Rare Disorders | NORD",
    "url": "https://rarediseases.org/",
    "snippet": "Jan 21, 2026 · National Organization for Rare Disorders (NORD®) NORD advances practical, meaningful, and enduring change so people with rare diseases can live their fullest and best lives. Every day, we elevate care, advance research, and drive policy in a purposeful and holistic manner to lift up the rare disease community."
  },
  {
    "title": "Financial Assistance For Patients With Rare Diseases | NORD",
    "url": "https://rarediseases.org/patient-assistance-programs/",
    "snippet": "NORD’s Rare Caregiver Respite program was an absolute lifeline for our family this past year. With the respite program, I was able to select a family friend who I trusted, who was already adequately trained to handle my daughter’s needs, and I could have her provide respite whenever I needed it. The reimbursement process was easy, and payment was received promptly."
  },
  {
    "title": "Rare Diseases Support, Resources & Help | NORD",
    "url": "https://rarediseases.org/living-with-a-rare-disease/getting-help-and-support/",
    "snippet": "Can NORD help find a medical expert for my rare disease? Many patient organizations provide lists of medical experts. Search NORD’s Organizational Database to find disease-specific patient advocacy organizations NORD Rare Disease Centers of Excellence are diagnosing and treating thousands of rare disease patients."
  },
  {
    "title": "Centers of Excellence - National Organization for Rare Disorders",
    "url": "https://rarediseases.org/center-of-excellence/",
    "snippet": "NORD is committed to breaking down silos and building bridges so that people living with a rare disease can achieve their best health and well-being. Our belief is that the NORD Rare Disease Centers of Excellence program is the next big stride forward for rare disease patients and care, to improve health equity and create critical new connections to resources and specialists across our nation."
  },
  {
    "title": "About Us - National Organization for Rare Disorders",
    "url": "https://rarediseases.org/about-us/",
    "snippet": "Discover NORD's mission to drive rare disease research, support patients, and advocate for transformative healthcare policies nationwide."
  }
]