[
  {
    "title": "Ativar ou desativar o Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/ativar-ou-desativar-o-bluetooth-no-windows-9e92fddd-4e12-e32b-9132-5e36bdb2f75a",
    "snippet": "Para dispositivos Windows com Bluetooth, o Bluetooth pode ser ativado e desativado. Desligar o Bluetooth e ativar redefine o …"
  },
  {
    "title": "Emparelhar um dispositivo Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/emparelhar-um-dispositivo-bluetooth-no-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
    "snippet": "A maioria dos dispositivos Windows já tem Bluetooth integrado. Se um dispositivo Windows não tiver Bluetooth, um adaptador Bluetooth …"
  },
  {
    "title": "Corrigir problemas de Bluetooth no Windows - Suporte da Microsoft",
    "url": "https://support.microsoft.com/pt-br/windows/corrigir-problemas-de-bluetooth-no-windows-723e092f-03fa-858b-5c80-131ec3fba75c",
    "snippet": "Saiba como solucionar problemas do Bluetooth no Windows. Resolva problemas ao conectar um dispositivo ou acessório Bluetooth."
  },
  {
    "title": "Localizar configurações de Bluetooth no Windows",
    "url": "https://support.microsoft.com/pt-br/windows/localizar-configurações-de-bluetooth-no-windows-5027e93e-a6e8-4b4f-a412-c6c6cd6f57cc",
    "snippet": "Saiba como localizar e ajustar opções adicionais de Bluetooth e Bluetooth no Windows."
  },
  {
    "title": "Pair a Bluetooth device in Windows - Microsoft Support",
    "url": "https://support.microsoft.com/en-us/windows/pair-a-bluetooth-device-in-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
    "snippet": "Select the desired Bluetooth device and follow any additional instructions if they appear. Once the Bluetooth device is paired successfully, …"
  },
  {
    "title": "How to set up your first Google Ads campaign",
    "url": "https://ads.google.com/intl/en_us/intl/en_us/home/how-it-works/",
    "snippet": "Learn how to set up your first Ads campaign. Discover the step-by-step guide on Google Ads, selecting goals, and how to create effective …"
  }
]