[
  {
    "title": "KRAS - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/KRAS",
    "snippet": "KRAS (Kirsten rat sarcoma virus oncogene homologue) is a gene that provides instructions for making a protein called K-Ras, a part of the RAS/MAPK pathway. The protein relays signals from outside the cell to the cell's nucleus."
  },
  {
    "title": "What’s new in KRAS mutation research? - MD Anderson Cancer Center",
    "url": "https://www.mdanderson.org/cancerwise/what-s-new-in-kras-mutation-research-.h00-159696756.html",
    "snippet": "The most frequently mutated of these oncogenic driver genes, called KRAS, is associated with some of the most fatal cancer types: lung, pancreatic and colorectal cancers."
  },
  {
    "title": "KRAS Mutations in Solid Tumors: Characteristics, Current Therapeutic ...",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9861148/",
    "snippet": "Kristen rat sarcoma (KRAS) gene is one of the most common mutated oncogenes in solid tumors. Yet, KRAS inhibitors did not follow suit with the development of targeted therapy, for the structure of KRAS has been considered as being implausible to target for decades."
  },
  {
    "title": "Targeting KRAS mutations: orchestrating cancer evolution and ...",
    "url": "https://www.nature.com/articles/s41392-025-02473-8",
    "snippet": "Nov 28, 2025 · In this review, we provide a brief overview of KRAS mutations in cancers and tumorigenesis, specifically focusing on currently approved therapies for targeting KRAS, ongoing advances,..."
  },
  {
    "title": "Exploring KRAS: A precision approach in oncology - MSD",
    "url": "https://www.msd.com/stories/exploring-kras-a-precision-approach-in-oncology/",
    "snippet": "Jul 22, 2025 · KRAS is one of the most frequently mutated oncogenes found in cancer. In healthy cells, KRAS serves as an on-off switch that regulates cell growth. However, when the gene is mutated, KRAS can become stuck in the “on” position, causing uncontrolled cancer cell growth and proliferation."
  }
]