[
  {
    "title": "75 Kitchen Ideas You'll Love - January, 2026 | Houzz",
    "url": "https://www.houzz.com/photos/kitchen-ideas-and-designs-phbr0-bp~t_709",
    "snippet": "When discovering kitchen ideas, there are several aspects to consider and keep in mind as you browse kitchen photos. First and foremost, you should carefully consider your layout and where to place large appliances."
  },
  {
    "title": "75 Kitchen Ideas for Every Layout and Style",
    "url": "https://www.bhg.com/kitchen-ideas-7369196",
    "snippet": "Apr 15, 2025 · Whether you're looking to update a single element of your kitchen, like a backsplash, an accent wall, or mount a new range hood, you're ready to tackle a complete remodel, we put together a collection of the best kitchen ideas for you to draw inspiration from."
  },
  {
    "title": "108 Kitchen Ideas To Help You Plan Your Dream Space",
    "url": "https://www.southernliving.com/kitchen-inspiration-6529641",
    "snippet": "5 days ago · Whether you're planning a complete kitchen overhaul or you're just looking for a few quick and easy updates, these creative kitchens are sure to inspire you. There are many different types of kitchens in the South. Some are white kitchens with subway tiles, brass accents, and Carrera marble countertops."
  },
  {
    "title": "Kitchen Layout Planner | Free Kitchen Design Tool - SmartDraw",
    "url": "https://www.smartdraw.com/floor-plan/kitchen-planner.htm",
    "snippet": "Plan the layout of your kitchen whether you're designing a residential or commercial kitchen. SmartDraw's kitchen design tool helps you create professional layouts easily."
  },
  {
    "title": "93 Kitchen Ideas for Every Style, Budget, and Home - The Spruce",
    "url": "https://www.thespruce.com/kitchen-ideas-8608714",
    "snippet": "Jun 18, 2024 · Give your kitchen a mini refresh or a transformative makeover with kitchen ideas to suit every size and style. Whether your space is large or small, modern, contemporary, farmhouse, traditional, coastal, eclectic, minimalist, or something in between, there are easy ways to upgrade your space."
  },
  {
    "title": "Home | Fasano",
    "url": "https://www.fasano.com.br/",
    "snippet": "Conheça os espaços dos Hotéis e Restaurantes do Grupo Fasano para a realização de confraternizações, showrooms além de eventos sociais e corporativos. Saiba mais"
  }
]