[
  {
    "title": "Occupational Therapy: What It Is, Different Types & Benefits",
    "url": "https://my.clevelandclinic.org/health/treatments/occupational-therapy",
    "snippet": "Occupational therapy (OT) is treatment that helps you improve your ability to perform daily tasks. It can help you learn how to move through your environment or use different tools to participate in your …"
  },
  {
    "title": "AOTA INSPIRE | 2026 Annual Conference & Expo",
    "url": "https://inspire.aota.org/",
    "snippet": "Register for AOTA INSPIRE | 2026 Annual Conference & Expo, the largest gathering of OT practitioners in the world. Earn OT contact hours, connect with other practitioners, and network with colleagues …"
  },
  {
    "title": "Occupational therapy - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Occupational_therapy",
    "snippet": "Occupational therapy (OT), also known as ergotherapy, is a healthcare profession. Ergotherapy is derived from the Greek ergon which is allied to work, to act and to be active."
  },
  {
    "title": "What is OT? / Occupational Therapy Explained - OT Potential",
    "url": "https://otpotential.com/what-is-ot",
    "snippet": "Jan 8, 2026 · When a health condition makes life difficult, OT is here to help. Occupational therapy (OT) is a healthcare profession that helps people of all ages participate more fully in daily life."
  },
  {
    "title": "Occupational Therapy (OT): Who Needs It, Benefits, What To Expect",
    "url": "https://www.health.com/occupational-therapy-7508576",
    "snippet": "Sep 28, 2025 · Occupational therapy (OT) is a form of rehabilitation therapy that helps you perform daily tasks. It can improve physical, emotional, and social needs."
  },
  {
    "title": "What Is an Occupational Therapist? - WebMD",
    "url": "https://www.webmd.com/a-to-z-guides/what-is-an-occupational-therapist",
    "snippet": "Jul 16, 2025 · Occupational therapists have a Master's degree in occupational therapy. Some may also have a doctorate. A Master's degree takes two to three years to finish, and a doctoral degree about …"
  }
]