{
  "url": "https://whiplash.net/materias/news_681/371044-mutantes.html",
  "title": "As 15 maiores bandas de rock brasileiro de todos os tempos - Whiplash.Net",
  "text": "As 15 maiores bandas de rock brasileiro de todos os tempos Por Bruce William Postado em 08 de julho de 2025 O rock brasileiro tem muitas caras diferentes: rebeldia tropicalista, peso brutal, poesia urbana, deboche politizado. Fazer uma lista com os nomes mais importantes da sua história exige um critério que vá além de sucesso em rádio ou fama passageira. Por isso, o que você vai ver a seguir não é só uma seleção de bandas muito conhecidas e de extrema importância para o gênero, mas sim uma tentativa de juntar quem realmente teve peso no desenvolvimento do rock feito por aqui, nas mais variadas vertentes, sob a ótica deste que vos escreve. Melhores e Maiores - Mais Listas Entraram na lista tanto os que quebraram padrões com ideias novas quanto os que influenciaram inúmeras pessoas com suas letras afiadas, guitarras marcantes e uma postura contestadora que era, ao menos no passado, associada com o rock. Não valeu só tempo de estrada nem número de discos vendidos, apesar de, em alguns casos, isso ter pesado bastante. O critério principal foi outro: o legado deixado dentro do rock, seja pelo impacto cultural, reconhecimento fora do país ou por ter feito algo novo que ninguém tinha feito antes. E, principalmente, por ter colocado pelo menos um disco na roda que seja impossível de ignorar quando se fala em história do rock brasileiro. Nesse caminho, apesar da importância da Jovem Guarda na popularização do gênero no Brasil, nomes como Roberto Carlos, Erasmo Carlos e Wanderléa acabaram ficando de fora. Roberto saiu do rock muito cedo, Wanderléa foi por outro rumo, e o Erasmo chegou perto, principalmente com trabalhos como \"Carlos, Erasmo...\" de 1971, mas o disco virou cult só pra um grupo mais restrito que a grande massa, e sua trajetória acabou se diluindo entre vários estilos. Grandes nomes cultuados por poucos temos muitos. Mas o foco aqui teve que ser afinado assim: nomes que deixaram pelo menos um álbum incontornável no universo do rock nacional, e que certamente a grande maioria das pessoas ouviu falar e muito possivelmente até conhece as músicas. Outros chegaram a ser cogitados e bateram na trave, mas também ficaram de fora na triagem final - a ideia inicial era de 10 nomes, mas estava muito difícil decidir e eu me recusei a colocar 20 pois não estamos escrevendo uma enciclopédia, então fiquei na metade do caminho :) O Capital Inicial teve uma longa carreira e sucesso de público, mas não deixou um disco essencial. O Camisa de Vênus marcou época com provocação e irreverência, mas sem um álbum que tenha virado referência. Bandas lendárias como O Terço, Casa das Máquinas e Made in Brazil representam bem o rock setentista, mas sem registros que tenham atravessado o tempo com força suficiente. Já no punk e hardcore, grupos como Inocentes, Cólera e Garotos Podres foram importantes no nicho, mas o Ratos de Porão já cumpre esse papel com mais alcance. E nomes mais recentes e populares, como Charlie Brown Jr., Pitty e Detonautas, ainda não têm um disco com peso histórico suficiente pra entrar nesta seleção - ao menos, repetindo, sob a ótica desse autor. Mas, claro. Você é livre para concordar, discordar, reclamar e até xingar, se quiser :) Sem mais delongas, vamos à lista dos 15 nomes que NÃO podem ficar de fora do rock brasileiro. Os Mutantes Misturando psicodelia, tropicalismo e guitarras elétricas, com uma anarquia e subversão inédita para aquela época, Os Mutantes mudaram o som brasileiro no fim dos anos 60. Sem medo de experimentar, viraram influência fora do Brasil, mesmo sem ter feito sucesso de massa. Até hoje são citados por gente como Kurt Cobain e David Byrne. Disco de destaque: \"Jardim Elétrico\" (1971). Secos & Molhados Visual andrógino, letras cheias de poesia e um som que misturava glam, MPB e folk. O primeiro disco estourou em 1973 e virou fenômeno nacional. A banda abriu espaço pra que o rock fosse também teatro, performance e provocação. Disco de destaque: \"Secos & Molhados\" (1973). Raul Seixas Raul misturou rock'n'roll com tudo o que é brasileiro: baião, esoterismo, política, filosofia de boteco. Fez discos geniais, teve parcerias de peso e virou referência obrigatória pra qualquer geração. Um dos grandes gênios atormentados de nossa música. Disco de destaque: \"Krig-ha, Bandolo!\" (1973). Rita Lee Depois de sair dos Mutantes, Rita Lee voltou com tudo numa pegada mais direta e debochada. Com o Tutti Frutti, fez hits, criou hinos e virou símbolo do rock nacional dos anos 70. A rainha do rock nacional, sem sombra de dúvida. Disco de destaque: \"Fruto Proibido\" (1975). Blitz Mistura de música, humor e linguagem de rua, a Blitz estourou de cara e abriu as portas pro BRock nos anos 80. Apesar da veia mais pop-rock, seu primeiro disco foi um divisor de águas, tanto pelo som quanto pela estética. Disco de destaque: \"As Aventuras da Blitz\" (1982). Barão Vermelho Com Cazuza nos vocais e Frejat na guitarra, o Barão ganhou força no segundo disco, onde tudo soou mais afiado: letras mais cortantes, banda mais entrosada e o nascimento de \"Pro Dia Nascer Feliz\". Foi ali que a coisa engrenou de vez e o grupo se firmou como um dos pilares do BRock. Disco de destaque: \"Barão Vermelho 2\" (1983). Paralamas do Sucesso Rock com reggae, ska e elementos latinos. Os Paralamas criaram um estilo próprio com letras espertas e arranjos bem resolvidos. Têm carreira longa e discos que marcaram época. Disco de destaque: \"O Passo do Lui\" (1984). Titãs Começaram no embalo da new wave, mas logo abraçaram o peso e a crítica social. Oito caras no palco, letras ácidas e discos que explodiram na década de 80. Seu terceiro álbum é avassalador, um dos maiores marcos da história do rock nacional. Disco de destaque: \"Cabeça Dinossauro\" (1986). Legião Urbana Renato Russo virou porta-voz de uma geração com letras que falavam de política, religião, morte e tudo mais. A banda virou fenômeno e seus discos continuam relevantes até hoje, passados tantos anos. Disco de destaque: \"Dois\" (1986). RPM Banda pop com pegada de arena, visual forte e produção caprichada. Foram o maior fenômeno comercial do rock brasileiro nos anos 80. Não tem como não entrar em uma lista como essa. Disco de destaque: \"Rádio Pirata ao Vivo\" (1986). Engenheiros do Hawaii Letras existencialistas, melodias melancólicas e uma postura mais cerebral que trazem tanto muitos fãs como muitos detratores. Humberto Gessinger comandou várias fases da banda, sempre mantendo uma identidade forte. Disco de destaque: \"A Revolta dos Dândis\" (1987). Ratos de Porão Do punk ao thrash metal, os Ratos fizeram barulho aqui e lá fora. Letras de protesto, som pesadíssimo e respeito conquistado até fora do rock. Não tem ninguém que não conheça João Gordo, seu vocalista e integrante mais famoso. Disco de destaque: \"Brasil\" (1989). Sepultura O Sepultura levou o metal brasileiro pro mundo. Discos como \"Roots\" viraram referência global e botaram a banda nos maiores festivais do planeta. Disco de destaque: \"Roots\" (1996). Angra Metal melódico com técnica, velocidade e elementos da música brasileira. O primeiro disco já chegou causando impacto internacional, especialmente no Japão e Europa. Disco de destaque: \"Angels Cry\" (1993). Raimundos Punk sujo, forró pesado e letras escrachadas. Os Raimundos criaram uma identidade própria e foram a cara do rock nacional dos anos 90. Disco de destaque: \"Lavô Tá Novo\" (1995). Receba novidades do Whiplash.NetWhatsAppTelegramFacebookInstagramTwitterYouTubeGoogle NewsE-MailApps"
}