{
  "url": "https://www.cbsnews.com/news/russia-ukraine-war-us-trump-ceasefire-talks-ukrainians-skeptical-amid-strikes/",
  "title": "U.S. joins new round of talks with Ukraine and Russia, but Ukrainians skeptical of any major breakthrough - CBS News",
  "text": "U.S. joins new round of talks with Ukraine and Russia, but Ukrainians skeptical of any major breakthrough Kyiv — Ukraine's top negotiator Rustem Umerov confirmed Wednesday that a new round of trilateral peace talks involving Ukraine, Russia and the U.S. had begun in Abu Dhabi. The parties first met in the Emirati capital at the end of January, kicking off the first three-way negotiations since Russia launched its full-scale invasion of Ukraine almost four years ago. A U.S. official told CBS News that Wednesday's conversations \"were productive, and will continue tomorrow morning.\" U.S. officials labeled the first round \"the most constructive of the war,\" and they do appear to have led to the recent \"energy truce,\" with both sides halting attacks on each other's energy infrastructure for four days. But whatever momentum might have been generated by the first round of talks in January appeared to have dissipated by the start of the second gathering. Russia broke the brief truce in thundering fashion between Monday night and Tuesday morning, launching 450 drones and more than 60 missiles at Ukraine, according to Foreign Minister Andrii Sybiha, who said the strikes had left 1,170 apartment buildings in Kyiv without heating. Representatives from DTEK, Ukraine's largest private energy company, told CBS News the strikes were \"one of the worst attacks\" on the country's energy infrastructure of the entire war. President Volodymyr Zelenskyy called the strikes evidence that Russia's leaders \"do not take diplomacy seriously.\" \"These attacks did not come as a surprise to anyone. This is what Russia does,\" Yuriy Sak, an adviser to Ukraine's Ministry of Strategic Industries, told CBS News. \"On the one side, they continue to say they are interested in peace. On the other side, they destroy our infrastructure, bomb our people, and people are left without heat during these freezing months.\" Kremlin spokesman Dmitry Peskov said ahead of the negotiations in Abu Dhabi that Russian forces were \"striking targets they believe are associated with the Kyiv regime's military complex, and the operation continues.\" NATO Secretary General Mark Rutte, who visited Kyiv shortly after the attacks this week, said in a social media post that he had visited \"a civilian heating plant\" hit by Russian missiles on Tuesday. \"No military value whatsoever — attacks meant only to make people suffer.\" What to expect from the trilateral talks Two major sticking points have long hampered President Trump's efforts to get Russia and Ukraine to agree on a peace deal: Russian demands for Ukraine to formally cede territory Russia has occupied in the eastern Donbas region, and Ukrainian demands for credible guarantees from Western powers for protection if Russia tries to attack again after a ceasefire is reached. Zelenksyy made it clear late last year that the question of territorial concessions remained the biggest hurdle in the talks. It is unlikely to be resolved during this round of negotiations, according to Ukrainian foreign ministry spokesperson Georgiy Tykhyi, who told reporters as the talks began that, \"the most sensitive and complex issues, such as territorial issues,\" will be left for the countries' heads of state to discuss. But progress could be made on other issues, including how security guarantees for Ukraine would work once a hypothetical ceasefire does take effect. Ukraine and Russia have again sent delegations led by key military figures. Ukraine's team includes Kyrylo Budanov, the former head of military intelligence who now serves as Zelenskyy's chief of staff, while the Russian delegation is led by Igor Kostyukov, the head of the GRU military intelligence service. These are the same negotiators who met in Abu Dhabi at the end of January, which Sak, the Ukrainian adviser, said could help keep things moving, at least on the technical aspects of a peace deal. \"When military guys meet military guys, they can make progress, they speak the same language,\" he said. \"The concrete measures and steps within security guarantees — the military guys on both sides are well placed to discuss.\" \"I personally remain slightly skeptical of some solid outcome, but at the same time, I am surrounded by people here in Ukraine who believe that some real outcome might be possible soon,\" Sak said. \"When the moment comes and the leaders meet, the nuances and details will be worked out and hopefully we can reach a compromise that is just for Ukraine and just for the world.\""
}