{
  "url": "https://www.marcos.com/catering/",
  "title": "Irresistible Catering Solutions | Order Now at Marco's Pizza",
  "text": "Take care of business and a great meal. - Luncheons - Client meetings - Corporate events From corporate events to private parties, Marco’s Pizza ® has something for everyone, every occasion, and every budget. Set the table with delicious pizza, subs, sides, salads, and more when you cater with Marco’s. Scroll for catering details We offer contact-free delivery and individually packaged meal options, from small pizzas and Pizza Bowls to fresh subs, so you can safely satisfy your pizza craving. For immediate orders, build a group order for 2 or more people and let everyone pick exactly what they want. Take care of business and a great meal. Be honest. Is it really a party if it isn’t a pizza party? Share the love with something everyone loves: pizza. Marco’s Pizza is the perfect staple for any event, with dough made from scratch, an original sauce recipe, and three fresh signature cheeses. Each large pizza includes eight slices and is ideal for three adults. From birthdays to meetings, any event is sure to be delicious with pizza from Marco’s. Looking for more than pizza? Just look to our delicious subs and wings. From our Italiano and Chicken Club subs to meaty chicken wings with tangy BBQ or classic hot sauce, you’re guaranteed to please your crowd with these great additions to your event. Bring even more to the table with sides, salads, and dessert from Marco’s! Enjoy crisp salads, fresh-baked CheezyBread, and a sweet finish like our delicious CinnaSquares. There’s no better way to complete your event and leave everyone satisfied. We’re happy to serve any size guest list! Listed below are some suggested servings to feed your crew based on group size. These suggestions assume about 3 slices of pizza per person. Of course, we’ve never heard of anyone complaining about having extra pizza. Feeding more than 25? No worries, just double or triple serving suggestions as needed."
}