{
  "url": "https://www.ncregister.com/features/beauty-in-the-desert-santero-art",
  "title": "Beauty in the Desert: ‘Santero’ Art Fuses Local Traditions and Catholic Faith at Sacred Heart Spanish Market| National Catholic Register",
  "text": "Beauty in the Desert: ‘Santero’ Art Fuses Local Traditions and Catholic Faith at Sacred Heart Spanish Market The New Mexico cathedral’s annual event, which features ‘saint-making’ art practices dating back to colonial times, incorporates art, liturgy and communion. From his stall at the Sacred Heart Spanish Market in Gallup, New Mexico, master santero Charles Carrillo listed off his top-selling saints’ depictions: the pious St. Pascal in his kitchen (red chile ristras dangling from the ceiling), St. Isidore at his plow, or the ever-popular Our Lady of Guadalupe. Not many people buy Crucifixions, said Carrillo, surrounded by his colorful retablos, religious images painted on wood in a tradition that stretches back to colonial New Mexico. Still, he gestured toward one piece depicting Jesus hanging on the cross, wounds dripping red, and an angel with a chalice collecting the fountain of blood gushing from his side. Carrillo flashed a quick smile: “Hang that one up, and there’s no cutting corners” in announcing to houseguests that you’re Catholic, he said. Carrillo knows a thing or two about using the visual arts to express one’s Catholic devotion. A National Heritage Fellow with the National Endowment for the Arts, he’s one of the most influential living artists within the Spanish Colonial tradition, with a focus on the religious folk art that sprang out of New Mexican Hispanic culture and is the oldest Catholic art native to the United States. Carillo is not alone in keeping tradition alive, though: He was one of more than 40 acclaimed artists hosted by the Diocese of Gallup in New Mexico during Sacred Heart Cathedral’s eighth Spanish Market, which took place June 9-11. It’s an annual showcase that reflects both the deep, Catholic roots of the region and an adherence to traditional art forms handed down for generations. As Catholics, “we have a history with this,” Bishop James Wall of Gallup told the Register. “We put forth things that are good and true and beautiful, and we see that in the arts,” especially the “real natural beauty” of the santero (“saint-maker”) tradition. Tradition and Living Faith As the self-described “poorest diocese in the United States,” with a majority-Native American population, the Church in Gallup might seem an unlikely host for artists who also show yearly at the prestigious, juried Spanish Market in tony Santa Fe, 200 miles away, many with pieces that easily sell for thousands of dollars. Gallup itself is the largest city in western New Mexico’s McKinley County, which has a poverty rate three times the national average — the highest in the state. Still, Bishop Wall, himself an Arizona native, finds it fitting that a Catholic art tradition born in the Southwest would find a home at his cathedral. “From being a little boy to being a 58-year-old bishop,” he said, santero art “is something that helps me to have a real and personal encounter with Jesus Christ.” So the bishop jumped at the opportunity to begin hosting the artists. The result is not just an art festival featuring religious subjects, but something more like a family reunion centered around art and the liturgy. The market’s spiritual highpoint is Sunday Mass and a Eucharistic procession. Talking to many of the artists, one would be hard-pressed to find a dividing line between heritage and living faith, or between the tradition of painting saints and an awareness of communion with them. Reverence for the faith and techniques of the past translates to an invigorated desire to create anew and hand down the old methods for the future. It’s a flourishing example of the collaboration between the Church and the arts, a partnership that not only creates beauty and safeguards a tradition, but evangelizes in the process. “I notice that every time I introduce others to [santero art], whether they’re local ... or from across the world, it has a profound effect on them,” Bishop Wall said, “because it’s a beautiful expression of our Catholic faith.” Homegrown, Catholic Art While the Church has had a foothold in New Mexico since the days of the early conquistadors, Catholic life in the colonial era was never easy. When the first Spanish settlers came up to New Mexico from Mexico in 1598, their caravan included Franciscan friars intent on building mission churches and converting the Pueblo natives. When it came to religious art for their churches, this left settlers in the lurch: The friars would move on to their next mission, carrying their paintings and statues with them. The rugged, mountainous geography of northern New Mexico, where the first settlement was located, added to the early New Mexicans’ isolation from the established Church, and the 1680 Pueblo Revolt — one of the most impactful and significant Native uprisings against a colonizing presence in the United States — drove the Spanish out of New Mexico for over a decade, along with their Christian images. “Prompted by legitimate grievances,” the Archdiocese of Santa Fe recalls on the history section of its website, “the Native Americans destroyed all that reminded them of the Spanish and their God.” When the Spanish, including the Franciscans, returned in 1693, it was to ground that was effectively burned and salted in terms of Catholicism. Still, they began again — and with notably more tolerance toward the religious practices of the Natives, some of whom had held on to Christianity during the friars’ absence. The following decades saw an explosion of creativity from New Mexican folk artists, as they used what was available to them and developed their own homegrown traditions of painting, carving, embroidering, metalwork, and other forms of craftsmanship, much of it reflecting their own piety. The faith that comes through in the art is the faith of a culture that quickly learned it needed to depend on itself to hand down religious truths, as well as artistic traditions. The santos themselves are created in an immediately recognizable style, a folk iconography recalling the constraints of the artists and the natural world around them to which they turned for materials. With canvases in short supply, wooden planks served in their place, hewn from the mountain forests. Wooden bultos — three-dimensional carved saints — graced altar niches and homes long before trains brought cheap plaster saints in the European style. Scraps of tin could be punched and embossed to adorn retablos. Bits of straw — some tinier than a grain of rice — were appliquéd onto wooden crosses, imitating inlaid gold or mother of pearl against a dark stain. And then there are the colors: yellow, from chamisa, a native shrub that dots the scrubby hillsides; red, from cochineal, a tiny, parasitic insect gathered from its host plant and processed into a dry powder. Carrillo, who has a doctorate in anthropology and a dogged tenacity for reverse-engineering the early santeros’ materials and techniques, still exults in how he pinpointed the western New Mexican mine that produced the azurite for the exact shade of blue referenced by an influential 18th-century santero. Passing on a Heritage Speaking of blue, Carrillo always paints Franciscan saints with a blue-tinted habit, rather than the brown the friars are often depicted wearing. Historical documents say the missionaries dyed their habits in indigo, he argues, in honor of Mary’s immaculate conception. “If my ancestors saw a blue, tonsured male with skull and cross, you can bet your booties they knew it was St. Francis,” he said. “They learned that. And that’s what I want to pass on … to read an image without reading words.” Santero iconography has other distinctive traits. Carrillo has seen retablos where the serpentine devil under St. Michael’s feet is portrayed with bat wings or a rattlesnake’s tail. And rather than the lilies more common in Catholic symbolism, St. Joseph often carries hollyhock, known as vara de San José — Joseph’s staff — in New Mexico. When Carrillo began showing at Santa Fe’s Spanish Market in the early ’80s, most santeros weren’t painting with natural pigments and traditional methods. Carrillo changed that. Along with his relentless research and experimentation, which has unlocked a wealth of buried wisdom, he’s a generous mentor. In 2006, when the NEA named him a National Heritage Fellow, Carrillo estimated he had mentored three-quarters of the artists then showing at the market. The use of traditional materials is now the standard at the prestigious show, where entires are judged according to rigorous standards. “I realized that was something that needed to be passed on,” Carillo told the Register. And while he’s not against innovation, artists need to “have a foundation, know what your ancestors did first, and then you can defend what you’re doing.” That doesn’t mean traditional methods are easy. The first time santero Jerry Montoya tried processing cochineal (the red pigment extracted from insects) at home was a disaster. “Man, I made a [heck] of a mess in my kitchen,” Montoya said with a laugh. Montoya brings his retablos, bultos, tinwork and silver jewelry to the Sacred Heart Spanish Market, which he has organized from the beginning. He calls Carrillo “his biggest mentor,” along with master santera Arlene Cisnero Sena, who was also present in Gallup and whose work adorns Bishop Wall’s private chapel and an altar screen at the cathedral-basilica in Santa Fe. “I always said I was Hispanic, and I was an artist, but I wasn’t a Hispanic artist because I wasn’t doing cultural work,” said Montoya, whose family line includes the first Hispanic, 19th-century governor of New Mexico. In his 40s, though, he started meeting santeros and took an apprenticeship, a decision that felt more like a homecoming than merely learning another genre of art. “I followed my culture,” he said — the culture of his grandparents, whose houses in northern New Mexico were filled with santos and had a holy water font by the front door. Montoya says he grew up poor and moved around the state as a child. Returning to the santos was grounding. “I finally felt a belonging,” he said. “I found where I was supposed to be.” For Montoya and Carrillo, the spiritual fruits of the santero tradition infuse their whole creative process. “Most santeros, while they’re painting or carving, they pray as they do it,” Montoya said. Carrillo’s professional dedication to the communion of saints likewise spills over to his devotion. “I always tell my students … you cannot have spirituality by yourselves,” he said. “[It] happens in the presence of other people” in the community of faith. Beauty in the Desert Montoya, who knew Bishop Wall was an enthusiastic attendee at the Santa Fe Spanish Market, had been organizing another, smaller art festival in his hometown of Grants, between Gallup and Albuquerque. After 20 years, that festival had run its course. Montoya was ready to fold up; and then the cathedral reached out, and Sacred Heart Spanish Market was established in 2015 (with a year off at the height of COVID in 2020). The collaboration makes perfect sense from Montoya’s perspective, both as a Catholic and an artist. “The better the artist, the better the image,” he said. “The saints were real people, and how they’re portrayed” will make a difference in the faith and prayer life of the person in front of them. In terms of those saints, the Sacred Heart market has a heavy representation of those that Carrillo calls top sellers. But there were also instances of artists reaching further afield to bring the Church’s wealth of saints into a Southwestern context: several Dominics, an homage to the Dominican Sisters of Mary, Mother of the Eucharist, who will begin teaching at Sacred Heart Cathedral’s school this fall; a Hildegard of Bingen, with her Scivias manuscript standing among distinctly New Mexican hills; and an exquisite Kateri painted on a clay tablet, the “Lily of the Mohawks” now holding corn tassels and wearing the ceremonial garb of a Pueblo woman. Albert Alvidrez is a member of the Ysleta del Sur Pueblo-Tigua Indian Reservation in El Paso County, Texas. He pointed out the Pueblo-inspired, geometric designs bordering his Kateri piece or filling in clay crosses — thin, parallel lines that petition for rain; birds as message carriers to heaven. Whether pulling from Native or Catholic tradition, Alvidrez has realized, art depicts a universal, human longing. He doesn’t see them in competition. “The petitions are the same,” he said, albeit “in a different language.” While Bishop Wall acknowledges New Mexico’s unique claim as the birthplace of such traditionally Catholic art, he thinks the Sacred Heart Spanish Market has lessons for the wider Church, too — and says that the fruit is worth it. “Our own art show started small,” he said. “Don’t be afraid to start something like this, whatever the form of the art is.” The Sunday of the market always falls on the Solemnity of Corpus Christi. After Mass, the artists lead a Eucharistic procession outside the cathedral, following the bishop and carrying one of their pieces. Every year, Bishop Wall is profoundly moved: “It’s giving their best for God.” For Alvidrez this year, he carried his depiction of St. Kateri. He was surrounded by retablos, silver crosses, bultos and more, including an embroidered tapestry depicting Adam and Eve in a New Mexican Garden of Eden. Embroiderer Julia Gomez said that when her daughter was young and reading a children’s Bible, she would look up, quizzical, from the illustrations. “Did Adam and Eve name our plants and animals in New Mexico, too?” Gomez remembered her asking. Years later, this was Gomez’s answer: In her tapestry, the first man and woman walk among yucca, cactus and chamisa dotting the hills. A bear and bison stand near Eve (there’s bison hair woven in, Gomez modestly explained); and a cougar, elk and wolf look out from their mountain view. The breath of creation is still on this landscape, like the cool morning air of the mountains as it meets the river and foothills teeming with life below. At the procession, around Gomez, the artists held their own creations, singing hymns in Spanish and leading the rest of the congregation in worship of Jesus in the Eucharist. There is beauty in the desert, and it is good."
}