{
  "url": "https://www.goal.com/br/notícias/santos-sao-paulo-onde-assistir-ao-vivo-transmissao-escalacoes-horas-brasileirao-2026/blt232b45c369f5b747",
  "title": "Santos x São Paulo: onde assistir ao vivo, transmissão, escalação, que horas começa e mais do Brasileirão 2026 | Goal.com Brasil",
  "text": "Santos e São Paulo se enfrentam nesta quarta-feira (4), às 20h (de Brasília), na Vila Belmiro, pela segunda rodada do Campeonato Brasileiro 2026. A partida terá transmissão ao vivo do Premiere no pay-per-view (veja a programação completa). Notícias e prováveis escalações Derrotado pelo São Paulo por 2 a 0 na última rodada do Paulistão, o Santos tenta se reabilitar no Brasileirão após estrear com derrota por 4 a 2 para a Chapecoense. A principal novidade do técnico Juan Pablo Vojvoda pode ser o retorno de Neymar. O camisa 10 tem chances de aparecer entre os relacionados depois de se recuperar de uma artroscopia no joelho esquerdo. Na temporada 2026, o Peixe soma uma vitória, três empates e três derrotas, com seis gols marcados e dez sofridos. Do outro lado, o São Paulo iniciou o Brasileirão com vitória por 2 a 1 sobre o Flamengo e busca manter o aproveitamento de 100% para se firmar nas primeiras posições da tabela. Para o clássico, o técnico Hernán Crespo pode promover alterações na equipe, visando o controle de carga física e a prevenção de lesões neste início de temporada. Santos: Gabriel Brazão; Mayke, Adonis Frías, Luan Peres (Zé Ivaldo), Escobar; João Schmidt, Gabriel Menino, Rollheiser (Neymar); Barreal, Rony, Gabriel Barbosa. São Paulo: Rafael, Arboleda, Alan Franco e Sabino; Maik, Marcos Antonio, Bobadilla, Pablo Maia (Danielzinho) e Enzo Diaz; Luciano e Tapia (Calleri). Desfalques Santos Willian Arão e Thaciano seguem fora. São Paulo Oscar, André Silva e Ryan Francisco estão machucados. Quando é? - Data: quarta-feira, 4 de fevereiro de 2026 - Horário: 20h (de Brasília) - Local: Vila Belmiro - Santos, SP Retrospecto recente Últimos confrontos diretos Em 327 confrontos na história, o São Paulo leva vantagem sobre o Santos, com 141 vitórias, contra 110 do Peixe, além de 76 empates. No último encontro válido pelo Paulistão de 2026, o Tricolor venceu por 2 a 0. Classificação Como assistir de qualquer lugar com VPN Se você estiver no exterior, pode precisar usar uma rede virtual privada (VPN) para assistir jogos usando seu serviço de streaming. Uma VPN, como o NordVPN, permite estabelecer uma conexão segura online. Se você não tem certeza de qual VPN usar, confira o guia da GOAL sobre os melhores VPNs para transmissão de esportes."
}