{
  "url": "https://www.boursorama.com/cours/FF11-ABI/",
  "title": "AB INBEV Cours Action ABI, Cotation Bourse Euronext Bruxelles - Boursorama",
  "text": "Carnet d'ordres Comparer FermerComparer avec un indice Comparer avec un titre du secteur Comparer avec une autre valeur Configurer le graphique FermerParamètres Vos modifications sont automatiquement prises en compte. Fermez la fenêtre une fois vos paramètres sélectionnés. Historique 5 jours Variation sur 5 jours : +6,64% Risque ESG 0-10 Négligeable 10-20 Faible 20-30 Moyen 30-40 Élevé 40+ Sévère Données clés Tonnes de CO₂ émises par million d'euros de revenu généré : 79,8 Niveau de controverse : Modéré Implications dans des activités ayant un impact positif : 0/12 Implications dans des activités ayant un impact négatif : 1/23 Accès à l'onglet durabilitéConsensus des analystes au 03/02/26* Objectif de cours 3 mois : 67,28 EUR - Potentiel: 5,79% 1. Acheter 2. Renforcer 3. Conserver 4. Alléger 5. Vendre Copyright © 2026 FactSet Research Systems Inc. All rights reserved. Évolution des prévisions au 04/02/26 Copyright © 2026 FactSet Research Systems Inc. All rights reserved. évènements Pas d'évènement en cours Derniers communiqués Cette société n'est pas adhérente au service de diffusion des communiqués de presse sur Boursorama. Sociétés cotées, pour paraître dans cette rubrique, veuillez nous contacter à l'adresse suivante : contact-cp@boursorama.fr Dernières transactions Consulter les dernières transactions de la journée FermerDernières actualités - 08:34 information fournie par Reuters - 07 janv. information fournie par Reuters - 06 janv. information fournie par Reuters - 06 janv. AB InBev reprend à 100% ses usines de cannettes aux Etats-Unis information fournie par Zonebourse - 16 déc. 2025 information fournie par Reuters - 28 nov. 2025 AB InBev à la traîne à Bruxelles, Deutsche Bank n'est plus acheteur information fournie par Zonebourse - 05 nov. 2025 Les bénéfices des groupes européens meilleurs que prévu au T3 information fournie par Reuters - 05 nov. 2025 information fournie par Reuters - 30 oct. 2025 Les redistributions de liquidités d'AB InBev éclipsent un 3ème trimestre mitigé information fournie par Zonebourse - 22 sept. 2025 information fournie par Reuters Données historiques Dernières analyses - 11 déc. 2025 information fournie par Reuters - 19 nov. 2025 KBC reste à achat sur AB InBev, juge sa valorisation attractive information fournie par Zonebourse - 18 sept. 2025 AB InBev: UBS ajuste son objectif de cours information fournie par Zonebourse - 27 juin 2025 AB InBev: 'idée d'achat' chez Deutsche Bank information fournie par Zonebourse - 16 juin 2025 AB InBev: objectif de cours rehaussé chez UBS information fournie par Zonebourse Qui a recommandé ce message ? FermerL'ensemble des analyses et/ou recommandations présentes sur le forum BOURSORAMA sont uniquement élaborées par les membres qui en sont émetteurs. Agissant exclusivement en qualité de canal de diffusion, BOURSORAMA n'a participé en aucune manière à leur élaboration ni exercé aucun pouvoir discrétionnaire quant à leur sélection. Les informations contenues dans ces analyses et/ou recommandations ont été retranscrites \"en l'état\", sans déclaration ni garantie d'aucune sorte. Les opinions ou estimations qui y sont exprimées sont celles de leurs auteurs et ne sauraient refléter le point de vue de BOURSORAMA. Sous réserves des lois applicables, ni l'information contenue, ni les analyses qui y sont exprimées ne sauraient engager la responsabilité BOURSORAMA."
}