{
  "url": "https://help.hbomax.com/us/Answer/Detail/000002557",
  "title": "HBO Max | Find out how to connect your internet, mobile, or TV provider to your HBO Max account so you can start streaming.",
  "text": "Connect your provider If you get HBO Max through an internet, mobile, or TV provider, you need to connect your provider account (with your HBO Max subscription) before signing in to HBO Max for the first time. - If you already have an HBO Max account, sign in with your account email and password. - If you get HBO Max through the Disney+, Hulu, HBO Max Bundle or Philo, go to Activate HBO Max then sign in. Choose the device you're using: Here's how to connect your provider: - Open HBO Max and choose Sign in. Already signed in? Choose your profile and then Sign Out. - On the sign-in screen, choose create an HBO Max account (below Don't have an HBO Max account yet?). - Choose who you get HBO Max (or HBO) through or search for your provider. My provider isn't listed. - On your provider's sign-in screen, enter your provider account info and sign in. Need help? Go to Troubleshooting. - Enter an email address for your HBO Max account. Already have an account? Enter the email address associated with your HBO Max account. - If prompted, do one of the following: - New subscribers: Complete the account form and choose Create Account. - Returning subscribers: Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code) and enter the 6-digit code from your email. This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). - Choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. Troubleshooting If you get this message, make sure HBO Max is included with your internet, mobile, or TV package. To do this, sign in to your internet, mobile, or TV provider account to check the status of your HBO Max subscription. If you need help, contact your provider. For more info, go to Fix HBO Max subscription issue. Apple iPhone or iPad If you get this message on your iPhone or iPad, try removing your TV provider from your iOS settings. Here's how: - Close the HBO Max app. - On your Apple iPhone or iPad, go to Settings > General > TV Provider. Under Allow TV provider to access, turn off HBO Max. - Open HBO Max and try connecting your provider again. If you get this message when connecting your provider, it means your provider account is already linked to an HBO Max account. Instead of connecting your provider, try signing in with your HBO Max account email and password. If you're not sure which email is associated with your HBO Max account, go to Find your account email. If you can't sign in to your internet, mobile, or TV provider account, make sure you can sign in on your provider's website. Here's how: - Go to your internet, mobile, or TV provider's website. - Sign in with your provider account. Note If you can't sign in, look for an option to reset your password. If this doesn't help, please contact your provider for help. HBO Max Support doesn't have access to your provider sign-in information. - After you successfully sign in on your provider's website, go back to HBO Max and try the Connect your provider steps again. If you have an active HBO Max subscription and get a Welcome back message, go to Fix an HBO Max subscription issue. Here's how to connect your provider: - Go to HBOMax.com/login on your computer. Already signed in? Choose your profile and then Sign Out. - On the sign-in screen, choose create an HBO Max account (below Don't have an HBO Max account yet?). - Choose who you get HBO Max (or HBO) through or search for your provider. My provider isn't listed. - On your provider's sign-in screen, enter your provider account info and sign in. Need help? Go to Troubleshooting. - Enter an email address for your HBO Max account. Already have an account? Enter the email address associated with your HBO Max account. - If prompted, do one of the following: - New subscribers: Complete the account form and choose Create Account. - Returning subscribers: Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code) and enter the 6-digit code from your email. This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). - Choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. Troubleshooting If you get this message, make sure HBO Max is included with your internet, mobile, or TV package. To do this, sign in to your internet, mobile, or TV provider account to check the status of your HBO Max subscription. If you need help, contact your provider. For more info, go to Fix HBO Max subscription issue. If you get this message when connecting your provider, it means your provider account is already linked to an HBO Max account. Instead of connecting your provider, try signing in with your HBO Max account email and password. If you're not sure which email is associated with your HBO Max account, go to Find your account email. If you can't sign in to your internet, mobile, or TV provider account, make sure you can sign in on your provider's website. Here's how: - Go to your internet, mobile, or TV provider's website. - Sign in with your provider account. Note If you can't sign in, look for an option to reset your password. If this doesn't help, please contact your provider for help. HBO Max Support doesn't have access to your provider sign-in information. - After you successfully sign in on your provider's website, go back to HBO Max and try the Connect your provider steps again. If you have an active HBO Max subscription and get a Welcome back message, go to Fix an HBO Max subscription issue. Choose your TV device: Here's how to connect your provider: - Open HBO Max on your TV and choose Sign In. Already signed in? Choose the Settings icon and then Sign Out. - Now, choose an option: - Stay on the TV screen with the QR code and do one of the following: - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). -or- - On your phone or computer, go to HBOMax.com/signin. Then, enter the 6-digit code from your TV. TV code not working? - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). - On the sign-in screen, choose create an HBO Max account (below Don't have an HBO Max account yet?). - Choose who you get HBO Max (or HBO) through or search for your provider. My provider isn't listed. - On your provider's sign-in screen, enter your provider account info and sign in. Need help? Go to Troubleshooting. - Enter an email address for your HBO Max account. Already have an account? Enter the email address associated with your HBO Max account. - If prompted, do one of the following: - New subscribers: Complete the account form and choose Create Account. - Returning subscribers: Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code) and enter the 6-digit code from your email. This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). - On your TV, choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. Connect your provider using the HBO Max mobile app. Here's how: - Choose Use HBO Max Mobile App (on the left). (This option is not available on all TV devices.) - Open the HBO Max app on your phone or tablet. - If you haven't connected your provider account to HBO Max, follow the Connect your provider steps. - Once connected, close and reopen the HBO Max mobile app. - Choose Allow in the HBO Max mobile app. - On your TV, choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. If you didn't get a prompt in the HBO Max mobile app, try the following: - Make sure your mobile device and TV device are connected to the same Wi-Fi network. - Close and reopen the HBO Max mobile app. - Try connecting your provider another way (e.g. Use a Code). - Choose Use Email Address (on the left) and then choose Activate. - If prompted, do one of the following: - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). -or- - On your phone or computer, go to HBOMax.com/providers. Then, enter the 6-digit code from your TV. TV code not working? - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). - Choose who you get HBO Max (or HBO) through or search for your provider. My provider isn't listed. - On your provider's sign-in screen, enter your provider account info and sign in. Need help? Go to Troubleshooting. - Enter an email address for your HBO Max account. Already have an account? Enter the email address associated with your HBO Max account. - If prompted, do one of the following: - New subscribers: Complete the account form and choose Create Account. - Returning subscribers: Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code) and enter the 6-digit code from your email. This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). - On your TV, choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. Here's how to connect your provider: - Install the HBO Max app on your TV device. - Open HBO Max and choose Connect Your Provider. Already signed in? Choose the Settings icon and then Sign Out. - Now, choose a connect option: Connect your provider using a code. Here's how: - Stay on the TV screen with the QR code and do one of the following: - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). -or- - On your phone or computer, go to HBOMax.com/providers. Then, enter the 6-digit code from your TV. TV code not working? - Open your phone's camera app and point your camera at the QR code on your TV. Then, tap the link that appears on your phone (iPhone or Android QR steps). - Choose who you get HBO Max (or HBO) through or search for your provider. My provider isn't listed. - On your provider's sign-in screen, enter your provider account info and sign in. Need help? Go to Troubleshooting. - Enter an email address for your HBO Max account. Already have an account? Enter the email address associated with your HBO Max account. - If prompted, do one of the following: - New subscribers: Complete the account form and choose Create Account. - Returning subscribers: Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code) and enter the 6-digit code from your email. This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). - On your TV, choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. Connect your provider using the HBO Max mobile app. Here's how: - On the TV screen with the QR code, choose Use HBO Max Mobile App (on the left). (This option is not available on all TV devices.) - Open the HBO Max app on your phone or tablet. - If you haven't connected your provider account to HBO Max, follow the Connect your provider steps. - Once connected, close and reopen the HBO Max mobile app. - Choose Allow in the HBO Max mobile app. - On your TV, choose who's watching and you're ready to stream. If you added a password to your HBO Max account, you can sign in on any supported device using your HBO Max email and password. If you didn't get a prompt in the HBO Max mobile app, try the following: - Make sure your mobile device and TV device are connected to the same Wi-Fi network. - Close and reopen the HBO Max mobile app. - Try connecting your provider another way (e.g. Use a Code). Troubleshooting If you get this message, make sure HBO Max is included with your internet, mobile, or TV package. To do this, sign in to your internet, mobile, or TV provider account to check the status of your HBO Max subscription. If you need help, contact your provider. For more info, go to Fix HBO Max subscription issue. Apple TV If you get this message on your Apple TV, try removing your TV provider from your tvOS settings: - Close the HBO Max app. - On your Apple TV, go to Settings > Users and Accounts > TV Provider. Under Allow TV provider to access, turn off HBO Max. - Open HBO Max and try connecting your provider again. If the 6-digit code isn't working, here are some things to try: - Open a private or incognito browser window and then go to HBOMax.com/providers. - Try using a different supported browser (Chrome, Firefox, Microsoft Edge, or Safari). - Try scanning the QR code on your TV with your phone's camera app (instead of going to HBOMax.com/providers). If this doesn't help, try the Connect provider steps on a different device (computer or phone). Once you connect to your provider (and create an HBO Max account), you can sign in on your TV using your HBO Max email and password. If you get this message when connecting your provider, it means your provider account is already linked to an HBO Max account. Instead of connecting your provider, try signing in with your HBO Max account email and password. If you're not sure which email is associated with your HBO Max account, go to Find your account email. If you can't sign in to your internet, mobile, or TV provider account, make sure you can sign in on your provider's website. Here's how: - Go to your internet, mobile, or TV provider's website. - Sign in with your provider account. Note If you can't sign in, look for an option to reset your password. If this doesn't help, please contact your provider for help. HBO Max Support doesn't have access to your provider sign-in information. - After you successfully sign in on your provider's website, go back to HBO Max and try the Connect your provider steps again. If you have an active HBO Max subscription and get a Welcome back message, go to Fix an HBO Max subscription issue. Still need help? Go to Can't connect provider. You may need to periodically sign in to your internet, mobile, or TV provider account that includes access to HBO Max. If you're asked to sign in again, choose Connect Your Provider, then choose your provider, and sign in to your provider account."
}