{
  "url": "https://www.jewfaq.org/who_is_a_jew",
  "title": "Who Is A Jew? - Judaism 101 (JewFAQ)",
  "text": "﻿ Level: Basic The original name for the people we now call Jews was Hebrews. The word \"Hebrew\" (in Hebrew, \"Ivri\") is first used in the Torah to describe Abraham (Gen. 14:13). The word is apparently derived from the name Eber, one of Abraham's ancestors. Another tradition teaches that the word comes from the word \"eyver,\" which means \"the other side,\" referring to the fact that Abraham came from the other side of the Euphrates, or referring to the fact Abraham was separated from the other nations morally and spiritually. Another name used for the people is Children of Israel or Israelites, which refers to the fact that the people are descendants of Jacob, who was also called Israel. The word \"Jew\" (in Hebrew, \"Yehudi\") is derived from the name Judah, which was the name of one of Jacob's twelve sons. Judah was the ancestor of one of the tribes of Israel, which was named after him. Likewise, the word Judaism literally means \"Judah-ism,\" that is, the religion of the Yehudim. Other sources, however, say that the word \"Yehudim\" means \"People of G-d,\" because the first three Hebrew letters of \"Yehudah\" are the same as the first three letters of G-d's four-letter name. Originally, the term Yehudi referred specifically to members of the tribe of Judah, as distinguished from the other tribes of Israel. However, after the death of King Solomon, the nation of Israel was split into two kingdoms: the kingdom of Judah and the kingdom of Israel (I Kings 12; II Chronicles 10). After that time, the word Yehudi could properly be used to describe anyone from the kingdom of Judah, which included the tribes of Judah, Benjamin and Levi, as well as scattered settlements from other tribes. The most obvious biblical example of this usage is in Esther 2:5, where Mordecai is referred to as both a Yehudi and a member of the tribe of Benjamin. In the 6th century B.C.E., the kingdom of Israel was conquered by Assyria and the ten tribes were exiled from the land (II Kings 17), leaving only those living in the kingdom of Judah remaining to carry on Abraham's heritage. These people of the kingdom of Judah were generally known to themselves and to other nations as Yehudim (Jews), and that name continues to be used today. In common speech, the word \"Jew\" is used to refer to all of the physical and spiritual descendants of Jacob/Israel, as well as to the patriarchs Abraham and Isaac and their wives, and the word \"Judaism\" is used to refer to their beliefs. Technically, this usage is inaccurate, just as it is technically inaccurate to use the word \"Indian\" to refer to the original inhabitants of the Americas. However, this technically inaccurate usage is common both within the Jewish community and outside of it, and is therefore used throughout this site. Some gentiles have told me that they thought \"Jew\" was an offensive term, not to be used, the \"J\" word, like the \"N\" word. The word is not offensive by itself, though it is sometimes used offensively as an adjective (Jew lawyer; Jew bastard) or as a verb (Jewed him down) or just generally spat out with an air of hatred. But actually, I knew someone who was offended by the preference for Jewish, saying that the latter term implied \"less Jew\" in the same way that pinkish is less pink, and he was offended that people preferred to be less Jew (or maybe he was just being funny...). I think a lot of Jews are more comfortable with the term Jewish, particularly when it comes from someone who is not Jewish and whose reason for using the word is in question. Why would most people in most contexts have any need to identify someone as a Jew? Traditionally, a Jew is any person whose biological mother was a Jew or any person who has gone through the formal process of conversion to Judaism. It is important to note that being a Jew has nothing to do with what you believe or what you do. A person born to non-Jewish parents who has not undergone the formal process of conversion but who believes everything that Orthodox Jews believe and observes every law and custom of Judaism is still a non-Jew, even in the eyes of the most liberal movements of Judaism, and a person born to a Jewish mother who is an atheist and never practices the Jewish religion is still a Jew, even in the eyes of the ultra-Orthodox. In this sense, Judaism is more like a nationality than like other religions, and being Jewish is like a citizenship. See What Is Judaism? This has been established since the earliest days of Judaism. In the Torah, you will see many references to \"the strangers who dwell among you\" or \"righteous proselytes\" or \"righteous strangers.\" These are various classifications of non-Jews who lived among Jews, adopting some or all of the beliefs and practices of Judaism without going through the formal process of conversion and becoming Jews. Once a person has converted to Judaism, he is not referred to by any special term; he is as much a Jew as anyone born Jewish. Although all Jewish movements agree on these general principles, there are occasional disputes as to whether a particular individual is a Jew. Most of these disputes fall into one of two categories. First, traditional Judaism maintains that Jewish status passes through the mother, regardless of who his father is. The liberal movements, on the other hand, allow Jewish status to pass through the mother or the father if the child identifies as Jewish. For example, former Phillies catcher Mike Lieberthal, who had a Jewish father but chooses not to be identified as Jewish, would not be Jewish according to the Reform movement, but former Congresswoman Gabrielle Giffords, who had a Jewish father and adopted a Jewish identity as an adult, would be considered Jewish. See their position here). On the other hand, the child of a Christian father and a Jewish mother who does not publicly identify himself as Jewish would be considered Jewish according to the Orthodox movement, but not according to the Reform movement. Actor Harrison Ford would fit into this category: his mother's parents were Jewish, but he does not particularly consider himself to be of any religion, so Orthodox would count him toward a minyan if he showed up for services. The matter becomes even more complicated, because the status of that interfaith child's children also comes into question. Suppose a woman was born to a Jewish father and Christian mother and was raised in a Reform congregation always understanding herself to be completely Jewish. As an adult, she wants to marry a Conservative man only to find out that she has to convert so their children would be Jewish by Conservative standards! Second, the more traditional movements do not always acknowledge the validity of conversions by the more liberal movements. A more liberal movement might not follow the procedures required by the more traditional movement, thereby invalidating the conversion. For example, Orthodoxy requires acceptance of the yoke of Torah (obligation to observe Jewish law as Orthodoxy understands it), while other movements would not teach the same laws that Orthodoxy does and might not require observance. The Conservative movement requires circumcision and immersion in a mikvah, which is not always required in Reform conversions. Many people have asked me why traditional Judaism uses matrilineal descent to determine Jewish status, when in all other things (tribal affiliation, priestly status, royalty, etc.) we use patrilineal descent. The Torah does not specifically state anywhere that matrilineal descent should be used; however, there are several passages in the Torah where it is understood that the child of a Jewish woman and a non-Jewish man is a Jew, and several other passages where it is understood that the child of a non-Jewish woman and a Jewish man is not a Jew. In Deuteronomy 7:1-5, in expressing the prohibition against intermarriage, G-d says \"he [i.e., the non-Jewish male spouse] will cause your child to turn away from Me and they will worship the gods of others.\" No such concern is expressed about the child of a non-Jewish female spouse. From this, we infer that the child of a non-Jewish male spouse is Jewish (and can therefore be turned away from Judaism), but the child of a non-Jewish female spouse is not Jewish (and therefore turning away is not an issue). Leviticus 24:10 speaks of the son of an Israelite woman and an Egyptian man as being \"among the community of Israel\" (i.e., a Jew). On the other hand, in Ezra 10:2-3, the Jews returning to Israel vowed to put aside their non-Jewish wives and the children born to those wives. They could not have put aside those children if those children were Jews. Several people have written to me asking about King David: was he a Jew, given that one of his female ancestors, Ruth, was not a Jew? This conclusion is based on two faulty premises: first of all, Ruth was a Jew, and even if she wasn't, that would not affect David's status as a Jew. Ruth converted to Judaism before marrying Boaz and bearing Obed. See Ruth 1:16, where Ruth states her intention to convert. After Ruth converted, she was a Jew, and all of her children born after the conversion were Jewish as well. But even if Ruth were not Jewish at the time Obed was born, that would not affect King David's status as a Jew, because Ruth is an ancestor of David's father, not of David's mother, and David's Jewish status is determined by his mother. In March, 1997, the Agudath Ha-Rabonim issued a statement declaring that the Conservative and Reform movements are \"outside of Torah and outside of Judaism.\" This statement was widely publicized at the time and widely misunderstood, and requires some response. Three points are particularly worth discussing: 1) the statement does not challenge the Jewish status of Reform and Conservative Jews; 2) the statement is not an official statement of a unified Orthodox opinion; 3) the statement was made with the intent of bringing people into Jewish belief, not with the intention of excluding them from it. First of all, the Agudath Ha-Rabonim statement does not say that Reform and Conservative Jews are not Jews. Their statement does not say anything about Jewish status. As the discussion above explains, status as a Jew has nothing to do with what you believe; it is simply a matter of who your parents are. Reform and Conservative Jews are Jews, as they have always been, and even the Agudath Ha-Rabonim would agree on that point. The debate over who is a Jew is the same as it has always been, the same as was discussed above: the Reform recognition of patrilineal decent, and the validity of conversions performed by non-Orthodox rabbis. Second, the Agudath Ha-Rabonim is not the official voice of mainstream Orthodoxy. Their statement does not represent the unified position of Orthodox Judaism in America. In fact, the Rabbinical Council of America (the rabbinic arm of the Union of Orthodox Jewish Congregations of America) immediately issued a strong statement disassociating themselves from this \"hurtful public pronouncement [which] flies in the face of Jewish peoplehood.\" Finally, before one can denounce a statement like this, one should make an attempt to understand the position of those making the statement. According to Orthodoxy, the Torah is the heart of Judaism. All of what our people are revolves around the unchanging, eternal, mutually binding covenant between G-d and our people. That is the definition of Jewish belief, according to Orthodoxy, and all Jewish belief is measured against that yardstick. You may dispute the validity of the yardstick, but you can't deny that Conservative and Reform Judaism don't measure up on that yardstick. Reform Judaism does not believe in the binding nature of Torah, and Conservative Judaism believes that the law can change. The Agudath Ha-Rabonim did not intend to cut Reform and Conservative Jews off from their heritage. On the contrary, their intention was to bring Reform and Conservative Jews back to what they consider to be the only true Judaism. The statement encouraged Reform and Conservative Jews to leave their synagogues and \"join an Orthodox synagogue, where they will be warmly welcomed.\" I believe the Agudath Ha-Rabonim were sincere, albeit misguided, in this intention. I have known several Orthodox and Chasidic Jews who believed that if there were no Reform or Conservative synagogues, everyone would be Orthodox. However, my own personal experience with Reform and Conservative Jews indicates that if there were no such movements, most of these people would be lost to Judaism entirely, and that would be a great tragedy. The opinion of mainstream Orthodoxy seems to be that it is better for a Jew to be Reform or Conservative than not to be Jewish at all. While we would certainly prefer that all of our people acknowledged the obligation to observe the unchanging law (just as Conservative Jews would prefer that all of our people acknowledged the right to change the law, and Reform Jews would prefer that all of our people acknowledged the right to pick and choose what to observe), we recognize that, as Rabbi Kook said, \"That which unites us is far greater than that which divides us.\" There once was a site called Jewhoo, that had an extensive list of Jewish actors, athletes, and other celebrities. The site disappeared in 2005. I gather that the site owners got tired of doing a lot of work researching the Jewish background of celebrities only to find their efforts copied all over the Internet without even the slightest acknowledgement. The site exists no more, and the information is lost. Think about that the next time you copy someone else's work and insist that you're doing no harm. In the absence of Jewhoo... JINFO has an outstanding collection of Jews who have won the Nobel prize in various areas or have excelled in various academic fields. Jew or Not Jew seems to be trying to fill the gap left by the absence of Jewhoo. It lists Jews in a variety of categories and ranks their Jewishness on three factors: I (Israel: Jewishness by birth history and affiliation), O (Optics: how Jewish they look or act) and K (Kvell: how proud the creators of the site are to consider this person a Jew). It includes a lot of non-Jews who are perceived as Jewish and the text is a bit flighty, but they do seem to do the research and you can probably figure out from what they say whether you would consider the person Jewish."
}