{
  "url": "https://pt.wikihow.com/Limpar-Arquivos-Temporários-no-Windows-10",
  "title": "3 Formas de Limpar Arquivos Temporários no Windows 10",
  "text": "Este artigo foi escrito em parceria com nossa equipe treinada de editores e pesquisadores que validaram sua precisão e abrangência. O wikiHow possui uma Equipe de Gerenciamento de Conteúdo que monitora cuidadosamente o trabalho de nossos editores para garantir que todo artigo atinja nossos padrões de qualidade. Este artigo foi visualizado 75 723 vezes. O Windows 10 cria arquivos temporários usados por certos aplicativos (como o Microsoft Word) para melhorar a experiência de uso. No entanto, seu computador pode criar centenas desses arquivos por dia, podendo lotar o seu disco rígido. Ao ter um documento do Microsoft Word aberto, uma cópia temporária dela pode ser criada a cada poucos minutos. Este artigo vai ensiná-lo a limpar arquivos temporários de um computador usando a ferramenta \"Limpeza de disco\", o aplicativo \"Configurações\" e alguns comandos simples na ferramenta \"Executar\". Passos - Abra o utilitário \"Limpeza de disco\". Para tanto, pesquise por \"Limpeza de disco\" na barra de pesquisa da barra de tarefas e clique no primeiro aplicativo exibido na lista dos resultados. Essa é a forma mais fácil e prática para limpar arquivos temporários no Windows 10. - Você também pode pressionar o atalho ⊞ Win+S para abrir a barra de pesquisa caso não a encontre na barra de tarefas. - Selecione as opções \"Arquivos temporários de internet\" e \"Arquivos temporários\". Ao lado direito de cada uma delas, será exibido o número de espaço a ser liberado. - As demais opções sugeridas são marcadas por padrão; você pode deixá-las marcadas e excluir esses arquivos também, ou então desmarcá-las para preservar esse conteúdo. - Clique em Apagar arquivos. Em seguida, clique em \"OK\" para confirmar a ação na janela pop-up. Ao continuar, a caixa de seleção desaparecerá e você verá uma barra de progresso referente à exclusão, que também desaparecerá ao final do processo. [1]Publicidade - Clique em Sistema (ícone de um computador). - Clique no botão Armazenamento ao final do menu no lado esquerdo. - Clique na unidade onde o Windows está instalado. Ela geralmente terá o logotipo do Windows sobre uma letra, provavelmente rotulado como \"Este PC\". - Clique em Arquivos temporários. O número exibido aqui representa o espaço ocupado por esse conteúdo. A próxima página vai mostrar todos os arquivos considerados temporários, incluindo arquivos na pasta \"Downloads\", na lixeira e as miniaturas. - Marque a caixa de seleção ao lado dos itens que você quer remover. - Clique em Remover arquivos. Em seguida, você verá uma barra de progresso referente à exclusão. [2]Publicidade - Pressione as teclas ⊞ Win+R para abrir a caixa de diálogo \"Executar\". Este é um método mais complexo para limpar arquivos temporários. - Digite \"%temp%\" na caixa de diálogo \"Executar\" e pressione a tecla ↵ Enter. Em seguida, você será redirecionado a uma pasta contendo todos os arquivos temporários do PC. - Selecione todos os arquivos e pastas. Faça-o clicando no primeiro arquivo, depois pressionando e segurando a tecla ⇧ Shift e clicando no último arquivo ou clicando no primeiro arquivo e pressionando o atalho Ctrl+A. - Clique com o botão direito sobre qualquer um dos arquivos selecionado e selecione Apagar. Para fazê-lo, será preciso usar uma conta de administrador. - Todos os arquivos movidos para a lixeira podem ser movidos caso necessário. Publicidade"
}