{
  "url": "https://mirel.co/",
  "title": "MÌREL FINE JEWELRY",
  "text": "COLLECTIONS All pieces are designed by Mirel and handmade by master artisans in Istanbul, Turkey. THE DESIGN INSPIRATION MÌREL is a fine jewelry brand where history, artistry, and innovation converge. Designed by Mìrel Baysal, each piece is a bridge between past and present—inspired by Byzantine mosaics, celestial light, and the enduring strength of heirlooms. The collections honor centuries-old craftsmanship while embracing a modern perspective, creating jewelry that feels at once ancient and contemporary, structured yet fluid, bold yet intimate. At the heart of MÌREL is a dedication to preserving artisanal techniques, ensuring that rare crafts like micromosaic and intricate stone-setting continue to evolve. Every detail is intentional—hidden blue diamonds, secret charms, and precise angular forms—designed not just to be seen, but to be felt. This is jewelry that transforms with the wearer, gaining character over time, meant to be lived in, loved, and passed down. Jewelry is more than adornment—it is a connection across time. MÌREL pieces are designed to tell stories, to carry memories, and to shine, quietly and brilliantly, for generations to come. Star-Crossed Collection SEND A HINT Share your favorite pieces of jewelry with your loved ones FIND A STORE Discover which store is the most convenient for you MEET THE DESIGNER Jewelry is one of the few things that outlives us. It carries time, memory, and meaning—changing hands, yet never losing its story. Mìrel Baysal designs with this in mind, creating pieces that are more than adornment. They are modern heirlooms, crafted to be worn, cherished, and passed forward. From an early age, Mìrel was drawn to the past. She spent her childhood wandering the Grand Bazaar in Istanbul, collecting treasures instead of souvenirs, captivated by the quiet permanence of gold, gemstones, and history itself. Though she studied Government and Economics at Harvard and built a career on Wall Street, her heart remained in the world of design, where art, craft, and meaning converge. Every piece begins as a sketch, drawn by her own hand. Inspired by Byzantine mosaics, celestial light, and the way stars seem to shimmer when slightly out of focus, her designs feel both architectural and ethereal. Her jewelry glows on the skin, with carefully placed stones that mimic light itself. And within each piece, there is something just for the wearer—a hidden blue diamond, a charm at the end of a necklace, a secret detail known only to the one who wears it. Jewelry, for Mìrel, is a reflection of the wearer—bold, luminous, and timeless. It is meant to be lived in, loved, and carried through generations, just as the stars continue to shine long after their light first reaches us. FOLLOW US ON INSTAGRAM"
}