{
  "url": "https://support.microsoft.com/en-us/surface/surface-pro-9-features-and-specs-f3f523e6-4f0e-487d-a95c-6115ab55477d",
  "title": "Surface Pro 9 features and specs - Microsoft Support",
  "text": "Surface Pro 9 features and specs Applies To Discover the latest Surface Pro Get tablet-to-laptop flexibility in one powerful PC. With AI-accelerated Copilot+ PC experiences and all-day battery life, Surface Pro is built to keep you on the go. Wherever the day takes you, you'll be ready with the new slim and sleek Surface Pro 9. Get to know Surface Pro 9 Not sure where to plug something in or how to turn up the volume? We've got you covered. Here are a few diagrams to help you. - Windows Hello facial-recognition camera and front-facing camera - Studio Mics (dual microphones) - Surface Connect port - Back-facing camera - Volume - Power button - USB-C ports (2) - SIM door Windows 11 and available processors There are different processors available for the Surface Pro 9: - 12th Gen Intel® Core processors - Microsoft SQ® 3 processor The version of Windows installed on your Surface Pro 9 will depend on the processor you purchased it with. If you have questions about how the ARM processor works, go to Windows Arm-based PCs FAQ. If you have Windows 11 Home on your Surface, you can upgrade to Windows 11 Pro for an additional cost. For more info, Upgrade Windows Home to Windows Pro. Charging your Surface You can charge your Surface using USB-C or Surface Connect. For more information, see How to charge Surface. Available features - Full laptop power and the versatility of a tablet with choice of quad-core Intel® Evo™ or Microsoft SQ® 3 with 5G. - Stunning, virtually edge-to-edge 13” PixelSense™ touchscreen designed for pen and Windows 11. - Sign, sketch, or navigate with the optional Surface Slim Pen 2, securely stored and charging wirelessly in Surface Pro Signature Keyboard. - Surface Pro 9 with Intel® Evo™ 12th Gen processor and Thunderbolt™ 4 ports, delivers blazing fast performance. - Optional 5G connectivity and enhanced video calling experiences available on Surface Pro 9 with Microsoft SQ® 3. Make it your own Personalize your Surface Pro 9 with these optional accessories and learn about how to use them. Get the most out of your Surface Learn more about your Surface and customize it with the Surface app. To open it, select Start , enter Surface, and select it to open the app. If the app doesn't open, get it from the Microsoft Store. A more repairable device design Many components can be replaced by authorized service providers or skilled technicians — supporting a more repairable device design. Replacement components are available for out-of-warranty repair. Availability and service options may vary by product, market, and over time. To learn more, see Self-repair information for your Surface device. Surface Pro 9 Tech specs *Subscription Required. Sold separately. [1] Weight not including Surface Pro Signature Keyboard and Surface Slim Pen 2 (sold separately). [2] Chargers, software, accessories, and devices sold separately. Availability may vary by market. Surface Slim Pen 2 does not come with a charger. Surface Slim Pen 2 can charge with Surface Slim Pen Charger, Surface Pro Signature Keyboard, Surface Laptop Studio, and Surface Duo 2 Pen Cover. All are sold separately. [3] Battery life varies significantly based on device configuration, usage, network and feature configuration, signal strength, settings, and other factors. See Surface Battery Performance for details. Surface Pro 9: Up to 15.5 hours of battery life based on typical Surface device usage. Testing conducted by Microsoft in August 2022 using preproduction software and preproduction Intel®12th Gen Core™ i5, 256GB, 8GB RAM device. Testing consisted of full battery discharge with a mixture of active use and modern standby. The active use portion consists of (1) a web browsing test accessing eight popular websites over multiple open tabs, (2) a productivity test utilizing Microsoft Word, PowerPoint, Excel, OneNote and Outlook, and (3) a portion of time with the device in use with idle applications. All settings were default except screen brightness was set to 150 nits with Auto-Brightness and Adaptive Color disabled. Wi-Fi was connected to a network. Tested with Windows Version 11.0.22621 (21H2). Battery life varies significantly with settings, usage and other factors. Wi-Fi: Up to 19 hours of battery life based on typical Surface device usage. Testing conducted by Microsoft in August 2022 using preproduction software and preproduction SQ® 3, 128/256/512GB, 8/16GB RAM device. Testing consisted of full battery discharge with a mixture of active use and modern standby. The active use portion consists of (1) a web browsing test accessing eight popular websites over multiple open tabs, (2) a productivity test utilizing Microsoft Word, PowerPoint, Excel, OneNote and Outlook, and (3) a portion of time with the device in use with idle applications. All settings were default except screen brightness was set to 150 nits with Auto-Brightness and Adaptive Color disabled. Wi-Fi was connected to a network. Tested with Windows Version 11.0.22621 (21H2). Battery life varies significantly with settings, usage and other factors. [4] 5G not available in all areas, mmWave in US only. Supports Sub-6 GHz. 5G not available in all areas; compatibility and performance depend on carrier network, plan and other factors. See carrier for details and pricing. [5] Surface Pro 9 options with 12th Gen Intel processor and a storage of 256GB and above are built on the Intel® Evo™ platform. [6] System software and updates use significant storage space. Available storage is subject to change based on system software and updates and apps usage. 1 GB = 1 billion bytes. 1 TB = 1,000 GB. See Surface Storage for more details. [7] Customer Replaceable Units (CRUs) are components available for purchase through your Surface Commercial Authorized Device Reseller. Components can be replaced on-site by a skilled technician following Microsoft’s Service Guide. Opening and/or repairing your device can present electric shock, fire and personal injury risks and other hazards. Use caution if undertaking do-it-yourself repairs. Device damage caused during repair will not be covered under Microsoft’s Hardware Warranty or protection plans. Components will be available shortly after initial launch; timing of availability varies by component and market. [8] Requires Dolby Atmos® encoded content and audio. [9] Tactile signals with Surface Slim Pen 2 can be experienced on some applications on Surface Pro 9 running Windows 11. Surface Slim Pen 2 sold separately. [10] Requires license or subscription (sold separately) to activate and use [11] Activation required. After 30 days, you will be charged the applicable monthly or annual subscription fee. Credit card required. Cancel any time to stop future charges. See Free Trial - Try Microsoft 365 for a month - Microsoft Store. [12] Activation required for Xbox Game Pass Ultimate. Xbox Game Pass ultimate 30-day trial accessible through Xbox Cloud Gaming. You can use it to play games on Xbox One and Xbox Series Consoles, and stream select games where available to Surface Pro 9 through Xbox Cloud Gaming and other supported devices. Not currently available in China. [13] Colors available on selected models only. Available colors, sizes, finishes, and processors may vary by store, market, and configuration. [14] Microsoft’s Limited Warranty is in addition to your consumer law rights. [15] Surface Pro 9 (SQ® 3/5G) comes with Windows 11 Home on ARM. At this time, Surface Pro 9 (SQ® 3/5G) with Windows 11 Home on ARM will not install some games and CAD software, and some third-party drivers or anti-virus software. Certain features require specific hardware (see Windows 11 Specs and System Requirements). Find out more in the FAQ. [17] Requires Dolby Vision® encoded content and video. [18] Download the full Eco profiles see – Surface Pro (SQ3/5G) Eco Profile and Surface Pro 9 (Intel/Wifi) Eco Profile [19] For more information on registration in other markets check – Surface Pro 9 EPEA"
}