{
  "url": "https://en.wikipedia.org/wiki/Laura_(given_name)",
  "title": "Laura (given name) - Wikipedia",
  "text": "Laura (given name) Laura is a traditionally feminine given name in Europe and the Americas, of Latin origin, whose meaning (\"bay laurel\") is a metonym for a victor, and an early hypocorism from Laurel and Lauren.[1][2][3] Origin and usage [edit]The name Laura is the feminized form of laurus, Latin for \"bay laurel plant\", which in the Greco-Roman era was used as a symbol of victory, honor or fame. The name represents the embodiment of victory and strength. The name Daphne, derived from Ancient Greek, carries the same meaning. Popularity [edit]In British North America, the name Laura reached 17th most popular in 1880 and 1882, but dropped to #43 in 1899. It was among the top 50 names for female newborns for much of the early 20th century in the United States, but dropped to No. 100–120 between 1930 and 1950; reached No. 10 in 1969, and has since steadily decreased in popularity. In Europe, Laura remains popular. In 2009 it ranked within the top 10 in Austria, Belgium, Croatia, Denmark, Estonia, Greenland, Luxembourg, Spain, and Switzerland. Laura is occasionally conflated with Lara, which has different origins and is listed separately on name popularity lists. Variants [edit]- Lára: Icelandic - Lara: Turkish - Laoura (Λάουρα): Greek - Laura: Catalan, Croatian, Czech, Danish, Dutch, English, Estonian, Finnish, French, Galician, German, Hungarian, Indonesian, Italian, Latvian, Lithuanian, Norwegian, Polish, Portuguese, Romanian, Russian, Slovak, Slovene, Spanish, Swedish, Albanian - Laure: French - Lavra: Slovene - Lora: English, Indonesian, Bulgarian - Lowri: Welsh[4] Notable people with the name [edit]Religion [edit]- Saint Laura, Spanish martyr Academics [edit]- Laura Bennet, New Zealand academic - Laura Linnan, American public health researcher - Laura Poantă (born 1971), Romanian physician, medical scientist, author, translator, and painter - Laura Pyrak-Nolte, American geophysicist - Laura Schulz, American cognitive scientist - Laura Waller (born 1979), American computer scientist - Laura Wright, academic of English literature Artists [edit]- Laure Mathilde Gouin (1829–1916), French painter and photographer, also known as Mme. M. Gouin. - Laura Pérez Granel (born 1983), Spanish cartoonist and illustrator - Laura Leroux-Revault (1872–1936) French artist and painter, trained at the Académie Julian art school in Paris. - Laura Mas, Spanish artist - Laura Jean McLaughlin (born 1965), American ceramic sculptor, print maker, and mosaic artist - Laura Peery (born 1952), American ceramic artist - Laura Pérez Vernetti (born 1958), Spanish Catalan cartoonist and illustrator - Laura Rodig (1901–1972), Chilean painter, sculptor, illustrator, and educator - Laura Zuccheri (born 1971), Italian comic artist, illustrator, and painter Businesspeople [edit]- Laura Weidman Powers, American woman in business Celebrities [edit]- Laura Anderson (born 1989), Scottish television personality - Laura Anna , better known as Jennifer Diana (2000–2021), Indonesian actress and internet celebrity - Laura Ashley (1925–1985), British fashion designer - Laura Biagiotti (1943–2017), Italian fashion designer - Laura Calder (born 1970), Canadian chef and host of program French Food at Home, from Food Network Canada - Laura Deming (born 1994), American businesswoman - Laura Lang, American businesswoman - Laura Mercier (born 1960), French make-up artist in the cosmetics business - Laura Schlessinger (born 1947), American radio talk show host known as Dr. Laura - Laura Schwartz (born 1973), American political commentator - Laura Secord (1775–1868), Canadian heroine in the War of 1812 Entertainers [edit]- L'Aura (born 1984), Italian singer - Laura Aikman (born 1985), British actress - Laura Alho, Finnish travel blogger, writer, and photographer - Laura Allen (born 1974), American actress - Laura Andon, Australian actress, model, charity ambassador, and television presenter - Laura Bailey (model) (born 1972), English model - Laura Bailey (born 1981), American voice actress - Laura Basuki (born 1988), Indonesian model and actress - Laura Benanti (born 1979), American actress - Laura Bertram (born 1978), Canadian actress - Laura Birn (born 1981), Finnish actress - Laura Branigan (1952–2004), American singer - Laura Breckenridge (born 1983), American actress - Laura Bryan Birn (born 1965), American actress - Laura Bryna (born 1980), American singer - Laura Bell Bundy (born 1981), American actress - Laura Carmichael (born 1986), English actress - Laura Christensen (born 1984), Danish actress - Laura Connor, British ballet dancer - Laura Dern (born 1967), American actress - Laura Dickinson, American actress - Laura Donnelly (born 1982), British actress - Laura Esterman (born 1945), American actress - Laura Fraser (born 1975), Scottish actress - Laura Fygi (born 1955), Dutch singer - Laura Gemser (born 1950), Indonesian–Dutch retired actress, model and costume designer - Laura Gómez (actress), Dominican actress - Laura Haddock (born 1985), English actress - Laura Harrier (born 1990), American actress and model - Laura Harring (born 1964), Mexican–American actress - Laura Honey (1816–1843), British actress, dancer, and singer - Laura Hope Crews (1879–1942), American actress - Laura Illeborg (1969–2024), Danish musician - Laura Innes (born 1957), American actress - Laura Izibor (born 1987), Irish musician - Laura Jane Grace (born 1980), American singer - Laura Johnson (born 1957), American actress - Laura Kampf (born 1983), German YouTuber, designer, and craftswoman - Laura Kightlinger (born 1969), American actress - Laura Kobayashi, American violinist and teacher - Laura Linney (born 1964), American actress - Laura Longauerová (born 1995), Slovak model - Laura MacFarlane, Scottish musician, singer, and songwriter - Laura Main (born 1977), Scottish actress - Laura Malmivaara (born 1973), Finnish actress - Laura Marano (born 1995), American actress and singer - Laura Marling (born 1990), English singer - Laura Mennell (born 1980), Canadian actress - Laura Morante (born 1956), Italian actress - Laura Neiva (born 1993), Brazilian actress - Laura Niles (born 1978), American model, actress, comedian, martial artist, and boxer - Laura Nyro (1947–1997), American singer and songwriter - Laura O'Toole (born 1985), Irish actress - Laura Okmin, American sportscaster - Laura Omloop (born 1999), Belgian singer and yodeler - Laura Osnes (born 1985), American actress - Laura Pausini (born 1974), Italian singer and songwriter - Laura Põldvere (born 1988), Estonian singer - Laura Prepon (born 1980), American actress - Laura Ramsey (born 1982), American actress - Laura Regan (born 1977), Canadian actress - Laura Andrews Rhodes (1854–1909), American operatic soprano - Laura Rutledge (born 1988), American beauty pageant titleholder and sportscaster - Laura San Giacomo (born 1962), American actress - Laura Sánchez (model) (born 1981), Spanish model - Laura Shigihara, American singer and songwriter - Laura Silverman (born 1966), American actress - Laura Smet (born 1983), French actress - Laura Spencer (actress) (born 1986), American actress - Laura Stoica (1967–2006), Romanian singer and actress - Laura Thorn (born 2000), Luxembourgish singer - Laura Valente (born 1963), Italian singer and musician - Laura Vandervoort (born 1984), Canadian actress - Laura van Dolron (born 1976), Dutch stage director - Laura Veirs (born 1973), American singer and songwriter - Laura White (born 1995), British actress - Laura Whitmore (born 1985), Irish presenter - Laura Witherspoon or Reese Witherspoon (born 1976), American actress - Laura Wright (born 1970), American actress Law [edit]- Laura Caller (1915–1988), Peruvian union lawyer - Laura Codruţa Kövesi (born 1973), former Prosecutor-General of Romania - Laura E. Gómez (born 1964), Mexican-American law professor, University of New Mexico - Laura Londén (born 1961), Finnish Swede diplomat - Laura Wasser (born 1968), American attorney Nobility [edit]- Laura Margherita Mazzarini (1608–1685), Italian noblewoman - Laura de Noves (c. 1310–1348), 14th-century French noblewoman, perhaps the subject of love poetry by Petrarch Politics [edit]- Laura Baird (born 1952), American politician - Laura Balbo (born 1933), Italian sociologist and politician - Laura Boldrini (born 1961), Italian politician - Laura Borràs (born 1970), Catalan politician - Laura Bromet (born 1970), Dutch politician - Laura Bush (born 1946), First Lady of the United States from January 20, 2001 to January 20, 2009 - Laura Chapman, American politician - Laura Chinchilla (born 1959), 49th President of Costa Rica - Laura Clay (1849–1941), American suffragist - Laura Rajnović Evetović (born 1975), Serbian politician and administrator - Laura Garza, American politician - Laura Garza Galindo (1947–2019), Mexican politician - Laura Grimond (1918–1994), British politician - Laura Gutiérrez (born 1973), American politician - Laura Hopmann (born 1989), German politician - Laura Kelly (born 1950), 48th governor of Kansas - Laura Kyrke-Smith (born 1983), British politician, academic and charity worker - Laura Loomer (born 1993), American activist - Laura Miller (politician) (born 1958), American politician, 58th Mayor of Dallas (2002–2007) - Laura Moffatt (born 1954), British politician - Laura Pidcock (born 1987), British politician - Laura Pollán (1948–2011), Cuban dissident - Laura Sandys (born 1964), British politician - Laura Smith (British politician) (born 1985), British politician - Laura Stellbrink (born 1990), German politician - Laura Supica, American politician - Laura Trott (born 1984), British politician - Laura Vilagrà (born 1976), Catalan politician Science and technology [edit]- Laura Ahtime, American scientist, statistician from the Seychelles - Laura Bassi (1711–1778), Italian physicist - Laura Berman (born 1969), American sex therapist - Laura Bottomley (born 1964), American electrical engineer - Laura S. Boylan, American neurologist - Laura Bridgewater, American molecular biologist - Laura J. Esserman, American surgeon and oncologist - Laura Fabris, Italian scientist - Laura Huenneke, American ecologist - Laura Irasuegi Otal (1923–2016), Basque Niños de Rusia, civil engineer - Laura Kray, American psychologist - Laura Kubzansky, American sociologist - Laura Mersini-Houghton, Albanian-American physicist and cosmologist - Laura Robinson (scientist) (born 1976), British scientist - Laura Iglesias Romero (1926–2022), Spanish chemist - Laura Silberstein, American psychologist, psychotherapist and author - Laura Tach, American sociologist Sports [edit]- Laura Benkarth (born 1992), German footballer and goalkeeper - Laura Berg (born 1975), American head college softball coach - Laura Brown (cyclist) (born 1986), Canadian cyclist - Laura Brown (golfer) (born 1970), American golfer - Laura Comeau (born 1983), Canadian rower - Laura Dahlmeier (1993–2025), German biathlete - Laura Davies (born 1963), English golfer - Laura Davies (bodybuilder) (born 1960), Canadian bodybuilder - Laura Davis (swimmer) (born 1984), American female medley swimmer - Laura Davis (volleyball) (born 1973), American volleyball player - Laura del Colle (born 1983), Argentine floor hockey player - Laura Douglas (athlete) (born 1983), Welsh hammer thrower - Laura Freigang (born 1998), German footballer - Laura Frličková (born 2007), Slovak track and field athlete - Laura Gil (born 1992), Spanish basketball player - Laura Gómez (judoka) (born 1984), Spanish judoka - Laura Greenhalgh (born 1985), British rower - Laura Heyrman (born 1983), Belgian volleyball player - Laura Hodges (born 1983), Australian professional basketball player - Laura Kenny (born 1992), British cyclist - Laura Kluge (born 1996), German ice hockey player - Laura Malcolm (born 1991), English netball player - Laura Nicholls (basketball) (born 1989), Spanish basketball player - Laura Nicholls (swimmer) (born 1978), Canadian former competition swimmer - Laura Rhoney, Scottish ten-pin bowler - Laura Robson (tennis) (born 1994), British former tennis player - Laura Rossouw (born 1946), South African tennis player - Laura Samsonova (born 2008), Czech tennis player - Laura Sánchez (diver) (born 1985), Mexican diver - Laura Sánchez (swimmer) (born 1972), Mexican swimmer - Laura Siegemund (born 1988), German tennis player - Laura Škvorc (born 1997), Slovenian footballer - Laura Sondore (born 1999), Latvian footballer - Laura Stacey (born 1994), Canadian ice hockey player - Laura Taylor (swimmer) (born 1999), Australian swimmer - Laura Walker (curler) (born 1990), Canadian curler - Laura Zeng (born 1999), American rhythmic gymnast Writers and journalists [edit]- Laura Brown (fashion journalist) (born 1974), American fashion journalist - Laura J. Burns, American author - Laura Hill Chapman (1935–2021), American author and educator - Laura Eldridge (born 1965), American women's health writer and activist - Laura Elvery, Australian author - Laura Dayton Fessenden (1852–1924), American author - LauraMaery Gold (born 1959), American author - Laura Goode (born 1983), American novelist - Laura Guidiccioni (1550–1597), Italian noblewoman and poet - Laure Hillerin (born 1949), French historian, journalist and writer - Laura Mestre Hevia (1867–1944), Cuban translator, humanist and writer - Laura Hillman (1923–2020), German-born American memoirist, Holocaust survivor and \"Schindler Jew\" - Laura Lee Huttenbach, American author and athlete - Laura M. Johns (1849–1935), American suffragist and journalist - Laura Karasek (born 1982), German author, television moderator, lawyer, columnist and actor - Laura Kuenssberg (born 1976), British journalist, BBC political correspondent - Laura Ling (born 1976), American journalist - Laura Jean McKay (born 1978), Australian author - Laura Meschede, German freelance journalist - Laura Miller (journalist) (born 1980), Scottish broadcast journalist - Laura Miller (writer) (born 1960), American author - Laura A. Sunderlin Nourse (1836–1899), American poet - Laura Pritchett (born 1971), American writer - Laura Resnick (born 1962), American writer - Laura Villanueva Rocabado (pseudonym, Hilda Mundy; 1912–1980), Bolivian writer, poet, journalist - Laura Tingle (born 1961), Australian journalist and author, ABC chief political correspondent - Laura Rosamond White (1844–1922), American author - Laura Ingalls Wilder (1867–1957), American author of Little House on the Prairie - Laura Vanderkam (born 1978), American author, speaker and blogger Others [edit]- Laura Attrux (1909–1987), Canadian nurse - Laura Joan Balcer, American neuro-ophthalmologist - Laura Escanes (born 1996), Catalan model and influencer - Laura Guido-Clark, American textile designer - Laura Law (1914–1940), Finnish-American murder victim - Laura Perselli (died 2021), Italian murder victim - Laura Matilda Towne (1825–1901), American educator - Laura Wooten (1920–2019), American poll worker - Laura Davis Worley (1849–1937), American dairy farmer - Laura Zúñiga Cáceres, Honduran human rights and indigenous rights activist Fictional characters [edit]- Main character in Florante at Laura - Laura, a main character in the Sheridan Le Fanu 1871 novel Carmilla and its adaptations, including the webseries of the same name - Laura, a lead character in the 2005 film Brick - Laura, an anesthesiologist from the television series In Treatment - Laura, a young girl in the Silent Hill video game franchise - Laura, a character in the American television series The Walking Dead - Laura, a character in Tropical-Rouge! Pretty Cure - Laura Alden, a character in the 1994 film Wolf - Laura Barton, a Marvel character and the wife of Hawkeye in the Ultimate universe and MCU - Laura Bristow, an alias for Irina Derevko, the mother of Sydney Bristow on the television series Alias - Laura Carrot, a character in VeggieTales - Laura Diamond, protagonist of the television series The Mysteries of Laura - Laura Dean, also known as Pathway, a Marvel Comics character - Laura Fukuoji, a character from Jewelpet: Magical Change - Laura Gauthier, a recurring character from the incomplete French TV series, Code Lyoko: Evolution - Laura Hardy (Hardy Boys), mother from the Hardy Boys series of books - Laura Harris, the protagonist of the video game D - Laura Haruna (aka Hiroko), a character from the anime series Hamtaro - Laura Horton, a former character on the soap opera Days of Our Lives - Laura Hunt, the protagonist of Otto Preminger's 1944 film Laura - Laura Kinney, also known as X-23, a Marvel Comics character - Laura Lewis, the protagonist of the video game Enemy Zero - Laura Matsuda, a character from the Street Fighter V - Laura Moon, a character from Carry On Constable. - Laura Palmer, from the television series Twin Peaks - Laura Parker, an English model in Sarra Manning's Fashionistas book series - Laura Parton, the protagonist of the video game D2 - Laura Petrie, a character from the American sitcom The Dick Van Dyke Show, played by Mary Tyler Moore - Laura Roslin, from the reimagined television series Battlestar Galactica - Laura Sorkin, a scientist from the video game Jurassic Park: The Game - Laura Spencer, a character on the soap opera General Hospital - Laura Tucker, a character from the American animated sitcom South Park - Laura Wingfield, one of three central characters in The Glass Menagerie, a mid-century American play by Tennessee Williams - Laura Winslow, a character from the American sitcom Family Matters - Laure Berthaud, main character of French crime series Engrenages (Spiral) Name days [edit]Christian name days for Laura: - January 15: Sweden - January 18: Estonia, Finland - January 22: France - April 18: Latvia - June 1: Czech Republic - June 5: Slovakia, Slovenia - June 17: Hungary, Lithuania, Poland - August 10: Austria, Germany - October 19: Lithuania, Italy, Spain, England See also [edit]References [edit]- ^ Albaigès, Josep M.; Olivart, J. M. A. Diccionario de nombres de personas (in Spanish). Universitat de Barcelona. p. 156. ISBN 84-475-0264-3. Retrieved 15 September 2018. - ^ \"Popular Baby Names\". www.ssa.gov. - ^ Campbell, Mike. \"Meaning, origin and history of the name Laura\". Behind the Name. - ^ \"Welsh Government: Popular Welsh names for girls\". Retrieved 13 June 2019. External links [edit]- Works related to Laura at Wikisource - Given names - English feminine given names - Estonian feminine given names - Feminine given names - German feminine given names - Italian feminine given names - Latvian feminine given names - Lithuanian feminine given names - Romanian feminine given names - Spanish feminine given names - French feminine given names - Finnish feminine given names - Hungarian feminine given names - Polish feminine given names - Given names derived from plants or flowers"
}