{
  "url": "https://stackoverflow.com/questions/77993595/anaconda-navigator-fails-to-launch-importerror-install-was-previously-fine",
  "title": "python - anaconda-navigator fails to launch, ImportError. Install was previously fine - Stack Overflow",
  "text": "After functioning fine for nearly a year my Anaconda Navigator has stopped functioning after my Windows11 device updated itself overnight (unprompted, thank you Microsoft.) Update: 2024-02 Cumulative Update for Windows 11 Version 23H2 for x64-based Systems (KB5034765) It's unclear whether this is the direct cause, or whether an unrelated matter triggered the issue. Jupyter Lab, which I use through Anaconda Navigator, was open at the time. When opening the Navigator shortcut, a couple command prompt windows pop up (as was the case prior to today), but the navigator simply does not start. No error messages are displayed through this approach. What I've already tried: Most of the steps documented here. Previous link - Deleted the .condarc file. - Launch anaconda-navigator directly through Anaconda Prompt. - Manually update with conda update -n base anaconda-navigator - Updated urllib3 with conda update urllib3 (reason below) - Executed conda remove -n base anaconda-navigator &conda install -n base anaconda-navigator - Restarted my device prior to and after all these steps. Launching anaconda-navigator through Anaconda Prompt does display an error, and this error has changed with the steps taken above. The original error was related to Pydantic, with this link attached. This error is no longer displayed. The current Error is related to urllib3, full trace below: (base) C:\\Users\\user>anaconda-navigator Traceback (most recent call last): File \"C:\\Users\\user\\anaconda3\\Scripts\\anaconda-navigator-script.py\", line 6, in <module> from anaconda_navigator.app.main import main File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\anaconda_navigator\\app\\main.py\", line 19, in <module> from anaconda_navigator.app.start import start_app File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\anaconda_navigator\\app\\start.py\", line 30, in <module> from anaconda_navigator.widgets.main_window import MainWindow File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\anaconda_navigator\\widgets\\main_window\\__init__.py\", line 24, in <module> from anaconda_navigator.api.anaconda_api import AnacondaAPI File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\anaconda_navigator\\api\\anaconda_api.py\", line 29, in <module> from anaconda_navigator.api.client_api import ClientAPI File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\anaconda_navigator\\api\\client_api.py\", line 21, in <module> import binstar_client File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\binstar_client\\__init__.py\", line 27, in <module> from .requests_ext import NullAuth File \"C:\\Users\\user\\anaconda3\\lib\\site-packages\\binstar_client\\requests_ext.py\", line 11, in <module> from urllib3.filepost import choose_boundary, iter_fields ImportError: cannot import name 'iter_fields' from 'urllib3.filepost' (C:\\Users\\user\\anaconda3\\lib\\site-packages\\urllib3\\filepost.py) urllib3 version: 2.1.0 pydantic version: 2.6.1 Looks like iter_fields might be deprecated. Would downgrading urllib3 be sufficient to get Anaconda Navigator working again?"
}