{
  "url": "https://opendevelopmentmekong.net/",
  "title": "Open Development Mekong - Sharing information about Mekong and its development with the world.",
  "text": "- Vietnam–Laos ties: strategic cohesion Vietnam and Laos have scaled up bilateral relations to the highest level of friendship and cooperation, known as “Great friendship, special solidarity, comprehensive cooperation and strategic cohesion”. It is a new framework between the two former Indochinese countries. The emphasis is on strategic cohesion. Vietnam’s Party ... - New mapping reveals hidden mining boom in Laos that threatens the Mekong BANGKOK — A new satellite analysis from U.S. think tank the Stimson Center has identified 517 suspected mines along rivers in Laos, including major tributaries of the Mekong, Southeast Asia’s longest river, heightening concerns about contamination of waterways that sustain local communities. Stimson has not ground-truthed the ... - Unregulated mining expands across Mekong region, raising concerns Dec. 3 (UPI) — Unregulated mining across the Mekong region is accelerating at a pace that environmental researchers warn is outstripping governance, enforcement and ecological safeguards. From Myanmar’s jade-rich northern highlands to informal gold pits along Laos and Cambodia’s riverbanks, mineral extraction is expanding in some of ... - People's Party warns of Mekong arsenic threat, calls for urgent regional talks The People’s Party (PP) has called on the government to tackle arsenic contamination from foreign mining, spreading from northern rivers to the Mekong in the Northeast. It is urging immediate talks with China, Myanmar and Laos. PP deputy spokesman and Chiang Mai MP Phattarapong Leelaphat posted ... - Rare earth mining expands into Laos, threatening entire Mekong River Satellite data show at least 27 new rare earth mines have opened across Laos since 2022, mostly in protected areas and many within the Mekong River Basin, raising transboundary pollution risks for Vietnam and the wider Mekong system. New data show a recent proliferation of rare ... - Lancang-Mekong countries vow to target telecom and cyber fraud Senior officials from China, Cambodia, Laos, Myanmar, Thailand, and Vietnam pledged at a ministerial-level meeting on Friday to deepen law enforcement cooperation and launch coordinated crackdowns targeting telecom and cyber fraud. Delegates from these countries convened in Kunming, Yunnan province, to focus on combating telecom and cyber fraud. They ... - Call for Applications: Writing Workshop for Indigenous Journalists The Knowledge for Development Foundation (K4D) is hosting a three-day writing workshop for Indigenous journalists from South and Southeast Asia, taking place from April 22–24, 2025. This workshop focuses on long-form journalism and ethical storytelling from an Indigenous perspective. Participants will receive hands-on training, attend lectures by experienced journalists, ... - JOB OPPORTUNITY: TOR of Mangrove Conservation Assistant TERMS OF REFERENCE Mangrove Conservation Assistant Assignment: Mangrove Conservation Assistant Location: Southern Thailand, with possible regional travel Contract Type: Full-time, on site. Reports to: Foundation Director Duration: 2 years (contingent on performance and funding continuation) Start: Immediately Deadline: 2 March 2024 or Until filled Position: This position is open to Thai nationals and those eligible to work in Thailand OVERVIEW The Knowledge for ... - JOB OPPORTUNITY: OD Myanmar Coordinator Open Development Initiative is looking to hire a local Myanmar Coordinator to help manage our OD Myanmar activities. This position will provide program support and technical assistance to the Director and work alongside the lead partner Landesa, their local team and the national Open Development Myanmar platform. To explore the ..."
}