{
  "url": "https://www.hearth.com/talk/threads/creosote-running-down-outside-of-pipe-inside-of-house.42298/",
  "title": "Creosote running down outside of pipe, inside of house | Hearth.com Forums Home",
  "text": "Welcome to the Hearth, always looking for new folk to join in, especially from (or near) the Badlands of So. Dakota. Eat your hearts out Easties, you'll never see nothin' like this back there. I am going to be as vague as possible hh: Creosote is the condensation of moisture and volitile gases, pieces and stove cast-offs. This usually occurs when the stack is too cool or the air movement is too slow, or a combination of both. Sometimes folk try and save a buck, run single wall pipe to the rectangle (that's a thimble, and figure they can continue up through the roof. What happens is the hot gases hit that shocking cold attic point and it acts like a chiller, instant cool down. The pipe can be single wall, but should be Class A double wall, or in some cases thriple wall there after. This allows the pipe to retain more heat and move the gasses up. That's about as general as I can get. There may be more than one thing going on with the stack. First, creosote is building up somewhere and finding a way to drizzle down (that's tech for drip) it could be from a bad pipe seam and some blockage, or from the cap, or lip of the top if no cap. The stove does not generate creasote outside the fire stream. Second, it may not be creosote at all. I had a gas water heater with drizzle down it. Not creosote, not from Natural Gas. It was coming down the stack, from the roof. I have a very old shake shingle roof and a cast flange the water heater was stuck through (house is 140 years old and they reused wherever) I gooped Black Jack and put a new flange and did all I thought would work, no such luck. Ended the problem when I switched to on demand hot water. Took the sucker out. What I found was the flashing and flange were rusted away well under the shingles and simply acting like a wick to direct the flow. The crud was a little of everything that was on or in the roof including the black jack I had tried to stop the flow with. Where you are diligent about cleaning the stack, you probably are not at risk for a fire, but you should see if you have a condensor going on. Second check the flashing around the stack (I assume it pipe out the roof by your description) and make sure it is good. Squeeze into the attic and see what's going on there. Once your homework assignment is done, come on back and hit us again."
}