{
  "url": "https://rotomlabs.net/legends-arceus/shiny-rates",
  "title": "Shiny Rates in Pokémon Legends: Arceus | RotomLabs",
  "text": "Shiny Rates in Pokémon Legends: Arceus Pokémon Legends: Arceus is one of the easiest games to hunt Shiny Pokémon in. With the Pokédex research levels rewarding extra Shiny rolls along with Mass Outbreaks and Massive Mass Outbreaks, players have loads of opportunities for getting desired Shiny Pokémon. If you want to know why this page uses \"shiny rates\" instead of \"shiny odds,\" \"shiny chances,\" or \"shiny probabilities\" check out our guide on shiny rate verbiage. Long story short, we use \"rate\" to mean mathematical probability (i.e. a value between 0 and 1 that indicates how likely an event will occur) presented as fractions. For example, a rate of 1/4096 means \"the probability of a shiny is one in an average of 4096 encounters\". This page applies to version 1.1.0 and beyond. Special thanks to Anubis for the data! Everything Together (If you're on mobile, you will need to scroll horizontally to view the whole table!) Note that you cannot have have the Pokédex at \"Perfect!\" alone or Shiny Charm alone. To get both of these bonuses, the Pokédex must be at least Research Lv. 10. Additionally, a Pokémon cannot possibly from both a Mass Outbreak and a Massive Mass Outbreak. All of these conditions are excluded from the table for simplicity. Base Shiny Rate and Shiny Charm The base shiny rate in Legends: Arceus is 1/4096. If you have the Shiny Charm, the chance is increased to at least 1/819.60. The reason for such a huge shift is that to get the Shiny Charm, you must have all of the research for each species in your Pokédex at Level 10 or above. Therefore, every time the Shiny Charm is active you are also getting either the bonus for Research Lv. 10 or Perfect research. Getting Research Lv. 10 rewards an extra 1 shiny roll, while getting a \"Perfect!\" ranking in the Pokédex for that species will give you an additional 2 shiny rolls. Completing the research for a species is essentially a \"bonus Shiny Charm.\" These rolls stack along with other bonuses since they are always checked with wild spawns. Fortunately, Legends: Arceus is all wild spawns, so you'll always get the bonus. Well, unless it's shiny locked (keep reading). Consult the tables on this page along with your Pokédex to know your true shiny rate for that species! Here are the rates for regular wild spawns along with what conditions need to be met for particular rates: Shiny Locks In Pokémon Legends: Arceus, all mythical and legendary Pokémon are shiny locked. Your starter is also shiny locked. Here's the list of shiny locks: - Starter Gifts: Cyndaquil, Oshawott, and Rowlett - Alolan Vulpix gift in Whiteout Valley - Dialga and Palkia - Uxie, Mesprit, and Azelf - Heatran, Regigigas, and Cresselia - Manaphy and Phione (even though multiple Phione can spawn in Seaside Hollow, they are all locked) - Darkrai and Shaymin - Arceus - Tornadus, Thundurus, Landorus, and Enamorus - All forced battles in Requests and Missions Remember that you can still shiny hunt the starters with the Outbreaks! Massive Mass Outbreaks Massive Mass Outbreaks are events that infest a region with lots of different Pokémon in \"spawners.\" You'll see a question mark icon indicating where Pokémon are located. Once there, the icon will change to the species encountered there. These last for a short amount of time, but you can do some excellent shiny hunting this way. What makes Massive Mass Outbreaks so appealing is that the shiny rates are increased significantly! In fact, the game rewards a bonus 12 shiny rolls for Pokémon that spawn as part of these outbreaks. Here are the rates for just Massive Mass Outbreaks: You can check out our guide on shiny hunting Massive Mass Outbreaks if you want to learn more! Mass Outbreaks Mass Outbreaks are somewhat similar to Massive Mass Outbreaks, but there is no timer and only one species is available at a time. There are also a few more Pokémon spawns than in a single spawner in an MMO. What's really nice about Mass Outbreaks, though, is that they have nearly double the number of shiny rolls, which means there's an extremely high chance you will get a shiny. Mass Outbreaks give a bonus 25 shiny rolls for Pokémon that spawn within one. This only improves with Dex Research and Shiny Charm. Here are the rates for just Mass Outbreaks: Note that before 1.1.0, there was an exploit that allowed you to return to Jubilife Village and reset the Outbreaks for unlimited tries. Unfortunately, that was patched out and returning to the Village will remove any existing Outbreaks."
}