{
  "url": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel&hl=es",
  "title": "Microsoft Excel: Spreadsheets - Aplicaciones en Google Play",
  "text": "La eficaz aplicación de hojas de cálculo Excel te permite crear, ver, editar y compartir tus archivos de forma rápida y fácil, y también ver y editar los libros adjuntos a los mensajes de correo electrónico. Trabaja en contabilidad, auditoría, finanzas, etc. con cualquier usuario y en cualquier lugar de forma segura. Revisa tu trabajo o empieza un presupuesto donde quieras. Personaliza una hoja de cálculo con herramientas de formato sólidas y excelentes características. Con Excel, crea tu hoja de cálculo según tus necesidades. Crear, calcular y analizar con seguridad Usa las plantillas modernas de Excel para iniciar presupuestos, listas de tareas, análisis de contabilidad o financieros. Usa las fórmulas que ya conoces para hacer cálculos y analizar datos. Las características y opciones de formato enriquecidas facilitan el uso y la lectura de libros. Los formatos, las fórmulas y las características de las hojas de cálculo funcionan igual; no importa en qué dispositivo se usen. Revisar, editar y trabajar desde cualquier lugar Revisa los archivos de Excel en cualquier dispositivo. Edita tus datos o actualiza la lista de tareas desde cualquier lugar. Para poder centrarte en la revisión, dispones de características que te permiten ordenar y filtrar las columnas. Crea, duplica, oculta y muestra las hojas fácilmente. Contar una historia con los datos Inserta gráficos habituales para animar los datos. Usa características como agregar y editar etiquetas de gráficos para resaltar información clave. Dibujar y realizar anotaciones con lápiz Crea notas, resalta partes de las hojas de cálculo, crea formas o escribe ecuaciones matemáticas con la característica de la pestaña Dibujar en Excel en dispositivos táctiles. Compartir archivos de forma más sencilla Comparte archivos con unos toques para invitar rápidamente a otros usuarios a editar, ver o comentar directamente en tus libros. Copia el contenido de una hoja de cálculo en el cuerpo de un mensaje de correo conservando el formato o adjunta o copia un vínculo a tu libro para ver otras opciones de uso compartido. REQUISITOS: • Versión de sistema operativo: cualquiera de las versiones admitidas de Android y un procesador Intel x86 o basado en ARM. La compatibilidad con los dispositivos KitKat y Lollipop seguirá hasta junio de 2019. • 1 GB de RAM o más Para crear o editar documentos, inicia sesión con una cuenta Microsoft gratuita en dispositivos con una pantalla de 10,1 pulgadas o menos. Obtén toda la experiencia de Microsoft 365 con una suscripción a Microsoft 365 certificada para tu teléfono, tableta, PC y Mac. Las suscripciones a Microsoft 365 compradas desde la aplicación se cargarán en tu cuenta de Play Store y se renovarán automáticamente durante las 24 horas previas al fin del período de suscripción actual, a menos que se deshabilite previamente la renovación automática. Administra tus suscripciones en la configuración de tu cuenta de Play Store. No puedes cancelar una suscripción durante el período de suscripción activa. Esta aplicación la proporciona Microsoft u otro creador de aplicaciones y está sujeta a una declaración de privacidad y a unos términos y condiciones independientes. Microsoft o el creador de la aplicación podrá acceder a los datos proporcionados al usar esta tienda y esta aplicación, si procede, así como transferir, guardar y procesar estos datos en los Estados Unidos o cualquier otro país en el que Microsoft o el creador de la aplicación y sus afiliados o proveedores de servicios tengan instalaciones. Consulta el CLUF de Microsoft para los términos de servicio. Al instalar la aplicación, aceptas estos términos y condiciones: http://aka.ms/eula Última actualización 23 ene 2026 Productividad Seguridad de los datos arrow_forward La seguridad empieza por entender cómo recogen y comparten tus datos los desarrolladores. Las prácticas de privacidad y seguridad de los datos pueden variar en función de tu uso de la aplicación, el territorio donde la uses y tu edad. El desarrollador ha proporcionado esta información y puede actualizarla con el tiempo. Puede que esta aplicación comparta estos tipos de datos con terceros Ubicación e IDs de dispositivo o de otro tipo Esta aplicación puede recoger estos tipos de datos Ubicación, Información personal y otros 6 Los datos no se cifran Puedes solicitar que se eliminen los datos Ver detalles Valoraciones y reseñas phone_androidTeléfono laptopChromebook tablet_androidTablet 4,8 7,83 M reseñas 5 4 3 2 1 Metz Lazaro Marcar como inapropiada 25 de julio de 2025 Perdí meses de trabajo por el problema de los archivos en modo lectura, horrorosa aplicación. La había instalado solo para revisar datos importantes que tenía anotados en el documento que perdí, ni siquiera modificaba nada pero parece que con solo abrir y sin advertencia alguna se te borran los documentos. 124 personas han valorado esta reseña como útil daniel vieira Marcar como inapropiada 23 de enero de 2026 llevo una planilla de control de clientes , cada hoja es un cliente diferente , me está pasando regularmente, que quiero compartir la hoja en formato PDF , no lo hace , tengo que cerrar y volver a abrir , el peor problema que en tres oportunidades cuando vuelvo para abrir la planilla , desapareció, no está en ningún lado de mi dispositivo, tengo que respaldar diariamente la nube , pero lo que hice ese día después de respaldarla , se pierde . favor vean ese problema , tengo un Samsung Z fold 7 2 personas han valorado esta reseña como útil John Freddy Castro Camacho Marcar como inapropiada Mostrar historial de reseñas 17 de enero de 2026 Esta aplicacion es ridicula e inutil. No se pueden abrir dos documentos de manera simultánea. No es posible copiar y pegar entre archivos. Es absolutamente inútil para uso académico o profesional. Con Copilot 365 era posible trabajar varios archivos Excel y Word de manera simultánea. Ahora es IMPOSIBLE. Tenian una buena aplicación. Ahora el Office de Android es un chiste. Un juguete inútil. 9 personas han valorado esta reseña como útil Novedades Gracias por usar Excel. Publicamos periódicamente actualizaciones para la aplicación, que incluyen nuevas y geniales características, así como mejoras de velocidad y confiabilidad. ¿Sabías que con una suscripción de Microsoft 365 puedes desbloquear todo el potencial de Office en todos los dispositivos? Encontrarás ofertas especiales en la aplicación."
}