{
  "url": "https://www.lindtusa.com/shop-chocolate/lindor-pick-and-mix",
  "title": "Chocolate Pick & Mix | LINDT",
  "text": "JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. Valentine's Day Collection Lindt Chocolate Hearts Valentine's Day Gift Boxes Valentine's Day Gift Baskets Valentine's Day Gifts for Her Valentine's Day Gifts for Him Seasonal Online Exclusives LINDOR Pick & Mix Chocolate LINDOR Truffles Chocolate Bars Dubai Style Chocolate Bars Chocolate Gift Boxes Chocolate Gift Baskets Gift Tins Master Chocolatier Specialties Snacks & Sharing Bulk & Cases Favors Baking Holiday Clearance All Chocolate Milk Chocolate Dark Chocolate White Chocolate Assorted Chocolate Caramel Praline Nuts Fruit LINDOR EXCELLENCE CLASSIC RECIPE LINDT SWISS LUXURY Valentine Collection Dubai Style Chocolate Stick Crunchy Mint Cookie Bar Toffee & Sea Salt Bar All NEW Kosher Without Gluten Ingredients Non-Dairy LINDOR Non-Dairy Vegan (?) All SALE Fathers Day Gifts Mothers Day Gifts Easter Sale Spread the LINDOR Love Buy 200 LINDOR Truffles, Get 50 Free Buy 100 LINDOR Truffles, Get 25 Free Personalized Gifts Birthday Thank You Congratulations Graduation Wedding Anniversary New Baby Back to School Just Because Business Gifts Luxury Gifts View All New Year's Eve Lunar New Year Valentine's Day Father's Day Mother's Day Halloween Holiday Collection Thanksgiving Christmas Hanukkah For Her For Him For Couples For Friends For Teachers Spring Summer Fall Up to 50% Off Holiday & Select Gifts Buy 2 LINDOR 75-pc Bags for $65No Code Needed Buy 3 Bars, Get 1 FreeAdd All 4 to Cart View Terms For Our Special Offers Sustainability Lindt Corporate Lindt Farming Program History of LINDOR History of GOLD BUNNY Origin of the Easter Bunny Explore Our Recipes Christmas Gifting Habits Chocolate Gift Ideas What is Dark Chocolate? What is White Chocolate? The Finest Cocoa Unique Roasting & Grinding Conching: The Lindt Invention The Best Ingredients The Lindt Difference Story of Lindt Master Chocolatiers Contact Us Create Your Own Custom Mix from 20+ Flavors 20 Items 20 results $42.00 $36.00 $31.50 $52.50 $210.00 $173.00 $157.00 $140.00 $118.00 $97.00"
}