{
  "url": "https://www.city-data.com/forum/new-york-city-housing-lottery/3463073-69-adams-street-apartments-lottery-open.html",
  "title": "69 Adams Street Apartments,Lottery Open,Nice Buildings (Ava: income, housing) - New York City Housing Lottery - City-Data Forum",
  "text": "03-25-2024, 09:14 AM 200 posts, read 398,313 times Reputation: 67 https://housingconnect.nyc.gov/PublicWeb/details/4567 Lottery ends in 60 days - May 24, 2024 69 Adams Street Apartments 69 Adams St, Brooklyn, NY 11201 Eligible Income: $105,223 - $198,250 Last edited by gigi1232006; 03-25-2024 at 09:33 AM .. 03-25-2024, 09:16 AM 200 posts, read 398,313 times Reputation: 67 Available Units & Requirements AMI % Layout# UnitsMonthly RentHousehold SizeHousehold Income 130% Studio 18 units $3,069 1 person $105,223 - $128,570 2 people $105,223 - $146,900 130% 1 Bedroom 23 units $3,253 1 person $111,532 - $128,570 2 people $111,532 - $146,900 3 people $111,532 - $165,230 130% 2 Bedroom 29 units $3,835 2 people $131,486 - $146,900 3 people $131,486 - $165,230 4 people $131,486 - $183,560 5 people $131,486 - $198,250 03-25-2024, 01:36 PM 1,452 posts, read 2,358,921 times Reputation: 646 Be aware that this building is rightupagainst the Manhattan Bridge.... 03-26-2024, 11:52 AM 659 posts, read 520,039 times Reputation: 348 Quote: Originally Posted by popartist Be aware that this building is rightupagainst the Manhattan Bridge.... Yeah, check your windows and if the heat/AC pulls in any fresh air or just recirculates the air in the apartment. Bridge and noise aside, not a bad spot if you want to be in Dumbo. Not near the water but near the F/A/C stations. 06-14-2024, 12:34 PM 761 posts, read 938,579 times Reputation: 253 Logs are out 3XXX 06-14-2024, 12:54 PM 58 posts, read 84,435 times Reputation: 20 18XX. Eye roll... 06-14-2024, 09:40 PM 14 posts, read 14,837 times Reputation: 11 9xxx tough sigh lol 06-15-2024, 12:57 AM 200 posts, read 398,313 times Reputation: 67 06-15-2024, 10:11 PM 16 posts, read 20,046 times Reputation: 10 3XX this is expensive as hell though 06-16-2024, 02:07 AM 44 posts, read 73,305 times Reputation: 30 Quote: Originally Posted by indecisive234 3XX this is expensive as hell though Your number is quite good. There is a high chance that you will be asked to submit documents. Please register to post and access all features of our very popular forum. It is free and quick. Over $68,000 in prizes has already been given out to active posters on our forum. Additional giveaways are planned. Detailed information about all U.S. cities, counties, and zip codes on our site: City-data.com ."
}