{
  "url": "https://en.m.wikipedia.org/wiki/Spaten-Franziskaner-Bräu",
  "title": "Spaten-Franziskaner-Bräu - Wikipedia",
  "text": "Spaten-Franziskaner-Bräu Spaten-Franziskaner-Bräu GmbH is a brewery in Munich, Bavaria, Germany. It produces Spaten and Franziskaner beers. History [edit]In 1397, the Welser Prew was alluded to for the first time in Munich. The ownership changed often until 1854, when the brewery moved to the location it still uses today. In 1867, it became the largest brewery in town. In 1872, the Franziskaner Leist brewery, served beer at the Oktoberfest for the first time, the Spaten Oktoberfestbier Ur-Märzen, especially brewed by Josef Sedlmayr.[1][2] In 1909 began to deliver beer to North America. In 1922, the Spaten-Brauerei and Franziskaner-Leist-Bräu united to form a joint stock company. Both breweries were owned by the Sedlmayr family (Gabriel Sedlmayr was a former royal court beer brewer).[2] In 1924, the advertising slogan \"Lass Dir raten, trinke Spaten\" (literally \"Let yourself be advised, drink Spaten\") was invented. It is still in use today. The Franziskaner beer was created in 1935, and its label (the Franziskaner monk) was designed by Ludwig Hohlwein. In 1964, the brewery produced its first wheat beer, and ten years later, all the Franziskaner brewed became wheat-based. In 1984, the brewery started a national distribution of its beers. By 1998, it ranked among the top 10 breweries of Germany.[2] The brewery reached a production of 1 million hectolitres (850,000 US bbl) in 1992. In 1997, the brewery combined with the Löwenbräu AG to form the Spaten-Löwenbräu-Gruppe. The Spaten-Löwenbräu-Gruppe was sold in 2003 to Interbrew for 530 million euros. During the 2002/2003 brewing year, the Franziskaner beer alone reached one million hectoliters produced.[2] The brewhouse in the Marsstraße in Munich was closed due to a lack of workload in 2006 and is now the museum of the company. In 2011, the brewery launched the Franziskaner Royal (wheat beer).[2] In 2017, AB InBev launched the distribution of alcohol-free Franziskaner in the UK.[3] In 2021, AB InBev began considering selling the Franziskaner and Spaten brands in a move to offload some of its German beer assets.[4] Description [edit]In 2010, the brewery employed 500 workers and had an annual production volume of approximately 2.4 million hectolitres (2,000,000 US bbl),[5] making it one of the largest breweries in Bavaria. Spaten-Franziskaner-Bräu is one of the six brewers in Munich to brew beer for the Oktoberfest.[6] Products [edit]\"Spaten\" means spade in German, and the symbol of the brand is a malt shovel. \"Franziskaner\" means Franciscan in German, and the picture on the label is of a Franciscan friar. - In 1841, the company introduced Märzenbier.[7] - In 1894, the Münchner Hell (German pale lager) was produced by the company for the first time. The wort is >11.7° Plato. This product has 5.2% of alcohol by volume. - The Pils was the first to be produced in Munich and has >11.7° Plato wort and 5.0% of alcohol by volume. - The Oktoberfestbier is produced in spring to be sold in autumn for the Oktoberfest. It has >13.7° Plato wort and 5.9% of alcohol by volume. - The lighter beer is the Diät-Pils, which may also be consumed by diabetics; [citation needed] (100 ml contains about 134 kJ, 32 kcal). It has 4.9% of alcohol by volume. - Non-alcoholic beer has a wort of >7.3° Plato. - Franziskaner Weissbier has 11.8° Plato wort and 5.0% of alcohol by volume. The brewery claims it brews the Franziskaner following the tradition of the German Purity Law of 1516.[8] - Doppelbock Optimator has 7.6% of alcohol by volume. References [edit]- ^ Jay Brooks, Brooks on Beer: The eight best beers to celebrate Oktoberfest at home, Mercurynews.com, 15 September 2020 - ^ a b c d e (in German) Mönch macht Marke, Getraenke-news.de, 1 July 2020 - ^ Lisa Riley, AB InBev brings alcohol-free Franziskaner wheat beer to UK, Thegrocer.co.uk, 12 January 2017 - ^ Eyk Henning, Jan-Henrik Foerster, Thomas Buckley, AB InBev Explores $1.2 Billion Sale of German Beer Brands, Bloomberg.com, 4 October 2021 - ^ \"Spaten, Franziskaner und Löwenbräu bleiben\". tz. Munich. 2010-10-05. Retrieved 2015-10-28. Mit einem jährlichen Bierausstoß von rund 2,4 Millionen Hektolitern und rund 500 Mitarbeitern ist die Münchener Spaten-Löwenbräu-Gruppe eine der größten Brauereien in Bayern. - ^ German beer, Iamexpat.de - ^ 'The Oxford Companion to Beer', p. 393 - ^ Marc Bona, Franziskaner Weissbier - Crack One Open, Cleveland.com, 12 January 2019 Further reading [edit]- Behringer, Wolfgang: Die Spaten-Brauerei 1397-1997. Die Geschichte eines Münchner Unternehmens vom Mittelalter bis zur Gegenwart. München: Piper 1997. ISBN 3-492-03600-7. - Sedlmayr, Fritz: Die Geschichte der Spatenbrauerei und brauereigeschichtliche Beiträge 1807-1874. Band I. München 1934, Band II. Nürnberg 1949."
}