{
  "url": "https://english.stackexchange.com/questions/3312/yall-or-yall",
  "title": "orthography - \"Y'all\" or \"ya'll\"? - English Language & Usage Stack Exchange",
  "text": "I've seen it spelled both ways. Are both correct? - 15I've seen people ardently defend ya'll as their preferred spelling, but it makes no sense when you break down the contraction.keithjgrant– keithjgrant2010-09-21 18:19:11 +00:00Commented Sep 21, 2010 at 18:19 - 3If anything, isn't ya'll a contraction of you will (where you is written as ya, as in \"ya know\")? Otherwise, the only explanation I can come up with for why someone would ever spell it ya'll is through (mistaken) analogy with contractions like I'll, he'll, etc.Kosmonaut– Kosmonaut2010-09-21 18:56:42 +00:00Commented Sep 21, 2010 at 18:56 - 3No. \"You'll\" is a contraction like \"I'll\": \"Y'all\" is a plural pronoun used in some varieties of English.Colin Fine– Colin Fine2010-09-23 17:06:25 +00:00Commented Sep 23, 2010 at 17:06 - 2@Colin: the plural pronoun is certainly y’all, but I think Kosmonaut’s point is that ya’ll could also exist, as a different contraction. I could easily imagine things like Ya’ll like it when ya see it! being used to render certain accents.PLL– PLL2010-12-05 01:13:59 +00:00Commented Dec 5, 2010 at 1:13 - 1OK, the contraction might get spelt that way. I didn't (and don't) think that that's what kiethjgrant was asking about.Colin Fine– Colin Fine2010-12-05 20:05:52 +00:00Commented Dec 5, 2010 at 20:05 5 Answers It should be the first: \"Y'all\" In contractions, apostrophes represent where letters were taken out. \"Y'all\" is a contraction of \"you all\". the \"ou \" was taken out, so you put an apostrophe were it used to be, giving you \"y'all\". - 6Let me make this additional point, because, as a Texan, this drive me nuts when I see it on TV: \"y'all\" is second person, PLURAL, not SINGULAR. \"Y'all\" is more than one person. Up north, it's \"you guys\".Chris B. Behrens– Chris B. Behrens2011-01-28 20:34:22 +00:00Commented Jan 28, 2011 at 20:34 - 2Except in Pittsburgh, where it's \"y'uns\".Michael Lorton– Michael Lorton2011-01-28 21:51:01 +00:00Commented Jan 28, 2011 at 21:51 - 3Just \"you\" can also be plural though.Ullallulloo– Ullallulloo2011-01-28 22:37:49 +00:00Commented Jan 28, 2011 at 22:37 - 2Just so, @phoog. Here in North Carolina, I have heard waitresses use \"y'all\" in addressing a singular you, while addressing the group of the table with the redundant \"all of y'all,\" as in \"All of y'all want water?\"rajah9– rajah92013-11-18 14:04:33 +00:00Commented Nov 18, 2013 at 14:04 - 1I respectfully disagree, guifa. Please see the comment from @phoog, who heard the y'all as second-person singular in Virginia. I have heard it as second-person singular in North Carolina. Which southern states have you lived in?rajah9– rajah92015-10-26 14:24:33 +00:00Commented Oct 26, 2015 at 14:24 Y'all is a contraction of \"you all\", so I would assume that y'all is the correct spelling. Wikipedia gives some background on the topic. what other contraction cuts out letters from the first word? I can't think of any. i agree its a tongue in cheek argument, pretending that the question is important (even when you're from Texas [notice the contraction for you're]). but it boggles my mind to see Northerners assume the contraction is for \"you all.\" Southerns wouldn't have abbrev that phrase in such a way. however, when saying \"ya all,\" them words tenda run tagedder. When you say \"you will\" the distinction of the \"wi\" sound tends to disappear, so its dropped when spelling \"you'll.\" Similarly, \"ya all\" became \"ya'll.\" - 2\"what other contraction cuts out letters from the first word?\" Won't is another one I can think of.Alex– Alex2011-01-28 20:27:19 +00:00Commented Jan 28, 2011 at 20:27 - 1Other contractions that cut out sounds (letters are not cut out in contractions—it’s the sounds that matter) include ’tis (etc.), ’cause, the Aussie greeting g’day, and so on. I don’t see how that’s relevant, though. Whether y’all is from ya all, you all, or ye all, it is clearly the first vowel that’s being dropped, not the second.Janus Bahs Jacquet– Janus Bahs Jacquet2014-01-27 11:23:07 +00:00Commented Jan 27, 2014 at 11:23 As a Northerner, I have seen \"ya\" as an acceptable colloquialism for \"you\". However, I've never heard/seen \"ya\" go with \"will\", it has always been shortened to \"you'll\". The \"ya\" is well established in the Midwest due to the accents inherited by the northern European immigrants. The same goes for the urban population which has retained many southern speech tendencies. That may be due to the more often used conjugations/variants of \"to be going to\" other than \"will\" in order to express the future. Although, one might hear something like \"ya'll\" as a condensed way of saying \"yeah, I will\" I would say it is a moot point, since the kind of people who believe that 'correct' is a meaningful word in this sort of question will generally not accept the word, however spelt. - 9That's a narrow view. If you are writing a fictional story, say, and have a character who uses phrases like \"Y'all,\" it is important to know the \"correct\" way to spell it, no?Scott Mitchell– Scott Mitchell2010-11-29 04:01:05 +00:00Commented Nov 29, 2010 at 4:01"
}