{
  "url": "https://www.dictionary.com/browse/natural",
  "title": "NATURAL Definition & Meaning | Dictionary.com",
  "text": "natural Americanadjective - existing in or formed by nature (artificial ). The river was spanned by a natural rock bridge. - based on the state or behavior of things in nature; constituted by nature. Growth is a natural process. - of or relating to nature or the universe. The natural beauty of this forest is remarkable. - of, relating to, or occupied with the study of natural science. The discovery of the laws of motion occurred through conducting natural experiments. - (of land) in a state of nature; uncultivated. - (of plants) growing spontaneously, without being planted or tended by humans. - having undergone little or no processing and containing no chemical additives. The restaurant is famous for serving only natural food made with only natural ingredients. - relating to hair, especially Black hair, that has not been straightened, permed, or otherwise altered in texture. - of, relating to, or proper to the nature or essential constitution. Her natural athletic ability had brought her a wonderful basketball career. - having the specified character by nature; natural-born. You can tell from his fun, interesting classes that he's a natural teacher. - proper to the circumstances of the case. The loss of his social circle was a natural result of his greed. - free from affectation or constraint. The celebrity had a charming and natural manner. - Synonyms: - unmannered, genuine, unaffected, spontaneous - arising easily or spontaneously. The mayor is known for his natural courtesy to strangers. - conforming with the nature or character of things. That sentence may be grammatical, but it is not natural English. - in accordance with or conforming to the ordinary course of things. It was natural that he should hit back after being punched. - (of a death) happening in the ordinary or usual course of things, without the intervention of accident, violence, etc. - based upon the innate moral feeling of humankind. natural justice. - having or showing feelings, such as affection, gratitude, or kindness, considered part of basic human nature. - true to or closely imitating nature. It's a very natural portrait of her. - not tinted or colored; undyed. - not treated, tanned, refined, etc.; in its original or raw state. natural wood; natural cowhide. - being or having a pale tannish or grayish-yellow color, as many woods and untreated animal skins. - related by blood rather than by adoption. - born of parents who are not married to each other; illegitimate. a natural son. - having a real or physical existence, as opposed to one that is spiritual, intellectual, fictitious, etc. - (of theology) based on what is learned from nature rather than on revelation. - unenlightened or unregenerate. the natural man. - Music. - neither sharp nor flat. - changed in pitch by the sign ♮. - - (of a horn or trumpet) having neither side holes nor valves. - Cards. - being a card other than a wild card or joker. - (of a set or sequence of cards) containing no wild cards. - - null nat (in role-playing games) designating a specified roll of the dice or die that can be taken at face value, not modified by any rule that adds to or subtracts from its value. The monster I was attacking rolled a natural 20, landing a critical hit that took out most of my health. noun - any person or thing that is or is likely or certain to be very suitable to and successful in an endeavor without much training or difficulty. You're a natural at this—you picked it up so fast! - Music. - a white key on a piano, organ, or the like. - the sign ♮, placed before a note, canceling the effect of a previous sharp or flat. - a note affected by a ♮, or a tone thus represented. - - a natural substance or a product made with such a substance. This boot conditioner is an ointment containing mink oil and other naturals. - Cards. blackjack. - Older Use. Afro. - (in craps) a winning combination of seven or eleven made on the first cast. - Archaic. a person with an intellectual disability. adjective - of, existing in, or produced by nature natural science natural cliffs - in accordance with human nature it is only natural to want to be liked - as is normal or to be expected; ordinary or logical the natural course of events - not acquired; innate a natural gift for sport - being so through innate qualities a natural leader - not supernatural or strange natural phenomena - not constrained or affected; genuine or spontaneous - not artificially dyed or coloured a natural blonde - following or resembling nature or life; lifelike she looked more natural without her make-up - not affected by man or civilization; uncultivated; wild in the natural state this animal is not ferocious - being or made from organic material; not synthetic a natural fibre like cotton - illegitimate; born out of wedlock - not adopted but rather related by blood her natural parents - music - music of or relating to a trumpet, horn, etc, without valves or keys, on which only notes of the harmonic series of the keynote can be obtained - determined by inborn conviction natural justice natural rights - cards - (of a card) not a joker or wild card - (of a canasta or sequence) containing no wild cards - (of a bid in bridge) describing genuine values; not conventional - - based on the principles and findings of human reason and what is to be learned of God from nature rather than on revelation natural religion noun - informal a person or thing regarded as certain to qualify for success, selection, etc the horse was a natural for first place - music - pontoon the combination of an ace with a ten or court card when dealt to a player as his or her first two cards - obsolete an imbecile; idiot Other Word Forms - antinatural adjective - antinaturalness noun - hypernatural adjective - hypernaturalness noun - naturally adverb - naturalness noun - nonnatural adjective - nonnaturalness noun - prenatural adjective - quasi-natural adjective - subnatural adjective - subnaturalness noun - transnatural adjective Etymology Origin of natural First recorded in 1300–50; Middle English, from Latin nātūrālis; equivalent to nature + -al 1; replacing Middle English naturel, from Middle French, from Latin, as above Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. Seagrass is one of the most powerful natural tools for tackling climate change and can protect coastlines from storms and erosion, according to Wilder Humber – a partnership of the Yorkshire and Lincolnshire wildlife trusts. From BBC Many natural sounds, including rainfall and ocean waves, fall into this category. From Science Daily This gave scientists a powerful new method for identifying useful natural compounds and understanding how they are made. From Science Daily His idea of \"harmony\" is essentially about maintaining a sustainable balance between people and the natural world. From BBC A bipartisan group of legislators on Capitol Hill introduced a bill in January to improve natural habitats for pollinators along highways, in part to strengthen agriculture. Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}