{
  "url": "https://www.reddit.com/r/DataHoarder/comments/18hp3io/the_tiktok_archiver_i_built_status_report_after_2/",
  "title": "Reddit - The heart of the internet",
  "text": "the TikTok Archiver I built - Status report after 2 years, lessons learned, a little money made, etc In 2021 I posted here in this sub about a TikTok archiving tool I built. Last week a user replied to an old comment saying \"still working great to this day\", which reminded me to write this 2-year report - indeed I've been quietly maintaining it all this time. What it is: It's a tool to download TikTok videos and manage them in a local archive offline. It's called myfaveTT , can be found on google. I love TikTok: Some people despise TikTok, but I'm a fan. If you intentionally train it (click the ❤ when seeing something you like), the algorithm quickly understands your taste, and your feed becomes very likable. I particularly want to backup all my ❤ s, which leads to: What this tool can do: - Download all videos in your Favorite list. - Download all videos in your Liked (hearts) list. - Download all videos from accounts you Follow . - MP4s are put into your target folder, alongside an \"Archive.html\" file which can be opened by a browser. It displays all your local videos, just like on TikTok. From there you can browse, play, search, sort, see statistics, etc. - When you have new Favorites or Likes, or when people you follow uploaded new videos, the local archive can sync the change. - When a video disappears from tiktok (either taken down or deleted by creator), they'll be locally tagged as \"no longer available online\". This happens extremely often - in my calculation, things on tiktok have a half life of 1.5 years. How it works: It's a chrome extension. You login on www.tiktok.com, then the extension retrieves videos on your behalf. (Screenshots) Why I built it: To use it myself - every feature originated from my own need. How many users I have: As of today, my developer dashboard reports 9617 users. There are constantly installs and uninstalls everyday but 9617 is the number of people who have it in their browser today. \"In-app purchases\": I wouldn't say it's for profit, but to prevent user abuse which may get me into trouble, I created some obstacles by money: - I set Favorites to be free to download. - I set Likes to be free up to 10000 videos, then $10 per 5000 additional videos. - I set Followings to be free up to 50 accounts, then $10 per 50 additional accounts. (Each of them could have thousands of videos) Most people don't hit the threshold; scrapers won't pay; hoarders will pay only if they care enough about these videos. That's what I think. Money I made: From November 2021 to November 2023, these \"abuse prevention mechanisms\" made me a total of $5760. It's equivalent of 1-2 weeks of my day job as a programmer. How much time I spent: My estimate is 1000 hours, which is why I say it's not for profit. I don't mind spending 1000 hours because it's really a passion project, but it would've cost only 5% time if I only made it functional for myself. The rest 95% time were spent making it usable for others. The repo currently has 3604 commits at version v1.10.34 with an amazing UI, while I myself could've used v0.1 to achieve the same goal, just with no UI. In the future I probably won't do this kind of projects again. Did I promote it: Not much - 2 years ago I posted in this sub, got 2-digit upvotes; also posted on Hacker News once, got 2-digit upvotes; last year I made a TikTok video once, got 2-digit likes. That's all. Fundamentally I hate doing these stuff - I could code for 8 hours straight, but can't do 1 hour of \"marketing\" chores without procrastinating 7 hours, so I just don't do. But the only one TikTok video I made about it was quite good, well summarized the gist of the app, highly recommend watching. What I learned: \"People are different. \" - we all know it, but it can never be overstated. Folks here think hoarding data is so important, but 99% of the population probably don't care. Each hoarder is different too. To me what's worth saving the most are the things I've personally loved before, e.g. my favorite videos, favorite movies, favorite songs, etc, but many people prefer hoarding things they haven't consumed yet (and may not consume in the future). Perhaps I should be called a collector more than a hoarder? But if every person is different, surely they can each find their own likings on TikTok, so this app is immune to people's differences, right? Wrong, because they don't hoard. People don't care if 10 videos vanish daily from their \"Liked\", that's what I learned."
}