{
  "url": "https://www.coca-cola.com/us/en/brands/simply",
  "title": "Simply® Beverages - Orange Juice, Lemonade & Fruit Drinks | Coca-Cola US",
  "text": "Simply® Beverages Juice & Fruit Drinks Products - Simply® Pop - Simply® Orange - Simply® Lemonade - Simply® Juices and Drinks - Simply® Light FAQ Commonly Asked Delivering the gold standard in fresh, pure taste is important to us at the Simply Orange Juice Company. This means that we source oranges from the USA, Brazil and Mexico at different times of the year to provide you with the best-tasting product possible. Oranges are a seasonal crop and the specific varieties of oranges we select for Simply Orange® don't grow year-round. We use as much \"in season\" juice as possible from the USA, Brazil and Mexico in order to bring you our best tasting juice, 365 days a year. At the Simply Orange Juice Company, we stand behind our quality products and their guaranteed fresh taste. If you do not agree that your Simply Juices® or Simply Drinks® product tastes fresh, we invite you to try another of our Simply Beverages, on us. (US consumers only, limited to one (1) per household). Please call 1-800-871-2653 for more information. We don't recommend drinking any of our products that have been unrefrigerated for an extended period of time. Simply Beverages do not contain preservatives, so we can give you a fresh taste. We suggest opting for a new, chilled carafe. The oranges that go into Simply Orange are carefully selected and picked at their peak of ripeness. After harvesting, the oranges are washed, sorted and squeezed to collect fresh juice and natural oils. Some oils may later be blended back into the juice to ensure consistent fresh-squeezed taste. Pulp may be added back too depending on the product. Simply Orange is never made from concentrate. The juice is gently pasteurized to ensure safety, but minimally as possible to preserve taste. Depending on the time of year, juice is either chilled and safely stored for future use to retain great taste and quality or sealed in our unique carafes for delivery to you. The great taste of Simply Orange comes from nothing but oranges. Simply Orange contains no synthetic flavors, additives, or preservatives. Small amounts of juice and peel oil, collected during orange juice making and distilled for taste and purity, may be blended back into the juice to ensure consistent fresh-squeezed taste."
}