{
  "url": "https://liverfoundation.org/liver-diseases/fatty-liver-disease/nonalcoholic-steatohepatitis-nash/mash-definition-prevalence/",
  "title": "MASH Definition & Prevalence",
  "text": "Steatotic* liver disease is a condition in which excess fat is stored inside liver cells, making it harder for the liver to function. One cause of fat buildup in the liver is heavy alcohol use, referred to as alcohol-associated fatty liver disease. This is a common, but preventable disease and is the earliest stage of alcohol-associated liver disease. You can read more about the different stages of alcohol-associated liver disease here. When the buildup of fat in the liver is not related to significant alcohol consumption, the condition is called metabolic dysfunction-associated steatotic liver disease (MASLD)*. MASLD is a general term for a range of conditions characterized by extra fat in liver cells that is not caused by alcohol. It used to be known as nonalcoholic fatty liver disease, or NAFLD. It’s normal for the liver to contain some fat. However, if more than five percent of the liver’s weight is fat, it’s considered a to be a steatotic liver (previously called a fatty liver). There are two different types of steatotic liver disease: Fibrosis This fibrosis can progress to cirrhosis, where hard scar tissue replaces an increasingly larger amount of soft healthy liver tissue. Cirrhosis from MASH typically takes years of damage to develop. Simple steatotic liver In this form of MASLD, you have fat in your liver, but little or no inflammation of the liver or damage to liver cells. Typically, this form does not progress to cause liver damage. Metabolic dysfunction-associated steatohepatitis (MASH) This is the more severe form of MASLD in which you have hepatitis – meaning swelling or inflammation of the liver –– and liver cell damage, in addition to fat in your liver. Inflammation and liver cell damage can cause fibrosis, or scarring, of the liver. MASH (metabolic dysfunction-associated steatohepatitis) is a progression of MASLD in which simple steatosis gets worse and inflammation of the liver occurs. The medical terms for inflammation (swelling) of the liver is hepatitis. This is not be be confused with virus-related hepatitis (e.g., hepatitis C). Liver cell damage may also occur. Inflammation and cell damage can lead to a condition known as fibrosis, or scarring of the liver. Over time, fibrosis can get worse. As fibrosis progresses, hardened scar tissue replaces an increasingly larger amount of soft, healthy liver tissue. When this happens, it is called cirrhosis. It usually takes many years to develop cirrhosis due to MASH. MASLD is the most common chronic liver condition in the United States. It’s estimated that about 25 percent of adults in the U.S. have MASLD. Of those with MASLD, about 20 percent have MASH (five percent of adults in the U.S.). Most people with MASLD have simply fatty liver. The reason some people with MASLD have simple fatty liver and others get MASH isn’t known, although research suggests that certain genes may play a role. *Steatotic liver disease is the new name for fatty liver disease. *Metabolic dysfunction-associated steatotic liver disease (MASLD) is the new name for nonalcoholic fatty liver disease (NAFLD). *Metabolic dysfunction-associated steatohepatitis (MASH) is the new name for nonalcoholic steatohepatitis (NASH). Medically reviewed on April 2025. Last updated on July 7th, 2025 at 12:51 pm"
}