{
  "url": "https://es.ccm.net/aplicaciones-e-internet/internet/9626-como-recuperar-archivos-borrados-de-onedrive/",
  "title": "Cómo recuperar archivos borrados de OneDrive",
  "text": "Cómo recuperar archivos borrados de OneDrive ¿Eliminaste un archivo o una carpeta de OneDrive por error? No te preocupes, el servicio de almacenamiento en la nube de Microsoft conserva tus archivos eliminados en la papelera de reciclaje durante 30 días. A continuación te mostramos cómo recuperarlos desde tu navegador, la aplicación de escritorio, teléfono móvil o tablet. ¿Cómo recuperar archivos borrados desde el navegador? Cada vez que borras un archivo en OneDrive, puedes encontrarlo en la Papelera de Reciclaje y restaurarlo, incluso sin tener descargada la aplicación. Así es como se hace en el sitio web: - Ingresa a OneDrive con tu cuenta de correo electrónico y contraseña de Microsoft. - En el menú lateral izquierdo que aparece, haz clic en Papelera de reciclaje. - Si deseas recuperar todos los archivos y/o carpetas que se encuentran en tu papelera de reciclaje, solo pulsa Restaurar todos los elementos en la parte superior. - Si quieres recuperar solo algunos documentos, ubica tu cursor sobre el archivo o la carpeta que te interesa recuperar y te aparecerá un círculo junto al nombre. Haz clic allí para seleccionarlo y, luego, pulsa Restaurar. Tus archivos volverán a su ubicación original en OneDrive. ¿Cómo restaurar archivos desde la app de escritorio de OneDrive? Si eliminaste el archivo desde la aplicación de escritorio de OneDrive, puedes encontrarlo en la papelera de reciclaje de tu ordenador. Recupera el elemento borrado como lo haces habitualmente: - Si usas Windows, ve a la Papelera de reciclaje de tu computadora, haz clic derecho sobre el archivo o la carpeta en cuestión y, en el menú desplegable, selecciona la opción Restaurar. - Si usas Mac, dirígete a la papelera, pulsa Command + clic y selecciona la opción Sacar de la papelera. - Enseguida, el documento regresará a su ubicación original y los cambios se verán reflejados en todos tus dispositivos. ¿Cómo restaurar archivos borrados de OneDrive desde tu smartphone o tablet? Si no tienes acceso a un ordenador, puedes recuperar un archivo de OneDrive desde tu celular o tablet. En primer lugar, encuentra la papelera de reciclaje de OneDrive en tu móvil siguiendo estos pasos: En iPhone o iPad - Abre la app de OneDrive, ubícate en la pestaña Archivos (esquina inferior izquierda) y desliza hacia arriba hasta llegar a la parte inferior, donde encontrarás el ícono Papelera de reciclaje. Toca allí. - Ahora, haz clic en los puntos suspensivos junto al archivo que quieras recuperar y selecciona la opción Restaurar. En Android - Abre la app, entra a la pestaña Yo y selecciona Papelera en el menú. - Una vez que hayas identificado el archivo o carpeta que quieres recuperar entre los elementos eliminados, pulsa el ícono de tres puntos junto al nombre. En el menú que aparece, selecciona Restaurar y ¡listo! Los cambios se sincronizarán en todos tus dispositivos con una conexión a internet."
}