{
  "url": "https://www.countryliving.com/gardening/g32161249/daisy-types/",
  "title": "Types of Daisies to Grow in Your Flower Garden",
  "text": "1Oxeye Daisy (Leucanthemum vulgare) Roger W Downes Photography//Getty Images This is the classic daisy: the one you probably drew as a kid. It grows well—even invasively—in grasslands and meadows. Dairy farmers consider it a pest as it taints milk. The oxeye daisy typically grows to be about 20 inches tall and needs well-draining soil to thrive. Keep Reading: How to Grow Daisy Flowers 2Marguerite Daisy (Argyranthemum frutescens) Getty Images Similar to the Oxeyes, the marguerite daisy is an annual native to the Spanish Canary Islands. This beauty demands plenty of sunlight, a well-draining soil, and a warm temperature. In return it offers fragrant flowers sprouting from a low shrub. Blooms: Summer through Fall More: 25 Fragrant Plants That Will Make Your Garden Smell Amazing Advertisement - Continue Reading Below 3Shasta Daisy (Leucanthemum × superbum) wulingyun//Getty Images The Shasta daisy is a low-maintenance perennial plant that looks like the common daisy but grows in bushes that span about 3 feet tall and 2 feet wide, making it much larger, and more impressive than the small wildflower. They're great for achieving that classic daisy look, and are one of the more popular daisies to plant! Their tall stems make them great for cut flower arrangements. Blooms: Spring and Summer Hardiness Zones: 4 to 9 More: How to Design and Grow a Cutting Garden 4Golden Shrub Daisy (Euryops pectinatus) NataliaCatalina This evergreen (it's foliage is a striking gray-green color) will bloom year round in warm climates. It's native to South Africa, likes full sun, and well draining soil. It can even handle a bit of salt so it's a great choice if you live near the beach. Blooms: Year round in warm climates Hardiness Zones: 8 to 11 More: 25 Yellow Flowers for the Happiest Garden Advertisement - Continue Reading Below 5Blanket Flower (Gaillardia) Catherine McQueen Also called Indian Blanket, this is certainly one showy daisy. Red, pink, or peach petals fringed with yellow make this a garden favorite. Native to North and South Americas this drought-tolerant daisy loves full sun. Blooms: Early Summer and Fall Hardiness Zones: 3 to 1o More: 30 Best Pink Flowers for An Enchanting Garden 6Damianita (Chrysactinia mexicana) SWInsider Know for its drought tolerance and nice smelling evergreen foliage. This plant loves full sun, warm climates, and must have well draining soil. Blooms: Spring and Fall Hardiness Zones: 7 to 11 More: 25 Yellow Flowers for the Happiest Garden Advertisement - Continue Reading Below 7Coneflower (Echinacea) rathyrye An American native know for its pink purple leaves and orange center. Used as a medicinal herb to boost immunity this hearty plant looks great in any garden bed. Drought tolerant once established, it's also resistant to deer and bunnies. Blooms: Late Spring to late Summer Hardiness Zones: 4 to 9 More: 30 Best Pink Flowers for An Enchanting Garden 8 Golden Marguerite (Anthemis tinctoria) Flottmynd Also known as Golden Chamomile or Boston Daisy this perennial is native to Europe and Western Asia. Hardy from zones 3 to 8, it blooms throughout the fall. This is a perfect fit for a cottage style garden. Blooms: Summer into Fall Hardiness Zones: 3 to 8 More: 25 Yellow Flowers for the Happiest Garden Advertisement - Continue Reading Below 9Field Daisy (Bellis perennis) Andrea Kamal//Getty Images Also known as the English Daisy, this is the archetypal daisy wildflower. You might find them taking over a lawn, or sprouting along roadsides, but they're also perfectly lovely along garden paths! Blooms: Spring and Summer Hardiness Zones: 4 to 8 More: 10 Ideas for Growing a Wildflower Garden Wherever You Live 10Gerbera Daisy (Gerbera jamesonii) Isabel Pavia//Getty Images Native to Africa, gerbera daisies (also called barberton or transvaal daisies) come in a wide variety of bright colors, from red and pink to orange and yellow. They're beloved by pollinators and have a good, long bloom, making them great garden flowers. Blooms: Late spring through Fall Hardiness Zones: 8 and warmer (otherwise, plant as annuals) More: How to Grow Gerbera Daisies in Your Garden Advertisement - Continue Reading Below 11African Daisy (Osteospermum spp.) Paolo Carnassale//Getty Images 12Gloriosa Daisy (Rudbeckia hirta) Natalia Ganelin//Getty Images Technically gloriosa daisies are cultivars of black-eyed Susans. Though many use the names interchangeably, gloriosas tend to be larger and showier than wild black-eyed Susans. They can be grown as short-lived perennials or as annuals. Blooms: Late summer and early Fall Hardiness Zones: 3 to 7 More: 35 Best Fall Flowers and Plants for Autumn Interest Advertisement - Continue Reading Below 13Blue Marguerite Daisy (Felicia amelloides) Getty Images A South African native, the blue marguerite daisy is known for its sky-blue petals and bright yellow center. It grows best in mild summer temperatures. Blooms: Mid to late summer Hardiness Zones: 10 and higher, or grown as an annual More: 20 Brilliant Blue Flowers for Your Garden 14Cape Daisy (Dimorphotheca ecklonis) Getty Images Related to (and according to some, a species of) the African daisy, the cape daisy is a bush with daisy-like flowers that is typically grown as an annual, and that can grow up to 4 feet tall and 3 feet wide. Rich in pollen and known to attract bees, the cape daisy comes in colors like purple, yellow, and white. Blooms: Late spring through fall Hardiness Zones: 9 and higher or as an annual More: 25 Best Flowering Shrubs to Make Your Landscape Sing Advertisement - Continue Reading Below 15Indian Chrysanthemum (Chrysanthemum indicum) Wirestock//Getty Images Yep, mums are a kind of daisy! They're all part of the Asteraceae family. Indian mums are prized not only as an autumn-blooming flower, or for their dried beauty, but they can also be used to make a delicious tea. Blooms: Summer through Fall Hardiness Zones: 4 to 9 More: How to Plant, Grow, and Care for Fall Chrysanthemums 16Aster Daisy (Aster amellus) Getty Images Also called Michaelmas Daisies, asters are in the daisy family. These tough wildflowers are typically lilac or purple with a long bloom time. Pollinators love them, and they make a great border flower. Bonus: they're deer resistant! Blooms: Late summer to mid-fall Hardiness Zones: 5 to 8 More: 38 Deer-Resistant Plants to Protect Your Garden Advertisement - Continue Reading Below 17Desert Star Daisy (Monoptilon bellidiforme) Jared Quentin//Getty Images An annual plant native to parts of Mexico, California, Arizona, and Nevada, the desert star daisy thrives in dry climates and has super short stems, making it appear that the flower grows at ground level. You're unlikely to be able to plant it in your garden, though if you live in the Southwest, you may find it growing about! More: 30 Different Types of Cactus You Can Grow at Home 18German Chamomile (Matricaria recutita) Martin Ruegner//Getty Images Advertisement - Continue Reading Below 19Silver Townsend Daisy (Townsendia incana) Getty Images Small white hairs on the stems of the silver townsendia daisy give the plant's foliage a silvery appearance. 20Florist's Daisy (Chrysanthemum × morifolium) Getty Images Advertisement - Continue Reading Below Readers Also Read Advertisement - Continue Reading Below Advertisement - Continue Reading Below"
}