{
  "url": "https://www.upb.pitt.edu/maps-directions/area-attractions",
  "title": "Area Attractions | University of Pittsburgh at Bradford",
  "text": "Area Attractions Bradford is in the middle of everywhere! No matter what you like to do for fun, you can do it here or within a day's drive. If you're looking for something to do in the region, (or maybe you need something to do with your family when they come to visit) you have many choices. The Bradford and surrounding area has many interesting and historical points of interest, including Kinzua Bridge State Park, the Penn-Brad Oil Museum, the Zippo/Case Museum and the Marilyn Horne Museum and Exhibit Center. Take just a couple of steps off campus and you can hike, bike, hunt, fish, canoe, ride horses, etc. Or, take a short drive to enjoy shopping, sightseeing and cultural activities. Beyond Bradford, you'll find: - Excellent downhill skiing and snowboarding at Holiday Valley Ski Resort in Ellicottville, N.Y., a 45-minute drive to the north - Canoeing, biking, picnicking, hiking, fishing and swimming in Allegany State Park in New York, just 10 minutes to the north - Hiking, camping, fishing and swimming in the Allegheny National Forest, just a few minutes south of campus - Arts and cultural events along with prime shopping in Erie, PA (a 90-minute drive west); Buffalo, NY, (90 minutes north); and Pittsburgh (3 1/2 hours to the south) - A large, metropolitan center in Toronto, Canada, 3 1/2 hours to the north Bradford Creative and Performing Arts Center - Nationally known acts come to Bradford each season. Bradford Little Theatre - Locally produced, award winning productions hit the stage annually. Buffalo Philharmonic Orchestra - See the BPO and other major recording artists at Kleinhan's Music Hall. Buffalo Sabres Hockey - National Hockey League's Buffalo Sabres and the Key Bank Center are just 75 miles from Bradford, a short drive up U.S. Route 219. The arena annually attracts major touring artists and other performances. Crook Farm - Visitors can enjoy a walk back in time as they visit the 19th century restored farm house, barn, one-room schoolhouse, herb garden, tool house, train depot and outbuildings located in Bradford. Eldred World War II Museum - The Eldred World War II Museum is located in Eldred, PA, 85 miles south of Niagara Falls, NY. During World War II, Eldred was the site of a British and American munitions plant which produced eight million bombs, mortar shells and fuses. Erie Otters - Ontario Hockey League team featuring many of the future stars of the NHL. Glendorn - A 1280 acre estate for public lodging while preserving the estate. The goal at Glendorn is to achieve a level of comfort, with an attendant sense of privacy and pause, take stock and renewal but also to have fun. We encourage fly fishing instruction, trap and skeet lessons, hiking or biking the trails, canoeing, or relaxing by the swimming pool or in front of the estate's 41 wood burning fireplaces. Reservations: 800-843-8568 Kinzua Bridge State Park- in Mount Jewett, Pa., is home tot the remains of the Kinzua Viaduct, which was once the longest and tallest railroad structure. Although a tornado destroyed part of the bridge in 2003, visitors can walk the skywalk and look into the gorge below. Kinzua Dam- Kinzua Dam is at the heart of one of the largest and most popular outdoor recreation complexes in the northeastern United States. You can visit the reservoir and discover a diversity of year-round recreational opportunities. Marilyn Horne Museum and Exhibit Center- is the university’s presence in downtown Bradford. It showcases highlights from the personal archive of legendary opera singer Marilyn Horne. The National Comedy Center- in Jamestown, N.Y., is the United States’ official cultural institution and museum dedicated to comedy. The state-of-the-art museum features more than 50 immersive exhibits to take visitors on an interactive journey through comedy history. Penn-Brad Oil Museum - The Penn-Brad Oil Museum in Bradford contains an interesting collection of artifacts, mementos and antique field equipment from the oil industry and features a 72 foot tall wooden standard drilling rig used in developing the first billion dollar oil field. Rock City Park - Climb gigantic rocks just minutes from Bradford. Seneca Allegany Casino - Legal gaming just minutes from Bradford along with big-name concerts and shows Seneca Iroquois National Museum- in Salamanca, N.Y., houses an extensive collection of Haudenosaune (hoe-dee-no-SHOW-nee) artifacts. Shea's Performing Arts Center - located in Buffalo, N.Y., one of the northeast's finest arts venues. Struther's Library Theatre - historic playhouse in Warren, Pa. The Tuna Valley Trails Association- has created and maintains a dozen trails in the Bradford area, ranging from the gentle, paved Richard E. McDowell Trail on campus to more challenging hiking trails. The Lucille Ball-Desi Arnaz Center - Museum dedicated to Lucy and Desi, in nearby Jamestown, N.Y., the hometown of Lucille Ball.. Warner Theater - Erie, Pa.'s leading fine arts venue. Zippo/Case Visitor's Center - Since its opening in 1997, the Zippo/Case Visitors Center in Bradford has attracted thousands of visitors from over 120 countries around the world. Step through history and trace two beloved American icons, the Zippo lighter and Case knife. Assemblies of God - Abundant Life Assembly of God Church, 140 Minard Run Road, 814-368-9997. Baptist - Bolivar Drive Baptist Church, 361 Bolivar Drive, 814-368-8521 - First Baptist Church, 1289 E. Main St, 814-368-6335 - Faith Baptist Church, 440 Seaward Avenue, 814-368-7622 - Hilltop Baptist Church, Gifford, Pa., 814-465-3336 Catholic - St. Bernard Catholic Church, 95 East Corydon Street, 814-362-6825 - St. Francis Catholic Church, 15 St. Francis Drive, 814-368-6959 Catholic (Latin Rite) - Holy Family Catholic Church, 5 Walker Avenue, 814-368-9157 Christian Fellowship - People's Christian Fellowship, 10 Harding Avenue, 814-368-4795 Missionary and Alliance - Bradford Alliance Church, 240 Minard Run, 814-368-6612 Church of Christ - Bradford Church of Christ, 121 Derrick Road, 814-368-9972 Episcopal - Church of the Ascension, 26 Chautauqua Place, 814-368-8915 Evangelical - Sawyer Evangelical Church, 777 South Kendall Avenue, 814-368-5359 Foursquare Gospel - Foursquare Gospel Church, 50 Sullivan Road, 814-368-3605 Free Methodist - First Free Methodist, 18 Boylston Street, 814-368-7381 - Open Arms Community Church, 71 Congress Street, 814-368-8846 Jehovah's Witness - Kingdom Hall of Jehovah's Witnesses, Minard Run Road, 814-362-6725 Lutheran - Emmanuel Lutheran Church, 152 Seaward Avenue, 814-362-4347 - Grace Lutheran Church, 79 Mechanic Street, 814-362-3244 Mennonite - Bradford Mennonite Church, 110 Chestnut Street, 814-362-2809 Nazarene - Bradford Church of the Nazarene, 55 North Bennett Street, 814-368-8129 Presbyterian - East End Presbyterian Church, 18 Welch Avenue, 814-368-8378 - First Presbyterian Church, 54 East Corydon Street, 814-362-5569 Seventh-day Adventists - Seventh-day Adventist Church of Derrick City, 522 Derrick Road, 814-362-2294 Synagogues - Temple Beth El, 144-146 Clarence Street, 814-368-8204 United Methodist - Asbury United Methodist Church, 385 East Main Street, 814-368-7885 - First United Methodist Church, 23 Chambers Street, 814-362-3584 - Hill Memorial United Methodist Church, 44 Kennedy Street, 814-362-4375 - Sawyer United Methodist Church, 692 South Kendall Avenue, 814-362-1995 - West Branch United Methodist Church, 605 West Washington Street, 814-362-3053 Wesleyan - First Wesleyan Church, Bishop & Boylston Street, 814-368-7865 You will find several restaurants in and around town that serve delicious food. You can choose from Italian, Chinese or try one of the area's famous \"beef on weck\" sandwiches at many of these locations: A Slice of the 80s - 19 Congress St. - 814-362-8080 Arby's - 75 Forman St. - 814-362-4902 Beefeaters Restaurant - 27 Congress Street - 814-362-9717 Reservations for 10 or more. Best Western - 100 Davis Street South - 814-362-4501 Bradford Brew Station - 104 Chestnut St. - 814-368-3137 Burger King 1008 East Main St. 814-362-4768 Chu-Lee Gardens Restaurant - 405 East Main St. - 814-362-4700 CJ Bar-B-Que & Catering - 545 E. Main St - 814-596-2894 Corner Bar - 42 Mechanic St - 814-368-6722 Custer City Drive-In Route 219 Custer City, PA - 814-596-0054 Derrick City Diner - 563 Derrick Road - 814-368-3975 Dominos Pizza - 15 Main St. - 814-368-8900 Dunkin' - 9 Chautauqua Pl. - 814-596-0079 Foster Brook Creamery - 9 Derrick Rd. - 814-362-7772 Fox's Pizza Den - 444 East Main St. - 814-368-8555 Glendorn - 1000 Glendorn Drive -- Reservations: 800-843-8568 Great Wall - 94 Main St. - 814-368-8017 Grocery Stretcher - 32 Main St - 814-368-9394 Hong Kong Buffet - 1020 E. Main Street #3 - 814-362-8158 JJ's Saloon - 413 E Main S - 814-362-4064 John Williams European Pastry Shop - 20 Mechanic Street - 814-362-6637 Kabob's at The Option House - 41 Main St. - 814-362-2622 Kennedy St. Cafe - 11 Kennedy St - 814-596-0085 KFC - 119 West Washington St. - 814-366-5355 Leo’s Sub Shop - 83 Main St. - 814-368-7827 Liberty Tavern - 491 E. Main St. Little Caesars - 100 w. Washington st. - 814-362-7002 Mama Janes Eatery - 31 Bolivar Drive - 814-596-0109 Marilyn Horne Museum Café - 2 Marilyn Horne Way - 814-362-7990 McDonald's - 141 Main St. 814-362-6232 Model T Inn - 555 Derrick Road - 814-362-2947 Papa Scoops - 58 West Washington St. - 814-368-3904 Players Downtown Sports Bar - 12 Mechanic St. - 814-368-9789 Pine Acres Golf & RV Resort - 1503 Pine Acres Golf Course - 814-362-2005 Pizza Hut - 101 West Washington St. - 814-362-7493 Pizza Napoli and Restaurant - 147 West Washington St. - 814-368-6331 Rookies Sports Bar & Grill - 211 Main Street - 814-368-9990 Sheetz - 2 Bolivar Drive - 814-362-2040 Subway - 48 Davis St and 50 Foster Brook Blvd Taco Bell - 1001 East Main St. - 814-596-0044 Taco Inc. - 27 Main St - 814-596-0062 Tasta Pizza and Taproom - 508 East Main St. - 814-368-7271 The Magic Bean Café - 17 Kennedy St. - 814-596-0018 The Runway Bar & Grill - 212 Airport Rd, Lewis Run, PA - 814-362-4836 The Willows Restaurant - 2669 W Washington St - 814-362-2222 Tim Hortons - 1002 East Main St. - 814-368-9502 Togi's Family Restaurant - 412 East Main St. - 814-368-6447 Togi's Substation - 402 E Main St - 814-368-3120 Westline Inn, Inc. - Westline, PA - 814-778-5103 (Westline Rd off 219 SOUTH)"
}