{
  "url": "https://mushrooms.techinfus.com/en/syedobnie/shampinony.html",
  "title": "Description of the types of champignon mushrooms, photos of field, ordinary, double-ring and other types of champignons",
  "text": "Champignons - edible mushrooms: photo, description of species The Russian name for mushroom champignon comes from the French words champignon, meaning simply “mushroom”. All of us have long been accustomed to the fact that edible champignons are grown in special greenhouses, and therefore we consider this mushroom almost artificial. Nevertheless, there are many types of champignons growing in natural conditions: in forests, and meadows and pastures. They are no less tasty than those grown in artificial mushrooms and certainly do not contain any additives. On this page you can find a photo and a description of the species of champignons growing in natural conditions: field, ordinary, double-ring and Bernard. Content How ordinary mushrooms look: photo and description Category: edible. Champignon hat (Agaricus campestris) (diameter 6-16 cm): white or light brown, has the shape of a hemisphere, which eventually changes to almost open. To the touch velvety, less likely to be with small scales. As can be seen in the photo of this type of champignon, the mushroom leg (height 4-11 cm) of the same color with a hat, straight and even, expands closer to the base. The middle part has a noticeable wide white ring. Records: change color from whitish to pinkish, and then light brown. Pulp: white, but it turns pink at the site of the break and when interacting with air. According to its description, ordinary champignon is difficult to confuse with any other species, there are no doubles in this fungus. When growing: from late May to mid-October in temperate Eurasian countries. Where can I find: on fertilized soils of parks and gardens or in cemeteries. Making its way through asphalt and other hard surfaces, this type of champignon mushroom can develop a stubborn pressure of seven atmospheres. Eating: edible mushrooms common champignons are used in cooking in almost any form, except for salting and pickling. Application in traditional medicine (data not confirmed and not passed clinical trials!): in the form of tincture, which has a strong bactericidal effect. This remedy was considered very effective during epidemics of typhoid fever. Other names: real champignon, pechilitsa (in Ukraine and Belarus). Field champignon: appearance and photo description Category: edible. In 1762 field champignon (Agaricus arvensis) Professor Jacob Schaeffer, a botanist, ornithologist, and entomologist, singled out a separate group as a professor at the University of Wittenberg and Tübingen. In appearance, field champignon is slightly different from other species. Hat (diameter 7-22 cm): white, gray, cream or light ocher (in old mushrooms) with the remains of the bedspread. It has the shape of a small egg or bell, but over time it becomes almost spread with a noticeable tubercle in the center. The edges of young mushrooms are wrapped inward, later becoming wavy. In dry weather, they can crack very much, due to which they become uneven and torn. The touch is smooth, in rare cases it can be with small scales.Leg (height 5-12 cm): usually the same color as the hat, turns yellow when pressed, fibrous, has a cylindrical shape and a large two-layer ring. Often tapers from bottom to top. In young mushrooms, solid, but eventually becomes hollow. Easy to detach from the hat. Records: can be white-gray, brownish, with a mustard or purple hue, in old mushrooms dark brown or black. Pulp: white or light yellow, very dense, turns yellow on a cut and when interacting with air. Tastes sweet. The description and photo of field champignon are similar to the description and photo of a pale pale grebe (Amanita phalloides) and yellow-skinned champignon (Agaricus xanthodermus). However, the pale toadstool does not have an anise smell and has a single-layer ring on the leg. And the yellow-skinned champignon has a strong medicinal smell of carbolic. Field mushrooms grow from late May to early November in the northern regions of Russia. Where can I find: in open spaces of forests, fields and pastures, can be found in mountainous areas, nettles or in spruce. Large groups of field champignons sometimes form “witch rings”. Eating: both fresh and after any kind of processing. Very tasty mushroom, in many countries it is considered a delicacy. Application in traditional medicine (data not confirmed and not passed clinical trials!): in the form of an extract as an effective tool in the treatment of diabetes. Decoctions from ancient times are used in the outback as an antidote for snake bites. Important! Field mushrooms often accumulate heavy metals. High doses of cadmium, copper and other elements can be hazardous to health. Try to pick mushrooms in ecologically clean areas. The English call the field mushroom horse mushroom - \"horse mushroom\" because it often grows on horse manure. Edible Mushroom Bernard Mushroom Category: edible. Bernard champignon hat (Agaricus bernardii) (diameter 6-16 cm): white, gray or ashy, slightly convex or almost completely flat, sometimes with scales. Very fleshy, with the edges turned inward. In dry weather it can be covered with thin cracks. Leg (height 4-12 cm): has the shape of a cylinder. Records: very frequent. Young mushrooms are pale pink in color, over time they become creamy brown. Pulp: white, noticeably turns pink with age. Photo and description of Bernard champignon mushrooms resembles the writing of double-ring champignon (Agaricus bitorquis) with a sour smell, double ring. However, the Agaricus bitorquis hat does not crack. When growing: from the end of June to mid-October in almost all countries of Europe. Where can I find: on salt or sandy soils. Eating: in any form. Application in traditional medicine: not applicable. Important! Mushroom Bernard often grows along polluted roads and highways and strongly absorbs gasoline vapors and road dirt, so use only those mushrooms that are collected in ecologically clean places. Description of double-champignon Category: edible. Two-ring champignon leg (Agaricus bitorquis) (height 4-12 cm): smooth, white, with a double ring. Records: frequent, pinkish or light red in color. Pulp: dense, on a cut and when interacting with air it slowly but noticeably turns pink. The mushroom got its name due to the characteristic double ring formed by the remains of the bedspread. Hat (diameter 5-18 cm): off white or light gray. Fleshy and thick, usually smooth to the touch and only in rare cases can be with small scales. Application in traditional medicine: not applicable. Important! Often double-ring champignons grow near busy motorways and dirty roads, so they can accumulate harmful substances. Other names: sidewalk champignon. The description of double-champignon mushroom is similar to the description of Bernard's champignon. When growing: from the beginning of May to the end of September in temperate countries of the Eurasian continent. Where can I find: on the fertilized soil of gardens and orchards, often in city parks, ditches and on roadsides. Eating: in any form."
}