{
  "url": "https://abcnews.go.com/GMA/Culture/golden-kpop-demon-hunters-adds-award-success-grammy/story?id=129761614",
  "title": "'Golden' from 'KPop Demon Hunters' adds to award success with Grammy win - ABC News",
  "text": "'Golden' from 'KPop Demon Hunters' adds to award success with Grammy win \"Golden\" clinched the win for best song written for visual media. The artists behind \"Golden\" from the hit Netflix film \"KPop Demon Hunters\" have won a Grammy award. The song, performed by artists EJAE, Audrey Nuna, and Rei Ami -- the singing voices behind the film's fictional K-pop group, HUNTR/X -- took home the award for best song written for visual media on Sunday at the 68th Annual Grammy Awards. Other nominees in the category included \"As Alive as You Need Me to Be\" from \"TRON: Ares,\" \"I Lied to You\" from \"Sinners,\" \"Never Too Late\" from \"Elton John: Never Too Late,\" \"Pale, Pale Moon\" from \"Sinners,\" and \"Sinners\" from \"Sinners.\" On the red carpet, EJAE, Nuna and Rei Ami spoke with \"Good Morning America\" and reacted to their win. \"It's perfect timing. It's also long overdue at the same time, and we're just so proud to be part of a team that's proud to represent our culture, represent people who are from different places and just anyone who's been [outcast] and to represent this music and film,\" Nuna said. \"Golden\" was also nominated in the song of the year and best pop duo/group performance categories. The song has already seen success this awards season, earning a statuette at this year's Golden Globe Awards, where it took home the award for best original song. The song is also nominated for best original song at the upcoming Oscars in March. Others from the K-pop world who were nominated this year include BLACKPINK singer ROSÉ, who earned nods for song of the year and record of the year alongside Bruno Mars for their hit song \"APT.\" The duo were also nominated for best pop duo/group performance. Additionally, the Los Angeles-based global girl group KATSEYE, whose music and dance moves are influenced by K-pop superstars, earned nominations for best new artist and best pop duo/group performance. Beginning next year, the Grammys will be exclusively simulcast on ABC, Hulu and Disney+. The Walt Disney Co. is the parent company of Hulu, Disney+ and ABC."
}