{
  "url": "https://support.google.com/youtube/answer/7548152?hl=fr-419&co=GENIE.Platform=Desktop",
  "title": "Utiliser YouTube Studio - Ordinateur - Aide YouTube",
  "text": "YouTube Studio est la plate-forme des créateurs. Elle rassemble tous les outils nécessaires pour gérer votre présence en ligne, développer votre chaîne, interagir avec votre audience et générer des revenus. Remarque : Vous pouvez activer le thème sombre dans YouTube Studio. Gérer votre chaîne - Connectez-vous à YouTube Studio. Vous pouvez gérer vos vidéos et votre chaîne à l'aide du menu de gauche. - Tableau de bord : accédez à une présentation générale des nouvelles activités de votre chaîne ainsi qu'aux nouveautés sur YouTube. - Contenu : découvrez une vue d'ensemble de vos vidéos, diffusions en direct, posts et playlists. - Données d'analyse : surveillez les performances de votre chaîne et de vos vidéos grâce aux métriques et rapports de YouTube Analytics. - Communauté : consultez les commentaires laissés sur vos vidéos et répondez-y. Vous pouvez également consulter les mentions de votre chaîne faites par d'autres créateurs. - Sous-titres : ajoutez des sous-titres à vos vidéos. - Détection de contenus : envoyez des demandes de retrait pour atteinte aux droits d'auteur. - Revenus : si vous participez au Programme Partenaire YouTube, vous pouvez gérer vos paramètres de monétisation. - Personnalisation : personnalisez la mise en page, le branding et les informations générales de votre chaîne. - Bibliothèque audio : obtenez de la musique et des effets sonores à utiliser dans vos vidéos. Remarque : Inscrivez-vous au programme YouTube Creators Research et aidez-nous à améliorer YouTube pour les créatrices et créateurs. En savoir plus Gérer vos vidéos Pour gérer une vidéo spécifique, accédez à l'onglet Contenu, puis cliquez sur la miniature de la vidéo de votre choix. Vous pouvez également utiliser la barre de recherche pour retrouver une vidéo. - Détails : modifiez le titre, la description et les paramètres de la vidéo. - Analytics : consultez des métriques disponibles au niveau de la vidéo. - Éditeur : découpez votre vidéo, ajoutez-y des écrans de fin et des pistes audio, ou floutez-la. - Commentaires : consultez les commentaires laissés sur votre vidéo et répondez-y. - Sous-titres : ajoutez des pistes audio multilingues ainsi que les traductions des titres et des descriptions à vos vidéos. - Droits d'auteur : affichez et gérez les réclamations pour atteinte aux droits d'auteur. - Clips : créez et gérez des clips. Découvrez des conseils destinés aux créateurs concernant le matériel vidéo et le tournage. Conseils de navigation Accéder à votre chaîne ou à l'une de vos vidéos Pour ouvrir la page d'accueil de votre chaîne, cliquez sur votre photo de profil Votre chaîne. Pour ouvrir la page de lecture de votre vidéo, cliquez sur le lien sous sa miniature. Si vous êtes en train de modifier une vidéo, sa miniature s'affiche à cet endroit. Pour accéder rapidement à la page de lecture de la vidéo, vous pouvez cliquer sur cette miniature. Rechercher vos vidéos Pour trouver rapidement des vidéos, utilisez la barre de recherche située en haut de YouTube Studio. Vous pouvez également retrouver vos vidéos sur la page \"Contenu\". Pointer sur des éléments pour afficher plus d'options Les icônes Voir sur YouTube , Données d'analyse , Commentaires et Options apparaissent parfois lorsque vous pointez sur certaines informations dans YouTube Studio. - L'icône Voir sur YouTube permet d'accéder rapidement à la page de lecture d'une vidéo sur YouTube. - L'icône Données d'analyse permet d'accéder directement aux données analytiques d'une vidéo. - L'icône Commentaires permet d'accéder aux commentaires de votre vidéo. - L'icône Options permet d'afficher une liste d'actions que vous pouvez effectuer. Découvrir les nouveautés Consultez le tableau de bord de YouTube Studio pour découvrir les dernières actualités, dont : - les actualités des créateurs ; - les modifications apportées aux règles ; - les nouveautés de la chaîne YouTube Créateurs ; - les actualités de la chaîne Creator Insider. Obtenir de l'aide En haut de l'écran, sélectionnez Aide . Envoyer des commentaires - Connectez-vous à YouTube Studio. - Dans le menu de gauche, cliquez sur Envoyer des commentaires . - Saisissez votre commentaire, puis sélectionnez Envoyer. Remarque : Inscrivez-vous au programme YouTube Creators Research et aidez-nous à améliorer YouTube pour les créatrices et créateurs. En savoir plus"
}