{
  "url": "https://en.wiktionary.org/wiki/bayram",
  "title": "bayram - Wiktionary, the free dictionary",
  "text": "bayram English [edit]Noun [edit]bayram (plural bayrams) - In Turkic cultures, a nationally celebrated festival or holiday, whether secular or religious. - 2017, Douglas A. Howard, A History of the Ottoman Empire, page 126: - The two bayrams were occasions for family visiting and public celebrations. Azerbaijani [edit]Etymology [edit]From Proto-Common Turkic *badram, probably from Iranian (see the reconstruction page for more). Compare Karakhanid بَذْرَمْ (baḏram), Sogdian [script needed] (ptrʾm /patrăm/, “calm, peace”), Persian پدرام (pedrâm, “lucky, happy”). Pronunciation [edit]Noun [edit]bayram (definite accusative bayramı, plural bayramlar) - holiday - Bu gün bayram günüdür. ― Today is a holiday. - (figuratively) a very happy situation - feast, festival, fete Declension [edit]Crimean Tatar [edit]Etymology [edit]From Proto-Common Turkic *badram Noun [edit]bayram Declension [edit]References [edit]French [edit]Noun [edit]bayram m (plural bayrams) - alternative form of baïram Gagauz [edit]Etymology [edit]Inherited from Old Anatolian Turkish بَیْرَامْ (bayram), from Proto-Turkic *badram (“feast”).[1][2] Compare Azerbaijani bayram and Turkish bayram. Pronunciation [edit]Noun [edit]bayram (definite accusative bayramı, plural bayramnar) - (dialectal) holiday - Synonym: yortu - (religion, dialectal) feast, religious festival - Synonym: yortu - whirlpool Declension [edit]References [edit]- ^ András Rajki, A Concise Gagauz Dictionary with etymologies and Turkish, Azerbaijani, Crimean Tatar and Turkmen cognates, 2007 - ^ Nişanyan, Sevan (2002–), “bayram”, in Nişanyan Sözlük Further reading [edit]- N. A Baskakov, editor (1972), “байрам”, in Gagauzsko-Russko-Moldavskij Slovarʹ [Gagauz-Russian-Moldovan Dictionary], Moskva: Izdatelʹstvo Sovetskaja Enciklopedija, →ISBN, page 68 - Kopuşçu M. İ., Todorova S. A., Kiräkova T.İ., editors (2019), “bayram”, in Gagauzça-rusça sözlük: klaslar 5-12, Komrat: Gagauziya M.V. Maruneviç adına Bilim-Aaraştırma merkezi, →ISBN, page 28 Turkish [edit]Etymology [edit]From Ottoman Turkish بیرام (bayram), from Proto-Turkic *badram (“feast”). Nişanyan and Clauson suggests a borrowing from Iranian source,[1][2] despite Dīwān Lughāt al-Turk stating a Turkic etymology.[3] See the reconstruction page for more. Alternatively, related to Proto-Mongolic *bayar (“joy”), whence also Mongolian баяр (bajar). Cognate with Tatar бәйрәм (bäyräm), Kazakh мейрам (meiram), Kyrgyz майрам (mayram), Khakas пайрам (payram), Bashkir байрам (bayram), Azerbaijani bayram, etc. Pronunciation [edit]Noun [edit]bayram (definite accusative bayramı, plural bayramlar) - Eid, religious festival. - Religious festival of any variety. - A public holiday, religious or not, especially national holidays. - Ulusal Egemenlik ve Çocuk Bayramı ― National Sovereignty and Children's Day - Cumhuriyet Bayramı ― Republic Day - Zafer Bayramı ― Victory Day - (figuratively) A very happy situation. Declension [edit]Derived terms [edit]References [edit]- ^ Nişanyan, Sevan (2020-03-23), “bayram”, in Nişanyan Sözlük, retrieved 13 June 2020 - ^ Clauson, Gerard (1972), “bayram”, in An Etymological Dictionary of pre-thirteenth-century Turkish, Oxford: Clarendon Press, →ISBN, →OCLC, page 309 - ^ al-Kashgarî, Mahmud (1072–1074), Besim Atalay, transl., Divanü Lûgat-it-Türk Tercümesi [Translation of the “Compendium of the languages of the Turks”] (Türk Dil Kurumu Yayınları; 521) (in Turkish), 1985 edition, volume III, Ankara: Türk Tarih Kurmu Basımevi, published 1939–1943, page 176 Uzbek [edit]Noun [edit]bayram (plural bayramlar) Declension [edit]- English lemmas - English nouns - English countable nouns - English terms with quotations - Azerbaijani terms inherited from Proto-Common Turkic - Azerbaijani terms derived from Proto-Common Turkic - Azerbaijani terms derived from Iranian languages - Azerbaijani terms with IPA pronunciation - Azerbaijani terms with audio pronunciation - Azerbaijani lemmas - Azerbaijani nouns - Azerbaijani terms with usage examples - Crimean Tatar terms inherited from Proto-Common Turkic - Crimean Tatar terms derived from Proto-Common Turkic - Crimean Tatar lemmas - Crimean Tatar nouns - French lemmas - French nouns - French countable nouns - French masculine nouns - Gagauz terms inherited from Old Anatolian Turkish - Gagauz terms derived from Old Anatolian Turkish - Gagauz terms inherited from Proto-Turkic - Gagauz terms derived from Proto-Turkic - Gagauz terms with IPA pronunciation - Gagauz lemmas - Gagauz nouns - Gagauz dialectal terms - gag:Religion - Turkish terms inherited from Ottoman Turkish - Turkish terms derived from Ottoman Turkish - Turkish terms inherited from Proto-Turkic - Turkish terms derived from Proto-Turkic - Turkish terms derived from Iranian languages - Turkish terms with IPA pronunciation - Turkish terms with audio pronunciation - Turkish lemmas - Turkish nouns - Turkish terms with usage examples - tr:Holidays - tr:Islam - Uzbek lemmas - Uzbek nouns"
}