{
  "url": "https://ge.globo.com/sp/santos-e-regiao/futebol/brasileirao-serie-a/noticia/2026/02/04/santos-x-sao-paulo-onde-assistir-ao-vivo-horario-e-escalacoes.ghtml",
  "title": "Santos x São Paulo: onde assistir ao vivo e escalações | Ge",
  "text": "Santos e São Paulo se enfrentam nesta quarta-feira, às 20h (de Brasília), na Vila Belmiro, em partida válida pela segunda rodada do Campeonato Brasileiro. O duelo terá transmissão do Premiere, e o ge acompanha todos os lances em tempo real (clique aqui). O Santos vive um momento de crise no início da temporada. São seis jogos sem vitória, com o clube próximo da zona de rebaixamento no Campeonato Paulista, além de ter sido derrotado pela Chapecoense, de virada, na estreia do Brasileirão. A torcida tem criticado o trabalho do técnico Juan Pablo Vojvoda e o elenco, mas o alvo principal dos santistas tem sido a diretoria, nas figuras do presidente Marcelo Teixeira e do executivo de futebol Alexandre Mattos. O São Paulo vive seu melhor momento em 2026. O Tricolor vem de duas vitórias seguidas, uma justamente contra o Santos e outra diante do Flamengo. No Campeonato Paulista, deixou a briga contra o rebaixamento para mirar uma vaga no mata-mata. A estreia com vitória no Brasileirão, diante do Rubro-Negro, foi o suficiente para melhorar o ambiente no Tricolor. Onde assistir - Transmissão: Premiere. - Tempo real: o ge acompanha todos os lances (clique aqui). Vila Belmiro vai receber o clássico San-São — Foto: José Edgar de Matos Escalações prováveis Santos - técnico: Juan Pablo Vojvoda Não será no clássico que a comissão técnica contará com o retorno de Neymar. Embora tenha trabalhado normalmente com os companheiros, o camisa 10 ficou fora dos relacionados. A expectativa é que o camisa 10 atue no fim de semana diante do Noroeste, em jogo importante pelo Paulistão. Quem pode voltar à lista de relacionados é Tiquinho Soares, outro a participar das atividades sem limitações nos últimos dias. Provável escalação: Gabriel Brazão; Igor Vinicius, Adonis Frías, Luan Peres e Vinicius Lira; João Schmidt, Zé Rafael e Gabriel Menino; Barreal, Gabigol e Rony. João Schmidt Zé Rafael Gabriel Luan Peres Rony Igor Vinícius Gabriel Brazão Gabriel Menino Adonis Frías Barreal Vini Lira - Quem está fora: Neymar (fase final de recuperação), Gustavo Henrique (lesão muscular no músculo adutor da coxa direita), Thaciano (transição para o gramado) e Willian Arão (cirurgia para retirada de cálculo renal). São Paulo - técnico: Hernán Crespo O Tricolor usou força máxima nas duas últimas partidas que disputou, contra Santos e Flamengo, e não deve fazer grandes mudanças no time titular nesta quarta-feira. A tendência é que a comissão técnica faça qualquer alteração na formação somente em caso de desgaste ou risco de lesão. Provável escalação: Rafael, Alan Franco (Dória), Arboleda e Sabino; Maik (Cédric), Danielzinho, Bobadilla, Marcos Antônio (Pablo Maia) e Enzo Diaz; Luciano e Calleri. Rafael Luciano Danielzinho Calleri Arboleda Alan Franco Sabino Enzo Díaz Marcos Antônio Bobadilla Maik - Quem está fora: Ryan Francisco e André Silva, lesionados. Arbitragem - Árbitro: Anderson Daronco (RS) - Árbitro Assistente 1: Rafael da Silva Alves (RS) - Árbitro Assistente 2: Tiago Augusto Kappes Diel (RS) - Quarto árbitro: Murilo Tarrega Victor (SP) - VAR: Rodrigo Nunes de Sá (RJ) Anderson Daronco — Foto: Alexandre Durão"
}