{
  "url": "https://truecrimenews.com/2023/02/24/georgia-supreme-court-upholds-marina-middlebrooks-conviction-life-prison/",
  "title": "Court upholds conviction of woman who killed daughter with scissors so she could 'get to heaven'",
  "text": "Court upholds conviction of woman who killed daughter with scissors so she could 'get to heaven' 02/24/2023 1:37 pm PST ATLANTA (TCD) -- The Georgia Supreme Court upheld the 2016 conviction of a woman who was found guilty of killing her 2-year-old daughter with a pair of scissors and trying to kill herself so they could both \"get to heaven.\" The state’s high court released the opinion Tuesday, Feb. 21, and agreed with the trial court’s decision that Marina Middlebrooks was guilty in connection with the death of her daughter, Sky Allen. Middlebrooks pleaded not guilty by reason of insanity to the charges against her, but in February 2016, she was convicted of murder and cruelty to children. The same month, she was sentenced to life in prison without parole for the murder charge and 20 years for cruelty to children. Middlebrooks motioned for a new trial in 2020, but a judge denied that motion in 2021. Her appeals made their way to the Georgia Supreme Court, which affirmed unanimously that she will spend the rest of her life in prison. According to the Georgia Supreme Court’s opinion, on May 2, 2013, Middlebrooks was driving on Ray Owens Road in Columbia County when she swerved and crashed into a tree. A witness saw the accident and called 911. Medics arrived and noted Middlebrooks was \"nude except for a sweatshirt and covered in blood.\" She reportedly said she did not know what happened to her. While speaking with her, officials discovered Sky naked under a pile of clothes on the floor of the car. The little girl was \"covered in dried blood, and had a gaping stab wound to her neck.\" Investigators found a pair of bloody scissors in the front seat of the car. The opinion says the medical examiner \"determined that Sky had suffered multiple stab wounds, one of which severed a jugular vein, resulting in fatal blood loss,\" and the wounds were made with an open pair of scissors. Middlebrooks also suffered wounds to her face, neck, chest, arms, wrist, and knee. Middlebrooks told one of the forensic psychologists who evaluated her that she got herself and Sky naked in order to kill themselves because \"clothes, including any jewelry, would block the spirits from leaving.\" This needed to happen in order to \"get to heaven.\" The psychologist noted Middlebrooks suffered from schizophrenia and \"did not have the mental capacity to know right from wrong.\" A different psychiatrist who evaluated Middlebrooks also found she had schizophrenia. Middlebrooks told her Sky \"had to kill herself,\" and she \"took the scissors and had her daughter stab herself, helping her with the scissors.\" Middlebrooks' cellmate, however, testified Middlebrooks told her she killed Sky \"out of spite of her boyfriend.\" A third doctor who evaluated Middlebrooks argued Middlebrooks' \"description of the events 'changed dramatically'\" over time. That forensic psychologist determined Middlebrooks was \"feigning having had symptoms at the time of Sky’s death in order to avoid criminal responsibility for the death of her daughter.\" MORE: TRUE CRIME DAILY: THE PODCAST covers high-profile and under-the-radar cases every week. Subscribe to our YouTube page for podcasts, exclusive videos, and more, and don’t forget to follow us on TikTok."
}