{
  "url": "https://unitedwayatlanta.org/program/vita/",
  "title": "Free Tax Prep Services | United Way Of Greater Atlanta",
  "text": "Free Tax Prep Services Last year, we helped taxpayers get $13.9 million in tax refunds and save $4.1 million in tax prep fees. United Way of Greater Atlanta provides free tax preparation services to the community through the Volunteer Income Tax Assistance (VITA) program, in partnership with the Internal Revenue Service (IRS) and coalition partners in the community. VITA is available to individuals with incomes up to $69,000 and MyFreeTaxes is available to individuals with incomes up to $89,000 . Sign up to receive email updates on our VITA services. How to Access VITA Services Find a VITA location United Way of Greater Atlanta’s VITA program provides free tax preparation services across 13 counties. VITA sites are open during the day and evening for in-person, drop-off, and virtual tax preparation, making it easier than ever to get your taxes done. What documents do I need to bring? - Valid photo ID for taxpayer(s). - A Social Security card for EACH family member. Original card preferred; copies may be accepted (at discretion of tax preparer). - Taxpayer(s) MUST have all their W-2’s. Pay stubs are not accepted. - Form 1095-A: if the taxpayer received the Premium Tax Credit to help pay health insurance Child care provider letter – See template, last page - Banking account routing information, if using direct deposit (a voided check or bank statement with routing number printed on it. - A copy of last year’s tax return, if available. - Any document or information about money received from the IRS (Internal Revenue Service), including the advanced Child Tax Credit. - All 1099 forms for other income, if any. Any other tax related documents. NOTE: Every adult listed on the tax form must sign the return. 100% Virtual United Way of Greater Atlanta has teamed up with GetYourRefund to help you access VITA services virtually from the comfort of your home. DIY Online - MyFreeTaxes.com Volunteer When you volunteer to become a certified tax preparer with VITA, you’re doing more than securing refunds — you’re uplifting your community! Click the button below to learn more about volunteering with VITA and available volunteer opportunities."
}