{
  "url": "https://www.dictionary.com/browse/near",
  "title": "NEAR Definition & Meaning | Dictionary.com",
  "text": "near Americanadverb - close; to a point or place not far away. Come near so I won't have to shout. - Antonyms: - far - at, within, or to a short distance. - Antonyms: - far - close in time. The New Year draws near. - close in relation; closely with respect to connection, similarity, intimacy, etc. (often used in combination). a near-standing position. - all but; almost; nearly. a period of near 30 years. - Nautical. close to the wind. - Archaic. in a thrifty or stingy manner. adjective - being close by; not distant. the near fields. - Antonyms: - far - being the lesser in distance. the near side. - Antonyms: - far - short or direct. the near road. - Antonyms: - far - close in time. the near future. - Antonyms: - far - closely related or connected. our nearest relatives. - close to an original. a near translation. - closely affecting one's interests or feelings. a matter of near consequence to one. - intimate or familiar. a near friend. - narrow or close. a near escape. - thrifty or stingy. near with one's pocketbook. - Antonyms: - generous - (of two draft animals hitched together) being on the driver's left (as opposed tooff ). The near horse is going lame. - Antonyms: - far preposition - at, to, or within a short distance, or no great distance, from or of. regions near the equator. - close to in time. near the beginning of the year. - close to a condition or state. He is near death. verb (used with or without object) idioms preposition adverb - at or to a place or time not far away; close by - not far from; near - short for nearly I was damn near killed adjective - at or in a place not far away - (postpositive) not far away in time; imminent departure time was near - (prenominal) only just successful or only just failing a near escape - informal (postpositive) miserly, mean - (prenominal) closely connected or intimate a near relation verb noun combining form Other Word Forms - nearness noun - overnear adjective - overnearness noun Etymology Origin of near First recorded before 900; Middle English nere, Old English nēar, comparative of nēah nigh Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. As for Tuesday's fatal incident, near Chios, much of the Greek media has been amplifying the story that the migrant speedboat was manoeuvring dangerously and would not stop. From BBC Adams found the dresser on the side of the road near her apartment. From Los Angeles Times But she can often struggle to bridge the gap between her longer-term projections, including a forecast for “tens of billions” in annual AI revenue over the next few years, and the very near term. From Barron's \"Based on what we know so far, the ice sheet is not likely to collapse in the near future, but we can see that the ice there is already thinning,\" says Struve. From Science Daily —Silver prices gained further after the previous session’s rally following a historic selloff, with New York futures hovering near $90 a troy ounce. Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}