{
  "url": "https://blog.collinsdictionary.com/language-learners/learning-spanish/spanish-words-of-the-week-fruta-or-fruto/",
  "title": "Spanish words of the week: fruta or fruto? - Collins Dictionary Language Blog",
  "text": "This week it’s time to get the juice on the meaning differences between two more Spanish nouns that are identical in form apart from their last letter and their gender: fruta and fruto. You can listen to the pronunciation of fruta (feminine) here: Una fruta is a fruit – the often sweet, juicy sort you eat: Le llevaba las frutas azucaradas que tanto le gustaban. He would take her the crystallized fruits she liked so much. Había un olor de frutas podridas. There was a smell of rotten fruit. En el carro de postres hay estupendas tartas de frutas del tiempo. On the dessert trolley are fantastic tarts made with fruits of the season. La fruta is also a collective term for edible fruit: Hay que comer mucha fruta. You should eat a lot of fruit. Now let’s move on to fruto (masculine), whose pronunciation you can listen to here: Fruto (masculine) also means fruit, but it’s used in technical, botanical language to refer to the seed-bearing structure on a plant that emerges from a flower. It may or may not be edible. El fruto es del tamaño de un garbanzo y tiene forma redondeada. The fruit is the size of a chickpea and is round in shape. Fruto (masculine) is also used figuratively to refer to the fruit or product of something such as someone’s efforts or labour: Ahora empieza a recoger los frutos de su esfuerzo. She’s now beginning to reap the fruits of her efforts. Este esfuerzo dio sus frutos treinta años más tarde. This effort bore fruit thirty years later. Lo que hoy sucede no es fruto del azar. What’s happening today is not the product of chance. Don’t forget to make any articles and adjectives agree with the noun they modify: las frutas congeladas frozen fruits aquellos frutos delicados those delicate fruits DID YOU KNOW? Where in English we use nut as a general term for any dry fruit with a hard outer shell, in Spanish fruto seco (masculine, and literally dry fruit) is used for this: avellanas, cacahuetes, almendras y otros frutos secos hazelnuts, peanuts, almonds and other nuts and dried fruit To peel the layers off another pair of nouns whose meanings vary depending on their gender and ending, come back next week."
}