{
  "url": "https://westseattleblog.com/",
  "title": "West Seattle Blog…",
  "text": "West Seattle, Washington 04 Wednesday Thanks for the tips! Multiple reports of orcas passing west-facing West Seattle. Kersti Muul sys they’re northbound off Beach Drive. Since Seattle City Light told us Monday that work would start at the Morgan Junction EV-charging lot site this week, we’ve been checking there daily to see whether that would indeed happen. No signs of activity Tuesday – but we just went by again today and spotted the new NO TRESPASSING sign above, as well as tubes labeled as project-document storage: (The labels read Traffic Control Plan, Permits, Construction Stormwater and Erosion Control Plan, Construction Drainage Plans, and Electrical Permit.) No work crew at the site currently but we’ll go back to check tomorrow. SCL says it’s expecting the eight-charger site at 4118 SW Morgan – originally planned for 2022 – to be operational this August. Going over the SPD data map late last night, we noticed burglaries at two West Seattle businesses early Tuesday and an attempt at a third. After confirming via radio recordings, we requested and obtained police-report narratives this morning. The first two were reported within blocks and minutes of each other in the 5 am hour: LULA COFFEE (4451 California SW): A business manager or owner got “an alarm alert” and went to the shop. The report says: When she arrived to the business, she observed the front door lock was punched out and the register was rifled through. An electronic tablet was taken from the register area. A small side window was also forced open where the suspect probably tried to gain initial entry. XXXX had surveillance footage of the incident as well. The video shows one suspect enter the front door, quickly walk to the register, rifle through the register, and exit the back door. The suspect had a large coat on with the hood up and a face covering. He did not have gloves on. He appeared to be a white male. Investigators were able to lift some prints. If you have any information, this case # is 26-032404. WALTER’S/UPWELL (4811 California SW): An owner/manager called police after seeing this via live video. The police narrative says: Officers arrived quickly but the suspects had already fled. A building search verified that no one was inside the business unlawfully. The suspect had used an unknown tool or tools to remove the lock cylinder from the front door. (Owners) showed me security video. The video shows two suspects arrive in a white, mid-size SUV at about 0516 hrs. Suspect 1 was was a white male in a black puffy jacket. He spends about 10 minutes removing the lock before the second suspect entered the business through the unlocked door. The second suspect was also a white male wearing a light-colored hoody. The report adds that the burglar who went inside “was in the store for only a minute or two” and stole various items. If you have any information on this one, the case # is 26-032408. BENBOW ROOM (4210 SW Admiral Way): This report came in later in the morning after the establishment reported “that the doors had signs of forced entry and there was a clicking/and banging noise coming from inside.” The report narrative said police “arrived and contacted the owner (who) stated that it was actually only an attempted break-in that happened sometime overnight and that the noise was from a pinball machine that was having malfunctions. (They) showed me the front door and two side doors on the west side of the business. All of which had fresh pry marks on the latch side of the door and jamb.” Case # for this is 26-032444. NOTE: In addition to these three incidents, we’ve reported on two other West Seattle business burglaries in the past week – both in the Alki/Harbor area – at El Chupacabra and at Unwind Café. … We should also note that the next quarterly community meeting at the precinct about crime/safety is coming up at 6:30 pm Tuesday, February 17 (2300 SW Webdter). (Tuesday morning on Elliott Bay – photographed by Mike Burns) Lots of possibilities for your Wednesday, mostly from the WSB West Seattle Event Calendar, have numerous highlights: WALKING FOR WELL-BEING: 10 am Wednesday walks leave from 47th/Fontanelle (so if you didn’t see this in the calendar in time, here’s a reminder for next week). TODDLER READING TIME AT PAPER BOAT: 10:30 am at the bookstore. (4522 California SW; WSB sponsor) PLAY AMERICAN MAH JONGG: 2-4 pm, play at the new location of Missing Piece (4707 California SW). VR FOR TEENS’ MENTAL HEALTH: Try it out at 2:30 pm, Southwest Library (9010 35th SW). ART WORKSHOP: Drop-in art for kids withRec ‘N The Streets at Delridge Library (5423 Delridge Way SW), 3-4:30 pm. HOLY ROSARY FUNDRAISER AT LADY JAYE: “Eighth grade students from Holy Rosary are raising money to go to Washington DC after graduation this June. There will be a fundraiser tonight, Wednesday, February 4th, at Lady Jaye from 4 pm until close. It’s Whiskey Wednesday featuring Old Fitzgerald 7yr wheated bourbon for $8 all evening. Please make sure to mention Holy Rosary School to your server!” (4523 California SW) DROP-IN HOMEWORK HELP: 4-7:30 pm at High Point Library (3411 SW Raymond), free drop-in help for students. ROCK BAND GAMING AT MR. B’S MEAD CENTER: 5-10 pm, weekly event in South Delridge! (9444 Delridge Way SW) 16TH SW PARKING MEETING: As previewed here, a community discussion with city reps about possible parking restrictions on 16th SW is being hosted by South Seattle College (6000 16th SW; WSB sponsor), 5:30 pm in Cascade Hall. FIX-IT WORKSHOP: Repair your broken item instead of throwing it out! Weekly event, free (donations appreciated), 5:30-7:30 pm at West Seattle Tool Library (4408 Delridge Way SW, northeast side of Youngstown Cultural Arts Center). PIANO NIGHT: 6 pm, monthly piano night at Upwell Wine & Coffee (4811 California SW). ‘LET’S TALK ABOUT THE S–T WE’RE PRETENDING IS FINE’: That’s the topic as a new women’s group called The Commwell convenes, 6 pm. (5446 California SW) POTTERINGS OPEN STUDIO: 6-8 pm, drop in and create at this cozy pottery studio. (3400 Harbor SW) CLASSIC SF BOOK CLUB: This month’s book is “On the Beach“ by Nevil Shute. Come to Paper Boat Booksellers (4522 California SW; WSB sponsor) to talk about it, 6 pm. WEST SEATTLE URBANISM: You’re invited to this 6 pm meetup at Great American Diner/Bar (4752 California SW). CRIBBAGE NIGHT AT THE EAGLES: Wednesdays at 6 pm are cribbage-tournament nights, all welcome, membership not required. (4426 California SW) KUNDALINI YOGA – NEW TIME: Now at 6 pm at Inner Alchemy Studio/Sanctuary (3618 SW Alaska). $35. WEDNESDAY NIGHT RUN: Get moving at midweek on the weekly 6:15 pm group run with West Seattle Runner (2743 California SW; WSB sponsor) tonight – all welcome, regardless of what pace you run at! LIVE MUSIC AT THE LOCOL: 6:30 pm. 21+. Rotating performer lineup. (7902 35th SW) ALKI COMMUNITY CHOIR OPEN REHEARSALS: “From seasoned vocalists to shower divas,” everyone’s welcome to sing with this choir at Alki UCC (6115 SW Hinds), 7 pm. MUSIC BINGO: Weekly music bingo at at The Good Society (California/Lander), 7 pm. TRIVIA x 5: Five West Seattle trivia venues on our Wednesday list: at Future Primitive Beach Bar (2536 Alki SW), 7 pm, free to play … 7 pm at Admiral Pub (2306 California SW), free to play … Larry’s Tavern (3405 California SW) has Wednesday trivia at 7:30 pm … Quiz Night starts at 8 pm at Beveridge Place Pub (6413 California SW) … and at 8:30 pm, it’s trivia with Phil T at Talarico’s (4718 California SW), all ages until 10 pm. SKYLARK OPEN MIC: West Seattle’s longest-running open mic! 7:30 pm signups for the weekly event at The Skylark. (3803 Delridge Way SW) KARAOKE AT ADMIRAL PUB: Sing at the pub starting at 8:45 pm, after trivia. (2306 California SW) Planning something that’s open to community participation/observation? Please send us info so we can add it to West Seattle’s only comprehensive event calendar! westseattleblog@gmail.com – thank you! Got a parent or grandparent who’s thinking about moving? Or maybe you are? Village Green West Seattle (2615 SW Barton; WSB sponsor) offers the chance to “Love Where You Live” and will show you why at an open house this Saturday (February 7). Visit between 11 am and 1 pm and explore the grounds on a guided tour, while learning about move-in incentives. Got questions? Get answers! Village Green lifestyle options include both independent living and senior living 6:02 AM: Good morning! Welcome to Wednesday, February 4, 2026. On this day in local traffic history, the Highway 99 tunnel fully opened (2019). WEATHER + SUNRISE/SUNSET Today’s forecast is for clouds, then sun, after patchy morning fog, high around 60. Sunrise at 7:31 am; sunset at 5:15 pm. TRANSIT TODAY West Seattle Water Taxi – Regular West Seattle service, fall/winter schedule. Washington State Ferries – Regular three-boat weekday service on the Fauntleroy-Vashon-Southworth route; check WSF’s alerts for last-minute changes. Metro buses – Regular weekday schedule and routes today. SPOTLIGHT TRAFFIC CAMERAS High Bridge – Here’s the main camera, followed by the Fauntleroy-end camera: Low Bridge – Here’s the westward view. Also note, maritime-opening info is available via X (ex-Twitter): 1st Avenue South Bridge: Delridge cameras: In addition to the one below (Delridge/Genesee), cameras are also at Delridge/Juneau, Delridge/Henderson, Delridge/Oregon, and video-only (so you have to go to the map), Delridge/Holden and Delridge/Thistle. MORE TRAFFIC CAMS: All functioning traffic cams citywide are here (including links to live video for most); for a quick scan of West Seattle and vicinity-relevant cameras, see this WSB page. See a problem on the bridges/streets/paths/water? Please text or call our hotline (when you can do it safely, and after you’ve reported to authorities if they’re not already on scene) – 206-293-6302. Thank you! By Macey Wurm Reporting for West Seattle Blog Today marks one week left to vote for one member of the King Conservation District Board of Supervisors, whose elections often get overlooked since they’ve been separate from other voting cycles and ballots. You’re voting to choose one of three candidates – two of whom are West Seattleites – to serve on the five-member board responsible for overseeing KCD operations, budget, and setting policy. First, here’s what the King Conservation District is: A special-purpose district under the Washington State Conservation Commission, focused on promoting “the sustainable use of natural resources,” according to its website. The KCD collaborates with private residents, cities, and organizations to provide technical assistance in resource management. It is primarily funded by a per-parcel fee and does not receive money from the state’s General Fund. (Here’s a simple breakdown of some of what the KCD does.) KCD elections – which choose three of the five supervisors – are subject to historically lower voter turnouts because they are not a part of regular King County ballot. When the Conservation Districts were created in 1939, the Washington State Conservation Commission was made responsible for establishing electoral procedures (RCW 89.08), that do not fall under the state statute for general elections (RCW 29A). That could change soon – HB 2499, primarily sponsored by State House Rep. Mia Gregerson, is currently in committee. The bill would effectively permit conservation districts to choose to hold their elections under RCW 29A, alongside other federal-, state-, and local-office elections, potentially bringing in more votes. As of today at 12 PM, 5,467 ballots have been returned out of a total 488,692 eligible voters in the district, approximately 1%. The current election pertains to District No. 3 of the KCD, developed after the Board of Supervisors voted to expand its three elected seats into three separate board districts based on location. District No. 3 represents western King County, including Seattle, Vashon/Maury Islands, and parts of Renton and Tukwila. All eligible voters and candidates must reside within District 3. Three candidates are running to fill the board seat; from their candidate statements, which you can read in full here: Erica Chung Chung earned her bachelor’s degree in Economics and International Studies at University of California Los Angeles, with a master’s degree in Public Administration at Evergreen State. She currently works as a strategic adviser in the Commission Office for the Port of Seattle, a position she has held for five years. She has worked on the Wolf Creek Ravine revitalization project and developed an urban forest stewardship plan. Through which she also collaborated with the City of Seattle and the KCD. Through the board position, she aims to enhance its visibility in the community, amplify its work with local elected officials, and build strong public-private partnerships. Csenka Favorini-Csorba Favorini-Csorba, a West Seattle resident, is running for reelection, and was chosen as Vice Chair of the board in 2025. She earned her master’s degree in Environmental Sciences, Policy, and Management. During her term, she led a resolution for the Washington Association of Conservation Districts to provide tribal-relations training, has put in continued work to get the KCD election on the general ballot, and has been an advocate prioritizing funds to local environmental-justice organizations. Chris Porter Porter, also a West Seattle resident, earned his bachelor’s degree in nursing at San Diego State University, and a master’s on the family nurse practitioner track at Western University. He served on the KCD board once before, from 2020-2023. During his time, he helped to reshape the district’s structure, elections, finances, funding, and relationship with King County. He has a personal passion for conservation, transforming his yard into a wildlife habitat and using a bicycle as his primary mode of transportation. He aims to create a strong sense of community and prioritize conservation efforts. HOW TO VOTE: Voting began on January 20, 2026 and will end on February 10, 2026 at 8:00 pm. The election relies primarily on electronic ballot access, though physical ballots are also available if you request one ASAP; they must be postarked by February 10 and received by February 19. You can vote online through the KCD webpage. As reported here on Monday, the former Walgreens in South Delridge has a new owner. Subsequently visiting the site (15th/16th/Roxbury), we noted the signage announcing that it’s up for lease. But new owner James Tjoa has more immediate plans to activate the site, we learned from a spokesperson who returned our call today because Tjoa is traveling. He’s hoping to use its lot as a food-truck site, with one truck scheduled to set up there within a few days, El Gran Taco, and “we’re talking to others,” hoping ultimately for “three or four” to set up there. The spokesperson says Tjoa already owns property in the area – the site of the White Center Dollar Tree store a few blocks south on 15th – and “loves” the area, considering the ex-Walgreens site “a great corner.” Though Tjoa is a developer as well as broker and real-estate investor, redevelopment is not expected on this site – zoned for mixed use up to four stories – any time soon; the building is in good shape, they explain, only about 20 years old, so “tearing it down wouldn’t make sense” – at least for another 10 years or so. This scene caught our photographer’s eye while passing through The Junction on an errand this afternoon. Not entirely unexpected to see people with fishing gear in the vicinity of Emerald Water Anglers, but casting over the sidewalk? Turns out they were shooting a promo for the Fly Fishing Film Tour stop at The Admiral Theater (2343 California SW) this Friday night (February 6), 7 pm. Just a few tickets left, we’re told (available here). Will the city change parking rules in what’s arguably West Seattle’s most popular current place for RV parking, along 16th Avenue SW by South Seattle College (WSB sponsor)? We’re reminding you today that as announced last week, SSC will host a community conversation tomorrow night (February 4), 5:30 pm at Cascade Hall (CAH on the map for the campus at 6000 16th SW). Parking signage has been used to deter RV parking in areas such as Harbor Avenue and SW Trenton; on SW Andover, a bicycle lane was installed. City reps announced as participating in the meeting will be from SDOT and the Unified Care Team (which deals with encampments). We’ve gotten a lot of questions about this incident around 7 am, with erroneous information circulating on social media, so for those who’ve asked, we wanted to let you know that the pedestrian hit by a driver at 35th/Thistle is recovering. We’ve also heard from one of the first people on the scene, Jesse: This morning, while I was waiting at a bus stop on 35th just north of Thistle for the northbound 21 a pedestrian was struck by a car while crossing 35th at approx. 7 a.m. This happened at the northwest corner of 35th ave SW and SW Thistle st.. The driver stopped, I called 911, several of us waiting at the bus stop attended to the pedestrian, who was awake and alert. Paramedics and SPD showed up a few minutes later to help the pedestrian and question witnesses and the driver. … I wanted to let you know in case it’s worth posting on WSB and mostly to build awareness for pedestrians and cars to be careful during the morning commute. It’s still dark at 7 am and unfortunately it’s too easy for drivers to not see pedestrians, even when they’re in a crosswalk. A few of the people we heard from were worried the pedestrian had died because they saw the victim under “a tarp.” That’s an emergency blanket used at incident scenes. SFD tells us the pedestrian is a woman in her early 40s, in stable condition when transported to the hospital by AMR ambulance. 12:35 PM: Police have just told dispatch that they’re closing the entire 16th/Roxbury intersection because of a two-car crash, so avoid that area for a while. We’re headed over to check, as the area traffic camera does not show the closure. 12:48 PM: Adding photos. Our crew confirms the crash is actually at 17th/Roxbury, which is blocked, but they’re working to get it at least partly reopened. No major injuries reported. That’s what SDOT crews had to fix when they closed the Fauntleroy end of the eastbound West Seattle Bridge for more than two hours Sunday night. We reported on it in real time and promised to follow up to find out why the barrier fix – usually a relatively quick job – took so long, and SDOT spokesperson Ethan Bergerson sent this explanation with photos, today: SDOT was notified by SPD at approximately 6:45 p.m. on Sunday, February 1 that a vehicle had hit the center concrete barrier on the Fauntleroy Way SW approach to the West Seattle Bridge. This collision moved the center concrete divider out of place. An SDOT Response Team (SRT) vehicle attempted to push the barriers back into place, but two of the four concrete barrier sections became stuck and were unmovable. It was necessary to bring in heavy equipment from the SDOT maintenance yard, which finished pushing the barriers back into place at approximately 10:30 pm. All eastbound lanes of Fauntleroy Way SW were closed for most of this time, with a short period when one lane was briefly reopened and then closed again. The only crash on the SFD log for that time frame was 7 pm, listed as Fauntleroy/Avalon; one of the challenges for keeping stats on that end of the bridge – yes, it was by “the curve” – seems to be the various location descriptions. (Moonset over the fog this morning – photo by James Bratsanos) Here are today’s daily event notes/reminders, mostly from the WSB West Seattle Event Calendar: KALEIDOSCOPE PLAY & LEARN: A 10-11:30 am free playgroup for kids 0-5 and their caregivers, at Bridge School Cooperative Elementary (10300 28th SW). POSTCARDS4DEMOCRACY: New postcard-writers as well as returnees are welcome at this weekly advocacy gathering, 10:30 am-noon at C & P Coffee (5612 California SW; WSB sponsor). Sign up here before you go, if this is your first time. ROTARY CLUB OF WEST SEATTLE: Noon Tuesdays, lunch meetings at West Seattle Golf Course, today featuring the Student of the Month celebration (4470 35th SW). CHESS CLUB: All levels welcome to play! 1:30-3 pm, at the Center for Active Living (4217 SW Oregon). Questions? Email conwell@conwelld.net. CITY COUNCIL: At 2 pm, the council holds its main weekly meeting. The agenda explains how to comment and/or watch. DROP-IN HOMEWORK HELP: At High Point Library (3411 SW Raymond) – volunteers available to help K-12 students, 4-5:45 pm. DINE-OUT FUNDRAISER: Dine in or take out – get food from Mioposto in Admiral tonight and part of the proceeds benefit Alki Co-op Preschool! DROP-IN WINE TASTING: 5-8 pm Tuesdays at Walter’s Wine Shop (4811 California SW) – $15 fee, $5 off with bottle purchases. DEMONSTRATION FOR BLACK LIVES: Long-running weekly sign-waving demonstration on the corners at 16th/Holden. 5-6 pm. Signs available if you don’t bring your own. TAE KWON DO: First class of the month at High Point Community Center (6920 34th SW) is at 6 pm tonight. HOKA DEMOS & TRACK RUN WITH WEST SEATTLE RUNNER: Meet up by 6:15 pm at West Seattle Runner (2743 California SW; WSB sponsor) for WSR’s free weekly track run with the opportunity to demo HOKA shoes this week! All paces welcome, walkers included. OPEN CHOIR REHEARSALS: 6:30 pm Tuesdays at Tibbetts United Methodist Church (3940 41st SW), come sing with the Boeing Employees Choir, even if you don’t work for Boeing – email in advance to RSVP. SCOTTISH COUNTRY DANCING: Weekly lessons continue, 7 pm at Fauntleroy Church (9140 California SW), details in our calendar listing. LISTENING PARTY AT EASY STREET RECORDS: 7 pm, hear the new Joji LP. (4559 California SW) WOMEN’S MEDITATION CIRCLE: Weekly small-group meditation at Mama Be Well Healing Studio (4034-A California SW), 7 pm. Our calendar listing has info on registering before you go. BINGO: Play free Tuesday night Belle of the Balls Bingo at The Skylark, 7 pm. (3803 Delridge Way SW) TRIVIA X 5: Five locations for trivia on Tuesdays – The Beer Junction (4711 California SW), Sporcle Pub Quiz with David at 7 pm and 8 pm … 7 pm at Ounces (3803 Delridge Way SW), free and hosted by Beat the Geek Trivia; 7 pm at Zeeks Pizza West Seattle (6459 California SW), hosted by Geeks Who Drink; 7 pm at Admiral Pub, free, prizes. (2306 California SW) … Trivia at Christos on Alki (2508 Alki SW), 7:15 pm. If you are organizing an event, class, performance, gathering, etc., tell your West Seattle neighbors via our event calendar – just email info to westseattleblog@gmail.com – thank you! Lillie asked us to share this with you: I am a gymnast at West Seattle High School. We are currently fundraising for new Balance Beam mats, uniforms, and coaching stipends. Here is the Link for our fundraising. If we could get your help I truly believe that we will reach our goal. Any amount of money is really appreciated. GO WILDCATS! 6:01 AM: Good morning! Welcome to Tuesday, February 3, 2026. WEATHER + SUNRISE/SUNSET Today’s forecast is for clouds after patchy morning fog, high in the upper 50s. Sunrise at 7:32 am; sunset at 5:14 pm. (Monday’s sunset – photo by Bob Burns) TRANSIT TODAY West Seattle Water Taxi – Regular West Seattle service, fall/winter schedule. Washington State Ferries – Regular three-boat weekday service on the Fauntleroy-Vashon-Southworth route; check WSF’s alerts for last-minute changes. Metro buses – Regular weekday schedule and routes today. SPOTLIGHT TRAFFIC CAMERAS High Bridge – Here’s the main camera, followed by the Fauntleroy-end camera: Low Bridge – Here’s the westward view. Also note, maritime-opening info is available via X (ex-Twitter): 1st Avenue South Bridge: Delridge cameras: In addition to the one below (Delridge/Genesee), cameras are also at Delridge/Juneau, Delridge/Henderson, Delridge/Oregon, and video-only (so you have to go to the map), Delridge/Holden and Delridge/Thistle. MORE TRAFFIC CAMS: All functioning traffic cams citywide are here (including links to live video for most); for a quick scan of West Seattle and vicinity-relevant cameras, see this WSB page. See a problem on the bridges/streets/paths/water? Please text or call our hotline (when you can do it safely, and after you’ve reported to authorities if they’re not already on scene) – 206-293-6302. Thank you! West Seattle Junction playhouse ArtsWest opens its next production this week: Pulitzer Prize-winning play “Topdog/Underdog” by Suzan-Lori Parks, directed by Valerie Curtis-Newton. The cast features Yusef Seevers as Booth and ML Roberts as Lincoln. After a sold-out Wednesday night discount preview, the official run is Thursdays through Sundays, February 5-March 1. (Opening night is sold out too!) Here’s how ArtsWest describes its new production: Winner of the 2002 Pulitzer Prize in Drama, “Topdog/Underdog” is a darkly comic fable of brotherly love and family identity and is Suzan-Lori Parks’ groundbreaking riff on the way we are defined by history. The play tells the story of Lincoln and Booth, two brothers whose names were given to them as a joke, foretelling a lifetime of sibling rivalry and resentment. Haunted by the past, the brothers are forced to confront the shattering reality of their future. ArtsWest and The Hansberry Project have been co-producers since 2014. Founded in 2004, The Hansberry Project is a professional black theatre company dedicated to the artistic exploration of African American life, history and culture. Past co-productions include audience favorites “Clyde’s” by Lynn Nottage (2024) and “Sunset Baby” by Dominique Morriseau (2019). “Topdog/Underdog” marks the fifth collaboration between the two theater companies; each with Valerie Curtis-Newton in the role of director. “Topdog/Underdog” is about the struggle to reach success in a system that is rigged. This drama packs a punch with as much comedy as it has intensity. A rooming house room the size of a boxing ring becomes a pressure cooker for the two brothers who share a past and are carving their own paths as they strive towards their dreams for the future. Director Valerie Curtis-Newton remarks, “The life of a dog in the fight is a life that breeds paranoia. The under dog is always watching their back and struggling to reach the top. The top dog gets to call the shots, but for how long? “Topdog/Underdog” puts the pain of that cycle under a microscope with the hope that in investigating it, we can learn to break it.” “Topdog/Underdog” is the third production of ArtsWest’s 2025-2026 Season titled Between Us. The season features 5 bold contemporary plays that explore the invisible threads that bind us — the responsibilities we bear for one another, the debts of care we carry, and the lifelines we extend in moments of crisis. In TOPDOG/UNDERDOG, two brothers wrestle with what they owe one another whether it be a roof over their head, a cut of their paycheck, or a watchful eye while the play asks audiences to contemplate the systems of oppression in America and what we owe our communities to create change. ArtsWest is at 4711 California SW. Tickets are available online here, by phone at 206-938-0339, and at the box office, Thursday – Saturday 2 pm-7 pm, Sundays 11 am-3 pm. After a few years in which catalytic-converter theft was seldom heard of, we see Mto have had at least a mini-resurgence lately. Kate emailed today to report: Reading about the recent catalytic converter reports – wanted to let you know that my 2000 Toyota 4Runner was hit in the Gatewood neighborhood- near 37th and Holden. It was stolen on Sunday, 1/19. But just verified via mechanic last week. From shops I have been talking to – sounds like there may be a recent uptick in West Seattle. “Thank you” is one of our favorite phrases, so we’re happy to share this message for you about the request we published from West Seattle Nursery (WSB sponsor) a week and a half ago, as they planned their exhibit for the upcoming Northwest Flower and Garden Festival. WSN’s Marie McKinsey emailed the photo and message: We asked you to put out the word that we wanted old books. This is a FRACTION of what we got. Thank you and the community! The question invariably arises – voters passed a levy, so how’s the money being spent? SDOT has just released its “draft plan” for spending Seattle Transportation Levy dollars this year. You’ll recall that voters approved the eight-year, $1.55 billion levy in fall 2024, so this is its second year. The draft 2-026 plan – see it in its entirety here – will be presented Thursday morning (February 5) to the Transportation, Waterfront, and Seattle Center Committee chaired by District 1 City Councilmember Rob Saka. It lists hundreds of projects/locations by name, though without specifics, so we went through it to get the West Seattle highlights, under the classifications used in the plan. Note that these are just the West Seattle mentions – and there are hundreds of projects listed from elsewhere in the city; projects are generally categorized in the plan as either being in design this year or starting construction: VISION ZERO: Highland Park Way hill project, design California/Oregon, construction SW Barton between 26th and 29th, construction West Seattle Bridge central eastbound span, construction TRAFFIC CALMING: Harbor Ave from California to Spokane, construction SAFE ROUTES TO SCHOOL: Projects for Denny IMS, Highland Park Elementary, Madison MS, Our Lady of Guadalupe, Roxhill Elementary zones ‘NEIGHBORHOOD INITIATED SAFETY PROJECTS’: Highland Park greenway/traffic calming, North Delridge all-way stop, South Delridge traffic calming and daylighting ‘NEIGHBORHOOD SCALE TRAFFIC SAFETY IMPROVEMENTS’: Planning will start for 26th between Brandon and Juneau. 63rd between Alki and Admiral, SW 100th between 35th and 44th, SW 106th between 35th and Marine View Drive, SSW Holden between 12th and 11th SPOT PAVEMENT IMPROVEMENTS, ASPHALT: 35th SW, 108th to 111th; 106th, 32nd to 35th SPOT PAVEMENT IMPROVEMENTS, CONCRETE: 30th/Genesee TRANSIT SPOT IMPROVEMENTS: Barton/29th layover, construction; Fauntleroy/Rose, design SIDEWALK CONSTRUCTION: Barton, 21st-23rd; Brandon, Delridge-23rd and 25th-26th; Hudson, Delridge to 26th SIDEWALK DESIGN: 21st, Dawson to Graham; 22nd, Henderson to Thistle; Brandon, 26th to 30th CURB RAMPS: 30th/Dakota, 31st/Barton, 45th/Charlestown, 47th/Frontenac, California at Ida, Austin, Webster CROSSING IMPROVEMENTS: SW Charlestown, 45th to 55th; Delridge at Cloverdale, design NEW SIGNAL: California/Walker SIGNAL MAINTENANCE AND CROSSING IMPROVEMENT: California/Erskine/Edmunds SIGNAL TIMING: Design for 47th/Admiral improvement ACCESSIBLE PEDESTRIAN SIGNALS: 26th/Barton, Fauntleroy/Dawson, design NEW PROTECTED BIKE LANE: Highland Park Way hill project, design PROTECTED BIKE LANE UPGRADE: Admiral Way, Spokane to Lander, design ‘PEOPLE STREETS’: Lander, 18th, in design FREIGHT: SW Manning crossing improvement, “derelict rail removal” on West Marginal Way Some categories promised such a high number of projects – like sidewalk repairs – that they weren’t called out by name/location. Also keep in mind that this is not the entirety of what SDOT is working on – just what the levy is funding; they have other non-levy work too. Many of these led us to wonder “what exactly will be done THERE?” and so we have followup questions out to SDOT. Meantime, you can watch their briefing for the council committee at 9:30 am Thursday, either in person or via Seattle Channel. The agenda explains how to comment, though also keep in mind, this isn’t something they’ll be voting on. One more note: As for how they spent levy dollars in Year 1, this new “dashboard” might answer some questions. (WSB photo of future EV lot, last November) For everyone watching for signs of construction at Morgan Junction’s future city-operated EV-charging lot site, you won’t have to wait much longer – Seattle City Light says on-site work is finally about to begin. SCL spokesperson Jenn Strang says contractor Zenisco Inc. “will begin work at the … site this week.” She adds, “We currently anticipate the chargers will be operational in August 2026.” Eight chargers are planned for the lot, on the site of a long-ago SCL substation kittycorner across SW Morgan from West Seattle Thriftway (WSB sponsor). We first reported on the project almost four years ago, at which the utility had hoped to start work within a year. We’re asking for any construction notice that might have gone to neighbors with details also helpful to people who drive, ride, and walk in that area, as well as any new details about one component of construction expected to require trenching on Fauntleroy Way, north of the site. Seattle Public Schools‘ new superintendent Ben Shuldiner is officially on the job after School Board president Gina Topp administered his oath of office this morning at Mercer International Middle School on Beacon Hill. It preceded a short media briefing, in which he answered questions about safety and spending. Here’s what happened, (added) starting with district video of the event: District chief of staff Bev Redmond opened with a statement about the “deep loss” of two teens shot to death in South Seattle Friday and led a moment of silence; four schools in South Seattle are on modified schedules today as part of the response. She said police are still actively investigating. A bit later in the event, School Board president Topp echoed the sentiment. “An important moment for Seattle Public Schools” is how Redmond then described the start of Shuldiner’s tenure as superintendent. Topp said the former Lansing, MI, superintendent would lead the Seattle district in improving “trust” and “outcomes.” She administered the oath of office to him. He then took the microphone, starting by saying that last night he had visited the neighborhood where the deadly shootings happened. He then said he was asked about his hope for the year, and turned the question to, “what is OUR hope?” He repeated what he’d said during the interview process – he wants SPS to be the best urban public-school district in America. Safety is vital; so is “raising the bar,” because he believes students will rise to what’s expected of them. He did not speak for long, saying that he didn’t believe anyone really wanted “to hear me speak” – that educators, students, and families instead wanted to get on with the work of education. He said “the collective we” is what will “make this district terrific.” Media Q&A followed. First question: How to make students safe? He said there are a variety of tactics such as cameras, “single point of entry,” but it’s also “about having a relationship with SPD” and family involvement. “We can do some gold-standard things inside the building” but then must work with the community on everything else. Second question: Do they need community members watching bus stops, police at bus stops, to keep students safe? (Friday’s shootings happened at a bus stop.) Shuldiner said it’s important for everyone to “work together,” and that would lead to change. He said brainstorming with the community would be vital. Third question was also about the district’s specific plans for helping students deal with the news of Friday’s shootings, and Shuldiner recapped the support the district was offering – bringing in counselors, giving students time to talk about it. Redmond said the district would offer those supports throughout the week. Fourth question was about Shuldiner’s promises of transparency in communication. He said he would do his best and pointed to a message he had sent to families last night. If the community has a request and it becomes reality, for example, he said they would follow up and offer proof that it had happened (a photo of equipment installation, for example). Fifth question recounted Shuldiner’s talk about budget review during interviews last year “to make sure everybody’s in the right place.” Will budgetary challenges result in layoffs? He replied, “There is a pot of money that we need to fill, what does that look like?”- they don’t yet know. Maybe positions will be eliminated through attrition (such as retirement), for example. “I don’t think initially you’re going to see any (changes/cuts) large-scale.” Sixth question was about immigration-enforcement concerns on campuses. Shuldiner replied that the district has worked hard ‘to get information out” to communities. That’s important, but so is “the law … and understanding what we can and cannot do,” he said. “The school building … is probably the safest place for children to be,” not just because of physical security of schools but because there are administrators and (district) lawyers as resources that can be drawn on. “School is the safest place to be.” Seventh question was about his communication plans. He will write a weekly letter to the community and is reviving a “roundtable” involving students, plus planning to visit schools. He also invited students and others to email him. “My job is to be a superintendent for all the people.” The event was wrapped at 8:39 am, after a little more than half an hour. 11:02 AM: One month before the South Delridge Walgreens (9456 16th SW) announced its impending closure late last summer, we had reported it was on the market. Now, it’s been sold. The sale, first reported by the Daily Journal of Commerce, was for $2.4 million – a third below the $3.75 million asking price in our previous story, plus less than half what the site/building is valued at in county records, and less than half what it sold for in 2003. The new owner of the 53,000-square-foot site is Team Amalfi LLC, whose principals include real-estate broker/developer James Tjoa; he’s been involved with other West Seattle projects including a 12-home site on Pigeon Point. We have a message out to ask about plans for the ex-Walgreens site; nothing’s showing up in city files so far. 1:12 PM: Went over for a new photo of the building (substituted above for the originally used King County Assessor file photo); discovered the new owner has signs up offering the building for lease: The listing offers the option of leasing just part of the building."
}