{
  "url": "https://en.wikipedia.org/wiki/Brian",
  "title": "Brian - Wikipedia",
  "text": "Brian Brian (sometimes spelled Bryan in English) is a male given name of Irish and Breton origin,[1] as well as a surname of Occitan origin.[2] It is common in the English-speaking world. History It is possible that the name is derived from an Old Celtic word meaning \"high\" or \"noble\".[1] For example, the element bre means \"hill\"; which could be transferred to mean \"eminence\" or \"exalted one\".[2] The name is quite popular in Ireland, on account of Brian Boru, a 10th-century High King of Ireland. The name was also quite popular in East Anglia during the Middle Ages. This is because the name was introduced to England by Bretons following the Norman Conquest.[1] Bretons also settled in Ireland along with the Normans in the 12th century, and 'their' name was mingled with the 'Irish' version.[2] Also, in North West England, the 'Irish' name was introduced by Scandinavian settlers from Ireland. Within the Scottish Gaelic-speaking areas of Scotland, the name was at first only used by professional families of Irish origin.[1] It was the fourth most popular male name in England and Wales in 1934, but a sharp decline followed over the remainder of the 20th century and by 1994 it had fallen out of the top 100.[3] It retained its popularity in the United States for longer; its most popular period there was from 1968 to 1979 when it consistently ranked between eighth and tenth. The name has become increasingly popular in South America, particularly Argentina and Uruguay, since the early 1990s. As a surname The surname Brian is sometimes an English and Irish variant spelling of the surname Bryan. The English and French surname Brian is sometimes derived from the Celtic personal name shown above. The surname Brian can also sometimes be a French surname; derived from the Old Occitan word brian, meaning \"maggot\" and used as a nickname.[2] Variants Variants of the name include Briant, Brien, Bran, Brion, Bryan, Bryant, Brjánn (in Icelandic) and Bryon.[4] Variant spellings such as \"Brien\" are sometimes used as female given names, especially among members of the Irish diaspora.[5] Association with social climbers in Latin America In Latin America, the phonetic spelling “Brayan” is often used, associated with working-class parents with social climbing aspirations due to perceived prestige associated of Anglo-American culture. The name is mocked for that reason on social media.[6][7] Notable people with the name Mononyms - Brian (dog), original name of Bing, a dog who served in the British Army in World War II - Brian (mythology), Celtic mythological figure - Brian, a snail character in the children's television programme The Magic Roundabout - King Charles III of England; see Recurring jokes in Private Eye Surname - Denis Brian (1923–2017), British journalist and writer - Donald Brian (1877–1948), Canadian-American actor, dancer, and singer - Havergal Brian (1876–1972), British classical composer - Mary Brian (1906–2002), American actress and movie star - Morgan Brian (born 1993), American women's soccer player Given name: common combinations - Brian Allen - Brian Anderson - Brian Bailey - Brian Becker - Brian Bedford - Brian Bell - Brian Bennett - Brian Blake - Brian Briggs - Brian Brown - Brian Burns - Brian Butler - Brian Byrne - Brian Campbell - Brian Carroll - Brian Clark - Brian Clarke - Brian Cole - Brian Coleman - Brian Collins - Brian Cook - Brian Cox - Brian Cummings - Brian Cunningham - Brian Davis - Brian Dixon - Brian Doyle - Brian Duffy - Brian Edwards - Brian Fallon - Brian Fitzpatrick - Brian Fletcher - Brian Flynn - Brian Francis - Brian Freeman - Brian Gibson - Brian Grant - Brian Green - Brian Griffin - Brian Hall - Brian Harvey - Brian Henderson - Brian Higgins - Brian Hill - Brian Hogan - Brian James - Brian Johnson - Brian Johnston - Brian Jones - Brian Keenan - Brian Keith - Brian Kelly - Brian Kennedy - Brian Kim - Brian Lee - Brian Lenihan - Brian Lewis - Brian MacMahon - Brian Magee - Brian Marshall - Brian Martin - Brian Mason - Brian McBride - Brian McFadden - Brian McLean - Brian Miller - Brian Moore - Brian Moran - Brian Murphy - Brian Myers - Brian O'Halloran - Brian O'Neill - Brian O'Sullivan - Brian Plummer - Brian Reynolds - Brian Roberts - Brian Robertson - Brian Savage - Brian Schmidt - Brian Scott - Brian Shaw - Brian Simmons - Brian Smith - Brian Smyth - Brian Stack - Brian Stafford - Brian Stewart - Brian Sullivan - Brian Thompson - Brian Thomson - Brian Tucker - Brian Turner - Brian Tyler - Brian Walsh - Brian White - Brian Williams - Brian Wilson - Brian Wong - Brian Wood - Brian Wright - Brian Young Given name: individuals - Brian Adamson, former Australian rules footballer - Brian Ah Yat (born 1975), American football player - Brian Alderson (footballer) (1950–1997), Scottish footballer - Brian Aldiss (1925–2017), British author - Brian Asamoah (born 2000), American football player - Brian Asawa (1966–2016), Japanese American opera singer - Brian Ash (born 1974), American producer and screenwriter - Brian Ash (bibliographer) (1936–2010), British writer, scientific journalist, and editor - Brian Azzarello (born 1962), American comic book writer and screenwriter - Brian Baatzsch (born 1995), German politician - Brian Baig, Trinidad and Tobago politician - Brian Bannister (born 1981), American baseball player and coach - Brian Barrett (born 1966), New Zealand former first-class cricketer - Brian Barczyk (1969–2024), American YouTuber - Brian Bass (born 1982), American former professional baseball player - Brian Beaucage (1947–1991), Canadian gangster, outlaw biker and criminal - B. Brian Blair (born 1957), American retired professional wrestler and politician - Brian Blessed (born 1937), English actor - Brian Bloom (born 1970), American actor and screenwriter - Brian Blose, South African politician - Brian Boitano (born 1963), American figure skater - Brian Bollinger (born 1968), American football player - Brian Bonsall (born 1981), American rock musician, singer, guitarist and former child actor - Brian Boobbyer (1928–2011), English rugby union player - Brian Borland, American football coach - Brian Boru (941–1014), Irish king who overthrew the centuries-long domination of the Kingship of Ireland by the Uí Néill - Brian Bosworth (born 1965), American former football linebacker and actor - Brian Bothwell, former professional footballer - Brian Bowman (born 1946), American musician - Brian Bowman (politician) (born 1971), Canadian politician, lawyer, and judge - Brian Brain (1940–2023), English cricketer - Brian Branch (born 2001), American football player - Brian Brandt, American electrical engineer - Brian Brikowski (born 1989), American football defensive end and linebacker - Brian Broomell (born 1958), American football player - Brian Burrows (born 1988), American sport shooter - Brian Patrick Butler, American actor and filmmaker - Brian Cant (1933–2017), British actor and children's television presenter - Brian Christopher (1972–2018), American professional wrestler - Brian Christopher (lacrosse) (born 1987), All American lacrosse player - Brian Clough (1935–2004), British football manager - Brian Colin (born 1956), American video-game designer, artist and animator - Brian Conley (born 1961), English actor, comedian, singer and television presenter - Brian Connolly (1945–1997), Scottish singer-songwriter, musician and actor - Brian Cornell, American businessman - Brian Cosgrove (born 1934), English animator, designer, director, producer and sculptor - Brian Costello (born 1963), American professional wrestler - Brian Cowen (born 1960), former Taoiseach (Prime Minister) of the Republic of Ireland - Brian Crowley (1964–2026), Irish politician - Brian Culbertson (born 1973), American musician and producer - Brian Cuthbertson (1936–2023), Canadian historian - Brian de la Puente (born 1985), NFL football player - Brian Dabul (born 1984), Argentine tennis player - Brian Dayett (1957–2025), American baseball player - Brian De Palma (born 1940), American film director - Brian Deneke (1978–1997), American teenage punk musician - Brian Dennehy (1938–2020), American actor - Brian Devoil (born 1954), British drummer - Brian Dietzen (born 1977), American actor - Brian Dowling (born 1978), Irish television presenter - Brian Dugan (born 1956), American convicted rapist and serial killer - Brian Draper (born 1990), one of two perpetrators of the Murder of Cassie Jo Stoddart - Brian Eley (1946–2022), British former Chess Champion and fugitive - Brian Eno (born 1948), English electronic musician, music theorist and record producer - Brian Enos, American sport shooter - Brian Epstein (1934–1967), English businessperson, manager of The Beatles - Brian Fleury, American football coach and former player - Brian Folkerts (born 1990), American football player - Brian Friedman (born 1977), American dancer and choreographer - Brian Gaine, American football executive - Brian George (born 1952), British actor - Brian Gill, Lord Gill, Lord Justice Clerk of Scotland - Brian Ginsberg (born 1966), American gymnast - Brian Glover (1934–1997), English actor and writer - Brian Goodman (born 1963), American film director, television director, writer, and actor - Brian P. Goodman (1947–2013), Chairperson of the Immigration and Refugee Board of Canada (IRB) - Brian Gottfried (born 1952), American tennis player - Brian Gowins (born 1976), American football player - Brian Graden (born 1963), American television executive - Brian Grazer (born 1951), American Oscar-winning film and television producer - Brian Gutekunst (born 1973), American football executive - Brian Haley (born 1961), American actor and comedian - Brian Haner Sr. (born 1958), American musician - Brian Haner Jr. (born 1981), American guitarist, son of Haner Sr. - Brian Hebner, American former professional wrestling referee - Brian Heidik (born 1968), American actor, used car salesman, and television personality - Brian Herbert (born 1947), American author - Brian Holland (born 1941), American songwriter and record producer - Brian Horwitz (nicknamed \"The Rabbi\"; born 1982), American major league baseball outfielder - Brian Hutton, Baron Hutton (1932–2020), British law lord and barrister - Brian Inglis (1916–1993), Irish journalist, historian, and television presenter, known for All Our Yesterdays - Brian Jeffriess, primary spokesperson for Australia's Southern bluefin tuna fishing and aquaculture industry - Brian Michael Jenkins (born 1942), U.S. terrorism expert - Brian Joo (born 1981), American-born Korean singer, former member of the R&B duo Fly to the Sky - Brian Jossie (born 1977), American professional wrestler performing under the ring name of Abraham Washington - Brian Joubert (born 1984), French figure skater and 2007 World Champion - Brian Kabugi (born 2000), Kenyan actor - Brian Kemp (born 1963), American politician - Brian Kendrick (born 1979), American professional wrestler - Brian Kerwin (born 1949), American actor - Brian Knobbs (born 1964), American professional wrestler - Brian Krebs (born 1972), American journalist and investigative reporter - Brian Lane (RAF officer) (1917–1942), English fighter pilot and flying ace of the Royal Air Force - Brian Lara (born 1969), former West Indian cricketer - Brian Lawrance (1909–1983), Australian musician - Brian Laudrup (born 1969), Danish footballer - Brian Laundrie (c. 1997–2021), American fugitive - Brian Leishman, Scottish politician - Brian Levant (born 1952), American filmmaker - Brian Lewerke (born 1996), American football player - Brian Limond (born 1974), Scottish comedian - Brian Littrell (born 1975), member of the boy band, The Backstreet Boys - Brian Maher, American politician - Brian Masse (born 1968), Canadian politician - Brian Matusz (1987–2025), American professional baseball pitcher - Brian May (born 1947), guitarist, songwriter, founding member of the band Queen - Brian McConaghy (born 1950), Canadian forensic scientist - Brian McDermott (murder victim) (born 1970), Irish murder victim - Brian McKeever (born 1979), Canadian cross-country skier and biathlete - Brian McKnight (born 1969) American singer-songwriter, arranger, producer, and R&B musician - Brian McNamara, American actor - Brian Milligan (born 1982/1983), Northern Irish actor - Brian David Mitchell (born 1953), American criminal convicted of the Kidnapping of Elizabeth Smart - Brian Mock (died 1992), American gay man and murder victim - Brian Molko (born 1972), lead vocalist of the band Placebo - Brian Moorman (born 1976), American football player for the Buffalo Bills - Brian Mullins (1954–2022), Irish Gaelic football player and manager - Brian Mullins (hurler) (born 1978), Irish hurler - Brian Mulroney (1939–2024), Prime Minister of Canada from 1984 to 1993 - Brian Doyle-Murray (born 1945), American actor - Brian Murray (actor) (1937–2018), South African actor - Brian Mustanski, American psychologist - Brian Odom (born 1981), American football coach - Brian O'Driscoll (born 1979), Irish rugby player - Brian O'Gallagher, Australian politician - Brian O'Keefe (born 1956), Australian rules footballer - Brian O'Keefe (baseball) (born 1993), American baseball player - Brian O'Keeffe, Irish hurler - Brian Olinger (born 1983), American runner - Brian Orser (born 1961), Canadian figure skater - Brian Pattie (born 1975), American auto-racing crew chief - Brian Paddick (born 1958), British politician - Brian Peaker (born 1959), Canadian rower - Brian Peets (born 1956), American football player - Brian Percival, British film director - Brian Piccolo (1943–1970), American football player for the Chicago Bears and subject of TV movie Brian's Song - Brian Pillman (1962–1997), American professional wrestler and professional football player - Brian Pillman Jr. (born 1993), American professional wrestler - Brian Quinn (economist) (born 1936), Scottish economist and former football club chairman - Brian Quinn (soccer) (born 1960), Northern Irish-American soccer coach and former player - Brian Randle (born 1985), American basketball player - Brian Ransom (gridiron football) (born 1960), American player of gridiron football - Brian Retterer (born 1972), American swimmer - Brian Robbins (born 1963), American media proprietor and film producer - Brian Ross (journalist) (born 1948), American investigative correspondent for ABC News - Brian Savoy (born 1992), Swiss basketball player - Brian Schneider (born 1976), American baseball player - Brian Serven (born 1995), American baseball player - Brian Siemann (born 1989), American wheelchair racer - Brian Sims (born 1978), American politician, member of the Pennsylvania House of Representatives - Brian Skala (born 1981), American actor - Brian Snitker (born 1955), American baseball coach - Brian P. Stack (born 1966), American politician - Brian Stack (1935/1936–1984), Irish murder victim - Brian Stack (born 1964), American actor, comedian and writer - Brian Stelter (born 1985), American journalist and television news correspondent - Brian Stephney (born 1983), Montserratian cricketer - Brian Sweeney (born 1974), American baseball player and coach - Brian Sweeney (sailor), Canadian sailor - Brian Teacher (born 1952), American tennis player - Brian Tichy (born 1968), American musician - Brian Tomasik, American researcher and ethicist - Brian Thomas (rugby union) (1940–2012), Wales rugby union footballer - Brian Thomas (church artist), British artist - Brian Thomas Jr. (born 2002), American football player - Brian Trueman (1932–2024), British broadcaster, writer and voice actor - Brian Tochi, American actor - Brian Tucker (screenwriter), American film screenwriter - Brian Tyler (born 1972), American composer and musician - Brian Urlacher (born 1978), American football player for the Chicago Bears - Brian K. Vaughan (born 1976), American comic book and television writer - Brian Viloria (born 1980), American boxer - Brian Wallach (born 1980), American businessman and lawyer - Brian Warner (born 1969), American singer, better known by his stage name Marilyn Manson - Brian Wecht (born 1975), composer/producer of musical comedy duo, Ninja Sex Party - Brian Westbrook (born 1979), American football player for the Philadelphia Eagles - Brian Williamson (1945–2004), Jamaican gay rights activist - Brian Wilson (1942–2025), American singer-songwriter and co-founder of American rock band the Beach Boys - Brian Yuzna, American producer, director, and writer Fictional characters - Brian, a character in the American 1983 TV miniseries V (1983) and V The Final Battle - Brian, a character in the American 2001 thriller movie Good Neighbor - Brian Baker, a police officer on the HBO drama The Wire - Brian Cohen, main protagonist of Monty Python's Life of Brian, played by Graham Chapman - Brian Connelly, a character played by Brian Doyle-Murray in the 1988 Superman 50th Anniversary movie - Brian Cruz (Tag), a mutant character in Marvel Comics - Brian Doheny (commonly referred to as BrianD), main protagonist of Video Game High School - Brian Fellow, animal enthusiast and main character of Saturday Night Live sketch, Brian Fellow’s Safari Planet - Brian Green, from the British TV show Torchwood - Brian Griffin on Family Guy, voiced by Seth MacFarlane - Brian Kinney on Queer as Folk (US), played by Gale Harold - Brian Latham, a character in the 2006 superhero movie Lightspeed - Brian Johnson, main character in the 1985 film The Breakfast Club - Brian O'Conner in The Fast and the Furious series, played by Paul Walker - Brian Robles, a character in the 2022 Filipino TV series of Mars Ravelo's Darna - Brian Stills, a character in the 1981 American science fiction black comedy movie Modern Problems - Brian Winddancer, a character in the Zootopia franchise Media titles Films and television shows which contain the name Brian include: - Brian's Song (1971, 2001) - Monty Python's Life of Brian (1979) - What About Brian, American TV series that began in 2006 - Burying Brian, mini New Zealand TV series See also - All pages with titles beginning with Brian - All pages with titles containing Brian - Brien - Bryan (given name) - Bryan (surname) - Brayan, a masculine given name - Braian, a masculine given name - List of Irish-language given names - O'Brian, surname - O'Brien (surname) References - ^ a b c d A Dictionary of First Names. Oxford University Press. 1996. ISBN 0-19-280050-7. - ^ a b c d Dictionary of American Family Names. Oxford University Press. 8 May 2003. ISBN 0-19-508137-4. - ^ \"Brian - Meaning And Origin Of The Name Brian\". BabyNames.co.uk. Retrieved 2026-01-07. - ^ Noel Higgins & Jeanne Goldner, Names, Names, Names, A Book for You (Middletown, Connecticut: Weekly Reader Books, 1986), page 8-b. - ^ Gray, Breda. \"Women and the Irish Diaspora\". London : Routledge, 2004. p.87 - ^ \"\"No le pongan Brayan a su hijo\": La recomendación de un registro civil en México para evitar el bullying\". 2 September 2016. - ^ \"El origen de los memes de 'El Brayan' y 'La Britany' en las redes sociales\"."
}