{
  "url": "https://www.biblegateway.com/passage/?search=1+samuel+1&version=NIV",
  "title": "1 samuel 1 NIV - The Birth of Samuel - There was a - Bible Gateway",
  "text": "1 Samuel 1 New International Version The Birth of Samuel 1 There was a certain man from Ramathaim,(A) a Zuphite[a](B) from the hill country(C) of Ephraim,(D) whose name was Elkanah(E) son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephraimite. 2 He had two wives;(F) one was called Hannah and the other Peninnah. Peninnah had children, but Hannah had none. 3 Year after year(G) this man went up from his town to worship(H) and sacrifice to the Lord Almighty at Shiloh,(I) where Hophni and Phinehas, the two sons of Eli,(J) were priests of the Lord. 4 Whenever the day came for Elkanah to sacrifice,(K) he would give portions of the meat to his wife Peninnah and to all her sons and daughters.(L) 5 But to Hannah he gave a double portion(M) because he loved her, and the Lord had closed her womb.(N) 6 Because the Lord had closed Hannah’s womb, her rival kept provoking her in order to irritate her.(O) 7 This went on year after year. Whenever Hannah went up to the house of the Lord, her rival provoked her till she wept and would not eat.(P) 8 Her husband Elkanah would say to her, “Hannah, why are you weeping? Why don’t you eat? Why are you downhearted? Don’t I mean more to you than ten sons?(Q)” 9 Once when they had finished eating and drinking in Shiloh, Hannah stood up. Now Eli the priest was sitting on his chair by the doorpost of the Lord’s house.(R) 10 In her deep anguish(S) Hannah prayed to the Lord, weeping bitterly. 11 And she made a vow,(T) saying, “Lord Almighty(U), if you will only look on your servant’s misery and remember(V) me, and not forget your servant but give her a son, then I will give him to the Lord for all the days of his life,(W) and no razor(X) will ever be used on his head.” 12 As she kept on praying to the Lord, Eli observed her mouth. 13 Hannah was praying in her heart, and her lips were moving but her voice was not heard. Eli thought she was drunk 14 and said to her, “How long are you going to stay drunk? Put away your wine.” 15 “Not so, my lord,” Hannah replied, “I am a woman who is deeply troubled.(Y) I have not been drinking wine or beer; I was pouring(Z) out my soul to the Lord. 16 Do not take your servant for a wicked woman; I have been praying here out of my great anguish and grief.”(AA) 17 Eli answered, “Go in peace,(AB) and may the God of Israel grant you what you have asked of him.(AC)” 18 She said, “May your servant find favor in your eyes.(AD)” Then she went her way and ate something, and her face was no longer downcast.(AE) 19 Early the next morning they arose and worshiped before the Lord and then went back to their home at Ramah.(AF) Elkanah made love to his wife Hannah, and the Lord remembered(AG) her. 20 So in the course of time Hannah became pregnant and gave birth to a son.(AH) She named(AI) him Samuel,[b](AJ) saying, “Because I asked the Lord for him.” Hannah Dedicates Samuel 21 When her husband Elkanah went up with all his family to offer the annual(AK) sacrifice to the Lord and to fulfill his vow,(AL) 22 Hannah did not go. She said to her husband, “After the boy is weaned, I will take him and present(AM) him before the Lord, and he will live there always.”[c] 23 “Do what seems best to you,” her husband Elkanah told her. “Stay here until you have weaned him; only may the Lord make good(AN) his[d] word.” So the woman stayed at home and nursed her son until she had weaned(AO) him. 24 After he was weaned, she took the boy with her, young as he was, along with a three-year-old bull,[e](AP) an ephah[f] of flour and a skin of wine, and brought him to the house of the Lord at Shiloh. 25 When the bull had been sacrificed, they brought the boy to Eli, 26 and she said to him, “Pardon me, my lord. As surely as you live, I am the woman who stood here beside you praying to the Lord. 27 I prayed(AQ) for this child, and the Lord has granted me what I asked of him. 28 So now I give him to the Lord. For his whole life(AR) he will be given over to the Lord.” And he worshiped the Lord there. Footnotes - 1 Samuel 1:1 See Septuagint and 1 Chron. 6:26-27,33-35; or from Ramathaim Zuphim. - 1 Samuel 1:20 Samuel sounds like the Hebrew for heard by God. - 1 Samuel 1:22 Masoretic Text; Dead Sea Scrolls always. I have dedicated him as a Nazirite—all the days of his life.” - 1 Samuel 1:23 Masoretic Text; Dead Sea Scrolls, Septuagint and Syriac your - 1 Samuel 1:24 Dead Sea Scrolls, Septuagint and Syriac; Masoretic Text with three bulls - 1 Samuel 1:24 That is, probably about 36 pounds or about 16 kilograms Holy Bible, New International Version®, NIV® Copyright ©1973, 1978, 1984, 2011 by Biblica, Inc.® Used by permission. All rights reserved worldwide. NIV Reverse Interlinear Bible: English to Hebrew and English to Greek. Copyright © 2019 by Zondervan."
}