{
  "url": "https://support.microsoft.com/fr-fr/surface/surface-pro-7-spécifications-et-fonctionnalités-8254894d-bb80-77ef-daae-612ea713e310",
  "title": "Surface Pro 7 spécifications et fonctionnalités - Support Microsoft",
  "text": "Surface Pro 7 spécifications et fonctionnalités S’applique à Découvrez les dernières Surface Pro Bénéficiez de la flexibilité de la tablette à l’ordinateur portable dans un PC puissant. Avec les expériences de Copilot+ PC accélérées par IA et l’autonomie de la batterie toute la journée, Surface Pro est conçu pour vous maintenir en déplacement. Découvrez la Surface Pro 7 La Surface Pro 7 est plus performante que jamais et s’adapte à vos méthodes de travail. Vous ne savez pas où brancher un composant ou comment augmenter le volume ? Nous sommes à votre service. Voici quelques schémas pour vous aider. - Volume - Bouton Marche/Arrêt - Casque et prise de microphone - Caméra de reconnaissance faciale Windows Hello - Caméra avant - Microphones Studio (doubles microphones) - Port USB-C - Port USB-A - Port Surface Connect - lecteur microSDXC™ carte Surface Pro 7 et Windows 10 Surface Pro 7 est fournie avec : - Windows 10 Famille (clients particuliers) - Windows 10 Professionnel (clients professionnels) Si Windows 10 Famille est installé sur votre appareil, vous pouvez passer à Windows 10 Professionnel moyennant un coût supplémentaire. Pour plus d’informations, consultez Mettre à niveau Windows 10 Famille vers Windows 10 Professionnel. Vous ne savez pas quelle version de Windows vous utilisez ? Consultez Quel système d’exploitation Windows mon ordinateur exécute-t-il ? Si vous ne savez pas quel modèle de Surface vous utilisez, consultez Quel est mon modèle de Surface? Remarque : Vous pouvez mettre à niveau votre Surface Pro 7 vers Windows 11. Pour plus d’informations, voir Configuration système requise pour Windows 11. Charger votre Surface Vous pouvez charger votre Surface en utilisant USB-C ou Surface Connect. Pour plus d’informations, consultez Guide pratique pour charger Surface. Caractéristiques de la Surface Pro 7 Travaillez à votre façon Transformez la Surface Pro 7 de tablette en portable, à l’aide du support et du clavier Surface Signature Type Cover. Utilisez les ports USB-C et USB-A pour vous connecter à des écrans, à des stations d’accueil et à vos accessoires. Une puissance de nouvelle génération pour donner vie à vos idées Surface Pro 7 utilise le processeur Intel® Core™ de 10e génération avec des options de configuration offrant jusqu’à 16 Go de RAM et un SSD de 1 To. Avec la charge rapide, une autonomie durant une journée entière et un démarrage instantané, vous pouvez reprendre votre travail partout où vous allez. Exprimez-vous Surface Pro 7 est disponible en Platine ou en Noir mat. Vous pouvez également obtenir un clavier Surface Pro Signature Type Cover dans de nouveaux coloris. La musique est reproduite avec un son pur et cristallin, grâce à la technologie audio Dolby Audio Premium. Lors de votre prochain appel ou lorsque vous utiliserez la dictée vocale, tirez parti des deux micros de studio longue portée. Faites-en plus avec le système Windows que vous connaissez Profitez de fonctionnalités familières telles que la connexion par Windows Hello et Microsoft Edge. Obtenez Microsoft 365 pour créer un travail optimal et le stocker en toute sécurité dans OneDrive. Personnalisez-la En savoir plus sur les accessoires facultatifs compatibles avec votre Surface Pro 7. Tirez le meilleur parti de votre Surface Apprenez-en davantage sur votre Surface et personnalisez-la avec l’application Surface. Pour l’ouvrir, sélectionnez Démarrer, entrez Surface et sélectionnez-la pour ouvrir l’application. Si l’application ne s’ouvre pas, obtenez-la à partir de la Microsoft Store. Surface Pro 7 spécifications techniques * Certains logiciels et accessoires vendus séparément. [1] Autonomie de la batterie Surface Pro 7 : Jusqu’à 10,5 heures d’autonomie de la batterie en fonction de l’utilisation classique de l’appareil Surface. Tests effectués par Microsoft en septembre 2019 à l’aide d’un logiciel de préproduction et d’un appareil Intel® Core™ i5 de préproduction, 256 Go, 8 Go de RAM. Les essais ont consisté en une décharge complète de la batterie avec un mélange d'utilisation active et de veille moderne. La partie utilisation active consiste en (1) un test de navigation sur le web en accédant à 8 sites web populaires par le biais de plusieurs onglets ouverts, (2) un test de productivité en utilisant Microsoft Word, PowerPoint, Excel et Outlook, et (3) une partie du temps d'utilisation de l'appareil avec des applications inactives. Tous les paramètres étaient par défaut, sauf la luminosité de l'écran qui était réglée à 150nits avec la fonction Luminosité automatique désactivée. Le Wi-Fi était connecté à un réseau. L'autonomie de la batterie varie considérablement selon les paramètres définis, l'utilisation qui est faite et d'autres facteurs.[2] Poids non compris Type Cover. [3] Le logiciel système occupe une partie importante de l’espace de stockage. Le stockage disponible est susceptible de varier selon les mises à jour du logiciel système et l’utilisation des applications. 1 Go = 1 milliard d’octets. 1 To = 1 000 Go. Voir Surface.com/Storage pour d’autres détails. [4] Les couleurs disponibles pour les accessoires, Type Cover (vendu séparément) et Surface Pro 7 peuvent varier selon le marché et la configuration. [5] Nécessite un abonnement Microsoft 365. [6] La garantie limitée de Microsoft s’ajoute à vos droits en matière de protection des consommateurs."
}