{
  "url": "https://communaute.orange.fr/t5/gérer-mon-offre-mobile/communication-WAP-WEB/td-p/627613",
  "title": "communication WAP/WEB - Communauté Orange",
  "text": "- Communauté Orange - ➔ - mobile Orange - ➔ - gérer mon offre mobile - ➔ - communication WAP/WEB Vous avez une question ? Interrogez la communautécommunication WAP/WEB - S'abonner au fil RSS - Marquer le sujet comme nouveau - Marquer le sujet comme lu - Placer ce Sujet en tête de liste pour l'utilisateur actuel - Marquer - S'abonner - Page imprimable - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler communication WAP/WEB Bonjour, Je trouvais cher mon abonnement TV+internet+mobile orange, qu'il y a environ une semaine je décide de réduire mon forfait de 10 voir 15 € moins cher et tout cela sans réengagement! Je reçois ces confirmations de changement, par sms et mail, et que le nouveau forfait sera effectif le 1er août. Jusqu'ici tout est nickel quand je reçois ce matin, le 4/8/2015, un sms d'orange me disant : \"Orange : vos connexions internet mobile à l'étranger vont atteindre un palier de 40 €. Par mesure de prévention, votre session sera interrompue à 50€. \" Et là, je me dis : \"qu'es-ce encore cette m......de !!!!!\" Je précique que je ne suis PAS à l'étranger et que je ne suis pas partie NON PLUS cette année, ni l'année d'avant!! j'ai quand même vérifié mes applications et donc leur data, tout est paramétrées en connexion wifi et non données mobiles! Je vois que cette grosse m....... Hors Forfait 04-08-15 / 08h08 Orange.fr 1Ko communication WAP/WEB 0,13€ Hors Forfait 04-08-15 / 08h03 Orange.fr 0Ko communication WAP/WEB 0,13€ Hors Forfait 04-08-15 / 07h53 Orange.fr 0Ko communication WAP/WEB 0,13€ Hors Forfait 04-08-15 / 07h38 Orange.fr 569Ko communication WAP/WEB 7,41€ .... continue.......!!!!!!!!!!!! Alors merci de prendre note de ma demande et de régler ce soucis!!!!!! Là j'ai désactivé les données mobiles!!!! Merci - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB salut @Vaiani tu as voulu faire des économies, OK, mais de quel forfait vers quel forfait as tu migré Tous les forfaits n'ont pas d'internet mobile, et logiquement dans le cas de connexion au net, cela t'est logiquement facturé Par ailleurs, ici, tu t'adresses à d'autre client comme toi, nous ne pouvons donc pas faire quoi que ce soit PS : j'ai déplacé ta question dans la partie mobile - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB Merci d'avoir pris le temps de répondre. Concernant mon nouveau forfait c'est un open play 4go, avant c'était open jet 7go. j'ai effectivement internet mobile inclus et si j'en crois ma consommation actuelle, je n'ai utilisé que 96 mo depuis le 1/8/15. et pour mon post, es-ce que quelqu'un pourrait me dire d'où viendrait ce problème ou vers qui dois-je me tourner? car sinon je fais un recommandé à orange! Merci d'avance pour vos réponses. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB salut @Vaiani curieux en effet avant de sortir l'artillerie lourde, direction le service client pour savoir ce qu'il en est - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB Je vais suivre votre conseil et je reviens pour vous tenir au courant! Suis revenue avec l'historique du service client !!! Diva: Bonjour, je suis Diva, que puis-je pour vous ? MOI : Bonjour MOI: je vais être directe avec vous MOI: depuis le changement de mon forfait MOI: j'ai du Hors forfait depuis le 1/8/15 MOI: et je ne comprends pas d'ou cela peut venir MOI: et le pire c'est que la facture continue à monter Diva: Pouvez vous me confirmer que votre demande concerne le 06*******, afin que je sois sûr d'avoir le bon dossier ? MOI: oui c'est bien le 06***** MOI: adresse : ***** Diva: Merci de patienter afin que je puisse accéder à votre dossier. MOI: à ****** MOI: merci Diva: Je vous en prie Diva: Je vous remercie d'avoir patienté. MOI: j'espère que vous allez pouvoir faire quelque chose Diva: Après vérification de votre dossier je vois que vous avez un envoi de sms vers l'étranger Diva: des connextion mobile depuis l'étranger Diva: connexions MOI: je n'ai pas bouger de la France depuis des années Diva: et 6 envois de sms avec service MOI: je ne parle pas de ces sms MOI: vous avez vu la liste avec communication WAP/WEB MOI: vers orange.fr ? Diva: Vous avez 14.80 pour la connexion Diva: Je vous rembourse * Diva: Oui Diva: Je vous rembourse 15 € Diva: Je vous appel par téléphone une fois le remboursement est mis en place MOI: Madame MOI: je parle du hors forfait de 48 € MOI: qui sera bloqué à 50 € MOI: vous savez qu'es-ce que c'est? Diva a été déconnecté de la session. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB salut @Vaiani quand je parle du service client, ce n'est jamais le t'chat Je parle d'appeler les conseiller et de leur parler en direct, c'est nettement plus efficace concernant l'étranger, attention si comme moi tu es frontalier Je ne compte plus le nombre de fois ou sans bouger de mon salon je me suis retrouvé connecté au réseau du pays d'a côté (100 mètres à vol d'oiseau) - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB Re, Après des échanges e-chats et téléphones avec le service Orange. Il s'agirait d'un \"bug\" et donc ce sont des connexions internet \"depuis\" l'étranger. Or, je suis à Paris et malheureusement pour moi je n'ai pas voyagé depuis un grand moment! Orange me fait un remboursement... aujourd'hui j'ai réactivé mes données cellullaires. On verra si ce problème technique persiste. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication WAP/WEB Dans ce cas les forums ne servent qu'à se plaindre sans jamais obtenir une réponse SURE et COMPLETE. C'est fatigant et râlant de les lire si aucune réponse technique officielle et sa marche à suivre claire n'est donné pour résoudre ce problème de WAP/WEB qui est vraiment récurrent et prédateur. Une vraie plaie. S'il faut fermer l'iPhone ou internet pour éviter ça à quoi bon avoir un mobile ?"
}