{
  "url": "https://www.reddit.com/r/BlackClover/comments/u5pb84/mimosa_is_kinda_a_terrible_character/",
  "title": "Reddit - The heart of the internet",
  "text": "Mimosa is kinda... a terrible character. Look, this post has nothing to do with her op healing, as even fodder in this arc are stage 0, or anything about this recent chapter, not even then. Here is my problem with her? - Her lack of character development Please, do not give the reason of \"she's a healer, why give her character development?\" Mimosa personality wise is the same character as when see her during the awarding ceremony; now I don't know if people classify mimosa as one of those flat characters like Luffy, superman, or tanjiro, or asta but the thing about those \"flat characters\" is that they change the people around them or so people tell me; with that being said, who has she changed for the better: Noelle is more inspired by asta; langris, changed by yuno's example, kirsch, more on asta beating him that changed him and some trash talk from zora, rhya, he still hates the clover royals to an extent. 2. She hangs out with the black bulls more than her own squad. We don't even have a slight clue on how she interacts with her teammates, to be fair Yuno and langris are the same, but the anime fillers help fill in the blanks as far as their relationship; mimosa didn't get the luxury. Why is that? Are you turned of by them looking down at Yuno, who at the time, is still a peasant? Fine, but the question here is did you even try to change their perspective? In the guidebook, you are the second most popular character in verse, (1st being Charlotte, 3rd being fragil of all people, if anyone is wondering) l, not to mention a royal, and the only time they talk or treated you like shit to you is alecdora during the awarding ceremony and I suppose langris, but at that time, he was an ass to everybody except for fragil and sekke funny enough, but everything else is pretty fine; she should have made yuno's early time with prejudiced golden dawn a lot easier; Noelle managed to convince a big portion of nobility that during the star awarding ceremony with a lot less, so she doesn't have a strong excuse to why she doesn't. How is it you have more dialogue with asta than you with either Yuno or Klaus; everytime the three of you have conversation, you stopped talking with each other and suddenly it's all about asta when he arrives. 3. Her role model being only asta. The female characters of black clover get a lot more than most shonen, and yet mimosa looks like she is written by kishimoto, the dude that admits the reason the women in Naruto gets shafted, is because he said doesn't how to write female characters. Her reason to get stronger is that she can fight alongside him, Noelle got better, because she had become stronger, because of the people around her; fuegoleon, mereoleona, the black bulls in general, kahono; for mimosa only asta. If she needed inspiration, why not look further than your own teammate Yuno? Look, I am in no way, a yunosa shipper, but look at the facts: when the squad is giving him the cold shoulder, he just took it, not complaining not let it get to his head, but little by little, with the merits he accumulated, they grow to respect him, even someone like langris grew to respect him, all this before anyone knew of his heritage. I know it is not as inspirational as a magic less boy telling the world and fate to go f*ck itself and still push forward against the odds, but inspiration nonetheless. Or fuegoleon, not much to be said here; I suppose Noelle was an inspiration to her, I guess. In a way, what zora said about her is true, she always chooses the best decision for the situation, and perhaps that best situation for her is the black bulls. My whole beef with these is if tabata wanted mimosa to hang out with the bulls this often, why not have her join the bulls in the beginning? She could choose what squad she likes and I'm sure Yami would not have any objections bringing her in, could use the excuse that she wants to be with her bestie Noelle, like we pick our friends to be teammates in a project. Perhaps she could be promoted to vice captain of the golden dawn and play a bigger role in the group, but considering her absence from her own squad most of the time, don't you think it feel forced? That's all, what you guys think?"
}