{
  "url": "https://www.sprintz.com/browse/living-room/recliners/36",
  "title": "Recliners in Nashville, Franklin, and Greater Tennessee | Sprintz Furniture | Result Page 1",
  "text": "Recliners Filter sort This is just a sample of the huge selection we offer at Sprintz. Come visit one of our convenient locations! Come visit one of our convenient locations! close clear all Power Recliner CS Home Collection Retail Price: $3,090 Presidents Day Sale Price: $1,615 Back in Stock Soon. Reserve Yours Now On Display Compare Recliner Sprintz Dante Collection Retail Price: $2,370 Presidents Day Sale Price: $1,235 In Stock On Display Compare Blair Power Recliner Blair Collection Retail Price: $2,930 Presidents Day Sale Price: $1,520 In Stock Limited Quantities Available On Display Compare Power Reclining Leather Chair Lioni Collection Retail Price: $3,700 Presidents Day Sale Price: $2,137 In Stock Limited Quantities Available On Display Compare Germain Motion Chair Germain Collection Retail Price: $3,290 Presidents Day Sale Price: $1,900 In Stock On Display Compare Leather Power Recliner Sprintz Dante Collection Retail Price: $1,850 Presidents Day Sale Price: $950 In Stock Limited Quantities Available On Display Compare Powered Recliner Sprintz Dante Collection Retail Price: $2,550 Presidents Day Sale Price: $1,330 Back in Stock Soon. Reserve Yours Now On Display Compare Prince Relaxer Recliner in Standard Size Prince Collection Retail Price: $2,190 Sale Price: $1,499 In Stock Limited Quantities Available On DisplayClearance color options Compare Power Leather Recliner Sprintz Dante Collection Retail Price: $2,550 Presidents Day Sale Price: $1,330 In Stock Limited Quantities Available On Display Compare Sami Leather Recliner Sprintz Collection Retail Price: $5,370 Presidents Day Sale Price: $2,593 Back in Stock Soon. Reserve Yours Now On Display color options Compare Boss Standard Recliner with Power Boss Collection Retail Price: $4,270 Presidents Day Sale Price: $2,850 Back in Stock Soon. Reserve Yours Now On Display Compare Push thru the arm recliner Vintage Reserve Collection Retail Price: $2,470 Presidents Day Sale Price: $1,282 Back in Stock Soon. Reserve Yours Now On Display Compare Germain Leather Power Motion Chair Bernhardt Living Collection Retail Price: $4,450 Presidents Day Sale Price: $2,517 In Stock On Display Compare Leather Power Recliner Recliner Collection Retail Price: $2,710 Presidents Day Sale Price: $1,425 In Stock On Display Compare Milo Recliner Sprintz Collection Retail Price: $6,000 Presidents Day Sale Price: $3,420 In Stock Limited Quantities Available On Display Compare Milo Recliner Sprintz Collection Retail Price: $6,000 Presidents Day Sale Price: $3,420 In Stock Limited Quantities Available On Display Compare Power Recliner Levi Collection Retail Price: $2,360 Presidents Day Sale Price: $1,235 In Stock Limited Quantities Available On Display color options Compare Large Power Recliner Boss Collection Retail Price: $4,530 Sale Price: $3,169 In Stock On DisplayClearance Compare Recliner Sprintz Dante Collection Retail Price: $2,200 Sale Price: $999 In Stock On DisplayClearance Compare 2 Motion Types Push Back Recliner Nixon Collection Retail Price: $2,000 Presidents Day Sale Price: $1,045 Back in Stock Soon. Reserve Yours Now On Display color options Compare Swivel Chair with Power Footrest CC Collection Retail Price: $2,970 Presidents Day Sale Price: $1,662 In Stock Limited Quantities Available On Display Compare Motion Media Recliner Utopia Collection Retail Price: $3,450 Presidents Day Sale Price: $1,805 In Stock On Display Compare Compare Recliner Zero G Power Recliner Collection Retail Price: $2,200 Presidents Day Sale Price: $1,140 In Stock Limited Quantities Available On Display Compare Motion Chair Lioni Lioni Collection Retail Price: $3,700 Presidents Day Sale Price: $2,137 In Stock On Display Compare 2 Options Tucker Chair U Choose Motion Collection Retail Price: $4,580 Presidents Day Sale Price: $2,422 In Stock Limited Quantities Available On Display color options Compare RECLINER-ZERO WALL PWR *KARA* Kara Collection Retail Price: $6,530 Presidents Day Sale Price: $3,420 Back in Stock Soon. Reserve Yours Now On Display Compare Power Motion High-Leg Recliner Albert Collection Retail Price: $2,150 Sale Price: $1,199 In Stock Limited Quantities Available On DisplayClearance color options Compare Henley Swivel Recliner Sprintz Collection Retail Price: $7,450 Presidents Day Sale Price: $3,420 In Stock Limited Quantities Available On Display Compare Leather Motion Chair Sorrento Collection Retail Price: $3,850 Sale Price: $2,199 In Stock On DisplayClearance Compare Hyde Recliner Hyde Collection Retail Price: $3,180 Presidents Day Sale Price: $1,662 In Stock Limited Quantities Available On Display Compare Luc Fabric Power Motion Chair Bernhardt Living Collection Retail Price: $2,580 Sale Price: $1,549 In Stock Limited Quantities Available On DisplayClearance Compare Zero G Rocker Recliner Scarlett Collection Retail Price: $3,000 Presidents Day Sale Price: $1,567 Back in Stock Soon. Reserve Yours Now On Display Compare Power Recliner SS Collection Retail Price: $4,420 Presidents Day Sale Price: $2,517 In Stock Limited Quantities Available On Display color options Compare Power Recliner RC Collection Retail Price: $3,730 Presidents Day Sale Price: $2,137 In Stock Limited Quantities Available On Display color options Compare RECLINER-LIFT Recliner Collection Retail Price: $1,270 Presidents Day Sale Price: $665 Back in Stock Soon. Reserve Yours Now On Display Compare Black Power Recliner Recliner Collection Retail Price: $3,180 Presidents Day Sale Price: $1,662 In Stock Limited Quantities Available Compare Recliner Triple Power Recliner Collection Retail Price: $2,360 Presidents Day Sale Price: $1,235 In Stock On Display Compare Recliner-Power Recliner Collection Retail Price: $2,450 Sale Price: $1,199 In Stock On DisplayClearance Compare Power High Leg Recliner Reclining Chairs Collection Retail Price: $3,530 Sale Price: $1,999 In Stock Limited Quantities Available On DisplayClearance Compare Power Recliner RC Collection Retail Price: $3,460 Presidents Day Sale Price: $1,995 In Stock Limited Quantities Available Compare POWER TRIPLE RECLINER Recliner Collection Retail Price: $1,820 Presidents Day Sale Price: $950 In Stock On Display Compare POWER RECINER Recliner Collection Retail Price: $2,550 Presidents Day Sale Price: $1,330 In Stock On Display Compare Recliner-Lift Recliner Collection Retail Price: $2,360 Presidents Day Sale Price: $1,235 In Stock On Display Compare Power Recliner RC Collection Retail Price: $3,430 Presidents Day Sale Price: $1,947 In Stock Limited Quantities Available On Display color options Compare Blue Power Recliner Recliner Collection Retail Price: $2,820 Presidents Day Sale Price: $1,472 In Stock On Display Compare Recliner - Trumotion Lift Recliner Collection Retail Price: $1,820 Presidents Day Sale Price: $950 In Stock Limited Quantities Available Compare Ghent Recliner Sprintz Collection Retail Price: $5,920 Presidents Day Sale Price: $3,087 In Stock Limited Quantities Available On Display Compare"
}