{
  "url": "https://greenfelt.net/klondike",
  "title": "Klondike Solitaire - Green Felt",
  "text": "Play Klondike Solitaire online, right in your browser. Green Felt solitaire games feature innovative game-play features and a friendly, competitive community. Klondike is a solitaire card game often known purely by the name of Solitaire. It is probably the most well known solo card game. It has been reported to be the most commonly played computer game in recent history, possibly ranking higher than even Tetris. Taking a standard 52-card deck of playing cards (without Jokers), deal one upturned card on the left of your playing area, then six downturned cards (from left to right). On top of the downturned cards, deal an upturned card on the left-most downturned pile, and downturned cards on the rest until all piles have an upturned card. The four foundations are built up by suit from Ace to King, and the tableau piles can be built down by alternate colours, and partial or complete piles can be moved if they are built down by alternate colours also. Any empty piles can be filled with a King or a pile of cards with a King at the top. There are many keys you can use to make your game playing more efficient: - Space - Auto-finish—In foundation games, this moves all the cards it can up to the foundations - z - Undo - x - Redo - n - New Game - g - Replay the same game - f - Flip a card from the stock There is also a card-finder keyboard feature you can use to help you locate cards: - a - Highlight the aces - 1 though 9 - Highlight the cards with the rank pressed - 0 or t - Highlight the tens - d, c, h, s - Highlight the cards with the suit - r, b - Highlight the red or black cards You may combine the rank keys with the suit or color keys. For example, if you hold down the \"5\" key and the \"d\" key then only the 5 of diamonds will be highlighted. \"a\" and \"r\" will highlight the red aces. There are ways to use the mouse to make your game playing more efficient: - Left Click - Move the card to the most logical place (might not be the best move, however) - Left Click in Empty Area - Auto-finish—In foundation games, this moves all the cards it can up to the foundations - Right Click - Undo You can use super moves to make your game playing more efficient. Clicking or dragging a card that isn't immediately accessible will attempt to move all the cards above it in its stack until the move is valid. The effect will be the same as clicking each card. If you cancel the drag or undo the move, all the cards will go back to where they were. Dragging a card or cards to the middle of a stack will attempt to move all the cards above the destination out of the way. The effect is the same as clicking each card. To see where the cards will move, hold the dragged card(s) at the destination for a second. If you decide to move the dragged card(s) somewhere else, just drag them there and the other cards will go back to where they were. Undoing the move will also move the cards back. If you drag a card or cards to the middle of a stack and the cards that move away would be valid to move back on top of the dragged card(s), then they'll slide out of the way and let you just slip the card(s) in."
}