{
  "url": "https://www.countryreports.org/country/Poland.htm",
  "title": "Poland | Culture, Facts & Travel | - CountryReports",
  "text": "What makes Poland a unique country to travel to? Country Description Poland is a stable parliamentary and free-market democracy, and a member of the European Union and NATO. Crime While Poland generally has a low rate of violent crime, the incidence of street crime, which sometimes involves violence, is moderate. Major cities have higher rates of crime against residents and foreign visitors than other areas. Organized groups of thieves and pick-pockets operate at major tourist destinations, in train stations, and on trains, trams, and buses in major cities. Thieves often target overnight trains. Most pick-pocketing on trains occurs while boarding or disembarking. In a common scenario, a group of well-dressed young men surround you in the narrow aisle of the train, jostling and pick-pocketing you as they supposedly attempt to get around you. You should guard your passport, money, credit cards, and cell phone. The number of car thefts and carjacking has significantly declined, but theft from vehicles and attempted highway robberies remain a concern. Be wary of people indicating you should pull over or signaling that something is wrong with your car. If you pull over, you may find yourself suddenly surrounded by thieves from another vehicle. If you encounter someone indicating that there is trouble with your car, continue driving until you reach a safe spot (a crowded gas station, supermarket, or even police station) to inspect your vehicle. There have been incidents of thieves opening or breaking passenger-side doors and windows in slow or stopped traffic to take purses or briefcases from the passenger seat. Remember to keep windows closed and doors locked, and use parking garages and anti-theft devices. You should not leave valuables in plain sight inside vehicles, as this increases the opportunity for theft. U.S. citizens of Asian and African descent have reported being targets of verbal harassment and physical attacks while traveling in Poland. Under Polish law, if asked by Polish police, you must verify your identity by presenting a travel document, a residence permit card, or an identity card issued by the Ministry of Foreign Affairs. Recently, the Border Guards (Stra%u017C Graniczna) have increased random travel document checks on trains originating from or transiting border countries. Border Guards may appear in plain clothes when requesting passports and other travel documents, which are scanned into a handheld scanner for verification. If you are a tourist, this means that you are expected to carry your passport with you. Please ensure the security of your passport while traveling to prevent incidents of pick-pocketing or theft. Keep a copy of your passport biodata page (and any pages with valid visas) in a safe place separate from the passport itself; this can help you when applying for a new passport if yours is lost or stolen. You should change money only at banks or legitimate money kiosks. A legitimate offer to change money by an unknown person on the street is extremely rare and would almost certainly be a scam. Automated teller machines (ATMs) are widely available throughout major cities in Poland. Most Polish ATMs offer instructions in multiple languages and allow access to U.S. bank accounts. The press has reported that criminal organizations have illegally obtained users' ATM card numbers and PIN codes by electronically \"skimming\" the information from victims' cards at public ATMs. Try to use machines at more secure or heavily traveled and monitored locations, such as commercial banks, large hotels, shopping malls, and airports. You should notify your bank of all international travel before you leave the United States, and monitor your personal bank account after traveling. Polish bars and dance clubs are generally safe for the vast majority of visitors. However, as in many cities, people may approach you with offers of illicit drugs, which are against the law in Poland. Be mindful that security personnel at nightclubs could respond more forcefully than at similar venues in the United States. Whereas casinos and gaming establishments are government-regulated, some are affiliated with, or have attracted the interest of, organized crime. Don't buy counterfeit and pirated goods, even if they are widely available. Not only is it illegal to bring such items into the United States, if you purchase them, you may also be breaking Polish or EU law. Criminal Penalties While traveling in Poland, you are subject to its laws, even if you are a U.S. citizen. Foreign laws and legal systems can be vastly different from our own. In some places you may be taken in for questioning if you don't have your passport with you. It is illegal in Poland to take pictures of military buildings and other national security or restricted objects. Driving under the influence could land you immediately in jail. Likewise, riding a bike while under the influence is also illegal and can result in being jailed, paying steep fines and banned from riding a bike in Poland for half a year or more. Criminal penalties in Poland vary from the United States. There are some things that might be legal in Poland, but illegal in the United States, for which you can be prosecuted under U.S. law, such as buying pirated goods. Engaging in sexual conduct with children or using or disseminating child pornography in Poland is a crime prosecutable in Poland and in the United States. If you break local laws in Poland, your U.S. passport won't help you avoid arrest or prosecution. It's very important to know what's legal and what's not wherever you visit. Penalties are severe for possessing, using, or trafficking in illegal drugs in Poland, and you can expect long jail sentences and heavy fines if convicted. If you are arrested in Poland, the authorities are required to notify the nearestU.S.embassy or consulate of your arrest, but this does not always happen quickly. If you are concerned that the Department of State may not be aware of your situation, you should request the policeor prison officials to notify the nearest U.S. embassy or consulate of your arrest. This pertains in particular to dual U.S.-Polish nationals, since Poland does not recognize (although it does not prohibit) dual nationality. A person holding Polish and U.S. citizenship is deemed by Poland to be a Polish citizen. Languages Polish (official) 98.2%, Silesian 1.4%, other 1.1%, unspecified 1.2%; note - data represent the language spoken at home; shares sum to more than 100% because some respondents gave more than one answer on the census; Poland ratified the European Charter for Regional or Minority Languages in 2009 recognizing Kashub as a regional language, Czech, Hebrew, Yiddish, Belarusian, Lithuanian, German, Armenian, Russian, Slovak, and Ukrainian as national minority languages, and Karaim, Lemko, Romani (Polska Roma and Bergitka Roma), and Tatar as ethnic minority languages Medical Facilities and Health Information Adequate medical care is available in Poland, but hospital facilities and nursing support are not comparable to American standards. Physicians are generally well trained, but specific emergency services may be lacking in certain regions, especially in Poland's small towns and rural areas. Younger doctors generally speak English, but nursing staff usually do not. Doctors and hospitals often expect immediate cash payment for health services. Medications are generally available, although they may not be specific U.S. brand-name drugs. Safety and Security The terrorism threat in Poland is low, however, like other countries in the Schengen zone, Poland's open borders with its neighbors allow for the possibility of terrorist groups to enter/exit the country undetected. The latest U.S. Department of State Worldwide Caution should be reviewed as a guide on international and transnational terrorism operations against U.S. targets. Demonstrations are a regular occurrence of the Polish political scene but are, for the most part, orderly and peaceful. Demonstrations regularly occur in Warsaw and are concentrated around Polish government offices, many of which are in close proximity to the U.S. Embassy. During the winter, these activities taper off, but spring and summer witness a large number of such events. Demonstrators are typically vocal but law-abiding, and events involving 15 or more people require permits in advance from the government. The average size of a demonstration in Warsaw last year was several hundred people and occurred, on average, twice monthly. You should be vigilant in protecting your security, bearing in mind that even demonstrations intended to be peaceful may turn violent. Avoid street demonstrations whenever possible. Soccer matches in Poland are often marred by confrontations between opposing fans. Such confrontations occasionally turn violent, and U.S. citizens should exercise caution when attending soccer matches or traveling near sporting venues during events. U.S. citizens should also be aware of the potential for an increase in traffic and crowds after sporting events. As always, we urge you to avoid areas where you see heavy police presence or crowds assembling, to exercise caution if within the vicinity of any large public gatherings, and to stay away from demonstrations. Traffic Safety and Road Conditions While in Poland, you may encounter road conditions that differ significantly from those in the United States. The information below concerning Poland is provided for general reference only, and may not be completely accurate in a particular location or circumstance. You must have an International Driving Permit (IDP), obtained prior to departure from the United States and a U.S. driver's license, in order to drive in Poland. A U.S. driver's license alone is not enough, and U.S. citizens cannot obtain IDPs in Poland. Only two U.S. automobile associations - the American Automobile Association (AAA) and the American Automobile Touring Alliance (AATA) - have been authorized by the U.S. Department of State to distribute IDPs. According to Polish law, an international driver's license is only valid for six months. If you plan to stay for more than six months in Poland, you are required to obtain a Polish Driver's License. Polish roadside services, while not always at American levels, are rapidly improving. The Polish Automobile Association (Polski Zwi%u0105zek Motorowy Auto-Tour, equivalent to AAA) has multilingual operators and provides assistance countrywide 24/7. You can reach them by calling (22) 532-8427, or (22) 532-8433. The police emergency number is 997, fire service is 998, ambulance service is 999, and the general emergency number is 112. Seat belts are compulsory in both the front and back seats, and children under the age of 12 are prohibited from riding in the front seat. Children younger than 12 years old and who are shorter than 4'11\" must ride in a child car seat. You must use headlights year round, at all times, day and night. The use of cellular phones while driving is prohibited except for hands-free models. Making a right turn on a red light is not allowed. Turning right on red with a green arrow is the equivalent of turning right on red in the U.S. Unlike in the United States, the green arrow in that case does NOT give you the right of way. Police will ticket for traffic violations, and fines can be substantial. If you are a non-resident, you are expected to pay fines immediately to the police officer issuing the ticket. You must be prepared to pay in local currency, though in some cases credit cards are accepted. You should note that road fatalities are high in Poland, placing it among the more dangerous places to drive in Europe. There has been a substantial increase in the number of cars on Polish roads and driving, especially after dark, is hazardous. Roads are sometimes narrow, poorly lit, frequently under repair (especially in the summer months), and are often also used by pedestrians and cyclists. The Ministry of Infrastructure has a program called \"Black Spot\" (Czarny Punkt), which places signs at locations with a particularly high number of accidents and/or casualties. The signs have a black spot on a yellow background, and the road area around the \"black spot\" is marked with red diagonal lines. Alcohol consumption is frequently a contributing factor in accidents. Polish law provides virtually zero tolerance for driving under the influence of alcohol, and penalties for doing so (defined as a blood alcohol level of 0.02 or higher) include a fine and probation or imprisonment for up to two years. Penalties for drivers involved in accidents are severe, and can include imprisonment from six months to eight years or, in the case of drivers under the influence of alcohol or drugs, up to twelve years. Within cities, taxis are available at major hotels and designated stands or may be ordered in advance by telephone. Some drivers speak English and accept credit cards. When hailing taxis on the street, you should avoid those that do not have a company name and/or telephone number displayed since these may not have meters and many of them charge significantly more. Do not accept assistance from self-professed \"taxi drivers\" who approach you in the arrivals terminal or outside the doors at Warsaw Airport, but rather use only those that display telephone numbers and a company name and are at designated taxi stands. Unpredictable weather throughout the year can cause problems on the roads. For instance, Poland experienced numerous floods in 2010, during which many bridges were closed and road travel was significantly disrupted. Please monitor local conditions when traveling."
}