{
  "url": "https://www.palumbogriffinshsa.com/",
  "title": "Home - Academy at Palumbo Home and School Association",
  "text": "Welcome! Palumbo’s Home and School Association (HSA) is a volunteer-led, active, collaborative group of families united by a common goal to support the Academy at Palumbo community and to enhance the educational experience of Palumbo’s students. The HSA primarily focuses on community building, fundraising, and advocacy. COMMUNITY BUILDING We build community through volunteer opportunities and events such as our Welcome Back Breakfast for Staff, Student Fall Feast, and Teacher Appreciation to name a few. Families can volunteer their time and share their expertise to support Palumbo. There is something for everyone, and we hope you’ll join us. Academy at Palumbo Familias -- an affinity group for Spanish-speaking families - launched during the 2024-2025 school year. To learn more, click here for Spanish or here for English. FUNDRAISING Fundraising is a critical part of what we do. Most of our fundraising is done through HSA Membership Dues and also our Annual Fund, which we call The Griffin Fund. ADVOCACY The HSA serves the school community by advocating on their behalf regarding issues that impact the wellbeing of the Palumbo school community. Palumbo's HSA is a 501c3. Participating in the HSA provides wonderful opportunities to support our school and to meet other Palumbo families. General HSA Meetings Meetings are open to the Palumbo School Community. Details are provided in the Principal's weekly newsletter. 2025-26 Membership Drive Join Palumbo's Home and School Association! Membership is open to current and incoming Palumbo families. While dues are not required to be a member, dues grant you voting rights and help fund senior scholarships, resources and events for Palumbo students and staff. Dues: $25/year or $100/four years (per family). We accept payment through PayPal or Venmo or CashApp or by check. Please put your name, email, your students name and graduation year in the comments section. To pay by check, please email palumbogriffinshsa@gmail.comand provide your name, email, student name and year your student will graduate. HSA Membership Dues Payment Options Please put your name and email as well as the Palumbo Students Name and Graduation Year in the comments section. Thank you! We look forward to having you join us! If you have any questions regarding the school in general, we recommend you visit theschool website."
}