{
  "url": "https://en.wikipedia.org/wiki/Dnipro",
  "title": "Dnipro - Wikipedia",
  "text": "Dnipro Dnipro[a] is Ukraine's fourth-largest city, with about one million inhabitants.[5][6][7][8] It is located in the eastern part of Ukraine, 391 km (243 mi)[9] southeast of the Ukrainian capital Kyiv on the Dnipro River, from which it takes its name. Dnipro is the administrative centre of Dnipropetrovsk Oblast. It hosts the administration of Dnipro urban hromada.[10] Dnipro has a population of 968,502 (2022 estimate).[11] Archeological evidence suggests the site of the present city was settled by Cossack communities from at least 1524. Yekaterinoslav (\"glory of Catherine\")[12] was established by decree of the Russian Empress Catherine the Great in 1787 as the administrative center of Novorossiya. From the end of the 19th century, the town attracted foreign capital and an international, multi-ethnic workforce exploiting Kryvbas iron ore and Donbas coal. Renamed Dnipropetrovsk in 1926 after the Ukrainian Communist Party leader Grigory Petrovsky, it became a focus for the Stalinist commitment to the rapid development of heavy industry. After World War II, this included nuclear, arms, and space industries whose strategic importance led to Dnipropetrovsk's designation as a closed city. Following the Euromaidan events of 2014, the city politically shifted away from pro-Russian parties and figures towards those favoring closer ties with the European Union. As a result of decommunization, the city was renamed Dnipro in 2016. Following the Russian invasion of Ukraine in February 2022, Dnipro rapidly developed as a logistical hub for humanitarian aid and a reception point for people fleeing the various battle fronts.[13][14] Name Current names Former names - Novyi Kodak 1645–1784 - Yekaterinoslav (also spelled Ekaterinoslav; Russian: Екатеринослав [jɪkətʲɪrʲɪnɐˈslaf]; Ukrainian: Катеринослав, romanized: Katerynoslav [kɐterɪnoˈslɑu̯]) 1784–1796 - Novorossiysk (Russian: Новороссийск [nəvərɐˈsʲijsk]; Ukrainian: Новоросійськ, romanized: Novorosiisk [noworoˈs⁽ʲ⁾ijsʲk]) 1796–1802, briefly renamed during the reign of Catherine II's son, tsar Paul I; however, the previous name was restored by tsar Alexander I after his father's assassination[15][16] - Yekaterinoslav 1802–1918, called Catharinoslav on some nineteenth-century maps.[17] - Sicheslav (Ukrainian: Січеслав [s⁽ʲ⁾itʃeˈslɑu̯]) 1918–1921 (unofficial name)[18] - Yekaterinoslav/Katerynoslav 1918–1926 - Dnipropetrovsk (Ukrainian: Дніпропетровськ [ˌdn⁽ʲ⁾ipropeˈtrɔu̯sʲk]; Russian: Днепропетровск, romanized: Dnepropetrovsk [dʲnʲɪprəpʲɪˈtrofsk]), also Dnipropetrovske (Ukrainian: Дніпропетровське) according to the Kharkiv orthography 1926–2016.[19] The word originates from Дніпро (\"Dnieper River\") + Петровський, after Soviet revolutionary Grigory Petrovsky. Name history The original name of a Ukrainian Cossack city on the territory of modern Dnipro was Novyi Kodak (Ukrainian: Новий Кодак [noˈwɪj koˈdɑk], New Kodak).[20] Also on the territory of Modern Dnipro, the Russian Empire founded Yekaterinoslav (the glory of Catherine).[12] This name was first mentioned in a report to Azov Governor Vasily Chertkov to Grigory Potemkin on 23 April 1776. He wrote \"The provincial city called Yekaterinoslav should be the best convenience on the right side of the Dnieper River near Kaydak...\" (Which referred to New Kodak ). The construction was officially transferred to the right bank in a decree of Empress of Russia Catherine II of 23 January 1784.[16] In the 17th century the city was also known as Polovytsia.[21] In 1918, the Central Council of Ukraine of the Ukrainian People's Republic proposed to change the name of the city to Sicheslav; however, this was never finalised.[22] In 1926 the city was renamed after communist leader Grigory Petrovsky.[23][24] In some Anglophone media Dnipro was nicknamed the Rocket City during the Cold War.[25] The 2015 law on decommunization required the city to be renamed.[23] On 29 December 2015 the Dnipro City Council officially changed the reference of the city naming from referring to Petrovsky to being in honor of Saint Peter,[26] thus making the name consistent with the law without actually changing the name itself. On 3 February 2016 a draft law was registered in the Verkhovna Rada (the Ukrainian parliament) to change the name of the city to Dnipro.[27] On 19 May 2016 the Ukrainian parliament passed a bill to officially rename the city (to Dnipro). The resolution was approved by 247 out of the 344 MPs, with 16 opposing the measure.[28][nb 1][nb 2] Following the renaming of the city the reference to Petrovsky has been removed from institutions named after the city. A notable exception is the name of the surrounding province, which is listed in the territorial structure of Ukraine in the Constitution.[32] Thus until a lengthy and complicated process of amending is carried out, it officially retains the name Dnipropetrovsk Oblast. History Early history Human settlements in current Dnipropetrovsk Oblast date from the Paleolithic era.[33] According to archeological finds, in the Paleolithic period (7—3 thousand BC) human settlements appear near the Aptekarska brook in what is now Chechelivskyi District and on Monastyrskyi Island.[34] A Neolithic stonecrafter's house has been excavated in one of Dnipro's city parks.[33] In the Bronze Age the area was settled by diverse tribes.[33] Traces of Cimmerian settlements during the Bronze Age have been found near today's Taras Shevchenko Park.[34] The area of modern Dnipro was part of the Scythian empire from approximately the 1st century BC until the 3rd century BC.[35][36] During the Migration Period (300–800) nomadic tribes of the Huns, Avars, Bulgarians, and Magyars passed through the lands of the Dnieper region, they came into contact with local agricultural East Slavs.[35] The area of modern Dnipro was part of the Kievan Rus' (882–1240).[35] The region witnessed fighting between the armies of Kievan Rus' and Khazars, Pechenegs, Tork people and Cumans.[35] In the 13th century the Dnieper region was devastated during the Mongol Empire conquest of Kievan Rus'.[35] The area of modern Dnipro city was incorporated into the Mongol's khanate Golden Horde.[37] In the 15th century the area became part of the Kiev Voivodeship (1471–1565) of the Polish–Lithuanian Commonwealth.[37] Archeological finds in today's Dnipro's urban district Samarskyi District suggest that the important river crossing was a trading settlement from at least 1524.[38] In 1635, the Polish–Lithuanian Commonwealth built the Kodak Fortress above the Dnieper Rapids at Kodaky on the south-eastern outskirts of modern Dnipro near the current Kaidatsky Bridge,[20] only to have it destroyed within months by the Cossacks of Ivan Sulyma.[39] Rebuilt in 1645,[20] it was captured by Zaporozhian Sich in 1648.[38] Around the fortress a settlement emerged that became a town in Kodak Palanka (province) of the Zaporizhian Sich called Novyi (New) Kodak .[20] Cossacks often hid the true number of the population to reduce taxation and other obligations, but according to documentary evidence, it can be assumed that the population of New Kodak was at least 3,000 people.[20] The fortress was garrisoned by Cossacks until the Sich, allied with the Ottoman Empire and their Tartar vassals, drove out the encroaching Tsardom of Russia. Under the terms of the Russian withdrawal—the Treaty of the Pruth in 1711—the Kodak fortress was demolished.[38][40] In the mid-1730s, the fortress and Russians returned, living in an uneasy cohabitation with local cossacks.[38] From mid-century they co-existed with the Zaporozhian sloboda (or \"free settlement\") of Polovytsia located on the site of today's Central Terminal and the Ozyorka farmers market.[41][16] In the Russo-Turkish War (1768–1774), the Zaporozhian cossacks allied with Empress Catherine II. No sooner had they assisted the Russians to victory than they faced an imperial ultimatum to disband their confederation. The liquidation of the Sich destroyed their political autonomy and saw the incorporation of their lands into the new governates of Novorossiya.[42] In 1784, Catherine ordered the foundation of new city, commonly referred to at the time as Katerynoslav.[20] In 2001 the seal of Kodak Palanka became the central element of Dnipro's coat of arms and Dnipro's official flag .[20] Imperial city Russian Empire 1776–1917 Ukrainian People's Republic 1917–1918 ∟ autonomous part of the Russian Republic Ukrainian State 1918 Ukrainian People's Republic 1918–1920 Ukrainian Soviet Socialist Republic 1920–1941 ∟ part of the Soviet Union from 1922 Reichskommissariat Ukraine 1941–1944 ∟ part of German-occupied Europe Ukrainian Soviet Socialist Republic 1944–1991 ∟ part of the Soviet Union Ukraine 1991–present Establishment of Catherine's city The first written mention of a town in the Russian Empire called Yekaterinoslav can be found in a report from Azov Governor Vasily Chertkov to Grigory Potemkin on 23 April 1776. He wrote \"The provincial city called Yekaterinoslav should be the best convenience on the right side of the Dnieper River near Kaydak...\" (referring to Novyi Kodak). In 1777, a town named Yekaterinoslav (the glory of Catherine),[12] was built to the north of the present-day city at the confluence of the Samara and Kilchen rivers. The site was badly chosen – spring waters transformed the city into a bog.[41][16] The surviving settlement was later renamed Novomoskovsk.[20][43] The territory of modern Dnipro, despite the modern-day city's size, still has not expanded to encompass the territory of (Chertkov's) Yekaterinoslav of 1776.[38] On 22 January 1784 Russian Empress Catherine the Great signed an Imperial Ukase directing that \"the gubernatorial city under name of Yekaterinoslav be moved to the right bank of the Dnieper river near Kodak\". The new city would serve Grigory Potemkin as a Viceregal seat for the combined Novorossiya and Azov Governorates.[16] On 20 May [O.S. 9 May] 1787, in the course of her celebrated Crimean journey, the Empress laid the foundation stone of the Transfiguration Cathedral in the presence of Austrian Emperor Joseph II, Polish king Stanisław August Poniatowski, and the French and English ambassadors.[44][45] Potemkin's grandiose plans for a third Russian imperial capital alongside Moscow and Saint Petersburg included a viceregal palace, a university (Potemkin envisioned Yekaterinoslav as the 'Athens of southern Russia'[46]), courts of law and a botanical garden,[47] were frustrated by a renewal of the Russo-Turkish war in 1787, by bureaucratic procrastination, defective workmanship, and theft, Potemkin's death in 1791 and that of his imperial patroness five years later.[46] In 1815 a government official described the town as \"more like some Dutch [Mennonite] colony then a provincial administrative centre\".[48] The cathedral, much reduced in size, was completed in 1835.[16] Disputed year of foundation Scholarship concerning the foundation of the city has been subject to political considerations and dispute.[38][49] In 1976, to have the bicentenary of the city coincide with the 70th anniversary of the birth of Soviet party leader, and regional native son, Leonid Brezhnev, the date of the city's foundation was moved back from the visit Russian Empress Catherine II in 1787, to 1776.[38] Following Ukrainian independence, local historians began to promote the idea of a town emerging in the 17th century from Cossack settlements, an approach aimed at promoting the city's Ukrainian identity.[49][50] They cited the chronicler of the Zaporozhian Cossacks, Dmytro Yavornytsky, whose History of the City of Ekaterinoslav completed in 1940 was authorised for publication only in 1989, the era of Glasnost.[51][50] In December 2025 the Dnipro City Council was in an ongoing consulting process with experts to set a new official year of Dnipro's foundation.[4] According to them the official year of founding 1776 \"is a myth of imperial Russia\", and that the city existed many years before 1776.[4] Growth as an industrial centre While into the late nineteenth century the principal business of the town remained the processing of agricultural raw materials,[16] there was an early state-sponsored effort to promote manufacture. In 1794 the government supported two factories: a textile factory that was transferred from the town of Dubrovny Mogilev Governorate and a silk-stockings factory that was brought from the village of Kupavna near Moscow. In 1797 the textile factory employed 819 permanent workers, 378 of whom were women and 115 children. The silk stocking workers, the majority being women, were serfs bought at an auction for 16,000 roubles. Conditions, as Potemkin himself was forced to admit, were harsh, with many of the workers dying from malnutrition and exhaustion.[16] From 1797 to 1802, while serving under the Emperor Paul I as the administrative centre of a centre of the Novorossiya Governorate, the settlement was officially known as Novorossiysk.[15][16] Despite the bridging of the Dnieper in 1796, commerce was slow to develop. 1832 saw the establishment of the small Zaslavsky iron-casting factory, the town's first metallurgical enterprise.[16] Industrialisation gathered apace in the 1880s with the establishment of the first railway connections.[53] Rail construction responded to the enterprise of two men: John Hughes, a Welsh businessman who built an iron works at Yuzovka in 1869–72, and developed the Donbas coal deposits;[41] and the Russian geologist Alexander Pol, who in 1866 had discovered the Krivoy Rog iron ore basin, Krivbass, during archaeological research.[41] In 1884, a railway to supply pig iron foundries in Krivoy Rog with Donbass coal crossed the Dnieper at Yekaterinoslav.[15] It proved a spur to further industrial development[15] and to the creation of the new suburbs of Amur and Nyzhniodniprovsk. In 1897, Yekaterinoslav became the third city in the Russian Empire to have electric trams. The Yekaterinoslav Higher Mining School, today's Dnipro Polytechnic, was founded in 1899.[54] Within twenty years the population had more than tripled, reaching 157,000 in 1904.[55] The immigrants flowing into the city were mainly ethnic or cultural Russians and Jews, with the Ukrainian population remaining rural in this stage of the Industrial Revolution.[56] The Jewish community and the 1905 pogrom From 1792 Yekaterinoslav was within the Pale of Settlement, the former Polish-Lithuanian territories in which Catherine and her successors enforced no limitation on the movement and residency of their Jewish subjects.[57] Within less than a century, a largely Yiddish-speaking Jewish community of 40,000 constituted more than a third of the city's population, and contributed a considerable share of its business capital and industrial workforce.[58] Such apparent strength did not protect the community—members of whom had had the unpopular task of collecting government taxes and recruiting young men for the army[59]— from communal violence.[60] In 1883, three days of rioting destroyed Jewish business, and persuaded many to temporarily leave the city. There was a return of anti–Semitic incitement among the Christian public in 1904, but attacks on community were, at that time, suppressed on the order of a liberal governor.[59] In the widespread social unrest that followed the 1905 defeat in the Russo-Japanese War, the political life of the city was dominated by the revolutionary opposition (including the Jewish Workers Socialist Party and the Bund)[59] and by the insurrectionary spirit of the nascent labor movement. The local czarist authorities were able to ride out the wave political protests and strikes, in part by playing on division between Jewish workers who predominated as clerks and artisans in the city, and Russian workers employed in the large suburban factories.[61] There was a wave of anti-Semitic attacks. With the army intervening against Jewish defense groups, about 100 Jews were killed and two hundred wounded.[59] According to local historian Andrii Portnov, 40% of the local Yekaterinoslav population was Jewish in the years leading up to World War I.[62] The Soviet era War and revolution Directly following the Russian February Revolution, in the night of 3 March O.S (16 March N.S) to 4 March 1917 a provisional government was organised in Yekaterinoslav headed by the (since 1913) chairman of the provincial land administration Konstantin von Hesberg .[63] Also on 4 March a Council of Workers' Deputies was formed.[63] On 6 March the prime minister of the Russian Provisional Government Georgy Lvov removed the governor and the vice-governor of Yekaterinoslav Governorate, temporarily handing these powers to Hesberg.[63] On 9 March a Yekaterinoslav Council of Workers and Soldiers deputies was formed.[63] On 16 May the Council of Workers' Deputies and the Council of Workers and Soldiers merged, to become named the Revolutionary Council in November 1917.[63] All these power structures existed in duality, with Hesberg's provisional government often being at a disadvantage.[63] In 1917 the city saw numerous meetings, rallies, meetings, conferences, congresses and demonstrations by political parties all over the political spectrum.[63] Due to intense political agitation the newly formed factory committees and professional unions by autumn of 1917 mainly supported the Bolsheviks, significantly strengthening their positions.[63] In June 1917 a Central Council (Tsentralna Rada) of Ukrainian parties in Kyiv declared Yekaterinoslav to be within the territory of the autonomous Ukrainian People's Republic (UPR).[15] On 13 August 1917 the first democratic Yekaterinoslav 120 seats city Duma election took place.[63] The Bolsheviks gained 24 seats and the Mensheviks 16, with pro-Ukrainian parties picking up 6 seats.[63] Vasyl Osipov was elected Mayor of the city.[63] Osipov was Mayor until the dissolution of the city Duma in May 1918.[63] On 10 November 1917 a parade of Ukrainian troops was held, organized by the Yekaterinoslav Ukrainian Military Council in support of the Third Universal of the Ukrainian Central Council, the proclamation of the Ukrainian People's Republic.[15] In the November 1917 elections to the Russian Constituent Assembly, the Bolsheviks secured just under 18 per cent of the vote in the Governorate, compared to 46 per cent for the Ukrainian Socialist Revolutionaries and their allies.[64] On 22 November 1917 the Revolutionary Council and the city Duma pledged their allegiance to the Tsentralna Rada.[63] The Bolsheviks then left these organisations.[63] During December, the situation in the city worsened with both sides preparing for military action.[63] On 26 December, the Bolsheviks defied an ultimatum from the Tsentralna Rada and after three days of fighting consolidated their control of the city.[63] On 12 February they declared Yekaterinoslav part of a Donetsk-Krivoy Rog Soviet Republic, but the following month, under the terms of the Treaty of Brest-Litovsk, conceded the territory to the German and Austrian-allied UPR.[65][15] On 5 April 1918 the Imperial German army entered the city. Five hundred remaining Bolshevik Red Guards were publicly executed.[63] The formal tenure of the UPR was brief: on 29 April 1918 intervention by the Central Powers saw the UPR replaced by the more pliant Ukrainian State or Hetmanate. On 18 May 1918 the Hetman of the Ukrainian State, Pavlo Skoropadskyi, ordered the previously nationalized enterprises returned to their former owners, and with the assistance of Austro-Hungarian troops the new authorities suppressed labor protest.[63] On 23 December 1918, following their defeat by the Western Allies and after four days of insurgency within the city, German and Austro-Hungarian occupation forces withdrew. Four days later, Yekaterinoslav was stormed by the anarchist Revolutionary Insurgent Army of Ukraine (the Makhnovshchina), putting to flight forces loyal to the UPR's new Directorate. Over the course of the following year, city was to change hands several more times, contested between the UPR, the Whites (Armed Forces of South Russia), Nykyfor Hryhoriv's peasant insurgents, Makhnovshchina (who returned twice),[66] and the Bolsheviks, who reorganised as the Red Army, finally secured the city on 30 December 1919.[63][67][68] The city had been extensively damaged and the population, which had stood at about 268,000 people in 1917, had dropped to under 190,000.[69] Stalin-era industrialisation In late May 1920 the food supply to Yekaterinoslav deteriorated, resulting in a wave of strikes.[69] In June 1920 Soviet authorities quelled one such protest by arresting 200 railway workers, of which 51 were sentenced to immediate execution.[69] In 1922 the region was incorporated into the Ukrainian SSR, a constituent republic of the Soviet Union. In 1922 the Soviet government ordered that \"all nationalized enterprises with names related to the Company or the Surname of the old owners must be renamed in memory of revolutionary events, in memory of the international, all-Russian or local leaders of the proletarian revolution.\"[71] In 1922 and 1923 the factories were renamed, as well as dozens of streets, alleys, driveways, squares and parks.[71] In 1923 the city council adopted a resolution to organize a competition to rename the city itself.[71] In 1924 a Provincial Congress of Soviets adopted a resolution on renaming the city of Yekaterinoslav to the city of Krasnodniprovsk (and Yekaterinoslav Governorate to Krasnodniprovsk). Following this, many organizations and institutions began to name Yekaterinoslav Krasnodniprovsk in official documents, only to be reminded in the press that the renaming of settlements could only be decided by the Presidium of the Supreme Soviet.[71] In 1926 a provisional District Congress of Workers', Peasants' and Soldiers' Deputies adopted a resolution on renaming Yekaterinoslav to the name Dnipropetrovsk in honour of the All-Ukrainian Congress of Soviets's chairman of the All-Ukrainian Central Executive Committee, Grigory Petrovsky.[24][72][71] Petrovsky was present at this congress and he did \"accept this honour with great gratitude.\"[71] The resolution of the congress was approved by a resolution of the Presidium of the Supreme Soviet dated 20 July 1926.[71] In the 1920s and 1930s dozens of streets, alleys, driveways, squares and parks continued to be renamed in the city, this continued in the 1940s and in subsequent years.[71] By 1927 the industry of Dnipropetrovsk was completely rebuilt, and according to some indicators exceeded pre-war levels.[69] Due to agrarian overpopulation, an influx of unemployed from other settlements, a higher birth rates among other reasons, both employment and unemployment in Dnipropetrovsk rose.[69] In the late twenties, the authorities had to contend with growing labour unrest. \"Do not strangle us, our children are dying of hunger, we have been placed in worse conditions than under the old regime\" read one protest.[73] The city figured prominently in Stalin's Five-Year Plans for industrialisation. In 1932, Dnipropetrovsk's regional metallurgical plants produced 20 per cent of the entire cast iron and 25 per cent of the steel manufactured in the Ukrainian SSR. By the end of the thirties the Dnipropetrovsk region became the most urbanised of Soviet Ukraine with more than 2,273,000 people living in the region and over half a million in the city proper. Dnipropetrovsk became an important cultural and educational centre with ten colleges and a State University.[74] The surrounding countryside was devastated by the policy of forced collectivisation and grain seizures. Peasants had died en masse during the Holodomor of 1932–33.[75] Dnipropetrovsk Oblast in the years 1932–33 lost 3.5 to 9.8 million people,[76] making it one of the most affected areas of the famine.[76] Drawn by employment in the expanding heavy industry, the survivors changed the ethnic composition of the city. The percentage of residents recorded as Ukrainian rose from 36 per cent of the population in 1926 to 54.6 per cent in 1939. The Russian percentage fell from 31.6 to 23.4, and the Jewish share fell from 26.8 to 17.9.[77][78] The city's population during the Interwar period grew rapidly. 368,000 people lived in Dnipropetrovsk in 1932. In the 1939 Soviet Census, this number had grown to more than half a million (500,662 people).[69] Soviet Ukrainization and Korenizatsiya were implemented in Dnipropetrovsk.[69] The Communist party of Ukraine organized special courses in Ukrainian studies.[69] Soviet authorities greatly increased the number of schools, and by the mid-1930s had eradicate illiteracy in the city.[69] New universities were opened.[79] At the end of the 1930s Dnipropetrovsk had 10 higher and 19 special educational institutions.[79] In the 1930s a significant number of new secondary schools and hospitals were built in the city, and city parks were improved.[79] The Great Purge, following the Assassination of Sergei Kirov, also reached Dnipropetrovsk.[69] In 1935 the Dnipropetrovsk NKVD arrested 182 \"Trotskyists\".[69] In 1935, 235 alleged \"internal enemies\" were executed, including a few university rectors.[69] In 1936, 526 people were executed.[69] In 1937, the regional administration of the NKVD killed 16,421 people.[69] Nazi occupation Dnipropetrovsk was under Nazi German occupation from 26 August 1941[81] to 25 October 1943.[82] The city was administered as part of the Reichskommissariat Ukraine. The Holocaust in Dnipropetrovsk reduced the city's remaining Jewish population, estimates for which range from 55,000 to 30,000, to just 702.[83][84] In just two days, 13–14 October 1941, the Germans killed 15,000.[85] Germany operated three prisoner-of-war camps in the city, chiefly Stalag 348 with several subcamps in the region from October 1941 to February 1943, after its relocation from Rzeszów in German-occupied Poland,[86] at which the occupiers are estimated to have killed upwards of 30,000 Soviet POWs,[87] and briefly also the Stalag 310 and Stalag 387 camps.[88] In November 1941 Dnipropetrovsk's population was 233,000. In March 1942 this number had fallen to 178,000.[79] On 25 October 1943 the population on the right-bank of the city numbered no more than 5,000.[79] According to official statistics, in 1945 the population of Dnipropetrovsk had increased to 259,000 people.[79] Post-war closed city As early as July 1944, the State Committee of Defence in Moscow decided to build a large military machine-building factory in Dnipropetrovsk on the location of the pre-war aircraft plant. In December 1945, thousands of German prisoners of war began construction and built the first sections and shops in the new factory. This was the foundation of the Dnipropetrovsk Automobile Factory. In 1954 the administration of this automobile factory opened a secret design office, designated OKB-586, to construct military missiles and rocket engines.[89] The high-security project was joined by hundreds of physicists, engineers and machine designers from Moscow and other large Soviet cities. In 1965, the secret Plant No. 586 was transferred to the USSR Ministry of General Machine-Building which renamed it \"the Southern Machine-building Factory\" (Yuzhnyi mashino-stroitel'nyi zavod) or in abbreviated Russian, simply Yuzhmash. Yuzhmash became a significant factor in the arms race of the Cold War (Nikita Khrushchev boasted in 1960 that it was producing rockets \"like sausages\" ).[89] In 1959, Dnipropetrovsk was officially closed to foreign visitors.[90] No foreign citizen, even of a socialist state, was allowed to visit the city or district. Its citizens were held by Communist authorities to a higher standard of ideological purity than the rest of the population, and their freedom of movement was severely restricted. It was not until 1987, during perestroika, that Dnipropetrovsk was opened to international visitors and civil restrictions were lifted.[91][92] The population of Dnipropetrovsk increased from 259,000 people in 1945 to 845,200 in 1965.[79] Notwithstanding the high-security regime, in September and October 1972, workers downed tools in several factories in Dnipropetrovsk demanding higher wages, better food and living conditions, and the right to choose one's job.[93] Labour militancy returned in the late 1980s, a period in which promises of Perestrioka and Glasnost raised popular expectations.[94] In 1990 two thousand inmates rioted in the women's remand prison in a further of sign of growing unrest.[95] Dissent and youth rebellion In 1959 17.4% of Dnipropetrovsk students were taught in Ukrainian language schools and 82.6% in Russian language schools. 58% of the city's inhabitants self-identified as Ukrainians.[96] Compared with the other 3 biggest cities of Ukraine Dnipropetrovsk had a rather large share of education conducted in Ukrainian. In Kyiv 26.8% of pupils studied in Ukrainian and 73.1% in Russian while 66% of Kyiv residents considered themselves Ukrainian, in Kharkiv these numbers were 4.9%, 95.1% and 49%. In Odesa these numbers were 8.1%, 91.9% and 40%.[96][nb 4] As in the overall Ukrainian SSR, Dnipropetrovsk saw an influx of young immigrants from rural Ukraine.[98] Dnipropetrovsk Oblast saw the highest inflow of rural youth of all Ukraine.[98] According to KGB reports, in the 1960s \"Samizdat\" and Ukrainian diaspora publications began to circulate via Western Ukraine in Dnipropetrovsk. These fed into underground student circles where they promoted interest in the \"Ukrainian Sixtiers\", in Ukrainian history, especially of Ukrainian Cossacks, and in the revival of the Ukrainian language. Occasionally the blue and yellow flag of independent Ukraine was unfurled in protest.[99] The authorities responded with repression: arresting and jailing members of underground discussion groups for \"nationalistic propaganda\".[100] The growing evidence of dissent in the city coincided from the late 1960s with what the KGB referred to as \"radio hooliganism\". Thousands of high-school and college students had become ham radio enthusiasts, recording and rebroadcasting western popular music. Annual KGB reports regularly drew a connection between enthusiasm for western pop culture and anti-Soviet behaviour.[101] In the 1980s, by which time the KGB had conceded that their raids against \"hippies\" had failed suppress the youth rebellion,[102][nb 5] such behaviour was reportedly found in an admixture of Anglo-American\" heavy metal, punk rock and Banderism—the veneration of Stepan Bandera, and of other Ukrainian nationalists, who in the Soviet narrative were denounced and discredited as Nazi collaborators.[104] In an attempt to provide Dnipropetrovsk youth with an ideologically safe alternative, beginning in 1976 the local Komsomol set up approved discotheques. Some of the activists involved in this \"disco movement\" went on in the 1980s to engage in their own illicit tourist and music enterprises, and several later became influential figures in Ukrainian national politics, among them Yulia Tymoshenko, Victor Pinchuk, Serhiy Tihipko, Ihor Kolomoyskyi and Oleksandr Turchynov.[103] The \"Dnipropetrovsk Mafia\" Reflecting Dnipropetrovsk's special strategic importance for the entire Soviet Union, party cadres from the \"rocket city\" played an outsized role not only in republican leadership in Kyiv, but also in the Union leadership in Moscow.[105] During Stalin's Great Purge, Leonid Brezhnev rose rapidly within the ranks of the local nomenklatura,[106] from director of the Dnipropetrovsk Metallurgical Institute in 1936 to regional (Obkom) Party Secretary in charge of the city's defence industries in 1939.[107] Here, he took the first steps toward building a network of supporters which came to be known as the \"Dnipropetrovsk Mafia\". They spearheaded the internal party coup that in 1964 saw Brezhnev replace Nikita Khrushchev as General Secretary of the Communist Party of the Soviet Union and call a halt to further reform.[106] Independent Ukraine In a national referendum on 1 December 1991, 90.36% of Dnipropetrovsk's voters approved the declaration of independence that had been made by the Ukrainian parliament on 24 August.[108] Amidst the economic dislocation and soaring inflation that accompanied the collapse of the Soviet Union, output declined.[109] Although its economic contraction was at a rate below the national average,[110] the Dnipropetrovsk city and oblast witnessed one of the largest population declines of all the regions of Ukraine.[111] By 2021, the city's population, which had stood at over 1.2 million in 1991, had been reduced to 981,000.[112] Young people from Dnipropetrovsk were among the millions of Ukrainians who left the country to find work and opportunity abroad.[113] The continuation into the new century of the chaotic fallout from the collapse of the Soviet Union was symbolized for many in Dnipropetrovsk by two violent episodes. In June and July 2007, Dnipropetrovsk experienced a wave of random video-recorded serial killings that were dubbed by the media as the work of the \"Dnipropetrovsk maniacs\".[114] In February 2009, three youths were sentenced for their part in 21 murders, and numerous other attacks and robberies.[115] On 27 April 2012, four bombs exploded near four tram stations in Dnipropetrovsk, injuring 27 people.[116] No one was convicted. Opposition politicians claimed to see the hand of President Viktor Yanukovych intent on disrupting the October 2012 Ukrainian parliamentary election and installing a presidential regime.[117][118] Euromaidan On 26 January 2014, 3,000 anti-Viktor Yanukovych (Ukrainian President) and pro-Euromaidan activists attempted but failed to capture the Regional State Administration building.[119][120][121][122][123] There were street disturbances[124] and Euromaidan protesters were reported to be beaten up by paid pro-Yanukovych supporters (the so-called Titushky).[125][126] Dnipropetrovsk Governor Kolesnikov called them \"extreme radical thugs from other regions\".[127] Two days later about 2,000 public sector employees called an indefinite rally in support of the Yanukovych government.[128] Meanwhile, the government building was reinforced with barbed wire.[128][129][130] On 19 February 2014 there was an anti-Yanukovych picket near the Regional State Administration.[131] On 22 February 2014, after a further anti-Yanukovych demonstration, Dnipropetrovsk Mayor Ivan Kulichenko, for the sake of \"peace in the city\" left Yanukovych's Party of Regions.[132] Simultaneously the Dnipropetrovsk City Council vowed to support \"the preservation of Ukraine as a single and indivisible state\", although some members had called for separatism and for federalization of Ukraine.[132] On the same day, after street fighting in Kyiv, 22 February 2014, Yanukovych left Ukraine and went into Russian exile.[133] 2014 to 2022 Dnipropetrovsk remained relatively quiet during the 2014 pro-Russian unrest in Ukraine, with pro-Russian Federation protestors outnumbered by those opposing outside intervention.[134][135] In March 2014 the city's Lenin Square was renamed \"Heroes of Independence Square\" in honor of the people killed during Euromaidan.[135][136] The statue of Lenin on the square was removed.[135][137] In June 2014 another Lenin monument was removed and replaced by a monument to the Ukrainian military fighting the Russo-Ukrainian War (2014 – ongoing).[138][139] To comply with the 2015 decommunization law the city was renamed Dnipro in May 2016, after the river that flows through the city.[28][23] By summer 2016 not only was the city renamed, but so were more than 350 streets, alleys, driveways, squares and parks.[140] For example, Karl Marx Avenue, the main street, was renamed Yavornytskyi Avenue in honour of the once neglected city and cossack historian.[141] This was 12 per cent of all of the city's toponymies.[140] Five of the eight urban districts of the city received new names.[140] 2022 Russian invasion of Ukraine In the wake of the Russian invasion of Ukraine on 24 February 2022, and with developing military fronts near Kyiv and to the north, east and south, Dnipro has become a logistical hub for humanitarian aid and a reception point for people fleeing the war. Roughly equidistant from the war's major theatres in the east and the south, the city's location is proving critical for supplying the Ukrainian defence effort.[citation needed] At the same time, its control of a Dnieper River crossing and the opportunity it would provide to cut off Ukrainian forces in the Donbas makes the city a high-value target for the Russians.[13][142] Dnipro is reported as the only city in Ukraine where a volunteer formation has been created under direct control of the Dnipro City Council. It is called the \"Dnieper Guard\" (Варти Дніпра, Varty Dnipra). The mayor of Dnipro, Borys Filatov has dismissed suggestions that the group remained Ihor Kolomoyskyi's \"private army\". Kolomoyskyi has helped with some equipment purchases, but the force performs defence and law and order functions under the leadership of the national police.[143] The Russians first hit Dnipro on 11 March 2022. Three air strikes close to a kindergarten and an apartment building killed at least one person.[144] On 15 March, Russian missiles hit Dnipro International Airport, destroying the runway and damaging the terminal.[145] In the early hours of 6 April, an air strike destroyed an oil depot.[146] On 10 April, a Ukrainian government spokesperson said that the airport in Dnipro had been \"completely destroyed\" as the result of a Russian attack.[147] On 15 July, a Russian missile attack killed four people and injured sixteen others in Dnipro.[148] As part of the derussification campaign that swept through Ukraine following the February 2022 invasion 110 toponyms in the city were \"de-Russified\" from February to September 2022.[149] The renaming started on 21 April when 31 streets connected to Russia were renamed. In May another 20 streets were renamed, followed by 21 more streets and alleys in June 2022.[150] According to Dnipro's Mayor Borys Filatov (speaking on 21 September 2022) \"this is not the end.\"[149] Among other renamings, the Schmidt Street (the street was originally the Gymnasium Street but it was renamed to Otto Schmidt Street by Soviet authorities in 1934[71]) in the center of Dnipro was renamed to Stepan Bandera Street.[149][nb 6] In May 2022 (also) several outdoor objects related to the USSR were dismantled in Dnipro.[152][153] In December 2022 Dnipro removed from the city all monuments to figures of Russian culture and history.[154][nb 7] On 22 February 2023 26 more streets were renamed.[155] Dnipro was hit during the autumn 2022 Russian missile strikes on critical infrastructure.[156] On 10 October three civilians were killed.[157] On 18 October 2022 Russian missile strikes targeted the energy infrastructure of Dnipro.[158] On 17 November 2022 23 people were injured.[159] The attacks continued in 2023.[160] The most deadly of these attacks being the 14 January 2023 missile strike on an apartment building that killed 40 people, injured 75 and with 46 people reported missing.[161] Government and politics Government The City of Dnipro is governed by the Dnipro City Council. It is a city municipality that is designated as a separate district within its oblast. Administratively, the city is divided into urban districts. Presently, there are 8 of them. Aviatorske, a rural settlement located near the Dnipro International Airport, is also a part of Dnipro urban hromada. The City Council Assembly makes up the administration's legislative branch, thus effectively making it a city 'parliament' or rada. The municipal council is made up of 12 elected members, who are each elected to represent a certain district of the city for a four-year term. The council has 29 standing commissions which play an important role in the oversight of the ci"
}