{
  "url": "https://www.pereg-gourmet.com/collections/spices",
  "title": "Spices | Mixed Spices | Herbs Spices | Pure Spices – Pereg Natural Foods & Spices",
  "text": "- Mixed Spices - Za'atar Our signature Za'atar is one of our top requested products. We've heard stories of people enjoying spoonfuls of it directly out of the jar because it... $7.25Sale price $7.25Unit price per - Mixed Spices - Shawarma Bring the aromatic flavors of shawarma to your grilling — no rotisserie necessary! This rich blend of spices, including coriander, cumin, turmeric, & more, is perfect... $7.25Sale price $7.25Unit price per - Mixed Spices - Chicken A blend of sweet paprika, crystalized garlic, cayenne pepper, and a pinch of salt that's created to perfectly season grilled chicken. But don't stop there, this... $7.25Sale price $7.25Unit price per - Mixed Spices - Jerusalem This Israeli style blend of coriander, cumin, allspice, garlic, paprika, and a pinch of salt is perfect for seasoning grilled meats. It's a delectable mix of flavors... $7.25Sale price $7.25Unit price per - Paprika - Sweet Sweet paprika is made with vibrant red peppers, dried & ground into a fine powder. This is our dry variety of paprika (without any added oil... $7.25Sale price $7.25Unit price per - Cumin - Ground Ground cumin powder adds warm, aromatic, earthy flavors perfect for grilling rubs, marinades, and hardy stews.A great way to easily flavor grilled chicken, coat the meat... $6.90Sale price $6.90Unit price per - Mixed Spices For Coffee - Hawaij - Baharat This Turkish-style spice blend is created for making Turkish Coffee at home.Hawaij for Coffee is a luxurious blend of ginger, cinnamon, cloves, and cardamom. The mix... $7.25Sale price $7.25Unit price per - Sumac - Ground The tangy flavor of sumac makes a bright addition to Middle Eastern classics — sprinkle over hummus with a drizzling of fruity olive oil. Create a... $6.95Sale price $6.95Unit price per - Mixed Spices - Kabab Start stockpiling those skewers, with this spice blend you'll be grilling kebabs on the regular. A blend of aromatic garlic, warm cumin, zesty coriander, bright paprika... $7.25Sale price $7.25Unit price per - - Turmeric Powder This golden turmeric powder brings bright earthy flavors to your meal. The vibrant hue is paired with a delightful taste that works wonderfully in various dishes, from... $6.90Sale price $6.90Unit price per - Paprika - Sweet, with Oil Sweet paprika is made with vibrant red peppers, dried & ground into a fine powder. We then blend it with extra virgin olive oil that brings... $7.25Sale price $7.25Unit price per - Cinnamon - Ground A spice rack is not complete without ground cinnamon. Our delightfully fragrant spice is freshly ground from the dried inner tree bark. True cinnamon brings delicious... $6.90Sale price $6.90Unit price per - Paprika - Smoked Starting with premium quality red peppers, then dried to concentrate the flavor, and then smoked over oak wood. The rich smoke embeds the peppers with a... $7.25Sale price $7.25Unit price per - - - Mixed Spices - Curry This Indian-inspired blend of warm, aromatic spices includes turmeric, cumin, ginger, coriander, mustard seeds, and more. It's the perfect spice mix for seasoning poultry, vegetables, and... $7.25Sale price $7.25Unit price per - Garlic - Granulated Granulated garlic is sometimes also called crystalized garlic. A quick way to add a boost of flavor to your meals without peeling and mincing fresh garlic.... $7.90Sale price $7.90Unit price per - Mixed Spices - Everything But The Bagel Mix EVERYTHING BUT THE BAGEL $7.25Sale price $7.25Unit price per - Mixed Spices - Thai Sweet Chili Drawing inspiration from Thai cuisine, we created this balanced blend of sweet and spicy flavors. Punch up the taste of vegetables and meat dishes alike. A savory... $7.25Sale price $7.25Unit price per - Oregano A necessity for Pizza Night, whether you're making marinara sauce from scratch or looking to elevate some delivery, a sprinkling of oregano on top of that melted... $6.60Sale price $6.60Unit price per - - -"
}