{
  "url": "https://techcommunity.microsoft.com/blog/sharepoint_premium_blog/introducing-sharepoint-premium-–-the-future-of-ai-powered-content-management-and/3981076",
  "title": "Introducing SharePoint Premium – the future of AI powered content management and experiences | Microsoft Community Hub",
  "text": "Content is the lifeblood of every organization. It is how great teams collaborate to build better products and services to delight customers. It is how leaders drive process transformation to increase agility and lower costs. And how organizations harness their knowledge to make better decisions and help employees grow. Because of this, more content is being created than ever before – two billion documents daily in Microsoft 365 – so it needs to be organized and managed with robust processes, security and compliance. As the opportunities with AI and Copilot make content even more valuable to the growth of your organization and your employees, this means a comprehensive and innovative content management solution is more valuable than ever. SharePoint is the world’s largest and most flexible cloud content management platform. It powers all of Microsoft 365 – OneDrive, Teams, Syntex, Viva, Loop, Stream and now Microsoft 365 Copilot. SharePoint content is also a primary source for your experiences in Copilot. But it’s more than that. Introducing SharePoint Premium Today we’re excited to introduce the new SharePoint Premium, our advanced content management and experiences platform and our next evolution for Syntex. SharePoint Premium brings AI, automation, and added security to your content experiences, processing, and governance. With SharePoint Premium we’ll be transitioning the services already released as part of Syntex, including SharePoint Advanced Management, to join the growing family of SharePoint services along with brand new content experiences. SharePoint Premium delivers new ways to engage with your most critical content, managing and protecting it through its lifecycle. It also helps you maximize content value with security and structure – and prepare it for Copilot for Microsoft 365, the next-generation AI assistant that is transforming productivity. • Content experiences and solutions – boost employee productivity, improve your business processes by keeping content fresh, enable discovery, and collaborate on hundreds of file types. Optimize critical business document processes like contracts, invoices, SOWs, and more with AI, security, and workflow. • Content processing – organize your content to maximize its value with AI-driven automation to build, classify & tag documents and prepare content for Copilot. • Content governance – actively address oversharing and content sprawl by managing the content lifecycle and control access with simple yet powerful tools. SharePoint today And it’s all driven by SharePoint. SharePoint empowers you to collaborate, inform, and deliver with dynamic sites, personalized news, and secure file sharing. o Collaborate: Empower teams with dynamic sites in Microsoft Teams. Sync and share files, data, and resources securely. o Inform: Publish info & resources on your intranet. Tell your story with beautiful custom sites and personalized, targeted news. o Deliver: Access, manage and store collaborative and transactional content in our flexible high scale cloud platform integrated across Microsoft 365 SharePoint is content management. Hosting managed content in SharePoint enables you to build rich applications that go beyond Microsoft 365 with fully managed and controlled content inside your organization trust boundary – from no code to fully managed solutions. Today, you can extend and develop apps and solutions for SharePoint pages, portals and SharePoint content using a broad range of developer capabilities, including Power Platform, Microsoft Graph APIs, Microsoft Graph Data Connect for SharePoint, SharePoint Framework (“SPFx”) and more. As we announced in May 2023 at the M365 Conference, we’re redefining intranet content by empowering everyone to create new types of SharePoint sites and pages content more easily. o Simpler authoring – we introduced Copilot in SharePoint, a new SharePoint home page, and page coauthoring. You’ll be able to use natural language and AI to create SharePoint pages faster and easier and collaborate with others in real time. o Compelling content – SharePoint is getting a major aesthetic update. You’ll be able to create visually stunning sites and pages that embrace images and videos in new ways to express your brand. o Deeper engagement – with new integrations for SharePoint into email, Teams, and Microsoft Viva you’ll meet your readers where they work and measure the impact. o Flexible platform – our investment in top-notch user experience and developer extensibility means your custom solutions will continue to work through future updates Last year we introduced Microsoft Syntex, our solutions to help you enhance, manage, and extend your content with AI powered workflows for everyone in the organization. And last month we introduced you to our next generation of content experiences in OneDrive, with innovations to help you find, create, and share your content beautifully from any location on any device. We’re making file sharing simpler than ever with a consistent interface across Microsoft for all your file destinations and types with a great experience, secure sharing, and innovative experiences for people, meetings, media and Copilot. Let’s look forward and explore SharePoint Premium. Content Experiences Content platforms need to do more than store files. They need to offer rich solutions that are ready to run on any file, throughout the lifecycle of your critical high value documents. First, we’re extending the power of Office collaboration to our integrated file viewer. With support for over 400 file types, soon you’ll be able to add ink, comments, mentions, tasks and more to any supported file type, just as you do for Office documents today. Annotations in the integrated file viewer SharePoint Premium introduces new solutions to work with high value documents. You can work with contracts, statements of work, orders, invoices and more in the new Business Documents app in Teams. In the app, you can review the full list of high-value documents in a unified view. You’ll get actionable insights like timely alerts for contracts that are expiring soon or need attention. Business docs in Teams And you can build new contracts inside Word, using standard templates that leverage content assembly to fill in key details for new contracts. You can also compare a contract with related contracts using the new AI-driven rules deviation engine, to spotlight changes that may require additional attention or raise risks. Once approved, contracts can be routed for signature using SharePoint eSignature. Information stays within the Microsoft 365 trust boundary, so it doesn’t leave your tenant – and you can engage outside parties to sign and approve the document. You can upload large volumes of high-value documents and the new AI-driven clause analyzer will automatically analyze and distill high risk contracts that require your attention along with risks identified. You can also extend your content to external suppliers, vendors, and customers with our new Document Portal. The Document Portal lets you set up an easily accessible external site, branded to match your organization’s look and feel, integrated with consumer or organizational identities so you can collaborate on selected documents with confidence. Content Processing As part of Microsoft Syntex, we’ve given you new ways to use AI to classify, tag, secure the documents you have and ensure that new documents are built with automated templates to create content at scale. Enriching content with security and structure is one of the best ways to optimize workflows and ground content for new AI experiences like Copilot. SharePoint eSignature securely digitizes your document approval workflows. It will be generally available and rolling out through the first quarter of 2024, beginning with tenants in the United States. And if your organization currently uses other eSignature services, we’re also excited to announce Adobe and DocuSign as our SharePoint eSignature launch partners. Third-party integration with Adobe Acrobat Sign and DocuSign will be generally available in early 2024. Today, services such as document processing, content assembly, optical character recognition, image processing and taxonomy tagging have all reached general availability under the Syntex brand, and going forward will be part of SharePoint Premium. We’re also pleased to announce the following new pay-as-you-go services for SharePoint Premium will be generally available by the end of December 2023: • Translation for files and Stream video – convert files and Stream video transcripts among dozens of supported languages, automatically and at scale. Today we’re also announcing translation services for Stream video in SharePoint and new AI powered video cleanup that automatically removes pauses and fillers in recordings. There will be even more coming in the first half of 2024: • Autofill columns -allow you to dynamically add a new column to a document library and use AI to automatically fill in discovered values • PII detection – flag files containing personally identifiable information (PII) such as addresses, phone numbers, credit card details and more. • Multilabel classifier – run a single AI model to automatically set content type and determine the right model to apply for full data extract and analysis, rather than running multiple models to find the best match. • Redaction – Find and remove visibility for select sensitive information, such as names, addresses, social security numbers, from content viewing. Autofill columns These capabilities can be used individually and in bulk to transform how content is created, processed, and discovered. Additionally, today we’re announcing the availability of Microsoft Graph APIs for SharePoint Premium, allowing you to integrate document processing, content assembly and related services to your own custom apps. All these services are available to all Microsoft 365 users with no additional licensing required on a pay-as-you-go basis. Soon we’ll align these capabilities under the SharePoint Premium brand. Pricing is available here. Additionally, starting January 2024, we are running a limited time promotion that will allow customers of pay-as-you-go content processing to get a small portion of their monthly capacity free, before charges apply to additionally processed content. This promotional program which will run for a period of six months will allow you to try these services and understand how they enhance your content. Content governance With more content from more workloads, it’s crucial to make sure the right information is shared, and sensitive information isn’t accidentally overshared or exposed in search or Copilot. SharePoint Premium extends traditional IT controls for content and access governance to content owners and creators to manage content at scale throughout its lifecycle. Let’s look. Overshared sites and content can cause unauthorized access and operational risk for organizations. Data Access Governance (DAG) insights can help. DAG reports provide a top-level view of potentially overshared sites filtered by sharing policy, Teams-connected sites, sensitivity labels, privacy, and more. And sites for high value business content can also be highlighted since those often require more stringent policies and reviews. Data Access Governance reports Reports are just part of the process. With SharePoint Premium, IT will be able trigger site access reviews with content owners for potentially at-risk content, asking them to review access, making needed changes and confirming that sites are being properly shared. Site Access Reviews For overshared sites, you can enable the new Restricted Access Control policy specifying the security groups that should be allowed access, regardless if files were shared directly. AI can transform not only productivity, but also governance and administration. AI-driven policy recommendations can compare a sample set of sites with well-governed access policies to other sites across the tenant, semantically matched, and then recommend optimal access policies. On the other hand, Content Event Insights allow you to find “interesting” moments in the content lifecycle, such as high-volume sharing or large download volumes. Content Event Insights also provide important context, such as impacted users and specific files involved. We’re also accelerating admin productivity with AI. You’ll soon be able to use Copilot in the SharePoint admin center to find sites with issues like oversharing, missing classifications, or inactivity – and use Copilot to help build the right policies to manage access, classification, and archiving. Microsoft 365 Archive Maximizing the value of your content includes managing storage costs and protecting information from external risks throughout its lifecycle. Announced earlier this year, Microsoft 365 Archive lets you manage storage costs while keeping information architecture update. You can extend SharePoint Premium policies for out-of-date content to move older sites to Microsoft 365 archive storage. Archive preserves the full richness of OneDrive and SharePoint content with versions, metadata, and security. It transfers the file at rest to multiply redundant storage inside the Microsoft 365 trust boundary. Archived content is removed from direct end user access and search, but all archived content keeps its security and retention policy. Admins can still search for it and execute compliance actions, such as eDiscovery or record disposal. And if needed, content can be swiftly returned to Microsoft 365 “hot” storage. Microsoft 365 Archive is available in public preview starting today. Pricing is substantially less than traditional Microsoft 365 hot storage, and you only pay for storage usage over and above your allocated Microsoft 365 storage. Microsoft 365 Backup Protecting vital data from disasters like ransomware attacks requires backup. Microsoft 365 Backup, and compliant solutions from partners like AvePoint, Cohesity, Commvault, Rubrik, Veeam, and Veritas, can provide you with unprecedented backup and recovery speed, scale, and reliability. Microsoft 365 Backup will roll out to paid public preview later in 2023 and is expected to reach general availability in the first half of 2024. Learn more in today’s blog post on Microsoft 365 Backup. Availability You can start using SharePoint Premium today: • Content processing services like document processing, content assembly, OCR, eSignature and more are already generally available under the Syntex brand on a pay-as-you-go basis to most Microsoft 365 plans. • You can also purchase our content governance today under the SharePoint Advanced Management (“SAM”) brand. Services available now under the Syntex brand will be moving to the SharePoint Premium brand in 2024. SharePoint Premium will include two licensing models: • Content processing services, such as document processing, eSignature, PII detection, autofill columns, content assembly, translation and image processing will be available on a pay-as-you-go basis to most Microsoft 365 plans. • New capabilities such as Business Documents app, Documents Hub, and the enhanced file viewer, as well as “SAM” will be available as seat licensed services you can add to Microsoft 365 plans, with pricing to be announced at GA in 2024. Microsoft 365 Archive is available today in paid public preview, and Microsoft 365 Backup will also be available in paid public preview by the end of 2023. We’ve previously shared updates on repository services – a headless version of SharePoint that allows developers to use backend capabilities such as version, sharing, search, coauthoring retention and sensitivity to content in custom apps. We’ll have more updates on next steps for using repository services with SharePoint content before the end of 2023. We’ll bring SharePoint Premium to broad availability in the first half of 2024. Both SharePoint Premium seat licenses and PayGo services can be used independently and combined to meet your business requirements. Getting Started SharePoint Premium already has thousands of customers from our initial introduction of Microsoft Syntex. One of those is KPMG UK, who’s using SharePoint Premium to optimize content classification and streamline their tax and advisory client operations. SharePoint Premium and our other related content management solutions are supported by a large and growing network of partners in the Microsoft Content AI Partner Program. Visit our site to learn more about how our partners can help you – or, if you’re a partner, how to apply. Want to learn more? Please join me with members of the product teams for our Ignite session at 4pm, November 16, 2023 - Transforming content experiences with Microsoft SharePoint Premium. The session is now available on demand: In addition, be sure to add the following activities to your backpack (all times PST): • Product roundtable: The future of content management in the AI era with Microsoft Syntex (15 Nov – 11:45am) • Product roundtable: Secure document lifecycle in Microsoft 365: Syntex eSignature (16 Nov – 11:45am) • Product roundtable: OneDrive Sync and Deployment (15 Nov – 2:45am) • Product roundtable: Microsoft Stream and Clipchamp (15 Nov – 4:00pm) • Demo theater (in-person only): Enhance your content value with Microsoft Syntex content management innovations (15 Nov – 11:45am) • On-demand session: Securely digitize document workflows with eSignature in Microsoft 365 If you’re at Ignite in-person, connect with our experts in The Hub to ask questions and learn more about our latest updates and announcements daily from 11:00am – 6:00pm. Resources We have more details available online: • You can start learning more about deploying and using SharePoint Premium on the Microsoft Adoption Hub. • Activation and pricing details for Microsoft 365 Backup and Microsoft 365 Archive. • Learn more about Microsoft Content Management solutions There’s even more coming to SharePoint Premium in the coming months. We’ll continue to provide updates here in the Microsoft Tech Community. If you’d like to be the first to learn as we release new services and updates, sign up for our SharePoint newsletter. Thanks again for joining us on the journey from SharePoint through Syntex and on to SharePoint Premium. We can’t wait to see what the future holds for content management and experiences."
}