{
  "url": "https://www.forhorizon.com/faqs/",
  "title": "FAQs - Horizon Adult Health Care",
  "text": "Who is eligible for your services? Eligibility varies slightly by program, but generally, our services are designed for older adults who need extra support to remain safe and independent at home. For Horizon Adult Day Health and Home Care, participants may require help with daily activities, medical care, or social connection. For Horizon PACE, participants must be 55 or older, live in our service area, and be certified by the state as eligible for nursing home care, but prefer to remain at home. What insurance and types of payments do you accept? We accept Medicaid, Medicare, most private insurance plans, and private pay. PACE covers all Medicare and Medicaid services if participants are eligible for both. For other Horizon services, coverage and payment options may vary by location—our team is happy to help navigate your options. How do I determine which service(s) are best for my loved one? We’re here to help. Start with a quick call to our care team or complete our online contact form. We’ll talk through your needs and recommend services that best fit your situation—whether it’s adult day health, home care, home health, or the comprehensive PACE program. How can I arrange a tour? We’d love to meet you. Contact us through our website or call your local Horizon center to schedule a tour. We welcome families to see our facilities, meet our team, and learn more in person. How does Horizon Adult Day Health differ from a nursing facility? Our Adult Day Health Centers are designed for daytime support only. Participants return home at night. We provide meals, medical care, personal care, activities, and transportation—while caregivers get a break and peace of mind. Can our loved one attend Horizon Adult Day Health on a flexible schedule? Yes. You can choose the days and hours that work best for your family—full-time, part-time, or temporarily. We also support short-term needs, such as post-surgery recovery. How is PACE different than health insurance? PACE (Program of All-Inclusive Care for the Elderly) goes beyond insurance. It combines medical care, home care, prescriptions, transportation, and even meals—coordinated by one team, all in one place. It’s complete care, not just coverage. Do we have to switch doctors if our loved one enters the PACE program? Yes. Once enrolled in PACE, participants receive care from a dedicated team that includes physicians, nurses, therapists, and specialists within the PACE program. This integrated model ensures coordinated, personalized care. How are you licensed? Horizon Health and Horizon PACE programs are licensed and regulated by the Commonwealth of Kentucky and the Centers for Medicare & Medicaid Services (CMS). We meet all required state and federal standards for healthcare and adult day services. Are you hiring? Yes! We’re always looking for compassionate people to join our team. Click here to see open positions and apply."
}