{
  "url": "https://medicaid.georgia.gov/programs/third-party-liability/health-insurance-premium-payment-program-hipp",
  "title": "Health Insurance Premium Payment Program (HIPP) | Georgia Medicaid",
  "text": "Health Insurance Premium Payment Program (HIPP) Georgia Medicaid members who are employed may be eligible for health insurance premium assistance through a Medicaid program called the Health Insurance Premium Payment Program (HIPP). Working Medicaid members who cannot afford to pay the premiums for their employer group health plan may be eligible for HIPP if it is determined to save money for the Medicaid agency. The Medicaid agency may save money by paying the health insurance premium of the Medicaid family if there is a person(s) in that family with a lot of medical bills. HIPP does not pay coinsurance or deductibles. If approved for the HIPP program, the Medicaid member must enroll or, if already enrolled, remain in the employer's health insurance plan. Once it is determined that a Medicaid member is eligible for HIPP, premium payments to the employer or reimbursement to the employee will begin upon the completion of the HIPP application and verification process. HIPP participants must continue to be Medicaid members and meet the cost-saving rules to continue to be eligible for the HIPP Program. Please keep in mind that enrollment in Medicare and/or any of the following private Care Management Organizations (CMO), such as Amerigroup Community Care, CareSource, or Peach State Health Plan excludes your participation in the Health Insurance Premium Payment Program (HIPP) premium reimbursement program. If you are eligible and approved for HIPP while enrolled in a CMO, you will be disenrolled from the CMO and enrolled in the Fee-for-Service (FFS) traditional Medicaid program. Under FFS Medicaid, the State of Georgia pays providers directly on a per-service basis. We encourage you to compare the benefits and services offered to determine what best suits your family’s needs. To determine whether you qualify for HIPP, contact your Medicaid worker at your local County Division of Family and Children Services (DFCS) and ask about the HIPP program. If you would like additional information about the HIPP program, please call Gainwell Technologies HIPP Unit for HIPP Application and HIPP Eligibility requirements. For further assistance with our HIPP program, you can reach the Georgia Department of Community Health via e-mail at [email protected]. Apply Now or Renew Online The Georgia HIPP Program has now developed a new, faster way for individuals to apply for or renew their HIPP benefits by submitting their information online. Please click the button below."
}