{
  "url": "https://support.google.com/youtube/answer/9080341?hl=en",
  "title": "Premiere a new video - YouTube Help",
  "text": "YouTube Premieres let you and your viewers watch and experience a new video together in real time. Create buzz for your Premiere by sharing the watch page so viewers can set reminders, chat, and leave comments. Create a Premiere Viewers can watch the Premiere on any platform like computer, iPhone, iPad, Android, and mobile web. - Sign in to YouTube Studio. - At the top, click Create Upload videos. Note: Shorts aren't supported for Premieres. - Select your video to upload and enter video details. Note: 360/vr180 or an output greater than 1080p isn’t supported for Premieres. - To immediately premiere the video, click Save or publish Public Set as instant Premiere. The video will premiere when the video finishes processing. To schedule the premiere for later, click Schedule Enter a date and time Check Set as Premiere. - To choose a countdown theme and countdown length, click Set up Premiere. - Click Done or Schedule. Tip: You can also create a Premiere when uploading a video from the YouTube app. From the “Set visibility” page, choose Set as Premiere. What happens when you create a Premiere Before your Premiere starts A public watch page is created for your video to eventually premiere on. You can share the watch page URL since the watch page is public before the Premiere begins. Premieres show up across YouTube just like regular uploads. You'll find them on search, the homepage, and video recommendations. Anyone can come to the watch page and set a reminder, leave a comment, or chat (also give Super Chats if turned on). If you've uploaded a trailer, it'll play. Note: If your account has a Community Guidelines strike, your Premiere won’t publish during the penalty period. Your Premiere is set to “private” for the penalty period duration, and you have to reschedule it when the freeze period ends. Learn more about Community Guidelines strike basics. Watch page overview During your Premiere A countdown theme will begin when scheduled for the duration that was chosen. If the Premiere was set to start at 12pm, the countdown will start at 12pm. When the countdown is over, viewers watch the video together in real time. Viewers can rewind the video, but cannot forward past what’s been shown live. You and your viewers can continue to interact in the comments and live chat. After your Premiere ends After your video premieres, it stays on your channel as a regular upload. The countdown theme won’t be included in your video. Chat replay is available for viewers who want to experience the Premiere chat after it has ended. From YouTube Studio, you can also use YouTube Analytics to see how your Premiere performed. The view count from the Premiere will transfer to the video afterwards."
}