{
  "url": "https://superuser.com/questions/329112/where-are-the-user-profile-directories-of-google-chrome-located-in",
  "title": "windows 7 - Where are the user profile directories of Google Chrome located in? - Super User",
  "text": "Where are the user profile directories of Google Chrome located in? It may seem like a very simple question, but I couldn't find it. I checked inside %APPDATA%, but there were noting relevant there. My OS is Windows 7 Ultimate x64 SP1. 6 Answers %APPDATA% by default (as far as I am aware) takes you to the Roaming App Data. Chrome resides in your Local App Data (%LOCALAPPDATA% ). You will find Chrome's User \"stuff\" in: %LOCALAPPDATA%\\Google\\Chrome\\User Data\\ To get a straight answer, type chrome://version/ in the address bar of Chrome. Your complete, ready to copy-and-paste profile path will be there, under Profile Path, along with other useful info about your chrome install. Windows Vista / Windows 7 / Windows 8: %LOCALAPPDATA%\\Google\\Chrome\\User Data\\ Windows XP: %USERPROFILE%\\Local Settings\\Application Data\\Google\\Chrome\\User Data\\ For more info (Mac, Linux), refer to Google Support → Create a new browser user profile. User profiles are stored in User Data Directory and it vary depending on the operating system. The easiest way is to navigate to chrome://version and look for the Profile Path field. Example (Windows): - [Profile Path] C:\\Users\\Alice\\AppData\\Local\\Google\\Chrome\\User Data\\Default - [User Data Dir] C:\\Users\\Alice\\AppData\\Local\\Google\\Chrome\\User Data Haven't seen this mentioned. Profile folders on the system aren't named the same as the profiles in chrome, the folders remain named as \"default\", \"Profile1\", etc. In each directory is a Preferences file that can be opened in a text editor. Search \"name\" (including the quotes) and it should be right next to what that particular profile is named in Chrome. Just another way to find which profile directory associates to which chrome profile. Why chrome can't just rename the dirs....🤷♀️ - Got sources? What is the name of the preferences fileuser4951– user49512024-04-24 13:09:39 +00:00Commented Apr 24, 2024 at 13:09"
}