{
  "url": "https://exame.com/pop/quando-e-o-carnaval-em-2026/",
  "title": "Quando é o Carnaval em 2026? | Exame",
  "text": "Rio de Janeiro (RJ), 03/03/2025 – Beija-Flor de Nilópolis desfila no segundo dia de carnaval do grupo Especial na Marquês de Sapucaí, na região central do Rio de Janeiro. Foto: Tomaz Silva/Agência Brasil (Tomaz Silva/Agência Brasil) Redação Exame Publicado em 26 de janeiro de 2026 às 11h53. O Carnaval já chegou a alguns lugares do Brasil. Com blocos de rua já ocorrendo no Rio de Janeiro, em São Paulo, na Bahia e em Recife, por exemplo, as celebrações carnavalescas não precisaram esperar o feriado de fato chegar. Mesmo com o festejo já ocorrendo, a data oficial do Carnaval de 2026 é apenas terça-feira, 17 de fevereiro. A folia começa no sábado, 14, e se estende até a Quarta-Feira de Cinzas, 18. O Domingo de Páscoa é o principal feriado religioso do calendário católico. Ele define todas as outras datas comemorativas relacionadas a ela, como a Semana Santa, o Domingo de Ramos e o Carnaval. A Páscoa é sempre no primeiro domingo depois da primeira lua cheia pós-equinócio, segundo determinado pela Igreja Católica Apostólica Romana no Primeiro Concílio de Niceia, em 325 d.C.. Em 2026, ela ocorrerá no dia 5 de abril. A partir disso, a terça-feira de carnaval deve ocorrer 40 dias antes do Domingo de Ramos, o último da Quaresma, que este ano ocorre no dia 29 de março. Apesar da tradição, a segunda e a terça-feira de Carnaval não são feriados nacionais. Isso significa que as empresas podem exigir expediente normal, sem necessidade de pagar horas extras ou conceder folga compensatória. No entanto, estados e municípios podem decretar feriados ou pontos facultativos. No estado de São Paulo, o Carnaval não é feriado. O governador Tarcísio de Freitas decretou ponto facultativo para servidores estaduais nos dias 3 e 4 de março (segunda e terça-feira). Já na Quarta-feira de Cinzas (5 de março), o expediente começa ao meio-dia. No setor privado, o trabalho na segunda e terça-feira de Carnaval segue normalmente, a menos que a empresa decida conceder folga ou que haja previsão em acordos coletivos. No Rio de Janeiro, a terça-feira é feriado estadual garantido pela Lei 5243/2008. Já a segunda-feira é ponto facultativo, assim como a Quarta-feira de Cinzas, em que o expediente costuma ser retomado após as 14h. A quarta-feira de cinzas não é considerada um feriado nacional, já que não existe nenhuma lei que determine isso. Porém, pela popularidade da festividade, é comum as próprias empresas estipularem ponto facultativo em parte do dia. O ponto facultativo se aplica apenas ao setor público. Quando decretado, servidores são dispensados do trabalho sem prejuízo na remuneração. No setor privado, as empresas não são obrigadas a conceder folga, já que o dia não é considerado feriado. Se a empresa exigir expediente e o trabalhador faltar sem justificativa, a ausência será considerada falta injustificada, resultando em desconto no salário e no descanso semanal remunerado."
}