{
  "url": "https://www.loacker.com/int/en/products/world-of-wafers",
  "title": "World of wafers",
  "text": "Loacker Classic, incomparable goodness since 1925. There is no magic formula – just a perfect composition of Loacker's Classic, which have been riding high for over 90 years, like the most exciting new thing on the market. Superb ingredients, exclusive recipes, meticulous packaging and absolute convenience make the Classic the flagship product of the Loacker company. Small in size, great in goodness What's great is that there's always room for Loacker Minis in your gym bag, in your briefcase, or in your kids' backpacks. And it's a place of honor! Give it a thought on your way out – remember to plan the most delectable moments, so that you can give your best throughout the day. Always individually wrapped, you will find Loacker Minis in practical bags: 120g (12 Minis), 150g (15 Minis) or 200g (20 Minis). A bar of pure pleasure to have with you at all times You may be in the office or at the gym, midway through a shopping spree or home at last, relaxing on your sofa, but one thing is certain: when the time comes to pick yourself up a bit, nothing's better than a good Loacker Snack (17.2g). At any age, at any time, you can always appreciate the fragrance of the wafers and the smoothness and delicacy of the layers of cream filling. Maxi, Loacker goodness in size XL If you're thinking that this must be the most generous of all Loacker wafers, you'll be proved right as soon as you taste one. Just try: it'll make you tingle with excitement and hope that it will last forever. Bite after bite, layer after layer, Loacker Maxi will appease the senses and have you humming with pleasure. Bite-size bliss It will be love at first sight when you come across the highly original format of one Loacker specialty: Quadratini. Tempting when you see them and irresistible when you taste them, Quadratini express the essence of Loacker's passion for goodness in a single bite. Just taste one, and you'll see. They are perfect for those who just love goodness in its most genuine form. Napolitaner Chocolate Vanilla Dark Chocolate Cocoa & Milk Double Choc Lemon Coconut Raspberry-Yogurt Blueberry-Yoghurt Matcha Green tea Tiramisù Cappuccino Espresso Peanut Butter The refined freedom of giving in to pleasure Loacker presents Thins, the thinnest, crispiest goodness in a wafer. Thins are taste in its purest, most contemporary form, and the ideal snack for those who wish to indulge in mindful pleasure. Each finger will amaze you with the extraordinary lightness of its two layers of crispy wafer that embrace a delicious layer of finest cream filling. Loacker on ice – much more than an ice cream wafer Sometimes, just a small detail will make a wonderful moment truly perfect. Try to imagine an ice cream decorated with a traditional wafer: it will be good, of course, but if you really want to raise the level of pleasure, then try a Loacker ice cream wafer. Pair it with your favorite ice cream, mix the two pleasures, and enjoy an all-round experience like you've never had before. Mouth-watering lightness At some point, you'll have had that sudden desire for something that's good but not filling – something delicious but also light. In Loacker Sandwich you'll find the pleasure you're looking for. Just taste and you'll see: two thin layers of crispy wafer a layer of mouth-watering cream filling between them. Wafers and chocolate: a heavenly match Loacker Chocolaterie offers a variety of flavors that celebrate the richness of chocolate, the delightful crunch of wafers, and the creamy texture of our fillings. Designed to delight those who appreciate the finer things in life. Chocolate-covered and creamy – making every moment a delight Just a taste is all it needs to appreciate the generosity of Loacker Gardena, the specialty that doesn't skimp on creamy softness and that intensifies the pleasure of every break. Let yourself go to this extraordinarily rich combination of cream filling coupled with no fewer than five layers of crispy wafer, all covered in a layer of milk chocolate. The only real problem you'll have is choosing which of the delicious flavors you prefer. Fiber-rich pleasure, wholegrain goodness If just the thought of a 100% natural treat is a joy in itself, the moment you take the crispy Loacker Multigrain wafers with spelt, wheat and oats to your lips, you will find yourself on a journey of the senses unlike anything you’ve ever experienced. Less sugar, more joy Less sugar and sustainably sourced ingredients are our response to a desire for goodness coupled with well-being. Our new Loacker 30% Less Sugar wafers convince with the same 100% natural Loacker taste using less sugar and no sweeteners."
}