{
  "url": "https://www.merriam-webster.com/dictionary/good",
  "title": "GOOD Definition & Meaning - Merriam-Webster",
  "text": ": containing less fat and being less tender than higher grades—used of meat and especially of beef gsports (1) of a serve or shot: landing in the proper area of the court in tennis and similar games The serve was good. (2) of a shot or kick: successfully done (basketball) The first foul shot was good but she missed the second one. (American football) The kick was good from 45 yards. The kick was no good. [=was missed] hinformal (1) : having everything desired or required : content and not wanting or needing anything further \"Do you want anything else to drink?\" \"No, thanks, I'm good.\" Are we still good for lunch tomorrow? [=are we still going to have lunch together as planned?] Does anyone have anything else to discuss, or are we good? [=are we done talking?] \"I have had girlfriends say, 'Hey, you wanna go walking?' And I'm just not interested. I'm like 'Uh, no, I'm good.' But they keep inviting me!\"—Laila Ali \"I feel good\" and \"I feel well\" are both standard in English, but some insist that only \"I feel well\" is correct. Part of the opposition to \"I feel good\" likely stems from a false belief that good only applies to morality and not to physical well-being, though no one disputes the meaning of a phrase like \"in good shape.\" Another objection to \"I feel good\" is that good is considered more properly an adjective, and that a verb like feel should be followed by an adverb, like well. While good does function as an adverb in phrases like \"things are going good,\" the use is markedly informal; \"things are going well\" is the phrase typically used in carefully edited text. But the verb in \"I feel good\" is of a distinct variety: here, feel is a linking verb, which means that it is commonly modified by an adjective feeling proud/confident it feels smooth rather than an adverb. Both well and good are adjectives when they follow feel to express a meaning of good health, and both are grammatically correct. In \"I feel good\" there is often a connotation of good spirits in addition to good health, but the two phrases are otherwise synonymous. : something that possesses desirable qualities, promotes success, health, or happiness, or is otherwise beneficial … it is only by arming every hand with a ballot,—with the right to have a voice in the policy of the state,—that the greatest good to the greatest number could be attained.—W. E. B. Du Bois Adverbial good has been under attack from the schoolroom since the 19th century. Insistence on well rather than good has resulted in a split in connotation: well is standard, neutral, and colorless, while good is emotionally charged and emphatic. This makes good the adverb of choice in sports. \"I'm seeing the ball real good\" is what you hear —Roger Angell In such contexts as listen up. And listen good—Alex Karras lets fly with his tomatoes before they can flee. He gets Clarence good—Charles Dickinson good cannot be adequately replaced by well. Adverbial good is primarily a spoken form; in writing it occurs in reported and fictional speech and in generally familiar or informal contexts. Adjective You'll need better tools for this job. The car is in good condition. There are some good restaurants in this neighborhood. I'm afraid your work is just not good enough. Keep up the good work. “Would you hire her again?” “Yes, I would. She does good work.” The food was good but not great. He has done good but not outstanding work. Did you have a good time at the party? We're expecting good weather for the weekend. Noun the battle of good versus evil Teachers can be a strong force for good. the difference between good and bad They had to sacrifice lesser goods for greater ones. What is life's highest good? Parents must teach their children the difference between the good and the bad. She believes that the good go to heaven when they die and the bad go to hell. Only the good die young. She believes there is some good in everyone. Adverb Things have been going good lately. The team is doing good this year. “How did you hit the ball today?” “Good.” The other team whipped us good. Recent Examples on the Web Examples are automatically compiled from online sources to show current usage.Read More Opinions expressed in the examples do not represent those of Merriam-Webster or its editors. Send us feedback. Adjective Collections and designers put their best foot forward, delivering high-caliber collections — some were uplifting, others were thought-provoking, most were both.—Laure Guilbault, Vogue, 30 Jan. 2026 For investors, who have missed the latest rally, does the pullback offer a good entry point?—Lee Ying Shan, CNBC, 30 Jan. 2026 Noun The president directed Commerce Secretary Howard Lutnick to determine whether any foreign adversaries directly or indirectly sell goods or oil to Cuba.—David Zimmermann, The Washington Examiner, 30 Jan. 2026 Even so, economists pointed to an apparent shift in household preferences, with consumers increasingly allocating spending towards services rather than goods.—Anniek Bao, CNBC, 30 Jan. 2026 Adverb Chris Hemsworth, then, almost as good-looking as GNev himself, with his slightly dowdy brother Luke cast as good old Phil.—Jack Lang, New York Times, 22 Jan. 2026 Young people have greater access to college at all levels and are prepared for good-paying jobs through apprenticeships.—The Editorial Board, Oc Register, 9 Jan. 2026 See All Example Sentences for good Word History Etymology Adjective, Noun, and Adverb Middle English, from Old English gōd; akin to Old High German guot good, Middle High German gatern to unite, Sanskrit gadhya what one clings to First Known Use Adjective before the 12th century, in the meaning defined at sense 1a(1) Noun before the 12th century, in the meaning defined at sense 1a shall hold their offices during good behavior—U.S. Constitution art. III also: characterized by or relating to good behavior good 2 of 2noun 1 : advancement of prosperity and well-being for the good of the community 2 : an item of tangible movable personal property having value but usually excluding money, securities, and negotiable instruments—usually used in pl.: as a plural: all things under section 2-103 of the Uniform Commercial Code that are movable at the time of identification to the contract for sale other than information, the money that is to be paid, investment securities, the subject matter of foreign exchange transactions, and choses in action b plural: all things under section 9-102 of the Uniform Commercial Code that are movable at the time that a security interest in them attaches or that are fixtures but excluding money, documents, instruments, accounts, chattel paper, general intangibles, commercial tort claims, deposit accounts, investment property, letter-of-credit rights, letters of credit, and minerals or the like before extraction —consumer goods : goods purchased primarily for personal, family, or household uses —durable goods : consumer goods that last and are used for a number of years : durables —fungible goods : goods of which any unit is by nature or by usage of trade the equivalent of any other like unit especially as defined by section 1-201 of the Uniform Commercial Code —future goods : goods that are the subject of a contract but are not yet existing or specified —hard goods : durable goods in this entry —household goods : goods used in connection with the home specifically: furniture, furnishings, and personal effects used in a dwelling as defined by section 7-209 of the Uniform Commercial Code —mobile goods : goods as formerly defined in section 9-103 of the Uniform Commercial Code that are mobile, are of a type (as vehicles) usually used in more than one jurisdiction, are not covered by a certificate of title, and are either the equipment of a debtor or inventory leased by a debtor —ordinary goods : goods as formerly defined by section 9-103 of the Uniform Commercial Code that are anything other than those covered by a certificate of title, mobile goods, or minerals —producer goods : goods (as tools and raw materials) used to produce other goods and satisfy human wants only indirectly"
}