{
  "url": "https://support.google.com/families/answer/7103262?hl=tr",
  "title": "Çocuğunuzun Google Hesabı'nı Family Link ile yönetme - Google For Families Yardım",
  "text": "Aile grubunuzdaki ebeveynler, çocuğunuzun Google Hesabındaki hesap ayarlarını yönetmek için Family Link'i kullanabilir. Çocuğunuzun Google Hesabı ayarlarını kontrol etme Family Link'te yönetici ebeveyn olarak çocuğunuzun internet deneyiminin çeşitli yönlerini kontrol edebilirsiniz. Çocuğunuzun Google Play etkinliğini Family Link ile yönetmeÖnemli: Google Play'in faturalandırma sistemi kullanılarak yapılan satın alma işlemlerinde yalnızca Family Link'in satın alma onayı ayarları kullanılabilir. Yönetici ebeveyn olarak şunları yapabilirsiniz: - Aile hesaplarınızda satın alma işlemleri için onay ayarlarını belirleyebilirsiniz. Google Play'deki satın alma onayları hakkında daha fazla bilgi edinin. - Android cihazınızda Google Play satın alma işlemleri için ebeveyn denetimlerini ayarlayabilirsiniz. Google Play'de ebeveyn denetimlerini nasıl ayarlayacağınızı öğrenin. - Çocuğunuzun Google Play'deki hangi uygulamaları kullanabileceğini seçebilirsiniz. Çocuğunuzun Google Play uygulamalarını nasıl yöneteceğinizi öğrenin. Önemli: Family Link'in Ebeveyn Gözetimi hizmetleri, çocuğunuzun cihazına göre değişiklik gösterebilir. Yönetici ebeveyn olarak şunları yapabilirsiniz: - Çocuğunuzun Chrome'da gezinirken gerçekleştirdiği etkinlikleri yönetebilirsiniz. Çocuğunuzun etkinliği ve Chrome hakkında daha fazla bilgi edinin. - Çocuğunuzun Google arama sonuçlarını filtreleyebilirsiniz. Çocuğunuzun Google Hesabı'nda Arama'yı nasıl yöneteceğinizi öğrenin. - Google Asistan'ın çocuğunuza yardımcı olmasına izin verebilirsiniz. Cihazlarınızın Asistan ayarlarından çocuğunuzun Google Asistan'ı kullanmasına nasıl izin vereceğinizi öğrenin. - Android cihazlarda çocuğunuzun nerede olduğunu takip edebilirsiniz. Çocuğunuzun konumunu nasıl bulacağınızı ve yöneteceğinizi öğrenin. Çocuğunuzun Google etkinliği ayarlarını düzenleme Çocuğunuzun etkinliği Google Hesabı'na kaydedilir. Hesabınıza hangi etkinliklerin kaydedileceğini nasıl kontrol edeceğinizi öğrenin. Google'ın çocuğunuzun etkinliklerini kaydetmesini engellerseniz bazı Family Link özellikleri ve diğer Google hizmetleri çalışmaz. Çocuğunuzun hesap ayarlarını bulmak için aşağıdaki düğmeye dokunun: - Family Link uygulamasını açın. - Çocuğunuzu seçin. - Denetimler Hesap ayarları Gizlilik ayarları'na dokunun. - Hesap verisi ayarları'na dokunun. - Ekrandaki talimatları uygulayın. Siz ve çocuğunuz Google etkinliği ayarlarınızı değiştirebilirsiniz. Ayarlarınızı, etkinlik kontrolleri yalnızca ebeveynler tarafından yönetilecek şekilde de değiştirebilirsiniz. - Family Link uygulamasını açın. - Çocuğunuzu seçin. - Denetimler Hesap ayarları Gizlilik ayarları'na dokunun. - Hesap verisi ayarları'na dokunun. - \"Etkinlik kontrolleri\" bölümünde, çocuğunuza bu ayarları değiştirme izni verebilirsiniz. İpuçları: - Çocuğunuzun kendi hesap ayarlarını kontrol edip edememesi ayarların kendisini değiştirmez. Ebeveynler, bu kontrolü değiştirdikten sonra ayarların doğruluğundan emin olmalıdır. - Bu ayarları g.co/YourFamily adresinde de yönetebilirsiniz. Önemli: Çocuğunuzun mevcut Google Hesabına gözetim eklediyseniz bu işlemi gerçekleştirmek için çocuğunuzun yardımına ihtiyacınız olacaktır. - Çocuğunuzun cihazında Etkinliğim sayfasına gidin. - Etkinlikleri bulmak istediğiniz uygulamayı arayın. - Çocuğunuzun etkinliğini bulmak için Ayrıntılar'a dokunun. - Çocuğunuzun etkinliğini kaldırmak için Sil'e dokunun. Çocuğunuzun Google Hesabı bilgilerini düzenleme Not: Bu seçenekler yalnızca çocuğunuz 13 yaşın (veya ülkenizde geçerli olan yaş sınırının) altındaysa ve kendi hesabını yönetmeyi seçmemişse kullanılabilir. Çocuğunuzun hesap ayarlarını bulmak için aşağıdaki düğmeye dokunun: Çocuğunuzun ad, doğum günü veya cinsiyet bilgisini değiştirin - Family Link uygulamasını açın. - Çocuğunuzu seçin. - Denetimler Hesap ayarları'na dokunun. - Çocuğunuzun bilgilerini değiştirmek için: - Ad'a dokunun. - Doğum günü'ne dokunun. - Cinsiyet'e dokunun. - Güncellenen bilgilere göre Bitti veya Tamam'a dokunun. İpuçları: - Çocuğunuzun kendi hesap ayarlarını kontrol edip edememesi ayarların kendisini değiştirmez. Ebeveynler, bu kontrolü değiştirdikten sonra ayarların doğruluğundan emin olmalıdır. - Bu ayarları g.co/YourFamily adresinde de yönetebilirsiniz. - Family Link uygulamasını açın. - Çocuğunuzu seçin. - Denetimler Hesap Ayarları Fotoğrafı değiştir'e dokunun. - Çocuğunuzun fotoğrafını değiştirmek için aşağıdaki seçenekleri belirleyebilirsiniz: - Fotoğraf çek - Fotoğraf seç Çocuğunuzun hesap ayarlarını bulmak için aşağıdaki düğmeye dokunun: Şifresini değiştirdiğinizde, çocuğunuzun cihazlarındaki oturumu kapatılır. Çocuğunuz tekrar oturum açana kadar, etkinleştirdiğiniz hiçbir gözetim ayarı çalışmaz. - Family Link uygulamasını açın. - Çocuğunuzu seçin. - Denetimler Hesap ayarları Şifreyi değiştir'e dokunun. - Google Hesabı bilgilerinizi kullanarak oturum açın. - Yeni bir şifre girin. - Değiştir'e dokunun. - Çocuğunuzun hesabında 2 Adımlı Doğrulama etkinse pop-up bildirimi onaylamak için Anladım'a dokunun. İpuçları: - Çocuğunuzun kendi hesap ayarlarını kontrol edip edememesi ayarların kendisini değiştirmez. Ebeveynler, bu kontrolü değiştirdikten sonra ayarların doğruluğundan emin olmalıdır. - Bu ayarları g.co/YourFamily adresinde de yönetebilirsiniz. Çocuğunuzun hesabı için 2 Adımlı Doğrulama - Çocuğunuzun hesabında 2 Adımlı Doğrulama etkinse ve çocuğun şifresini değiştirirseniz 2 Adımlı Doğrulama devre dışı bırakılır. - 2 Adımlı Doğrulama devre dışı bırakıldığında hem size hem de çocuğunuza bir bildirim e-postası gönderilir. - Çocuğunuz hesabında oturum açtıktan sonra 2 Adımlı Doğrulama'yı tekrar etkinleştirebilir. 2 Adımlı Doğrulama hakkında daha fazla bilgi edinin."
}