{
  "url": "https://www.thefreedictionary.com/no",
  "title": "No - definition of no by The Free Dictionary",
  "text": "no Also found in: Thesaurus, Medical, Legal, Financial, Acronyms, Idioms, Encyclopedia, Wikipedia. no No 1 (nō)No 2 no 1 (nō)no 2 (nō)no (nəʊ)no (nəʊ)no No (nəʊ) orNoh No (nəʊ)No no1 (noʊ)adv., n., pl. noes, nos. adv. no2 (noʊ)adj. No Chem. Symbol. Nō Noh (noʊ)n. no. or No., No no No can be a negative reply. No is a negative reply to negative questions. For example, if you are Spanish and someone says to you 'You aren't Italian, are you?', you say 'No'. Don't say 'Yes'. No is used in front of nouns to mean 'not any'. For example, instead of saying 'She doesn't have any friends', you can say 'She has no friends'. No is used in front of comparative adjectives instead of 'not'. For example, instead of saying 'She isn't taller than her sister', you say 'She is no taller than her sister'. However, don't use 'no' and a comparative in front of a noun. Don't say, for example, 'a no older woman' or 'a no bigger shell'. No is used in front of different instead of 'not'. No is often used on notices to tell you that something is not allowed. No is followed by an -ing form or a noun. no not at all yes, of course, certainly no adverbno [nəʊ]they've got no friends in London → no tienen ningún conocido en Londres there are no trains after midnight → no hay trenes después de medianoche I have no money/furniture → no tengo dinero/muebles \"no admittance, no entry\" → se prohíbe la entrada \"no parking\" → \"no aparcar\", \"no estacionarse\" (esp LAm) \"no smoking\" → prohibido fumar it's no good → es inútil details of little or no interest → detalles mpl sin interés there is no coffee left → no queda café we'll be there in no time → llegamos en un dos por tres, no tardamos nada it's no trouble → no es molestia no two of them are alike → no hay dos iguales it's no use → es inútil no [ˈnəʊ] [noes] (pl)Are you coming? - No → Est-ce que vous venez? - Non. No, I'm not → Non. Haven't you got your driver's licence? - No, I haven't → Vous n'avez pas votre permis de conduire ? - Non. Would you like some more? - No thank you → Vous en voulez encore? - Non merci. no later than the end of next year → au plus tard à la fin de l'année prochaine no fewer than → pas moins de I have no money → Je n'ai pas d'argent. I have no books → Je n'ai pas de livres. There's no hot water → Il n'y a pas d'eau chaude. There are no trains on Sundays → Il n'y a pas de trains le dimanche. No student would have done it → Aucun étudiant ne l'aurait fait. I've got no idea → Je n'en ai aucune idée. He is no singer → Ce n'est certes pas un grand chanteur. there is no doing sth → il est impossible de faire qch There is no going back to the life she had → Il lui est impossible de retrouver son ancienne vie. no problem! → pas de problème! no way! → pas question!"
}