{
  "url": "https://www.chicagobotanic.org/plant-information/plant-profiles/daisies",
  "title": "Daisies | Chicago Botanic Garden",
  "text": "Daisies Leucanthemum x superbum What is a daisy? The word daisy often brings to mind an image of a flower composed of flat, white petals surrounding a yellow button center, growing on knee-high stalks in a summer meadow, rural roadside, or cottage perennial border. Some may remember with affection the flower they picked in younger years to make romantic predictions, chanting the traditional litany of \"He loves me...he loves me not,\" while pulling each flower petal off one by one. It might come as a surprise to learn that 22 plant genera contain at least one flower commonly called \"daisy,\" resulting in 38 different flower species of the same common name. Distinguishing characteristics The flowers called daisy include a central, buttonlike disk of microscopic flowers encompassed by a ring of raylike petals. The similarities end here. The central disk can be flat, concave, or convex in form. Colors can vary from the classic yellow to black, dark brown, or even exotic purple. Ray petals (often frilled or double) range from pure white to cream, yellow, orange, red, crimson, rose, or purple. Local Gardens There are two particular daisies that one finds successfully grown in local gardens, including the Chicago Botanic Garden. They are the Shasta daisy (Chrysanthemum x superbum, syn. Leucanthemum xsuperbum) and the English daisy (Bellis perennis). The Shasta daisy is a hybrid developed by Luther Burbank near the white peaks of Mt. Shasta in California. A favorite border perennial in Chicago gardens, this classic-colored flower grows on stems 2 to 3 feet tall. Shasta daisies form robust, rounded clumps that prefer moist, rich, well-drained soil, full sun, and uncrowded growing conditions. They can be susceptible to stem rot, powdery mildew, and verticillium wilt. Gardeners desiring larger, higher-quality cutting flowers often fertilize Shasta daisies in summer as well as prune off any developing side buds. At the Chicago Botanic Garden, Shasta daisies are treated like any other perennial in the border — they are given about 1 inch of water per week during the heat of summer and deadheaded regularly to encourage reflowering. Daisy clumps should be divided every two to three years to prevent overcrowding and loss of rigor. Winter protection consists of cutting the stems back to their basal growth and covering with mulch. The cultivars 'Amelia' and 'Becky' have performed the best at the Chicago Botanic Garden and are found in large numbers in diverse Garden settings. The English daisy (Bellis perennis) A biennial in the Chicago area and is often seen as a companion plant to spring-flowering bulbs. It prefers a cooler, moist spring and will often fade during the heat of Chicago summers. If deadheaded regularly, English daisies will often bloom sporadically through the fall. Short little plants, perfect for edging, they sport a common yellow center with varying shades of rose, red, salmon, or white ray flowers. Ox-eye daisy While English daisies and Shasta daisies are good examples of popular daisies for cultivation in Chicago-area gardens, the ox-eye daisy (Chrysanthemum leucanthemum) is harder to classify. Weed or wildflower? Cultivated plant or nuisance flower? Native to Europe and Asia, this cousin of the Shasta daisy has naturalized itself throughout Zones 3 to 10 by rapidly spreading through seed and rhizomes. The ox-eye daisy actually prefers the low fertility of old fields and pastures. No matter where you look this summer — perennial or annual beds, cottage or cutting gardens, open fields, or patio pots — there will surely be a daisy in the display."
}