{
  "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/04/mexicos-water-deliveries-and-steps-to-meet-1944-water-treaty-requirements/",
  "title": "Mexico’s Water Deliveries and Steps to Meet 1944 Water Treaty Requirements - United States Department of State",
  "text": "HomeOffice of the SpokespersonPress Releases…Mexico’s Water Deliveries and Steps to Meet 1944 Water Treaty Requirements hide Mexico’s Water Deliveries and Steps to Meet 1944 Water Treaty Requirements Fact Sheet Office of the Spokesperson April 29, 2025 At the conclusion of high-level U.S.-Mexican discussions held in April regarding Mexico’s treaty deliveries of Rio Grande water to the United States, Mexico has committed to actions to reduce the shortfalls in Mexico’s deliveries by the end of the five-year water cycle on October 24. The United States accepted Mexico’s proposal to increase water deliveries through multiple sources, ensuring a diversification of water supplies requested by Texas stakeholders. These deliveries will come on top of 110,000 acre-feet of water already made in the current water year that started October 25, 2024. Mexico’s commitment includes: An immediate transfer of water at Amistad Dam, followed by monthly transfers at the two international reservoirs (Amistad and Falcon Dams); An increase in the U.S. share of the flows in six of Mexico’s Rio Grande tributaries designated in the 1944 U.S.-Mexico water treaty; Additional deliveries of San Juan River water, subject to U.S. acceptance of deliveries when they can be put to beneficial use. Mexico and the United States will meet in July to assess hydrology conditions to follow up and evaluate the action taken. Mexico and the United States will hold on-going meetings to develop a plan under which Mexico will make up their shortfall from this five-year cycle and to make regular, dependable deliveries in the next five-year cycle for the benefit of users in Texas. Tags Bureau of Western Hemisphere Affairs International Law, Treaties, and Agreements Mexico Office of the Spokesperson Texas Water"
}