{
  "url": "https://www.hobbylobby.com/weekly-ad",
  "title": "Hobby Lobby Weekly Ad",
  "text": "Shop Our Weekly Ad Valid through February 8, 2026 Home Decor 50%off Items Labeled \"Textiles\" Does not include Seasonal Department or items labeled Kitchen, Bath, Closet, Gift or \"Your Price\" Football Party, Valentine's Day, St. Patrick's, Summer and items labeled The Spring Shop® are not included in Home Decor sale Doormats & Rugs 50%off Sheet Sets 50%off Bath Towels 50%off Window Curtains 50%off Comforter Sets 50%off Quilt Sets 50%off Bath Mats 50%off Shower Curtains 50%off Pillows & Throws 50%off Valentine Party, Crafts & Decorations 40%off Home Decor, Paper Plates & Napkins, Party Supplies, Fabric and More Does not include candy or food St. Patrick's 40%off Decorations, Party Supplies, Crafts, Fabric and More Items Labeled The Spring Shop 40%off LED Pathway Lights, Planters, Yard Signs, Yard Spinners, Wall Decor, Wind Chimes, Metal Statuary, and More. Does not include items labeled Kitchen Floral 40%off Categories Listed Stems, Bushes, Garland & Wreaths Does not include Seasonal Department or items labeled \"floral accents\" Ribbon & Deco Mesh Does not include \"Your Price\" Items Football Party 75%off Party 50%off Always 50% Off The Marked Price* Categories Listed All Rolled Basket & Gift Wrap All Paper Napkins & Plates All Paper Gift Bags Cake Decorating All items labeled Sunny Side Up Bakery® Includes Cake, Cookie and Cupcake Essentials Does not include Seasonal Department Gildan® Youth and Adult Short-Sleeve T-Shirts Always $3.42 Marked price* $4.27 T-Shirts 20%off Always 20% off the marked price* Includes Youth and Adult Short-Sleeve T-Shirts, Baseball & Long Sleeve T-Shirts, Sweatshirts, Sweatpants, Infant & Toddler T-Shirts and Gerber® Onesies® bodysuits. Does not include Seasonal or Cricut® branded apparel Puzzles 40%off Does not include Seasonal Department or \"Your Price\" items Boxed Model Kits 40%off Candles New Everyday Low Price See our best price everyday on Candles, Candle Holders, LED Candles, Oils & Fragrance Cubes Crafts 40%off Categories Listed Glass Bottles & Containers and Galvanized Metal 40%off Excludes \"Your Price\" items Candle Wax, Soap Blocks & Bases 40%off Unfinished Craft Wood 40%off Priced $4.99 & Up Clay 40%off Modeling, oven-bake & air-dry Paper Crafts 40%off All Items Labeled The Paper Studio® Stickers, Scrapbook Albums, Cards, Envelopes, Embellishments, Cardstock Paper Packs, Paper Pads & Page Kits, Planners & Planner Accessories, Pen & Marker Sets, Printed Single Sheets and Cardstock All Yarn 30%off Every skein, brand, color and size Sewing Ribbon & Trim 40%off Includes ribbon, bows & deco mesh in the Floral Department Does not include Seasonal Department or Trim by the Yard Jewelry Making 50%off Categories Listed Strung, Tubed & Packaged Beads and Crystals by Color Gallery™, Bead Treasures® and Preciosa® Bead Design Co.™ Bulk beads & gems Includes packaged beads by Treehouse Studio® the Jewelry Shoppe™ Findings and Accessories Metal Gallery™ Always 50% off the Marked Price* Fairy Tale by Bead Treasures® 50%off Sewing Notions YKK Zippers Sew-Ology® Thread Bias Tape Hem Tape, Piping & Blanket Binding Buttons Always 99¢ Marked price* $1.49 - $3.49 Always $1.99 Marked price* $3.50 - $6.99 Custom Frames 50%off Always 50% off the marked price* Applies to frame only. See store for details. Compare our prices to our competitors' prices. FREE QUOTES See our Great Selection. Satisfaction Guaranteed. Furniture 30%off Always 30% Off The Marked Price*"
}