{
  "url": "https://en.wikipedia.org/wiki/Tate",
  "title": "Tate - Wikipedia",
  "text": "Tate Tate is an institution that houses, in a network of four art galleries, the United Kingdom's national collection of British art, and international modern and contemporary art. It is not a government institution, but its main sponsor is the UK Department for Culture, Media and Sport. It is often referred to as the Tate Museum. The name \"Tate\" is used also as the operating name for the corporate body, which was established by the Museums and Galleries Act 1992 as \"The Board of Trustees of the Tate Gallery\". The gallery was founded in 1897 as the National Gallery of British Art. When its role was changed to include the national collection of modern art as well as the national collection of British art, in 1932, it was renamed the Tate Gallery after sugar magnate Henry Tate of Tate & Lyle, who had laid the foundations for the collection. The Tate Gallery was housed in the current building occupied by Tate Britain, which is situated in Millbank, London. In 2000, the Tate Gallery transformed itself into the current-day Tate, consisting of a network of four museums: Tate Britain, which displays the collection of British art from 1500 to the present day; Tate Modern, also in London, which houses the Tate's collection of British and international modern and contemporary art from 1900 to the present day; Tate Liverpool (founded in 1988), which has the same purpose as Tate Modern but on a smaller scale; and Tate St Ives in Cornwall (founded in 1993), which displays modern and contemporary art by artists who have connections with the area. All four museums share the Tate Collection. One of the Tate's most publicised art events is the awarding of the annual Turner Prize to a British visual artist, which takes place at Tate Britain every other year (taking place at venues outside of London in alternate years). History and development [edit]The original Tate was called the National Gallery of British Art, situated on Millbank, Pimlico, London at the site of the former Millbank Prison. The idea of a National Gallery of British Art was first proposed in the 1820s by Sir John Leicester, Baron de Tabley. It took a step nearer when Robert Vernon gave his collection to the National Gallery in 1847. A decade later John Sheepshanks gave his collection to the South Kensington Museum (later the Victoria & Albert Museum), known for years as the National Gallery of Art (the same title as the Tate Gallery had). Forty years later Sir Henry Tate who was a sugar magnate and a major collector of Victorian art, offered to fund the building of the gallery to house British Art on the condition that the State pay for the site and revenue costs. Henry Tate also donated his own collection to the gallery. It was initially a collection solely of modern British art, concentrating on the works of modern—that is Victorian era—painters. It was controlled by the National Gallery until 1954. Following the death of Sir Hugh Lane in the sinking of the RMS Lusitania in 1915, an oversight in his will meant that the collection of European modern art he had intended to go to Dublin controversially went to the Tate instead, which expanded its collection to include foreign art and continued to acquire contemporary art. In 1926 and 1937, the art dealer and patron Joseph Duveen paid for two major expansions of the gallery building. His father had earlier paid for an extension to house the major part of the Turner Bequest, which in 1987 was transferred to a wing paid for by Sir Charles Clore. Henry Courtauld also endowed Tate with a purchase fund. By the mid 20th century, it was fulfilling a dual function of showing the history of British art as well as international modern art. In 1954, the Tate Gallery was finally separated from the National Gallery. During the 1950s and 1960s, the visual arts department of the Arts Council of Great Britain funded and organised temporary exhibitions at the Tate Gallery including, in 1966, a retrospective of Marcel Duchamp. Later, the Tate began organising its own temporary exhibition programme. In 1979 with funding from a Japanese bank a large modern extension was opened that would also house larger income generating exhibitions. In 1987, the Clore Wing opened to house the major part of the Turner bequest and also provided a 200-seat auditorium. (The \"Centenary Development\", in 2001, provided improved access and public amenities) In 1988, an outpost in north west England opened as Tate Liverpool. This shows various works of modern art from the Tate collection as well as mounting its own temporary exhibitions. In 2007, Tate Liverpool hosted the Turner Prize, the first time this has been held outside London. This was an overture to Liverpool's being the European Capital of Culture 2008. In 1993, another offshoot opened, Tate St Ives. It exhibits work by modern British artists, particularly those of the St Ives School. Additionally the Tate also manages the Barbara Hepworth Museum and Sculpture Garden, which opened in 1980. Neither of these two new Tates had a significant effect on the functioning of the original London Tate Gallery, whose size was increasingly proving a constraint as the collection grew. It was a logical step to separate the \"British\" and \"Modern\" aspects of the collection, and they are now housed in separate buildings in London. The original gallery is now called Tate Britain and is the national gallery for British art from 1500 to the present day, as well as some modern British art. Tate Modern, in Bankside Power Station on the south side of the Thames, opened in 2000 and now exhibits the national collection of modern art from 1900 to the present day, including some modern British art. In the late 2000s, the Tate announced a new development project to the south of the existing building. According to the museum this new development would \"transform Tate Modern. An iconic new building will be added at the south of the existing gallery. It will create more spaces for displaying the collection, performance and installation art and learning, all allowing visitors to engage more deeply with art, as well as creating more social spaces for visitors to unwind and relax in the gallery.\"[1] Arts philanthropist John Studzinski donated more than £6 million to the project.[2][3] The extension to Tate Modern opened in 2016 as The Switch House and, in 2017, was renamed the Blavatnik Building after Anglo-Ukrainian billionaire Sir Leonard Blavatnik, who contributed a \"substantial\" amount of its £260m cost. The youngest person to be awarded a residency at the Tate is Travis Alabanza.[4] Tate Digital [edit]Tate Digital is the name of the department responsible for Tate's website and other public-facing digital projects. Since its launch in 1998, Tate's website site has provided information on all four physical Tate galleries (Tate Britain, Tate St Ives, Tate Liverpool and Tate Modern) under the same domain. Other resources include illustrated information on all works in Tate's Collection of British and Modern, Contemporary and international art, all of Tate's research publications, and articles from the magazine Tate Etc. BT was the primary sponsor of Tate Online from 2001 to 2009. Tate Online has been used as a platform for Internet art exhibits, termed Net Art,[5] which are organised as part of Tate's Intermedia Art initiative[6] covering new media art. 13 net art exhibitions have been shown since the initiative started in 2000 including Tate in Space[7] (2002) which was nominated in the Interactive Art category for the 2003 BAFTA Interactive awards. Administration and funding [edit]Tate receives annual funding from the Department for Culture, Media and Sport. It is administered by a board of trustees, who are responsible for the running of the gallery and appoint the Director (for a period of seven years). Under the Charities Act 1993, the Tate is an exempt charity accountable directly to Government rather than the Charity Commission for financial returns etc. However, the Trustees are still expected to follow the broad responsibilities of charity trustees, and may be subject to Charity Commission oversight on these elements of their activities. Maria Balshaw has been Director of Tate since 2017,[8] succeeding Sir Nicholas Serota (1988 to 2017). Under the Director, Kerstin Mogull has been managing director of Tate since January 2014,[9] succeeding Alex Beard. On 12 December 2025, the Tate announced that Balshaw would step down as Director in Spring 2026.[10] Various bodies have been set up to support the Tate including Tate Members for the general public, where a yearly fee gives rights such as free entry to charging exhibitions and members' rooms. There is also Tate Patrons for a higher subscription fee and the Tate Foundation. There are a number of corporate sponsors. In addition individual shows are often sponsored. Tate now spends around £1 million of its general funds each year on purchasing acquisitions and their related costs. The Outset Contemporary Art Fund was established in 2003, by Tate patrons Yana Peel and Candida Gertler. In collaboration with the Frieze Art Fair, the fund buys works from the fair for the Tate's collections. Other funds for acquisitions are raised by Tate funding groups such as the Members, the Patrons and the American Patrons of Tate and its sub-committees, the North American Acquisitions Committee and Latin American Acquisitions Committee. The American Patrons were renamed in 2013 to reflect their expanding geographical base of support; since 1999, this support group alone has raised more than $100 million.[11] In 2010, a photography acquisitions committee was launched.[12] In 2012, the Tate established a South Asian acquisitions committee to collect contemporary and modern art from India and surrounding countries, as well as a committee for works from Russia, Eastern Europe and the CIS (Commonwealth of Independent States).[13] Controversies [edit]- In 1971, an exhibition by Robert Morris called Bodyspacemotionthings was closed after five days due to health and safety concerns.[14] - In 1972, the Tate Gallery purchased a work by Carl Andre called Equivalent VIII. During a 1976 exhibition of the work, The Times newspaper published an article using the work to complain about institutional waste of taxpayers' money. The article made the piece infamous and it was subjected to ridicule in the media and vandalism. The work is still popularly known as The Bricks, and has entered the British public lexicon.[citation needed] - Each year, the Turner Prize is held at a Tate Gallery (historically at Tate Britain) and is awarded to an artist who is either British or primarily working in Great Britain. It is the subject of great controversy and creates much media attention for contemporary British art, as well as attracting demonstrations.[15] - In 1995, it was revealed that the Tate had accepted a gift of £20,000 from art fraudster John Drewe. The gallery had given Drewe access to its archives which he then used to forge documents authenticating fake modern paintings that he then sold.[16] - In 1998, Sir Nicholas Serota, director of Tate, conceived 'Operation Cobalt', the secret and ultimately successful buyback of two of the Tate's paintings by J. M. W. Turner that had been stolen from a German gallery in 1994. See Frankfurt art theft (1994). - In 2006, it was revealed that the Tate was the only national-funded museum not to be accredited by the Museums, Libraries and Archives Council (MLA), as it did not wish to abide by guidelines that deaccessioned work should first be offered to other museums. The MLA threatened to bar the Tate from acquiring works under the Acceptance in Lieu (AIL) scheme, whereby works are given to the nation to settle inheritance tax. A total of 1,800 museums were accredited by the MLA.[17] - Tate has been criticised for accepting sponsorship from BP. Justice and climate change campaigners including Platform London, Art Not Oil and Liberate Tate have called for a protest against the petrol company's sponsorship of the gallery, including the 2012 Cultural Olympiad.[18] BP's sponsorship of Tate had ended in 2017.[19] Logo and brand [edit]The Tate logo was designed by international brand consultancy Wolff Olins in 2000 as part of a larger rebranding effort focused around the idea \"look again, think again.\" The museum uses a range of logos that move in and out of focus, \"suggesting the dynamic nature of Tate – always changing but always recognizable\"[20] Variations include a standard logo, a blurred version, a faded version and a halftone version consisting of dots rather than smooth fading.[21] An update on the brand, designed by North, was released in 2016.[22] Directors [edit]The head of the Tate (formally the National Gallery of British Art and the Tate Gallery) is currently titled the Director. Until 1917, they were styled the Keeper.[23] - Sir Charles Holroyd (1897 to 1906) - D. S. MacColl (1906 to 1911) - Charles Aitken (1911 to 1930) - James Bolivar Manson (1930 to 1938) - Sir John Rothenstein (1938 to 1964) - Sir Norman Reid (1964 to 1979) - Sir Alan Bowness (1980 to 1988) - Sir Nicholas Serota (1988 to 2017) - Maria Balshaw (2017 to Spring 2026)[8][24][25][10] Galleries [edit]- Edward Burne-Jones, 1884, King Cophetua and the Beggar Maid, Tate Britain - Robert Delaunay, 1912, Windows Open Simultaneously (First Part, Third Motif), Tate Modern - Paul Klee, 1921, A Young Lady's Adventure, Tate Modern See also [edit]- Tate Etc. - Turner Prize - Tate Publishing Ltd, a publisher of art books associated with the Tate Gallery - British Art Network References [edit]- ^ \"The Tate Modern Project – Tate\". Retrieved 22 March 2022. - ^ \"Donation provides cornerstone for new Transforming Tate Modern development\" Archived 9 April 2015 at the Wayback Machine. Tate Modern. 22 May 2007. - ^ Nayeri, Farah. \"Blackstone's Studzinski to Give Tate $1.57 Million More\" Archived 9 January 2015 at the Wayback Machine. Bloomberg. 31 July 2012. - ^ Beresford, Meka (6 November 2018). \"Battling transphobia with burgers\". Retrieved 2 March 2019. - ^ \"Intermedia Art Archive: Net Art by Date | Tate\". www.tate.org.uk. Retrieved 22 March 2022. - ^ Intermedia Art Archived 6 May 2021 at the Wayback Machine Tate - ^ Tate in Space Archived 8 May 2021 at the Wayback Machine Tate - ^ a b Brown, Mark; Pidd, Helen (11 January 2017). \"Tate to name Maria Balshaw as new director to succeed Serota\". The Guardian. ISSN 0261-3077. Retrieved 11 January 2017. - ^ \"Managing Director, Tate – Press Release\". 10 October 2013. - ^ a b Tate. \"Maria Balshaw to step down as Director of Tate next year – Press Release\". Tate. Retrieved 13 December 2025. - ^ Adrian Dannatt (11 May 2013), Starry night for Tate in New York Archived 29 November 2014 at the Wayback Machine The Art Newspaper. - ^ Mark Brown (11 May 2010), Tate Modern marks 10th birthday by expanding collection Archived 26 January 2021 at the Wayback Machine The Guardian. - ^ Gareth Harris and Georgina Adam (12 October 2012), Tate to launch two new acquisitions committees Archived 26 October 2012 at the Wayback Machine The Art Newspaper. - ^ Tate Modern's Turbine Hall recreates a 1971 art sensation Archived 30 March 2021 at the Wayback Machine The Guardian, 6 April 2009 - ^ Chappet, Marie-Claire (20 October 2011). \"The Turner Prize's most controversial moments\". The Telegraph. Archived from the original on 12 January 2022. - ^ Carter, R. G. (2007). Tainted archives: Art, archives, and authenticity. Archivaria, 63, 75. - ^ \"Tate Is Not a Museum\", The Art Newspaper, 14 August 2006. Retrieved from the Internet Archive, 14 March 2010.[1] - ^ Needham, Alex (13 December 2011). \"Tate may not renew BP sponsorship deal after environmental protests\". The Guardian. - ^ Khomami, Nadia (11 March 2016). \"BP to end Tate sponsorship after 26 years\". The Guardian. ISSN 0261-3077. Retrieved 23 October 2025. - ^ \"Tate – Wolff Olins\". Archived from the original on 22 August 2014. Retrieved 22 March 2022. - ^ \"How effective are the Tate logos? – Logo Design Love\". 6 May 2008. Archived from the original on 4 September 2018. Retrieved 6 January 2012. - ^ LLC, UnderConsideration. \"Brand New: New Logo and Identity for Tate by North\"., Retrieved 18 May 2023 - ^ \"History of Tate: Directors of Tate\". Tate.org.uk. Retrieved 27 April 2016. - ^ \"Maria Balshaw: Manchester gallery boss to be Tate's first female director\". BBC. 17 January 2017. Retrieved 17 January 2017. - ^ Mark Brown (17 January 2017). \"Maria Balshaw's Tate appointment confirmed by prime minister\". The Guardian. Retrieved 17 January 2017. External links [edit]- Tate galleries - 1897 establishments in England - Art museums and galleries in London - Art museums and galleries in Merseyside - Art museums and galleries established in 1897 - Charities based in London - Contemporary art galleries in the United Kingdom - Exempt charities - Modern art museums - Museums sponsored by the Department for Culture, Media and Sport - Non-departmental public bodies of the United Kingdom government - Order of Arts and Letters of Spain recipients - Tate & Lyle - Turner Prize"
}