{
  "url": "https://www.cdc.gov/conjunctivitis/hcp/infection-control-ekc/index.html",
  "title": "Preventing Epidemic Keratoconjunctivitis (EKC) | Conjunctivitis (Pink Eye) | CDC",
  "text": "Key points - Epidemic Keratoconjunctivitis (EKC) is a highly contagious form of pink eye caused by adenoviruses. - EKC causes severe inflammation of the conjunctiva and cornea and can result in vision loss. - Clean and disinfect right away to prevent and control outbreaks in eye clinics. Summary of guidelines Epidemic Keratoconjunctivitis (EKC) is caused by adenoviruses and is highly contagious. EKC can spread by direct contact with an infected person and has been associated with equipment used during eye exams. To prevent EKC: - Use an EPA-registered disinfectant that is effective at killing adenoviruses. Adenoviruses are often resistant to many disinfectants and can survive on surfaces and equipment for extended periods of time. - Ensure that disinfectants are compatible with the surfaces and equipment and approved by the manufacturer. - Put on personal protective equipment, such as disposable gloves and protective eyewear. Guideline details Surfaces Clean and disinfect surfaces in the exam and waiting rooms, office, storage, and other areas in the clinic. Pay close attention to frequently touched surfaces, such as counter tops and doorknobs. - Clean the surface thoroughly to remove dust or dirt before applying disinfectants. - Use an EPA-registered disinfectant on surfaces that is effective at killing adenoviruses. - For example: A bleach-based solution (2,000–5,000 ppm chlorine or 10 to 25 tablespoons of bleach per gallon of water). - Ensure the disinfectants remain on all surfaces for the recommended contact time. - Apply wet and allow to dry. For example, bleach-based solutions should remain on all surfaces for at least one minute. Equipment Clean and disinfect medical instruments and ophthalmological equipment in the clinic. For example, wipe clean and disinfect tonometer tips for 5-10 minutes. Use either 5,000 ppm chlorine or 70% ethyl alcohol (ensure it is compatible with the instruments and approved by the manufacturer). After disinfection, rinse the tonometer thoroughly in water and air dry before use. Note: Data suggest that 70% isopropyl alcohol is not effective against adenovirus."
}