{
  "url": "https://en.wikipedia.org/wiki/Poland",
  "title": "Poland - Wikipedia",
  "text": "Poland Poland,[c] officially the Republic of Poland,[d] is a country in Central Europe. It extends from the Baltic Sea in the north to the Sudetes and Carpathian Mountains in the south. Borders Kaliningrad Oblast and Lithuania to the north; Belarus and Ukraine to the east; Slovakia and the Czech Republic to the south; and Germany to the west. The territory has a varied landscape, diverse ecosystems, and a temperate climate. Poland is composed of sixteen voivodeships and is the fifth most populous member state of the European Union (EU), with over 38 million people, and the fifth largest EU country by land area, covering 312,696 km2 (120,733 sq mi). The capital and largest city is Warsaw; other major cities include Kraków, Wrocław, Łódź, Poznań, and Gdańsk. Prehistoric human activity on Polish soil dates to the Lower Paleolithic, with continuous settlement since the end of the Last Glacial Period. Culturally diverse throughout late antiquity, in the early medieval period the region became inhabited by the West Slavic tribal Polans, who gave Poland its name. The process of establishing statehood coincided with the conversion of a pagan ruler of the Polans to Christianity in 966 under the auspices of the Roman Catholic Church. The Kingdom of Poland emerged in 1025, and in 1569 cemented its long-standing association with Lithuania, thus forming the Polish–Lithuanian Commonwealth. At the time, the Commonwealth was one of the great powers of Europe, with an elective monarchy and a uniquely liberal political system, which adopted Europe's first modern constitution in 1791. It was also a military power, with extremely effective cavalry called Hussars. With the passing of the prosperous Polish Golden Age, the country was partitioned by neighbouring states at the end of the 18th century. At the end of World War I in 1918, Poland regained its independence with the founding of the Second Polish Republic, which emerged victorious in various conflicts of the interbellum period. In September 1939, the invasion of Poland by Germany and the Soviet Union marked the beginning of World War II, which resulted in the Holocaust and millions of Polish casualties. Forced into the Eastern Bloc in the global Cold War, the Polish People's Republic was a signatory of the Warsaw Pact. Through the 1980 emergence and contributions of the Solidarity movement, which initiated the fall of the Iron Curtain, the communist government was dissolved and Poland re-established itself as a liberal democracy in 1989, as the first of its neighbours. Poland is a semi-presidential republic with its bicameral legislature comprising the Sejm and the Senate. Considered a middle power, it is a developed market and high-income economy. In terms of nominal GDP, it is the 20th largest economy in the world and the sixth in the European Union, and fifth largest by PPP-adjusted GDP in the EU. Poland enjoys a very high standard of living, safety, and economic freedom, as well as free university education and universal health care. It has 17 UNESCO World Heritage Sites, over 100 Historic Monuments and 23 national parks. Poland is a founding member state of the United Nations, and a member of the Council of Europe, World Trade Organisation, OECD, NATO, and the European Union (including the Schengen Area). Etymology The native Polish name for Poland, is Polska.[14] It is believed that the name derives from the Polans, a West Slavic tribe who inhabited the Warta River basin of present-day Greater Poland region (6th–8th century CE).[15] The tribe's name stems from the Proto-Slavic noun pole, meaning field, which itself originates from the Proto-Indo-European word *pleh₂- indicating flatland.[16] The etymology alludes to the topography of the region and the flat landscape of Greater Poland.[17][18] During the Middle Ages, the Latin form Polonia was widely used throughout Europe.[19] The country's alternative archaic name is Lechia and its root syllable remains in official use in several languages, notably Hungarian, Lithuanian, and Persian.[20] The exonym possibly derives from either Lech, a legendary ruler of the Lechites, or from the Lendians, a West Slavic tribe that dwelt on the south-easternmost edge of Lesser Poland.[21][22] The origin of the tribe's name lies in the Old Polish word lęda (plain).[23] Initially, both names Lechia and Polonia were used interchangeably when referring to Poland by chroniclers during the Middle Ages.[24] History Prehistory and protohistory The first Stone Age archaic humans and Homo erectus species settled what was to become Poland approximately 500,000 years ago, though the ensuing hostile climate prevented early humans from founding more permanent encampments.[25] The arrival of Homo sapiens and anatomically modern humans coincided with the climatic discontinuity at the end of the Last Glacial Period (Northern Polish glaciation 10,000 BC), when Poland became habitable.[26] Neolithic excavations indicated broad-ranging development in that era; the earliest evidence of European cheesemaking (5500 BC) was discovered in Polish Kuyavia,[27] and the Bronocice pot is incised with the earliest known depiction of what may be a wheeled vehicle (3400 BC).[28] The period spanning the Bronze Age and the Early Iron Age (1300 BC–500 BC) was marked by an increase in population density, establishment of palisaded settlements (gords) and the expansion of Lusatian culture.[29][30] A significant archaeological find from the protohistory of Poland is a fortified settlement at Biskupin, attributed to the Lusatian culture of the Late Bronze Age (mid-8th century BC).[31] Throughout antiquity (400 BC–500 AD), many distinct ancient populations inhabited the territory of present-day Poland, notably Celtic, Scythian, Germanic, Sarmatian, Baltic and Slavic tribes.[32] Furthermore, archaeological findings confirmed the presence of Roman Legions sent to protect the amber trade.[33] The Polish tribes emerged following the second wave of the Migration Period around the 6th century AD;[19] they were Slavic and may have included assimilated remnants of peoples that earlier dwelled in the area.[34][35] Beginning in the early 10th century, the Polans would come to dominate other Lechitic tribes in the region, initially forming a tribal federation and later a centralised monarchical state.[36] Kingdom of Poland Poland began to form into a recognisable unitary and territorial entity around the middle of the 10th century under the Piast dynasty.[37] In 966, the ruler of the Polans, Mieszko I, accepted Western Christianity under the auspices of the Roman Catholic Church which was tantamount to the adoption of Christianity by Poland.[38] In 968, a missionary bishopric was established in Poznań. An incipit titled Dagome iudex first defined Poland's geographical boundaries with its capital in Gniezno and affirmed that its monarchy was under the protection of the Apostolic See.[39] The country's early origins were described by Gallus Anonymus in Gesta principum Polonorum, the oldest Polish chronicle.[40] An important national event of the period was the martyrdom of Saint Adalbert, who was killed by Prussian pagans in 997 and whose remains were reputedly bought back for their weight in gold by Mieszko's successor, Bolesław I the Brave.[39] In 1000, at the Congress of Gniezno, Bolesław I the Brave obtained the right of investiture from Otto III, Holy Roman Emperor, who assented to the creation archdioceses in Gniezno[39] and three new dioceses on Polish lands in Kraków, Kołobrzeg, and Wrocław.[41] Also, Otto bestowed upon Bolesław royal regalia and a replica of the Holy Lance, which were later used at his coronation as the first King of Poland c. 1025, when Bolesław received permission for his coronation from Pope John XIX.[42][43] Bolesław also expanded the realm considerably by seizing parts of German Lusatia, Czech Moravia, Upper Hungary, and southwestern regions of the Kievan Rus'.[44] The transition from paganism in Poland was not instantaneous and resulted in the pagan reaction of the 1030s.[45] In 1031, Mieszko II Lambert lost the title of king and fled amidst the violence.[46] The unrest led to the transfer of the capital to Kraków in 1038 by Casimir I the Restorer.[47] In 1076, Bolesław II re-instituted the office of king, but was banished in 1079 for murdering his opponent, Bishop Stanislaus.[48] In 1138, the country fragmented into five principalities when Bolesław III Wrymouth divided his lands among his sons.[21] These were Lesser Poland, Greater Poland, Silesia, Masovia, and Sandomierz, with intermittent hold over Pomerania.[49] In 1226, Konrad I of Masovia invited the Teutonic Knights to aid in combating the Baltic Prussians; a decision that later led to centuries of warfare with the Knights.[50] In the first half of the 13th century, Henry I the Bearded and Henry II the Pious aimed to unite the fragmented dukedoms, but the Mongol invasion and the death of Henry II in battle hindered the unification.[51][52] As a result of the devastation which followed, depopulation and the demand for craft labour spurred a migration of German and Flemish settlers into Poland, which was encouraged by the Polish dukes.[53] In 1264, the Statute of Kalisz introduced unprecedented autonomy for the Polish Jews, who came to Poland fleeing persecution elsewhere in Europe.[54] In 1320, Władysław I the Short became the first king of a reunified Poland since Przemysł II in 1296,[55] and the first to be crowned at Wawel Cathedral in Kraków.[56] Beginning in 1333, the reign of Casimir III the Great was marked by developments in castle infrastructure, army, judiciary and diplomacy.[57][58] Under his authority, Poland transformed into a major European power; he instituted Polish rule over Ruthenia in 1340 and imposed quarantine that prevented the spread of Black Death.[59][60] In 1364, Casimir inaugurated the University of Kraków, one of the oldest institutions of higher learning in Europe.[61] Upon his death in 1370, the Piast dynasty came to an end.[62] He was succeeded by his closest male relative, Louis of Anjou, who ruled Poland, Hungary, and Croatia in a personal union.[63] Louis' younger daughter Jadwiga became Poland's first female monarch in 1384.[63] The Golden Age In 1386, Jadwiga of Poland entered a marriage of convenience with Władysław II Jagiełło, the Grand Duke of Lithuania, thus forming the Jagiellonian dynasty and the Polish–Lithuanian union which spanned the late Middle Ages and early Modern Era.[64] The partnership between Poles and Lithuanians brought the vast multi-ethnic Lithuanian territories into Poland's sphere of influence and proved beneficial for its inhabitants, who coexisted in one of the largest European political entities of the time.[65] In the Baltic Sea region, the struggle of Poland and Lithuania with the Teutonic Knights continued and culminated at the Battle of Grunwald in 1410, where a combined Polish–Lithuanian army inflicted a decisive victory against them.[66] In 1466, after the Thirteen Years' War, king Casimir IV Jagiellon gave royal consent to the Peace of Thorn, which created the future Duchy of Prussia under Polish suzerainty and forced the Prussian rulers to pay tributes.[21] The Jagiellonian dynasty also established dynastic control over the kingdoms of Bohemia (1471 onwards) and Hungary.[67] In the south, Poland confronted the Ottoman Empire (at the Varna Crusade) and the Crimean Tatars, and in the east helped Lithuania to combat Russia.[21] Poland was developing as a feudal state, with a predominantly agricultural economy and an increasingly powerful landed nobility that confined the population to private manorial farmstead known as folwarks.[68] In 1493, John I Albert sanctioned the creation of a bicameral parliament (the Sejm) composed of a lower house, the chamber of deputies, and an upper house, the chamber of senators.[69] The Nihil novi act adopted by the Polish General Sejm in 1505, transferred most of the legislative power from the monarch to the parliament, an event which marked the beginning of the period known as Golden Liberty, when the state was ruled by the seemingly free and equal Polish nobles.[70] The 16th century saw Protestant Reformation movements making deep inroads into Polish Christianity, which resulted in the establishment of policies promoting religious tolerance, unique in Europe at that time.[71] This tolerance allowed the country to avoid the religious turmoil and wars of religion that beset Europe.[71] In Poland, Nontrinitarian Christianity became the doctrine of the so-called Polish Brethren, who separated from their Calvinist denomination and became the co-founders of global Unitarianism.[72] The European Renaissance evoked under Sigismund I the Old and Sigismund II Augustus a sense of urgency in the need to promote a cultural awakening. During the Polish Golden Age, the nation's economy and culture flourished. The Italian-born Bona Sforza, daughter of the Duke of Milan and queen consort to Sigismund I, made considerable contributions to architecture, cuisine, language and court customs at Wawel Castle.[21] Polish–Lithuanian Commonwealth The Union of Lublin of 1569 established the Polish–Lithuanian Commonwealth, a unified federal state with an elective monarchy that was largely governed by the nobility.[73] The latter coincided with a period of prosperity. The Polish-dominated union thereafter became a leading power and a major cultural entity, exercising political control over parts of Central, Eastern, Southeastern and Northern Europe. The Polish–Lithuanian Commonwealth occupied approximately 1 million km2 (390,000 sq mi) at its peak and was the largest state in Europe.[74][75] Simultaneously, Poland imposed Polonisation policies in newly acquired territories which were met with resistance from ethnic and religious minorities.[73] In 1573, Henry de Valois of France, the first elected king, approbated the Henrician Articles which obliged future monarchs to respect the rights of nobles.[76] When he left Poland to become King of France, his successor, Stephen Báthory, led a successful campaign in the Livonian War, granting Poland more lands across the eastern shores of the Baltic Sea.[77] State affairs were then headed by Jan Zamoyski, the Crown Chancellor.[78] Stephen's successor, Sigismund III, defeated a rival Habsburg electoral candidate, Archduke Maximilian III, in the War of the Polish Succession (1587–1588). In 1592, Sigismund succeeded his father John Vasa, in Sweden.[79] The Polish-Swedish union endured until 1599, when he was deposed by the Swedes.[80] In 1609, Sigismund invaded Russia which was engulfed in a civil war,[21] and a year later the Polish winged hussar units under Stanisław Żółkiewski occupied Moscow for two years after defeating the Russians at Klushino.[21] Sigismund also countered the Ottoman Empire in the southeast; at Khotyn in 1621 Jan Karol Chodkiewicz achieved a decisive victory against the Turks, which ushered the downfall of Sultan Osman II.[81][82] Sigismund's long reign in Poland coincided with the Silver Age.[83] The liberal Władysław IV effectively defended Poland's territorial possessions but after his death the vast Commonwealth began declining from internal disorder and constant warfare.[84][85] In 1648, the Polish hegemony over Ukraine sparked the Khmelnytsky Uprising,[86] followed by the decimating Swedish Deluge during the Second Northern War,[87] and Prussia's independence in 1657.[87] In 1683, John III Sobieski re-established military prowess when he halted the advance of an Ottoman Army into Europe at the Battle of Vienna.[88] The Saxon era, under Augustus II and Augustus III, saw neighboring powers grow in strength at the expense of Poland. Both Saxon kings faced opposition from Stanisław Leszczyński during the Great Northern War (1700) and the War of the Polish Succession (1733).[89] Partitions The royal election of 1764 resulted in the elevation of Stanisław II Augustus Poniatowski to the monarchy.[90] His candidacy was extensively funded by his sponsor and former lover, Empress Catherine II of Russia.[91] The new king maneuvered between his desire to implement necessary modernising reforms, and the necessity to remain at peace with surrounding states.[92] His ideals led to the formation of the 1768 Bar Confederation, a rebellion directed against the Poniatowski and all external influence, which ineptly aimed to preserve Poland's sovereignty and privileges held by the nobility.[93] The failed attempts at government restructuring as well as the domestic turmoil provoked its neighbours to invade.[94] In 1772, the First Partition of the Commonwealth by Prussia, Russia, and Austria took place, an act which the Partition Sejm, under considerable duress, eventually ratified as a fait accompli.[95] Disregarding the territorial losses, in 1773 a plan of critical reforms was established, in which the Commission of National Education, the first government education authority in Europe, was inaugurated.[96] Corporal punishment of schoolchildren was officially prohibited in 1783. Poniatowski was the head figure of the Enlightenment, encouraged the development of industries, and embraced republican neoclassicism.[97] For his contributions to the arts and sciences, he was awarded a Fellowship of the Royal Society.[98] In 1791, the Great Sejm parliament adopted the 3 May Constitution, the first set of supreme national laws, and introduced a constitutional monarchy.[99] The Targowica Confederation, an organisation of nobles and deputies opposing the act, appealed to Catherine and caused the 1792 Polish–Russian War.[100] Fearing the reemergence of Polish hegemony, Russia and Prussia arranged and, in 1793, executed the Second Partition, which left the country deprived of territory and incapable of independent existence. On 24 October 1795, the Commonwealth was partitioned for the third time and ceased to exist as a territorial entity.[101][102] Stanisław Augustus, the last King of Poland, abdicated the throne on 25 November 1795.[103] Era of insurrections The Polish people rose several times against the partitioners and occupying armies. An unsuccessful attempt at defending Poland's sovereignty took place in the 1794 Kościuszko Uprising, where a popular and distinguished general Tadeusz Kościuszko, who had several years earlier served under George Washington in the American Revolutionary War, led Polish insurgents.[104] Despite the victory at the Battle of Racławice, his ultimate defeat ended Poland's independent existence for 123 years.[105] In 1806, an insurrection organised by Jan Henryk Dąbrowski liberated western Poland ahead of Napoleon's advance into Prussia during the War of the Fourth Coalition. In accordance with the 1807 Treaty of Tilsit, Napoleon proclaimed the Duchy of Warsaw, a client state ruled by his ally Frederick Augustus I of Saxony. The Poles actively aided French troops in the Napoleonic Wars, particularly those under Józef Poniatowski who became Marshal of France shortly before his death at Leipzig in 1813.[106] In the aftermath of Napoleon's exile, the Duchy of Warsaw was abolished at the Congress of Vienna in 1815 and its territory was divided into Russian Congress Kingdom of Poland, the Prussian Grand Duchy of Posen, and Austrian Galicia with the Free City of Kraków.[107] In 1830, non-commissioned officers at Warsaw's Officer Cadet School rebelled in what was the November Uprising.[108] After its collapse, Congress Poland lost its constitutional autonomy, army and legislative assembly.[109] During the European Spring of Nations, Poles took up arms in the Greater Poland Uprising of 1848 to resist Germanisation, but its failure saw duchy's status reduced to a mere province; and subsequent integration into the German Empire in 1871.[110] In Russia, the fall of the January Uprising (1863–1864) prompted severe political, social and cultural reprisals, followed by deportations and pogroms of the Polish-Jewish population. Towards the end of the 19th century, Congress Poland became heavily industrialised; its primary exports being coal, zinc, iron and textiles.[111][112] Second Polish Republic In the aftermath of World War I, the Allies agreed on the reconstitution of Poland, confirmed through the Treaty of Versailles of June 1919.[113] A total of 2 million Polish troops fought with the armies of the three occupying powers, and over 450,000 died.[114] Following the armistice with Germany in November 1918, Poland regained its independence as the Second Polish Republic.[115] The Second Polish Republic reaffirmed its sovereignty after a series of military conflicts, most notably the Polish–Soviet War, when Poland inflicted a crushing defeat on the Red Army at the Battle of Warsaw.[116] The inter-war period heralded a new era of Polish politics. Whilst Polish political activists had faced heavy censorship in the decades up until World War I, a new political tradition was established in the country. Many exiled Polish activists, such as Ignacy Jan Paderewski, who would later become prime minister, returned home. A significant number of them then went on to take key positions in the newly formed political and governmental structures. Tragedy struck in 1922 when Gabriel Narutowicz, inaugural holder of the presidency, was assassinated at the Zachęta Gallery in Warsaw by a painter and right-wing nationalist Eligiusz Niewiadomski.[117] In 1926, the May Coup, led by the hero of the Polish independence campaign Marshal Józef Piłsudski, turned rule of the Second Polish Republic over to the nonpartisan Sanacja (Healing) movement to prevent radical political organisations on both the left and the right from destabilising the country.[118] By the late 1930s, due to increased threats posed by political extremism inside the country, the Polish government became increasingly heavy-handed, banning a number of radical organisations, including communist and ultra-nationalist political parties, which threatened the stability of the country.[119] World War II World War II began with the Nazi German invasion of Poland on 1 September 1939, followed by the Soviet invasion of Poland on 17 September. As agreed in the Molotov–Ribbentrop Pact, Poland was split into two zones, one occupied by Nazi Germany, the other by the Soviet Union. The wartime resistance movement, and the Armia Krajowa (Home Army), fought against the occupation. It was one of the three largest resistance movements of the entire war, and encompassed a range of clandestine activities, which functioned as an underground state complete with degree-awarding universities and a court system.[120] The resistance was loyal to the Polish Government in Exile and generally resented the idea of a post-war communist Poland; for this reason, in the summer of 1944 it initiated Operation Tempest, of which the Warsaw Uprising that began on 1 August 1944 is the best-known operation.[121][122] Poland made the fourth-largest troop contribution in Europe,[123][124][125] and its troops served both the exiled government in the west and Soviet leadership in the east. Polish troops played an important role in the Normandy, Italian, North African Campaigns and Netherlands and are particularly remembered for the Battle of Britain and Battle of Monte Cassino.[126][127] Polish intelligence operatives proved extremely valuable to the Allies, providing much of the intelligence from Europe and beyond,[128] Polish code breakers were responsible for cracking the Enigma cipher and Polish scientists participating in the Manhattan Project were co-creators of the American atomic bomb. In the east, the Soviet-backed Polish 1st Army distinguished itself in the battles for Warsaw and Berlin.[121] The actions undertaken by both occupiers within Polish territory were genocidal. In 1939–1941, the Soviets deported hundreds of thousands of Poles and the Soviet NKVD executed thousands of Polish prisoners of war ahead of Operation Barbarossa, notably in the Katyn massacre.[129] Around 150,000 Polish civilians were killed by Soviets during the Soviet Union's occupation of eastern Poland (Kresy). Similarly, German planners had in November 1939 called for \"the complete destruction of all Poles\" and their fate as outlined in the Generalplan Ost;[130] six German extermination camps were established in occupied Poland, including Treblinka, Majdanek and Auschwitz. The Germans transported millions of Jews from across occupied Europe to be murdered in those camps.[131][132] Altogether, 3 million Polish Jews[133][134] – approximately 90% of Poland's pre-war Jewry – and between 1.8 and 2.8 million ethnic Poles[135][136][137] were killed, including up to 100,000 members of the Polish intelligentsia. The Romani people were also exterminated.[138] During the Warsaw Uprising alone, over 150,000 Polish civilians were killed, most were murdered by the Germans during the Wola and Ochota massacres.[139][140] At least 100,000 Poles were also murdered by the Ukrainian Insurgent Army (UPA) between 1943 and 1944 in what became known as the Wołyń Massacres.[141][142] Of all the countries in the war, Poland lost the highest percentage of its citizens: around 6 million perished – more than one-sixth of Poland's pre-war population – half of them Polish Jews.[143][144][145] About 90% of deaths were non-military in nature.[146] In 1945, Poland's borders were shifted westwards. Over two million Polish inhabitants of Kresy were expelled along the Curzon Line by Stalin.[147] The western border became the Oder-Neisse line. As a result, Poland's territory was reduced by 20%, or 77,500 square kilometres (29,900 sq mi). The shift forced the migration of millions of other people, most of whom were Poles, Germans, Ukrainians, and Jews.[148][149][150] Post-war communism At the insistence of Joseph Stalin, the Yalta Conference sanctioned the formation of a new provisional pro-Communist coalition government in Moscow, which ignored the Polish government-in-exile based in London. This action angered many Poles who considered it a betrayal by the Allies.[151] In 1944, Stalin had made guarantees to Churchill and Roosevelt that he would maintain Poland's sovereignty and allow democratic elections to take place. However, upon achieving victory in 1945, the elections organised by the occupying Soviet authorities were falsified and were used to provide a veneer of legitimacy for Soviet hegemony over Polish affairs.[152][153][154] The Soviet Union instituted a new communist government in Poland, analogous to much of the rest of the Eastern Bloc. As elsewhere in Communist Europe, the Soviet influence over Poland was met with armed resistance from the outset which continued into the 1950s.[155] Despite widespread objections, the new Polish government accepted the Soviet annexation of the pre-war eastern regions of Poland[156] (in particular the cities of Wilno and Lwów) and agreed to the permanent garrisoning of Red Army units on Poland's territory. Military alignment within the Warsaw Pact throughout the Cold War came about as a direct result of this change in Poland's political culture. In the European scene, it came to characterise the full-fledged integration of Poland into the brotherhood of communist nations.[157] The new communist government took control with the adoption of the Small Constitution on 19 February 1947. The Polish People's Republic (Polska Rzeczpospolita Ludowa) was officially proclaimed in 1952.[158][159] In 1956, after the death of Bolesław Bierut, the régime of Władysław Gomułka became temporarily more liberal, freeing many people from prison and expanding some personal freedoms. Collectivisation in the Polish People's Republic failed. A similar situation repeated itself in the 1970s under Edward Gierek, but most of the time persecution of anti-communist opposition groups persisted. Despite this, Poland was at the time considered to be one of the least oppressive states of the Eastern Bloc.[160] Labour turmoil in 1980 led to the formation of the independent trade union \"Solidarity\" (\"Solidarność\"), which over time became a political force.[161] Despite persecution and imposition of martial law in 1981 by General Wojciech Jaruzelski, it eroded the dominance of the Polish United Workers' Party and by 1989 had triumphed in Poland's first partially free and democratic parliamentary elections since the end of the Second World War. Lech Wałęsa, a Solidarity candidate, eventually won the presidency in 1990.[162][163][164] The Solidarity movement heralded the collapse of communist regimes and parties across Europe.[165] Third Polish Republic A shock therapy programme, initiated by Leszek Balcerowicz in the early 1990s, enabled the country to transform its Soviet-style planned economy into a market economy.[166] As with other post-communist countries, Poland suffered temporary declines in social, economic, and living standards,[167] but it became the first post-communist country to reach its pre-1989 GDP levels as early as 1995, although the unemployment rate increased.[168] Poland became a member of the Visegrád Group in 1991,[169] and joined NATO in 1999.[170] Poles then voted to join the European Union in a referendum in June 2003,[171] with Poland becoming a full member on 1 May 2004, following the consequent enlargement of the union.[172] Poland joined the Schengen Area in 2007, as a result of which, the country's borders with other member states of the European Union were dismantled, allowing for full freedom of movement within most of the European Union.[173] On 10 April 2010, the President of Poland Lech Kaczyński, along with 89 other high-ranking Polish officials died in a plane crash near Smolensk, Russia.[174] In 2011, the ruling Civic Platform won parliamentary elections.[175] In 2014, the Prime Minister of Poland, Donald Tusk, was chosen to be President of the European Council, and resigned as prime minister.[176] The 2015 and 2019 elections were won by the national-conservative Law and Justice Party (PiS) led by Jarosław Kaczyński,[177][178] resulting in increased Euroscepticism and increased friction with the European Union.[179] In December 2017, Mateusz Morawiecki was sworn in as the Prime Minister, succeeding Beata Szydlo, in office since 2015. President Andrzej Duda, supported by Law and Justice party, was re-elected in the 2020 presidential election.[180] As of November 2023[update], the Russian invasion of Ukraine had led to 17 million Ukrainian refugees crossing the border to Poland.[181] As of November 2023[update], 0.9 million of those had stayed in Poland.[181] In October 2023, the ruling Law and Justice (PiS) party won the largest share of the vote in the election, but lost its majority in parliament. In December 2023, Donald Tusk became the new Prime Minister leading a coalition made up of Civic Coalition, Third Way, and The Left. Law and Justice became the leading opposition party.[182] Geography Poland covers an administrative area of 312,722 km2 (120,743 sq mi), and is the ninth-largest country in Europe. Approximately 311,895 km2 (120,423 sq mi) of the country's territory consists of land, 2,041 km2 (788 sq mi) is internal waters and 8,783 km2 (3,391 sq mi) is territorial sea.[183] Topographically, the landscape of Poland is characterised by diverse landforms, water bodies and ecosystems.[184] The central and northern region bordering the Baltic Sea lie within the flat Central European Plain, but its south is hilly and mountainous.[185] The average elevation above the sea level is estimated at 173 metres.[183] The country has a coastline spanning 770 km (480 mi); extending from the shores of the Baltic Sea, along the Bay of Pomerania in the west to the Gulf of Gdańsk in the east.[183] The beach coastline is abundant in sand dune fields or coastal ridges and is indented by spits and lagoons, notably the Hel Peninsula and the Vistula Lagoon, which is shared with Russia.[186] The largest Polish island on the Baltic Sea is Wolin, located within Wolin National Park.[187] Poland also shares the Szczecin Lagoon and the Usedom island with Germany.[188] The mountainous belt in the extreme south of Poland is divided into two major mountain ranges; the Sudetes in the west and the Carpathians in the east. The highest part of the Carpathian massif are the Tatra Mountains, extending along Poland's southern border.[189] Poland's highest point is the northwestern summit of Rysy at 2,500 metres (8,202 ft) in elevation, located in the Tatras.[190] The highest summit of the Sudetes massif is Mount Śnieżka at 1,603.3 metres (5,260 ft), shared with the Czech Republic.[191] Once believed to be Raczki Elbląskie, the lowest point in Poland is now situated at Marzęcino on the Vistula Fens, which is 2.2 metres (7.2 ft) below sea level.[192] Poland's longest rivers are the Vistula, the Oder, the Warta, and the Bug.[183] The country also possesses one of the highest densities of lakes in the world, numbering around ten thousand and mostly concentrated in the north-eastern region of Masuria, within the Masurian Lake District.[193] The largest lakes, covering more than 100 square kilometres (39 sq mi), are Śniardwy and Mamry, and the deepest is Lake Hańcza at 108.5 metres (356 ft) in depth.[183] Climate The climate of Poland is temperate transitional, and varies from oceanic in the north-west to continental in the south-east.[194] The mountainous southern fringes are situated within an alpine climate.[194] Poland is characterised by warm summers, with a mean temperature of around 20 °C (68.0 °F) in July, and moderately cold winters averaging −1 °C (30.2 °F) in December.[195] In summer, maximum temperatures can reach 40 °C (104.0 °F), while in winter in the Tatra Mountains and Bieszczady Mountains they can even drop below −30 °C (−22.0 °F). The warmest and sunniest part of Poland is Lower Silesia in the southwest and the coldest region is the northeast corner, around Suwałki and Olecko where the climate is affected by cold fronts from Scandinavia and Siberia.[196] Precipitation is more frequent during the summer months, with highest rainfall recorded from June to September.[195] There is a considerable fluctuation in day-to-day weather and the arrival of a particular season can differ each year.[194] Climate change and other factors have further contributed to interannual thermal anomalies and increased temperatures; the average annual air temperature between 2011 and 2020 was 9.33 °C (48.8 °F), around 1.11 °C higher than in the 2001–2010 period.[196] Winters are also becoming increasingly drier, with less snowfall.[194] Biodiversity Phytogeographically, Poland belongs to the Central European province of the Circumboreal Region within the Boreal Kingdom. The country has four Palearctic ecoregions – Central, Northern, Western European temperate broadleaf and mixed forest, and the Carpathian montane conifer. Forests occupy 31% of Poland's land area, the largest of which is the Lower Silesian Wilderness.[197] The most common deciduous trees found across the country are oak, maple, and beech; the most common conifers are pine, spruce, and fir.[198] An estimated 69% of all forests are coniferous.[199] The flora and fauna in Poland is that of Continental Europe, with the wisent, white stork and white-tailed eagle designated as national animals, and the red common poppy being the unofficial floral emblem.[200] Among the most protected species is the European bison, Europe's heaviest land animal, as well as the Eurasian beaver, the lynx, the gray wolf and the Tatra chamois.[183] The region was also home to the extinct aurochs, the last individual dying in Poland in 1627.[201] Game animals such as red deer, roe deer, and wild boar are found in most woodlands.[202] Poland is also a significant breeding ground for migratory birds and hosts around one quarter of the global population of white storks.[203] Around 315,100 hectares (1,217 sq mi), equivalent to 1% of Poland's territory, is protected within 23 Polish national parks, two of which – Białowieża and Bieszczady – are UNESCO World Heritage Sites.[204] There are 123 areas designated as landscape parks, along with numerous nature reserves and other protected areas under the Natura 2000 network.[205] Government and politics Poland is a unitary semi-presidential republic[4] and a representative democracy, with a president as the head of state.[210] The executive power is exercised further by the Council of Ministers and the prime minister who acts as the head of government.[210] The council's individual members are selected by the prime minister, approved by parliament and sworn in by the president.[210] The head of state is elected by popular vote for a five-year term.[211] The current president is Karol Nawrocki[212] and the prime minister is Donald Tusk. Poland's legislative assembly is a bicameral parliament consisting of a 460-member lower house (Sejm) and a 100-member upper house (Senate).[213] The Sejm is elected under proportional representation according to the d'Hondt method for vote-seat conversion.[214] The Senate is elected under the first-past-the-post electoral system, with one senator being returned from each of the one hundred constituencies.[215] The Senate has the right to amend or reject a statute passed by the Sejm, but the Sejm may override the Senate's decision with a majority vote.[216] With the exception of ethnic minority parties, only candidates of political parties receiving at least 5% of the total national vote can enter the Sejm.[215] Both the lower and upper houses of parliament in Poland are elected for a four-year term and each member of the Polish parliament is guaranteed parliamentary immunity.[217] Under current legislation, a person must be 21 years of age or over to assume the position of deputy, 30 or over to become senator and 35 to run in a presidential election.[217] Members of the Sejm and Senate jointly form the National Assembly of the Republic of Poland.[218] The National Assembly, headed by the marshal of the Sejm, or marshal of the Senate in their absence, is formed on three occasions – when a new president takes the oath of office; when an indictment against the president is brought to the State Tribunal; and in case a president's permanent incapacity to exercise his duties due to the state of his health is declared.[218] According to International IDEA's Global State of Democracy (GSoD) Indices and Democracy Tracker, Poland performs in the mid-range on overall democratic measures, with particular weaknesses in civic engagement and judicial independence.[219][220][221] Administrative divisions Poland is divided into 16 provinces or states known as voivodeships.[222] As of 2022, the voivodeships are subdivided into 380 counties (powiats), which are further fragmented into 2,477 municipalities (gminas).[222] Major cities normally have the status of both gmina and powiat.[222] The provinces are largely founded on the borders of historic regions, or named for individual cities.[223] Administrative authority at the voivodeship level is shared between a government-appointed governor (voivode), an elected regional assembly (sejmik) and a voivodeship marshal, an executive elected by the assembly.[223] Law The Constitution of Poland is the enacted supreme law, and Polish judicature is based on the principle of civil rights, governed by the code of civil law.[225] The current democratic constitution was adopted by the National Assembly of Poland on 2 April 1997; it guarantees a multi-party state with freedoms of religion, speech and gatherings, prohibits the practices of forced medical experimentation, torture or corporal punishment, and acknowledges the inviolability of the home, the right to form trade unions, and the right to strike.[226] The judiciary in Poland is composed of the Supreme Court as the country's highest judicial organ, th"
}