{
  "url": "https://www.ecb.europa.eu/euro/html/index.en.html",
  "title": "Overview of the euro",
  "text": "Overview of the euro The euro brings us all together The euro unites us – it’s used by about 358 million people across 21 European Union countries. The euro is a beacon of stability and a symbol of European unity. It’s also one of the most trusted currencies in the world. Here at the European Central Bank, we work to safeguard its value. The euro banknotes and coins in our pockets are an everyday reminder of what the European Union means for us: greater freedom, convenience and opportunity. Euro cash is here to stay. However, we’re also preparing for the possibility of a digital euro – we’re making sure our currency keeps meeting people’s changing needs. How does the euro benefit Europeans? The euro makes our lives simpler by enabling citizens to live, work and study abroad more easily. At the ECB, we safeguard the euro so that you can make the most of all that Europe has to offer. Watch how the euro improves your lifeHow does the euro help Europeans do business? Small and medium-sized enterprises form the backbone of the euro area economy. Using a common currency allows businesses to grow as it reduces costs and risks, and encourages investment. Watch how small businesses benefit from the euroPreparing our euro for a digital future To future-proof our money, we are also preparing for a possible digital euro. It would be like cash, but digital – allowing you to make and receive payments online and offline across the euro area, without additional costs. Learn more about the digital euroOur euro banknotes Our euro banknotes symbolise the integration, openness and cooperation between the people of Europe. The design elements and security features make our banknotes unique. Explore euro banknotes in 3DFuture banknotes We are developing future banknotes to make them even more secure, sustainable and relatable to Europeans of all ages and backgrounds. Find out about the different steps in the process and how you can get involved. Euro coins The euro unites us in diversity, as reflected by the two sides of our coins. They have a common side symbolising unity and a national side showcasing our rich and diverse cultural heritage. Learn more about your euro coinsThe Eurosystem cash strategy To ensure that you remain free to choose cash as a way to pay both now and in the future, the ECB and the central banks of the euro area are working to ensure that cash remains accessible to all. We will make sure it remains an accepted, competitive and reliable means of payment and a store of value. Our strategic objectives for cashDiscover more about euro-related topics Data on banknote circulation We carefully study the circulation of and demand for euro banknotes, so that you will always have access to euro banknotes. Statistics on banknote and coin circulationThe international role of the euro The euro is one of the most important currencies in the world. We keep an eye on and report on the use of the euro outside the euro area. Read our most recent report"
}