{
  "url": "https://play.google.com/store/apps/details?id=com.tumblr&hl=fr",
  "title": "Tumblr – Fandom, Art, Chaos – Applications sur Google Play",
  "text": "Tumblr, le terreau fertile de vos créations artistiques préférées. Venez pour découvrir l'effervescence des œuvres qui s'expriment dans toutes les saveurs du fandom, restez pour les sublimes créations de ces mêmes artistes. En parallèle, redécouvrez l'énergie ancestrale des Internets, les mèmes, et tous les fandoms dont vous rêviez. Contribuez, vous aussi, ou naviguez tout simplement jusqu'à étancher votre soif. Chaque création qui vous mettra en émoi, chaque GIF de chat qui vous émoustillera, chaque citation que vous rebloguerez ou chaque tag que vous découvrirez… tout ça, c'est VOUS et rien que VOUS. Rebloguez vos contenus préférés pour montrer au monde ce qui vous fait vibrer. Tumblr est un immense terrain de jeux ; libre à vous de vous amuser avec les autres ou d'inventer vos propres règles. Si vous êtes un artiste, vous trouverez ici une communauté bienveillante qui saura apprécier vos créations. Imaginez Tumblr comme un studio connecté proposant diverses options : votre portfolio, votre carte de visite accompagnée d'un engagement social et d'une communauté, ou votre espace créatif pour élaborer vos idées et recueillir des retours. Acceptez des demandes et des commissions ou participez à des défis artistiques. Concevez des personnages originaux. Mettez en vente des posters ou divers objets pour satisfaire une audience déjà acquise ou en quête de ce genre de créations via notre Artist Alley. Maintenant, imaginez tout ça mais au bout des doigts. Voilà, vous avez Tumblr ! - Si vous en avez entendu parler ailleurs, cela a probablement démarré ici. Cette peinture numérique qui ne quitte pas vos pensées, ce billet qui vous explique en détail quelque chose que vous n'imaginiez pas avoir besoin de connaître à ce point, et ces fandoms auxquels vous souhaitez prendre part : Pokémon ! D'n'D ! Marvel ! Kpop ! Minecraft ! Star Wars ! Doctor Who ! Vous avez saisi : TOUT est là. Votre tableau de bord deviendra un caléidoscope mélangeant toutes les choses merveilleuses, étranges et fantastiques que vous aimez. Que vous soyez loquace et adepte des publications, timide et plutôt porté sur les likes, ou que vous préfériez rester à distance derrière votre écran : vous trouverez toujours une communauté à votre image. Si vous avez un truc à dire, allez-y franco avec une photo, une vidéo ou en rédigeant un billet. Publiez un billet audio contenant vos dernières élucubrations ou partagez votre dernière chanson favorite avec Spotify. Vous pouvez même utiliser nos billets préformatés à la manière d'un tchat pour vos citations approximatives. Les reblogs permettent d'engager la conversation avec les utilisateurs, et déclenchent des vannes lolesques qui se poursuivent encore et toujours… parfois dans le monde entier et à travers les années. Tout ce que vous enverrez dans cet éther numérique se propagera telle une traînée de poudre. (Sauf, bien évidemment, si vous limitez les réglages des reblogs au niveau de votre billet. Blog privé ? Billet privé ? Tout est paramétrable.) Si la perspective de créer, rebloguer, tisser des liens ou de partir à la découverte vous paraît intimidante, n'hésitez pas à consulter nos astuces via equipe.tumblr.com/tagged/astuces%20Tumblr. Vous pouvez également consulter le blog tips.tumblr.com en version anglaise, spécialement concocté par Cat Frazier de animatedtext.tumblr.com. N'attendez plus : inscrivez-vous. Découvrez vos nouveaux coups de cœur artistiques, suivez des tags et façonnez un tableau de bord qui vous ressemble. Puis rebloguez, aimez et publiez ce qui vous fait vibrer. Ou naviguez juste librement dans cet océan des Internets dont les vagues reflètent votre image et vos goûts. Twitter : https://twitter.com/tumblr/ Instagram : https://www.instagram.com/tumblr/ CGU : https://www.tumblr.com/policy/fr/terms-of-service Date de mise à jour 30 janv. 2026"
}