{
  "url": "https://www.thinkbabynames.com/meaning/1/Brian",
  "title": "Brian - Name Meaning, What does Brian mean?",
  "text": "Home > Brian♂ Brian What does Brian mean?Brian ▼ as a boys' name is pronounced BRY-en. It is of Celtic, Irish and Gaelic origin, and the meaning of Brian is \"high, noble\". Could also mean \"strength\". Historical: Brian Boru (10th century) was a warrior who became high king of Ireland and one of its greatest national heroes. He liberated the country from the Danes in 1014. Actor Brian Dennehy; film director Brian De Palma.STARTS/ENDS WITH Br-, -anASSOCIATED WITH irish, noble, strength, warrior, king, heroesVariationsVARIANTS Brain, Bri, Briano, Briant, Brien, Brion, Bryan▼, Bryant▼, Bryent, Brye, Bryen, Bryent, Bryon▼, O'Brien SEE ALSO Briley FEMININE FORMS Brianda, Brianna, BrieCREATIVE FORMS(male) Brine, .. (female) Brine, .. MIDDLE NAME PAIRINGSBrian Malek (B.M.), .. How popular is Brian?Brian is a very popular first name for men (#20 out of 1220, Top 2%) and also a very popular last name for all people (#7327 out of 150436, Top 5%). (2000 U.S. CENSUS)Brian was first listed in 1910-1919 and reached its peak rank of #8 in the U.S. during 1970-1979, and is presently at #235. (TOP 2000 NAMES, 2018) Which version is better? Bryan (#232 THE PREVIOUS YEAR), Bryant (#684), Brain, Brien, Briley, Brion and Bryon are the popular alternative forms of Brian (#235). These forms of Brian were at the apex of their popularity during the years 1970-1979 (USAGE OF 2.5%) and are now much less common (USAGE 0.2%, 91.9% LESS). Similar NamesBrian▼ is alike in pronunciation to Bran, Brann, Bren, Brenn, Bron, Brown, Bruin and Bryn. Other suggested similar-sounding names are Abrian, Adrian▲, Aran, Ardian, Arian, Arlan, Arman, Arnan, Arran, Bain, Ban, Bevan, Bivian, Boban, Brad▼, Bradan, Brae, Bram, Brand, Brant▼, Bray, Brenan, Brice▼, Brick, Brigg, Brik, Brily (see Briley), Brit, Briton, Britt, Brittan, Brogan, Byran, Cian, Darian, Dorian▲, Edrian, Eian, Eirian, Elian▲, Eran, Erman, Ernan, Evian, Fran, Frean, Gian, Jian, Jorian, Jurian, Kian▲, Oran▼, Orjan, Orlan, Orman, Orran, Rian, Stian and Urban. These names tend to be less commonly used than Brian.See names in meaning and etymology.< PrevNext > [Top]"
}