{
  "url": "https://granny.gg/",
  "title": "Granny | Play Online",
  "text": "Granny Granny is a first-person survival horror game where players must escape from a sinister old woman’s house while avoiding her watchful presence. Trapped inside a dark and eerie home, the player has only five days to find a way out by solving puzzles, collecting key items, and unlocking doors. However, Granny is always listening, reacting to every noise, and relentlessly hunting the player down. If she catches them, they will be knocked out and lose a day, increasing the tension as time runs out. The game’s chilling atmosphere, dimly lit rooms, and suspenseful sound design create a terrifying experience that keeps players on edge. With multiple difficulty levels and hidden secrets, Granny offers a variety of challenges that test the player’s stealth and problem-solving skills. The house is filled with traps, creaky floors, and locked doors, requiring players to move carefully and think strategically to avoid capture. The game also includes different escape routes, encouraging replayability as players attempt to discover every possible way out. Controls - Move around – WASD - Look around – Mouse - Interact with or pick up object – E - Drop object – Spacebar - Crouch – C - Hide – R (next to a hiding place) - Break free from bear traps – Hold F Gameplay Mechanics 1. Stealth and Survival Granny is always on the prowl, and making too much noise will immediately alert her to the player’s presence. Hiding under beds, inside wardrobes, and crouching to move quietly are essential survival tactics. If caught, Granny will knock the player out, and they will wake up in the starting room with one day lost. 2. Puzzle Solving The house is filled with puzzles and locked doors that require various items to unlock. Players must find keys, hammers, cutting pliers, and code combinations to progress. Logical thinking and thorough exploration are crucial to escaping successfully. 3. Multiple Escape Routes The game offers different escape routes, keeping each playthrough fresh. Players can escape through the front door by disabling security measures or find an alternative way out, such as using a hidden passage or repairing a broken vehicle in the garage. 4. Difficulty Levels and Modes The game features multiple difficulty levels from 1 to 5. Level 1 is a practice mode where Granny is absent, allowing players to explore freely and familiarize themselves with the layout. Level 2 introduces Granny at her slowest speed. Level 3 makes her move at regular speed and introduces creaking floors. Level 4 makes Granny move faster and adds an extra lock to the maindoor. Level 5 makes her move faster than you and adds an two extra locks to the maindoor. Strategies for Survival - Move Slowly and Quietly: Avoid unnecessary noise by crouching and walking instead of running. - Use Hiding Spots Wisely: If Granny is chasing you, quickly hide under a bed or inside a closet to avoid capture. - Memorize Key Locations: The house has multiple rooms and hidden areas; learning the layout helps in finding escape tools efficiently. - Use Distractions: Dropping objects can lure Granny to a specific location, allowing you to move in the opposite direction safely. Granny Unblocked Our website provides access to the unblocked version of Granny, allowing players to experience this intense survival horror game without any restrictions. Whether you’re at school, work, or on a restricted network, you can immerse yourself in the suspense and challenge anytime."
}