{
  "url": "https://en.wikipedia.org/wiki/Belmont,_Massachusetts",
  "title": "Belmont, Massachusetts - Wikipedia",
  "text": "Belmont, Massachusetts Belmont is a town in Middlesex County, Massachusetts, United States. It is a western suburb of Boston and is part of the Greater Boston metropolitan area. As of the 2020 U.S. census, its population was 27,295, an increase of 10.4% from 2010.[2] History [edit]Belmont was established on March 18, 1859, by former citizens of, and on land from the bordering towns of, Watertown, to the south; Waltham, to the west; and Arlington, then known as West Cambridge, to the north. The founders desired a dry township (alcohol is now legal to purchase in Belmont). The town was named after Bellmont, the 200-acre (0.8 km2) estate of the largest donor to its creation, John Perkins Cushing, after which Cushing Square is named. After Cushing's estate nearly burned to the ground, it was converted to a Belmont Public Library branch. The easternmost section of the town, including the western portion of Fresh Pond, was annexed by Cambridge in 1880.[3] The annexation was the result of a dispute over a slaughterhouse licensed in 1878[4] and situated next to Fresh Pond; Cambridge wished to protect Fresh Pond (part of its water supply network) by removing neighboring buildings.[5] Before its incorporation, Belmont was an agrarian town, with several large farms servicing Boston for produce and livestock. It remained largely agrarian until the turn of the 20th century, when trolley service was introduced and roads were improved, making it more attractive as a residential area, most notably for the building of large estates. Belmont's population grew by over 70 percent during the 1920s.[6] Other commercial enterprises in Belmont included clay mining and waste management. The reclamation of a large dump and quarry off Concord Avenue into sites for the Belmont High School and the Clay Pit Pond is a lasting example of environmental planning. With the introduction of automobiles and highways, Belmont continued its transition to a commuter-based suburb throughout the 20th century.[citation needed] The John Birch Society was headquartered in Belmont from its founding in 1958 until its relocation to Appleton, Wisconsin, in 1989. The building at 395 Concord Avenue later became the headquarters of the National Association for Armenian Studies and Research (NAASR), which is expanding and renovating its facility as of 2019[update].[7] Railroad history [edit]Belmont was once served by two railroads, the Fitchburg Railroad and the Central Massachusetts Railroad, both of which later became part of the Boston & Maine Railroad system. Originally the two railroads each had their own separate trackage through town, but in 1952 the Central Mass tracks were removed between Hill's Crossing and Clematis Brook (Waltham),[8] and rail traffic was rerouted over the Fitchburg line.[citation needed] Presently, the MBTA operates the Fitchburg Line through Belmont as part of its MBTA commuter rail service. Passenger service on the line terminates at Wachusett station in Fitchburg. The station stops at Belmont Center and Waverley were once level crossings, and pedestrian and vehicle traffic had to cross directly over rails on public roads. In 1907, a stone arch bridge, elevated embankment, and station building were constructed such that the track runs over the road.[citation needed] At Waverley, the grade was lowered so that the tracks ran under Trapelo Road, though the platform did not have an enclosed structure there.[citation needed] A second historic railroad station building exists in Belmont, though it is not obvious. The one-room Wellington Hill Station was built in the 1840s as a private school, not far from its current location in Belmont Center. It was then used by the Fitchburg Railroad from 1852 to 1879. When the railroad decided to replace the station with a larger structure, the building was moved to the Underwood Estate and used as a summer house. In 1974, the station was donated to the Belmont Historical Society. It was restored and moved to its current location in 1980.[citation needed] As of 2024, plans are underway[9] to construct the Belmont Community Path, a rail trail across Belmont, using the abandoned Central Massachusetts Railroad right-of-way along the existing Fitchburg Line tracks. When completed this trail will be part of the Mass Central Rail Trail. Present day [edit]Belmont remains a primarily residential suburb, with little population growth since the 1950s. It is best known for the mansion-filled Belmont Hill neighborhood, although most residents live in more densely settled, low-lying areas around the Hill. There are three major commercial centers in the town: Belmont Center in the center, Cushing Square in the south, and Waverley Square in the west. Town Hall and other civic buildings are in Belmont Center. Large tracts of land from former farms and greenhouse estates form public or publicly accessible areas such as Rock Meadow, Habitat, portions of the McLean Hospital tract and various town fields.[citation needed] Geography [edit]According to the United States Census Bureau, the town has an area of 4.7 square miles (12.2 km2), of which 4.7 square miles (12.1 km2) is land and less than 0.1 square miles (0.1 km2), or 1.06%, is water. Belmont is bordered by Cambridge on the east, Arlington on the north, Lexington on the northwest, Waltham on the west, and Watertown on the south. Environmental concerns [edit]In 2002, Middlesex County was ranked in the worst 10% of polluted counties in the United States in terms of air and water pollution.[10] Two companies that ranked in the top 10 for polluters in the county were Polaroid Corporation in Waltham and the Cambridge Plating Company in Belmont, which is several hundred feet from Belmont High School. The Environmental Protection Agency fined Cambridge Plating Company, now operated by Purecoat North LLC, in 2002 following various violations[11] and in 2004 after a fire that led to an accumulation of toxic wastewater.[12] The chemicals released were trichloroethylene and dichloromethane, both of which have been shown to cause cancer. These chemicals are released into the air so it is difficult to trace them and to determine the source, as there are also several other industries in the area that release the same pollutants. Demographics [edit]As of 2020[update], there were 27,295 residents of the Town of Belmont, and in 2021 there were 17,640 registered voters.[23] In 2020, the racial make up of the town was 69.6% White, 1.9% Black or African American, 0.05% Native American, 18.5% Asian, and 4.7% from two or more races. Hispanic or Latino of any race were 4.7% of the population.[2] Pending the release of the 2020 Census results, in 2010 6.3% of the population were under the age of five, 24.6% were under the age of eighteen, and 15.8% were 65 years of age or older; 53% were female. The median household income was $114,141.[24] The 2000 census listed 9,732 households, out of which 31.0% had children under the age of 18 living with them, 54.9% were married couples living together, 8.8% had a female householder with no husband present, and 33.7% were non-families. 25.9% of all households were made up of individuals, and 11.9% had someone living alone who was 65 years of age or older. The average household size was 2.45 and the average family size was 3.01. In 2010, 20% of the residents of Belmont were born outside of the United States. In 2000 this percentage was 15%.[25] Belmont has been referred to as a \"Mormon enclave\"[26] due to the location of the Boston Massachusetts Temple of the LDS Church at the highest elevation in the town. The prominent gold statue of the Angel Moroni atop the Temple was originally designed by Cyrus Dallin in nearby Arlington, Massachusetts. Points of interest [edit]- Redtop, home of William Dean Howells - Edwin O. Reischauer Memorial House - Boston & Maine Railroad Station, now known as the MBTA Commuter Rail Belmont stop, now owned by the Lions Club - Boston Massachusetts Temple of the LDS Church - William Flagg Homer House Government [edit]The executive branch of the town government consists of a three-person Select Board elected by the residents.[27] The Select Board appoints a Town Administrator who is in charge of daily operations. The legislative branch is a representative town meeting, with eight districts each electing 36 representatives, plus ex-officio members and a Town Moderator to run the annual meeting.[28] Belmont is part of the 24th Middlesex District (for the Massachusetts House of Representatives), the 2nd Middlesex and Suffolk District (for the Massachusetts Senate), and Massachusetts's 5th congressional district (for the United States House of Representatives). Education [edit]Belmont is served by the Belmont Public Schools, governed by an independently elected school committee.[28] There are four public elementary schools in Belmont: the Mary Lee Burbank, Daniel Butler, Winn Brook, and Roger Wellington schools. The Mary Lee Burbank School was founded in 1931. Two other public elementary schools, Payson Park and Kendall, were closed in the 1970s and 1980s, respectively. The former closed after being destroyed by fire, the latter closed due to population shifts and was converted to an arts center, which was later also destroyed by fire. There is one public upper elementary school, the Winthrop L. Chenery Upper Elementary School, which was rebuilt on the same location after an electrical fire damaged the auditorium in 1995. There is one public middle school, located near the High School, the Belmont Middle School. There is one public high school, the Belmont High School. Belmont High is noted for its college placement, strong athletics, academics, music, and theater arts; a typical class size of about 320 students. Belmont High regularly feeds 5-10 students into Harvard University on an average given year. As of 2009[update], U.S. News & World Report gave Belmont High School a gold medal and named it the 100th best public high school in the United States and the second best in the state of Massachusetts (after Boston Latin School). Belmont Hill School is a private, non-sectarian high school, grades 7–12. Belmont Day School is a private, non-sectarian Pre-K–8 school. There are several smaller private schools. Media [edit]The Belmont Citizen-Herald is a weekly newspaper covering Belmont, and published on Thursdays, and is available online, as well.[29] The Citizen-Herald was formed in 1988 by merging the Belmont Citizen (founded in 1920) and the Belmont Herald (founded in 1930). The Boston Globe and Boston.com publish a Belmont Your Town website that provides local news and information. The Belmontonian is an independently operated hyper-local news website.[30] Belmont Patch also provides online local news.[31] The Belmont Voice (founded in 2023) is a nonprofit, hyperlocal weekly newspaper serving Belmont.[32] Belmont High School's student-led Belmont Highpoint[33] newspaper further highlights local points of view in the town.[34] The Belmont Media Center (BMC) was founded in 2005[35] as a local non-profit, public-educational & government access TV station mandated to provide and make available to Belmont residents a variety of media production & editing classes, locally produced TV programming, and video/TV equipment, studios and facilities. In 2017, BMC programs are available to Belmont subscribers of Comcast and Verizon, and BMC also carries live programming.[36] and on-demand programs[37] Infrastructure [edit]Transportation [edit]Roads [edit]Major roads in the town are Concord Avenue, which bisects the town from east to west; Common Street and Pleasant Street (Route 60) which travel north-south through Belmont; and Trapelo Road and Belmont Street, which run along the southern edge of the town. Belmont is served directly by two state route designated highways. Running close to the middle of town is Route 60, locally known as Pleasant Street. On the northern border, Route 2 generally outlines Belmont's boundary with the neighboring town of Arlington. Despite the small size of the town, Belmont has 5 signed exits on Route 2. Nearby major highways include I-95/MA-Route 128, Route 16, Route 3, and Route 20. Public transit [edit]Belmont is served by the Massachusetts Bay Transportation Authority's Fitchburg Commuter Rail line, and its bus and trackless trolley lines. Two MBTA Commuter Rail rail stations, Waverley and Belmont Center, are located in the town. Belmont is roughly 16 minutes away from the rail line's terminus at North Station, Boston. Nearby in Cambridge lies Alewife Station, the western terminus of the Red Line; providing a connection to Boston and the entire metropolitan rapid transit system. Health care [edit]McLean Hospital, a psychiatric hospital and research center located in Belmont. It is the setting of the novel Girl, Interrupted, which was made into a 1999 movie. Notable people [edit]Due to its proximity to Harvard University and Massachusetts Institute of Technology, amongst others, Belmont has had several Nobel Prize winners in residence at one time or another.[38] Notable past and present residents include people in the following categories: Business [edit]- John Perkins Cushing, China trader - Stephen P. Mugar, founder of the Star Market chain, philanthropist Politics and government [edit]- John Deutch, former Director of Central Intelligence - Martin Feldstein, former chairman of the Council of Economic Advisers - Henry Kissinger, former Secretary of State - Empress Masako, of Japan - Mitt Romney, and his wife Ann Romney – former Governor of Massachusetts, 2012 Republican presidential candidate, Senator from Utah - Dorothy Stoneman, activist, founder of YouthBuild USA Arts and music [edit]- Winslow Homer (1836–1910), painter - Frederick Law Olmsted, landscape architect - Walter Piston, composer - Billy Rath (1948-2014), bassist of The Heartbreakers[39] - Phil Wilson, jazz trombonist and arranger Media [edit]- Sebastian Junger (born 1962), author, journalist, documentary filmmaker - David E. Kelley, TV producer and writer - Leo Monahan (1926–2013), American sports journalist[40] - Addison Powell, actor[41] - Jean Rogers, actress Sports [edit]- Emily Cook, American freestyle skier - William Chandler Haskins, competed in the 1936 Summer Olympics[42] - Maxie Long, gold medalist in athletics at 1900 Olympic Games - Paul Mara, New York Rangers defenseman - Becca Pizzi, American marathon runner - Patrick Rissmiller, New York Rangers hockey forward - Patty Shea, Olympian in field hockey[43] - Wilbur Wood, Major League pitcher–Boston Red Sox, Pittsburgh Pirates, and Chicago White Sox Literature [edit]- Gerald Warner Brace, author and educator - Leah Hager Cohen, author - William Dean Howells, author - Talene Monahon, playwright/actress - Tom Perrotta, author Academics [edit]- Bernard Bailyn (1922-2020), American historian and professor - William P. Alford (born 1948), American professor and legal scholar - VA Shiva Ayyadurai (born 1963), MIT systems scientist and entrepreneur[44][45][46][47] - Vannevar Bush (1890–1974), MIT Dean of Engineering, helped create the National Science Foundation - Clayton M. Christensen, Harvard Business School professor and author - Thomas Vose Daily, Roman Catholic bishop - Bernard Davis (1916–1994), biologist, lived and died in Belmont - Wolfgang Ketterle, MIT physics professor (Nobel Prize in Physics, 2001) - Richard Marius, Reformationist scholar and novelist - Susan K. Martin, librarian - Shinichi Mochizuki, mathematician - Franco Modigliani, MIT economics professor (Nobel Memorial Prize in Economics, 1985) - Egon Orowan, MIT physicist and metallurgist - Edwin O. Reischauer, Harvard professor, East Asia scholar, and Ambassador to Japan - Paul A. Samuelson, MIT economics professor (Nobel Memorial Prize in Economics, 1970) - Dirk Jan Struik, HUAC victim and MIT mathematician - Steven C. Wheelwright, Harvard Business School professor and president of BYU-Hawaii - Fred Lawrence Whipple, astronomer [48] - Norbert Wiener, mathematician - Robert Burns Woodward, organic chemist (Nobel Prize in Chemistry, 1965) See also [edit]References [edit]- ^ \"Belmont Massachusetts\". Belmont Massachusetts. Archived from the original on September 10, 2012. Retrieved October 4, 2012. - ^ a b \"Map: See how each Mass. town has changed according to new census data\". The Boston Globe. Retrieved August 15, 2021. - ^ \"(17)\" (PDF). Archived from the original (PDF) on September 11, 2008. - ^ Belmont Historic District Commission, Belmont, Massachusetts: The Architecture and Development of The Town of Homes, 1984 - ^ Sinclair, Jill (February 13, 2009). \"Social Reform and the City\". Fresh Pond: The History of a Cambridge Landscape. MIT Press. pp. 64, 66. ISBN 978-0-262-19591-1. Retrieved December 29, 2023. Battles over Water Quality: Contemporary records show that, in the 1870s, there was little scientific agreement about the causes of any pollution to the pond's water, or about the best means of protection. [...] The alleged culprits [...] always seemed to be across the town borders in Arlington and, especially Belmont. [...] A report commissioned in 1879 concluded that the city needed to acquire a strip of land around the Fresh Pond shoreline up to fifty rods (about 825 feet) wide, to remove buildings from around the shore, and to annex the parts of the neighboring towns of Belmont and Arlington that abutted the pond. - ^ Schaeffer, K. H. and Elliott Sclar. Access for All: Transportation and Urban Growth. Columbia University Press, 1980. Accessed on Google Books. 86. Retrieved on January 16, 2010. ISBN 0-231-05165-4, ISBN 978-0-231-05165-1 - ^ \"National Association for Armenian Studies and Research (NAASR)\". NAASR. Archived from the original on May 3, 2018. Retrieved February 10, 2020. - ^ The Rail Lines of Southern New England - Ronald Dale Karr 1995 - ^ \"Belmont Community Path\". Belmont Community Path. n.d. Retrieved January 23, 2024. - ^ \"Who is Polluting?\". scorecard.goodguide.com. Archived from the original on September 13, 2012. - ^ \"09/20/2002: EPA Settles Enforcement Case With Cambridge Plating in Belmont\". archive.epa.gov. Retrieved April 18, 2019. - ^ \"Cambridge Plating slapped with $50K fine by EPA\". Boston Business Journal. Retrieved April 18, 2019. - ^ \"TOTAL POPULATION (P1), 2010 Census Summary File 1, All County Subdivisions within Massachusetts\". United States Census Bureau. Archived from the original on February 12, 2020. Retrieved September 13, 2011. - ^ \"Massachusetts by Place and County Subdivision - GCT-T1. Population Estimates\". United States Census Bureau. Archived from the original on January 6, 2012. Retrieved July 12, 2011. - ^ \"1990 Census of Population, General Population Characteristics: Massachusetts\" (PDF). US Census Bureau. December 1990. Table 76: General Characteristics of Persons, Households, and Families: 1990. 1990 CP-1-23. Archived from the original (PDF) on December 7, 2013. Retrieved July 12, 2011. - ^ \"1980 Census of the Population, Number of Inhabitants: Massachusetts\" (PDF). US Census Bureau. December 1981. Table 4. Populations of County Subdivisions: 1960 to 1980. PC80-1-A23. Archived from the original on August 5, 2010. Retrieved July 12, 2011. - ^ 1950 Census of Population (PDF), vol. 1: Number of Inhabitants, Bureau of the Census, 1952, Section 6, Pages 21-10 and 21-11, Massachusetts Table 6. Population of Counties by Minor Civil Divisions: 1930 to 1950, retrieved July 12, 2011 - ^ \"1920 Census of Population\" (PDF). Bureau of the Census. Number of Inhabitants, by Counties and Minor Civil Divisions. Pages 21-5 through 21-7. Massachusetts Table 2. Population of Counties by Minor Civil Divisions: 1920, 1910, and 1920. Retrieved July 12, 2011. - ^ \"1890 Census of the Population\" (PDF). Department of the Interior, Census Office. Pages 179 through 182. Massachusetts Table 5. Population of States and Territories by Minor Civil Divisions: 1880 and 1890. Retrieved July 12, 2011. - ^ \"1870 Census of the Population\" (PDF). Department of the Interior, Census Office. 1872. Pages 217 through 220. Table IX. Population of Minor Civil Divisions, &c. Massachusetts. Archived from the original on August 8, 2010. Retrieved July 12, 2011. - ^ \"1860 Census\" (PDF). Department of the Interior, Census Office. 1864. Pages 220 through 226. State of Massachusetts Table No. 3. Populations of Cities, Towns, &c. Archived from the original on August 8, 2010. Retrieved July 12, 2011. - ^ \"City and Town Population Totals: 2020−2024\". United States Census Bureau. Retrieved December 2, 2025. - ^ \"Belmont Town Clerk, Census Information\". Belmont Town Clerk. Retrieved August 15, 2021. - ^ \"Belmont CDP QuickFacts from the US Census Bureau\". United States Census Bureau. Archived from the original on February 15, 2012. Retrieved December 14, 2011. - ^ Sacchetti, Maria. \"A melting pot stretches out to the suburbs.\" Boston Globe. September 15, 2010. p. 2 (Archive). Retrieved on September 23, 2014. - ^ Rogers, Katie (February 20, 2018). \"Rob Porter's Charisma and Ambition Disguised Flare-ups of Anger\". The New York Times. - ^ \"Select Board | belmontma\". - ^ a b \"Town of Belmont, MA - Town Government Organization\". Archived from the original on August 2, 2008. Retrieved August 4, 2008. - ^ \"Wicked Local | Belmont Citizen-Herald\". - ^ \"Home\". belmontonian.com. - ^ \"Belmont, MA Patch - Breaking News, Local News, Events, Schools, Weather, Sports and Shopping\". June 15, 2023. - ^ \"The Belmont Voice\". belmontvoice.org. Retrieved December 1, 2025. - ^ \"New Pieces\". Belmont Highpoint. - ^ \"Meet the editors of High Point, Belmont High School's student newspaper\". Wicked Local. - ^ \"Secretary of State, Massachusetts Corporation Database\". Commonwealth of Massachusetts.[dead link] - ^ \"Watch BMC Live\". Belmont Media Center. - ^ \"Watch BMC On Demand\". Belmont Media Center. - ^ \"Belmont Famous: Nobel Prize Winner Next Door\". Archived from the original on April 26, 2012. Retrieved December 14, 2011. - ^ \"Billy Rath (1948-2014\". IMDb. Retrieved January 9, 2025. - ^ Marquard, Bryan (April 2, 2013). \"D. Leo Monahan, 86; Boston sports reporter, columnist\". The Boston Globe. Boston, Massachusetts. - ^ Tucker, Franklin (November 16, 2010). \"Belmont-Born, Bred Actor Addison Powell dies at 89: \"Dark Shadows\" star worked on Broadway, in films \"Three Days of the Condor,\" \"The Thomas Crown Affair\"\". Belmont Patch. AOL Inc. Archived from the original on July 15, 2011. Retrieved November 28, 2010. - ^ \"William Haskins\". Sports-Reference. Archived from the original on March 11, 2016. - ^ \"Patty Shea\". Sports-Reference. Archived from the original on March 5, 2016. - ^ Return to Sender: Did Shiva Ayyadurai Invent Email? Archived March 7, 2018, at the Wayback Machine, Boston Magazine, June 2012 - accessed October 17, 2013 - ^ \"Corruption, Lies, and Death Threats: The Crazy Story of the Man Who Pretended to Invent Email\". Gizmodo. March 5, 2012. Archived from the original on March 7, 2012. Retrieved October 18, 2013. - ^ The Man Who Invented Email, TIME Techland, November 15, 2011 - accessed January 21, 2012 - ^ Software Design Development and Implementation of a High-Reliability Network-Wide Electronic Mail System, Shiva Ayyadurai 1981 - accessed January 21, 2012 - ^ \"Fred Whipple Memorial Minute\". Archived from the original on October 30, 2006. Retrieved December 8, 2006."
}