{
  "url": "https://www.uzitalk.com/forums/index.php?threads/seeking-guidance-on-adjusting-galil-gas-for-suppression.99828/",
  "title": "Seeking Guidance On Adjusting Galil Gas For Suppression | UZI Talk Forums",
  "text": "After receiving an Omega 300 from the BOGO, I wanted to try it on my Galil Ace Gen II 7.62x39 with 8.3” barrel. Folks online seemed to really talk up the KNS piston so I installed one of those. The trouble is I can’t seem to find a number of clicks where the gun cycles reliably both suppressed and not. The Omega is currently in for warranty repair so I haven’t done a test in some time but as it is I have the piston open one click and the cycle is fine without a can; much more than this and failure will occur. If I was to thread on the can I would have a few successful shots but eventually a stoppage and a bent round beached between the bolt and the chamber. On my last attempt I opened three or four clicks and the suppressor gave me no trouble; but once it came off there wasn’t enough gas to run. I also suppress my AR, SP5, Glocks and a Mac 10 with no worries. What am I doing wrong with my Galil? Is my aim to have it run reliably suppressed and unsuppressed without adjusting the gas a futile endeavor? Ammo used is Norma, Focchi and Belom. Who knows when my Omega will be back from warranty repair so I have time to research. Thanks ? The Omega is currently in for warranty repair so I haven’t done a test in some time but as it is I have the piston open one click and the cycle is fine without a can; much more than this and failure will occur. If I was to thread on the can I would have a few successful shots but eventually a stoppage and a bent round beached between the bolt and the chamber. On my last attempt I opened three or four clicks and the suppressor gave me no trouble; but once it came off there wasn’t enough gas to run. I also suppress my AR, SP5, Glocks and a Mac 10 with no worries. What am I doing wrong with my Galil? Is my aim to have it run reliably suppressed and unsuppressed without adjusting the gas a futile endeavor? Ammo used is Norma, Focchi and Belom. Who knows when my Omega will be back from warranty repair so I have time to research. Thanks ?"
}