{
  "url": "https://en.wikipedia.org/wiki/KRAS",
  "title": "KRAS - Wikipedia",
  "text": "KRAS KRAS (Kirsten rat sarcoma virus oncogene homologue) is a gene that provides instructions for making a protein called K-Ras, a part of the RAS/MAPK pathway. The protein relays signals from outside the cell to the cell's nucleus. These signals instruct the cell to grow and divide (proliferate) or to mature and take on specialized functions (differentiate). It is called KRAS because it was first identified as a viral oncogene in the Kirsten RAt Sarcoma virus (current viral nomenclature: Kirsten murine sarcoma virus, Gammaretrovirus Kimursar).[5][6] The oncogene identified was derived from a cellular genome, so KRAS, when found in a cellular genome, is called a proto-oncogene. The K-Ras protein is a GTPase, a class of enzymes which convert the nucleotide guanosine triphosphate (GTP) into guanosine diphosphate (GDP). In this way the K-Ras protein acts like a switch that is turned on and off by the GTP and GDP molecules. To transmit signals, it must be turned on by attaching (binding) to a molecule of GTP. The K-Ras protein is turned off (inactivated) when it converts the GTP to GDP. When the protein is bound to GDP, it does not relay signals to the nucleus. The gene product of KRAS, the K-Ras protein, was first found as a p21 GTPase.[7][8] Like other members of the ras subfamily of GTPases, the K-Ras protein is an early player in many signal transduction pathways. K-Ras is usually tethered to cell membranes because of the farnesylation of its C-terminus. There are two protein products of the KRAS gene in mammalian cells that result from the use of alternative exon 4 (exon 4A and 4B respectively): K-Ras4A and K-Ras4B. These proteins have different structures in their C-terminal region and use different mechanisms to localize to cellular membranes, including the plasma membrane.[9] Function [edit]KRAS acts as a molecular on/off switch, using protein dynamics. Once it is allosterically activated, it recruits and activates proteins necessary for the propagation of growth factors, as well as other cell signaling receptors like c-Raf and PI 3-kinase. KRAS upregulates the GLUT1 glucose transporter, thereby contributing to the Warburg effect in cancer cells.[10] KRAS binds to GTP in its active state. It also possesses an intrinsic enzymatic activity which cleaves the terminal phosphate of the nucleotide, converting it to GDP. Upon conversion of GTP to GDP, KRAS is deactivated. The rate of conversion is usually slow, but can be increased dramatically by an accessory protein of the GTPase-activating protein (GAP) class, for example RasGAP. In turn, KRAS can bind to proteins of the Guanine Nucleotide Exchange Factor (GEF) class (such as SOS1), which forces the release of bound nucleotide (GDP). Subsequently, KRAS binds GTP present in the cytosol and the GEF is released from ras-GTP. Other members of the Ras family include: HRAS and NRAS. These proteins all are regulated in the same manner and appear to differ in their sites of action within the cell. Clinical significance when mutated [edit]This proto-oncogene is a Kirsten ras oncogene homolog from the mammalian Ras gene family. A single amino acid substitution, and in particular a single nucleotide substitution, is responsible for an activating mutation. The transforming protein that results is implicated in various malignancies, including lung adenocarcinoma,[11] mucinous adenoma, ductal carcinoma of the pancreas and colorectal cancer.[12][13] Several germline KRAS mutations have been found to be associated with Noonan syndrome[14] and cardio-facio-cutaneous syndrome.[15] Somatic KRAS mutations are found at high rates in leukemias, colorectal cancer,[16] pancreatic cancer[17] and lung cancer.[18] Colorectal cancer [edit]The impact of KRAS mutations is heavily dependent on the order of mutations. Primary KRAS mutations generally lead to a self-limiting hyperplastic or borderline lesion, but if they occur after a previous APC mutation it often progresses to cancer.[19] KRAS mutations are more commonly observed in cecal cancers than colorectal cancers located in any other places from ascending colon to rectum.[20][21] As of 2006, KRAS mutation was predictive of a very poor response to panitumumab (Vectibix) and cetuximab (Erbitux) therapy in colorectal cancer.[22] As of 2008, the most reliable way to predict whether a colorectal cancer patient will respond to one of the EGFR-inhibiting drugs was to test for certain \"activating\" mutations in the gene that encodes KRAS, which occurs in 30%–50% of colorectal cancers. Studies show patients whose tumors express the mutated version of the KRAS gene will not respond to cetuximab or panitumumab.[23] As of 2009, although presence of the wild-type (or normal) KRAS gene does not guarantee that these drugs will work, a number of large studies[24][25] had shown that cetuximab had efficacy in mCRC patients with KRAS wild-type tumors. In the Phase III CRYSTAL study, published in 2009, patients with the wild-type KRAS gene treated with Erbitux plus chemotherapy showed a response rate of up to 59% compared to those treated with chemotherapy alone. Patients with the KRAS wild-type gene also showed a 32% decreased risk of disease progression compared to patients receiving chemotherapy alone.[25] As of 2012, it was known that emergence of KRAS mutations was a frequent driver of acquired resistance to cetuximab anti-EGFR therapy in colorectal cancers. The emergence of KRAS mutant clones can be detected non-invasively[how?] months before radiographic progression. It suggests to perform an early initiation of a MEK inhibitor as a rational strategy for delaying or reversing drug resistance.[26] KRAS amplification [edit]KRAS gene can also be amplified in colorectal cancer and tumors harboring this genetic lesion are not responsive to EGFR inhibitors. Although KRAS amplification is infrequent in colorectal cancer, as of 2013 it was hypothesized to be responsible for precluding response to anti-EGFR treatment in some patients.[27] As of 2015 amplification of wild-type Kras has also been observed in ovarian,[28] gastric, uterine, and lung cancers.[29] Lung cancer [edit]Whether a patient is positive or negative for a mutation in the epidermal growth factor receptor (EGFR) will predict how patients will respond to certain EGFR antagonists such as erlotinib (Tarceva) or gefitinib (Iressa). Patients who harbor an EGFR mutation have a 60% response rate to erlotinib. However, the mutation of KRAS and EGFR are generally mutually exclusive.[30][31][32] Lung cancer patients who are positive for KRAS mutation (and the EGFR status would be wild type) have a low response rate to erlotinib or gefitinib estimated at 5% or less.[30] Different types of data including mutation status and gene expression did not have a significant prognostic power.[33] No correlation to survival was observed in 72% of all studies with KRAS sequencing performed in non-small cell lung cancer (NSCLC).[33] However, KRAS mutations can not only affect the gene itself and the expression of the corresponding protein, but can also influence the expression of other downstream genes involved in crucial pathways regulating cell growth, differentiation and apoptosis. The different expression of these genes in KRAS-mutant tumors might have a more prominent role in affecting patient's clinical outcomes.[33] A 2008 paper published in Cancer Research concluded that the in vivo administration of the compound oncrasin-1 \"suppressed the growth of K-ras mutant human lung tumor xenografts by >70% and prolonged the survival of nude mice bearing these tumors, without causing detectable toxicity\", and that the \"results indicate that oncrasin-1 or its active analogues could be a novel class of anticancer agents which effectively kill K-Ras mutant cancer cells.\"[34] Pancreatic cancer [edit]Over 90% of pancreatic ductal adenocarcinomas (PDACs) have a KRAS mutation.[35][36][37] There is one approved drug, sotorasib, that targets the KRAS G12C mutation, but only ~1% of PDACs have this mutation.[35] Another KRAS inhibitor, MRTX1133 targets G12D mutation which is present in over 40% of PDACs[38][39] is currently in clinical trials to treat solid tumors including pancreatic adenocarcinoma.[40] KRAS testing [edit]In July 2009, the US Food and Drug Administration (FDA) updated the labels of two anti-EGFR monoclonal antibody drugs indicated for treatment of metastatic colorectal cancer, panitumumab (Vectibix) and cetuximab (Erbitux), to include information about KRAS mutations.[41] In 2012, the FDA cleared a genetic test by QIAGEN named therascreen KRAS test, designed to detect the presence of seven mutations in the KRAS gene in colorectal cancer cells. This test aids physicians in identifying patients with metastatic colorectal cancer for treatment with Erbitux. The presence of KRAS mutations in colorectal cancer tissue indicates that the patient may not benefit from treatment with Erbitux. If the test result indicates that the KRAS mutations are absent in the colorectal cancer cells, then the patient may be considered for treatment with Erbitux.[42] As a therapeutic target [edit]Hyperactivating KRAS mutations are known to underlie the pathogenesis of up to 20% of human cancers, making KRAS a desirable target for cancer therapies.[43] However, development of KRAS-targeting therapies was elusive for decades and KRAS was long referred to as undruggable.[44] However, Kevan M. Shokat and his colleagues, as Howard Hughes Medical Institute investigators at the University of California, discovered a druggable \"Achilles heel\" on KRAS (specifically the KRAS-G12C mutant), which enabled the development of the first KRAS-targeting drugs by pharmaceutical companies based on their breakthrough findings.[45][46][47][48] Currently, a few KRAS-targeting drugs are approved for clinical use and, many clinical trials are underway, exploring the therapeutic potential of a wide variety of KRAS-targeting drugs. Pan-KRAS (WT or any mutation) [edit]An antisense oligonucleotide (ASO) targeting KRAS, AZD4785 (AstraZeneca/Ionis Therapeutics), completed a phase I study[49] but in 2019 was discontinued from further development because of insufficient knockdown of the target.[50] As of October 2025, there are clinical trials exploring the therapeutic potential of several pan-KRAS targeting drugs including daraxonrasib, KO-2806, AMG410, and the peptide inhibitor LUNA18. G12C mutation [edit]One fairly frequent driver mutation is KRASG12C. Electrophilic KRAS inhibitors can form irreversible covalent bonds with nucleophilic sulfur atom of Cys-12 and hence selectively target KRASG12C and leave wild-type KRAS untouched.[53] In 2021, the U.S. FDA approved one KRASG12C mutant covalent inhibitor, sotorasib (AMG 510, Amgen) for the treatment of non-small cell lung cancer (NSCLC), the first KRAS inhibitor to reach the market and enter clinical use.[54][55] A second is adagrasib (MRTX-849, Mirati Therapeutics)[56][57] while JNJ-74699157 (also known as ARS-3248, Wellspring Biosciences/Janssen) has received an investigational new drug (IND) approval to start clinical trials.[58] A phase Ia/Ib dose escalation trial of the oral selective KRAS G12C inhibitor divarasib was published in 2023, where the drug was tested in non-small cell lung cancer, colorectal cancer, and other solid tumors with KRAS G12C mutations.[59] It continues in phase I and II studies for several cancer types as of August 2023.[60][61][62][63] In China, garsorasib is approved for the treatment of advanced non-small cell lung cancer (NSCLC) carrying the KRAS G12C mutation in patients who have received at least one systemic treatment.[64] G12D mutation [edit]The most common KRAS mutation is G12D which is estimated to be present in up to 37% pancreatic cancers and over 12% of colorectal cancers. As of October 2025, there are several G12D targeting drugs in clinical or preclinical trials including Zoldonrasib, INCB161734, LY3962673, AZD0022, and the PROTAC ASP3082. In 2021, the first clinical trial of a gene therapy targeting KRAS G12D was recruiting patients, sponsored by the National Cancer Institute.[65] In June 2022, a case report was published about a 71-year-old woman with metastatic pancreatic cancer after extensive treatment (Whipple Surgery, radiation and multiple agent chemotherapy) who received a single infusion of engineered T cells directed to both the G12D mutation and an HLA allele. Her tumor regressed persistently. But another similarly treated patient died from the cancer.[66] G12V mutation [edit]The G12V mutation can be targeted by the drug RMC-5127 which is undergoing clinical trials as of October 2025. Interactions [edit]KRAS has been shown to interact with many molecules including: References [edit]- ^ a b c GRCh38: Ensembl release 89: ENSG00000133703 – Ensembl, May 2017 - ^ a b c GRCm38: Ensembl release 89: ENSMUSG00000030265 – Ensembl, May 2017 - ^ \"Human PubMed Reference:\". National Center for Biotechnology Information, U.S. National Library of Medicine. - ^ \"Mouse PubMed Reference:\". National Center for Biotechnology Information, U.S. National Library of Medicine. - ^ Tsuchida N, Ryder T, Ohtsubo E (September 1982). \"Nucleotide sequence of the oncogene encoding the p21 transforming protein of Kirsten murine sarcoma virus\". Science. 217 (4563): 937–939. Bibcode:1982Sci...217..937T. doi:10.1126/science.6287573. PMID 6287573. - ^ \"Taxonomy browser Taxonomy Browser (Kirsten murine sarcoma virus)\". www.ncbi.nlm.nih.gov. - ^ Markov K (1979). \"Current state of our knowledge about prostaglandins\". Patologicheskaia Fiziologiia I Eksperimental'naia Terapiia (5): 3–15. PMID 228228. - ^ Kranenburg O (November 2005). \"The KRAS oncogene: past, present, and future\". Biochimica et Biophysica Acta (BBA) - Reviews on Cancer. 1756 (2): 81–82. doi:10.1016/j.bbcan.2005.10.001. PMID 16269215. - ^ Welman A, Burger MM, Hagmann J (September 2000). \"Structure and function of the C-terminal hypervariable region of K-Ras4B in plasma membrane targetting and transformation\". Oncogene. 19 (40): 4582–4591. doi:10.1038/sj.onc.1203818. PMID 11030147. S2CID 20878317. - ^ Yun J, Rago C, Cheong I, Pagliarini R, Angenendt P, Rajagopalan H, et al. (September 2009). \"Glucose deprivation contributes to the development of KRAS pathway mutations in tumor cells\". Science. 325 (5947). New York, N.Y.: 1555–1559. Bibcode:2009Sci...325.1555Y. doi:10.1126/science.1174229. PMC 2820374. PMID 19661383. - ^ Chiosea SI, Sherer CK, Jelic T, Dacic S (December 2011). \"KRAS mutant allele-specific imbalance in lung adenocarcinoma\". Modern Pathology. 24 (12): 1571–1577. doi:10.1038/modpathol.2011.109. PMID 21743433. - ^ Hartman DJ, Davison JM, Foxwell TJ, Nikiforova MN, Chiosea SI (October 2012). \"Mutant allele-specific imbalance modulates prognostic impact of KRAS mutations in colorectal adenocarcinoma and is associated with worse overall survival\". International Journal of Cancer. 131 (8): 1810–1817. doi:10.1002/ijc.27461. PMID 22290300. S2CID 27328214. - ^ Krasinskas AM, Moser AJ, Saka B, Adsay NV, Chiosea SI (October 2013). \"KRAS mutant allele-specific imbalance is associated with worse prognosis in pancreatic cancer and progression to undifferentiated carcinoma of the pancreas\". Modern Pathology. 26 (10): 1346–1354. doi:10.1038/modpathol.2013.71. PMC 4128625. PMID 23599154. - ^ Schubbert S, Zenker M, Rowe SL, Böll S, Klein C, Bollag G, et al. (March 2006). \"Germline KRAS mutations cause Noonan syndrome\". Nature Genetics. 38 (3): 331–336. doi:10.1038/ng1748. PMID 16474405. S2CID 8193354. - ^ Niihori T, Aoki Y, Narumi Y, Neri G, Cavé H, Verloes A, et al. (March 2006). \"Germline KRAS and BRAF mutations in cardio-facio-cutaneous syndrome\". Nature Genetics. 38 (3): 294–296. doi:10.1038/ng1749. PMID 16474404. S2CID 28915489. - ^ Burmer GC, Loeb LA (April 1989). \"Mutations in the KRAS2 oncogene during progressive stages of human colon carcinoma\". Proceedings of the National Academy of Sciences of the United States of America. 86 (7): 2403–2407. Bibcode:1989PNAS...86.2403B. doi:10.1073/pnas.86.7.2403. PMC 286921. PMID 2648401. - ^ Almoguera C, Shibata D, Forrester K, Martin J, Arnheim N, Perucho M (May 1988). \"Most human carcinomas of the exocrine pancreas contain mutant c-K-ras genes\". Cell. 53 (4): 549–554. doi:10.1016/0092-8674(88)90571-5. PMID 2453289. S2CID 22457575. - ^ Tam IY, Chung LP, Suen WS, Wang E, Wong MC, Ho KK, et al. (March 2006). \"Distinct epidermal growth factor receptor and KRAS mutation patterns in non-small cell lung cancer patients with different tobacco exposure and clinicopathologic features\". Clinical Cancer Research. 12 (5): 1647–1653. doi:10.1158/1078-0432.CCR-05-1981. PMID 16533793. S2CID 14795296. - ^ Vogelstein B, Kinzler KW (August 2004). \"Cancer genes and the pathways they control\". Nature Medicine. 10 (8): 789–799. doi:10.1038/nm1087. PMID 15286780. S2CID 205383514. - ^ Yamauchi M, Morikawa T, Kuchiba A, Imamura Y, Qian ZR, Nishihara R, et al. (June 2012). \"Assessment of colorectal cancer molecular features along bowel subsites challenges the conception of distinct dichotomy of proximal versus distal colorectum\". Gut. 61 (6): 847–854. doi:10.1136/gutjnl-2011-300865. PMC 3345105. PMID 22427238. - ^ Rosty C, Young JP, Walsh MD, Clendenning M, Walters RJ, Pearson S, et al. (June 2013). \"Colorectal carcinomas with KRAS mutation are associated with distinctive morphological and molecular features\". Modern Pathology. 26 (6): 825–834. doi:10.1038/modpathol.2012.240. PMID 23348904. - ^ Lièvre A, Bachet JB, Le Corre D, Boige V, Landi B, Emile JF, et al. (April 2006). \"KRAS mutation status is predictive of response to cetuximab therapy in colorectal cancer\". Cancer Research. 66 (8): 3992–3995. doi:10.1158/0008-5472.CAN-06-0191. PMID 16618717. - ^ van Epps HL (Winter 2008). \"Bittersweet Gene\". CURE (Cancer Updates, Research and Education). Archived from the original on 2009-02-07. - ^ Bokemeyer C, Bondarenko I, Makhson A, Hartmann JT, Aparicio J, de Braud F, et al. (February 2009). \"Fluorouracil, leucovorin, and oxaliplatin with and without cetuximab in the first-line treatment of metastatic colorectal cancer\". Journal of Clinical Oncology. 27 (5): 663–671. doi:10.1200/JCO.2008.20.8397. hdl:2434/652169. PMID 19114683. - ^ a b Van Cutsem E, Köhne CH, Hitre E, Zaluski J, Chang Chien CR, Makhson A, et al. (April 2009). \"Cetuximab and chemotherapy as initial treatment for metastatic colorectal cancer\". The New England Journal of Medicine. 360 (14): 1408–1417. doi:10.1056/NEJMoa0805019. PMID 19339720. - ^ Misale S, Yaeger R, Hobor S, Scala E, Janakiraman M, Liska D, et al. (June 2012). \"Emergence of KRAS mutations and acquired resistance to anti-EGFR therapy in colorectal cancer\". Nature. 486 (7404): 532–536. Bibcode:2012Natur.486..532M. doi:10.1038/nature11156. PMC 3927413. PMID 22722830. - ^ Valtorta E, Misale S, Sartore-Bianchi A, Nagtegaal ID, Paraf F, Lauricella C, et al. (September 2013). \"KRAS gene amplification in colorectal cancer and impact on response to EGFR-targeted therapy\". International Journal of Cancer. 133 (5): 1259–1265. doi:10.1002/ijc.28106. hdl:2318/132493. PMID 23404247. S2CID 1791682. - ^ Sankaranarayanan P, Schomay TE, Aiello KA, Alter O (April 2015). \"Tensor GSVD of patient- and platform-matched tumor and normal DNA copy-number profiles uncovers chromosome arm-wide patterns of tumor-exclusive platform-consistent alterations encoding for cell transformation and predicting ovarian cancer survival\". PLOS ONE. 10 (4) e0121396. Bibcode:2015PLoSO..1021396S. doi:10.1371/journal.pone.0121396. PMC 4398562. PMID 25875127. AAAS EurekAlert! Press Release and NAE Podcast Feature. - ^ Chen Y, McGee J, Chen X, Doman TN, Gong X, Zhang Y, et al. (2014). \"Identification of druggable cancer driver genes amplified across TCGA datasets\". PLOS ONE. 9 (5) e98293. Bibcode:2014PLoSO...998293C. doi:10.1371/journal.pone.0098293. PMC 4038530. PMID 24874471. - ^ a b Suda K, Tomizawa K, Mitsudomi T (March 2010). \"Biological and clinical significance of KRAS mutations in lung cancer: an oncogenic driver that contrasts with EGFR mutation\". Cancer and Metastasis Reviews. 29 (1): 49–60. doi:10.1007/s10555-010-9209-4. PMID 20108024. S2CID 19626219. - ^ Riely GJ, Marks J, Pao W (April 2009). \"KRAS mutations in non-small cell lung cancer\". Proceedings of the American Thoracic Society. 6 (2): 201–205. doi:10.1513/pats.200809-107LC. PMID 19349489. - ^ Pao W, Wang TY, Riely GJ, Miller VA, Pan Q, Ladanyi M, et al. (January 2005). \"KRAS mutations and primary resistance of lung adenocarcinomas to gefitinib or erlotinib\". PLOS Medicine. 2 (1) e17. doi:10.1371/journal.pmed.0020017. PMC 545207. PMID 15696205. - ^ a b c Nagy Á, Pongor LS, Szabó A, Santarpia M, Győrffy B (February 2017). \"KRAS driven expression signature has prognostic power superior to mutation status in non-small cell lung cancer\". International Journal of Cancer. 140 (4): 930–937. doi:10.1002/ijc.30509. PMC 5299512. PMID 27859136. - ^ Guo W, Wu S, Liu J, Fang B (September 2008). \"Identification of a small molecule with synthetic lethality for K-ras and protein kinase C iota\". Cancer Research. 68 (18): 7403–7408. doi:10.1158/0008-5472.CAN-08-1449. PMC 2678915. PMID 18794128. - ^ a b Leroux C, Konstantinidou G (February 2021). \"Targeted Therapies for Pancreatic Cancer: Overview of Current Treatments and New Opportunities for Personalized Oncology\". Cancers. 13 (4): 799. doi:10.3390/cancers13040799. PMC 7918504. PMID 33672917. - ^ Lee MS, Pant S (November 2023). \"Targeted Therapies for Pancreatic Cancer\". In Pant S (ed.). Pancreatic Cancer. Cham: Springer. pp. 67–95. doi:10.1007/978-3-031-38623-7_5. ISBN 978-3-031-38623-7. - ^ Rosenzwieg A (8 June 2021). \"5 Things to Know About Targeting Mutant KRAS in Pancreatic Cancer\". Pancreatic Cancer Action Network. - ^ Wei D, Wang L, Zuo X, Maitra A, Bresalier RS (February 2024). \"A Small Molecule with Big Impact: MRTX1133 Targets the KRASG12D Mutation in Pancreatic Cancer\". Clinical Cancer Research. 30 (4): 655–662. doi:10.1158/1078-0432.CCR-23-2098. PMC 10922474. PMID 37831007. S2CID 263967602. - ^ Bannoura SF, Khan HY, Azmi AS (2022). \"KRAS G12D targeted therapies for pancreatic cancer: Has the fortress been conquered?\". Frontiers in Oncology. 12 1013902. doi:10.3389/fonc.2022.1013902. PMC 9749787. PMID 36531078. - ^ Clinical trial number NCT05737706 for \"Study of MRTX1133 in Patients With Advanced Solid Tumors Harboring a KRAS G12D Mutation\" at ClinicalTrials.gov - ^ OncoGenetics.Org (July 2009). \"FDA updates Vectibix and Erbitux labels with KRAS testing info\". OncoGenetics.Org. Archived from the original on November 9, 2014. Retrieved 2009-07-20. - ^ FDA: Medical devices: therascreen® KRAS RGQ PCR Kit – P110030, accessed 20 Jone 2014 - ^ Cox AD, Fesik SW, Kimmelman AC, Luo J, Der CJ (November 2014). \"Drugging the undruggable RAS: Mission possible?\". Nature Reviews. Drug Discovery. 13 (11): 828–851. doi:10.1038/nrd4389. PMC 4355017. PMID 25323927. - ^ \"Researchers identify new mechanism to target 'undruggable' cancer gene\". www.sciencedaily.com. Retrieved 2017-01-17. - ^ Ostrem JM, Peters U, Sos ML, Wells JA, Shokat KM (November 2013). \"K-Ras(G12C) inhibitors allosterically control GTP affinity and effector interactions\". Nature. 503 (7477): 548–551. Bibcode:2013Natur.503..548O. doi:10.1038/nature12796. PMC 4274051. PMID 24256730. - ^ Ostrem JM, Shokat KM (November 2016). \"Direct small-molecule inhibitors of KRAS: from structural insights to mechanism-based design\". Nature Reviews. Drug Discovery. 15 (11): 771–785. doi:10.1038/nrd.2016.139. PMID 27469033. - ^ Orgován Z, Keserű GM (December 2020). \"Small molecule inhibitors of RAS proteins with oncogenic mutations\". Cancer Metastasis Reviews. 39 (4): 1107–1126. doi:10.1007/s10555-020-09911-9. PMC 7680341. PMID 32770300. - ^ Sabt A, Tawfik HO, Khaleel EF, Badi RM, Ibrahim HA, Elkaeed EB, et al. (December 2024). \"An overview of recent advancements in small molecules suppression of oncogenic signaling of K-RAS: an updated review\". Molecular Diversity. 28 (6): 4581–4608. doi:10.1007/s11030-023-10777-6. PMID 38289431. - ^ Clinical trial number NCT03101839 for \"Phase I Dose-Escalation Study of AZD4785 in Patients With Advanced Solid Tumours\" at ClinicalTrials.gov - ^ Plieth J (26 April 2019). \"Astra's first attempt fails, but there's no giving up on KRAS\". Evaluate. - ^ Canon J, Rex K, Saiki AY, Mohr C, Cooke K, Bagal D, et al. (November 2019). \"The clinical KRAS(G12C) inhibitor AMG 510 drives anti-tumour immunity\". Nature. 575 (7781): 217–223. Bibcode:2019Natur.575..217C. doi:10.1038/s41586-019-1694-1. PMID 31666701. S2CID 204969251. - ^ Lanman BA, Allen JR, Allen JG, Amegadzie AK, Ashton KS, Booker SK, et al. (January 2020). \"Discovery of a Covalent Inhibitor of KRASG12C (AMG 510) for the Treatment of Solid Tumors\". Journal of Medicinal Chemistry. 63 (1): 52–65. doi:10.1021/acs.jmedchem.9b01180. PMID 31820981. S2CID 209313106. - ^ McCormick F (January 2019). \"Progress in targeting RAS with small molecule drugs\". The Biochemical Journal. 476 (2): 365–374. doi:10.1042/BCJ20170441. PMID 30705085. S2CID 73414179. - ^ \"FDA Approves First Targeted Therapy for Lung Cancer Mutation Previously Considered Resistant to Drug Therapy\". U.S. Food and Drug Administration (FDA). 28 May 2021. Archived from the original on May 28, 2021. Retrieved 28 May 2021. - ^ NCI Staff (2021-06-25). \"Sotorasib is First KRAS Inhibitor Approved by FDA - NCI\". Cancer Currents. National Cancer Institute. Retrieved 2022-06-04. - ^ Clinical trial number NCT03785249 for \"MRTX849 in Patients With Cancer Having a KRAS G12C Mutation\" at ClinicalTrials.gov - ^ Kaiser J (2019-10-30). \"Two new drugs finally hit 'undruggable' cancer target, providing hope for treatments\". Science Magazine. AAAS. Retrieved 2019-11-04. - ^ Mullard A (July 2019). \"KRAS's undruggability cracks?\". Nature Reviews. Drug Discovery. 18 (7): 488. doi:10.1038/d41573-019-00102-y. PMID 31267080. - ^ Sacher A, LoRusso P, Patel MR, Miller WH, Garralda E, Forster MD, et al. (August 2023). \"Single-Agent Divarasib (GDC-6036) in Solid Tumors with a KRAS G12C Mutation\". The New England Journal of Medicine. 389 (8): 710–721. doi:10.1056/NEJMoa2303810. hdl:2268/311523. PMID 37611121. S2CID 261098837. - ^ \"Study Record | A Study of Multiple Therapies in Biomarker-Selected Patients With Resectable Stages IB-III Non-Small Cell Lung Cancer\". clinicaltrials.gov. Retrieved 2023-08-26. - ^ \"Study Record | A Study Evaluating the Safety and Efficacy of Targeted Therapies in Subpopulations of Patients With Metastatic Colorectal Cancer (INTRINSIC)\". clinicaltrials.gov. Retrieved 2023-08-26. - ^ \"Study Record | A Study to Evaluate the Safety, Pharmacokinetics, and Activity of GDC-6036 Alone or in Combination in Participants With Advanced or Metastatic Solid Tumors With a KRAS G12C Mutation\". clinicaltrials.gov. Retrieved 2023-08-26. - ^ \"Study Record | A Study to Evaluate the Efficacy and Safety of Multiple Targeted Therapies as Treatments for Participants With Non-Small Cell Lung Cancer (NSCLC) (B-FAST)\". clinicaltrials.gov. Retrieved 2023-08-26. - ^ \"Garsorasib Tablets Approved with Conditions for Marketing by China NMPA\". National Medical Products Administration. 2025-02-19. - ^ \"A Phase I/II Study Administering Peripheral Blood Lymphocytes Transduced With a Murine T-Cell Receptor Recognizing the G12D Variant of Mutated RAS in HLA-A*11:01 Patients\". clinicaltrials.gov. 28 January 2021. Retrieved 26 July 2021. - ^ Leidner R, Sanjuan Silva N, Huang H, Sprott D, Zheng C, Shih YP, et al. (June 2022). \"Neoantigen T-Cell Receptor Gene Therapy in Pancreatic Cancer\". The New England Journal of Medicine. 386 (22): 2112–2119. doi:10.1056/NEJMoa2119662. PMC 9531755. PMID 35648703. - ^ a b Li W, Han M, Guan KL (April 2000). \"The leucine-rich repeat protein SUR-8 enhances MAP kinase activation and forms a complex with Ras and Raf\". Genes & Development. 14 (8): 895–900. doi:10.1101/gad.14.8.895. PMC 316541. PMID 10783161. - ^ Kiyono M, Kato J, Kataoka T, Kaziro Y, Satoh T (September 2000). \"Stimulation of Ras guanine nucleotide exchange activity of Ras-GRF1/CDC25(Mm) upon tyrosine phosphorylation by the Cdc42-regulated kinase ACK1\". The Journal of Biological Chemistry. 275 (38): 29788–29793. doi:10.1074/jbc.M001378200. PMID 10882715. - ^ Rubio I, Wittig U, Meyer C, Heinze R, Kadereit D, Waldmann H, et al. (November 1999). \"Farnesylation of Ras is important for the interaction with phosphoinositide 3-kinase gamma\". European Journal of Biochemistry. 266 (1): 70–82. doi:10.1046/j.1432-1327.1999.00815.x. PMID 10542052. - ^ Spaargaren M, Bischoff JR (December 1994). \"Identification of the guanine nucleotide dissociation stimulator for Ral as a putative effector molecule of R-ras, H-ras, K-ras, and Rap\". Proceedings of the National Academy of Sciences of the United States of America. 91 (26): 12609–12613. Bibcode:1994PNAS...9112609S. doi:10.1073/pnas.91.26.12609. PMC 45488. PMID 7809086. - ^ Vos MD, Ellis CA, Elam C, Ulku AS, Taylor BJ, Clark GJ (July 2003). \"RASSF2 is a novel K-Ras-specific effector and potential tumor suppressor\". The Journal of Biological Chemistry. 278 (30): 28045–28051. doi:10.1074/jbc.M300554200. PMID 12732644. - ^ Villalonga P, López-Alcalá C, Bosch M, Chiloeches A, Rocamora N, Gil J, et al. (November 2001). \"Calmodulin binds to K-Ras, but not to H- or N-Ras, and modulates its downstream signaling\". Molecular and Cellular Biology. 21 (21): 7345–7354. doi:10.1128/MCB.21.21.7345-7354.2001. PMC 99908. PMID 11585916. Further reading [edit]- Kahn S, Yamamoto F, Almoguera C, Winter E, Forrester K, Jordano J, et al. (1987). \"The c-K-ras gene and human cancer (review)\". Anticancer Research. 7 (4A): 639–652. PMID 3310850. - Yamamoto F, Nakano H, Neville C, Perucho M (1985). \"Structure and mechanisms of activation of c-K-ras oncogenes in human lung cancer\". Progress in Medical Virology. 32: 101–114. PMID 3895297. - Porta M, Ayude D, Alguacil J, Jariod M (February 2003). \"Exploring environmental causes of altered ras effects: fragmentation plus integration?\". Molecular Carcinogenesis. 36 (2): 45–52. doi:10.1002/mc.10093. PMID 12557259. S2CID 23937262. - Smakman N, Borel Rinkes IH, Voest EE, Kranenburg O (November 2005). \"Control of colorectal metastasis formation by K-Ras\". Biochimica et Biophysica Acta (BBA) - Reviews on Cancer. 1756 (2): 103–114. doi:10.1016/j.bbcan.2005.07.001. PMID 16098678. - Castagnola P, Giaretti W (November 2005). \"Mutant KRAS, chromosomal instability and prognosis in colorectal cancer\". Biochimica et Biophysica Acta (BBA) - Reviews on Cancer. 1756 (2): 115–125. doi:10.1016/j.bbcan.2005.06.003. PMID 16112461. - Deramaudt T, Rustgi AK (November 2005). \"Mutant KRAS in the initiation of pancreatic cancer\". Biochimica et Biophysica Acta (BBA) - Reviews on Cancer. 1756 (2): 97–101. doi:10.1016/j.bbcan.2005.08.003. PMID 16169155. - Pretlow TP, Pretlow TG (November 2005). \"Mutant KRAS in aberrant crypt foci (ACF): initiation of colorectal cancer?\". Biochimica et Biophysica Acta (BBA) - Reviews on Cancer. 1756 (2): 83–96. doi:10.1016/j.bbcan.2005.06.002. PMID 16219426. - Su YH, Wang M, Aiamkitsumrit B, Brenner DE, Block TM (2005). \"Detection of a K-ras mutation in urine of patients with colorectal cancer\". Cancer Biomarkers. 1 (2–3): 177–182. doi:10.3233/CBM-2005-12-305. PMID 17192038. - Domagała P, Hybiak J, Sulżyc-Bielicka V, Cybulski C, Ryś J, Domagała W (November 2012). \"KRAS mutation testing in colorectal cancer as an example of the pathologist's role in personalized targeted therapy: a practical approach\". Polish Journal of Pathology. 63 (3): 145–164. arXiv:1305.1286. doi:10.5114/PJP.2012.31499. PMID 23161231. S2CID 17666526. External links [edit]- KRAS Reference Standards - Learn more about KRAS Reference Controls - GeneReviews/NCBI/NIH/UW entry on Cardiofaciocutaneous Syndrome - GeneReviews/NCBI/NIH/UW entry on Noonan syndrome - KRAS2+protein,+human at the U.S. National Library of Medicine Medical Subject Headings (MeSH) - Overview of all the structural information available in the PDB for UniProt: P01116 (Human GTPase KRas) at the PDBe-KB."
}