{
  "url": "https://www.powerade.com/products/powerade-zero",
  "title": "Powerade Zero",
  "text": "POWERADE ZERO STRAWBERRY SMASH has zero sugar and includes the taste of deliciously ripe, sweet strawberry flavors. It takes more grind to dominate, so stock up on POWERADE today!Â Â Available Sizes:Â 28 fl oz POWERADE ZERO STRAWBERRY SMASH has zero sugar and includes the taste of deliciously ripe, sweet strawberry flavors. It takes more grind to dominate, so stock up on POWERADE today!Â Â Available Sizes:Â 28 fl oz WATER, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), NATURAL FLAVORS, MODIFIED FOOD STARCH, SUCRALOSE, VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), MEDIUM CHAIN TRIGLYCERIDES, SUCROSE ACETATE ISOBUTYRATE, ACESULFAME POTASSIUM, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40. POWERADE ZERO MIXED BERRY has zero sugar and hydrates you with a unique flavor blend that includes the taste of mixed berries. It takes more grind to dominate, so stock up on POWERADE today!Â Â Available Sizes:Â 12 fl oz; 20 fl oz; 28 fl oz WATER, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, SUCRALOSE, ACESULFAME POTASSIUM, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), BLUE 1. POWERADE ZERO FRUIT PUNCH has zero sugar and includes a vibrant blend of fruit flavors. It takes more grind to dominate, so stock up on POWERADE today!Â Available Sizes:Â 20 fl oz; 28 fl oz WATER, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, SUCRALOSE, ACESULFAME POTASSIUM, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40. POWERADE ZERO GRAPE has zero sugar and a deeply refreshing taste of grape flavors. It takes more grind to dominate, so stock up on POWERADE GRAPE ZERO today!Â Â Available Sizes:Â 20 fl oz; 28 fl oz WATER, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL AND ARTIFICIAL FLAVORS, SUCRALOSE, ACESULFAME POTASSIUM, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40, BLUE 1. POWERADE ZERO ORANGE has zero sugar and a citrus experience that includes an invigorating burst of juicy orange flavor. It takes more grind to dominate, so stock up on POWERADE today!Â Available Sizes:Â 28 fl oz WATER, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, SUCRALOSE, ACESULFAME POTASSIUM, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), YELLOW 5 AND 6."
}