{
  "url": "https://abcnews.go.com/International/trilateral-us-ukraine-russia-peace-talks-resume-uae/story?id=129840124",
  "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
  "text": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack The first round of trilateral talks was held last month. LONDON -- American, Ukrainian and Russian representatives gathered again in the United Arab Emirates on Wednesday for the latest round of trilateral talks regarding a possible end to Moscow's full-scale invasion of its neighbor, the fourth anniversary of which will come later this month. The talks in Abu Dhabi are expected to run until Thursday. The negotiations are the second installment of the trilateral format, the first also having been held in Abu Dhabi last month. A White House official told ABC News that the talks were \"productive.\" Both Moscow and Kyiv described the first round of trilateral talks as constructive, but key areas of disagreement remain. Among them are the fate of Ukraine's eastern Donbas region, which Russia has partially occupied and from which Moscow is demanding a full Ukrainian military withdrawal -- a proposal rejected by Kyiv. Control of the Zaporizhzhia Nuclear Power Plant in southern Ukraine -- occupied by Moscow's forces since March 2022 -- is also an important point of discussion. Another unresolved issue is the nature of post-war Western security guarantees for Ukraine, without which Kyiv says Moscow will be able to launch a new round of aggression in the future. The binding involvement of American forces in those security guarantees is a key Ukrainian demand. Russia has consistently said it will not accept the deployment of any NATO troops in Ukraine post-war. But following talks with U.S. President Donald Trump's peace envoy Steve Witkoff over the weekend, Russian negotiator Kirill Dmitriev said, \"Some security guarantees in some form may be acceptable.\" Rustem Umerov, the secretary of Ukraine's National Security and Defense Council and the leader of Kyiv's delegation, said in a post to Telegram on Wednesday that the latest round of talks were underway. \"The negotiation process started in a trilateral format -- Ukraine, USA and Russia,\" Umerov wrote. \"Next, work will continue in separate groups by areas, after which a repeated joint synchronization of positions is planned.\" The UAE's Foreign Ministry posted an image of the talks, with U.S. envoys Witkoff and Jared Kushner -- the president's son-in-law -- present alongside Ukrainian and Russian officials. Kremlin spokesperson Dmitry Peskov told journalists on Wednesday that Moscow \"is continuing its special military operation. The door to a peaceful settlement is open, and Russia remains open,\" he said, as quoted by Russia's state-run Tass news agency. The delegations gathered on Wednesday as Ukraine reeled from a major Russian drone and missile bombardment on Monday night, which Ukrainian officials said caused serious damage to the country's energy grid. This winter has seen intense and sustained Russian strikes on Ukrainian energy infrastructure, prompting regular blackouts for millions of Ukrainians amid below-freezing temperatures. On Thursday, Trump said he had secured a week-long Russian commitment to halt attacks on Ukrainian energy targets. Moscow confirmed the agreement, but said the pause only extended until Sunday. Kyiv said it would also pause attacks on Russian energy infrastructure. Ukrainian President Volodymyr Zelenskyy suggested on Tuesday that Monday night's strikes violated the supposed week-long pause. The Ukrainian president also said, \"The work of our negotiating team will be adjusted accordingly.\" Trump, though, told reporters later on Tuesday that the agreement only stretched from \"Sunday to Sunday,\" adding that Russian President Vladimir Putin \"kept his word on that.\" \"You know, one week is, we'll take anything because it's really, really cold over there. But it was on Sunday and he went from Sunday to Sunday,\" Trump said. Zelenskyy said on Tuesday, \"Last night, Russia broke its promise, that means either Russia now believes a week has fewer than four days instead of seven, or it is genuinely betting only on war and simply waited for the coldest days of this winter.\" Zelenskyy also said in a post to Telegram that Kyiv is waiting for \"the reaction of the United States of America to the Russian strikes.\" Zelenskyy suggested that the attacks undermined any hope of successful talks. \"This also speaks volumes about any other promises Russia has made or might still make. If their word doesn't hold even now, what can be expected next?\" he said in a post to Telegram. \"They lied before this war as well, and Russia launched the full-scale war, trying to deceive everyone about their intentions and about Ukraine. Even now, in these details, in these agreements with the United States, Russia resorts to deception again,\" Zelenskyy wrote. Both Russia and Ukraine continued their long-range attacks overnight into Wednesday. Ukraine's air force said Russia launched 105 drones into the country overnight, of which 88 were shot down or suppressed. Seventeen drones impacted across 14 locations, the air force said. Seven people were killed and another 15 injured in the city of Druzhkivka in the Donetsk region in a Russian attack on Wednesday, according to the Ukrainian military. Russia's Defense Ministry, meanwhile, said its forces shot down 24 Ukrainian drones overnight. ABC News' Oleksiy Pshemyskiy and Somayeh Malekian contributed to this report."
}