{
  "url": "https://en.wikipedia.org/wiki/Buckhead",
  "title": "Buckhead - Wikipedia",
  "text": "Buckhead Buckhead is the uptown commercial and residential district of the city of Atlanta, Georgia, comprising approximately the northernmost fifth of the city. Buckhead is the third-largest business district within the Atlanta city limits, behind Downtown and Midtown, and a major commercial and financial center of the Southern U.S. Buckhead is anchored by a core of high-rise office buildings, hotels, shopping centers, restaurants and condominiums centered around the intersection of Peachtree Road and Piedmont Road near Georgia State Route 400, the Buckhead MARTA station, and Lenox Square. History [edit]In 1838, Henry Irby purchased 202-1/2 acres surrounding the present intersection of Peachtree, Roswell, and West Paces Ferry roads from Daniel Johnson for $650. Irby subsequently established a general store and tavern at the northwest corner of the intersection.[2] The name \"Buckhead\" comes from a story that Irby killed a large buck deer and placed the head in a prominent location.[3][4] Prior to this, the settlement was called Irbyville.[4][5] By the late 1800s, Buckhead had become a rural vacation spot for wealthy Atlantans.[6] In the 1890s, Buckhead was rechristened Atlanta Heights but by the 1920s it was again \"Buckhead\".[7] Buckhead remained dominated by country estates until after World War I, when many of Atlanta's wealthy began building mansions among the area's rolling hills.[6] Simultaneously, a number of Black enclaves began popping up in Buckhead, following events like the 1906 Atlanta race riot and the Great Atlanta fire of 1917, which drove black residents from the city center.[8] Predominantly black neighborhoods within Buckhead included Johnsontown, Piney Grove, Savagetown, and Macedonia Park.[8] Despite the stock market crash of 1929, lavish mansions were still constructed in Buckhead throughout the Great Depression.[6] In 1930, Henry Aaron Alexander built one of the largest homes on Peachtree Road, a 15,000-square-foot (1,400 m2) house with 33 rooms and 13 bathrooms.[6] During the mid-1940s, Fulton County decided to acquire the land comprising Macedonia Park to build what is now Frankie Allen Park.[8] This process, which entailed both eminent domain and \"outright coercion\" displaced over 400 families.[8] During the mid-1940s, Atlanta Mayor William B. Hartsfield sought to annex Buckhead, and a number of other predominantly White suburbs of Atlanta.[9] Fearing that the city's \"Negro population is growing by leaps and bounds\", and was \"taking more white territory inside Atlanta\", Hartsfield sought to annex these communities to counteract the threat of increasing political power for the city's Black residents.[9] The annexation of Buckhead was put to a vote in 1947, but it was rejected by Buckhead voters.[9] Atlanta annexed Buckhead and a number of other nearby communities in 1952, following legislation which expanded Atlanta's city boundaries.[9] In 1956, an estate known as Joyeuse was chosen as the site for a major shopping center to be known as Lenox Square.[citation needed] The mall was designed by Joe Amisano, an architect who designed many of Atlanta's modernist buildings.[citation needed] When Lenox Square opened in 1959, it was one of the first malls in the country, and the largest shopping center in the Southeastern U.S. Office development soon followed with the construction of Tower Place in 1974.[citation needed] To reverse a downturn in Buckhead Village during the 1980s, minimum parking spot requirements for bars were lifted, which quickly led to it becoming the most dense concentration of bars and clubs in the Atlanta area.[10][better source needed] Many bars and clubs catered mostly to the black community in the Atlanta area, including Otto's, Cobalt, 112, BAR, World Bar, Lulu's Bait Shack, Mako's, Tongue & Groove, Chaos, John Harvard's Brew House, Paradox, Frequency & Havana Club.[11][12] The area became renowned as a party spot for Atlanta area rappers and singers, including Outkast, Jazze Pha, Jagged Edge, Usher and Jermaine Dupri, who mentioned the neighborhood's clubs on his song \"Welcome to Atlanta\".[citation needed] Following the events of the Ray Lewis murder case in Buckhead on the night of the 2000 Super Bowl (held in Atlanta at the Georgia Dome), as well as a series of murders involving the Black Mafia Family, residents sought to ameliorate crime by taking measures to reduce the community's nightlife and re-establish a more residential character.[11] The Buckhead Coalition's president and former Atlanta Mayor Sam Massell, along with councilwoman Mary Norwood were instrumental in persuading the Atlanta City Council to pass a local ordinance to close bars at 2:30 AM rather than 4 AM, and liquor licenses were made more difficult to obtain.[citation needed] Eventually, most of the Buckhead Village nightlife district was acquired for the \"Buckhead Atlanta\" multi-use project, and many of the former bars and clubs were razed in 2007.[13] Proposed secession from Atlanta [edit]In 2008, a newsletter[14] by the Fulton County Taxpayers Foundation began circulating that proposed the secession of Buckhead into its own city after more than 50 years as part of Atlanta. This came on the heels of neighboring Sandy Springs, which finally became a city in late 2005 after a 30-year struggle to incorporate, and which triggered other such incorporations in metro Atlanta's northern suburbs. Like those cities, the argument to create a city of Buckhead is based on the desire for more local control and lower taxes.[citation needed] Discussions revolving around potential secession from Atlanta were revived in late 2021, with proponents of secession arguing that splitting from Atlanta would enable Buckhead to better tackle crime in the area.[15][16] In Atlanta's Police Zone 2, which includes Buckhead, Lenox Park, Piedmont Heights, and West Midtown, murder was up 63% in 2021 compared to the previous year, going from 8 cases to 13. However, in the same period crime overall was down by 6%, and according to police chief Rodney Bryant, Zone 2 had only a fraction of the violent crimes seen in other neighborhoods of Atlanta.[17] Buckhead, one of the wealthiest neighborhoods in Atlanta, would deprive the city of upwards of 40% of its tax revenue if it seceded.[15] Political scientists and journalists have also highlighted that Buckhead is significantly more conservative and white than the rest of Atlanta.[15] Commentators have also noted that this secession attempt is \"more serious\" than earlier efforts,[15] due to polling data showing 54% to 70% of Buckhead's residents favor the move,[15][16] and due to pro-secession organizations raising nearly $1,000,000 to promote the split.[15] A referendum did not occur in 2022 or early 2023, as the Georgia General Assembly tabled the bills that would have provided for this referendum during the 2022 legislative session.[18] During the 2023 session, on April 27, the issue of incorporation was brought to the Georgia State Senate in the form of SB114. The bill prompted a response from governor Brian Kemp on the legality and workability of incorporating Buckhead as a city, but was ultimately rejected 33-23. The against votes consists of all Democrats in the Senate, and ten Republicans who broke rank to join them. The Republicans who were in favor of allowing a secession vote argued that the citizens of Buckhead were not being represented by their municipal government and that the decision to form their own municipality should be up to the citizens themselves. If the bill succeeded, it would have begun the referendum process to secede from Atlanta.[19][20][21] Geography [edit]Buckhead was originally the central area now called \"Buckhead Village\". The current usage of the term Buckhead roughly covers the interior of the \"V\" formed by Interstate 85 on the east and Interstate 75 on the west. Buckhead is bordered by Cumberland and Vinings in Cobb County to the northwest, the city of Sandy Springs to the north, Brookhaven and North Druid Hills in DeKalb County to the east, Midtown Atlanta to the south, and West Midtown to the west. Neighborhoods [edit]Buckhead comprises most of the neighborhoods of Atlanta's north side, 43 in total.[22][23] - Argonne Forest - Brandon - Brookwood - Brookwood Hills - Buckhead Forest - Buckhead Heights - Buckhead Village - Castlewood - Channing Valley - Chastain Park - Collier Hills - Colonial Homes - Cross Creek - East Chastain Park - Garden Hills - Hanover West - Haynes Manor - Historic Brookhaven - Kingswood - Lenox - Lindbergh/Morosgo - Margaret Mitchell - Mount Paran/Northside - Memorial Park - Mount Paran Parkway - North Buckhead - Paces - Peachtree Battle - Peachtree Heights East - Peachtree Heights West - Peachtree Hills - Peachtree Park - Pine Hills - Pleasant Hill - Randall Mill - Ridgedale Park - Springlake - South Tuxedo Park - Tuxedo Park - Underwood Hills - West Paces Ferry/Northside - Westminster/Milmar - Whitewater Creek - Wildwood - Woodfield - Wyngate The southernmost area around the Brookwood and Ardmore neighborhoods is sometimes regarded as a separate neighborhood of \"South Buckhead\".[24][25][26] Demographics [edit]Since at least the 1950s, Buckhead has been known as a district of extreme wealth, with the western and northern neighborhoods being virtually unrivaled in the Southeast. In 2011, The Gadberry Group compiled the list of the 50 wealthiest zip codes in the United States, ranking Buckhead's western zip code (30327) as the second wealthiest zip code in the South (behind Palm Beach's 33480) and the second wealthiest zip code east of California and south of Virginia.[27] The same group reported the average household income at $280,631, with an average household net worth of $1,353,189.[27] These 2011 figures are up from a similar 2005 study that pegged Buckhead as the wealthiest community in the South and the only settlement south of the Washington D.C. suburb of Great Falls, and east of the Phoenix suburb of Paradise Valley to be among the 50 wealthiest communities in the country.[28] However, according to Forbes magazine, (30327) is the ninth-wealthiest zip code in the nation, with a household income in excess of $341,000.[29] The Robb Report magazine has consistently ranked Buckhead one of the nation's \"10 Top Affluent Communities\" due to \"the most beautiful mansions, best shopping, and finest restaurants in the Southeastern United States\".[30][31][32][33][34] Due to its wealth, Buckhead is sometimes promoted as the \"Beverly Hills of the East\" or \"Beverly Hills of the South\" in reference to Beverly Hills, California, an area to which it is often compared.[35][36] Economy [edit]At the heart of Buckhead around the intersections of Lenox, Peachtree and Piedmont Roads, is a shopping district with more than 1,500 retail units where shoppers spend more than $3 billion a year.[37] In addition, Buckhead contains the highest concentration of upscale boutiques in the United States.[38] The majority are located at Lenox Square and Phipps Plaza, sister regional malls located diagonally across from each other at the intersection of Peachtree and Lenox Roads. The malls are home to designer boutiques, mainstream national retailers, as well as six major department stores. This commercial core also has a concentration of \"big-box\" retailers. The \"Buckhead Atlanta\" mixed-use development brought even more exclusive boutiques, restaurants, hotels, condos and office space to the heart of Buckhead in 2014.[13][39] The name of the project was rebranded as 'Buckhead Atlanta'.[40] Buckhead is also a center for healthcare, and is home both to Piedmont Hospital and the private, catastrophic care hospital Shepherd Center which specializes in spinal cord injury and acquired brain injury. The two hospitals are located adjacent to one another along Peachtree Road. (This location is known as \"Cardiac Hill\" by runners of the annual Peachtree Road Race.[41]) Buckhead is also the location of a large share of Atlanta's diplomatic missions. Consulates in Buckhead include the Consulate-General of Australia and the Australian Trade Commission,[42] the Consulate-General of France and the French Trade Commission,[43] the Consulate-General of Brazil, the Consulate-General of Japan,[44][45] and the Consulate of Greece.[46] Cityscape [edit]In 1982 the Buckhead Business Association created an official boundary map for Buckhead. The Georgia House of Representatives adopted that boundary, as did the Atlanta Regional Commission.[47] While much of west and north Buckhead is preserved as single-family homes in forested settings, the Peachtree Road corridor has become a major focus of high-rise construction. The first 400-foot (121 m) office tower, Tower Place, opened in 1974. Park Place, built in 1986, was the first 400+ foot (121+ m) condominium building. 1986 also saw the completion of the 425-foot (129 m), 34-story Atlanta Plaza, then Buckhead's tallest and largest building. In 2000, Park Avenue Condominiums pushed the record to 486 feet (148 m).[48] Since that time, a wave of development has followed. The 660-foot (201 m) Sovereign and 580-foot (177 m) Mandarin Oriental, now renamed the Waldorf-Astoria, were completed in 2008. Many luxury high-rise apartment buildings have been built recently, including the 26-story Post Alexander High Rise in 2014 and the 26-story SkyHouse Buckhead in 2014. Today, Buckhead has over 50 high-rise buildings, almost one-third of the city's total.[48] Education [edit]Elementary and secondary schools [edit]Public schools in Buckhead are administered by Atlanta Public Schools.[47] The following public elementary schools serve Buckhead: - Morris Brandon Elementary School[49] - Garden Hills Elementary School[50] - Warren T. Jackson Elementary School[51] - E. Rivers Elementary School[52] - Sarah Rawson Smith Elementary School[53] The area is served by Sutton Middle School and North Atlanta High School.[54][55] By 2012, due to overall population increases in Buckhead, many schools became increasingly crowded. Brandon Elementary was at 97% capacity, Garden Hills was at 102% capacity, E. Rivers was at 121% capacity, and Sutton was at 150% capacity. In the round of school zone change proposals in 2012, Ernie Suggs of The Atlanta Journal-Constitution said that the zones of Buckhead \"remained pretty much intact.\"[56] There is an area charter school, Atlanta Classical Academy. Local private schools include the Atlanta International School, the Atlanta Speech School, Christ the King School, the Atlanta Girls School, The Galloway School, Holy Spirit Preparatory School, Trinity School, The Lovett School, Pace Academy, and The Westminster Schools. Colleges and universities [edit]Georgia State University's J. Mack Robinson College of Business' Buckhead Center is located in the heart of Buckhead. This facility houses Georgia State's Executive MBA program. Its \"Leadership Speaker Series\", which showcases an agenda of executive officers from prestigious, well-known companies is also hosted at their Buckhead Center.[46] The University of Georgia's Terry College of Business Executive Education Center is located in Buckhead. This facility houses the university's executive MBA program and Terry Third Thursday, a lecture series featuring business leaders. Public libraries [edit]There are two branches of the Atlanta-Fulton Public Library System in Buckhead: Northside Branch and Buckhead Branch.[57] Transportation [edit]Roadways [edit]The main north–south street of Buckhead is Peachtree Road, which extends south into the heart of the city as Peachtree Street, Atlanta's main street. This name change is significant in that it defines a border between Buckhead and Midtown. The main east–west street is Paces Ferry Road, named for a former ferry that used to cross the Chattahoochee River. Hardy Pace, one of Atlanta's founders, operated the ferry and owned much of what is now Buckhead. In addition to Peachtree and West Paces Ferry Roads, other arterial roads include Piedmont Road (Georgia 237), Roswell Road (Georgia State Route 9), and Northside Parkway. Mass transit [edit]In the early 1990s, after a bitter fight against GDOT by residents, Buckhead was split in two by Georgia 400, a tolled extension of a freeway connecting I-285 to I-85. However, MARTA's Red Line extension was put in the highway's median, providing additional mass transit to Buckhead and Sandy Springs.[58][59][60] MARTA operates three stations in Buckhead, the southernmost being Lindbergh Center. Just north of there, the Red and Gold lines split, with the Gold Line's Lenox station at the southwest corner of the Lenox Square parking lot, and the Red Line's Buckhead station on the west side of the malls where Peachtree crosses 400. A free circulator bus called \"the buc\" (Buckhead Uptown Connection) stops at all three stations. The proposed extension of the Atlanta Streetcar to Buckhead (nicknamed the \"Peachtree Streetcar\" because it would run along Peachtree Street in Downtown Atlanta and Peachtree Road in Buckhead) would provide street-level service with frequent stops all the way to downtown Atlanta, complementing the existing subway-type MARTA train service for the area.[61][60][62] Pedestrians and cycling [edit]- North Beltline Trail (Under construction) - Chastain Park Trail - Mountain To River Trail - Paces Ferry Trail - PATH400,[63] which provides a 5.2 mile pathway throughout the heart of Buckhead that connects different trails and parks. PATH400 connects the people of Buckhead to surrounding neighborhoods, offices, and retail locations. Bike Share In 2017, the Relay Bike Share program expanded into Buckhead. Three new stations were installed with plans to add more in the future.[64][65] Notable residents [edit]- Julius Erving, Basketball player, sports and business executive, and golf course manager who moved to Buckhead, Atlanta in 2009 and owns a golf and country club[66] - Elton John, Singer, songwriter, formerly lived in Buckhead part time[67] - Katherine Lee, Delta Air Lines employee known as \"Deltalina\"[68] - Kelly Loeffler[69] former U.S. senator, in Tuxedo Park[70] - Will Welch, editor-in-chief of GQ[71] See also [edit]References [edit]- ^ \"Stats show Buckhead is still majority-White and wealthy; police use of force is low\". July 7, 2020. - ^ Garrett, Franklin M. (1969). Atlanta and environs; a chronicle of its people and events. University of Georgia Press. p. 160. - ^ Krakow, Kenneth K. (1975). Georgia Place-Names: Their History and Origins (PDF). Macon, GA: Winship Press. p. 27. ISBN 0-915430-00-2. - ^ a b \"How Buckhead Got Its Name - 90.1 FM WABE\". Wabe.org. October 28, 2013. - ^ \"Atlanta, Georgia – History, historic\". Buckhead. Retrieved March 29, 2011. - ^ a b c d \"Buckhead, Atlanta\". Forbes.com. - ^ \"In the 1980s an effort was made to change the name to Atlanta Heights, to no avail. The people preferred the picturesque name of Buckhead.\" in The Atlanta Historical Bulletin, Volume 1 (1927), p.26 - ^ a b c d Henry, Scott (June 6, 2012). \"Buckhead's black past\". Creative Loafing. Archived from the original on September 6, 2015. Retrieved December 1, 2021. - ^ a b c d Johnson, Larry (May 20, 2016). \"The 1952 Atlanta Annexations\". cobbcountycourier.com. Archived from the original on September 28, 2021. Retrieved December 1, 2021. - ^ \"Buckhead Village BAR BRAWL: Critics try to pressure landlords of busy clubs\". Thebuckheadalliance.org. - ^ a b Lyles, Harry Jr. (January 31, 2019). \"How Ray Lewis' Super Bowl night in Buckhead changed Atlanta forever\". SBNation.com. Retrieved January 31, 2019. - ^ Scott Henry, \"Buckhead Rising\", Creative Loafing, May 31, 2006 - ^ a b Clark Dean, \"Lost in Buckhead Atlanta\", Atlanta Business Journal, June 29, 2011 - ^ \"Archived copy\" (PDF). Archived from the original (PDF) on July 26, 2011. Retrieved November 22, 2009. {{cite web}} : CS1 maint: archived copy as title (link) - ^ a b c d e f Pulley, Brett; Mock, Brentin (October 1, 2021). \"Atlanta's Wealthiest and Whitest District Wants to Secede\". Bloomberg Businessweek. Archived from the original on October 17, 2021. Retrieved December 1, 2021. - ^ a b Jones, Valencia (September 1, 2021). \"Buckhead Inches Closer To Seceding From The City Of Atlanta\". atlanta.cbslocal.com. WUPA. Archived from the original on December 2, 2021. Retrieved December 1, 2021. - ^ Crime concerns behind neighborhood's idea to secede from Atlanta from ABC News - ^ \"Lieutenant governor throws up roadblock for Buckhead cityhood bill in Georgia Senate\". 11Alive.com. January 13, 2022. Retrieved October 3, 2022. - ^ Wheatley, Thomas (March 3, 2023). \"Georgia Senate bucks Buckhead cityhood push\". Axios. Retrieved May 22, 2023. - ^ Amy, Jeff (March 3, 2023). \"Georgia senators reject Buckhead efforts to leave Atlanta\". Associated Press. Retrieved May 22, 2023. - ^ Mock, Brentin (March 2, 2023). \"How Buckhead's Secession From Atlanta Would Destabilize the Entire State\". Bloomberg News. Retrieved May 22, 2023. - ^ \"Atlanta, Georgia – Buckhead Neighborhood Map\". Buckhead. Retrieved March 29, 2011. - ^ NPU B Map, City of Atlanta Online Archived August 13, 2011, at the Wayback Machine - ^ \"South Buckhead apartment project under way\", Atlanta Business Chronicle, Douglas Sams, November 13, 2012 - ^ \"Atlanta Neighborhoods Guide - Find Hotels, Events & More\". Atlanta.net. - ^ \"Buckhead - Atlanta, Georgia - South Buckhead (SOBU)\". Buckhead.net. - ^ a b \"America's Richest Zip Codes 2011\". Bloomberg.com. December 7, 2011. - ^ \"EXPLORING AMERICA'S RICHEST ZIP CODES\". Adage.com. April 4, 2005. - ^ Excess household income of Buckhead - ^ Buckhead: A Place for All Time Archived September 28, 2007, at the Wayback Machine - ^ \"AmeriSuites Buckhead in Atlanta\". Worldres.com. Archived from the original on April 2, 2015. Retrieved July 11, 2018. - ^ \"Mobil Travel Guide 49th Annual Five-Star Awards\". Mobil. Archived from the original on November 21, 2007. Retrieved January 16, 2007. - ^ Patrice, Harris (July 16, 2004). \"Atlanta–Discover the Possibilities Of the 'Athens of the South'\". Psychiatric News. 39 (14). - ^ . August 29, 2006 https://web.archive.org/web/20060829002325/http://www.commerce.virginia.edu/career_services/Students/Handouts/city-sheet-Atlanta2006.doc. Archived from the original on August 29, 2006. Retrieved July 11, 2018. {{cite web}} : Missing or empty|title= (help) - ^ \"Atlanta, Nashville, New Orleans\". Rhythms of the South. Archived from the original on July 15, 2011. Retrieved March 29, 2011. - ^ \"About Atlanta\". Iwf2008.objectwareinc.com. Retrieved March 29, 2011. - ^ \"Shopping in Atlanta - Frommer's\". Frommers.com. - ^ USDM.net. \"Atlanta Shopping Guide – Atlanta, GA Shopping Malls, Outlets & More\". Atlanta.net. Retrieved March 29, 2011. - ^ \"Oliver Mcmillan - Curbed Atlanta\". atlanta.curbed.com. - ^ \"Home\". The Shops Buckhead Atlanta. - ^ Karkaria, Urvaksh (September 15, 2008). \"Piedmont Healthcare launches $525M plan\". - ^ \"Australian Consulate-General and Trade Commission, Atlanta, United States of America Archived 2009-07-28 at the Wayback Machine.\" Department of Foreign Affairs and Trade. Retrieved on July 28, 2009. - ^ \"THE CONSULATE GENERAL OF FRANCE IN ATLANTA IS MOVING Archived 2011-07-18 at the Wayback Machine.\" French Consulate General, Atlanta. Retrieved on September 19, 2010. - ^ Williams, Trevor. \"It's Official: Brazil's Consulate Open in Atlanta[permanent dead link].\" Global Atlanta. August 26, 2008. Retrieved on July 28, 2009. - ^ \"Directions to the Consulate General of Japan in Atlanta.\" Consulate-General of Japan in Atlanta. Retrieved on July 28, 2009. - ^ \"Consulate Atlanta, GA Archived 2009-01-25 at the Wayback Machine.\" Embassy of Greece in Washington, DC. Retrieved on July 28, 2009. - ^ a b Kennedy, Thornton (June 1, 2018). \"Where's Buckhead? Depends on who you ask\". Northside Neighbor. Retrieved September 25, 2021. - Map of boundary, which can be compared to Atlanta Public Schools boundary maps. - ^ a b Emporis Building Database: Buckhead Atlanta - ^ \"Brandon Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"Garden Hills Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"Jackson Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"Rivers Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"Smith Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"Sutton Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ \"North Atlanta Zone: 2018-19\" (PDF). Atlanta Public Schools. Retrieved September 25, 2021. - ^ Suggs, Ernie. \"Buckhead comes out ahead in redistricting battle.\" The Atlanta Journal-Constitution. Friday March 16, 2012. Retrieved on March 28, 2012. - ^ \"Buckhead Branch.\" Atlanta-Fulton Public Library System. Retrieved on July 28, 2009. - ^ \"atlanta, ga\". Google Maps. Retrieved March 29, 2011. - ^ \"Atlanta, Georgia – www.Buckhead, inc. – Buckhead Web\". Buckhead. Retrieved March 29, 2011. - ^ a b \"MARTA – Metropolitan Atlanta Rapid Transit Authority\". Itsmarta.com. Retrieved March 29, 2011. - ^ \"Atlanta Streetcar\". Atlantadowntown.com. Archived from the original on October 4, 2016. Retrieved October 1, 2016. - ^ \"chtree Corridor Partnership – The Modern Streetcar\". Peachtreecorridor.org. Archived from the original on January 3, 2011. Retrieved March 29, 2011. - ^ \"First phase of PATH400\", Buckhead Patch - ^ \"Buckhead will officially launch its bike share program this week\". Atlanta.curbed.com. July 24, 2017. Retrieved July 11, 2018. - ^ Andrews, Evelyn (March 30, 2018). \"Buckhead bike share ridership is low, but more stations coming\". Ajc.com. Retrieved April 21, 2018. - ^ \"Julius Erving on moving to Atlanta: 'It feels right.'\". The Atlanta Journal-Constitution. September 21, 2009. - ^ Hood-Cree, Cameron. \"Does Elton John really live in Buckhead?\". Retrieved January 17, 2023. - ^ Brett, Jennifer (March 27, 2008). \"Who is Deltalina? Flashback to 2008\". The Atlanta Journal-Constitution. Retrieved January 1, 2021. - ^ Fausset, Richard (October 5, 2020). \"How Kelly Loeffler Went From Atlanta Elite to Trump Loyalist\". The New York Times. Retrieved January 6, 2020. - ^ Buckner, Candace (August 29, 2020). \"How politics transformed Kelly Loeffler from hoops junkie to WNBA villain\". The Washington Post. Retrieved January 11, 2020. - ^ Kloer, Phil. \"Jason Isbell and Will Welch will talk music, masculinity at Fox Theatre\". The Atlanta Journal-Constitution. ISSN 1539-7459. Retrieved December 25, 2022. External links [edit]- Buckhead travel guide from Wikivoyage - Buckhead Business Association - Buckhead Heritage Society - Livable Buckhead - The Storyteller historical marker"
}