{
  "url": "https://whileint.com/pt/tech/stephane/where-is-my-computer-on-windows-11-how-to-find-this-pc-easily/",
  "title": "Onde está ‘Meu Computador’ no Windows 11? Como encontrar 'Este PC' facilmente! - Mundo Geek",
  "text": "No Windows 11, ‘Meu Computador’ atende pelo nome de ‘Este PC’. Mas não é fácil encontrá-lo se você não souber onde procurar, já que a Microsoft retirou esse atalho muito utilizado na área de trabalho e no menu Iniciar. Mas, felizmente, pode ser trazido de volta. Neste guia, veremos como trazer Meu Computador (ou Este PC) de volta ao seu lugar, ou seja, à frente. Tem Windows 10?Não se preocupe. Embora os guias abaixo mostrem a IU do Windows 11, eles também são totalmente compatíveis com o Windows 10. Para que serve 'Meu Computador'? 'Meu Computador' costumava ser o espaço ideal para qualquer pessoa que desejasse explorar as unidades de seu computador e gerenciar o conteúdo delas. Mas, além disso, também forneceu uma maneira de acessar rapidamente a página ‘Informações do sistema’ (clicando com o botão direito e selecionando ‘Propriedades’). Essas duas coisas juntas fizeram de 'Meu Computador' a porta de entrada para todo o seu computador, incluindo todas as unidades e informações do sistema. É por isso que foi (e ainda é) talvez um dos elementos mais importantes para um usuário do Windows. Relacionado: Aqui estão as maneiras fáceis de acessar 'Meu Computador' facilmente. Método 1: Acesse ‘Meu Computador’ na área de trabalho com o atalho ‘Este PC’ Para voltar ‘Meu Computador’ no Windows 11, siga as etapas abaixo: - Clique com o botão direito na área de trabalho e selecionePersonalizar. - Isso abrirá a página Configurações de personalização. Clique emTemasà direita. - Em seguida, role para baixo e clique emConfigurações de ícones da área de trabalhoem 'Configurações relacionadas'. - Isso abrirá a janela Configurações do ícone da área de trabalho. Aqui, selecioneComputadorpara que haja uma verificação antes disso. Então cliqueOK. - Agora você verá 'Este PC' aparecer na sua área de trabalho, onde ele pertence. Relacionado: Método 2: Fixe ‘Este PC’ para iniciar Este método é inspirado no anterior, pois para fixar 'Este PC' no menu Iniciar, você precisará primeiro colocá-lo na área de trabalho. - Depois de ter Este PC na área de trabalho, clique com o botão direito e selecioneFixar para começar. - Agora pressione Iniciar para ver onde este PC está fixado. - Na maioria dos casos, ele será fixado no final da lista. Role para baixo para chegar lá, caso não consiga encontrá-lo na primeira página. Alternativamente, você pode clicar no último ponto à direita do menu Iniciar. - Em seguida, clique com o botão direito em Este PC e selecioneMover para o topofazer isso. - Agora você pode acessar facilmente Este PC no menu Iniciar. Relacionado: Método 3: crie um atalho ‘Este PC’ na área de trabalho Outra maneira de colocar ‘Este PC’ na área de trabalho é trazer seu atalho para a área de trabalho. - Para fazer isso, primeiro pressione Win + E para chegar ao Windows Explorer. Você verá Este PC e seus constituintes no painel esquerdo. - Basta arrastar 'Este PC' para a área de trabalho para que seu atalho apareça lá. Método 4: alterar as opções de pasta para abrir o File Explorer para ‘Este PC’ Você pode alterar o Explorador de Arquivos para abrir Meu Computador (ou Este PC) em vez do Acesso Rápido padrão. - Para fazer isso, primeiro pressione o Win + E atalho para abrir o Windows Explorer. - Clique no ícone de reticências na barra de ferramentas superior. - SelecioneOpções. - Na guia 'Geral', clique no menu suspenso ao lado deAbra o Explorador de Arquivos para. - SelecioneEste PC. - CliqueOK. Agora, sempre que você abrir o Explorador de Arquivos, você abrirá diretamente neste PC. Perguntas frequentes (FAQ): Aqui respondemos algumas perguntas frequentes sobre 'Meu Computador' ou Este 'PC'. Por que o Windows E não abre meu computador? Por que o atalho não está funcionando? SeWin + E não abre diretamente em Meu Computador, você pode ter as Opções do Windows Explorer configuradas para abrir em Acesso Rápido. Para mudar isso, consulte a seção antes das Perguntas frequentes. Como coloco o ícone ‘Este PC’ no Windows 11? Você pode trazer de volta o ícone ‘Este PC’ através das Configurações de Personalização do Windows ou adicionar seu atalho do Acesso Rápido à Área de Trabalho ou ao Menu Iniciar. Consulte o guia acima para o mesmo. Qual é o atalho de teclado para abrir Meu Computador/Este PC? Se você configurou as opções do Windows Explorer para abrir diretamente neste PC, você pode simplesmente usar oWin + E atalho para fazer isso. 'Meu computador' e 'Este PC' são iguais? Sim, 'Meu Computador' e 'Este PC' são exatamente iguais. Esta mudança nominal foi introduzida pela Microsoft no Windows 8, substituindo efetivamente a primeira pela última. Mas a mudança é apenas de nome; em termos de funcionalidade, é tudo igual. RELACIONADO"
}