{
  "url": "https://karnishummus.com/dips/",
  "title": "Dips – Karnis",
  "text": "A SYMPHONY OF FLAVORS The Traditional Hummus, Tahini and other familiar dips, in a whole new bursting tastes and scents, fresh from our kitchen to yours. Mediterranean Straight from the other side of the world, where the warm breeze carries the scents of the olive trees with some sea salt. Arabian Table A long tradition of drying, smoking and cooking artisan dishes with a touch of healthy ingredients. Aioli Dressings The golden touch of a dressing on top of your favorite dishes, stops time with a magical taste buds celebration. A Culinary Trip For over 50 years our family has traveled to every corner of the Middle East culinary cultural tradition. Our products’ surprising taste is the result of these carefully collected recipes. Original Hummus Our Hummus is velvety smooth, creamy in texture and incredibly authentic in taste. More than just a dip, Karnis Hummus is our traditional creation! Joyous Make it a habit. Matbucha Cooked fresh tomatoes, peeled roasted bell peppers, fresh garlic and special seasoning blends makes this an authentic tasty Moroccan salsa. Great for sandwiches and any kind of chips. Silky Time to upgrade your salad. Tahin-it. Tahini Mom, It's almost as good as your cooking... No, Seriously?! – never tell her anything like that, just keep your healthy pleasures to yourself. Babaghanoush Brilliance! Shakshuka A dish of slow-cooked fresh tomatoes, roasted peppers, garlic, herbs and blend of seasoning. Check out our Lifestyle posts for recipes.The Journey Even the longest journey for a whole new taste, starts with the first step… Turkish Salad Fire roasted red peppers, tomatoes with a touch of “Heat”, special herbs and seasoning, mixed with fried eggplant make this a mouthwatering salad. Wake Up! Let us take you far away to the hot summer days in the Mediterranean fields, where our love story begins… It was grand-grand papa who harvested the fresh ingredients with a dream of making it all happen. Fast forward to a good 40 some years after, the Karnis Hummus & More factory is using the same natural and organic vegetables to maintain this tradition. America – wake up to a whole new taste. Fresh, full of flavors and delicious. Veggie Liver Our Vegetarian Chopped Liver has an elegant richness. The sweet caramelized onions and the hard boiled egg imitate real liver flavor perfectly."
}