{
  "url": "https://en.wikipedia.org/wiki/L",
  "title": "L - Wikipedia",
  "text": "L L, or l, is the twelfth letter of the Latin alphabet, used in the modern English alphabet, the alphabets of other western European languages and others worldwide. Its name in English is el (pronounced /ˈɛl/ ⓘ EL), plural els.[1] History Lamedh may have come from a pictogram of an ox goad or cattle prod. Some have suggested that it represents a shepherd's staff.[2] Typographic variants In most sans-serif typefaces, the lowercase letter ell ⟨l⟩, written as the glyph l, may be difficult to distinguish from the uppercase letter \"eye\" ⟨I⟩ (written as the glyph I); in some serif typefaces, the glyph l may be confused with the glyph 1, the digit one. To avoid such confusion, some newer computer fonts (such as Trebuchet MS) have a finial, a curve to the right at the bottom of the lowercase letter ell. Other style variants are provided in script typefaces and display typefaces. All these variants of the letter are encoded in Unicode as U+004C L LATIN CAPITAL LETTER L or U+006C l LATIN SMALL LETTER L, allowing presentation to be chosen according to each context. For specialist mathematical and scientific use, there are a number of dedicated codepoints in the Mathematical Alphanumeric Symbols block. In the Romain du Roi, where the ascenders of lowercase letters have symmetrical serifs at the top, l has an extra serif to the left at the mean line to distinguish it from capital I.[3] Another means of reducing such confusion is to use symbol ℓ, which is a cursive, handwriting-style lowercase form of the letter \"ell\". In Japan and Korea, for example, this is the symbol for the liter. (The International Committee for Weights and Measures recommends using L or l for the liter,[4] without specifying a typeface.) In Unicode, the cursive form is encoded as U+2113 ℓ SCRIPT SMALL L from the \"letter-like symbols\" block. Unicode encodes an explicit symbol as U+1D4C1 𝓁 MATHEMATICAL SCRIPT SMALL L.[5] The TeX syntax <math>\\ell</math> renders it as . In mathematical formulas, an italic form (ℓ) of the script ℓ is the norm. Use in writing systems English In English orthography, ⟨l⟩ usually represents the phoneme /l/, which can have several sound values, depending on the speaker's accent, and whether it occurs before or after a vowel. In Received Pronunciation, the alveolar lateral approximant (the sound represented in IPA by lowercase [l]) occurs before a vowel, as in lip or blend, while the velarized alveolar lateral approximant (IPA [ɫ]) occurs in bell and milk. This velarization does not occur in many European languages that use ⟨l⟩; it is also a factor making the pronunciation of ⟨l⟩ difficult for users of languages that lack ⟨l⟩ or have different values for it, such as Japanese or some southern dialects of Chinese. A medical condition or speech impediment restricting the pronunciation of ⟨l⟩ is known as lambdacism. In English orthography, ⟨l⟩ is often silent in such words as walk or could (though its presence can modify the preceding vowel letter's value), and it is usually silent in such words as palm and psalm; however, there is some regional variation. L is the eleventh most frequently used letter in the English language. Other languages ⟨l⟩ usually represents the sound [l] or some other lateral consonant. Common digraphs include ⟨ll⟩, which has a value identical to ⟨l⟩ in English, but has the separate value voiceless alveolar lateral fricative (IPA [ɬ]) in Welsh, where it can appear in an initial position. In Spanish, ⟨ll⟩ represents /ʎ/ ([ʎ], [j], [ʝ], [ɟʝ], or [ʃ], depending on dialect). A palatal lateral approximant or palatal ⟨l⟩ (IPA [ʎ]) occurs in many languages, and is represented by ⟨gli⟩ in Italian, ⟨ll⟩ in Spanish and Catalan, ⟨lh⟩ in Portuguese, and ⟨ļ⟩ in Latvian. In Turkish, ⟨l⟩ generally represents /l/, but represents /ɫ/ before ⟨a⟩, ⟨ı⟩, ⟨o⟩, or ⟨u⟩. In Washo, lower-case ⟨l⟩ represents a typical [l] sound, while upper-case ⟨L⟩ represents a voiceless [l̥] sound, a bit like double ⟨ll⟩ in Welsh. Other systems The International Phonetic Alphabet uses ⟨l⟩ to represent the voiced alveolar lateral approximant and a small cap ⟨ʟ⟩ to represent the voiced velar lateral approximant. Other uses - The capital letter L is used as the currency sign for the Albanian lek and the Honduran lempira. It was often used, especially in handwriting, as the currency sign for the Italian lira. Historically, it was commonly used as a currency sign for the British pound sterling (to abbreviate the Latin libra, a pound, see £sd); in modern usage, it has been overtaken by the pound sign (£), which is based on , the blackletter form of the letter. In running text, its lower-case form (usually italicised), l, was more often seen.[a] - The Roman numeral L represents the number 50.[7] - In the International system of units, the liter (or litre) is abbreviated using a lower-case l or ℓ, or an upper-case L. The latter form is used to avoid the risk of confusion between the letter l (el) and the numeral 1 (one) [4] (For ℓ, see above.) - In watchmaking, the ligne (a traditional French measure of length still used in the industry) is abbreviated using an upper-case L.[8] - In chemistry, L is used as a symbol for the Avogadro constant.[9] Related characters Descendants and related characters in the Latin alphabet - IPA-specific symbols related to L: ʟ ɫ ɬ ɭ ɺ ɮ ꞎ ˡ - IPA superscript symbols related to L:[10] 𐞛 𐞜 - Extensions to IPA for disordered speech (extIPA):[11][12] 𝼄 𐞝 - Uralic Phonetic Alphabet-specific symbols related to L:[13] - U+1D0C ᴌ LATIN LETTER SMALL CAPITAL L WITH STROKE - U+1D38 ᴸ MODIFIER LETTER CAPITAL L - ₗ : Subscript small l was used in the Uralic Phonetic Alphabet prior to its formal standardization in 1902[14] - ȴ : L with curl is used in Sino-Tibetanist linguistics[15] - Ꞁ ꞁ : Turned L was used by William Pryce to designate the Welsh voiced lateral spirant [ɬ][16] The lower case is also used in the Romic alphabet. In Unicode, these are U+A780 Ꞁ LATIN CAPITAL LETTER TURNED L and U+A781 ꞁ LATIN SMALL LETTER TURNED L. - 𝼦 : Small letter l with mid-height left hook was used by the British and Foreign Bible Society in the early 20th century for romanization of the Malayalam language.[17] - Other variations are used for phonetic transcription: ᶅ[18] ᶩ[18] ᶪ[18] ᶫ[18] 𝼑[19][12] 𝼓[19][12] - Ꝇ ꝇ : Broken L was used in some medieval Nordic manuscripts[20] - Teuthonista phonetic transcription-specific symbols related to L:[21] - U+AB37 ꬷ LATIN SMALL LETTER L WITH INVERTED LAZY S - U+AB38 ꬸ LATIN SMALL LETTER L WITH DOUBLE MIDDLE TILDE - U+AB39 ꬹ LATIN SMALL LETTER L WITH MIDDLE RING - U+AB5D ꭝ MODIFIER LETTER SMALL L WITH INVERTED LAZY S - U+AB5E ꭞ MODIFIER LETTER SMALL L WITH MIDDLE TILDE - L with diacritics: Ĺ ĺ Ł ł Ľ ľ Ḹ ḹ L̃ l̃ Ļ ļ Ŀ ŀ Ḷ ḷ Ḻ ḻ Ḽ ḽ Ƚ ƚ Ⱡ ⱡ Derived signs, symbols and abbreviations - ℒ 𝓁 : script letter L (uppercase and lowercase, respectively), used in mathematics. (In other contexts, a script typeface (or computer font) should be used.) - ℓ : mathematical symbol 'ell'; liter (traditional symbol)[22] - £ : pound sign - Ꝉ ꝉ : Forms of L were used for medieval scribal abbreviations[23] - Ł or ł, \"L with stroke\" used in Polish and many neighbouring languages Ancestors and siblings in other alphabets Other representations Computing The Latin letters ⟨L⟩ and ⟨l⟩ have Unicode encodings U+004C L LATIN CAPITAL LETTER L and U+006C l LATIN SMALL LETTER L. These are the same code points as those used in ASCII and ISO 8859. There are also precomposed character encodings for ⟨L⟩ and ⟨l⟩ with diacritics, for most of those listed above; the remainder are produced using combining diacritics. Variant forms of the letter have unique code points for specialist use: the alphanumeric symbols set in mathematics and science, and halfwidth and fullwidth forms for legacy CJK font compatibility. Other Notes - ^ For example, see the Diary of Samuel Pepys for 31 December 1661: \" I suppose myself to be worth about 500l. clear in the world, ...\"[6] References - ^ \"L\" Oxford English Dictionary, 2nd edition (1989) Merriam-Webster's Third New International Dictionary of the English Language, Unabridged. (1993); \"el\", \"ells\", op. cit. - ^ \"Ancient Hebrew Research Center\". Archived from the original on January 3, 2015. Retrieved January 12, 2015. - ^ Kleinsorge, Moritz. \"Le Romain du Roi\". Identity Letters. Retrieved January 9, 2025. - ^ a b \"The International System of Units (SI) | The SI brochure, 9th edition, 2019\" (PDF). December 2022. Retrieved July 23, 2023. The litre, and the symbol lower-case l, were adopted by the CIPM in 1879 (PV, 1879, 41). The alternative symbol, capital L, was adopted by the 16th CGPM (1979, Resolution 6; CR, 101 and Metrologia, 1980, 16, 56-57) in order to avoid the risk of confusion between the letter l (el) and the numeral 1 (one). - ^ The Unicode Standard, Version 15.0, Chapter 22 - ^ Pepys, Samuel (December 31, 2004). \"Tuesday 31 December 1661\". The Diary of Samuel Pepys. Archived from the original on November 24, 2021. - ^ Gordon, Arthur E. (1983). Illustrated Introduction to Latin Epigraphy. University of California Press. pp. 44. ISBN 9780520038981. Retrieved October 3, 2015. roman numerals. - ^ \"Foire aux questions sur l'horlogerie et les montres\" [Frequently asked questions about watches and clocks]. horlogerie-suisse.com (in French). Archived from the original on January 21, 2022. Retrieved January 18, 2022. Par tradition ancestrale, les horlogers n'utilisent pas le millimètre mais la ligne pour désigner le diamètre d'encageage d'un mouvement. [By ancestral tradition, watchmakers do not use the millimeter but the line to designate the casing diameter of a movement] - ^ H. P. Lehmann, X. Fuentes-Arderiu, and L. F. Bertello (1996): \"Glossary of terms in quantities and units in Clinical Chemistry (IUPAC-IFCC Recommendations 1996)\"; page 963, item \"Avogadro constant\". Pure and Applied Chemistry, volume 68, issue 4, pages 957–1000. doi:10.1351/pac199668040957 - ^ Miller, Kirk; Ashby, Michael (November 8, 2020). \"L2/20-252R: Unicode request for IPA modifier-letters (a), pulmonic\" (PDF). - ^ Miller, Kirk; Ball, Martin (July 11, 2020). \"L2/20-116R: Expansion of the extIPA and VoQS\" (PDF). - ^ a b c Anderson, Deborah (December 7, 2020). \"L2/21-021: Reference doc numbers for L2/20-266R \"Consolidated code chart of proposed phonetic characters\" and IPA etc. code point and name changes\" (PDF). - ^ Everson, Michael; et al. (March 20, 2002). \"L2/02-141: Uralic Phonetic Alphabet characters for the UCS\" (PDF). - ^ Ruppel, Klaas; Aalto, Tero; Everson, Michael (January 27, 2009). \"L2/09-028: Proposal to encode additional characters for the Uralic Phonetic Alphabet\" (PDF). - ^ Cook, Richard; Everson, Michael (September 20, 2001). \"L2/01-347: Proposal to add six phonetic characters to the UCS\" (PDF). - ^ Everson, Michael (August 6, 2006). \"L2/06-266: Proposal to add Latin letters and a Greek symbol to the UCS\" (PDF). - ^ Miller, Kirk; Rees, Neil (July 16, 2021). \"L2/21-156: Unicode request for legacy Malayalam\" (PDF). - ^ a b c d Constable, Peter (April 19, 2004). \"L2/04-132 Proposal to add additional phonetic characters to the UCS\" (PDF). - ^ a b Miller, Kirk (July 11, 2020). \"L2/20-125R: Unicode request for expected IPA retroflex letters and similar letters with hooks\" (PDF). - ^ Everson, Michael; Baker, Peter; Emiliano, António; Grammel, Florian; Haugen, Odd Einar; Luft, Diana; Pedro, Susana; Schumacher, Gerd; Stötzner, Andreas (January 30, 2006). \"L2/06-027: Proposal to add Medievalist characters to the UCS\" (PDF). - ^ Everson, Michael; Dicklberger, Alois; Pentzlin, Karl; Wandl-Vogt, Eveline (June 2, 2011). \"L2/11-202: Revised proposal to encode \"Teuthonista\" phonetic characters in the UCS\" (PDF). - ^ The Unicode Standard, Version 16.0 (PDF), Letterlike Symbols: Unicode, Inc., p. 230 - ^ Everson, Michael; Baker, Peter; Emiliano, António; Grammel, Florian; Haugen, Odd Einar; Luft, Diana; Pedro, Susana; Schumacher, Gerd; Stötzner, Andreas (January 30, 2006). \"L2/06-027: Proposal to add Medievalist characters to the UCS\" (PDF)."
}