{
  "url": "https://thecfomag.com/uber-appoints-balaji-krishnamurthy-cfo-as-it-eyes-global-av-expansion-by-2026/",
  "title": "Uber Appoints Balaji Krishnamurthy CFO as It Eyes Global AV Expansion by 2026 - thecfomag.com",
  "text": "Uber Technologies has appointed Balaji Krishnamurthy as its new chief financial officer, promoting him from vice president of strategic finance and investor relations. He replaces Prashanth Mahendra-Rajah, who is stepping down after less than three years in the role to pursue another opportunity. Krishnamurthy, who has been with Uber for over six years and previously led investor relations, brings deep familiarity with the company’s operations and a strong interest in autonomous vehicles—he holds a board seat at AV startup Waabi and frequently discusses Uber’s driverless efforts. The leadership change coincides with Uber’s accelerated push into autonomous vehicles (AV), highlighted during its Q4 2025 earnings call on Wednesday. Krishnamurthy emphasized disciplined capital allocation toward AV software partners, equity investments in manufacturers, offtake agreements, and infrastructure support. CEO Dara Khosrowshahi expressed strong confidence in AV’s potential, describing it as a “multi-trillion-dollar opportunity” that amplifies Uber’s platform strengths through global scale and marketplace technology. ALSO READ: ATLANTIC INTERNATIONAL CORPORATION APPOINTS KEVIN J. MURPHY AS NEW CHIEF FINANCIAL OFFICER Khosrowshahi outlined ambitious goals: by the end of 2026, Uber expects to facilitate AV trips in up to 15 cities worldwide, with a roughly even split between U.S. and international locations. The company aims to become the world’s largest facilitator of AV trips by 2029. Uber reported solid financial performance for the fourth quarter, with revenue climbing 20% year-over-year to $14.37 billion, driven largely by robust demand in its food delivery segment. The results underscore the company’s growing free cash flows, which executives plan to deploy strategically—including in AV initiatives—to position Uber for long-term success in mobility."
}