{
  "url": "https://www.metropoles.com/colunas/e-o-bicho/tubaroes-brancos-desenvolvem-dentes-proprios-para-cortar-ossos",
  "title": "Tubarões-brancos desenvolvem dentes próprios para cortar ossos",
  "text": "Tubarões-brancos desenvolvem dentes próprios para cortar ossos Estudo mostra que mudanças nos dentes acompanham o envelhecimento e ajudam a explicar o sucesso do predador no topo da cadeia alimentar atualizado Compartilhar notícia Cientistas descobriram que os tubarões-brancos desenvolvem, ao longo da vida, um novo tipo de dente especializado em cortar carne densa e até ossos. Segundo estudo publicado na revista Ecology and Evolution e divulgado pelo site The Conversation, essas mudanças ajudam a explicar como a espécie se mantém como um dos predadores de topo mais eficientes dos oceanos. Entenda - Os dentes do tubarão-branco mudam conforme a idade e a dieta - Juvenis possuem dentes finos, adaptados a peixes e lulas - A partir de cerca de 3 metros, surgem dentes largos e serrilhados - O sistema dentário é ajustado para agarrar, rasgar e cortar ossos Considerado uma verdadeira obra-prima da evolução, o tubarão-branco reúne velocidade, furtividade e eficiência em um corpo moldado para a caça. Sua dentição, uma de suas marcas mais icônicas, sempre chamou a atenção de pesquisadores, mas apenas agora um estudo amplo conseguiu mapear como esses dentes se transformam na mandíbula durante o envelhecimento do animal. De acordo com os cientistas, diferentes espécies de tubarões desenvolveram dentes específicos para suas dietas, como estruturas em forma de agulha para capturar lulas, dentes achatados para esmagar moluscos ou lâminas serrilhadas para fatiar carne. No caso do tubarão-branco, essa adaptação ocorre não apenas entre espécies, mas ao longo da vida do animal. A pesquisa analisou a dentição de quase 100 tubarões-brancos e identificou padrões claros. Os seis primeiros dentes de cada lado da mandíbula são mais simétricos e triangulares, adequados para perfurar, agarrar e iniciar o corte da presa. A partir daí, os dentes assumem formato de lâmina, mais eficientes para rasgar e cisalhar carne, formando uma divisão funcional semelhante à dos incisivos e molares humanos. As mudanças mais significativas, no entanto, ocorrem com o crescimento. Tubarões jovens, que se alimentam principalmente de peixes e lulas, possuem dentes mais finos e com pequenas projeções laterais, chamadas cúspides acessórias, que ajudam a segurar presas escorregadias. Quando o animal atinge cerca de 3 metros de comprimento, essas estruturas desaparecem. Nesse estágio, os dentes tornam-se mais largos, espessos e fortemente serrilhados, marcando uma virada ecológica. É quando o tubarão-branco passa a incluir mamíferos marinhos na dieta, como focas e golfinhos, presas maiores e mais resistentes. Segundo o estudo, nesse momento surge um novo tipo de dente, capaz não apenas de cortar carne, mas também de atingir ossos. Os pesquisadores observaram ainda que os quatro dentes centrais — dois de cada lado — são mais espessos na base e parecem funcionar como dentes de impacto, absorvendo a força inicial da mordida. Já outros apresentam inclinação e tamanho específicos, sugerindo papéis distintos na contenção da presa e na eficiência do ataque. Há também diferenças claras entre as mandíbulas. Os dentes inferiores são mais adaptados para agarrar e segurar, enquanto os superiores são especializados em cortar e desmembrar, formando um sistema coordenado que maximiza o sucesso alimentar do predador. Segundo os autores, as descobertas mostram que a dentição do tubarão-branco não é uma estrutura estática, mas registro vivo de sua história de vida. A substituição constante permite não apenas repor dentes perdidos, mas também atualizar o “design” conforme as exigências da dieta mudam. O estudo ajuda a compreender por que o tubarão-branco é tão bem-sucedido como predador de topo e reforça a importância de enxergar os animais como organismos dinâmicos, moldados pela interação entre biologia, comportamento e ambiente ao longo do tempo."
}