{
  "url": "https://communaute.orange.fr/t5/ma-connexion/Communication-wap-web-hors-forfait/td-p/540155",
  "title": "Communication wap/web hors forfait - Communauté Orange",
  "text": "- Communauté Orange - ➔ - internet & fixe - ➔ - ma connexion - ➔ - Communication wap/web hors forfait Vous avez une question ? Interrogez la communautéCommunication wap/web hors forfait - S'abonner au fil RSS - Marquer le sujet comme nouveau - Marquer le sujet comme lu - Placer ce Sujet en tête de liste pour l'utilisateur actuel - Marquer - S'abonner - Page imprimable - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Communication wap/web hors forfait Je reviens de l etranger et je viens de recevoir la facture de mon telephone portable Orange. Quelle surprise quand j ai remarqué du hors forfait correspondant à des communications wap/web sur Orange.fr, de nuit lorsque je dormais ou quand j étais en avion!!!!!! Je ne suis pas d accord sur la facturation de ces communications que je n ai pas passé. Comment puis-je faire une reclamation? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait Salut Quand on se déplace à l'étranger, il vaut mieux désactivé les données et le data en Roaming quand on a pas l'utilité. http://assistance.orange.fr/comprendre-les-connexions-internet-depuis-votre-mobile-4809.php Prend contact avec le service client, pour voir si éventuellement ils font un geste : http://contact.orange.fr/ - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait Bonjour, Je rentre de voyage en Guadeloupe (du 5 au 13/3) et je suis effrayée de voir ma facture de tel.portable Orange aussi élevée. En la détaillant je me suis apercue que j avais des communications Wap/Web alors que j avais supprimés la connnection des données ne pouvant pas me connecter sur internet. Je me suis juste contentée d envoyer des SMS et fait quelques appels. Comment puis-je faire une réclamation ? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait @zabounne Bonjour, Vous avez constaté des connexions WAP/WEB facturées en hors-forfait suite à un séjour en Guadeloupe. Afin d'accéder à votre dossier, merci de me communiquer en message privé vos : - Nom, prénom - Adresse postale - Numéro de client - Numéro de mobile frankD - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait bonjour, apres mon arrivé le 4 septembre je constate que j'ai du hors forfait WAP/WEB . je ne comprends pas , apres attache avant mon depart avec le service commercial téléphoniquement et en boutique il appert de leur réponse que avec mon forfait j'etais bon en martinique . la je suis deja en hors forfait QUE FAIRE ? cdt cedric - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Communication wap/web hors forfait Bonjour Cedchef, Afin de consulter votre dossier et vous apporter des éléments de réponse, merci de me communiquer en message privé vos coordonnées : Nom, prénom, numéro client et mobile. Bonne après midi, MouradS - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re: Communication wap/web hors forfait Bonjour, J'ai payé un forfait de 12 euros pour pouvoir avoir une heure de communication sms illimité depuis le Canada. A peine arrivé j'ai déja un dépassement de forfait effectué durant le vol sans mon intervention... Le détail indique des consommations wapweb facturés trés cher (environ 1 voire 2 méga pour 50 euros. J'attends d'être contacté dans les meilleurs délais pour régler cette histoire. Merci - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re: Communication wap/web hors forfait Bonjour @james9 Tu es ici dans un forum d'entraide entre clients comme toi, même s'il arrive qu'un webconseiller passe par là. Ton pass/forfait ne comprenait pas se datas semble-t-il. Donc si tu n'as pas désactivé tes datas dans ton smartphone avant ton départ, à 19 euros le Mo, ça peut aller vite, surtout que le smartphone utilise des données tout seul: synchro Messagerie, agenda...etc Ceci explique peut-être cela.? Appelle le service client 3900 à tout hasard. Cordialement Daniel35 ."
}