{
  "url": "https://www.behindthename.com/name/brian",
  "title": "Meaning, origin and history of the name Brian - Behind the Name",
  "text": "Gender Masculine Meaning & History Meaning uncertain, possibly related to the old Celtic root *brixs \"hill, high\" (Old Irish brií) or the related *brigā \"might, power\" (Old Irish briíg). It was borne by the Irish king Brian Boru, who thwarted Viking attempts to conquer Ireland in the 11th century. He was slain in the Battle of Clontarf, though his forces were decisively victorious. This name was common in Ireland after his time, and it was introduced to northern England by Norse-Gael settlers. It was also used in Brittany, and was brought to England by Bretons in the wake of the Norman Conquest. Though it eventually became rare in the English-speaking world, it was strongly revived in the 20th century, becoming a top-ten name for boys in most regions. Related Names Popularity People think this name is Name Days Norway: September 5 Images Depiction of Brian Boru Categories 1970s, 27 Club members, American Horror Story characters, Amphibia characters, Armistead Maupin characters, bass guitarists, bassoonists, Bubblegum Crisis characters, Canadian prime ministers, child actors, country music singers, David Mitchell characters, Deadly Premonition characters, Dharma and Greg characters, Disney characters, drummers, earth, Emergency characters, Family Guy characters, figure skaters, Final Destination characters, Fire Emblem characters, Formula One drivers, Frasier characters, Friends characters, Fringe characters, Gilmore Girls characters, GOSICK characters, Grease, guitarists, Harry Potter characters, Horrid Henry characters, House of Cards US characters, internet meme characters, Ireland in the Eurovision Song Contest, Ireland's taoisigh, isograms, kings, Korn members, landforms, legend, Mafia game characters, medieval, Nobel laureates, Nobel Prize in Physics recipients, OMORI characters, Overwatch characters, Phineas and Ferb characters, power, Precure characters, producers, Pump Up the Volume characters, Queen members, Queer as Folk US characters, rappers, Resident Evil 2 characters, Resident Evil characters, Robert A. Heinlein characters, Six Feet Under characters, skiffle, smooth jazz, song titles, Songwriters Hall of Famers, Squishmallows, Stephen King characters, strength, Tales of the City characters, teen idols, television, The Midnight Club characters, The Nanny characters, The Sopranos characters, The Walten Files characters, The West Wing characters, The White Lotus characters, top 10 in Ireland, top 10 in the US, TV show titles, Two and a Half Men characters, uncertain etymology, United Kingdom in the Eurovision Song Contest, Virtua Tennis opponent characters, Welsh Nobel laureates, Will and Grace characters, world leaders, YouTubers Sources & References - O'Brien, Kathleen M. Index of Names in Irish Annals, available from https://medievalscotland.org/kmo/AnnalsIndex/Masculine/Brian.shtml."
}