{
  "url": "https://www.mmamania.com/2024/1/5/24023071/watch-out-lfa-fury-fc-is-coming-for-top-spot-as-best-u-s-regional-mma-promotion",
  "title": "Watch Out LFA, Fury FC Is Coming For The Top Regional Promotion | MMA Mania",
  "text": "Regional mixed martial arts (MMA) promotions are incredibly vital for the growth of the sport and is where young fighters cut their teeth before making it to Ultimate Fighting Championship (UFC). Watch out LFA! Fury FC is coming for top spot as best U.S. regional MMA promotion For years now, Legacy Fighting Alliance (LFA) has been the top dog, sending over 100 fighters to the UFC, including Sean O’Malley, Kamaru Usman, Valentina Shevchenko, Alex Pereira, and Brandon Moreno. It’s also the premiere organization to watch on Friday before UFC cards on Saturday. However, another regional promotion in the Texas shadows has been doing its thing since Feb 2013: Fury Fighting Championships (Fury FC). Starting a fight promotion is daunting because it is expensive, time-consuming, and tricky overall. So many have come and gone, but when the promotor has a solid starting goal, it’s hard to deny them. “So I started with amateur cards back in 2010, and really, the main reason I did it was because I was training with a team that had issues getting matchups on the one and only local promotion at the time, which was Lone Star Beatdown that belonged to [current UFC matchmaker] Mick Maynard,” Fury FC promoter Eric Garcia said. “I had got a fight on one of his first cards and then his second card. My guys that were helping me get ready wanted to try and jump on these amateur cards, but the demand to get on the card was so high that there wasn’t really any space for the rest of my team. So I decided to start my own promotion with the idea that I would give my team first dibs on fights, and it kind of just took off from there.” For eight years, Fury FC did their thing on FITE.TV, putting on solid events, sending a handful of fighters to the UFC, but it was on Mar. 6, 2021, that everything changed forever. Fury FC had their first event on UFC Fight Pass: Fury FC 44. “The whole idea to try and get on UFC Fight Pass came from Mick Maynard,” Garcia said. “He was asking me, ‘You haven’t tried to get on UFC Fight Pass, you know, Fury is here in Houston, it’s growing fast and it’d be a great platform.’ So he kind of made the connection and opened that door for us, and we flew to Las Vegas to try and get a meeting with the UFC Fight Pass VP.” Fury FC matchmaker and overall MMA Swiss army knife Rich Burmaster added, “One thing to remember, too, is that we didn’t have any promises of a meeting or anything. We went out to Vegas and were like, ‘Hey, man, we’re in town. Can you take 10 minutes to have a drink and talk with us?’ And to his credit, he did. It turned into an hour-long conversation, sitting at a local bar, and it was kind of us saying things he had heard before, like ‘We can do this, we can do this.’ And him challenging us, saying, ‘Well, you know, I’ve heard this before, and people don’t really come through.’ It ended with us locking in six fight cards, but we ended up doing 12, so we doubled what they said we could do.” Fury FC’s first event of UFC Fight Pass was memorable because the last three fights ended in violent finishes. But it was the main event, CJ Vergara vs. Jacob Silva, that left fans with their jaws on the floor as it was a Fight of the Year contender, not just in Fury FC but in all of MMA. Since Fury FC 44, the promotion has put on 40 numbered events, not including their new challenger series, amateur events, and submission grappling events. While Fury FC puts on quality events throughout the year, the Texas-based promotion has one goal: get fighters to the UFC. And they know what it takes: getting finishes. While yes, a short notice call is one way to get to the world’s largest fight promotion; Fury FC tries to tee up their fighters for Dana White’s Contender Series (DWCS). In 2023, Fury FC sent three of their champions to DWCS: Joshua Van, Cameron Smotherman, and Abdul-Kareem Selwady, plus Marquel Mederos, Rain Guerreronm, Reyes Cortez Jr. and Zach Reese. 22-year-old Joshua Van got a call to the UFC on short notice, skipping DWCS entirely and making a huge splash going 2-0 in 2023. Several other Fury FC fighters made their UFC debuts in 2023, including Bassil Hafez, Diego Lopes, Nazim Sadykhov, Edgar Chairez, and Jesse Butler. Oh, and 6’7” Cuban giant Robelis Despaigne got immediately signed to the UFC on the last Fury FC show of 2023. As I said, LFA has long been the gold standard of American regional MMA, but Fury FC is making its case to take that crown. “I don’t think we’ve surpassed them, if I’m being honest,” Garcia said. “I’ll still admit that I look at them as the top UFC Fight Pass promotion, but we’re not far behind, and having them up there and knowing that there’s a goal for us to be up there next to them or surpass them is what really gives me motivation to work hard. I will say that they did have a jumpstart on us, obviously. You know, there’s no denying that what Mick Maynard did with LFA set the foundation for them; he really gave them a huge boost. What he did was phenomenal, you know, and that’s what I look at and try to follow- how he ran LFA and some of his choices and decisions. I feel like we’re getting close and in the next year, we will be right there if we don’t surpass them all together.” Fury FC matchmaker Burmaster sees it differently. “For me, I see it as a passing of the torch because I do look at LFA as more than a regional promotion now. They’re in Brazil, meaning they’re worldwide,” Burmaster said. “But I think as you look at 2021, 2020, 2023, and heading into 2024, we’re putting close to 15 to 20 people a year on contender series or into the UFC. I think the bigger our stars grow, you’re going to see the bigger Fury grows. I’ll just say when you look at the quality of the fights, the consistency in the matchmaking and our cards, I feel like Fury is establishing ourselves nicely, and I think we are the number one brand on UFC Fight Pass.” Fury FC returns for their first card of 2024 on Jan. 21 from inside Imagen Venues in Houston, TX, exclusively on UFC Fight Pass."
}