{
  "url": "https://support.google.com/chrome/answer/95346?hl=pt-BR&co=GENIE.Platform=Desktop",
  "title": "Fazer o download e instalar o Google Chrome - Computador - Ajuda do Google Chrome",
  "text": "Você pode baixar e instalar o navegador da Web Chrome sem custos financeiros e usá-lo para navegar na Web. Como instalar o Chrome Importante: antes de baixar, confira se o Chrome é compatível com seu sistema operacional e se você atende todos os outros requisitos do sistema. Windows- No computador, baixe o arquivo de instalação. - Para instalar o arquivo, siga as instruções na tela. - Se a mensagem \"Deseja executar esse arquivo?\" aparecer, selecione Executar. - Se a mensagem \"Deseja permitir que este aplicativo faça alterações no seu dispositivo?\" aparecer, selecione Sim. - Abra o Chrome. - No Windows 10 e versões mais recentes, uma janela do Chrome será aberta quando a instalação for concluída. Depois, é possível tornar o Chrome seu navegador padrão. Dica: se você usava um navegador diferente, como o Firefox, é possível importar suas configurações para o Chrome. Instalar o Chrome off-line Se você tiver problemas para baixar o Chrome no seu computador Windows, use o link alternativo para baixar em um computador diferente. - No seu computador, baixe um instalador do Chrome para outro computador. - Na parte de baixo da página, em \"Família Chrome\", selecione Outras plataformas. - Selecione o SO do dispositivo em que você quer instalar o Chrome. - Baixe o arquivo. - Mova o arquivo para o computador em que você quer instalar o Chrome. - Para instalar, siga as instruções na tela. - No computador, baixe o arquivo de instalação. - Abra o arquivo chamado \"googlechrome.dmg\". - O Chrome vai aparecer em uma janela. - Arraste o Chrome até a pasta \"Aplicativos\". - Talvez seja necessário digitar a senha de administrador. - Se você não conseguir inserir a senha de admin, arraste o Chrome para um local em que você tenha permissão total, como a área de trabalho. Dica: para liberar espaço após a instalação, na barra lateral do Finder, ao lado de \"Chrome\", selecione Ejetar . Para instalar o Chrome, use o mesmo software que instala programas no computador. É necessário digitar a senha da conta de admin. - No computador, baixe o arquivo de instalação. - Para abrir o pacote, selecione OK Instalar Pacote. Para garantir que o Chrome fique sempre atualizado, ele é adicionado ao gerenciador de softwares. Conferir os requisitos do sistema para usar o Chrome WindowsPara usar o Chrome no Windows com um processador Intel ou ARM, você precisa do seguinte: - Processador Intel: - Windows 10 e versões posteriores. - Processador Intel Pentium 4 ou mais recente compatível com SSE3. - Processador ARM: Windows 11 e versões mais recentes. Para usar o Chrome no Mac, você precisa ter o macOS 12 Monterey ou uma versão mais recente. Para usar o Chrome no Linux, você precisa do seguinte: - Debian 10, openSUSE 15.5, Fedora Linux 39 ou Ubuntu 18.04 de 64 bits e versões mais recentes - Processador Intel Pentium 4 ou mais recente compatível com SSE3"
}