{
  "url": "https://www.city-data.com/forum/health-insurance/3490248-why-not-medicare-advantage-9.html",
  "title": "Why not Medicare Advantage? (MRI, Kaiser, South Carolina, CT) - Health Insurance -Private Insurance, Medicare, Medicaid, Military, COBRA - Page 9 - City-Data Forum",
  "text": "07-18-2025, 10:49 PM Location: Wisconsin 26,345 posts, read 59,289,238 times Reputation: 24923 Quote: Originally Posted by Submariner When we looked close at Medicare, and its 'plans' my Dw added up the extra fees. The fees seem to be somewhat hidden because they get automatically subtracted from your SS payments, but they are still charging you. Those extra fees were a big factor in us deciding to revoke our Medicare coverage. Are you talking about the $185 Part B premium? Those who have no other alternative, either enroll in Part B or have no coverage for anything other than hospital. You, as I understand it, have some form of government insurance, Tri-care, irrc. 07-19-2025, 10:34 AM Location: Puget Sound area since 1992, 120’ elevation, originally from SF Bay Area 47,105 posts, read 89,701,617 times Reputation: 62903 We have found that our advantage plan has far better coverage than my previous employer provided plan. Yesterday, for example, I had an MRI. The cost was over $1,100, plan covered it at 100%. I take several medications and have not paid more than $5/month.between the part B and advantage I’m paying about $350/month, but with the amount they pay I’m coming out way ahead of when I was working. 07-19-2025, 11:29 AM Location: 89052 & 75206 8,551 posts, read 9,621,370 times Reputation: 21646 I stopped my Medicare supplement and enrolled in Advantage PPO during Covid because I couldn’t find a single doctor who accepted Medicare who would take me as a new patient. Then I became a patient of a concierge doc who accepted my Advantage PPO plan and I liked her alot but she kept referring me to other docs for colonoscopy, bone scans, breast xrays, etc.(always outside the Advantage roster, and I’d have to keep reminding her to use their list) and, other than a very thorough annual checkup, I never saw her. So I was paying $140/month for a great doc and a wonderful annual visit. So, this year I disenrolled from my concierge doc….well I do miss being able to phone her and get to her directly. She was always terrific about sending me any prescriptions w/o having to make a visit and I will miss that. But, I have found the teledoc feature of my Advantage plan very effective as far as getting a quick prescription and there’s no copay on teledoc visits. My Advantage plan still pays a good portion if I go out of network. So, I have calculated that I will have $20K annually out of pocket if I have a serious medical issue and choose to go out of network. I am prepared for that. 07-19-2025, 12:00 PM Location: Forests of Maine 39,428 posts, read 66,152,848 times Reputation: 32940 Quote: Originally Posted by Ariadne22 Are you talking about the $185 Part B premium? Those who have no other alternative, either enroll in Part B or have no coverage for anything other than hospital. You, as I understand it, have some form of government insurance, Tri-care, irrc. Yes, the extra premium that gets deducted from your SS payments. As a US servicemember I am covered by the DOD. I had the option of allowing Medicare to take over and Tricare would take a backseat, and allowing the extra premiums to be deducted from our SS payments. Or our other option was to revoke Medicare and to stick with my employer-provided healthcare plan. 07-19-2025, 01:48 PM Location: Wellsburg, WV 5,514 posts, read 10,529,347 times Reputation: 7305 Quote: Originally Posted by Hemlock140 We have found that our advantage plan has far better coverage than my previous employer provided plan. Yesterday, for example, I had an MRI. The cost was over $1,100, plan covered it at 100%. I take several medications and have not paid more than $5/month.between the part B and advantage I’m paying about $350/month, but with the amount they pay I’m coming out way ahead of when I was working. Quote: Originally Posted by WorldKlas I stopped my Medicare supplement and enrolled in Advantage PPO during Covid because I couldn’t find a single doctor who accepted Medicare who would take me as a new patient. Then I became a patient of a concierge doc who accepted my Advantage PPO plan and I liked her alot but she kept referring me to other docs for colonoscopy, bone scans, breast xrays, etc.(always outside the Advantage roster, and I’d have to keep reminding her to use their list) and, other than a very thorough annual checkup, I never saw her. So I was paying $140/month for a great doc and a wonderful annual visit. So, this year I disenrolled from my concierge doc….well I do miss being able to phone her and get to her directly. She was always terrific about sending me any prescriptions w/o having to make a visit and I will miss that. But, I have found the teledoc feature of my Advantage plan very effective as far as getting a quick prescription and there’s no copay on teledoc visits. My Advantage plan still pays a good portion if I go out of network. So, I have calculated that I will have $20K annually out of pocket if I have a serious medical issue and choose to go out of network. I am prepared for that. Obviously neither of you have run into needing a test that was denied. Medicare Advantage plans are notorious for denying tests needed. 07-19-2025, 01:54 PM Location: 89052 & 75206 8,551 posts, read 9,621,370 times Reputation: 21646 Quote: Originally Posted by southernlady5464 Obviously neither of you have run into needing a test that was denied. Medicare Advantage plans are notorious for denying tests needed. I thinks that’s only for the HMO side 07-19-2025, 02:18 PM Location: NC/SC Border Patrol 22,582 posts, read 27,370,712 times Reputation: 25683 I was told by someone I don't know the name that the advantage plan is just fine if you don't need a specialist that is not in that plans group?? It did not apply to me because my insurance is part of my retirement package and it is rare for me to ever have to pay for anything except $9 for three months worth of medicine. It is a little hard to beat having the supplement and medicine plan being paid for after the initial medicare payment so I am good. I think the person was just telling me how lucky I am to have most everything paid for which saves me lots of money. 07-19-2025, 03:10 PM Location: Forests of Maine 39,428 posts, read 66,152,848 times Reputation: 32940 Quote: Originally Posted by WorldKlas I thinks that’s only for the HMO side The big city hospital near us has had a long saga of practitioners that will only stay on contract for one year, then they leave. Since living here, there has been multiple nurse strikes. A common experience I have had is when I call to verify an upcoming appointment I am told the practitioner is no longer working there. My appointment will need to wait until after they have hired a new practitioner. So I call around to other independent medical offices in the area to ask if they are accepting new patients. A common question they use to screen new patients is to ask what insurance coverage I have. If you say Medicare it is 50/50 whether they are willing to take you as a patient. Then a year later, that medical office is bought up by the big corp, and the practitioners leave. Individual offices are glad to have me [I have been told that my healthcare plan pays 'better' than what Medicare pays. Once I was told that they do not deny claims as frequently as Medicare does, another time I was told they are not limited to the same price scale as Medicare holds itself to]. I think that denying payment is one factor in this equation. A big factor we see in this area is we have one corp trying to be a monopoly [buying up any independent medical offices] while inhouse they are also running a sweat shop environment. 07-19-2025, 04:02 PM Location: Puget Sound area since 1992, 120’ elevation, originally from SF Bay Area 47,105 posts, read 89,701,617 times Reputation: 62903 Quote: Originally Posted by southernlady5464 Obviously neither of you have run into needing a test that was denied. Medicare Advantage plans are notorious for denying tests needed. True, no denials, and so far it looks like mine is not one of those. There are differences even for the same company. Mine has a contract with the state through a former employer and it’s far better than one gets just signing up for a private plan with them. Since starting on this plan 18 months ago I have had 2 different MRIs, 3 X-Rays, 1 CT, have seen my GP twice, my Oncologist with full blood work twice, Nephrologist, Vascular Surgeon, Ophthalmologist, two visits to urgent care, one Teledoc, and an Orthopedist 3 times. None has been denied, none has had any copay. Please register to post and access all features of our very popular forum. It is free and quick. Over $68,000 in prizes has already been given out to active posters on our forum. Additional giveaways are planned. Detailed information about all U.S. cities, counties, and zip codes on our site: City-data.com ."
}