{
  "url": "https://www.perrla.com/",
  "title": "PERRLA",
  "text": "PERRLA creates, formats, & keeps your references up to date as you write. Our human-built reference engine supports every source type in the APA, MLA, and Turabian styles. Perfectly formatted citations and references are just a click away! We're more than just references: PERRLA builds a fully styled paper for you – just create it & start writing. Use PERRLA in Microsoft Word (desktop & web), in PERRLA Online, Google Docs, and with our Google Chrome extension – take PERRLA wherever you write. Wherever you write, PERRLA generates a perfectly formatted Word document that’s ready to turn in. Create Research Papers, Discussion Posts, Reference Lists, and Annotated Bibliographies with confidence. Elizabeth L., student & author Shayna, student James W. Nikita, student Yolanda, student & instructor Nursing Instructor Andrew, student Trenay B., Ph.D. student Kevin, Masters student Kristin, BSN student Emma, nursing student Patrick, student Kathleen, Nursing faculty Sara, student Our Google Chrome Extension makes it easy to create References while doing your research. You can access your entire library anywhere, anytime – even while working on that discussion post! Save notes, quotes, & text from your references in your PERRLA Library. You can build a knowledge base of your work & research. The Outline Editor in PERRLA Online lets you build an organized outline for your paper before you start writing – making it easy to draft your paper. PERRLA's tools are human-built & human-tested – with zero AI content. We ensure student's content is formatted correctly without generating content for them. All PERRLA papers pass AI detectors with flying colors! Our Support Team is available every day until 10 pm (Central) to answer all of your PERRLA, writing, & formatting questions. They're experts that can help you dig through the thorniest problem. Reach out anytime! ✔️ Great for testing how PERRLA works for you ✔️ Access to all PERRLA features & software ✔️ No credit card requried! ✔️ Access to all PERRLA features & software ✔️ Great for exploring PERRLA's functionality ✔️ Our most affordable option"
}