{
  "url": "https://support.microsoft.com/pt-br/windows/restauração-do-sistema-a5ae3ed9-07c4-fd56-45ee-096777ecd14e",
  "title": "Restauração do Sistema - Suporte da Microsoft",
  "text": "Restauração do Sistema Aplica-se a Com a Restauração do Sistema, você pode reverter o estado do computador para um ponto anterior no tempo. Isso pode ser particularmente útil ao solucionar problemas causados por alterações recentes, como instalações de software, atualizações de driver ou modificações de configurações do sistema. Usando a Restauração do Sistema, você pode desfazer essas alterações sem afetar seus arquivos pessoais, fornecendo uma maneira segura de resolve problemas sem perder dados importantes. A Restauração do Sistema funciona utilizando pontos de restauração, que são instantâneos da configuração e das configurações do sistema em um momento específico. Esses pontos de restauração podem ser criados automaticamente pelo sistema durante eventos significativos, como instalações de software ou atualizações, ou manualmente antes de fazer grandes alterações. Para saber mais, confira Proteção do Sistema. Quando um ponto de restauração é selecionado, a Restauração do Sistema reverte os arquivos do sistema, as configurações do registro e os programas instalados no estado em que estavam no momento em que o ponto de restauração foi criado. Isso ajuda a manter a estabilidade do sistema e pode ser uma ferramenta valiosa para se recuperar de problemas inesperados. Recuperar seu computador de um ponto de restauração do sistema Você pode aplicar um ponto de restauração ao entrar no Windows ou no Ambiente de Recuperação do Windows (Windows RE). Selecione a opção que melhor atende às suas necessidades: - Para abrir a Restauração do Sistema, você pode usar um dos seguintes métodos: - No Painel de Controle, selecione Recuperação e escolha Abrir Restauração do Sistema. - Use o atalho de teclado +R, digite rstrui.exe e pressione Enter. - - Na caixa Restaurar arquivos e configurações do sistema, selecione Próximo. - Selecione o ponto de restauração que você deseja usar na lista de resultados. Se não vir o ponto de restauração que você deseja usar, marque a caixa de seleção Mostrar mais pontos de restauração para ver mais pontos de restauração. - Opcionalmente, selecione Verificar programas afetados. - Depois de encontrar o ponto de restauração adequado, selecione Avançar e escolha Concluir. - Depois que o ponto de restauração é aplicado, o Windows é reiniciado automaticamente. Observação: Se você tiver criptografado seu dispositivo, precisará da chave do BitLocker para concluir essa tarefa. Se você não conhece a chave do BitLocker, confira Localizar a chave de recuperação do BitLocker. - Uma vez em Windows RE, selecione Solucionar problemas, escolha Opções avançadas e, em seguida, Restauração do Sistema. - Selecione o ponto de restauração que você deseja usar na lista de resultados. Se não vir o ponto de restauração que você deseja usar, marque a caixa de seleção Mostrar mais pontos de restauração para ver mais pontos de restauração. - Opcionalmente, selecione Verificar programas afetados. - Depois de encontrar o ponto de restauração adequado, selecione Avançar e escolha Concluir. - Depois que o ponto de restauração for aplicado, selecione Reiniciar."
}