{
  "url": "https://www.newworldencyclopedia.org/entry/Anatolia",
  "title": "Anatolia - New World Encyclopedia",
  "text": "Anatolia Anatolia (Turkish: Anadolu, Greek: Ανατολία, Anatolía), or Asia Minor, is a peninsular landmass comprising the Asian portion of the modern Republic of Turkey. Geographically, the region is bounded by the Black Sea to the north, the Caucasus to the northeast, the Aegean Sea to the west, the Mediterranean Sea to the south, Greater Syria (Upper Mesopotamia) to the southeast and Transcaucasia and the Iranian plateau to the east. The Sea of Marmara is at its northwest. Culturally, the islands of the eastern Aegean Sea are often included in the definition. Anatolia lies at the meeting point of the continents of Asia and Europe, extending from the Bosporus and Aegean coast eastward to the borders of the Armenia, Georgia, Iran, and Iraq. Western Anatolia was called \"Asia\" by the Greeks and Ancient RomeRomans. Later the name \"Asia Minor,\" or \"Little Asia,\" was used to distinguish the peninsula from the land mass of the greater Asian continent. Anatolia has historically served as a crossroads of both migration and invading armies. It has seen the birth of civilizations including the Byzantine and Ottoman Empires. Because of its strategic location at the meeting point of two continents, the region has played a major role in world history as a bridge connecting East and West. Its culture has a unique blend of Eastern and Western tradition, and is often described as a bridge between the two civilizations. Anatolia constitutes the Asian portion of the Republic of Turkey which was founded on October 29, 1923, as the successor of the Ottoman Empire. Name Before the peninsula on which most of the modern Turkish Republic is located became associated with the Turkish people, it was known by many names. These names reflect the history of the land being occupied by the Hattians, the Hittites (and other \"indigenous\" Anatolian peoples), Armenians, Caucasian peoples, pre-Hellenic Aegean peoples, Greek communities from the Homeric period till the Byzantine Era, several Persian empires and of course, different phases of the Roman Empire which ended with the fall of Byzantine Constantinople (1453). The name Anatolia comes from the Greek Aνατολή (Αnatolí), and means \"the place of the rising sun.\" The name likely dates back at least 3,000 years, from the Ionian settlement period in the 1st millennium B.C.E. The Byzantine Greek term Anatolicon (\"Eastern\") signified the lands to the east of Europe and of the Roman Empire's late-era capital city of Constantinople, also New Rome (now Istanbul). It is thus of the same meaning as the Latin names \"Levant,\" \"Orient\" and the Arabic name \"Mashraq.\" Anatolia, Orient, Levant and Mashraq today designate different areas in the world. \"Anatolia\" can thus be understood to be \"east to Classical Greek states\" or \"the Byzantine East.\" The Turkish form Anadolu derives from the Greek version—both which predated the growth of Constantinople across the Bosporus strait to both continental shores. Turkish folk etymology further breaks down the geographical term into two words: Ana (\"mother\") and Dolu (\"full\"). The term is sometimes interpreted as Mother of Cities, referring to Constantinople, perhaps dating to the pre-Islamic era when the Byzantine Empire was the largest international power known in that part of Asia, and occupied the entire region. Physical geography The Anatolian peninsula is bounded by the Black Sea to the north, the Mediterranean Sea to the south, the Aegean Sea -itself an arm of the Mediterranean - to the west, and the bulk of the Asian mainland to the east. Anatolia's terrain is structurally complex. A central massif composed of uplifted blocks and downfolded troughs, covered by recent deposits and giving the appearance of a plateau with rough terrain, is wedged between two folded mountain ranges that converge in the east. True lowland is confined to a few narrow coastal strips along the Black Sea and Mediterranean Sea coasts. Flat or gently sloping land is rare and largely confined to the deltas of the Kızıl River, the coastal plains of Çukurova, and the valley floors of the Gediz and the Büyük Menderes Rivers, and some interior high plains in Anatolia, mainly around Tuz Gölü (Salt Lake) and Konya Ovası (Konya Basin). Black Sea region The Black Sea region has a steep, rocky coast with rivers that cascade through the gorges of the coastal ranges. The North Anatolian mountains are an interrupted chain of folded highlands that generally parallel the Black Sea coast. A few larger rivers, those cutting back through the Pontic Mountains, have tributaries that flow in broad, elevated basins. Rivers flow from the mountains toward the Black Sea trough in lengthy valleys. Access inland from the coast is limited to a few narrow valleys because mountain ridges, with elevations of 1,525 to 1,800 meters (5,000 to 5,900 ft) in the west and 3,000 to 4,000 meters (10,000 to 13,000 ft) in the east in Kaçkar Mountains, form an almost unbroken wall separating the coast from the interior. The higher slopes facing southwest tend to be densely wet. Because of these natural conditions, the Black Sea coast historically has been isolated from Anatolia. The southern slopes—facing the Anatolian Plateau—are mostly unwooded, but the northern slopes contain dense growths of both deciduous and evergreen trees. Mediterranean region The narrow coastal plains of the Mediterranean region, separated from the Anatolian plateau by the Taurus Mountains, which reach elevations of 2,000 to 2,750 meters (6,600 to 9,000 ft), are cultivated intensively. Fertile soils and a warm climate make the Mediterranean coast ideal for growing citrus fruits, grapes, figs, bananas, various vegetables, barley, wheat, and, in irrigated areas, rice and cotton. The Çukurova in the east is a plain that is the most developed agricultural area of the Mediterranean region. Anatolian plateau Stretching inland from the Aegean coastal plain, Central Anatolia occupies the area between the two zones of the folded mountains, extending east to the point where the two ranges converge. The plateau-like, semiarid highlands of Anatolia are considered the heartland of the country. The region varies in elevation from 600 to 1,200 meters (2,000 to 4,000 ft) from west to east. The two largest basins on the plateau are the Konya Ovası and the basin occupied by the large salt lake, Tuz Gölü. Both basins are characterized by inland drainage. Wooded areas are confined to the northwest and northeast of the plateau. Mountains near the coast prevent Mediterranean influences from extending inland, giving the interior of Turkey a continental climate with distinct seasons. The Anatolian Plateau is much more subject to extremes than are the coastal areas. Winters on the plateau are especially severe. Temperatures of -30 °C to -40 °C (-22 °F to -40 °F) can occur in the mountainous areas in the east, and snow may lie on the ground 120 days of the year. In the west, winter temperatures average below 1 °C (34 °F). Summers are hot and dry, with temperatures above 30 °C (86 °F). Annual precipitation averages about 400 mm (15.7 inches), with actual amounts determined by elevation. The driest regions are the Konya Ovası and the Malatya Ovası, where annual rainfall frequently is less than 300 mm (11.8 inches). May is generally the driest month and July and August are the wettest. Eastern Anatolia Eastern Anatolia where the Pontus and Taurus Mountain ranges converge, is rugged country with higher elevations, a more severe climate, and greater precipitation than are found on the Anatolian Plateau. The region is known as the Anti-Taurus, and the average elevation of its peaks exceeds 3,000 m. Mount Ararat, at 5,137 meters (16,854 ft) the highest point in Turkey, is located in the Anti-Taurus. Lake Van is situated in the mountains at an elevation of 1,546 meters (5,072 ft). The headwaters of three major rivers arise in the Anti-Taurus: the east-flowing Aras River, which empties into the Caspian Sea; the south-flowing Euphrates and Tigris join in Iraq before emptying into the Persian Gulf. Several small streams that empty into the Black Sea or landlocked Lake Van also originate in these mountains. Southeast Anatolia lies south of the Anti-Taurus Mountains. It is a region of rolling hills and a broad plateau surface that extends into Syria. Elevations decrease gradually, from about 800 meters (2,600 ft) in the north to about 500 meters (1,600 ft) in the south. Traditionally, wheat and barley were the main crops of the region, but the inauguration of major new irrigation projects in the 1980s has led to greater agricultural diversity and development. Ecoregions Anatolia's diverse topography and climate has fostered a similar diversity of plant and animal communities. The mountains and coastal plain of northern Anatolia, with its humid and mild climate, is home to temperate broadleaf, mixed, and coniferous forests. The central and eastern plateau, with its drier continental climate, is home to deciduous forests and forest steppes. Western and southern Anatolia, which have a Mediterranean climate, are home to Mediterranean forests, woodlands, and shrub ecoregions. - Euxine-Colchic deciduous forests: These temperate broadleaf and mixed forests extend across northern Anatolia, lying between the mountains of northern Anatolia and the Black Sea. They include the enclaves of temperate rainforest lying along the southeastern coast of the Black Sea in eastern Turkey and Georgia.[1] - Northern Anatolian conifer and deciduous forests: These forests occupy the mountains of northern Anatolia, running east and west between the coastal Euxine-Colchic forests and the drier, continental climate forests of central and eastern Anatolia.[2] - Central Anatolian deciduous forests: These forests of deciduous oaks and evergreen pines cover the plateau of central Anatolia.[3] - Central Anatolian steppe: These dry grasslands cover the drier valleys and surround the saline lakes of central Anatolia, and include halophytic (salt tolerant) plant communities.[4] - Eastern Anatolian deciduous forests: This ecoregion occupies the plateau of eastern Anatolia. The drier and more continental climate is home to steppe-forests dominated by deciduous oaks, with areas of shrubland, montane forest, and valley forest.[5] - Anatolian conifer and deciduous mixed forests: These forests occupy the western, Mediterranean-climate portion of the Anatolian plateau. Pine forests and mixed pine and oak woodlands and shrublands are predominant.[6] - Aegean and Western Turkey sclerophyllous and mixed forests: These Mediterranean-climate forests occupy the coastal lowlands and valleys of western Anatolia bordering the Aegean Sea. The ecoregion is home to forests of Turkish Pine (Pinus brutia), oak forests and woodlands, and maquis shrubland of Turkish Pine and evergreen sclerophyllous trees and shrubs, including Olive (Olea europaea), Strawberry Tree (Arbutus unedo), Arbutus andrachne, Kermes Oak (Quercus coccifera), and Bay Laurel (Laurus nobilis).[7] - Southern Anatolian montane conifer and deciduous forests: These mountain forests occupy the Mediterranean-climate Taurus Mountains of southern Anatolia. Conifer forests are predominant, chiefly Anatolian black pine (Pinus nigra), Cedar of Lebanon (Cedrus libani), Taurus fir (Abies cilicica), and juniper (Juniperus foetidissima and J. excelsa). Broadleaf trees include oaks, hornbeam, and maples.[8] - Eastern Mediterranean conifer-sclerophyllous-broadleaf forests: This ecoregion occupies the coastal strip of southern Anatolia, between the Taurus Mountains and the Mediterranean Sea. Plant communities include broadleaf sclerophyllous maquis shrublands, forests of Aleppo Pine (Pinus halepensis) and Turkish Pine (Pinus brutia), and dry oak (Quercus spp.) woodlands and steppes.[9] History The History of Anatolia encompasses the region known as Anatolia (Turkish: Anadolu), known by the Latin name of Asia Minor, considered to be the westernmost extent of Western Asia. Geographically it encompasses what is most of modern Turkey, from the Aegean Sea to the mountains on the Armenian border to east and by the Black Sea and the Taurus mountains from north to south. The earliest representations of culture in Anatolia can be found in several archaeological sites located in the central and eastern part of the region. Although the origins of some of the earliest peoples are shrouded in mystery, the remnants of Hattian, Akkadian, Assyrian, and Hittite culture provides us with many examples of the daily lives of its citizens and their trade. After the fall of the Hittites, the new states of Phrygia and Lydia stood strong on the western coast as Greek civilization began to flourish. Only the threat from a distant Persian kingdom prevented them from advancing past their peak of success. As Persia grew, their system of local control in Anatolia allowed many port cities to grow and to become very wealthy. Their governors did revolt from time to time, but it did not really pose a serious threat. Alexander the Great (356 - 323 B.C.E.) finally wrested control of the whole region from Persia in successive battles and achieved marked victories over his Persian foe Darius III (c. 380–330 B.C.E.) After his death, his conquests were split amongst several of his trusted generals and survived under constant threat of invasion from both the Gauls and other powerful rulers in Pergamon, Pontus, and Egypt. The Seleucid Empire, largest of the divided territories of Alexander, eventually was bled off by Roman interest in Anatolia and conquered or given away piecemeal. Roman control of Anatolia was strengthened by a 'hands off' approach by Rome, allowing local control to govern effectively and providing military protection. During the reign of Constantine the Great (272 – 337 C.E.), a new eastern empire was established at Constantinople, known as the Byzantine Empire. It succeeded initially due to its vast wealth and judicious rulers, but soon suffered from widespread neglect and a new empire borne from the earlier Mongol advance, the Turks. Seljuk and Ilkhanate armies soon whittled down the wide scope of Byzantine influence and trade by the gradual overrun of vital trading centers. The most powerful Turkish empire, that of the Ottomans, finally dealt the Byzantine Empire its death blow when Sultan Mehmet II conquered Constantinople in 1453. The Ottoman Empire in Anatolia allowed other religions to maintain themselves long after 1453, and built upon their success by enlarging their territories, from North Africa to Europe beyond Thrace. Wars with Russia and other peoples in revolt prevented the Ottomans from taking advantage of their powerful position, and declined under ineffective leadership. Even their highly skilled army, the janissaries, were eventually disbanded after an attempted revolt. Reforms designed to improve the economy backfired as burdensome taxes and levies turned away profitable trade, and desperation allowed the Empire to be sucked into World War I on the side of Germany and Austria. Following their defeat in the war, the Ottoman Empire was carved up and was now limited to Anatolia. Anatolia remained multi-ethnic until the early twentieth century. During World War I, the Armenian Genocide, the Greek genocide (especially in Pontus), and the Assyrian Genocide almost entirely removed the ancient communities of Armenian and Assyrian populations in Anatolia, as well as a large part of its ethnic Greek population. Following the Greco-Turkish War of 1919-1922, all remaining ethnic Anatolian Greeks were forced out during the 1923 population exchange between Greece and Turkey. It was this war that allowed Mustafa Kemal Atatürk to make Anatolia into the new Republic of Turkey by defeating the Greeks and abolishing the Ottoman government for good in 1922. The official starting point for the Republic of Turkey was on October 29, 1923, founded and first led by Mustafa Kemal Atatürk. Westernization was a primary goal of Atatürk, as the government was completely reformed under a secular structure, the Ottoman fez was abolished, full rights for women politically were established, and importantly the creation of a new language based upon the Latin alphabet.[10] Since that time, Turkey has grown into a modern state that has enjoyed relative peace in Anatolia. Notes - ↑ World Wildlife Fund. Euxine-Colchic broadleaf forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Northern Anatolian conifer and deciduous forests Retrieved January 12, 2009. - ↑ National Geographic Society. Central Anatolian deciduous forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Central Anatolian steppe Retrieved January 12, 2009. - ↑ World Wildlife Fund. Eastern Anatolian deciduous forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Anatolian conifer and deciduous mixed forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Aegean and Western Turkey sclerophyllous and mixed forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Southern Anatolian montane conifer and deciduous forests Retrieved January 12, 2009. - ↑ World Wildlife Fund. Eastern Mediterranean conifer-sclerophyllous-broadleaf forests Retrieved January 12, 2009. - ↑ Patrick Kinross. 2001. Ataturk: The Rebirth of a Nation. (London: Phoenix Press. ISBN 1842125990) ReferencesISBN links support NWE through referral fees - Appian (c.95-c.165). History of Rome: The Syrian Wars. Loeb Classical Library, 1912. ISBN 978-0674990043. - Herodotus. The Works of Herodotus. - Bevan, Edwyn Robert. The House of Seleucus. London: A. Arnold, 1902. online.books.google. ASIN B0014BDAWE - Botsford, George Willis, and Charles Alexander Robinson. Hellenic History. Kessinger Publishing, 2007. ISBN 978-1430492009. - Bury, John Bugnell, and Russell Meiggs. A History of Greece to the Death of Alexander the Great, 4th ed. Palgrave MacMillan, 2000. ISBN 0333154932. - Duncker, Max, and Evelyn Abbott. The History of Antiquity. London: R. Bentley & son. Nabu Press, 2010. ISBN 978-1145823402. - Freeman, Charles. Egypt, Greece and Rome: Civilizations of the Ancient Mediterranean. Oxford: Oxford University Press, 1999. ISBN 0198721943. - Gibbon, Edward, and D. M. Low. The Decline and Fall of the Roman Empire. New York: Harcourt, Brace. abridged edition edited by David P. Womersley. Penguin Classics, 2001. ISBN 0140437649. - Hawkins, John David, and Halet Çambel. Corpus of hieroglyphic Luwian inscriptions. Berlin: W. de Gruyter, 2000. ISBN 3110148706. - Kinross, Patrick. Ataturk: The Rebirth of a Nation. London: Phoenix Press, 2001. ISBN 1842125990 - Mommsen, Theodor. The Provinces of the Roman Empire, from Caesar to Diocletian. University of Toronto Libraries, 2011. ASIN B004SI9NC6 - Ramsay, William Mitchell. The letters to the seven churches of Asia and their place in the plan of the Apocalypse. Nabu Press, 2010. ISBN 978-1178183672. - Rawlinson, George. Ancient history from the earliest times to the fall of the Western empire, comprising the history of Chaldaea, Assyria, Media, Babylonia, Lydia, Phoenicia, Syria, Judaea, Egypt, Carthage, Persia, Greece, Macedonia, Parthia, and Rome. Library of Congress, 1899. ASIN B003RWSBPY - Saggs, H. W. F. Babylonians. Berkeley: University of California Press, 2000. ISBN 0520202228. Credits New World Encyclopedia writers and editors rewrote and completed the Wikipedia article in accordance with New World Encyclopedia standards. This article abides by terms of the Creative Commons CC-by-sa 3.0 License (CC-by-sa), which may be used and disseminated with proper attribution. Credit is due under the terms of this license that can reference both the New World Encyclopedia contributors and the selfless volunteer contributors of the Wikimedia Foundation. To cite this article click here for a list of acceptable citing formats.The history of earlier contributions by wikipedians is accessible to researchers here: The history of this article since it was imported to New World Encyclopedia: Note: Some restrictions may apply to use of individual images which are separately licensed."
}