{
  "url": "https://granny-games.com/",
  "title": "Granny",
  "text": "Granny Welcome to Granny. Granny keeps you locked in her house right now. You wake up in a dark room, the only thing that lights up the room is your flashlight lying on a table, you have a headache and it feels like someone has hit you in the head. As a result, you must make your way out of her home, but you must be cautious and remain silent. She hears everything. If you drop anything on the floor, she will hear it and hurry up to you. You may conceal yourselves in closets or beneath beds, but you must be cautious that she does not discover where you are hide yourself. Granny is an online arcade horror game in which you must find your way to escape the old rooms and hallways in Grandma's house. Just make sure that creepy Granny doesn't find out you're sneaking out because she doesn't like disobedient children. It will not be easy because the evil grandma has very good ears. So, if she hears you making a noise, she will rush over immediately. Every time you get caught by Granny or her traps, you'll lose a day and wake up the next evening in bed. Remember that you only have five days to escape! Granny was released in 2017 and was created by the famous publisher DVloper. This game offers you a first-person stimulating experience. In this horror adventure game, you can move your character around the house and interact with almost anything: open boxes and drawers; hide under the bed; pick up keys; disable traps; etc. With horror 3D graphics and a direct control system, Granny is a great horror game that you can play online. Do you think you can escape and escape the house of horrors? Tips and Tricks Make noise in one room while going to another. Granny can hear you through the din. Use this trick to divert her when you need to do some time-consuming things. Remember that Granny will not ignore you if she sees you entering a hiding spot. Though she is very concentrated and can hear any noise to its exact location, she isn't very smart and is easily fooled. Search the house to find the items to beat Granny. The items you need are placed randomly, and there is no way to know where any item is located at the beginning. Try to drop items without making a noise. This can be done successfully if you drop items on soft furniture, cabinets, desks, shelves, certain tables, and grass. Avoid creating noise by noticing the creaking floors. Then, you can walk through rooms much more quietly. Try to outrun Granny. Except at extremely difficult levels, you can run faster than Granny if you don't get cornered. Besides, you can delay her by closing doors in her way. How to play Granny Controls: Action = Escape, Move = WASD, Crouch/Stand = C, Hide/Unhide = R, Pickup/Interact = E, Drop = Space, Remove bear traps/Place/Use = F, Shoot = Left click, Spray = Left click. Weapons and crucial objects inside Granny’s house You can use these items only once per game and for specific purposes: - The Winch Handle = draw the bucket from inside the well in the Backyard. - The Padlock Code and The Battery = open a special lock on the Main Door. - The Remote Control = open the closet under the stairs in the Main Hallway. - The Cogwheels = open the Cogwheel Safe inside the Playhouse in the Backyard. - The Wrench = install the Car Engine part. - The Car Engine = escape via the car. - The Spark Plug = escape by car. - The Car Battery = place inside the car for one possible escape route. - The Meat = distract Granny’s playful Spider. - The Bird Seed = distract the crow in the Crow Room to obtain the item from the cage. - The Melon = provides several items. Sequels Granny: Chapter Two Granny: Chapter Two was released in 2019. Similar to the first version, you are once again kidnapped by Granny. This second installment introduces another antagonist: Deaf Grandpa. Granny can still hear everything. Grandpa doesn't hear very well, but he hits hard! You can choose between Grandma or Grandpa to play. In Granny: Chapter Two, there are also new items and weapons. You can also escape by helicopter or boat. Granny 3 Granny 3, the second sequel, was released in 2021. Like in the previous game, you'll again be trapped in a creepy house, but this time you're not alone. You'll be with granddaughter Slendrina, a new antagonist. The third version includes a new map, new items, and new puzzles. There are 2 ways to escape the horrifying house: the front gate and the subway train that was later added."
}