{
  "url": "https://news.vumc.org/2025/10/21/from-steakhouse-to-sanctuary-vanderbilt-birth-center-celebrates-10-years/",
  "title": "From steakhouse to sanctuary: Vanderbilt Birth Center celebrates 10 years - VUMC News",
  "text": "A decade ago, in a space that once offered steaks and Bloomin’ Onions, a new concept was born. In September, Vanderbilt Birth Center (VBC), formerly Baby+Co, celebrated 10 years of midwifery-led, out-of-hospital birth, perinatal care and comprehensive health care. In 2015, more than 80 clients signed up to give birth at VBC, formerly an Outback Steakhouse on West End Avenue, before the new paint dried. The first birth took place Sept. 3, just days after the center opened. “Every midwife and nurse came to that birth,” said Heather Barksdale Scott, BSN, RN, assistant manager of Patient Care Services and the first nurse hired at the center. “It was a sacred and celebratory moment for all of us. When the family returned years later for another pregnancy it reaffirmed the intention and impact of our care model.” The first babies born at VBC turned double digits last month, and the center has grown along with them. VBC has welcomed more than 2,792 babies over the past decade — and has grown into one of the most respected birth centers in the region. The draw of birth tubs VBC is a freestanding, midwifery-led facility dedicated to low-risk, unmedicated birth experiences. All facets of care — from prenatal visits to labor, delivery, postpartum and early newborn visits — take place under one roof. Clients park in the same lot and enter through the same doors for their routine prenatal appointments as they do when they arrive in labor. “We approach the care experience with both safety and client satisfaction in mind,” said Heather Sevcik, MSN, CNM, VMG Advanced Practice director and clinical director for Vanderbilt Birth Center. “This helps us consistently meet or exceed national clinical benchmarks with regards to providing safe, supportive care for birthing individuals and their babies.” Each of the four birth suites is designed with physiologic birth in mind: Along with an experienced, supportive staff, queen beds, roomy showers, dim lighting, essential oils, portable speakers for birth playlists and birth balls create an environment where those giving birth can feel safe and seen. In addition to the tranquil atmosphere, the birth tubs are popular with clients: VBC is one of only two accredited birth centers in Tennessee that offers tubs for water births. Many clients choose VBC because they want the option of a water birth, which provides comfort, supports relaxation and may shorten labor and decrease perineal tearing. “In the water, we follow evidence around the temperature, monitoring baby’s heart rate, when it’s safe to stay in the water, and when it’s safer to get out,” Sevcik said. Labor of love Lila Humbert, MSN, CNM, planned to return to high-risk obstetrics after she went back to school to become a certified nurse-midwife, but a postgraduation pregnancy changed her plans. “My husband and I wanted to stay in Nashville, where we had some community,” Humbert said, “Vanderbilt Birth Center offered me a job, and though it was on the opposite end of the spectrum from high risk, I thought I’d give it a try and see where it went.” That was six years ago. Now, Humbert says she can’t imagine doing anything else. “We will always need high-risk, medicalized care for some women,” Humbert said. “But for women in low-risk pregnancies, an unmedicated birth experience is simple, beautiful and its own kind of magic. There are a lot of places in this country where this kind of birth is not an option for women, and it’s a privilege to facilitate it for others.” Humbert is what Barksdale Scott calls a “three-peat” client. She started working at VBC in April 2019 and had her first child at VBC that September. She’s given birth to two more children at VBC since then — and is due with her fourth in January. “You can’t know how difficult and life-altering unmedicated labor is until you’re in it,” Humbert said. “I’d seen it from the other side as a provider and supported a lot of women through their own unmedicated labors, but it added a depth to my practice to experience it myself. I have more empathy, and I remember when I felt like I couldn’t do it and needed extra support.” Humbert is often asked if it was awkward to give birth where she works. “Honestly, no. It’s the place I feel safest,” she said. “I think it says a lot about our comfort with the space, our belief in the level of care and what a special place it is. We have a really special team.” ‘A seamless and supported experience’ While midwives have been part of Vanderbilt’s care model for more than 30 years, VBC is unique in that it is one of the few teaching hospital-affiliated freestanding birth centers in the U.S. And it remains closely connected to Vanderbilt University Hospital: Should a transfer become necessary during labor, birth center staff accompany clients directly to the hospital, ensuring a seamless and supported experience. “If a laboring client elects to go to the hospital for any clinical reason, like an epidural, we ride along or caravan and get them settled in Labor and Delivery or the postpartum unit,” said Barksdale Scott, who gave birth to her daughter at the Vanderbilt Birth Center. “If it’s an emergency, we also have the necessary tools to treat or stabilize clients at the Birth Center. We work closely with EMS and Angel, the mobile unit for the NICU at Monroe Carell Jr. Children’s Hospital at Vanderbilt.” Childbirth 101 and beyond A key feature of VBC’s model is comprehensive childbirth education. Every first-time client is required to complete classes in unmedicated birth, newborn care and breastfeeding. Clients returning for their second or third unmedicated birth can tailor their education experience with à la carte classes. Classes are included in the cost of prenatal care and taught by certified childbirth educators. “We provide education across the whole childbearing experience, so there is a great chance that one of our educators might help someone learn about tracking their fertility, teach them in their birth classes, and then support them in the postpartum period in the Thrive class. It’s such an honor to get to know families so intimately during this huge transition in their lives,” said VBC senior program manager Angela Haglund Graham. Thrive, which is part class, part support group, is hosted at the center. Each class addresses pertinent postpartum topics and focuses heavily on community connection. It’s open to everyone, whether they delivered at VBC or the hospital. “Thrive was a lifeline for me as a new parent,” said Ashley Couse, a childbirth and health educator who has been with VBC since it opened and welcomed her baby there in 2017. “Now I have the privilege of guiding others through that same postpartum journey. It’s incredibly special to come full circle.” More than birth Despite its name, the Vanderbilt Birth Center also offers full-spectrum women’s health services, including gynecological exams, preconception counseling, contraception, IUD placement, pap smears, perimenopausal support, and treatment for common gynecological concerns like yeast infections. Many patients continue to return to the center for well-person care long after childbirth. “It is always a joy to see clients return to the Birth Center for ongoing gynecological care after we’ve supported them during pregnancy,” Sevcik said. “We’re here for the journey and want to help individuals remain as healthy as possible as they move through life and all the physical and emotional changes that come with age.” Growing and grounded Though the space has evolved over the past 10 years, the only remaining trace of its steakhouse origins is an enclosed patio that staff and clients now use for breaks or walks during early labor. Today, the center supports approximately 30 births per month and continues to expand its team to meet demand. It recently completed its latest accreditation cycle through the Commission for the Accreditation of Birth Centers, reinforcing its commitment to evidence-based, safe, compassionate care. “The Vanderbilt Birth Center provides a great option for patients seeking a birthing alternative and experience outside of the hospital,” said Ronald Alvarez, MD, MBA, the Betty and Lonnie S. Burnett Professor of Obstetrics and Gynecology and chair of the department. “The Center has been an incredible partner to Obstetrics at VUH and has a consistent record of providing high quality obstetric care to the patients it serves.” As the center marks a decade of service, the team reflects not just on the numbers, but the relationships — the families who return multiple times and the children who now walk through the doors they were born behind. “We just keep doing the work and loving people through one of the most vulnerable and transformative moments of their lives,” Barksdale Scott said. If you or your patients are interested in learning more about Vanderbilt Birth Center, reach out directly to the Birth Center at 615-647-8220. You can also message the clinic in eStar at POBGYN BIRTH CENTER ADMIN, and staff will contact the patient directly."
}