{
  "url": "https://www.mundodeportivo.com/us/en/20260130/739391/official-fermin-lopez-extends-his-contract-until-2031.html",
  "title": "Official: Fermín López extends his contract until 2031",
  "text": "FC Barcelona officially announced on Friday the contract renewal of Fermín López (22), who has signed a new deal running through 2031. With this move, the club secures the future of one of the players who has shown the greatest development and growth over the past few seasons, becoming an increasingly important figure for Hansi Flick and a highly sought-after asset on the transfer market. Just last summer, both Chelsea and Bayern Munich were keen to sign him, but the academy product chose to remain at the club of his life. Since then, sporting director Deco and the player’s representatives had already begun talks over a new contract for the El Campillo native. As MD previously reported, Barça presented the homegrown midfielder with an improved offer, nearly doubling his current salary, adding performance-based bonuses that can be locked into the deal if certain targets are met, and extending his contract by two additional years. His previous deal was set to expire in 2029, but it has now been pushed back to 2031. The decision reflects the club’s belief that the player’s role and influence have grown significantly, making his previous salary outdated. It also serves as a reward for Fermín’s commitment, as he has consistently shown loyalty to Barcelona despite interest from other clubs. In its official statement, the Catalan club described the renewal as “a strategic commitment by FC Barcelona to a player who joined the club at just 13 years old and developed at La Masia, eventually becoming a key first-team figure through hard work, talent, and perseverance.” The agreement was finalized last Monday. The player was already aware of the terms on offer, but with a weekend match on the schedule, football took priority. After playing against Oviedo, he reviewed the situation with his family and his agent, Xavi Giménez, and following negotiations early this week, the final green light was given. Club and player have now sealed a deal through 2031, improving his wages while keeping his release clause unchanged at €500 million. This season, Fermín has been a decisive attacking presence. Alongside Lamine Yamal and Michael Olise, he is one of the few players in Europe’s top leagues posting double-digit goals and assists. The Andalusian attacking midfielder has tallied 10 goals and 11 assists, the most recent being the pass that set up Lamine Yamal in Wednesday’s 2–1 win over FC Copenhagen. The formal signing ceremony is expected to take place in the coming days at the office of club president Joan Laporta, after which the player will speak to the media, as confirmed by the club."
}