{
  "url": "https://ownyardlife.com/30-different-types-of-daisy-plants-with-pictures-and-names/",
  "title": "30 Different Types of Daisy Plants (With Pictures and Names)",
  "text": "When it comes to timeless garden charm, few flowers can rival the cheerful elegance of daisies. Alongside iconic blooms like roses, lilies, tulips, and orchids, daisies hold a special place in the hearts of flower lovers for their simple beauty and bright, open faces. With their unmistakable petal arrangement and vibrant centers, daisies bring a fresh, uplifting energy to any landscape. There are many different types of daisy plants, each with its own unique color, size, and growing preferences. From the classic Common Daisy to the exotic African Daisy and the eye-catching Gerbera, these flowers offer a wide range of options for gardeners and plant enthusiasts. Some thrive in wild meadows, while others are perfect for curated borders or vibrant flower beds. In this guide, we’ll explore 30 different types of daisy plants, complete with pictures and names to help you identify and choose your favorites. Whether you’re designing a cottage garden, filling containers, or looking for pollinator-friendly plants, this daisy list will inspire your next planting project and showcase just how diverse and delightful the daisy family can be. True Daisy Types (Family: Asteraceae) Common Daisy (Bellis perennis) The Common Daisy, scientifically known as Bellis perennis, is a small, perennial wildflower recognized for its cheerful appearance. It features classic white petals that radiate around a bright yellow center, although some cultivars display shades of pink or red. Typically growing just a few inches tall, this daisy is often seen naturalized in lawns, meadows, and open grassy areas, especially across Europe and temperate regions of North America. This daisy blooms from early spring to late fall, making it a long-lasting presence in the garden. The flowers close at night and open again with the morning sun, a trait that adds a touch of charm to any green space. It’s best suited for USDA hardiness zones 4 through 8 and can tolerate mild foot traffic, which is why it thrives in lawns and along garden pathways. To grow Common Daisies, choose a location with full sun to partial shade and well-draining soil. They prefer moderate moisture and can adapt to various soil types, though they thrive in slightly acidic to neutral soils. These daisies are low-maintenance, often self-seeding and forming spreading clumps over time. Deadheading spent blooms can encourage longer flowering and prevent unwanted spread. Shasta Daisy (Leucanthemum × superbum) The Shasta Daisy (Leucanthemum × superbum) is a cultivated garden favorite known for its large, striking white petals and sunny yellow centers. Standing taller than most native daisies, it can grow between 2 to 4 feet high, creating a bold display in garden beds and borders. The flowers are typically 3 to 4 inches wide and resemble the classic daisy form on an enlarged scale. Shasta Daisies bloom from early summer through fall and are particularly beloved for their ability to attract butterflies and pollinators. They thrive in USDA hardiness zones 5 through 9 and perform best in areas with long daylight hours and moderate temperatures. Because of their height and sturdy stems, they make excellent cut flowers for floral arrangements. For optimal growth, plant Shasta Daisies in full sun and well-draining soil. Water regularly but avoid overwatering, as they dislike soggy roots. Mulching can help retain soil moisture and suppress weeds. Deadheading will prolong blooming, and dividing the clumps every two to three years can maintain plant vigor and prevent overcrowding. Oxeye Daisy (Leucanthemum vulgare) The Oxeye Daisy (Leucanthemum vulgare) is a hardy perennial wildflower with white petals and a yellow central disk. Smaller than the Shasta Daisy, it grows up to 2 feet tall and has a daintier appearance. Its thin stems and finely toothed leaves make it easily distinguishable from other daisy varieties. This daisy typically blooms from May to August and is often found growing along roadsides, in meadows, and open fields. It is native to Europe but has naturalized widely across North America, sometimes to the point of invasiveness. Oxeye Daisies are best grown in USDA zones 3 through 9, where they tolerate a variety of conditions including poor, dry soils. Oxeye Daisies prefer full sun but can handle partial shade. They are extremely low-maintenance and drought-tolerant once established. Gardeners should be cautious, however, as they spread easily by seed and underground rhizomes. Regular deadheading and removing unwanted plants can help control their growth and keep them from overtaking other plantings. African Daisy (Osteospermum spp.) African Daisies (Osteospermum spp.) are known for their dazzling range of flower colors including purples, blues, whites, and pinks. These eye-catching blooms often feature a unique metallic sheen and sometimes have contrasting eye colors, giving them a distinct look. The plants typically grow Native to South Africa, African Daisies bloom in cooler temperatures during spring and fall, often pausing in the hottest part of summer. In USDA zones 9 through 11, they can be grown as perennials, but in cooler regions, they are treated as annuals. These daisies close their flowers at night or during cloudy weather, adding an interactive element to the garden. African Daisies thrive in full sun and prefer well-draining soil with moderate fertility. They are drought-tolerant once established and benefit from occasional deep watering rather than frequent light watering. To encourage more blooms, deadhead regularly and consider applying a balanced fertilizer every few weeks during the growing season. Gerbera Daisy (Gerbera jamesonii) Gerbera Daisies (Gerbera jamesonii) are beloved ornamental plants known for their large, brightly colored flowers that come in shades of red, orange, pink, yellow, and white. The blooms can reach up to 5 inches across and sit atop tall, leafless stems rising from a rosette of lobed, green leaves. Their bold appearance makes them a popular choice for containers and floral arrangements. These daisies bloom from spring through fall under the right conditions and are commonly grown as perennials in USDA zones 9 through 11, or as annuals elsewhere. Gerberas prefer mild climates and may stop blooming in extreme heat or cold. They also require bright light but may need afternoon shade in hotter regions to prevent flower scorch. To grow Gerbera Daisies successfully, plant them in well-draining soil rich in organic matter. Water consistently but avoid soggy conditions, as the crowns are prone to rot. Removing faded flowers and spent leaves helps maintain plant health and prolongs blooming. For indoor cultivation, place them in a sunny window and maintain moderate humidity levels. Michaelmas Daisy (Symphyotrichum novi-belgii, formerly Aster novi-belgii) The Michaelmas Daisy is a fall-blooming perennial admired for its abundant, small daisy-like flowers in hues of purple, pink, and sometimes white. These flowers typically feature yellow centers and bloom in dense clusters, creating a vibrant display when most summer flowers begin to fade. The plants usually grow between 1 to 4 feet tall with narrow, lance-shaped green leaves. This daisy blooms from late summer into autumn, often peaking around Michaelmas Day in late September, which is how it got its name. It thrives in USDA hardiness zones 4 through 8 and prefers locations with cooler summers. Michaelmas Daisies are popular in cottage gardens and mixed borders where they provide late-season color and attract pollinators like bees and butterflies. To grow this variety successfully, choose a sunny location with rich, moist, and well-draining soil. Regular watering and mulching will help retain soil moisture, especially during dry spells. Deadheading spent flowers can prolong the blooming season, and dividing the clumps every few years will prevent overcrowding and rejuvenate the plants. Painted Daisy (Tanacetum coccineum) The Painted Daisy is a cheerful, eye-catching perennial prized for its vivid flowers in shades of pink, red, and white, each with a bright yellow center. The daisy-like blooms sit atop tall, slender stems above fern-like foliage, making them a standout in garden beds. The vibrant petals often have a silky texture and can measure up to 3 inches across. Blooming from late spring to early summer, Painted Daisies are a favorite in ornamental and pollinator gardens. They are also valued for their natural insect-repelling properties, as they contain pyrethrins, which are used in organic pest control. This daisy grows best in USDA zones 3 through 7, where it thrives in moderate climates and full sun. For best results, plant Painted Daisies in well-draining, fertile soil with good organic content. Water them regularly, especially during dry periods, but avoid overwatering to prevent root rot. Deadheading will promote additional blooms, and dividing clumps every few years keeps the plants vigorous. These daisies also make excellent cut flowers for indoor arrangements. Gloriosa Daisy (Rudbeckia hirta) The Gloriosa Daisy is a bold and bright biennial or short-lived perennial with large, daisy-like blooms in rich shades of golden yellow, orange, and bronze. Each flower features a prominent dark brown or black center, giving it a dramatic contrast and a sunburst effect. The plants can grow up to 3 feet tall, with hairy stems and leaves that are slightly rough to the touch. This daisy typically blooms from midsummer through fall and is known for attracting butterflies, bees, and birds. It thrives in USDA hardiness zones 3 through 9 and is often considered a variety of Black-eyed Susan. Gloriosa Daisies are popular in wildflower meadows, borders, and naturalized garden settings due to their vivid coloration and ease of care. To grow Gloriosa Daisies, choose a sunny site with well-drained soil. These plants are drought-tolerant once established and do well in poorer soils, although they benefit from occasional fertilizing. Regular deadheading encourages continued blooming, and leaving some seed heads can help self-seed the next generation or provide food for birds in winter. Coneflower Daisy (Echinacea spp.) Coneflower Daisies, commonly known as Echinacea, are robust, native North American wildflowers known for their distinctive cone-shaped centers and drooping petals. The blooms typically come in purples and pinks, though cultivated varieties also offer colors like white, yellow, and orange. Their prominent spiny centers make them easy to identify and attractive to pollinators. These daisies bloom from early summer to late fall and thrive in USDA zones 3 through 9. They are extremely drought-tolerant and prefer open, sunny spaces such as prairies, meadows, and gardens with well-draining soil. Besides their ornamental value, Coneflowers are also used in herbal remedies, particularly Echinacea purpurea, which is believed to support immune health. To cultivate Coneflower Daisies, plant them in full sun and soil that doesn’t stay wet. They require minimal care once established, though occasional deadheading can prolong blooming. They self-seed readily and can naturalize in wildflower gardens. Cutting back the plants in late fall or early spring helps maintain their shape and vigor. Marguerite Daisy (Argyranthemum frutescens) The Marguerite Daisy is a tender perennial known for its shrub-like form and abundant, cheerful daisy blooms. The flowers come in shades of white, pink, or yellow, each with a classic yellow center. The plant itself forms a bushy mound of deeply cut, gray-green foliage and can reach up to 3 feet in both height and width. This daisy blooms profusely from spring through fall in warm climates and is ideal for container gardens, sunny borders, and coastal landscapes. It performs best in USDA hardiness zones 9 through 11, where it can be grown as a perennial. In cooler zones, it is often treated as an annual or brought indoors during winter. For optimal growth, plant Marguerite Daisies in full sun and well-drained soil with moderate moisture. These plants benefit from regular deadheading to keep the flowers coming and occasional light pruning to maintain a compact shape. They are relatively low-maintenance and respond well to a balanced fertilizer applied every few weeks during the growing season. Tasso Daisy (Bellis perennis ‘Tasso’ series) The Tasso Daisy is a cultivated variety of the common daisy, developed for its charming double or semi-double blooms. These flowers appear in rich shades of red, soft pink, or pure white and often have a more compact, fuller form than the wild type. The petals are tightly layered, forming a button-like shape that adds a unique texture to garden beds and containers. Tasso Daisies bloom in the cooler months of spring and early summer and thrive best in USDA hardiness zones 4 through 8. They are typically grown as biennials but can persist as short-lived perennials in favorable conditions. These daisies are ideal for edging, rock gardens, or mixed floral displays due to their tidy growth and vibrant colors. To cultivate Tasso Daisies, plant them in a sunny or lightly shaded location with moist, well-drained soil. Regular watering is essential, especially during dry spells, but avoid soggy conditions. Removing spent blooms encourages more flowering, and light fertilizing in early spring can support healthy growth and vibrant blooms. Swan River Daisy (Brachyscome iberidifolia) The Swan River Daisy is a charming annual native to Australia, known for its profusion of small, delicate flowers in shades of blue, lavender, white, and sometimes pink. Each flower features a dainty yellow center surrounded by narrow, fringed petals, creating a soft, airy look. The plant has finely cut green foliage and grows in a low, bushy form. Blooming from late spring through summer, this daisy thrives in USDA hardiness zones 9 through 11 and is commonly used as a warm-season bedding plant in cooler zones. Its compact size and spreading habit make it perfect for borders, hanging baskets, and ground cover applications, especially in coastal or Mediterranean-style gardens. For best results, plant Swan River Daisies in full sun and well-draining soil. These plants are relatively drought-tolerant but benefit from regular watering to sustain flowering. Deadheading can prolong bloom time, and occasional feeding with a balanced fertilizer will keep the plants healthy and vibrant throughout the growing season. Seaside Daisy (Erigeron glaucus) The Seaside Daisy is a tough, low-growing perennial native to the coastal regions of western North America. It is particularly valued for its salt tolerance and ability to thrive in rocky, exposed conditions. The flowers have light purple to lavender petals with bright yellow centers, resembling small traditional daisies, and often appear in masses above fleshy, bluish-green foliage. This daisy blooms from spring into early fall and performs well in USDA zones 8 through 10. It’s frequently found in coastal gardens, rockeries, and erosion-prone slopes where few other flowering plants can survive. Seaside Daisies attract pollinators and are especially useful in wildlife-friendly gardens. To grow Seaside Daisies successfully, provide full sun and gritty, well-draining soil. Once established, they require little water and are resistant to drought and salty air. Pruning back the plant after blooming helps maintain its shape and encourages new growth. Though low maintenance, an occasional mulch layer helps conserve moisture and reduce weed growth. English Daisy (Bellis perennis) The English Daisy is a beloved perennial flower often used in cool-climate gardens for its neat form and charming button-like blooms. Its flowers appear in shades of white, pink, or red, and often have yellow centers. The blooms are typically round and tightly packed with petals, giving them a tidy, rosette appearance that works well in formal settings. English Daisies are spring bloomers and thrive in USDA zones 4 through 8. They are often treated as biennials in warmer climates or used as cool-season annuals in bedding schemes, rock gardens, or path borders. Their compact size and bright flowers make them an excellent choice for adding visual interest to smaller garden spaces. To grow English Daisies, plant them in full sun or partial shade in rich, well-drained soil. They need consistent moisture, especially during warmer periods, and benefit from regular deadheading to prolong blooming. These plants may self-seed and naturalize if allowed, making them a good option for low-maintenance or cottage-style gardens. Transvaal Daisy (Gerbera viridifolia) The Transvaal Daisy, Gerbera viridifolia, is a wild species native to South Africa and considered one of the ancestors of the modern Gerbera hybrids. It features open-faced, cheerful flowers with simple, daisy-like structure and typically appears in shades of cream, yellow, or pale pink. Unlike cultivated Gerberas, the blooms are smaller and more delicate, but equally charming in their natural form. This plant blooms primarily in spring and summer and prefers warm, sunny climates. It is hardy in USDA zones 9 through 11 and is often grown in native plant landscapes, wildflower gardens, or as part of restoration efforts. While not as widely cultivated as ornamental Gerberas, the Transvaal Daisy plays an important role in Gerbera breeding programs. To cultivate this species, provide well-draining, sandy soil and a sunny location. It appreciates moderate watering but is relatively drought-tolerant once established. Removing faded blooms can encourage additional flowering, and occasional feeding during the growing season will support healthy growth and vibrant blooms. Cape Daisy (Dimorphotheca pluvialis) The Cape Daisy, also known as the African Rain Daisy, is a charming annual native to South Africa. It produces striking daisy-like blooms with glossy white petals sometimes tinged with lilac or yellow at the base, and a yellow or dark purple center. A fascinating feature of the Cape Daisy is its flowers’ sensitivity to light—they remain closed at night and on overcast days, opening only in full sunlight. This species flourishes in USDA hardiness zones 9 through 11 and is best grown as a warm-season annual in cooler regions. It blooms from late spring through summer and is often used in containers, borders, or wildflower gardens. The plant grows low to the ground with sparse, narrow green leaves that allow the showy flowers to stand out prominently. To grow Cape Daisies successfully, choose a location with full sun and well-drained soil. These plants are drought-tolerant once established and require minimal maintenance. Water moderately during dry spells, but avoid excessive moisture. Deadheading can encourage prolonged blooming, and planting en masse provides a striking visual display. Blue-eyed Daisy (Arctotis stoechadifolia) The Blue-eyed Daisy is a unique flowering plant with elegant white petals and a dramatic blue-purple center that gives it its common name. The foliage is another highlight—soft, silvery, and often covered with fine hairs, adding a textural contrast to its colorful blooms. Native to South Africa, this daisy adds a cool-toned accent to warm, sunny landscapes. Best suited to USDA zones 9 through 11, Blue-eyed Daisies thrive in hot, dry conditions and are especially attractive to butterflies and pollinators. The plant typically blooms from spring through early autumn and works well in borders, rock gardens, or drought-tolerant landscapes. It has a spreading habit, making it useful as ground cover in arid environments. For optimal growth, plant Blue-eyed Daisies in sandy or loamy soil with excellent drainage and full sun exposure. They are low maintenance, needing only occasional watering once established. Regular removal of spent flowers promotes continuous blooming, and a light application of fertilizer during the growing season can enhance flower production. Yellow Daisy (Euryops pectinatus) The Yellow Daisy, or Euryops, is a vibrant, shrubby perennial known for its golden-yellow, daisy-like blooms and feathery, gray-green foliage. Native to South Africa, this plant can flower nearly year-round in warm climates, making it a popular choice for consistent color in sunny gardens. Its cheerful blooms and dense growth habit make it perfect for hedges or mass plantings. Yellow Daisies grow well in USDA zones 8 through 11 and are prized for their ability to thrive in hot, dry conditions. The plant can reach up to 4 feet in height and width, forming a rounded mound covered in blooms. It is highly attractive to pollinators, particularly bees and butterflies, and adds a sunny presence to drought-tolerant landscapes. Plant in full sun with well-drained soil for best results. Though drought-tolerant, Yellow Daisies benefit from occasional watering during prolonged dry periods. Prune lightly after flowering to maintain shape and encourage new growth. Avoid overwatering, as soggy soil can lead to root rot. A light feeding in spring supports lush foliage and vibrant blooms. Desert Star Daisy (Monoptilon bellidiforme) The Desert Star Daisy is a petite, annual wildflower native to the arid regions of the southwestern United States. It produces small, star-like white flowers with bright yellow centers, often carpeting desert floors during favorable spring seasons. Its delicate appearance contrasts with the harshness of its environment, making it a remarkable desert bloomer. This plant is best suited to USDA zones 8 through 10 and thrives in sandy, well-drained soils with minimal water. It typically grows just a few inches tall and is highly valued in xeriscaping and native desert gardens. The Desert Star Daisy blooms profusely in early to mid-spring, often forming dense patches that attract pollinators. To grow Desert Star Daisies, sow seeds in fall or early spring in full sun. These plants need very little care and are ideal for low-maintenance, drought-resilient landscapes. Avoid irrigation once established, as excess water can cause decline. Letting plants go to seed allows natural reseeding and ensures future spring displays. Blackfoot Daisy (Melampodium leucanthum) The Blackfoot Daisy is a hardy, low-growing perennial native to the southwestern U.S. It features small, white, daisy-like flowers with yellow centers that emit a light, pleasant fragrance. The plant forms a neat mound of narrow, dark green leaves and blooms heavily from spring through fall, even in high heat and poor soils. This daisy thrives in USDA hardiness zones 5 through 10 and is particularly valued in xeriscaping and native plant gardens. Its compact growth and extended bloom time make it a favorite for borders, rock gardens, and slopes. Despite its delicate look, the Blackfoot Daisy is incredibly resilient and attracts pollinators like butterflies and bees. Plant Blackfoot Daisies in full sun and well-drained, preferably rocky or sandy soil. Once established, they require very little water and are highly tolerant of drought and heat. Prune lightly to maintain shape and remove faded blooms for continuous flowering. These plants rarely need fertilizer and perform best in lean soil conditions. Other Notable Daisy-like Flowers These aren’t “true” daisies, but are often referred to as such because of their similar appearance: Mexican Daisy (Erigeron karvinskianus) The Mexican Daisy, also known as Santa Barbara Daisy, is a charming, low-growing perennial with masses of small daisy-like flowers that open white and fade to pink or lavender. These delicate blooms create a soft, romantic look that’s ideal for cottage gardens, rock walls, or between pavers. The foliage is fine-textured and sprawling, adding to its informal, natural aesthetic. This plant thrives in USDA hardiness zones 5 through 9 and performs best in full sun to partial shade. It typically blooms from spring through fall, providing long-lasting color and attracting pollinators like bees and butterflies. Its trailing habit makes it useful as a groundcover or for cascading over the edges of containers and raised beds. Mexican Daisy grows best in well-drained soil and is drought-tolerant once established. Avoid overwatering, as it prefers slightly dry conditions. Light pruning can keep it tidy and promote fresh blooms. While generally low-maintenance, it can reseed freely, so occasional thinning may be necessary in smaller garden spaces. Indian Blanket Daisy (Gaillardia pulchella) Indian Blanket Daisy is a vibrant wildflower native to the southern United States and Mexico. It produces bold, daisy-like blooms with red centers and yellow-tipped petals, giving it a flame-like appearance. The plant’s showy flowers stand atop slender, branching stems and are a favorite among gardeners for their cheerful color and toughness. This hardy species grows well in USDA zones 3 through 10 and thrives in hot, dry environments. It typically blooms from late spring through fall and is often found in meadows, roadsides, and xeriscapes. The plant attracts butterflies and bees, making it a valuable addition to pollinator-friendly landscapes. Plant Indian Blanket Daisy in full sun and well-drained soil. It requires little water once established and tolerates poor, sandy, or rocky soils. Deadheading spent blooms can extend the flowering period, and the plant will often reseed itself for future seasons. It’s an excellent choice for low-maintenance, drought-tolerant gardens. Singapore Daisy (Sphagneticola trilobata) The Singapore Daisy is a vigorous, mat-forming groundcover with lush green leaves and bright yellow, daisy-like flowers. The blooms are small but numerous, appearing continuously throughout the growing season. Its spreading nature and dense foliage make it effective for erosion control and covering bare ground quickly. This plant is best grown in USDA zones 8 through 11, particularly in tropical and subtropical climates. While beautiful, it is considered invasive in many regions due to its aggressive growth habit. It thrives in full sun to partial shade and blooms nearly year-round in warm conditions, making it a popular ornamental in suitable areas. Singapore Daisy prefers moist, well-drained soil and requires little maintenance once established. However, gardeners should monitor its spread, especially in sensitive ecosystems or near natural habitats. Regular trimming can help control growth, and it’s best used in contained spaces like raised beds or urban landscapes where spread can be managed. Crown Daisy (Glebionis coronaria) Crown Daisy, also known as Garland Chrysanthemum, is a fast-growing annual with finely divided, aromatic foliage and bright yellow daisy-like flowers. The blooms are cheerful and can appear with single or double petals depending on the variety. In addition to its ornamental appeal, Crown Daisy is widely used in Asian cuisine, particularly in soups and hot pots. This plant grows well in USDA zones 7 through 10 and prefers cool seasons, making it a great option for spring and fall gardens. It matures quickly and flowers early, often within a couple of months from sowing. The flowers also attract bees and beneficial insects, making it a good companion in vegetable gardens. Crown Daisy thrives in full sun and rich, well-drained soil. Keep the soil consistently moist but not soggy. It benefits from regular harvesting of young leaves, which encourages bushier growth and prevents the plant from going to seed too quickly. As it is an annual, replanting each season is necessary for continued enjoyment. Fleabane Daisy (Erigeron spp.) Fleabane Daisies encompass a variety of Erigeron species, most of which feature small, delicate flowers with narrow petals ranging in color from white to pink to lavender, all with bright yellow centers. These perennials or biennials are loved for their airy, meadow-like appearance and are often found in wildflower plantings or naturalized areas. Most Fleabane species grow in USDA zones 4 through 9, depending on the variety. They typically bloom from spring through summer and are known to attract pollinators, especially bees and butterflies. Their graceful appearance makes them ideal for cottage gardens, borders, and rock gardens where a soft, natural look is desired. Fleabanes prefer full sun and well-drained soil, though many species are adaptable to a variety of conditions. They are generally low-maintenance and drought-tolerant once established. Occasional deadheading can prolong flowering, and some species will readily reseed, contributing to a self-sustaining garden environment."
}