{
  "url": "https://www.paulaner.com/",
  "title": "Paulaner Brauerei München",
  "text": "We use so-called cookies in connection with our Internet presence in order to optimally design and continuously improve it for you. We use technically necessary cookies, but also cookies for statistical purposes or to display personalized content. By clicking on the selection options, you may decide individually whether to allow certain cookies. Please find further information in our privacy statement. This is where you may modify your decision at any time and you will find further information on this topic. When activating marketing, statistics also need to be active. Required These cookies help us to enable the operation of the website. They ensure basic functions and therefore cannot be deactivated. Statistics With the help of these cookies, we collect anonymous data for statistics and analyses in order to improve and optimise our offer and our Internet presence. We collect information about the user behaviour on our website, such as the number of visits and the average time spent on the site or the pages called up. Marketing These cookies are used to present you advertising inside and outside our websites that is tailored to your interests. As a leading Weissbier brand, the Paulaner brewery accepts responsibility and respects legal requirements with regards to maintaining a responsible attitude towards drinking alcohol. You can find information about alcoholic drinks on the following pages. Paulaner is committed to the responsible consumption of alcohol. Since the following pages provide information on alcoholic beverages, we ask you to confirm your age. To visit a different international version of the website please select a country: Why we don’t advertise for people not of legal drinking age, you can learn at: www.responsibledrinking.eu The monks in the Neudeck ob der Au Monastery in Munich brew a strong beer, the Paulaner Salvator – naturally according to the Purity Law of 1516. Whatever they don’t drink themselves is given to the poor or sold in the cloister pub. In 1751, the Paulaner monks are officially allowed to serve their beer on the day celebrating the father of their order, Salvator. As a show of gratitude, they invite the Bavarian Electors to enjoy their first sip of the eponymous brew, Salvator. Valentin Stephan Still, a monk more commonly known as Brother Barnabas, arrives at Neudeck ob der Au monastery. His innovative brewing techniques set new standards for taste, quality, and wholesomeness. Indeed, his recipe from that time still forms the basis for today’s Paulaner Salvator. Franz Xaver Zacherl assumes control of the brewery from the monks after secularization, then modernizes and expands it. In the common vernacular, Paulaner is now often called “Zacherlbrew.” The first beer huts appear on the “Wiesn” meadow and Paulaner soon obtains its licence to serve beer. Eight years before, a major horse race had been organised here, when the heir to the throne, Ludwig I, married Princess Therese of Saxony-Hildburghausen. This was the start of the largest popular festival in the world. The Paulaner Brewery moves with the times and is always developing new techniques. One of the first Carl von Linde ice machines is used. From that point on, beer can be brewed all year round. The Paulaner Brewery is for the most part destroyed during a bombing raid in 1944. Reconstruction is completed by 1950. The Schörghuber family takes over the majority of Paulaner Brewery and the entrepreneurial family maintains that majority to this day. The Waitzinger Weissbier is the first non-alcoholic weissbier in the world – today it’s called Hefe-Weißbier Non-Alcoholic. Another innovation: The Thomas Bräu Non-Alcoholic is one of the first bottom-fermented non-alcoholic beers in the world – today it’s called the Original Münchner Non-Alcoholic. Paulaner Bräuhaus Consult GmbH opens the first brewhouse on Kapuzinerplatz in Munich as the headquarters of Paulaner taverns with its own in-house brewing operation. More brewhouses follow in Beijing, Shanghai, Singapore, and St. Petersburg. On the occasion of the 200th Oktoberfest, Paulaner gives itself and its guests a completely new festival tent: the Winzerer Fähndl. It is the first tent to have a centralized beer supply fed through an underground loop pipeline. It is copied by others after its debut. The cornerstone of the new brewery in Landwied is laid. The Paulaner CEO along with the facility’s first master brewer, Christian Dahncke, are accompanied by “Mama Bavaria,” Luise Kinseher, for the ceremony at the location of the future brewhouse. On September 15, 2015, the first beer in Munich Langwied is poured and the new brewery is officially opened. In December 2016, management moves back into the old Zacherlbrau building – the original headquarters in Munich Au. For the first time in its history, Paulaner exports 1 million hectoliters to the rest of the world. Paulaner is consumed in over 80 countries around the globe. The monks in the Neudeck ob der Au Monastery in Munich brew a strong beer, the Paulaner Salvator – naturally according to the Purity Law of 1516. Whatever they don’t drink themselves is given to the poor or sold in the cloister pub. As ever-larger numbers of people in Munich begin drinking the beer, civilian brewers voice their complaints to the city council on February 24, 1634, about competition from the monastery. This letter is considered the first documented evidence of the Paulaner Brewery and is to this day used as the founding date of the brewery. In 1751, the Paulaner monks are officially allowed to serve their beer on the day celebrating the father of their order, Salvator. As a show of gratitude, they invite the Bavarian Electors to enjoy their first sip of the eponymous brew, Salvator. It is a ritual that still takes place, when the head of the Paulaner Brewery hands the first 1-liter measure of Salvator to the Bavarian minister president at the kick-off of the Munich Starkbierfest (strong beer festival). In 1780 the brewery is granted an unrestricted license to serve its beer. Valentin Stephan Still, a monk more commonly known as Brother Barnabas, arrives at Neudeck ob der Au monastery. His innovative brewing techniques set new standards for taste, quality, and wholesomeness. Indeed, his recipe from that time still forms the basis for today’s Paulaner Salvator. Franz Xaver Zacherl assumes control of the brewery from the monks after secularization, then modernizes and expands it. In the common vernacular, Paulaner is now often called “Zacherlbrew.” The first beer huts appear on the “Wiesn” meadow and Paulaner soon obtains its licence to serve beer. Eight years before, a major horse race had been organised here, when the heir to the throne, Ludwig I, married Princess Therese of Saxony-Hildburghausen. This was the start of the largest popular festival in the world. The Paulaner Brewery moves with the times and is always developing new techniques. One of the first Carl von Linde ice machines is used. From that point on, beer can be brewed all year round. The Paulaner Brewery is for the most part destroyed during a bombing raid in 1944. Reconstruction is completed by 1950. The Schörghuber family takes over the majority of Paulaner Brewery and the entrepreneurial family maintains that majority to this day. The Waitzinger Weissbier is the first non-alcoholic weissbier in the world – today it’s called Hefe-Weißbier Non-Alcoholic. Another innovation: The Thomas Bräu Non-Alcoholic is one of the first bottom-fermented non-alcoholic beers in the world – today it’s called the Original Münchner Non-Alcoholic. Paulaner Bräuhaus Consult GmbH opens the first brewhouse on Kapuzinerplatz in Munich as the headquarters of Paulaner taverns with its own in-house brewing operation. More brewhouses follow in Beijing, Shanghai, Singapore, and St. Petersburg. On the occasion of the 200th Oktoberfest, Paulaner gives itself and its guests a completely new festival tent: the Winzerer Fähndl. It is the first tent to have a centralized beer supply fed through an underground loop pipeline. It is copied by others after its debut. The cornerstone of the new brewery in Landwied is laid. The Paulaner CEO along with the facility’s first master brewer, Christian Dahncke, are accompanied by “Mama Bavaria,” Luise Kinseher, for the ceremony at the location of the future brewhouse. On September 15, 2015, the first beer in Munich Langwied is poured and the new brewery is officially opened. In December 2016, management moves back into the old Zacherlbrau building – the original headquarters in Munich Au. For the first time in its history, Paulaner exports 1 million hectoliters to the rest of the world. Paulaner is consumed in over 80 countries around the globe. The monks in the Neudeck ob der Au Monastery in Munich brew a strong beer, the Paulaner Salvator – naturally according to the Purity Law of 1516. Whatever they don’t drink themselves is given to the poor or sold in the cloister pub. As ever-larger numbers of people in Munich begin drinking the beer, civilian brewers voice their complaints to the city council on February 24, 1634, about competition from the monastery. This letter is considered the first documented evidence of the Paulaner Brewery and is to this day used as the founding date of the brewery. In 1751, the Paulaner monks are officially allowed to serve their beer on the day celebrating the father of their order, Salvator. As a show of gratitude, they invite the Bavarian Electors to enjoy their first sip of the eponymous brew, Salvator. It is a ritual that still takes place, when the head of the Paulaner Brewery hands the first 1-liter measure of Salvator to the Bavarian minister president at the kick-off of the Munich Starkbierfest (strong beer festival). In 1780 the brewery is granted an unrestricted license to serve its beer. Valentin Stephan Still, a monk more commonly known as Brother Barnabas, arrives at Neudeck ob der Au monastery. His innovative brewing techniques set new standards for taste, quality, and wholesomeness. Indeed, his recipe from that time still forms the basis for today’s Paulaner Salvator. Franz Xaver Zacherl assumes control of the brewery from the monks after secularization, then modernizes and expands it. In the common vernacular, Paulaner is now often called “Zacherlbrew.” The first beer huts appear on the “Wiesn” meadow and Paulaner soon obtains its licence to serve beer. Eight years before, a major horse race had been organised here, when the heir to the throne, Ludwig I, married Princess Therese of Saxony-Hildburghausen. This was the start of the largest popular festival in the world. The Paulaner Brewery moves with the times and is always developing new techniques. One of the first Carl von Linde ice machines is used. From that point on, beer can be brewed all year round. The Paulaner Brewery is for the most part destroyed during a bombing raid in 1944. Reconstruction is completed by 1950. The Schörghuber family takes over the majority of Paulaner Brewery and the entrepreneurial family maintains that majority to this day. The Waitzinger Weissbier is the first non-alcoholic weissbier in the world – today it’s called Hefe-Weißbier Non-Alcoholic. Another innovation: The Thomas Bräu Non-Alcoholic is one of the first bottom-fermented non-alcoholic beers in the world – today it’s called the Original Münchner Non-Alcoholic. Paulaner Bräuhaus Consult GmbH opens the first brewhouse on Kapuzinerplatz in Munich as the headquarters of Paulaner taverns with its own in-house brewing operation. More brewhouses follow in Beijing, Shanghai, Singapore, and St. Petersburg. On the occasion of the 200th Oktoberfest, Paulaner gives itself and its guests a completely new festival tent: the Winzerer Fähndl. It is the first tent to have a centralized beer supply fed through an underground loop pipeline. It is copied by others after its debut. The cornerstone of the new brewery in Landwied is laid. The Paulaner CEO along with the facility’s first master brewer, Christian Dahncke, are accompanied by “Mama Bavaria,” Luise Kinseher, for the ceremony at the location of the future brewhouse. On September 15, 2015, the first beer in Munich Langwied is poured and the new brewery is officially opened. In December 2016, management moves back into the old Zacherlbrau building – the original headquarters in Munich Au. For the first time in its history, Paulaner exports 1 million hectoliters to the rest of the world. Paulaner is consumed in over 80 countries around the globe. “Paulaner engagiert” means “Paulaner is committed” – a motto that guides our social responsibility. As the company’s majority shareholder is a family, long-term success is of huge importance to us. And long-term success requires a stable environment. That’s why for us, sustainability means being a reliable partner and always taking the long-term view. This is the standard we set ourselves in all our work, and it determines our relationships with suppliers, society, and the environment in equal measure. Paulaner has traditionally shown its commitment to Munich in many different ways. These include the brewery’s help with fund-raising for the Josef Schörghuber Foundation for children in Munich. Each year, the foundation provides financial support for many needy children, young people, and families from Munich so that they can take part in holiday and leisure activities. With this and other regional actions, such as donating a bell for the neighbouring Maria Hilf Kirche, Paulaner demonstrates its commitment to our home city. Only by ensuring that environment is unspoiled can we ensure the long-term quality of the water, malt, and hops – the natural raw materials used to make Paulaner beer. Protecting the environment is therefore in the brewery’s own interests and has long been an important part of our corporate principles. In 1998, the Paulaner Brewery introduced a system of environmental management in the form of an environmental audit. This was followed in 2003 with certification according to the ISO 14001 standard. Since November 2013, the brewery has also been EMAS III certified, which is the highest level of environmental management in the EU. You can find more detailed information in the Paulaner environmental report. Beer is a cultural heritage representing a fun attitude to life, relaxation, and conviviality. There are many times in our lives that are made even better by a beer fresh from the tap. Beer is a luxury, and time should be set aside to enjoy it. We stand for a responsible attitude towards beer and are committed to combating alcohol abuse. We support the “Bier bewusst genießen” (“Enjoy beer responsibly”) campaign initiated by the German association of breweries. Our company is guided by the following principles. We are also committed to ensuring that our partners in the retail, catering and hospitality trades also follow these guidelines. Händlerliste anzeigen Beer-Finder On the following website you can find our Beer Finder to see where you can purchase Hacker-Pschorr beers in your area. To the Beer Finder (You are now leaving the website)The product you are looking for is only available seasonally. We are happy to assist you in the search for a supplier. Please use our contact form. Contact FormPlease use the following form. Please use the following form."
}