{
  "url": "https://www.city-data.com/neighborhood/Kaisertown-Buffalo-NY.html",
  "title": "Kaisertown neighborhood in Buffalo, New York (NY), 14206 subdivision profile - real estate, apartments, condos, homes, community, population, jobs, income, streets",
  "text": "Kaisertown neighborhood in Buffalo, New York (NY), 14206 detailed profile Settings X Business Search - 14 Million verified businesses Area: 1.226 square miles Population: 28,058 Population density: - 19,85065.2%White - 3,97413.0%Hispanic or Latino - 2,3067.6%Black - 2,1136.9%Two or more races - 1,8196.0%Asian - 3431.1%Some other race - 300.10%Native Hawaiian and Other Pacific Islander - 260.09%American Indian Median household income in 2023: Distribution of median household income - 1,200Less than $10,000 - 804$10,000 to $19,999 - 1,788$20,000 to $29,999 - 1,928$30,000 to $39,999 - 1,076$40,000 to $49,999 - 904$50,000 to $59,999 - 2,211$60,000 to $74,999 - 1,807$75,000 to $99,999 - 789$100,000 to $124,999 - 1,127$125,000 to $149,999 - 529$150,000 to $199,999 - 538$200,000 or more Distribution of owner-occupied house/condo value - 1,287Less than $50,000 - 2,732$50,000 to $99,999 - 2,445$100,000 to $149,999 - 1,464$150,000 to $199,999 - 864$200,000 to $249,999 - 285$250,000 to $299,999 - 99$300,000 to $399,999 - 16$400,000 to $499,999 - 452$500,000 to $749,999 - 36$750,000 to $999,999 - 67$1,000,000 or more Distribution of rent paid by renters - 261$100 to $199 - 346$200 to $299 - 288$300 to $399 - 1,138$400 to $499 - 3,078$500 to $599 - 1,191$600 to $699 - 950$700 to $799 - 612$800 to $899 - 477$900 to $999 - 1,559$1,000 to $1,249 - 140$1,250 to $1,499 - 11$1,500 to $1,999 - 720$2,000 or more Median age: Males: Females: Males: Females: Average household size: Percentage of family households: Percentage of married-couple families (among all households): Percentage of married-couple families with children (among all households): Percentage of single-mother households (among all households): Percentage of never married males 15 years old and over: Percentage of never married females 15 years old and over: Percentage of never married females 15 years old and over: Percentage of people that speak English not well or not at all: Percentage of people born in this state: Percentage of people born in another U.S. state: Percentage of native residents but born outside the U.S.: Percentage of foreign born residents: Percentage of people born in another U.S. state: Percentage of native residents but born outside the U.S.: Percentage of foreign born residents: Owner-occupied Renter-occupied - Rooms in owner-occupied houses and condos in Kaisertown - 111 room - 272 rooms - 4813 rooms - 1,0694 rooms - 1,7665 rooms - 1,9876 rooms - 8517 rooms - 7638 rooms - 1,1689+ rooms - Rooms in renter-occupied apartments in Kaisertown - 1591 room - 322 rooms - 3673 rooms - 2,4704 rooms - 1,9565 rooms - 6836 rooms - 5087 rooms - 2458 rooms - 6739+ rooms Owner-occupied Renter-occupied - Bedrooms in owner-occupied houses and condos in Kaisertown - 11no bedroom - 3471 bedroom - 1,4822 bedrooms - 3,8183 bedrooms - 1,0624 bedrooms - 7335+ bedrooms - Bedrooms in renter-occupied apartments in Kaisertown - 159no bedroom - 8581 bedroom - 3,0252 bedrooms - 1,6143 bedrooms - 8224 bedrooms - 2005+ bedrooms Average number of cars or other vehicles available in houses/condos: Average number of cars or other vehicles available in apartments: Average number of cars or other vehicles available in apartments: Percentage of units with a mortgage: Housing prices: - Average estimated value of detached houses in 2023 (48.6% of all units): - Average estimated value of housing units in 2-unit structures in 2023 (47.9% of all units): - Year house built in Kaisertown - 02020 or later - 932010 to 2019 - 3282000 to 2009 - 6581990 to 1999 - 821980 to 1989 - 5441970 to 1979 - 8551960 to 1969 - 4,3911950 to 1959 - 1,5851940 to 1949 - 6,9291939 or earlier City-data.com crime index for city in 2023 (higher means more crime): Travel time to work (commute) - 78Less than 5 minutes - 6865 to 9 minutes - 74710 to 14 minutes - 1,15515 to 19 minutes - 1,02620 to 24 minutes - 64525 to 29 minutes - 57930 to 34 minutes - 3235 to 39 minutes - 7240 to 44 minutes - 22745 to 59 minutes - 10660 to 89 minutes - 12190 or more minutes Means of transportation to work - 82.3%11,511Drove a car alone - 9.4%1,320Carpooled - 2.6%366Bus - 0.2%21Taxi - 0.1%17Motorcycle - 1.4%195Bicycle - 3.8%536Walked - 0.5%74Other means - 4.7%661Worked at home Time leaving home to go to work - 3112:00 a.m. to 4:59 a.m. - 3245:00 a.m. to 5:29 a.m. - 6405:30 a.m. to 5:59 a.m. - 3666:00 a.m. to 6:29 a.m. - 6926:30 a.m. to 6:59 a.m. - 9527:00 a.m. to 7:29 a.m. - 6167:30 a.m. to 7:59 a.m. - 1578:00 a.m. to 8:29 a.m. - 1618:30 a.m. to 8:59 a.m. - 2899:00 a.m. to 9:59 a.m. - 14210:00 a.m. to 10:59 a.m. - 2611:00 a.m. to 11:59 a.m. - 34112:00 p.m. to 3:59 p.m. - 5114:00 p.m. to 11:59 p.m. Occupations of males: - Percentage of males in management occupations (except farmers): - Percentage of males in business and financial operations occupations: - Percentage of males in computer and mathematical occupations: - Percentage of males in arts, design, entertainment, sports, and media occupations: - Percentage of males in healthcare practitioners and technical occupations: - Percentage of males in service occupations: - Percentage of males in sales and office occupations: - Percentage of males in farming, fishing, and forestry occupations: - Percentage of males in construction, extraction, and maintenance occupations: - Percentage of males in production occupations: - Percentage of males in transportation occupations: - Percentage of males in material moving occupations: Occupations of females: - Percentage of females in management occupations (except farmers): - Percentage of females in business and financial operations occupations: - Percentage of females in education, training, and library occupations: - Percentage of females in healthcare practitioners and technical occupations: - Percentage of females in service occupations: - Percentage of females in sales and office occupations: - Percentage of females in production occupations: Education in this neighborhood (subdivision or community): - Percentage of people 3 years and older in K-12 schools: - Percentage of people 3 years and older in undergraduate colleges: - Percentage of people 3 years and older in grad. or professional schools: - Percentage of students K-12 enrolled in private schools: Percentage of population below poverty level: Median year owner moved in (as recorded in 2023): Percentage of married-couple families with both working: - 70.8%Utility gas - 9.8%Electricity - 8.1%Other fuel - 5.2%Bottled, tank, or LP gas - 3.4%Fuel oil, kerosene, etc. - 1.8%Wood - 1.0%No fuel used Limited-access highways (interstate or state) in this neighborhood: I- 190 Length: 1.24 miles Directions: E-W, SW-NE Directions: E-W, SW-NE Highways in this neighborhood: State Hwy 354 (Clinton St) Length: 1.26 miles Direction: E-W Address range: 1570 to 2071 Direction: E-W Address range: 1570 to 2071 Roads and streets: S Ogden St Length: 1.36 miles Directions: N-S, SW-NE Address range: 150 to 799 Directions: N-S, SW-NE Address range: 150 to 799 Casimir St Length: 0.86 miles Direction: E-W Address range: 1 to 269 Direction: E-W Address range: 1 to 269 Willett St Length: 0.84 miles Directions: E-W, N-S Address range: 127 to 599 Directions: E-W, N-S Address range: 127 to 599 Weimar St Length: 0.80 miles Directions: E-W, N-S Address range: 1 to 499 Directions: E-W, N-S Address range: 1 to 499 Weiss St Length: 0.79 miles Direction: N-S Address range: 1 to 404 Direction: N-S Address range: 1 to 404 Barnard St Length: 0.74 miles Direction: N-S Address range: 1 to 399 Direction: N-S Address range: 1 to 399 Dingens St Length: 0.72 miles Direction: E-W Address range: 10 to 430 Direction: E-W Address range: 10 to 430 Cable St Length: 0.70 miles Direction: N-S Address range: 1 to 399 Direction: N-S Address range: 1 to 399 Griswold St Length: 0.62 miles Direction: E-W Address range: 1 to 236 Direction: E-W Address range: 1 to 236 Holly St Length: 0.48 miles Direction: N-S Address range: 123 to 399 Direction: N-S Address range: 123 to 399 Fenton St Length: 0.47 miles Direction: N-S Address range: 1 to 399 Direction: N-S Address range: 1 to 399 James E Casey Dr Length: 0.43 miles Directions: E-W, N-S, SE-NW Address range: 1 to 1999 Directions: E-W, N-S, SE-NW Address range: 1 to 1999 Cochrane St Length: 0.41 miles Direction: N-S Address range: 2 to 198 Direction: N-S Address range: 2 to 198 Weaver St Length: 0.37 miles Direction: N-S Address range: 1 to 222 Direction: N-S Address range: 1 to 222 Cambria St Length: 0.36 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Gorski St Length: 0.33 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Seward St Length: 0.33 miles Direction: E-W Address range: 1 to 99 Direction: E-W Address range: 1 to 99 Krakow St Length: 0.31 miles Directions: E-W, N-S, SE-NW, SW-NE Address range: 1 to 140 Directions: E-W, N-S, SE-NW, SW-NE Address range: 1 to 140 Thielman Dr Length: 0.31 miles Directions: E-W, SW-NE Address range: 1 to 199 Directions: E-W, SW-NE Address range: 1 to 199 Spann St Length: 0.30 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Fredro St Length: 0.30 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Rejtan St Length: 0.26 miles Direction: E-W Address range: 1 to 199 Direction: E-W Address range: 1 to 199 S Pontiac St Length: 0.25 miles Direction: N-S Address range: 35 to 199 Direction: N-S Address range: 35 to 199 S Ogden Annex Length: 0.22 miles Directions: N-S, SW-NE Directions: N-S, SW-NE Pontiac St Length: 0.22 miles Directions: N-S, SW-NE Address range: 1 to 199 Directions: N-S, SW-NE Address range: 1 to 199 Pierce St Length: 0.21 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Wheelock St Length: 0.21 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Pulaski St Length: 0.21 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 S Pierce St Length: 0.18 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Roberts Ave Length: 0.14 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Richard Dr Length: 0.13 miles Direction: SW-NE Address range: 1 to 51 Direction: SW-NE Address range: 1 to 51 Cliff St Length: 0.13 miles Direction: N-S Address range: 1 to 99 Direction: N-S Address range: 1 to 99 Kelburn St Length: 0.13 miles Direction: N-S Address range: 1 to 199 Direction: N-S Address range: 1 to 199 Bismarck St Length: 0.10 miles Direction: E-W Address range: 1 to 48 Direction: E-W Address range: 1 to 48 Kopernik St Length: 0.10 miles Direction: N-S Address range: 1 to 99 Direction: N-S Address range: 1 to 99 Matejko St Length: 0.10 miles Direction: N-S Address range: 1 to 99 Direction: N-S Address range: 1 to 99 Glenn St Length: 0.08 miles Direction: N-S Address range: 1 to 99 Direction: N-S Address range: 1 to 99 Olsen St Length: 0.08 miles Direction: N-S Address range: 1 to 99 Direction: N-S Address range: 1 to 99 Rosser Ave Length: 0.08 miles Directions: E-W, N-S Directions: E-W, N-S Gardon St Length: 0.07 miles Direction: E-W Direction: E-W William St Length: 0.05 miles Direction: E-W Address range: 1893 to 1904 Direction: E-W Address range: 1893 to 1904 Railroad features: Erie-Lackawanna RR Length: 2.22 miles Directions: E-W, N-S, SW-NE Directions: E-W, N-S, SW-NE Lehigh Valley RR Length: 1.53 miles Directions: E-W, SW-NE Directions: E-W, SW-NE"
}