{
  "url": "https://en.m.wikipedia.org/wiki/Żywiec",
  "title": "Żywiec - Wikipedia",
  "text": "Żywiec Żywiec (Polish pronunciation: [ˈʐɨvjɛts]) is a town on the River Soła in southern Poland, with 31,194 inhabitants (2019). It is situated within the Silesian Voivodeship, near the Żywiec Lake and Żywiec Landscape Park, one of the eight protected areas in the voivodeship. Historically and culturally, the town is part of the Lesser Poland (Małopolska) region and is the capital of the Żywiecczyzna region, which is ethnically part of the Goral Lands.[2] The asteroid 551231 Żywiec is named after the town. History [edit]Żywiec was first mentioned in a written document in 1308 as a seat of a Catholic parish. It was originally located in the place later known as Stary Żywiec (lit. \"Old Żywiec\"). It belonged then to the Duchy of Cieszyn, and after 1315 to the Duchy of Oświęcim, which in 1327 became a fief of the Kingdom of Bohemia. The town was a focal point for the development of hitherto sparsely populated Żywiec Basin. The area of Stary Żywiec was prone to flooding so the town was moved to the current spot in 1448. In 1457 the Duchy of Oświęcim was purchased and incorporated directly to the Polish Crown. Żywiec was a private town, administratively located in the Kraków Voivodeship in the Lesser Poland Province of the Polish Crown. In 1624 it was sold by the Komorowski family to Constance of Austria, queen consort of the Polish king Sigismund III Vasa. During the Deluge, Żywiec was plundered and destroyed by Swedish troops in 1656. From 1672 it was a possession the Polish Chancellor Jan Wielopolski. The Old Castle was built in the mid-14th century. The castle has undergone several restorations and boasts a number of styles of architecture and decoration, including Gothic, Renaissance and Baroque. Żywiec's Old Castle is encompassed by a 260,000 square metre landscape park, which was established initially in the 17th century.[3] The Church of the Holy Cross was built towards the end of the 14th century, and expanded twice, once in 1679 and again in 1690. In the 18th century, a Baroque church was later constructed on the site and still stands today. A second noteworthy church, the Cathedral of the Virgin Mary's Birth, was constructed and expanded during the first half of the 15th century, before being renovated in Baroque fashion after a fire in 1711.[3] Upon the First Partition of Poland in 1772, Żywiec became part of the Austrian Kingdom of Galicia. In 1810 it was purchased by Prince Albert of Saxony, son of King Augustus III of Poland and again ruled with the neighbouring Silesian Duchy of Teschen (Cieszyn). When he died in 1822, his estates fell to Archduke Charles from the Austrian House of Habsburg-Lorraine. The town also houses the Żywiec Brewery, established by Charles' son Archduke Albert in 1852, and purchased by Heineken International in the 1990s. A museum was founded at the site in 2006.[4] At the beginning of World War I, over 1,000 soldiers of the Polish Legions from the region marched out from Żywiec to fight for Polish independence; 167 of them died in the war.[5] At the end of the war, in 1918, Poland regained independence and control of the town. Eight Poles from Żywiec were killed in the Polish–Soviet War of 1919–1920.[6] Second World War [edit]Following the 1939 Invasion of Poland, which started World War II, Żywiec was occupied by Nazi Germany and annexed to the German Province of Upper Silesia (see East Upper Silesia). The last Habsburg owner, Archduke Karl Albrecht of Austria refused to sign the German Volksliste, whereafter he was ousted and arrested. 26 Poles from Żywiec were murdered by the Russians in the large Katyn massacre in April–May 1940.[7] Between September and December 1940, the Nazi authorities expelled 17,413–20,000 Polish inhabitants from around Żywiec County in the so-called Action Saybusch conducted by the Wehrmacht and Gestapo.[8] A transit camp for expelled Poles was located at the local school.[9] The expelled Poles were taken to the General Government, a different region within Poland under German military occupation. The incident formed part of the Nazis' efforts, led by Reich Minister Alfred Rosenberg and his deputy Alfred Meyer, to develop the Occupied Eastern Territories for settlement by German migrants.[10] In 1941, Nazi German Oberpräsident of Upper Silesia Fritz Bracht, while visiting the town, declared that there will be no Poles in the county in five years.[11] On 25 January 1945, the Soviet Air Forces bombed the German units concentrated in Żywiec. Several buildings were damaged during the bombardment, and 25 civilians lost their lives.[12] The Red Army started its advance towards Żywiec on 3 February 1945 as a part of the Vistula–Oder offensive. The attack was led by the 1st Guards Army.[13] The Germans prepared a defense system around the town. Heavy fighting took place in nearby villages.[12] On 20 February, the Soviets captured the area of Stary Żywiec.[13] At the beginning of April 1945, the Red Army broke through the German defense. Following street fighting, the Soviets took control of the town on 5 April, ending the Nazi occupation.[12] In total, 194 buildings in Żywiec were destroyed during the Second World War, and 98 buildings were damaged. Among the damaged buildings were the town hall, fire department, post office, power plant, slaughterhouse, five schools, and a church in Stary Żywiec.[13] While retreating from the town, the Germans blew up three bridges and destroyed the railway station in Zabłocie.[12] Communist Poland [edit]The town's local government, made up of its residents, began to form in early April 1945. The Town Council was formed on 8 April, with Jan Dziki serving as the mayor. The power plant began operating in August 1945. Local craft guilds, schools, factories, and sports organizations were reactivated. On 16 May 1945, a Resettlement Committee for Żywiec County was established in the town. Its goal was to relocate the settlers to the Recovered Territories. It operated until July 1945. In total, 2437 families (15,013 people) were resettled to Opolian Silesia. The regional museum was reactivated in September 1946.[13] During the Communist era, Żywiec expanded its area by annexing nearby villages of Sporysz, Zabłocie, Isep, and Kocurów. The town's population also grew, due to people seeking employment in local factories.[13] Since 1945, it belonged to the Kraków Voivodeship.[14] Following the voivodeship's partition in 1975, Żywiec found itself in Bielsko Voivodeship.[15] On 29 June 1958, the town was flooded by Soła and Koszarawa rivers. The flood wave destroyed two bridges,[16] and the town's centre found itself underwater.[17] A second flood took place in July 1960.[18] In 1966, the Żywiec Lake reservoir was created.[16] Another flood happened in July 1970.[18] Economy [edit]The Żywiec Brewery is located in the town. There is a museum dedicated to the brewery. Sports [edit]There are several football clubs in the town: men teams Koszarawa Żywiec, Czarni-Góral Żywiec,[19] Soła Żywiec,[20] and women team TS Mitech Żywiec. All four teams compete in the lower leagues, although Mitech also played in the Ekstraliga (Polish top division) until 2020. Notable people [edit]- Ferdynand Obtułowicz (1851-1923), doctor and social worker - Archduke Charles Stephen of Austria (1860–1933), aristocrat - Archduke Karl Albrecht of Austria (1888–1951), aristocrat - Alice Habsburg (1889–1985), aristocrat - Archduke Leo Karl of Austria (1893–1939), aristocrat - Wilhelm Brasse (1917–2012) photographer, Auschwitz prisoner - Tadeusz Wrona (born 1954), aviator - Tomasz Adamek (born 1976), boxer - Piotr Haczek (born 1977), athlete - Agata Wróbel (born 1981), weightlifter - Tomasz Jodłowiec (born 1985), footballer Twin towns – sister cities [edit]Żywiec is twinned with:[21][22][23][24] - Adur, England, United Kingdom - Čadca, Slovakia - Feldbach, Austria - Gödöllő, Hungary - Liptovský Mikuláš, Slovakia - Opava, Czech Republic - Riom, France - Storuman, Sweden - Szczytno, Poland - Unterhaching, Germany References [edit]- ^ \"Population. Size and structure and vital statistics in Poland by territorial division in 2019. As of 30th June\". stat.gov.pl. Statistics Poland. 2019-10-15. Retrieved 2020-03-21. - ^ \"Górale Żywieccy – Związek Podhalan\" (in Polish). Retrieved 2022-02-12. - ^ a b \"Żywiec\". Archived from the original on 2009-04-29. Retrieved 2010-02-05. - ^ \"Heineken International\". Archived from the original on 2009-12-19. Retrieved 2010-02-05. - ^ \"Tablica pamiątkowa wymarszu Legionistów (1934)\". PolskaNiezwykla.pl (in Polish). Retrieved 15 May 2021. - ^ Kowalski, Andrzej (1995). \"Miejsca pamięci związane z Bitwą Warszawską 1920 r.\". Niepodległość i Pamięć (in Polish) (2/2 (3)). Muzeum Niepodległości w Warszawie: 173–174. ISSN 1427-1443. - ^ Tomasz Terteka. \"Żywiec pamięta\". Watra.pl (in Polish). Retrieved 15 May 2021. - ^ Mirosław Sikora (20 September 2011). \"Saybusch Aktion - jak Hitler budował raj dla swoich chłopów\". OBEP Institute of National Remembrance, Katowice (in Polish). Redakcja Fronda.pl. Retrieved May 5, 2012. - ^ Wardzyńska, Maria (2017). Wysiedlenia ludności polskiej z okupowanych ziem polskich włączonych do III Rzeszy w latach 1939-1945 (in Polish). Warszawa: IPN. p. 434. ISBN 978-83-8098-174-4. - ^ Etlin, R. A., John. Art, culture, and media under the Third Reich. Chicago: Chicago University Press, 2003. - ^ Wardzyńska, p. 438 - ^ a b c d \"Krwawa bitwa o Żywiec w 1945 roku\". BBFan.pl (in Polish). 2025-02-16. Retrieved 2025-07-20. - ^ a b c d e \"Kwiecień 1945 roku...\" muzeum-zywiec.pl (in Polish). Retrieved 2025-07-20. - ^ \"Rys historyczny miasta Żywiec\". zywieckiecentrumturystyki.pl. Retrieved 2025-07-20. - ^ \"Ustawa z dnia 28 maja 1975 r. o dwustopniowym podziale administracyjnym Państwa oraz o zmianie ustawy o radach narodowych\". isap.sejm.gov.pl. Retrieved 2025-07-20. - ^ a b Kurczonek, Paweł (2024-11-26). \"Żywiec w PRL-u. Jak Jezioro Żywieckie i miasto wyglądały przed laty? Zobaczcie zdjęcia w kolorze. Pamiętacie te miejsca?\". Dziennik Zachodni (in Polish). Retrieved 2025-07-20. - ^ \"Powodzie na Żywiecczyźnie\". zywiecinfo.pl (in Polish). 2014-05-17. Retrieved 2025-07-20. - ^ a b \"Powodzie na Żywiecczyźnie\". dbamyowode.pl (in Polish). 2022-08-31. Retrieved 2025-07-20. - ^ \"Strona internetowa klubu TS Czarni-Góral Żywiec\" (in Polish). Retrieved 15 May 2021. - ^ \"Strona T.S. Soła Żywiec\" (in Polish). Retrieved 15 May 2021. - ^ \"Miasta partnerskie\". zywiec.pl (in Polish). Żywiec. Retrieved 2020-03-21. - ^ \"Podpisanie umowy z Feldbach\". zywiec.pl (in Polish). Żywiec. 2017-08-07. Retrieved 2020-03-21. - ^ \"Partnerská a spolupracující města\". opava-city.cz (in Czech). Statutární město Opava. Retrieved 2020-03-21. - ^ \"Storumans kommun protokoll 2019-08-20\" (PDF). storuman.se (in Swedish). Storumans kommun. 2019-08-20. p. 18. Retrieved 2020-03-21. External links [edit]- Jewish Community in Żywiec on Virtual Shtetl Żywiec travel guide from Wikivoyage"
}