{
  "url": "https://www.hearth.com/talk/threads/tips-on-if-your-pellet-stove-is-burning-lazy-and-or-getting-smoke-in-the-house.11413/",
  "title": "Tips on if Your pellet stove is burning lazy and or getting smoke in the house | Hearth.com Forums Home",
  "text": "If you are getting smoke in the house or you stove just don’t seem to be burning like should. Check the door seal and latch for a tight fit. Check the ash pan for shut tight and latched If all doors seals are good and latched. MOST pellet stove are Negative air. (Inside of the Firebox is vacuumzed) If you don’t have the ash pan or door sealed less air will flow through the burn pot and you will have a tall lazy flame. You will see no visual change in the fire when you change the air control. Without a Magnahilic this is the best way to dial In air adjustment. With the stove on High and running for 15 minutes after start up. Push the air rod in. you will see a tall ugly lazy flame then [b}slowly[/b] pull the rod out as the flame comes down, more intense and be more yellow when the flame looks like it is not changing anymore stop pulling out. If you have sparks popping this is normal but you don’t want to see PELLETS popping out. If you get Brown or Grey soot on the glass and firebrick this is normal if you have BLACK soot on the firebrick and glass pull the air out a little more. Cant get much adjustment out of the air? The first thing to do is a good cleaning. Follow the cleaning steps in your manual. Clean out all the ashes in the burn pot and ash chambers. Some stoves this will require you to remove the refractory brick and the REMOVE baffle behind it. Photos here http://www.hearthtools.com/parts/adavantageII_clean.htm http://www.hearthtools.com/new_pa1.gif Scrap the heat exchange tubes or fins or clean with a Bottle or potato brush http://www.hearthtools.com/parts/whitcl1.jpg http://www.hearthtools.com/parts/buildupheatexchange.jpg http://www.hearthtools.com/parts/IMG00393-20091119-1328.jpg Check the placement of your burn pot and or burn pot liner. Make sure it sitting in the correct notches; Latches and push back were it belongs. Clean out the ALL Venting (flue pipe) and just because you think your pellet vent is clean? Have you looked where the vent connects to the stove? http://www.hearthtools.com/install/dirty_insert/images/IMG_1110.jpg Check the cap some times if you are adapting to wood stove pipe there will be a screen in the cap. http://www.hearthtools.com/parts/chimneycapplugged.jpg Check the door seal and latch for a tight fit. Check the ash pan for shut tight and latched Try the steps above if your stove still is not burning correctly then go on to some trouble shooting in your owners manual and or here https://www.hearth.com/talk/threads/13413/ Check the door seal and latch for a tight fit. Check the ash pan for shut tight and latched If all doors seals are good and latched. MOST pellet stove are Negative air. (Inside of the Firebox is vacuumzed) If you don’t have the ash pan or door sealed less air will flow through the burn pot and you will have a tall lazy flame. You will see no visual change in the fire when you change the air control. Without a Magnahilic this is the best way to dial In air adjustment. With the stove on High and running for 15 minutes after start up. Push the air rod in. you will see a tall ugly lazy flame then [b}slowly[/b] pull the rod out as the flame comes down, more intense and be more yellow when the flame looks like it is not changing anymore stop pulling out. If you have sparks popping this is normal but you don’t want to see PELLETS popping out. If you get Brown or Grey soot on the glass and firebrick this is normal if you have BLACK soot on the firebrick and glass pull the air out a little more. Cant get much adjustment out of the air? The first thing to do is a good cleaning. Follow the cleaning steps in your manual. Clean out all the ashes in the burn pot and ash chambers. Some stoves this will require you to remove the refractory brick and the REMOVE baffle behind it. Photos here http://www.hearthtools.com/parts/adavantageII_clean.htm http://www.hearthtools.com/new_pa1.gif Scrap the heat exchange tubes or fins or clean with a Bottle or potato brush http://www.hearthtools.com/parts/whitcl1.jpg http://www.hearthtools.com/parts/buildupheatexchange.jpg http://www.hearthtools.com/parts/IMG00393-20091119-1328.jpg Check the placement of your burn pot and or burn pot liner. Make sure it sitting in the correct notches; Latches and push back were it belongs. Clean out the ALL Venting (flue pipe) and just because you think your pellet vent is clean? Have you looked where the vent connects to the stove? http://www.hearthtools.com/install/dirty_insert/images/IMG_1110.jpg Check the cap some times if you are adapting to wood stove pipe there will be a screen in the cap. http://www.hearthtools.com/parts/chimneycapplugged.jpg Check the door seal and latch for a tight fit. Check the ash pan for shut tight and latched Try the steps above if your stove still is not burning correctly then go on to some trouble shooting in your owners manual and or here https://www.hearth.com/talk/threads/13413/"
}