{
  "url": "https://www.apollotheater.org/",
  "title": "90 Years of the Soul of American Culture | Apollo Theater",
  "text": "Join THE A-LIST Celebrating over 90 Years of Black Culture, Creativity, and Community! PLAN YOUR VISIT Get behind-the-scenes access to the place “Where Stars are Born and Legends are Made!” tour the apollo The Apollo has served as a testing ground for new artists, and as a place to celebrate life moments and cultural revolutions. Bring your next performance, fashion show, television or photo shoot to The Apollo. rent the apollo ABOUT A Legacy of Culture The Apollo is an American cultural treasure. It is a vibrant non-profit organization rooted in the Harlem community that engages people from around New York, the nation, and the world. Since 1934, The Apollo has celebrated, created, and presented work that centers Black artists and voices from across the African Diaspora. It has also been a catalyst for social and civic advocacy. Today, The Apollo is the largest performing arts institution committed to Black culture and creativity. The Apollo is an American and global cultural and creative catalyst, dedicated to amplifying Black artistic excellence, innovation, and community through transformative performances, education, and advocacy. The Apollo envisions a new American canon centered on contributions to the performing arts by artists of the African diaspora, in America and beyond. The Apollo is led by a predominantly Black and women-led executive team, steered by Michelle Ebanks, the organization’s President and CEO. She succeeded Jonelle Procope, who helmed The Apollo for nearly two decades. The Apollo is an American and global cultural and creative catalyst, dedicated to amplifying Black artistic excellence, innovation, and community through transformative performances, education, and advocacy. The Apollo envisions a new American canon centered on contributions to the performing arts by artists of the African diaspora, in America and beyond. The Apollo is led by a predominantly Black and women-led executive team, steered by Michelle Ebanks, the organization’s President and CEO. She succeeded Jonelle Procope, who helmed The Apollo for nearly two decades. Apollo Education Support The Apollo Celebrate the past, present, and future of Black art and creativity. Your generosity enables The Apollo to fulfill its mission and sustain its legacy of excellence."
}