{
  "url": "https://ell.stackexchange.com/questions/361008/which-is-the-proper-way-just-only-or-only-just",
  "title": "word choice - Which is the proper way (Just only) or (only just)? - English Language Learners Stack Exchange",
  "text": "Neither I agree with DJ Clayworth's answer; for your purposes using both just and only is probably redundant, and not the kind of redundancy that is idiomatic, but the kind that a native speaker would not use. In choosing whether you want to use \"just\" or \"only\", there is a slight difference in meaning, modified by where they are placed. I'm assuming here you are talking about entertainment, and what is being 'produced' here is \"hits\", \"acts\" or \"singles\" or something like that. In this case (1): I don’t want be a top producer; I just want to produce what’s on top. 'Just' here lessens what follows (as Ben Murphy says). This literally means: (1) Being a top producer is too lofty a goal, and my ambition is less than that, it is to produce what's on top. You might be using that literally, or ironically if producing what's on top is actually considered higher than being a top producer. Or, you might mean (2): I don’t want be a top producer; I want to produce just what’s on top (or) I don’t want be a top producer; I want to produce only what’s on top Both of these mean the same thing, but something different from (1). Here (2) there is no greater and lesser comparison between the two phrases. I am stating that I don't want to be a top producer, and independent of that non-goal, what I do want is to have the things I produce all be on top. I don't want to produce anything that is not on top. Thus in (1), 'just' is comparing the two goals, while in (2) 'just' or 'only' is narrowing or making more exclusive the second goal. Now I could use 'only' in the first position (3): I don’t want be a top producer; I only want to produce what’s on top. This is grammatically correct, but vague - it might mean (1) or (2) but it is impossible to know which without some context. In speech, you can add some emphasis to the words that would help, but in writing your reader has to guess your meaning based on context alone. Finally, you could mean both (1) and (2) - maybe you want everything you produce to be on top, but you consider that to be a lesser goal than being a top producer (and you are probably being ironic). In that case, you should use both words, and they would not be redundant: I don’t want be a top producer; I just want to produce only what’s on top."
}