{
  "url": "https://www.tsp.gov/tsp-mobile-app/",
  "title": "The TSP Mobile App | The Thrift Savings Plan (TSP)",
  "text": "The TSP Mobile App The TSP at your fingertips With the TSP Mobile App on your personal device, you can access your TSP information anywhere, anytime. Download the TSP Mobile App from the Apple App Store and the Google Play Store, the only authorized sources for our app. Convenience and security With the TSP Mobile App, you can access your account quickly and securely with your fingerprint or facial recognition on compatible devices that support biometric authentication. When you first download the app, youâll log in the same way you would log in to My Account on the TSP website. Then you can manage this security feature in the TSP Mobile App settings. When you log in, youâll find your account summary and investment information in one place with convenient navigation to useful tools and features. Track your savings goals. Update your profile information. Request transactions easily and securely. Answers to your TSP questions, anytime The TSP Mobile App gives you access to TSP support around the clock with our virtual assistant, AVA. AVA is designed to give you the information you need and, when youâre logged in, will personalize answers to your questions about your TSP account. For even more support, AVA can even connect you to a ThriftLine Representative during business hours, Monday through Friday, 7:00 a.m. to 9:00 p.m. eastern time. Tools you need for the future you want The TSP Mobile App gives you access to TSP support around the clock with our virtual assistant, AVA. Whatever your financial goals for the future, the TSP is here to give you the tools you need to achieve them. Along with checking your account balance, tracking fund performance, and making transaction requests, youâll be able to use the TSP Mobile App to sign and submit forms and documents, change your investment mix, scan rollover checks, and more. Download the TSP Mobile App today With the TSP Mobile App, youâre able to do just about everything you can do when you sign in to My Account on the TSP website. Try it today! Note: You need a My Account login to use the TSP Mobile App."
}