{
  "url": "https://forums.terraria.org/index.php?threads/new-official-terraria-wiki-launches-today.111239/",
  "title": "New Official Terraria Wiki Launches Today! | Terraria Community Forums",
  "text": "Greetings Terrarians! The Terraria Wiki has been a valuable resource to players everywhere over the nearly 11 years(!) of Terraria's history. With so much content to explore, having such a comprehensive summary of everything at your fingertips is simply fantastic. The Wiki has undergone quite a few changes over the years from its beginnings alongside Terraria Online all the way to the current iteration run by Fandom. Throughout that time, we have been so fortunate to work with a lot of awesome partners in order to evolve and maintain a strong wiki for our fans. The time has come for the next step on the Terraria Wiki evolutionary journey! Starting today, Re-Logic is proud to announce that we are launching a new location and partner for the Official Terraria Wiki! Moving forward, we will be partnering with the good folks at Freedom Games as one of the first games in their newly-launched wiki network. The new URL will be terraria.wiki.gg - and you can click on the image above to head there now! You can also now access the wiki from the main menu on PC: We are making this move primarily to be able to have greater creative control over the appearance, ad content, etc. of the wiki in order to bring things together in a more consistent way for the long term. As in the past, Re-Logic receives nothing (revenue, etc) from the wiki - our involvement here is strictly to maximize the experience for the Terraria fans. Why these folks in particular? Well, at a high level, these were the actual individuals whom were responsible (with a lot of community help, of course!!!) for building the amazing wiki that we have had over the years. For example, many of you may know or recall @ReedemtheD3ad! from the Gamepedia wiki days. He is on point to help run this new wiki effort with Freedom Games, so we feel like things are in good hands here! The Fandom wiki will remain in place as a second unofficial Wiki, and on speaking to them, it is their intent to keep it up and fully operational. So what does this mean for you, the player? WHAT'S DIFFERENT? - Re-Logic has long wanted to further establish a more common \"style\"/look and feel across the various sites and ways in which our fans interact with Terraria. So, we have carried that through here by utilizing the style elements from our website and from our forums. In the future, we may explore \"themes\" like we have on the forums (Corruption, Crimson, Snow, etc) - but for now, we have used the base \"Terraria\" default theme as our basis. - Ads should be less obtrusive - we are actively avoiding some of the more problematic approaches here, which we have heard are an issue loud and clear from our community. - Ads will be \"in-house\", Freedom Games do not use a third party service like Google and they receive no direct revenue, they simply point to games that they publish. - Our ability to make changes - from our own ideas or from community feedback - will be exponentially higher. Simply put, we have more control now... which means so do you. - With a much closer relationship than in the past, we hope that this will mean faster updating as new content, etc. arrives. - We will be adding a link to the wiki from inside the game on PC. This already exists on Console/Mobile, but all links will be updated as soon as possible. WHAT REMAINS THE SAME? - The starting point for the new Official Terraria Wiki will be the current form of the past wiki. You will find all of the old information there - so no need to reinvent the wheel or be worried that the important tip for how to beat that seemingly-impossible boss will be gone. We have done our best to ensure that all of that information made the journey over. - As mentioned above, the top management team of the Gamepedia wiki days are here... so there are some very familiar faces. Don't be a stranger! - The rules, etc. should be more or less the same as in the past. - The Fandom Wiki will continue to be in place as it has in the past - we do not have any issues with this, and think it will remain as a good additional option for folks. WHAT DO WE NEED FROM YOU? - We need your help in establishing our new Official Terraria Wiki as the place to go for Terraria information! Make it your go-to spot, update your favorites, and be sure to link to/from the new wiki when chatting with each other about Terraria! - We need your help in editing and creating new content for the Wiki as time moves on. - Most importantly, we need your feedback! The enhanced ability to make tweaks and changes, etc. means nothing unless we are making it a better wiki for all of you. We have created a special thread here on our Forums for you to provide that feedback. Alternatively, you can join in on the discussion directly with the team over at the Official Terraria Wiki Discord. The team will be sure to read and consider everything you suggest. That's it, everyone - we hope that this feels like a good move for the Terraria Community in the long term. Once we get through this initial transition phase, we look forward to helping to provide an amazing Terraria Wiki experience that will better serve you all for years to come! Have any questions or concerns? Leave us a note here in this thread. Cheers! Last edited:"
}