{
  "url": "https://en.wikipedia.org/wiki/Haribo",
  "title": "Haribo - Wikipedia",
  "text": "Haribo Haribo GmbH & Co. KG, doing business as Haribo (English: /ˈhærɪboʊ/ HARR-ib-oh, German: [ˈhaːʁiboː]; stylized in all caps), is a German confectionery company founded by Hans Riegel Sr. It began in Kessenich, Bonn, Germany. The name \"Haribo\" is a syllabic abbreviation formed from Hans Riegel Bonn.[1] The company created the first gummy candy in 1922 in the form of little gummy bears called Gummibärchen. The current headquarters are in Grafschaft, Germany.[2][3] History [edit]On 13 December 1920, the company was registered in the commercial register by its founder Johannes Riegel. In 1921, his wife Gertrud Riegel was the company's first employee.[4] According to the company, Riegel's seed capital was a sack of sugar, a copper pot, a marble slab, a stool, a stonewalled stove and a roller. In the same year, he bought a house that was located in the Kessenich district of Bonn, on a street called Bergstraße. The house was Haribo's first production facility.[5] Two years after the company's founding, Hans Riegel invented the precursor of the Goldbear, which was still called Tanzbär (Dancing Bear) at that time. However, it was not only bigger than the present gummy bears, but also softer, due to the use of gum arabic instead of the now common gelatine.[6][7] In 1925, Haribo began producing licorice products. The sales organization in Germany and the main building of the new production facility were established at the beginning of the 1930s.[7] According to the company, production fell immensely during the Second World War, partly due to a shortage of raw materials. In 2000, Haribo was suspected of having employed forced labourers during this war. However, the manufacturer denied this and consequently refused to pay into the forced labour fund.[8] After Johann Riegel's early death in March 1945, the company was initially continued by his wife. After sons Hans and Paul returned from captivity in 1946, they took over its management.[9] Hans Riegel Junior represented the company externally, while Paul Riegel headed research and product development and hardly ever appeared in public.[10] In 1957, Haribo took over the Godesberg company Kleutgen & Meier, where Hans Riegel Senior had had his first job. In 1961, Haribo took over Bonera Industrie en Handelsmaatschappij NV in Breda and continued to run it as Haribo Nederland BV.[11] In the 1960s, a new headquarters building opened in Bonn.[12] In 1967, Haribo acquired shares in the French confectionery factory Lorette, in Marseille, which was renamed Haribo-France SA. In 1987 it merged with the southern French manufacturer Ricqles Zan to form Haribo Ricqles-Zan with production facilities in Marseille, Uzès and Wattrelos. The company's only small factory museum is also located at the Uzès site.[13] In 1968, Haribo bought shares in the Solingen company Dr. Hillers, eventually taking it over completely in 1979. From 1980 onwards, a new production facility was built at the site in three expansion phases. In October 2011, the Solingen location was expanded to include a high-bay warehouse, an office building and a goods handling hall.[14] Haribo has since expanded its operations, taking over many local confectionery manufacturers around the world. It began international expansion in the 1960s and entered American markets in the 1980s. In 1986, the company bought the production and rights to the Maoam candy[15][16][17] and Haribo Chamallows (formerly \"Dulcia\"). As of 2013, it operated 16 factories which produce over 100 million gummy bears per day.[18] The company headquarters remained in the Kessenich district of Bonn until, in May 2018, it was relocated to the municipality of Grafschaft in Rhineland-Palatinate. Bonn continues to be a production location.[19] In October 2003, Hans Riegel Junior announced that one of his nephews, Hans-Jürgen Riegel (* 1956), would be his successor. He managed the company in France until 2005, but then fell out with his uncle and left the company.[20] Co-owner Paul Riegel died unexpectedly on the night of 3 August 2009.[21] After the relationship with his nephew broke down, Hans Riegel decided to leave the question of succession open. This led to a conflict between the Haribo family tribes, as Paul Riegel's sons pursued a complaint to the Chamber of Commerce and Industry that had been initiated by their father in the summer of 2008 to clarify the legal issues. After their temporary suspension, an overall amicable solution was finally developed and presented in 2010.[22] Haribo-Holding GmbH & Co. KG was then re-established. The Paul Riegel Family Holding and the Hans Riegel Holding, which were newly founded for this occasion, each have a half stake.[20][22][23] At the same time, two intermediate holding companies were created below the new parent company to bundle the German business on the one hand and the international business on the other. Hans-Guido (* ~1966), Paul Riegel's son from his first marriage, became, like his father, managing director for production and technology alongside his uncle Hans, who continued to look after marketing and sales. Hans-Arndt (* ~1968), Paul Riegel's son from his second marriage, took over the chairmanship of a new four-member supervisory board.[20][22][24] Long-time employee Andreas Nickenig (* ~1968), who was considered Hans Riegel's foster son and got along well with Paul's sons of the same age, also had a strong role in managing the foreign business.[22] Hans Riegel died during recovery following the removal of a brain tumour on 15 October 2013. His position was filled by the Hans Riegel Foundation, which was created in 1987 and is now headed by Reinhard Schneider, authorized representative and also a long-time employee of Hans Riegel.[23][25][26] Present [edit]Haribo employs around 7,000 people at four plants in Germany and ten more in other European countries. As of June 2003, Haribo products were distributed in more than a hundred countries. In 2008, the Federal Cartel Office initiated proceedings against the company and other confectionery manufacturers for illegal price fixing.[27] In 2012, the Federal Cartel Office imposed a fine of a total of 2.4 million euros on Haribo and a responsible sales employee. The reason was anti-competitive agreements with competing companies in which information on negotiations with retailers were exchanged.[28] Relocation of the company headquarters [edit]Since 2005, there has been public speculation about the company's plans to relocate the Bonn location with its 1,300 employees because expansion are no longer possible there. The Rhineland-Palatinate town of Gelsdorf (community of Grafschaft) and its North Rhine-Westphalian neighboring town of Rheinbach were discussed as new locations.[29][30][31] In April 2018, the company moved its head office from Bonn to Grafschaft. Some factory capacity remained in Bonn.[12] Goldbears [edit]Goldbears are fruit gums in the shape of stylized bears, that are two centimetres in size and consist of sugar, sugar syrup, colourants and flavourings. They also contain acidifiers, coating agents, water and a gelatin mixture, which gives the bears their rubbery consistency. Since 1960,[32] Haribo calls its gummy bears Goldbears in order to distinguish them from other manufacturers' products. In 2005, Haribo produced about 100 million Goldbears daily in 15 factories throughout Europe to ensure the distribution in over 100 countries. The Goldbears account for Haribo's largest revenue share. According to the company, their brand awareness in Germany is 99 percent and the Goldbear stands for childlike happiness.[33] For the German market, they are coloured with natural fruit extracts, in contrast to the use of colorants in the past. Although there are enough possibilities today to create a shade of blue, making the production of blue Goldbears possible, the Haribo management does not want to make any changes to the traditional product. In August 2007, the product range was partly changed by adding apple as a new flavour and giving it a green colour. The strawberry flavour, which was hitherto assigned to green, was recoloured to light red. Additionally, the shape of the Goldbears was slightly changed, compared to the former generations, by giving them a smiling face.[34] Devoted to the UEFA Euro in 2008, Haribo produced Schwarz-Rot-Goldbären: a black, red and yellow Goldbear mix. The mix, which was inspired by the colour combination of the German flag, contained the flavours blackcurrant (black), raspberry (red) and lemon (yellow). For the first time, Haribo developed black Goldbears, which, besides blackcurrant, also contained elder extract.[citation needed] On the occasion of the FIFA World Cup in 2014, Haribo produced the Goldbären-Fan-Edition. This mix included gummi bears in cherry (dark red), grapefruit (red), watermelon (green), woodruff (dark green) and apricot (orange) flavor as well as blue Goldbears in blueberry flavor.[citation needed] A zero sugar version of the gummy bears was discontinued because people got diarrhoea because of maltitol. [citation needed] There is a halal version of Haribo Goldbears in various countries (including the United Kingdom) which is imported from Turkey, where it is manufactured using beef gelatin which is permissible if slaughtered accordingly to Islamic dietary laws which uses the dhabihah method. They have the halal certification on the packaging.[35] UK presence [edit]Haribo entered the UK sweets market by buying Dunhill's in 1972, a manufacturer of liquorice Pontefract cakes which was founded in the 18th century.[36][37] Haribo's key brands in the UK are Starmix, Tangfastics, Supermix and Maoam, with Maoam being a brand of chewy sweets being bought in 1986 from Edmund Münster, the original manufacturer when it was launched in Germany in 1931.[38][39] They were once the distributor of Pez products in the United Kingdom, but this is no longer the case. Haribo makes Pontefract Cakes at their factory in Pontefract, West Yorkshire, and other locations. The company owns seven shops in the UK located in Pontefract, the West Midlands, York, Cheshire, East Midlands, Somerset, Kent and Hampshire.[40][41] US presence [edit]Haribo had been first imported locally in Hawaii and California in 1972, but between 1977 and 1979 it was later officially expanded nationwide.[42][43][44] When Haribo of America was incorporated in the 1980s in Baltimore, Maryland, Haribo's gummi candies were introduced to the US mass market through retailers such as drugstores, grocery stores and discount stores. The packaging was translated into English, and package weights were adjusted to match US sizes. A laydown bag was used for US supermarkets, instead of the hanging bag commonly found in German supermarkets, and a boxed product was developed for theaters.[citation needed] Sales soared the first year, and gummi bears became so popular in the US that the US market was soon flooded with competitors such as German Trolli and American Black Forest.[citation needed] In 2015, Haribo of America moved to Chicago and established their headquarters in Rosemont, Illinois. On 23 March 2017, Haribo announced the opening of its first US factory, a 500,000-sq-ft (46,500 m2), 400-employee manufacturing plant in Kenosha County, Wisconsin, Gilbane Building Company started construction in 2020.[45] In 2023, the US factory started production[46] and began producing Goldbears.[47] International distribution [edit]Haribo plans to expand into China, where it has launched test stores in Shanghai and Guangdong province. New production facilities opened in Castleford, West Yorkshire.[48] In 2016, the company opened its first factory outside Europe, located in Brazil.[49] Slogans [edit]Haribo's German catchphrase is \"Haribo macht Kinder froh – und Erwachsene ebenso\" (\"Haribo makes children happy – and adults as well\").[50] The German advertisements starred Thomas Gottschalk from 1991 until 2015. In English-speaking countries, it uses the slogan \"Kids and grown-ups love it so – the happy world of Haribo\".[51] In Hungary, it uses the slogan \"Gyermek, felnőtt kedve jó – édes élet, Haribo\" (\"Child and adult is happy – sweet life, Haribo\"). \"Haribo c'est beau la vie, pour les grands et les petits\" (\"Haribo life is beautiful, for big ones and little ones\") is used in France, while in Italy the song used during commercials is: \"Haribo è la bontà, che si gusta ad ogni età\" (\"Haribo is the delicacy that one can taste at any age\"). In Turkey, it uses the slogan \"Çocuk ya da büyük ol, Haribo'yla mutlu ol\" (\"Be a kid or a grown up, be happy with Haribo\"). In Denmark, it uses the slogan \"Luk op for noget godt! Luk op for Haribo! Den er go'\" (\"Open for something good! Open for Haribo! It is good\"). In Spain \"Vive un sabor mágico, ven al mundo Haribo\" (\"Experience a magical flavour, come to Haribo's world\") slogan is used. Similar slogans are used in other languages. The Haribo jingle music was created by UK composer Stephen Lee Vickers.[52] References [edit]- ^ Roberts, Emma (21 July 2018). \"Why is Haribo Called Haribo | Rewind & Capture\". Retrieved 6 January 2021. - ^ Myers, Dan (6 November 2015). \"5 Things You Didn't Know About Haribo Gummy Bears\". The Daily Meal. - ^ \"Milestones throughout Haribo's unique success story\". Haribo. - ^ \"100 Jahre Haribo: Von der Hinterhof-Waschküche zum Weltmarktführer\". Haribo.com. Retrieved 23 January 2021. - ^ \"Firmengeschichte von Haribo\". berufsstart.de. - ^ Opdenhövel, Matthias; Hugendubel-Doll, Steffi (2012). Flipflops, iPod, Currywurst: wer hat's erfunden? (1. Aufl ed.). München: cbj. ISBN 978-3-570-13621-8. - ^ a b \"Hans Riegel | Portal Rheinische Geschichte\". www.rheinische-geschichte.lvr.de (in German). Retrieved 19 March 2024. - ^ Berlin, CHARLES P. WALLACE (31 July 2000). \"The Final Reckoning\". Time. ISSN 0040-781X. Retrieved 19 March 2024. - ^ \"Zeitreise Haribo\". General-Anzeiger Bonn (in German). 8 December 2020. Retrieved 19 March 2024. - ^ \"Haribo: Dr. Hans Riegel verstorben\". Cash.at (in German). Retrieved 22 March 2024. - ^ \"Gummibärchen-Produzent: Haribo feiert heute 98. Geburtstag\". General-Anzeiger Bonn (in German). 13 December 2018. Retrieved 22 March 2024. - ^ a b \"Haribo is leaving Kessenich – almost\". General-Anzeiger. 15 May 2018. Retrieved 28 March 2024. - ^ Wirtschaftswoche (2 July 2014). \"Süßwarenriese: Haribo verlässt Bonn\". www.wiwo.de (in German). Retrieved 22 March 2024. - ^ \"HARIBO eröffnet vollautomatisches Hochregal-/Fertigwarenlager in Solingen\" (in German). 20 October 2013. Archived from the original on 20 October 2013. Retrieved 26 March 2024. - ^ \"Die bunte Welt von Haribo\" (PDF). Haribo.com (in German). Archived from the original (PDF) on 9 July 2007. Retrieved 17 February 2022. - ^ Assor, Constance (19 October 2016). \"La guerre des bonbons est déclarée\". Le Point (in French). Archived from the original on 28 January 2018. Retrieved 17 February 2022. - ^ \"Diese Slogans sind unvergessen!\". Bild (in German). 26 June 2016. Archived from the original on 25 June 2018. Retrieved 17 February 2022. - ^ Oltermann, Philip (13 October 2013). \"Haribo: the confessions of a confectionery addict\". The Guardian. Retrieved 30 July 2015. - ^ \"Haribo hat Firmensitz verlegt: Bonn ist nicht mehr Goldbären-Hauptstadt\". Kölner Stadt-Anzeiger (in German). 15 June 2018. Retrieved 26 March 2024. - ^ a b c \"Familienunternehmen: Haribo macht Neffen froh\". Der Tagesspiegel Online (in German). ISSN 1865-2263. Retrieved 26 March 2024. - ^ \"Freie Honnefer & Rhein-Onliner » Freie HONNEFER - Das Magazin\". www.freiehonnefer.de. Retrieved 26 March 2024. - ^ a b c d \"Hans Riegel hat den Machtkampf verloren. Nach seinem Tod werden die Neffen das Sagen haben\" (PDF). Managermagazin (in German). Retrieved 26 April 2024. - ^ a b Böschen, Mark (3 September 2010). \"Neue Unternehmensstruktur: Friedensvertrag im Reich der Goldbären\". www.manager-magazin.de (in German). Retrieved 26 April 2024. - ^ \"IHK erweist Haribo-Chef Bärendienst\". Financial Times (in German). 7 September 2010. Archived from the original on 7 September 2010. Retrieved 26 April 2024. - ^ \"Personen\". www.hans-riegel-stiftung.com (in German). Retrieved 2 May 2024. - ^ \"Impressum\". www.hans-riegel-stiftung.com (in German). Retrieved 2 May 2024. - ^ \"Verdacht auf Preisabsprachen: Kartellamt ermittelt auch gegen Haribo\". Der Spiegel (in German). 11 February 2008. ISSN 2195-1349. Retrieved 6 May 2024. - ^ \"Mars als Kronzeuge: Kartellamt verhängt Millionen-Strafe gegen Haribo\". Der Tagesspiegel Online (in German). ISSN 1865-2263. Retrieved 6 May 2024. - ^ \"Der neue Haribo-Innovationspark: Grafschaft wird neue internationale Zentrale\". General-Anzeiger Bonn (in German). 26 October 2015. Retrieved 6 May 2024. - ^ \"Hans Riegel sondiert Terrain\". Lebensmittel Zeitung (in German). Retrieved 6 May 2024. - ^ \"Stadt Bonn: \"Haribo bleibt in Bonn\"\". Archived from the original on 23 September 2015. Retrieved 6 May 2024. - ^ Opdenhövel, Matthias; Hugendubel-Doll, Steffi (2012). Flipflops, iPod, Currywurst: Wer hat's erfunden?. Munich: cbj Kinderbücher Verlag. pp. 124–125. ISBN 978-3-570-13621-8. - ^ Amann, Susanne; Kühn, Alexander (2018). \"Haribo ist ein demokratisches Produkt, es muss aber nicht politisch sein\". Der Spiegel (36): 62–64. - ^ \"Haribo Produkte: Da steckt viel Freude drin\". Haribo. Retrieved 23 January 2021. - ^ Myers, Dan (6 November 2015). \"5 Things You Didn't Know About Haribo Gummy Bears\". The Daily Meal. Retrieved 10 February 2024. - ^ \"Sweet deal for Yorkshire as Haribo announces new factory in Castleford\". Independent.co.uk. 10 October 2013. Archived from the original on 9 May 2022. Retrieved 23 August 2021. - ^ \"Liquorice companies in Pontefract and Castleford\" (PDF). Wakefield Council. n.d. Retrieved 23 August 2021.[permanent dead link] - ^ \"MAOAM\". maoam.com. Archived from the original on 19 July 2015. Retrieved 27 July 2015. - ^ \"Haribo's Maoam Website that includes the history of Maoam\". - ^ \"Our Stores\". Haribo. Retrieved 6 January 2021. - ^ \"Sweets lovers rejoice as Haribo is set to open first Hampshire store\". Daily Echo. 16 August 2023. Retrieved 31 August 2024. - ^ https://www.newspapers.com/search/results/?date=1972&iid=2270&keyword=Haribo. {{cite web}} : Missing or empty|title= (help) - ^ \"Historical Newspapers from 1700s-2000s - Newspapers.com™ - Newspapers.com\". - ^ https://www.newspapers.com/search/results/?date=1979&iid=2270&keyword=Haribo. {{cite web}} : Missing or empty|title= (help) - ^ \"Haribo selects Milwaukee firm as general contractor for Wisconsin factory\". candyindustry.com. Retrieved 6 January 2021. - ^ \"Haribo® Opens First Factory in U.S., Introduces New Gummi Innovation for Summer, Wild Berry Goldbears®\". prnewswire.com (Press release). Haribo. Retrieved 3 November 2023. - ^ \"FAQ\". Haribo.com. Retrieved 3 November 2023. - ^ \"Castleford Haribo plant to create 286 jobs\". BBC News. 10 October 2013. - ^ \"Localizada em Bauru, primeira fábrica da Haribo fora da Europa realiza festa de confraternização\". Social Bauru. 16 March 2025. - ^ Jeurissen, Bart (25 March 2021). \"grapefrute.com - Haribo, Spreading Happiness Worldwide\". grapefrute.com. Retrieved 14 November 2023. - ^ Davis, Chelsea. \"20 Fun Facts About Haribo, The Original Inventor Of The Gummi Bear\". Forbes. Retrieved 14 November 2023. - ^ Goldrich, Robert (24 July 2018). \"Quiet Storm Brings \"Kids Voices\" To Hard Rockers For Haribo\". SHOOT. Retrieved 14 November 2023. External links [edit]- Food and drink companies established in 1920 - Candy - Food and drink companies of Germany - Brand name confectionery - German brands - Companies based in Bonn - Companies based in Rhineland-Palatinate - Ahrweiler (district) - German confectionery - Gummi candies - 1920 establishments in Germany - German snack foods - Desserts - Confectionery companies of Germany"
}