{
  "url": "https://www.vava.com/products/4k-ultra-short-throw-laser-projector/",
  "title": "4K Ultra Short Throw Laser TV Projector- VAVA",
  "text": "VAVA 4K Laser TV Enjoy the ultimate home theater experience with adjustable 80”-150” Ultra HD Display, ALPD® 3.0, Harman Kardon speakers, and a smart Android TV system. - 7.2” ultra short throw projection distance - Up to 150” massive display - 4K UHD resolution with HDR10 - 1,800 ANSI Lumen brightness - 25,000 hour ultra long lamp life - Integrated 60w Harman Kardon speaker - Color: - White Pairs well with In stock! Ships within 3-5 business days. 30-day risk-free trial 12 Months Warranty Complimentary shipping & returns If you have any questions, you are always welcome to contact us. We'll get back to you as soon as possible, within 24 hours on weekdays. - Shipping Information Use this text to answer questions in as much detail as possible for your customers. - Customer Support Use this text to answer questions in as much detail as possible for your customers. - FAQ’s Use this text to answer questions in as much detail as possible for your customers. - Contact Us Use this text to answer questions in as much detail as possible for your customers. Easy Setup Short Throw, Large Projection - The 0.233:1 throw rate projects visuals from smaller proximity, giving you flexibility in positioning your projector. Advanced Eye Protection & ALPD 3.0 Supported Keep your eyes safe against radiation and fatigue with smart IR sensors and automatic dimming. It uses Appotronics’ renowned ALPD 3.0 laser light technology, bringing stunning visual depth in a compact and long-lasting projector. Advanced Laser Technology Long-lasting light bulbs with industrial-grade 25,000-hrs lamp life – 10 times longer than conventional bulbs. Smart Android TV System Easy to access and download a plethora of applications for endless entertainment. Full Connectivity With 3 HDMI ports, built-in WiFi capability, ethernet input, and more, you’ll have everything you need to get all your entertainment connected."
}