{
  "url": "https://dailyitalianwords.com/italian-word-for-love-amore/",
  "title": "What does \"amore\" mean? - The Italian word for \"love\" - Daily Italian Words",
  "text": "Perhaps a seductive signore (gentleman) or sassy signorina (miss) has swept you off your feet. Or maybe you are simply a sucker for romance. Whatever your reasons for wanting to learn how to express your romantic feelings in Italian, we are here to help you do it properly! The meaning of amore – The noun The Italian word for love is amore (masculine, plural: amori). Just like the English love, it means an intense feeling of affection for a person, but it can also be used for an animal or a passion: - l’amore per i figli (the love for one’s children) - l’amore per i genitori (the love for one’s parents) - l’amore per i gatti (the love of cats) - l’amore per il cinema (the love of cinema) - l’amore della mia vita (the love of my life) You can also use the word amore as a pet name for a person you love (a partner or child): - Ciao amore! (Hi love!) - Amore mio! (My love!) - È il mio amore. (He/She is my lover/love.) In some regions, amore can be shortened to the slang word amo‘: Allora che facciamo amo’, andiamo? So what are we doing love, are we going? Where Italian differs from English is that amore can’t be used for friends or members of the family such as uncles or cousins, unless it is intended as a joke. Adults may use it to express affection towards children who are not their own but with whom they are well-acquainted however. Example: a child shows a drawing he just made to his mum’s best friend: Guarda che cosa ho fatto. – Oh amore, ma che bel disegno, sei molto bravo! Look what I made. – Oh love, what a beautiful drawing, you’re really good! In certain countries like the UK, the word love is also used to greet a stranger. For example, someone who has just walked into a coffee shop might be welcomed by the owner with something along the lines of “You all right, love? “. In Italy, amore is not used in this sense – it would sound really strange! Once again it can be used as a joke or as a means of provocation or mocking someone. For the plural form of love, you replace the last letter “e” with “i”: amori. This word can be used when talking about multiple romantic affairs or relationships, or as a reference to a number of people for whom you have profound affection such as your children: Non ho mai dimenticato i miei amori passati. I’ve never forgotten my past romances. Siete i miei amori, i miei tesori, vi amo tanto! You are my loves, my treasures, I love you very much. Another way to talk about romantic relationships is to use words such as storie d’amore, storie amorose, or just storie. Ha avuto un sacco di storie amorose quando era giovane. He/she had a lot of romantic relationships when he/she was young. Ho avuto una storia con lei qualche anno fa. I was in a relationship with her a few years ago. Using the word storie can be useful to suggest a more serious relationship, whereas amori may be used to describe a more fleeting love story or even an affair depending on the context: - Gli amori di Casanova = The love affairs of Casanova. The meaning of amare (to love) – the verb Now that you know the meaning of amore, let’s take a look at amare, which is the verb “to love“. It is very similar in spelling to amore – all you need to do is replace the letter “o” with another “a”. To express your feelings in the first person, you can say Ti amo (I love you). And if you’re really crazy about that person: Ti amo da morire! I love you to death! Another way to express a romantic interest in someone is to say mi piace (I like him/her), or mi piaci (I like you). This is used when you start to develop feelings for someone or when you start to go out with him/her in the hope of taking the relationship further. You can also use it to make an assessment of someone’s character. If you ask your best friend what he or she thinks of a person you both met the other day, they can respond with: Mi sembra una ragazza per bene, mi piace. She looks like a good girl, I like her. The verb amare mainly refers to the love between partners (girlfriend, boyfriend, partner, spouse or wife). You wouldn’t say ti amo to a family member or a friend, unless you intended it as a joke. If you want to express loving feelings towards a friend or family member, phrases such as ti voglio bene (literally ‘I want good to you’) or ti adoro (I adore you) are more appropriate. It’s not unheard of for people to say Amo mio zio (I love my uncle) to really emphasise the deep feelings you have for that family member, but it is much less common. You can use the verb amare in addition to adorare and piacere in reference to a passion such as a sport, musician or film. The verb adorare has a similar meaning, whereas piacere is less intense. Adoro la trilogia del Signore degli Anelli! I love the Lord of The Rings’ trilogy! Amo giocare a calcio! I love playing football! Mi piace guardare la Formula 1. I like watching Formula 1. Additional Italian vocabulary There are other words that are based on amore and can signify different things: - amoreggiare verb (to flirt) - amoreggiamento noun, masculine (making out, fooling around) - amorevole adjective (loving, caring) - amorevolezza noun, feminine (affection, care) - fare l’amore expression (to make love) There is an adjective that is spelt in a similar way to amare, which is amaro. However its definition is completely different: it means bitter. Trivia You may have already come across the word amore if you’ve ever heard the famous song That’s Amore. Composed in 1953 by Harry Warren and written by Jack Brooks, it is one of the most popular songs performed by Dean Martin. And since we’re talking songs, why not end off with one by the Italian band 883 (my favourite as a child) called Una canzone d’amore (A love song). Mathieu Gasquet was born and raised in Turin in the north of Italy to an Italian mother and a French father. He provides the audio pronunciation for Daily Italian Words."
}