{
  "url": "https://www.reddit.com/r/redsox/?feedViewType=classicView",
  "title": "Reddit - The heart of the internet",
  "text": "IMAGE Abusive posts and comments will be removed at mods discretion. The r/RedSox community is a baseball community. Users should not be abusive or harassing towards other users. Insults, racism, homophobia, and sexism will not be tolerated. Use discretion on your comments or posts. Welcome the fans of opposing teams. We may not root for the same players, but we share a love of baseball. Opposing fans that come with respect deserve respect back. If opposing fans are in our game thread to watch the game, let them enjoy the game with us! We're better than those Yankee/Astros scums. Act like it! A terrible user blog is a blog that had contributions from the posting user. This also considers accounts that sole purpose is posting a certain blog. The only reason people post their blogs are for page views, which results in potential ad revenue or just acknowledgement. A majority of the blogs people post would be capable of being self-posts. Brigading other team subreddits is not tolerated on this subreddit. This rule covers going into other team subreddits and trolling or insulting their team/fans. This includes taunting, or trash talking in their sub. If proof is shown that you are deliberately inciting the other subreddit, you will be banned from r/RedSox. Trolls who come to r/redsox from other subs will be banned under this rule, too. Upvote parties and appreciation threads will be removed. The only exception is to give an appreciation thread and make it a quality submission. A quality submission needs elaboration on why they are to be appreciated. (Recent stats, underrated, opponents played) If an appreciation thread is \"Hanley Ramirez 3 Homers! Appreciation Thread!\" it will be removed. We are a subreddit that loves the Red Sox. We don't care about anything else. Every post must stay on topic. We don't want any fun here. Do not post more than once per week for your own user blog. If another user submits your blog, that is fine, but self-promoting more than once per week will result in a cooldown. Abusing this will result in a permanent ban on the domain. If you are worried about this rule, please contact the mods for any questions. Low effort or spammy posts will be removed. Examples of low effort posts are non-Red Sox gifs with a vaugely related title, static images of just a player's face with some comment about them in the title, etc. Original content with at least a little photoshopping or effort will be allowed, but what constitutes low effort for OC is up to moderator discretion. Game Threads are fun places to chat with others and enjoy the game. It's perfectly okay to point out flaws in the team, players, ownership, anything. However, if you're never here when we're winning and only come around to complain; if 90% of your comments are negative; or if all you post are stupid hot takes then you'll get a warning, then a temp ban or two, then it will be permanent. Unless you’re funny at that point and you’ll be reinstated. Promotion of piracy is against reddit's ToS. Just PM the links to each other. The topics of betting and gambling are fine with context. But we do not allow posts about advice on bets, betting odds, etc. Any betting posts that we allow will have to be unique and have effort put into it and be very related to the Red Sox, not just mentioning them in betting odds."
}