{
  "url": "https://www.earthtrekkers.com/best-things-to-do-in-capri/",
  "title": "10 Epic Things to Do in Capri (+ Map, Photos, Tips)",
  "text": "The island of Capri is one of Italy’s most popular coastal destinations. Taking a boat tour around the island, visiting the Blue Grotto, and riding the chairlift to the top of Monte Solaro are three of the best things to do in Capri, but in fact, the list is much longer. In this guide, we cover the top experiences in Capri and lots of important information you need to know before you go. About Our Experiences in Capri We have visited Capri on two different trips. The first was in 2014. We were on a trip around the world and traveling on a tight budget. Capri is an expensive place to visit and we questioned if a day trip to the island was even going to be worth it. Well, it was. We took a boat tour of the island, spent a few minutes inside of the Blue Grotto, and rode the chair lift to Monte Solaro. We spent quite a bit of money, but it was the highlight of our time in Sorrento and the Amalfi Coast. In 2022, Tim and I returned to Capri. On this visit, we also day tripped here from Sorrento, this time focusing more on the towns and viewpoints, since we already did the boat tour. We used a scooter to zip around the island and learned that there is a LOT to do here. Even with two trips to Capri and without repeating any experiences, we still couldn’t get to everything on our to do list. Which leads me to this…if you have limited time in Capri (either you are day tripping here from Sorrento, Positano, or Naples) or just have a day or two on the island, you will have to pick and choose what you want to do. In this guide, we list what we think are the 10 essential experiences to have in Capri. If you have more time here (2 or more days) you can continue on to our “With More Time” section. An Overview of Capri Capri is an island that is located in the Gulf of Naples. This small island is easily accessible from Naples, Sorrento, and Positano, with ferries running back and forth between these destinations many times of day. Capri is the name of the island. On the island are two towns: Capri and Anacapri. In this guide, when referring to the town of Capri, we call it “Capri town” for clarification. The island is very rocky. It is a beautiful place to go on a boat tour, to see the tall limestone cliffs plunging into the sea, the grottoes, and the sea stacks such as the Faraglioni Rocks. There are a few beaches on Capri, but these are small and tend to be very rocky. Capri has long been a popular destination for the rich and famous. With that, prices for everything on the island are expensive, so expect to pay more for a meal, or even a cocktail, then you would in many other places throughout Italy. A Brief Geography Lesson of Capri Before you visit Capri, it’s important to know where things are located. There are two towns on Capri: Capri and Anacapri. Marina Grande is the gateway onto the island and this is where you will enter Capri by ferry. Marina Grande is also the place where boat tours around the island begin. Getting around the island can be challenging. Some sights, such as Villa Jovis, requires a LOT of walking (about an hour and a half round trip), so for most people, it won’t be worth the effort. And others, like the viewpoint from Punta Carena, also take a while to get to. Below is a map of Capri. On this map, we highlighted the top sights in Capri, so you get an idea of where everything is located. Best Things to Do in Capri: On a Map Here is a second map of Capri. We labeled the top places to visit, plus a few notable restaurants. You can save this map into your Google account and all of these points will be added to your Google Map. How to Use This Map: Click the tab in the top left corner of the map to see a list of the points of interest and to turn layers on/off. Click the icons on the map to get more information about each point of interest. To take this map with you, click the star next to the title of the map which adds it to your Google account. Next, within your Google Maps app, select ‘Saved’ and then select ‘Maps’. This map title will now appear in your list. How to Get to Capri To get to Capri, you will take a ferry from Naples, Sorrento, or Positano. It’s also possible to get here by helicopter, but if you have that kind of money, you probably aren’t spending time on the internet researching what to do on Capri. From Sorrento From Sorrento, the ferry ride lasts 20 to 25 minutes and costs roughly €25. There are numerous companies that offer transportation to and from Sorrento, with multiple ferries arriving each hour of the day in Capri, from 7 am through the early evening. From our experience, there is not much different between the boats operated by the ferry companies. If you are prone to seasickness, you could schedule a ride on a hydrofoil, which tends to be a more stable boat. When booking your tickets, you can do so online in advance or at the ferry port. On our most recent visit, we booked our tickets one day in advance on Ferryhopper.com. This website lists the ferry schedule for all of the companies running between Sorrento and Capri and we picked the company offering the best time slot for our schedule, which happened to be SNAV. You can also look at each individual website, but Ferryhopper.com is easier to use and you can see all of your options, so it is also the most time efficient option. PRO TRAVEL TIP: If you know your dates of travel, I recommend booking your tickets in advance, because they can sell out. When we did this at the end of October on a Sunday, the later ferries were sold out and we came back on a 4:20 pm ferry. And this wasn’t even high season. From Naples Like Sorrento, there are frequent ferries running between Naples and Capri. The trip lasts 50 minutes and costs roughly €30. We recommend booking your tickets in advance using the Ferryhopper.com website. From Positano There are several ferries running back and forth between Positano and Capri. The journey lasts 30 minutes and costs about €28 one-way. We recommend booking your tickets in advance using the Ferryhopper.com website. Marina Grande How to Get Around Capri Visitors are not permitted to bring cars onto the island. To get around, you can take the bus, hire a taxi, take a boat tour, walk, ride the funicular and/or chair lift, or hire a scooter. Most likely, you will use a combination of these. What you choose to do affects the type of transportation you need. For each of the things to do on Capri that we list below, we also list how to get there, which is essential to know before you go. By Bus The buses on Capri are small, minibuses (since the roads are narrow and winding). There are bus stations in Marina Grande, Capri, Anacapri, Marina Piccola, the Punta Carena Lighthouse, and the Blue Grotto. For bus schedules and pricing, click here. By Taxi You can hire a taxi for the full day or just to get from one point to another. Taxi’s look like oversized, convertible cars. Taxi fares vary and you can learn more here. The Funicular There is a funicular that runs from Marina Grande to Capri. The town of Capri sits up in the hills and the funicular eliminates what would be a long, uphill walk into town. It runs every 15 minutes from early morning to 10 pm. In the afternoon, expect long lines to get back on the funicular, so budget time for this, or walk or take a taxi. The view from the top of the funicular The Chairlift A chairlift connects Anacapri with Monte Solaro. Riding this chairlift is one of the best things to do in Capri because the views are wonderful. It was our kids’ favorite experience on the island. The schedule varies by season and costs €12 for a round trip ticket. Learn more here. By Scooter On our second trip, we rented a scooter. That gave us the ability to drive around on our own schedule and to reach remote viewpoints on our own. But to drive a scooter, you must have lots of experience. The scooter company will not rent you a scooter if you are new to doing this. The roads are narrow and winding with tight turns and lots of traffic. It can be dangerous to get around on a scooter, so if you have any doubts as to your abilities, take the bus or hire a taxi. We rented a scooter from Rent Scooter Alfano, which is located on Via Marina Grande, about a 3-minute walk from Marina Grande. By Boat Most boat tours make one big loop around the island, starting and ending at Marina Grande. It’s possible to take a boat tour around the island, see the Blue Grotto, and then go right to Anacapri from here. This is what we did on our first visit to Capri and it worked very well, since it saved us a lot of transportation time. We lay out exactly how to do this in our Blue Grotto Guide and our One Day in Capri Itinerary. It’s also possible to simply hire a boat at Marina Grande and travel out and back to the Blue Grotto. Best Things to Do in Capri Below is a list of the best things to do in Capri. First, we start off with what we think are the top experiences on the island. This is followed by with additional things to do, just so you are aware of everything you can do on Capri…you might see the longer list and decide to add more time to your visit here. 10 Essential Experiences in Capri 1. Take a Boat Tour of Capri If you do one thing in Capri, take a boat tour of the island. It’s short, it is a beautiful trip, and it is the best way to see the grottoes, beaches, sea stacks, and limestone cliffs. There are two main companies that offer boat tours around the island, Laser and Motoscafisti Capri. Boat tours typically last 2 hours, cost approximately €24 per person, and make a full loop around the island. Boat tours are offered from mid-March through the end of October. On a boat tour around the island, you will get close up views of several grottoes, such as the White Grotto and the Green Grotto, the chance to enter the Blue Grotto, and views of the Faraglioni rocks, Punta Carena lighthouse, and Tiberius’ Leap. So, you get to see many of the natural highlights of Capri without walking, or waiting for buses and taxis. It is also possible to book a private boat trip around Capri. This gives you the freedom to cruise around the island on your own schedule and stop at some places the shorter boat tours do not include (like the beaches and some restaurants that are located along the water). Faraglioni rocks The view of Capri from the water. Marina Piccola is on the left side of the photo and you can see the switchbacks of Via Krupp on the right side of the photo. Punta Carena Lighthouse 2. Visit the Blue Grotto (Grotta Azzurra) The Blue Grotto is the most popular grotto, or sea cave, in Capri. Depending on who you talk to, some say the Blue Grotto is one of the best things to do in Capri and others say it isn’t worth the hype. We visited the Blue Grotto during the busy month of July. It is one of the final stops on a boat tour of Capri. The only boats allowed into the Blue Grotto are rowboats, since the opening into the Blue Grotto is tiny. That means that you will have to wait to board one of these rowboats. That wait can be an hour or longer (we waited 45 minutes). And once inside, you only get 5 minutes in the Blue Grotto. Worth it? Despite the long wait and Tyler turning green as we waited to board the rowboat, for us, yes, it was worth it. Our kids both loved it. But if you have visited sea caves and grottoes previously, this may not be worth the time. Just note that if you book a boat tour that includes the Blue Grotto, even if you don’t want to do it, you will still have to sit and wait while other passengers wait their turn to board a rowboat. You can learn a lot more about what to expect in our article Is the Blue Grotto Worth It? Inside the Blue Grotto Rowboats waiting to enter the Blue Grotto PRACTICAL INFORMATION: It costs €18 per person to enter the Blue Grotto. The Blue Grotto will close when seas are rough and this decision is made every morning at 9 am. 3. Ride the Chairlift to Monte Solaro For one of the best views of Capri, ride the chairlift to Monte Solaro. We loved the views from the chairlift but they get even better once you are standing on Monte Solaro, the highest point on the island of Capri. From here, you can see the Faraglioni rocks, Mount Vesuvius, the Isle of Ischia, Sorrento, and the Bay of Naples. Monte Solaro Chairlift Monte Solaro | Neirfy/shutterstock.com The view of the Faraglioni rocks from Monte Solaro The view down to the boats near Marina Piccola HOW TO DO THIS: In Anacapri, go to the lower station of the chairlift, which is called Seggiovia Monte Solaro. Tickets can be purchased here one-way (€11) or round trip (€14). It takes about 7 minutes to ride the chairlift one-way. Once you exit the chairlift station, there are viewing platforms to visit. A visit here lasts about 45 minutes, which includes the round-trip chairlift ride. 4. Visit the Gardens of Augustus (Giardini di Augusto) This small botanical garden offers some of the best views of Capri. The gardens are located just down the hill from the town of Capri, about a 5-minute walk one-way from the main shopping streets. Pay your entrance fee and walk uphill for a view of Via Krupp (mentioned next on our to do list). Via Krupp Then climb the steps to the upper platform, where gorgeous views of the Faraglioni rocks and coastline await. Before you leave, stroll past the flower beds and tropical flowers or have your photo taken on the colorfully tiled bench. All of our photos are from our visit at the end of October, so even in autumn, the gardens are beautiful to visit. The view from Giardini di Augusto. Capri Rooftop is the restautant on the left side of this photo. Giardini di Augusto PRO TRAVEL TIP: If you want a cold drink, cup of coffee, cocktail, or a light meal, go next door to Capri Rooftop. This restaurant and bar has an outdoor terrace with sofas and tables and chairs. From here, you have similar views of the coast and the Faraglioni rocks. The serve good drinks, salads, and other healthy dishes. Capri Rooftop 5. Via Krupp Via Krupp is a famous, winding walkway on the island of Capri. It connects the town of Capri with Marina Piccola. It was constructed by Friedrick Alfred Krupp, a rich steel tycoon who wanted a quick and easy way to walk from his residence in Capri to his yacht in Marina Piccola. Via Krupp After being closed for 10 years, Via Krupp recently reopened. There is a small fee to walk this path, which descends down to Marina Piccola. From Marina Piccola, you can return to the town of Capri on foot, hire a taxi, or take the bus. HOW TO GET HERE: You can get a view of Via Krupp (and walk the path to Marina Piccola) from Giardini di Augusto, which is a 5-minute walk from the Capri city center. 6. Spend Some Time in Capri Town Capri town is one of the two main towns on the island of Capri. This town, with its location over Marina Grande and its easy accessibility by funicular, restaurants, and shopping streets, makes this a popular destination on the island. Most likely, you will arrive here by funicular, taxi, or bus. The first thing you will see is Piazza Umberto I, the main square of Capri. This is a busy spot midday, as the square could be overflowing with tourists, plus a few locals here and there. Piazza Umberto I Shopping streets lead off of Piazza Umberto I. Be sure to stroll along Via Camerelle for its collection of high-end luxury shops like Salvatore Ferragamo, Gucci, and Louis Vuitton. Via Camerelle Via Camerelle And make sure you get a scoop of gelato from Buonocore Gelateria, a much more budget-friendly shop than the ones just mentioned. This small café has the reputation of being the best gelato restaurant in Capri. Buonocore Gelateria 7. See the Faraglioni Rocks These have already been mentioned a few times in this guide. The Faraglioni rocks are one of the most iconic sights in Capri, so we are giving them its own entry, just to show its importance. You can see the Faraglioni rocks on a boat tour, from the Augustus Gardens, from the Capri Rooftop restaurant and bar, from Monte Solaro, and while walking the Pizzolungo Coastal Trail. The Faraglioni Rocks from Monte Solaro 8. Have Drinks or a Meal with a View One of the best things to do in Capri is to have drinks or a meal with a view. Already mentioned is Capri Rooftop, which sits next to Giardini di Augusto near Capri town and offers views of the Faraglioni rocks. La Palette Ristorante is located on Via Matermania has views over Capri town and the north side of the island. You can include this with the walk to Arco Naturale, mentioned next. Other restaurants with a beautiful view of the island include Ristorante Panorama and Ziqu Terrace Restaurant. La Palette Ristorante 9. Stroll out to Arco Naturale Arco Naturale is another iconic natural monument on Capri. There are two ways to see it. The easiest way is on a boat tour of the island. Or, you can get here on foot. From Capri town, it is a 35-minute one-way walk to get to the viewpoint of Arco Naturale. It will be a mostly gradual, uphill walk on a narrow, pedestrian street lined with stone walls and houses. The arch is nice to see, but walking over an hour round trip to see a stone arch may not be the way you want to spend your valuable time in Capri, which is why it is listed 9th on our list. Just before you get to the arch is a small restaurant with coastal views called Le Grottelle. It was just closing up for the season while we were here and gets decent reviews. The terrace of Le Grottelle and you can see the top part of Arco Naturale. 10. Walk the Pizzolungo Coastal Trail The Pizzolungo Coastal Trail, also called Via del Pizzolungo, is a walking trail that leads to several viewpoints on the southeast end of the island. Arco Naturale is an easy and worthwhile addition to this walk. Before getting into what you will see along the walk, it’s important to know that this walk is 3.2 km (2 miles) and it will take about an hour and a half to two hours. It is paved the entire way, but you will walk up and down long sets of steps. In the summer months, it will be a hot walk, so keep this in mind and bring some water. The walk is done as a loop and the best direction to do it is clockwise, to avoid a massive stair climb. Starting in Capri Town, take Via le Botteghe to Via Matermania to Via Arco Naturale (this route is marked on our Google Map earlier in this guide). At Le Grottelle, a small restaurant, walk the short trail out to see Arco Naturale, and then return back to Le Grottelle. If you need to refill your water or get a bite to eat, this is the best place to do it. From Le Grottelle, turn left onto Via del Pizzolungo. If you are walking down a long series of staircases, you are in the right spot. We did this walk in the opposite direction and I can tell you that these steps are a beast to climb. This is just one of many staircases along Via del Pizzolungo. It’s best to go clockwise on this loop so you walk down these steps, not up them. In a few minutes, you will enter Grotta di Matermania, a cave where the gods of the woods were celebrated in ancient times. Grotta di Matermania The steps continue into the woods a little farther. After a short, uphill climb, you exit the forest and begin the best part of the trail. The paved trail weaves along the coastal cliffs, taking you to several great viewpoints, our favorite being Belvedere del Pizzolungo. Pizzolungo Coastal Trail The view from Belvedere del Pizzolungo You can take the detour to Villa Malaparte for more coastal views, but it is a downhill walk to get there, and then it will be a tough uphill walk to get back onto Via del Pizzolungo (we skipped it). On this walk, the last viewpoint you will see is Belvedere Tragara, for another view of the Faraglioni rocks. To return to Capri town, walk Via Tragara into town and it is roughly a 15-minute walk from this viewpoint. The view from Belvedere Tragara As you walk through Capri Town, there are maps and signs indicating directions and walking times to viewpoints and attractions. These are very handy in getting around town and walking out to places like Arco Naturale and Villa Jovis. You can also look for the tiled signs on the street corners. Via Tragara The walking trails throughout Capri are well marked with signs like this one. At the bottom, the map lists the walking times to nearby places to visit. With More Time: More Things to Do in Capri If you have more than one day in Capri, here are more things to do with your time. Spend Some Time in Anacapri Anacapri is another town on the island of Capri. It’s nice to visit in that it feels less touristy, and it is definitely a lot less crowded than Capri town. The list of sights to see is small, but there are a few good restaurants and shops to visit as well. In Anacapri, visit the Church of San Michele to see the amazing tiled floor (the best view is from the upper terrace), Museo Casa Rossa di Anacapri, stroll through Piazza Diaz and see the Church of Saint Sophia, and stroll along Via Giuseppe Orlandi, the main shopping street in Anacapri. Church of Saint Sophia The clock on the Church of Saint Sophia The tile floor of Church of San Michele Museo Casa Rossa di Anacapri How to Get to Anacapri: You can get to Anacapri by taking a bus from the Blue Grotto, Capri, or Marina Grande. You can also get here by taxi or scooter. Villa San Michele Villa San Michele is located in Anacapri. It was the home of Swedish physician Axel Munthe and it is famous for its view over the Bay of Naples, the gardens, and the 3,200 year old Sphinx overlooking the coast. Villa San Michele | Nido Huebl/shutterstock.com To get to Villa San Michele, take the bus to Anacapri and then it is a 5-minute walk to the villa from Piazza Vittoria. The villa is open all year. Get updated hours and pricing on the official website. Marina Grande Marina Grande is the gateway onto Capri. It is a chaotic spot, with multiple ferries coming and going, boat tours leaving for the Blue Grotto, and groups of tourists following guides waving tiny, colorful flags. There’s no big attraction or must-see sight here, but this is the place to catch the next mode of transportation to wherever you are going next, whether it be a boat to the Blue Grotto, the funicular to Capri town, or a bus or a taxi. Marina Grande Marina Piccola On the opposite side of the island is a smaller marina, Marina Piccola. It is home to a small pebbly beach and some restaurants. To get here, take a bus, taxi or scooter, or get here on a boat tour. Villa Jovis Villa Jovis was one of 12 villas that Tiberius had on the island of Capri. Most of the villa remains as ruins and at the end of the Villa is Tiberius’ Leap, a place on the cliffs where ill-behaved servants were thrown into the sea. We were very interested in visiting this historic site, until we learned that it is a 45-minute uphill slightly strenuous walk, one-way, to get to the villa from Capri town (you can’t get here by bus or scooter). Overall, the entire visit takes 2 to 2.5 hours and with our limited time on the island, we decided to give this one a pass. Villa Jovis | Inu/shutterstock.com Villa Lysis Villa Lysis is also located a fair distance from Capri town and the only way to get here is on foot. This beautiful villa was built in 1904 by Jacques d’Adelswärd Ferse, a Parisian count, and lived here with his lover, Nino Cesarini. The villa became a meeting point for other creative people, such as poets, writers, and artists, in the early 1900’s. To get here from Capri town, it is a slightly strenuous 45-minute uphill walk one-way. The entire visit will last 2 to 2.5 hours, which includes walking time. Villa Lysis | Roman Plesky/shutterstock.com Punta Carena Lighthouse The Punta Carena Lighthouse is located on a rocky cliff on the southwest corner of Capri. This area feels far removed from busy Capri town and Anacapri. Faro Beach (Lido di Faro) sits just down the hill from the lighthouse. There are a couple of bars here with a relaxed vibe. Faro Beach If you walk the short path (about a 1-minute walk) that runs next to the lighthouse, it will take you out to Belvedere Del Sognatore. From here you get a nice view of the coastline and lighthouse. The view from Punta Carena This area is a pretty spot to visit and much quieter than other places we visited on Capri. However, if you take a boat tour of the island, you will get great views of this area. In our opinion, Faro Beach is only worth it for those who will be staying on Capri and want to visit a less touristy beach. You can get to Faro Beach and the lighthouse by bus, taxi, and scooter. It’s a 45-minute downhill walk from Anacapri. How Much Time Do You Need on Capri? Most people visit Capri on a day trip, and I think one day is enough time if you just want to visit the highlights. On our first visit, we took a boat tour around the island, visited the Blue Grotto, had lunch, and then visited Monte Solaro. We skipped the town of Capri, the gardens, and the walks to the viewpoints, and don’t feel like we missed out on much. In our one day in Capri itinerary, we list how to take the boat tour and visit Monte Solaro, and spend some time in the town of Capri, for the best all-around experience on Capri. If you have more time in your schedule, plan on spending two to three days on Capri. With this time, you can visit the top sites on the island, plus walk out to the villas and viewpoints around the island. Best Time to Visit Capri The best time to visit Capri is from May through October, when everything is open and the ferries are running at full schedule. From June through September, expect big crowds on Capri. For lighter crowds, plan your visit for May and October. We have visited Capri twice. Or first visit was in July. It was hot but we had clear skies and perfect weather for the boat tour around the island. Our second visit was on October 23. The high temperature was 27°C (81°F) which is unseasonably warm this time of year. There were a few clouds in the morning but these cleared up in the afternoon. As you get into mid-October, it tends to be cooler than this with rougher seas, which makes it more likely for the Blue Grotto to close. On the day we were here, the Blue Grotto was open. The view of Capri from Via Giuseppe Orlandi near Hotel San Michele Tours of Capri If you prefer to visit Capri on a guided tour, here are some of the best tours of Capri. Some of these are full day trips and some are half day boat tours of Capri. Tours of Capri Frequently Asked Questions How much does it cost to visit Capri? Capri is an expensive destination in Italy. To get here you will need to take the ferry, which roughly costs €42 round trip. Once you add on a boat tour, entrance tickets, and have lunch, prices do add up. To visit the highlights of Capri, you are looking at spending at least €100 per person on a day trip to Capri. How much time do you need to visit Capri? One day is all you need to visit the highlights of Capri. With one day on Capri, you can take a boat tour of the island, visit the Blue Grotto, visit both Capri town and Anacapri, and ride the chairlift to Monte Solaro. If you have more time, spend a few days on the island and use your extra time to visit the beaches, do a little hiking, and visit the villas and Roman ruins. Is Capri worth it? If you have plans to be in the area (Sorrento, the Amalfi Coast, or Naples) then a day trip to Capri is worth it. This is a beautiful island. The best way to see it is on a boat tour, and for us, this was one of the highlights for us while in this part of Italy. Capri is a great destination for both adults and kids, so if you are traveling as a family, it’s worth it to visit Capri (kids love the boat tour, Blue Grotto, and riding the chairlift to Monte Solaro). How do I visit Capri on my own? If you want to visit Capri, it may seem overwhelming to plan a trip here. We take out the guesswork in our guide about how to plan a day trip to Capri, covering how to get here, the best way to plan your time and get around the island, and what you can do in one day. Capri has an excellent public transportation network, so it’s easy to get around the island cheaply, without taking a tour. If you have any questions about the best things to do in Capri, let us know in the comment section below. More Information for Your Trip to Italy We have TONS more information about Italy in our Italy Travel Guide, including Rome, Florence, Venice, Tuscany, the Dolomites, the Amalfi Coast, the Cinque Terre, Sicily, and Puglia."
}