{
  "url": "https://www.llbean.com/llb/shop/514535?page=llbean-mastercard",
  "title": "L.L.Bean Mastercard",
  "text": "Already a cardmember? Bean Bucks® Balance | View Mastercard Account Earn Bean Bucks® everywhere you shop² 4% at L.L.Bean 2% at restaurants 1% all other purchases Free Shipping³, Free Return Shipping³, Free Monogramming³, and No Annual Fee⁴ View your Bean Bucks balance now. You can also check your balance on your statement, in-store or by phone. L.L.Bean Mastercard rewards What you spend Bean Bucks earned 4% at L.L.Bean $100 $4.00 2% at restaurants $200 $4.00 1% other purchases $1,000 $10.00 Monthly Total $1,300 $18.00 Annual Total $216.00** **That's over $215 in savings on future purchases at L.L.Bean! For illustrative purposes only. Annual Total calculated by taking Monthly Total x 12. Not a cardmember? APPLY NOW 1 If your application for the L.L.Bean Mastercard is instantly approved, you will receive a one-time discount of 20% off your llbean.com purchase, valid during your current website visit to llbean.com when you pay with your new L.L.Bean Mastercard. Once this llbean.com visit has ended, this offer is no longer valid. Offer excludes shipping charges; return labels; taxes; license/stamps; gift cards; repairs; duty; engraving; monogramming; alterations; all Outdoor Discovery Programs; L.L.Bean for Business orders; and the America the Beautiful – National Parks and Federal Recreational Lands Annual Pass. Not valid on previous purchases or with employee discounts. Cannot be combined with other promotional offers or discounts. All refunds will match the discounted amount on the purchase receipt. L.L.Bean reserves the right to deactivate promo code(s) in the event of fraud or technical issues and to limit quantities of individual items eligible for purchase with this discount. For your security, you cannot purchase electronic gift cards or use your card on orders shipping to an address other than your billing address until your new L.L.Bean Mastercard arrives in the mail and is activated. 2 Bean Bucks: You will earn a percentage on all eligible net purchases: 4% at L.L.Bean’s businesses in the U.S; 2% at restaurants; 1% on all other eligible net L.L.Bean Mastercard purchases. You may only earn 1%, not 2%, on restaurant purchases at bakeries and certain restaurants/cafes inside department stores, grocery or warehouse clubs, as determined by L.L.Bean in its discretion, due to merchant codes which are out of the control of Citibank or L.L.Bean. Bean Bucks are not earned on balance transfers, convenience checks, cash advances, credits, returned purchases, foreign currency purchases, unauthorized purchases, annual fees, money orders, wire transfers, bets, lottery tickets or casino gaming chips, credit insurance premiums, credit protection fees, interest charges, credit card fees and purchases made with Bean Bucks. Bean Bucks may only be used towards the price of merchandise or services purchased from L.L.Bean. Bean Bucks are not redeemable towards expedited shipping and handling, oversized freight delivery, sales tax, a L.L.Bean Outdoor Discovery Program or a L.L.Bean for Business purchase, nor are they redeemable for cash. Certain services may be excluded at the discretion of L.L.Bean. If your account is closed, not in good standing, or you fail to use your L.L.Bean Mastercard for at least one (1) purchase every twenty-four (24) months, you will not be able to earn or redeem Bean Bucks and any unredeemed Bean Bucks will be forfeited unless prohibited by law. Additional exclusions apply. See the L.L.Bean Mastercard Rewards Program Terms of Use at www.llbean.com/rewardsprogram. The L.L.Bean Mastercard Rewards Program is offered by L.L.Bean. L.L.Bean may terminate or change any benefit, reward, service or feature offered in connection with the L.L.Bean Mastercard account at any time for any reason. Citibank, N.A. is not responsible for products and services offered by other companies. 3 Free Shipping: Eligibility requires the L.L.Bean order to be paid for by the use of the Card or entirely with Bean Bucks. Applies to L.L.Bean’s standard shipping to the U.S. and does not apply to expedited shipping and handling, oversized freight delivery, L.L.Bean for Business orders or shipping to addresses outside of the U.S. Free Return Shipping: Eligibility on returns for an item purchased at L.L.Bean requires the item to have been paid for by the use of the Card or entirely with Bean Bucks. Does not apply to expedited shipping and handling, items requiring oversized freight shipping nor is it valid for L.L.Bean for Business items or items returned from International locations. Free Monogramming: Eligibility to receive the free monogramming service (“Monogramming”), for those items which have been purchased at L.L.Bean with use of the Card or entirely with Bean Bucks and for which Monogramming is offered. Monogramming does not apply to L.L.Bean for Business orders or International orders. 4 As of 12/16/2025, the APR for purchases and the APR for balance transfers is 19.49%-30.49% based on your creditworthiness and the APR for cash advances is 32.49%. These APR’s will vary with the market based on Prime Rate. The Minimum Interest Charge is $2.00. The cash advance fee is 5% of each transaction; minimum $10. The balance transfer fee is 5% of each transaction, minimum $10, and the transaction fee for foreign purchases is 3% of each purchase transaction in U.S. dollars. See card agreement for details. L.L.Bean Mastercard is issued by Citibank, N.A. Citi and Arc Design is a registered service mark of Citigroup Inc. Mastercard and the circles design are registered trademarks of Mastercard International Incorporated. L.L.Bean and Bean Bucks are registered trademarks of L.L.Bean, Inc."
}