{
  "url": "https://www.oasisbr.ibict.br/vufind/Record/UEFS_3bdd938257bf86e8cd313511a199e7fd",
  "title": "Metadados do item: Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva",
  "text": "Pular para o conteúdo Portal do Governo Brasileiro Toggle navigation Início Sobre Fontes Coletadas Indicadores Contato Faq A sua conta Sair Entrar Idioma Português (Brasil) English Todos os campos Título Autor Assunto Buscar Busca avançada Paleohistologia em dentes de h... Metadados do item Citar Imprimir Exportar registro Exportar para RefWorks Exportar para EndNoteWeb Exportar para EndNote Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva Detalhes bibliográficos Autor(a) principal: Silva, Kelly Roberta da Data de Publicação: 2025 Tipo de documento: Dissertação Idioma: por Título da fonte: Biblioteca Digital de Teses e Dissertações da UEFS Texto Completo: http://tede2.uefs.br:8080/handle/tede/1960 Resumo: Teeth constitute the main source of information about basal-divergent elasmobranchs, such as Hybodontiform sharks. In general, these teeth exhibit microstructural variations in their tissues (layer distribution), being classified into three histotypes: orthodont, osteodont, and pseudoosteodont. Among Hybodontiformes, such variations are phylogenetically broad, distributed throughout geological periods, and they remain still scarcely explored. Thus, this study aimed to investigate the microstructural changes in the teeth of two Hybodontiformes sharks: Priohybodus arambourgi, from the Aliança Formation (Tucano Basin, Upper Jurassic), and a hybodontiform of the Serra do Cadeado, from the Rio do Rasto Formation (Paraná Basin, Middle/Upper Permian). For this purpose, paleohistological description and comparison were carried out with Scanning Electron Microscopy (SEM) analyses. It was observed that both species exhibit a pseudoosteodont histotype, with significant variations in dentin layer thickness. P. arambourgi showed a higher concentration of osteodentin in the core, in addition to wear and micro-scratches on dental enameloid, suggesting a more generalist diet. The Serra do Cadeado taxon, such as P. arambourgi, also presents predominance of osteodentin, but with abundant and relatively prominent vascular canals, thicker orthodentin, and pronounced wear on the dental enameloid. The microstructural characteristics bring the Serra do Cadeado hybodontiform closer to certain genera, such as Hybodus, Acrodus, Crassodus, and Polyacrodus. The organization and orientation of fluorapatite crystallites in both taxa reflect functional adaptations related to diet, while the observed wear probably indicates functional teeth, with slower tooth replacement. These results reinforce the conservation of the pseudoosteodont histological pattern within Hybodontiformes and expand the evolutionary and ecological understanding of the group through dental microstructure. Metadados do item id UEFS_3bdd938257bf86e8cd313511a199e7fd oai_identifier_str oai:tede2.uefs.br:8080:tede/1960 network_acronym_str UEFS network_name_str Biblioteca Digital de Teses e Dissertações da UEFS repository_id_str spelling Nogueira, Estevan Eltinkhttps://orcid.org/0000-0003-2296-4954http://lattes.cnpq.br/8004048500479942https://orcid.org/0009-0002-5586-1767http://lattes.cnpq.br/4933251128567167Silva, Kelly Roberta da2025-11-11T12:00:45Z2025-09-24SILVA, Kelly Roberta da. Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva, 2025, 137f., Dissertação (mestrado) - Programa de Pós-Graduação em Ecologia e Evolução, Universidade Estadual de Feira de Santana, Feira de Santana.http://tede2.uefs.br:8080/handle/tede/1960Teeth constitute the main source of information about basal-divergent elasmobranchs, such as Hybodontiform sharks. In general, these teeth exhibit microstructural variations in their tissues (layer distribution), being classified into three histotypes: orthodont, osteodont, and pseudoosteodont. Among Hybodontiformes, such variations are phylogenetically broad, distributed throughout geological periods, and they remain still scarcely explored. Thus, this study aimed to investigate the microstructural changes in the teeth of two Hybodontiformes sharks: Priohybodus arambourgi, from the Aliança Formation (Tucano Basin, Upper Jurassic), and a hybodontiform of the Serra do Cadeado, from the Rio do Rasto Formation (Paraná Basin, Middle/Upper Permian). For this purpose, paleohistological description and comparison were carried out with Scanning Electron Microscopy (SEM) analyses. It was observed that both species exhibit a pseudoosteodont histotype, with significant variations in dentin layer thickness. P. arambourgi showed a higher concentration of osteodentin in the core, in addition to wear and micro-scratches on dental enameloid, suggesting a more generalist diet. The Serra do Cadeado taxon, such as P. arambourgi, also presents predominance of osteodentin, but with abundant and relatively prominent vascular canals, thicker orthodentin, and pronounced wear on the dental enameloid. The microstructural characteristics bring the Serra do Cadeado hybodontiform closer to certain genera, such as Hybodus, Acrodus, Crassodus, and Polyacrodus. The organization and orientation of fluorapatite crystallites in both taxa reflect functional adaptations related to diet, while the observed wear probably indicates functional teeth, with slower tooth replacement. These results reinforce the conservation of the pseudoosteodont histological pattern within Hybodontiformes and expand the evolutionary and ecological understanding of the group through dental microstructure.Os dentes constituem a principal fonte informativa sobre as espécies de elasmobrânquios de divergência basal, tais como os tubarões Hybodontiformes. De forma geral, esses dentes possuem variações microestruturais em seus tecidos (distribuição das camadas), sendo classificados em três histótipos: ortodonte, osteodonte e pseudoosteodonte. Dentre os Hybodontiformes, tais variações são amplas filogeneticamente ao longo dos períodos geológicos, e ainda permanecem pouco exploradas. Dessa forma, este estudo teve como objetivo investigar as alterações microestruturais em dentes de dois táxons de tubarões Hybodontiformes: Priohybodus arambourgi, proveniente da Formação Aliança (Bacia do Tucano, Jurássico Superior) e um hibodontiforme da Serra do Cadeado, proveniente da Formação Rio do Rasto (Bacia do Paraná, Permiano Médio/Superior). Para isso, foram realizadas a descrição e comparação paleohistológica, assim como análises de Microscopia Eletrônica de Varredura (MEV). Observou-se que ambas as espécies apresentam um histótipo pseudoosteodonte, com variações significativas na espessura das camadas de dentina. P. arambourgi apresentou uma maior concentração de osteodentina no núcleo, além de desgaste e microarranhões no enamelóide, sugerindo uma dieta mais generalista. O táxon da Serra do Cadeado, assim como P. arambourgi, também possui uma osteodentina predominante, porém com canais vasculares abundantes e relativamente proeminentes, uma ortodentina mais espessa e desgastes acentuados no enamelóide. As características microestruturais aproximam o hibodontiforme da Serra do Cadeado a determinados gêneros, como Hybodus, Acrodus, Crassodus e Polyacrodus. A organização e orientação dos cristalitos de fluorapatita em ambos os táxons refletem adaptações funcionais relacionada à dieta, enquanto o desgaste observado provavelmente indica dentes funcionais, com substituição dentária mais lenta. Esses resultados reforçam a conservação do padrão histológico pseudoosteodonte dentro dos Hybodontiformes e ampliam a compreensão evolutiva e ecológica do grupo através da microestrutura dentária.Submitted by Daniela Costa (dmscosta@uefs.br) on 2025-11-11T12:00:45Z No. of bitstreams: 1 KELLY ROBERTA DA SILVA - Dissertacao.pdf: 3915979 bytes, checksum: f73bfbc1a9b1187bab78b163944ea678 (MD5)Made available in DSpace on 2025-11-11T12:00:45Z (GMT). No. of bitstreams: 1 KELLY ROBERTA DA SILVA - Dissertacao.pdf: 3915979 bytes, checksum: f73bfbc1a9b1187bab78b163944ea678 (MD5) Previous issue date: 2025-09-24Fundação de Amparo à Pesquisa do Estado da Bahia - FAPEBapplication/pdfhttp://tede2.uefs.br:8080/retrieve/8180/KELLY%20ROBERTA%20DA%20SILVA%20-%20Dissertacao.pdf.jpgporUniversidade Estadual de Feira de SantanaPrograma de Pós-Graduação em Ecologia e EvoluçãoUEFSBrasilDEPARTAMENTO DE CIÊNCIAS BIOLÓGICASFormação AliançaFormação Rio do RastoFósseisMicroestruturaTubarãoAliança FormationFossilsMicrostructureRio do Rasto FormationSharkCIENCIAS BIOLOGICASPaleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutivainfo:eu-repo/semantics/publishedVersioninfo:eu-repo/semantics/masterThesis1186049341845741519600600600500-6971480722008537872-34391788430682021614767858349021390776info:eu-repo/semantics/openAccessreponame:Biblioteca Digital de Teses e Dissertações da UEFSinstname:Universidade Estadual de Feira de Santana (UEFS)instacron:UEFSTHUMBNAILKELLY ROBERTA DA SILVA - Dissertacao.pdf.jpgKELLY ROBERTA DA SILVA - Dissertacao.pdf.jpgimage/jpeg3706http://tede2.uefs.br:8080/bitstream/tede/1960/4/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdf.jpg1fd14e7323260dad52f41e886b7783acMD54TEXTKELLY ROBERTA DA SILVA - Dissertacao.pdf.txtKELLY ROBERTA DA SILVA - Dissertacao.pdf.txttext/plain332990http://tede2.uefs.br:8080/bitstream/tede/1960/3/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdf.txtdb0afd5a1e097088ff0e0755629e8258MD53ORIGINALKELLY ROBERTA DA SILVA - Dissertacao.pdfKELLY ROBERTA DA SILVA - Dissertacao.pdfapplication/pdf3915979http://tede2.uefs.br:8080/bitstream/tede/1960/2/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdff73bfbc1a9b1187bab78b163944ea678MD52LICENSElicense.txtlicense.txttext/plain; charset=utf-82165http://tede2.uefs.br:8080/bitstream/tede/1960/1/license.txtbd3efa91386c1718a7f26a329fdcb468MD51tede/19602025-11-12 01:00:09.022oai:tede2.uefs.br:8080:tede/1960Tk9UQTogQ09MT1FVRSBBUVVJIEEgU1VBIFBSw5NQUklBIExJQ0VOw4dBCkVzdGEgbGljZW7Dp2EgZGUgZXhlbXBsbyDDqSBmb3JuZWNpZGEgYXBlbmFzIHBhcmEgZmlucyBpbmZvcm1hdGl2b3MuCgpMSUNFTsOHQSBERSBESVNUUklCVUnDh8ODTyBOw4NPLUVYQ0xVU0lWQQoKQ29tIGEgYXByZXNlbnRhw6fDo28gZGVzdGEgbGljZW7Dp2EsIHZvY8OqIChvIGF1dG9yIChlcykgb3UgbyB0aXR1bGFyIGRvcyBkaXJlaXRvcyBkZSBhdXRvcikgY29uY2VkZSDDoCBVbml2ZXJzaWRhZGUgClhYWCAoU2lnbGEgZGEgVW5pdmVyc2lkYWRlKSBvIGRpcmVpdG8gbsOjby1leGNsdXNpdm8gZGUgcmVwcm9kdXppciwgIHRyYWR1emlyIChjb25mb3JtZSBkZWZpbmlkbyBhYmFpeG8pLCBlL291IApkaXN0cmlidWlyIGEgc3VhIHRlc2Ugb3UgZGlzc2VydGHDp8OjbyAoaW5jbHVpbmRvIG8gcmVzdW1vKSBwb3IgdG9kbyBvIG11bmRvIG5vIGZvcm1hdG8gaW1wcmVzc28gZSBlbGV0csO0bmljbyBlIAplbSBxdWFscXVlciBtZWlvLCBpbmNsdWluZG8gb3MgZm9ybWF0b3Mgw6F1ZGlvIG91IHbDrWRlby4KClZvY8OqIGNvbmNvcmRhIHF1ZSBhIFNpZ2xhIGRlIFVuaXZlcnNpZGFkZSBwb2RlLCBzZW0gYWx0ZXJhciBvIGNvbnRlw7pkbywgdHJhbnNwb3IgYSBzdWEgdGVzZSBvdSBkaXNzZXJ0YcOnw6NvIApwYXJhIHF1YWxxdWVyIG1laW8gb3UgZm9ybWF0byBwYXJhIGZpbnMgZGUgcHJlc2VydmHDp8Ojby4KClZvY8OqIHRhbWLDqW0gY29uY29yZGEgcXVlIGEgU2lnbGEgZGUgVW5pdmVyc2lkYWRlIHBvZGUgbWFudGVyIG1haXMgZGUgdW1hIGPDs3BpYSBhIHN1YSB0ZXNlIG91IApkaXNzZXJ0YcOnw6NvIHBhcmEgZmlucyBkZSBzZWd1cmFuw6dhLCBiYWNrLXVwIGUgcHJlc2VydmHDp8Ojby4KClZvY8OqIGRlY2xhcmEgcXVlIGEgc3VhIHRlc2Ugb3UgZGlzc2VydGHDp8OjbyDDqSBvcmlnaW5hbCBlIHF1ZSB2b2PDqiB0ZW0gbyBwb2RlciBkZSBjb25jZWRlciBvcyBkaXJlaXRvcyBjb250aWRvcyAKbmVzdGEgbGljZW7Dp2EuIFZvY8OqIHRhbWLDqW0gZGVjbGFyYSBxdWUgbyBkZXDDs3NpdG8gZGEgc3VhIHRlc2Ugb3UgZGlzc2VydGHDp8OjbyBuw6NvLCBxdWUgc2VqYSBkZSBzZXUgCmNvbmhlY2ltZW50bywgaW5mcmluZ2UgZGlyZWl0b3MgYXV0b3JhaXMgZGUgbmluZ3XDqW0uCgpDYXNvIGEgc3VhIHRlc2Ugb3UgZGlzc2VydGHDp8OjbyBjb250ZW5oYSBtYXRlcmlhbCBxdWUgdm9jw6ogbsOjbyBwb3NzdWkgYSB0aXR1bGFyaWRhZGUgZG9zIGRpcmVpdG9zIGF1dG9yYWlzLCB2b2PDqiAKZGVjbGFyYSBxdWUgb2J0ZXZlIGEgcGVybWlzc8OjbyBpcnJlc3RyaXRhIGRvIGRldGVudG9yIGRvcyBkaXJlaXRvcyBhdXRvcmFpcyBwYXJhIGNvbmNlZGVyIMOgIFNpZ2xhIGRlIFVuaXZlcnNpZGFkZSAKb3MgZGlyZWl0b3MgYXByZXNlbnRhZG9zIG5lc3RhIGxpY2Vuw6dhLCBlIHF1ZSBlc3NlIG1hdGVyaWFsIGRlIHByb3ByaWVkYWRlIGRlIHRlcmNlaXJvcyBlc3TDoSBjbGFyYW1lbnRlIAppZGVudGlmaWNhZG8gZSByZWNvbmhlY2lkbyBubyB0ZXh0byBvdSBubyBjb250ZcO6ZG8gZGEgdGVzZSBvdSBkaXNzZXJ0YcOnw6NvIG9yYSBkZXBvc2l0YWRhLgoKQ0FTTyBBIFRFU0UgT1UgRElTU0VSVEHDh8ODTyBPUkEgREVQT1NJVEFEQSBURU5IQSBTSURPIFJFU1VMVEFETyBERSBVTSBQQVRST0PDjU5JTyBPVSAKQVBPSU8gREUgVU1BIEFHw4pOQ0lBIERFIEZPTUVOVE8gT1UgT1VUUk8gT1JHQU5JU01PIFFVRSBOw4NPIFNFSkEgQSBTSUdMQSBERSAKVU5JVkVSU0lEQURFLCBWT0PDiiBERUNMQVJBIFFVRSBSRVNQRUlUT1UgVE9ET1MgRSBRVUFJU1FVRVIgRElSRUlUT1MgREUgUkVWSVPDg08gQ09NTyAKVEFNQsOJTSBBUyBERU1BSVMgT0JSSUdBw4fDlUVTIEVYSUdJREFTIFBPUiBDT05UUkFUTyBPVSBBQ09SRE8uCgpBIFNpZ2xhIGRlIFVuaXZlcnNpZGFkZSBzZSBjb21wcm9tZXRlIGEgaWRlbnRpZmljYXIgY2xhcmFtZW50ZSBvIHNldSBub21lIChzKSBvdSBvKHMpIG5vbWUocykgZG8ocykgCmRldGVudG9yKGVzKSBkb3MgZGlyZWl0b3MgYXV0b3JhaXMgZGEgdGVzZSBvdSBkaXNzZXJ0YcOnw6NvLCBlIG7Do28gZmFyw6EgcXVhbHF1ZXIgYWx0ZXJhw6fDo28sIGFsw6ltIGRhcXVlbGFzIApjb25jZWRpZGFzIHBvciBlc3RhIGxpY2Vuw6dhLgo=Biblioteca Digital de Teses e Dissertaçõeshttp://tede2.uefs.br:8080/PUBhttp://tede2.uefs.br:8080/oai/requestbcuefs@uefs.br|| bcref@uefs.br||bcuefs@uefs.bropendoar:2025-11-12T04:00:09Biblioteca Digital de Teses e Dissertações da UEFS - Universidade Estadual de Feira de Santana (UEFS)false dc.title.por.fl_str_mv Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva title Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva spellingShingle Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva Silva, Kelly Roberta da Formação Aliança Formação Rio do Rasto Fósseis Microestrutura Tubarão Aliança Formation Fossils Microstructure Rio do Rasto Formation Shark CIENCIAS BIOLOGICAS title_short Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva title_full Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva title_fullStr Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva title_full_unstemmed Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva title_sort Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva author Silva, Kelly Roberta da author_facet Silva, Kelly Roberta da author_role author dc.contributor.advisor1.fl_str_mv Nogueira, Estevan Eltink dc.contributor.advisor1ID.fl_str_mv https://orcid.org/0000-0003-2296-4954 dc.contributor.advisor1Lattes.fl_str_mv http://lattes.cnpq.br/8004048500479942 dc.contributor.authorID.fl_str_mv https://orcid.org/0009-0002-5586-1767 dc.contributor.authorLattes.fl_str_mv http://lattes.cnpq.br/4933251128567167 dc.contributor.author.fl_str_mv Silva, Kelly Roberta da contributor_str_mv Nogueira, Estevan Eltink dc.subject.por.fl_str_mv Formação Aliança Formação Rio do Rasto Fósseis Microestrutura Tubarão topic Formação Aliança Formação Rio do Rasto Fósseis Microestrutura Tubarão Aliança Formation Fossils Microstructure Rio do Rasto Formation Shark CIENCIAS BIOLOGICAS dc.subject.eng.fl_str_mv Aliança Formation Fossils Microstructure Rio do Rasto Formation Shark dc.subject.cnpq.fl_str_mv CIENCIAS BIOLOGICAS description Teeth constitute the main source of information about basal-divergent elasmobranchs, such as Hybodontiform sharks. In general, these teeth exhibit microstructural variations in their tissues (layer distribution), being classified into three histotypes: orthodont, osteodont, and pseudoosteodont. Among Hybodontiformes, such variations are phylogenetically broad, distributed throughout geological periods, and they remain still scarcely explored. Thus, this study aimed to investigate the microstructural changes in the teeth of two Hybodontiformes sharks: Priohybodus arambourgi, from the Aliança Formation (Tucano Basin, Upper Jurassic), and a hybodontiform of the Serra do Cadeado, from the Rio do Rasto Formation (Paraná Basin, Middle/Upper Permian). For this purpose, paleohistological description and comparison were carried out with Scanning Electron Microscopy (SEM) analyses. It was observed that both species exhibit a pseudoosteodont histotype, with significant variations in dentin layer thickness. P. arambourgi showed a higher concentration of osteodentin in the core, in addition to wear and micro-scratches on dental enameloid, suggesting a more generalist diet. The Serra do Cadeado taxon, such as P. arambourgi, also presents predominance of osteodentin, but with abundant and relatively prominent vascular canals, thicker orthodentin, and pronounced wear on the dental enameloid. The microstructural characteristics bring the Serra do Cadeado hybodontiform closer to certain genera, such as Hybodus, Acrodus, Crassodus, and Polyacrodus. The organization and orientation of fluorapatite crystallites in both taxa reflect functional adaptations related to diet, while the observed wear probably indicates functional teeth, with slower tooth replacement. These results reinforce the conservation of the pseudoosteodont histological pattern within Hybodontiformes and expand the evolutionary and ecological understanding of the group through dental microstructure. publishDate 2025 dc.date.accessioned.fl_str_mv 2025-11-11T12:00:45Z dc.date.issued.fl_str_mv 2025-09-24 dc.type.status.fl_str_mv info:eu-repo/semantics/publishedVersion dc.type.driver.fl_str_mv info:eu-repo/semantics/masterThesis format masterThesis status_str publishedVersion dc.identifier.citation.fl_str_mv SILVA, Kelly Roberta da. Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva, 2025, 137f., Dissertação (mestrado) - Programa de Pós-Graduação em Ecologia e Evolução, Universidade Estadual de Feira de Santana, Feira de Santana. dc.identifier.uri.fl_str_mv http://tede2.uefs.br:8080/handle/tede/1960 identifier_str_mv SILVA, Kelly Roberta da. Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva, 2025, 137f., Dissertação (mestrado) - Programa de Pós-Graduação em Ecologia e Evolução, Universidade Estadual de Feira de Santana, Feira de Santana. url http://tede2.uefs.br:8080/handle/tede/1960 dc.language.iso.fl_str_mv por language por dc.relation.program.fl_str_mv 1186049341845741519 dc.relation.confidence.fl_str_mv 600 600 600 500 dc.relation.department.fl_str_mv -6971480722008537872 dc.relation.cnpq.fl_str_mv -3439178843068202161 dc.relation.sponsorship.fl_str_mv 4767858349021390776 dc.rights.driver.fl_str_mv info:eu-repo/semantics/openAccess eu_rights_str_mv openAccess dc.format.none.fl_str_mv application/pdf dc.publisher.none.fl_str_mv Universidade Estadual de Feira de Santana dc.publisher.program.fl_str_mv Programa de Pós-Graduação em Ecologia e Evolução dc.publisher.initials.fl_str_mv UEFS dc.publisher.country.fl_str_mv Brasil dc.publisher.department.fl_str_mv DEPARTAMENTO DE CIÊNCIAS BIOLÓGICAS publisher.none.fl_str_mv Universidade Estadual de Feira de Santana dc.source.none.fl_str_mv reponame:Biblioteca Digital de Teses e Dissertações da UEFS instname:Universidade Estadual de Feira de Santana (UEFS) instacron:UEFS instname_str Universidade Estadual de Feira de Santana (UEFS) instacron_str UEFS institution UEFS reponame_str Biblioteca Digital de Teses e Dissertações da UEFS collection Biblioteca Digital de Teses e Dissertações da UEFS bitstream.url.fl_str_mv http://tede2.uefs.br:8080/bitstream/tede/1960/4/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdf.jpg http://tede2.uefs.br:8080/bitstream/tede/1960/3/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdf.txt http://tede2.uefs.br:8080/bitstream/tede/1960/2/KELLY+ROBERTA+DA+SILVA+-+Dissertacao.pdf http://tede2.uefs.br:8080/bitstream/tede/1960/1/license.txt bitstream.checksum.fl_str_mv 1fd14e7323260dad52f41e886b7783ac db0afd5a1e097088ff0e0755629e8258 f73bfbc1a9b1187bab78b163944ea678 bd3efa91386c1718a7f26a329fdcb468 bitstream.checksumAlgorithm.fl_str_mv MD5 MD5 MD5 MD5 repository.name.fl_str_mv Biblioteca Digital de Teses e Dissertações da UEFS - Universidade Estadual de Feira de Santana (UEFS) repository.mail.fl_str_mv bcuefs@uefs.br|| bcref@uefs.br||bcuefs@uefs.br _version_ 1853506456595202048 Registros relacionados Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva por: Silva, Kelly Roberta da Publicado em: (2025) Paleohistologia em dentes de hybodontiformes (Euselachii) : uma abordagem evolutiva por: Silva, Kelly Roberta da Publicado em: (2025) Descrição de uma nova espécie de anfíbio (Tetrapoda Temnospondyli) para a formação Rio do Rasto (Permiano da Bacia do Paraná) e revisão do status filogenético de Archegosauroidea por: Pacheco, Cristian Pereira Publicado em: (2015) Novos registros de Temnospondyli do sítio São Jerônimo da serra da Formação Rio do Rasto (Permiano/médio superior) do estado do Paraná Brasil : implicações taxônomicas, tafonômicas, paleoambientais e bioestratigráficas por: Azevedo, Karine Lohmann Publicado em: (2018) Bivalves da Formação Rio do Rasto, Permiano, Bacia do Paraná, Brasil: implicações evolutivas e paleoecológicas por: Guerrini, Vitor Bonatto [UNESP] Publicado em: (2018) Carregando..."
}