{
  "url": "https://www.reddit.com/r/Pornhub/comments/yqz07u/rpornhub_is_back_new_changes_optional_verification/",
  "title": "Reddit - The heart of the internet",
  "text": "r/Pornhub is back! New Changes + Optional Verification After being banned due to spam and lack of moderation, r/Pornhub is back! In order to preserve the original spirit of the sub and to combat spam, we've made a few changes: - Most importantly, this subreddit is now exclusively for sharing Pornhub content. Advertising any other content will result in removal and/or a ban. - This community is for all Pornhub users viewers and content creators alike. We allow direct links to Pornhub videos to be shared by any users, regardless of verification status. - Content tags! (This is still a work in progress.) Posters can tag their links with whatever porn category it fits into for easier searchability. Feel free to suggest any additional categories we may have left out in the comments below or via modmail. - Verification is required. Before this subreddit was banned, gifs were the most popular type of post. Unfortunately, most of them were being repeatedly reposted by spam accounts. In an effort to prevent this from happening again, only verified users may share gifs. Frequent reposts will be removed regardless of verification status. How to Verify: Verification is now REQUIRED for all posts. In an effort to prevent DMCA claims and the sharing of stolen content, we ask that anybody sharing gifs of original content verify they are the true owner of the Pornhub account they are advertising. This is to protect content creators as well as the subreddit. We offer two methods of verification, only ONE is required: Method #1: Add Your Reddit Profile to Pornhub - Edit your Pornhub profile to include your Reddit username or a direct link to your Reddit profile. This MUST match the reddit account you are attempting to verify with. - Send us a Modmail requesting verification with a link to your Pornhub profile. Method #2: Verification Album - Take 3 fully clothed photos of you from different angles holding a crumpled handwritten sign that shows: your reddit username, your pornhub username, and today's date. Upload these pics to a private imgur album. - Send us a Modmail requesting verification with a link to your Verification album & a link to your Pornhub profile. We only verify users with Pornhub Model or Pornhub Pornstar accounts. Because of this we cannot accept verification from other subreddits. However, you do not need to be verified here to post direct video links."
}