{
  "url": "https://myfloridalicense.custhelp.com/app/answers/detail/a_id/2218/~/general-dbpr-information:",
  "title": "General DBPR information:",
  "text": "General DBPR information: The Department of Business and Professional Regulation is the agency charged with licensing and regulating businesses and professionals in the State of Florida, such as cosmetologists, veterinarians, real estate agents and pari-mutuel wagering facilities. Our mission is to license efficiently, regulate fairly, and we strive to meet this goal in our day-to-day operation. The Department is under the executive branch of the Governor and is governed by Chapter 120, F.S. The Department is structured according to the requirements of Section 20.165, F.S. Under this sub heading, you will find information related to most frequently asked questions related to licensing across all professional boards/divisions. How do I contact the Florida Department of Business & Professional Regulation (DBPR)? How do I make a personal name change on my license? How do I change my mailing address? When should I submit my fingerprints if I am applying for a license? Will there be any fees other than the application and license fees? What types of complaints and issues cannot be reviewed by the Department? Why must I pay a $5 unlicensed activity fee to obtain a license or renew my license? How long are my fingerprints valid for? Can I change my address online? Can I change all license addresses online? How will I know when my review is scheduled? Your website provides for \"main\", \"mailing\", and \"location\" addresses. What are the differences? Do I need to notify the department of my new address? How can I change my address if I do not have a computer? Is the 60 months counted from the post mark date or the date of receipt of the application? I have not heard from the Department regarding the status of my application. What should I do? I received a letter that I have a bad check on file with the department. What do I do now? Can I submit a copy of a previous application? Where do I mail my application? I received a letter that I have a bad check on file with the Department. What do I do now? What is the Florida Department of Business and Professional Regulation’s telework policy?"
}