{
  "url": "https://welovejapanesefood.com/what-is-ikura/",
  "title": "What is Ikura, Salmon Roe (Salmon Caviar)? | We Love Japanese Food",
  "text": "Ikura (cured salmon roe) is known for a juicy texture that pops with every bite and a rich flavor that melts in your mouth. This gourmet food item is also one of the most popular sushi toppings. These days, ikura is used in a variety of dishes in both Japanese and Western cuisines. It’s served not just as a sushi topping but also as ikura-don (ikura on steamed rice), ikura kamameshi (ikura on rice cooked in a traditional iron pot), ikura spaghetti and so on. The Japanese have enjoyed ikura for a long time, but due to the recent growing popularity of sushi and Japanese cuisine worldwide, ikura is now enjoyed by people around the world. Contents: - What is Ikura? - For ikura, freshness is crucial! - Nijiya’s carefully selected ingredient: Natural, Alaskan ikura - The nutritional value of ikura - How to cook Ikura? (Ikura Recipes) - Hearty Ikura-Don Recipe (rice bowl with a generous helping of salmon roe) - Daikon Salad (Japanese radish salad) Recipe - Ikura Colorful Salad Recipe - Tororo Soba with Ikura Topping Recipe - Delightful Appetizer Set Recipe - Spaghetti with Ikura and Mizuna Greens - Ikura Dip Recipe - Ikura chirashi Recipe - Harako-meshi Recipe - Ikura nama-harumaki (fresh spring roll) Recipe - Ikura Temaki Sushi Recipe - Oyako Pasta Recipe What is Ikura? Did you know that the word ikura derives from the Russian word “Ikra”? It means “fish eggs.” “Red ikra” means salmon roe (or ikura in Japanese) and “black ikra” means sturgeon roe (caviar). In Russian the word ikra refers to fish eggs in general. For ikura, freshness is crucial! The best part of eating ikura is that popping sensation in the mouth, which is produced by the tautness of the thin outer film and the softness of the roe itself. During the breeding season, salmon roe becomes tougher in order to ward off predators. So, the best ikura comes from salmon roe that’s harvested right before the breeding season, since it has a perfectly taut outer film and soft roe. The season for Alaskan salmon coincides with the season for ikura, which starts in June, peaks in July and lasts until August. Using the freshest roe is the key to producing delicious ikura that bursts in the mouth. To process salmon roe into ikura, the roe needs to be removed from its skein (a thin membrane that holds the roe in a cluster) and then carefully separated into individual eggs. These eggs are so delicate that they must be handled very gently, or they will be crushed. It’s the most intense moment for the food processors. The individual eggs are then flavored, becoming the ikura we eat. “Shio ikura” is seasoned only with salt, and “shoyu ikura” is marinated in soy sauce. Nijiya Market uses only the most carefully selected, high-quality ikura. Our ikura is delicious because it’s so fresh! Try it and enjoy the pleasant texture, that gives you that popping sensation! Nijiya’s carefully selected ingredient: Natural, Alaskan ikura Nijiya Market has an abiding preference for wild Alaskan salmon and the ikura processed from the roe of this fish. With our motto “healthy and gourmet,” we work hard to deliver safe, healthy products for the sake of our customers. You may wonder how wild, non-farmed Alaskan salmon can be safe and healthy. Alaska has an abundance of pristine natural regions, and many areas designated as national parks, quasinational parks, or national wildlife refuges. It has long been engaged in statewide efforts to protect its nature and wildlife, and fish catches are restricted to ensure that marine resources won’t be exhausted. In other words, the balance of nature is maintained by human hands. Wild Alaskan salmon breed freely in the vast, untouched nature of this region, and that’s why they’re full of rich, natural flavor. Nijiya’s buyer team travels all the way to Alaska, where it deals directly with producers and carefully selects quality marine products that thrive under harsh natural conditions. This is why Nijiya’s ikura are of the finest quality. Try our natural Alaskan ikura today! The nutritional value of ikura Ikura contains many nutrients. It’s especially rich in vitamins and minerals, and has more vitamins than egg yolks. Savoring its rich flavor as it pops against the palate and spreads throughout the mouth, it nourishes our bodies at the same time. Ikura is a healthy food source that can be enjoyed by everyone from children to grandparents. How to cook Ikura? (Ikura Recipes) Hearty Ikura-Don Recipe (rice bowl with a generous helping of salmon roe) Perfect with Rice! Ingredients (Serves 4) - 10 oz. shoyu ikura (salmon roe marinated in soy sauce) - 4 bowls of freshly cooked rice - Wasabi (Japanese horseradish) (to taste) - Yakinori (roasted seaweed) (to taste) Cooking Directions - Fill the bowls with rice. Top each bowl with l/4 serving of the Shoyu lkura and serve with yakinori and wasabi. Daikon Salad (Japanese radish salad) Recipe Just add ikura (salmon roe) and turn a simple salad into a gorgeous dish! Ingredients (Serves 1) - 5 oz. daikon (Japanese radish) - 1 oz. carrot - 3 sashimi-grade scallops - 1 oz. shoyu ikura - Pinch of white sesame seeds - Oil-free salad dressing (to taste) Cooking Directions - Slice each scallop horizontally into 4 or 5 evenly thin slices. - Julienne the daikon (Japanese radish) and carrot, and toss them with scallop slices. - Place salad mixture on a plate, place the ikura (salmon roe) on top and sprinkle with the sesame seeds. - Serve with your choice of oil-free salad dressing. Ikura Colorful Salad Recipe A healthy, sumptuous salad! Ingredients (Serves 2) - lkura (to taste) - 1 cucumber - 1 avocado - Atsuyaki tamago (Japanese omelet) (as appropriate, or optional) - Store-bought salad dressing (soy sauce based) Cooking Directions - Dice the cucumber, avocado and omelet, and place in a bowl. - Place the ikura on top and pour the dressing over it. Serve. Tororo Soba with Ikura Topping Recipe A delightful combination of marine food and mountain food Ingredients (Serves 2>) - 2 servings of soba noodles - About a 2-inch portion of tororo (grated mountain yam) - 4/5 cup Nijiya Soba-tsuyu (soba dipping sauce) - lkura (to taste) - Green onions (to taste) Cooking Directions - Bring a generous amount of water to a boil. Add the soba noodles. - Once the soba noodles are done, immediately drain and rinse under cold running water until no longer slippery. - Drain the soba noodles and place on a serving plate. - Pour the tororo over the soba and place the ikura and sliced green onions on top. Pour Nijiya Soba-tsuyu over and serve. Delightful Appetizer Set Recipe Excellent accompaniments to beer and sake lkura Cucumber Ingredients (Serves 1) - Shoyu-zuke ikura (marinated in soy Sauce) (to taste) - Cucumber (to taste) Cooking Directions - Cut the cucumber into 1- to 1.5-inch lengths and then cut each piece in half lengthwise. - Cut out the seeded portion (for each piece) to make a groove down the center of the cucumber. - Place the ikura in the grooves. Tamagoyaki (Japanese omelet) with ikura topping Cut an omelet into bite-size pieces and top each piece with ikura. lkura, Gunkan-Maki Style (battleship-shaped sushi rolls) Cut seaweed into small pieces. Wrap the ikura with the seaweed in the gunkan-maki style, and serve. Spaghetti with Ikura and Mizuna Greens The ultimate Japanese-style pasta dish! Ingredients (Serves 1) - 2 Tbsp. shoyu-zuke ikura (ikura marinated in soy sauce) - 1 serving of spaghetti - 1/2 bunch mizuna greens (Japanese mustard greens) - 1 Tbsp. olive oil - Pepper (to taste) (optional) - 1 tsp. dashi stock powder Cooking Directions - Boil spaghetti. Shortly before the spaghetti is done, add the mizuna greens (cut into one-inch lengths) to the same pot, Drain the spaghetti and the mizuna together. - Toss the cooked spaghetti with olive oil. (Add pepper if you like.) - Dissolve the dashi powder in the ikura marinade liquid, and add it to the spaghetti. - Top with the ikura and serve. Note: If you prefer crisp mizuna, use it raw. Ikura Dip Recipe Serve on crackers as an appetizer Ingredients (Serves 1) - 2 Tbsp. ikura - 1/2 cucumber - 1 avocado - Lemon juice (to taste) - 3 Tbsp. cream cheese - Dash of salt - 2 Tbsp. water Cooking Directions - Finely slice the cucumber, rub in salt to soften. Remove the seed from the avocado. Chop and sprinkle with lemon juice. - Soften the cream cheese by adding salt water. - Combine the cucumber, avocado, and ikura. Ikura chirashi Recipe Ingredients (Serves 4) [Sushi rice] - 3 cups rice - 4-inches kombu - 3 Tbsp. sake (cooking sake) - 3 cups water - 5 Tbsp. vinegar - 1-1/2 Tbsp. sugar - 2 tsp. salt - 2-1/2 tsp. mirin (sweet cooking rice wine) - 7 oz. ikura - 8 snow peas - 3 shiitake mushrooms [A] - 2 tsp. soy sauce - 2 tsp. sugar - 1 tsp. mirin (sweet cooking rice wine) - 3/4 cup soup stock - 8 deep-water shrimp - Kinshitamago (thinly shredded egg omelet) (as desired) - Vinegar(to taste) - Salt (to taste) Cooking Directions - Sushi rice: wash the rice and set aside for 30 minutes. Add all the ingredients for sushi rice and cook. Once cooked, mix together and allow to steam. - Remove stems from the mushrooms and thinly slice. Cook them in a pot with the ingredients from “A”. - Remove strings from the snow peas, thinly slice, rub in a dash of salt, quickly cook in a pot of boiling water and drain in a colander. - Arrange sushi rice on a plate and aesthetically garnish with the ikura, peas, mushrooms, and shrimp. Harako-meshi Recipe Harako-meshi is a well-known dish of Miyagi Prefecture. In that region, ikura is called “harako.” Ingredients (Serves 4) - 2 cups cooked rice - 3 slices fresh salmon - Harako (ikura) (as desired) [A] - Slightly less than 1/2 cup soy sauce - 4 Tbsp. sake (cooking sake) - 3 Tbsp. mirin (sweet cooking rice wine) - 2 Tbsp. sugar Cooking Directions - Peel the skin from the salmon slices and thinly slice the flesh at an angle. Save the skin to be used in the broth. - Pour “A” in a skillet. Add the salmon skin and heat to a boil to draw out umami from the skin. Bring it to a boil a second time, and remove the skin. - In the skillet from Step 2, place salmon slices so as not to overlap and cook. Remove the salmon from the skillet. Serve the cooked rice in a bowl. Pour the broth on top and mix it into the rice. Place the desired amount of salmon and ikura on top and the dish is ready to serve. Ikura nama-harumaki (fresh spring roll) Recipe Ingredients (Serves 2) - lkura - Imitation crab meat - Lettuce - Cucumber - Nori - Fresh spring rolls - Nijiya Brand Goma Dare (sesame sauce) Cooking Directions - Finely slice the cucumber. - Place the ikura, imitation crab meat and cucumber on the lettuce and wrap with nori. - Reconstitute the fresh spring rolls according to package directions. Stuff with the ingredients from Step 2. - Serve with Nijiya Brand Goma Dare. Ikura Temaki Sushi Recipe Ingredients - Ikura - Sushi rice - Lettuce - Nori Cooking Directions - On a sheet of nori, place a lettuce leaf. - Spread the sushi rice on top. - Add a payer of ikura and wrap. Oyako Pasta Recipe Ingredients (Serves 2) - 6 oz. spaghet - 4 Tbsp. soy sauce - Marinated ikura - 2 slices salmon (marinated overnight in a sauce of 1 Tbsp. each of sake, mirin, soy sauce) - 1 pack king trumpet mushrooms - 1/2 bunch spinach - 2 Tbsp. white wine - 1/2 clove garlic - 2 Tbsp. olive oil - Dashes of salt and pepper - Dab of butter Cooking Directions - Cut the salmon slices into largish bite-sized pieces. Tear the king trumpet mushrooms by hand. Quickly cook the spinach in a pot of salted boiling water, and cut into bite- sized pieces. Finely mince the garlic. Cook the spaghetti. - Place the olive oil and garlic in a skillet and heat. When the arorna begins to rise, add the salmon pieces and saute. When the color begins to change on the surface, add the wine, mushrooms, cooked spaghetti, and spinach. Adjust the flavor by adding salt, pepper, and butter to taste. - Serve on a plate generously garnished with ikura. Salmon and Salmon Roe Sushi in a Cup Recipe Ingredients (Serves 2) - 2 cups cooked rice - 2 Tbsp. sushi vinegar - 3 Tbsp. salmon roe - 3 Tbsp. salmon flakes - 1/2 cucumber, grated - 2 tsp. white sesame seeds Cooking Directions - Mix the warm cooked rice and sushi vinegar to make sushi rice. Add the salmon flakes and white sesame, and mix. - Place the sushi rice in a cup. Top with grated cucumber and salmon roe."
}