{
  "url": "https://variety.com/2024/music/obituaries-people-news/melanie-dead-brand-new-key-singer-woodstock-1235886892/",
  "title": "Melanie Dead: Singer of 'Brand New Key' and 'Lay Down' Was 76",
  "text": "Melanie, the singer who performed at Woodstock in 1969 and had major pop hits with “Brand New Key” and “Lay Down (Candles in the Rain)” in the early ’70s, died Tuesday at age 76. News of the death came from her publicity firm, Glass Onyon PR. No information on the cause of death was immediately given. But Melanie — full name Melanie Safka — had been in the studio earlier this month working on a new record of cover songs, “Second Hand Smoke,” for the Cleopatra label; it would have been her 32nd album, the label said. Her three children, Leilah, Jeordie, and Beau Jarred, posted a message on Facebook, writing: “We are heartbroken, but want to thank each and every one of you for the affection you have for our Mother, and to tell you that she loved all of you so much! She was one of the most talented, strong and passionate women of the era and every word she wrote, every note she sang reflected that. Our world is much dimmer, the colors of a dreary, rainy Tennessee pale with her absence today, but we know that she is still here, smiling down on all of us, on all of you, from the stars.” Popular on Variety Her children asked that tonight (Jan. 24), at 10 p.m. CT, “each of you lights a candle in honor of Melanie. Raise, raise them high, high up again. Illuminate the darkness, and let us all be connected in remembrance of the extraordinary woman who was wife, mother, grandmother, great-grandmother and friend to so very many people.” Melanie’s first pop hit was “Lay Down (Candles in the Rain),” a gospel-flavored collaboration with the Edwin Hawkins Singers that reached No. 6 on the Hot 100 in 1970. It was followed in 1971 by “Brand New Key,” an inescapable hit that was taken as a sort of children’s tune by some and full of sexual innuendo by others. It reached No. 1, and was her only other top 10 hit in the U.S. In the UK, she also reached the top 10 with a cover of the Rolling Stones’ “Ruby Tuesday.” “It was the bane of my existence for a few years,” Melanie told the Guardian in 2021 about “Brand New Key,” which was perceived by many as a novelty song, due to its childlike tone. The singer said it was composed as a blues tune, but she sped it up in search of greater commercial appeal. Melanie did not always get her due in the male-dominated folk-rock scene of the time, and was too rarely mentioned even in the company of female artists like Joni Mitchell. She speculated with the Guardian about why that might have been: “It wasn’t the age of smiling women,” she said. “It had to be much more broody and I was way too cherubic. Men can be cute. Randy Newman can sing ‘Short People’ and that’s OK because he’s a guy, he’s got something to say. But a girl? How could she possibly have any social significance?” Safka was born in Astoria, New York on Feb. 3, 1947 and raised in Queens. She studied at the American Academy of Dramatic Arts, but it was her interest in performing at the folk clubs of Greenwich Village that would lead to her ultimate career path. She was a virtual unknown when she was helicoptered into the Woodstock Festival in 1969, before she had any hits on the radio. In 1989, and again in 2019, as the festival reached landmark anniversaries, she wrote about the experience for Rolling Stone. “I had my first out-of-body experience. I was terrified,” she said. “I just left my body, going to a side, higher view. I watched myself walk onto the stage, sit down and sing a couple of lines. And when I felt it was safe, I came back. It started to rain right before I went on. Ravi Shankar had just finished up his performance, and the announcer said that if you lit candles, it would help to keep the rain away. By the time I finished my set, the whole hillside was a mass of little flickering lights. I guess that’s one of the reasons I came back to my body.” That experience was the basis of “Lay Down (Candles in the Rain),” her breakthrough hit, and possibly her most popular song today, despite “Brand New Key” having been more ubiquitous in its day. Candles lighting up became a trademark of her shows for about a year after that, Melanie said, and that song “became so connected with my concerts that my shows were getting banned because fire departments wouldn’t approve them,” she said. Her husband, producer and manager, Peter Schekeryk, died in 2010. She had been collaborating musically with her son Beau Jarred and daughters Leilah and Jeordie in recent years on recordings and in concert. The singer did not lack for respect from many prominent younger performers. Miley Cyrus enlisted her for a duet of Melanie’s “Look What They’ve Done to My Song, Ma” in 2015. More recently, Jarvis Cocker did a live, on-stage interview with her in the U.K. Melanie had her biggest hits at the outset of the ’70s with the Buddah label, which she left in 1971 to found her own label, becoming a pioneer for independent artists. She had recently signed with the L.A.-based Cleopatra label, which has been in the process of bringing together her entire post-Buddah catalog for reissue. In early January, according to her label, Melanie recorded a cover of Morrissey’s “Ouija Board Ouija Board” for a forthcoming tribute album celebrating his music. (Morrissey was known to be a fan of hers, having covered “Some Say (I Got Devil).”) She had also just cut a version of and Nine Inch Nails’ “Hurt,” for her planned covers album, “Second Hand Smoke.” Other songs she had recorded for the new record included Radiohead’s “Creep,” the Moody Blues’ “Nights In White Satin,” Depeche Mode’s “Enjoy the Silence” and David Bowie’s “Everyone Says Hi.” In their Facebook statement, the singer’s three children said, “We are planning a Celebration of Life for Mom and it will be open to all of you who want to come and celebrate her. The details will be announced as soon as they are in place. We look forward to seeing you there.”"
}