{
  "url": "https://driftboss.io/drift-boss-unblocked",
  "title": "Drift Boss Unblocked",
  "text": "Join us to play Drift Boss Unblocked, a funny car drifting game. Let's see how far you can drift a car, and improve your flexing and timing skills. Take a seat in the driver's seat, rev up the engines, and prepare for a race! Keep the drift car and collect the coins to unlock more vehicles in Drift Boss. This game is the sequel to the game Drift Boss. Coming to this game, you will still continue the original game's gameplay. However, there are improvements over the first version. Join this game now and enjoy! This game will give you more functions than the previous game. You will get not only daily rewards but also mini-quest rewards. First, you will get a loot box. You can open 1 card every 60 minutes by getting an hourly loot. Watching ads will get you premium loot. Open this chest to unlock 10 cards. These cards will be completely random in value. After that, the collected cards will be returned to your collection. In Card Assembly, you need to select 3 identical cards to assemble. Continue assembling to upgrade to level 5. Besides, in your collection, you can choose a level 5 car to drift. Therefore, collect as many cards as possible. Second, you can still receive rewards randomly after each play. Your prize may include cards. The Drift Boss Unblocked game can play on PC or Mobile. Control your unblocked car through difficult roads. You will face challenging turns. The continuous appearance of bends will confuse you. One turn follows another. Besides, the size of roads is different which makes different bends. Your bends can be big and they can also be small. They are intricately designed to challenge your driving abilities. Besides, you will also face rough roads. It can make your car jump. Try to keep your car safe, especially to avoid crashing into space. If you fall into space, the game will be over. In this game, the track is endless. Try to drive as far as possible to get the highest score possible. Remember to collect gold coins along the way to unlock new cars. New cars are always ready to open. There are different types of vehicles. Enjoy them for the ultimate driving experience! How to control: Press the left mouse button or space bar to drift to the right, and release the button to go left."
}