{
  "url": "https://www.cnbctv18.com/business/companies/meet-balaji-krishnamurthy-ubers-new-cfo-and-a-vocal-robotaxi-backer-19842506.htm",
  "title": "Meet Balaji Krishnamurthy, Uber’s new CFO and a vocal robotaxi backer - CNBC TV18",
  "text": "Balaji Krishnamurthy has been appointed chief financial officer of Uber Technologies Inc., signalling a pivotal leadership transition as the ride-hailing major sharpens its push into autonomous vehicles and long-horizon growth bets. Krishnamurthy, a six-year veteran at the company, currently serves as vice president of strategic finance and investor relations. In that capacity, he has worked closely with top management and shareholders, playing a central role in capital allocation decisions, financial planning and the company’s long-term investment roadmap. Also Read: Davos 2026 | Uber sees India as key market for mobility and technology innovation Krishnamurthy is widely known for his strong views in favour of autonomous-vehicle adoption and has publicly defended Uber’s driverless strategy against scepticism from some investors. His appointment comes as Uber continues to invest heavily in autonomous-technology partners, commits capital to robotaxi fleets and prepares for large-scale deployment of driverless rides on its platform. In his first public remarks as incoming CFO, Krishnamurthy told investors that Uber’s healthy free cash-flow generation provides flexibility to invest in autonomous vehicles, pursue potential mergers and acquisitions, and return capital to shareholders simultaneously. He said the company does not view these priorities as mutually exclusive. The ride-hailing and delivery company forecast adjusted earnings per share in the range of 65 cents to 72 cents for the current period, below the Bloomberg-compiled analyst estimate of 77 cents. The midpoint of its adjusted earnings before interest, taxes, depreciation and amortisation guidance also fell short of market expectations. Uber shares fell as much as 6.8% after markets opened in New York. Also Read: Uber to double Black fleet in India by 2026, adds airport zones and advance booking At the same time, the company projected gross bookings of $52 billion to $53.5 billion for the period, exceeding Wall Street estimates. Gross bookings, which include ride-hailing, delivery orders, and driver and merchant earnings but exclude tips, were supported by strong demand in the US market. In the fourth quarter, Uber’s total gross bookings rose 22% year-on-year to $54.1 billion, beating analyst estimates. The company said growth was aided by new product initiatives and higher engagement from subscribers to its Uber One membership programme. Krishnamurthy, a six-year veteran at the company, currently serves as vice president of strategic finance and investor relations. In that capacity, he has worked closely with top management and shareholders, playing a central role in capital allocation decisions, financial planning and the company’s long-term investment roadmap. He will succeed Prashanth Mahendra-Rajah, who steps down on February 16 after less than three years as CFO. Mahendra-Rajah will continue as a senior finance adviser until July 1 to ensure a smooth transition. Also Read: Davos 2026 | Uber sees India as key market for mobility and technology innovation Krishnamurthy is widely known for his strong views in favour of autonomous-vehicle adoption and has publicly defended Uber’s driverless strategy against scepticism from some investors. His appointment comes as Uber continues to invest heavily in autonomous-technology partners, commits capital to robotaxi fleets and prepares for large-scale deployment of driverless rides on its platform. In his first public remarks as incoming CFO, Krishnamurthy told investors that Uber’s healthy free cash-flow generation provides flexibility to invest in autonomous vehicles, pursue potential mergers and acquisitions, and return capital to shareholders simultaneously. He said the company does not view these priorities as mutually exclusive. The ride-hailing and delivery company forecast adjusted earnings per share in the range of 65 cents to 72 cents for the current period, below the Bloomberg-compiled analyst estimate of 77 cents. The midpoint of its adjusted earnings before interest, taxes, depreciation and amortisation guidance also fell short of market expectations. Uber shares fell as much as 6.8% after markets opened in New York. Also Read: Uber to double Black fleet in India by 2026, adds airport zones and advance booking At the same time, the company projected gross bookings of $52 billion to $53.5 billion for the period, exceeding Wall Street estimates. Gross bookings, which include ride-hailing, delivery orders, and driver and merchant earnings but exclude tips, were supported by strong demand in the US market. In the fourth quarter, Uber’s total gross bookings rose 22% year-on-year to $54.1 billion, beating analyst estimates. The company said growth was aided by new product initiatives and higher engagement from subscribers to its Uber One membership programme. (Edited by : Ajay Vaishnav)"
}