{
  "url": "https://www.naturalis.nl/en/science/biodiversity",
  "title": "Biodiversity | Naturalis",
  "text": "What isbiodiversity? Gogreen Get started with nature tips and help the biodiversity in your area. With these five tips you help nature in your garden, neighborhood, at your neighborhood club, association or vegetable garden and motivate your environment. Nature tips: this is how you go green View the tip sheet online or print the tip sheet and fold it in half (only available in Dutch). This way you always have your nature tips at hand. Participatein real research Naturalis conducts research into nature together with people like you and me. We use the results to increase our knowledge about biodiversity and for a better relationship between people and nature. See below which citizen science projects you can participate in. Beach Shell Count First time in the Netherlands On March 23, several Dutch nature organizations held a shell count on eight beaches in the Netherlands. Hundreds of people, including many families, counted a total of over 34,000 shells. Makeconscious choices By making conscious choices, we can make a difference together. For example, vote for a green party that is committed to a better living environment for people and nature. Your eating habits also affect nature worldwide. By making plant-based food choices, you reduce greenhouse gas emissions, such as CO2. So choose plant-based options whenever possible. Also, look critically at where you put your money. Among other things, you can opt for a bank that invests sustainably and has an eye for the interests of people, animals and nature. Discovernature in your area Get to know the wildlife, plants and mushrooms around you better with the ObsIdentify app. ObsIdentify recognizes a great diversity of wild flora and fauna based on photos, names them, and provides facts about these species. With your observations you help to improve the automated species recognition and you contribute to knowledge about nature. ObsIdentify Your observations and those of others contribute to knowledge of nature. They are part of research on these species. Download the ObsIdentify app, log in with a Waarneming.nl account and discover nature. Biodiversity HelpdeskAsk your question The Biodiversity Helpdesk is the place where everyone can get a scientifically substantiated answer to questions about biodiversity. Go to the Biodiversity Helpdesk and ask your question! Only available in Dutch. Get active yourself There's a lot we can achieve if we all pitch in together. Check out the Duch website www.maakgroengroener.nl to see what you can do. We all need biodiversity. To eat, to breathe, to enjoy. To be able to live. That is why we are committed to working together with more than 100 Dutch organizations (nature conservation organisations, farmers, knowledge institutions, banks, companies) to restore biodiversity. And you can also contribute to this by making gray greener. Newson biodiversity The latest news about biodiversity, but with just a little more depth."
}