{
  "url": "https://www.hearth.com/talk/threads/vermont-casting-dauntless.206923/",
  "title": "Vermont casting dauntless | Hearth.com Forums Home",
  "text": "I will start by saying that I have never spent so much time and effort into something and still lack proper understanding of operation. My frustration with this stove has been immeasurable. I just bought this stove, without a cat,this year as I moved into a new house, and replaced the old stove onto the existing chimney system. It is a wall exit setup with 2 90s and is probably a hair too short to meet normal standards. However, when the stove is running well, draft is not an issue. The stove did not pass inspection, and the chimney did not pass inspection because it was poorly attached, I addressed these issues. I am just so confused, I feel like every week the stove is running slightly different than the last, and I cannot even identify what is a “normal burn”. I understand that it will be different based on wood, draft, weather, etc. but this seems crazy how different it will operate. I thought I had a good system going I could load this stove 3-4 times a day, depending on temp, and the coal bed could be fairly small after an overnight burn, and it would take a little bit, but it would usually get up to a good burning temp. I thought this was going well, then I popped open the cleaning cap, and watched flakes of creosote pour out, about 2-3 handfuls. A whole bunch more flaked out when I swept it. I thought this may be a chimney problem, maybe some damaged insulation that was missed in the inspection that’s cooling off the smoke, but then I took apart the stove pipe and there was a concerning amount of creosote in there. Okay, so I am not running this thing hot enough, so now my goal is to run it as hot as possible. At this same time, the air control lever breaks, and in conversations with the stove installer, they said it is safe to run as long as I can control the fire, and I can see the flap in the back opening and closing as I move the lever. For some reason, this coincided with some very hot fires, I was basically having to make sure the air control was closed immediately, and it would burn super hot fires, while still staying in a safe range. I was like cool, but I still want this piece replaced. So they came and replaced the air control lever, awesome. Now my fires are not burning nearly as quickly. I can have very similar coal beds as I did a week ago, and the logs are smoldering. So I am now thinking, okay, I need to make sure I am really heating up the back plate more in order to heat the little air hissing as I reload to get it going. That sound is harder and harder for me to hear right now. It is taking more time for me to reestablish the fire after long burns, and has been somewhat inconsistent. I know the manual says to keep the thermostat on the griddle, and I do, and I follow the manual with all of my habits. I also have a stove pipe mounted fan, that spins from heat. I notice when the stove is combusting it’s best, the fan is blowing, and my understanding, is that it should be, because I want the smoke to be hot all the way through. I am looking at the stove right now, with the stove top temp at 600, and the fan hasn’t spun in almost an hour, and the smoke outside is far from 0% opacity. I do not expect anyone to read all of this and really have an answer. I am just at a complete loss, I don’t know what to do. I feel like there is something wrong with this stove, or I just got the wrong stove. I read reviews, but never got into any of the forums to read about how poor people’s experience is with this stove. Has anyone had success? What the folk can I do? I’m losing faith. I just bought this stove, without a cat,this year as I moved into a new house, and replaced the old stove onto the existing chimney system. It is a wall exit setup with 2 90s and is probably a hair too short to meet normal standards. However, when the stove is running well, draft is not an issue. The stove did not pass inspection, and the chimney did not pass inspection because it was poorly attached, I addressed these issues. I am just so confused, I feel like every week the stove is running slightly different than the last, and I cannot even identify what is a “normal burn”. I understand that it will be different based on wood, draft, weather, etc. but this seems crazy how different it will operate. I thought I had a good system going I could load this stove 3-4 times a day, depending on temp, and the coal bed could be fairly small after an overnight burn, and it would take a little bit, but it would usually get up to a good burning temp. I thought this was going well, then I popped open the cleaning cap, and watched flakes of creosote pour out, about 2-3 handfuls. A whole bunch more flaked out when I swept it. I thought this may be a chimney problem, maybe some damaged insulation that was missed in the inspection that’s cooling off the smoke, but then I took apart the stove pipe and there was a concerning amount of creosote in there. Okay, so I am not running this thing hot enough, so now my goal is to run it as hot as possible. At this same time, the air control lever breaks, and in conversations with the stove installer, they said it is safe to run as long as I can control the fire, and I can see the flap in the back opening and closing as I move the lever. For some reason, this coincided with some very hot fires, I was basically having to make sure the air control was closed immediately, and it would burn super hot fires, while still staying in a safe range. I was like cool, but I still want this piece replaced. So they came and replaced the air control lever, awesome. Now my fires are not burning nearly as quickly. I can have very similar coal beds as I did a week ago, and the logs are smoldering. So I am now thinking, okay, I need to make sure I am really heating up the back plate more in order to heat the little air hissing as I reload to get it going. That sound is harder and harder for me to hear right now. It is taking more time for me to reestablish the fire after long burns, and has been somewhat inconsistent. I know the manual says to keep the thermostat on the griddle, and I do, and I follow the manual with all of my habits. I also have a stove pipe mounted fan, that spins from heat. I notice when the stove is combusting it’s best, the fan is blowing, and my understanding, is that it should be, because I want the smoke to be hot all the way through. I am looking at the stove right now, with the stove top temp at 600, and the fan hasn’t spun in almost an hour, and the smoke outside is far from 0% opacity. I do not expect anyone to read all of this and really have an answer. I am just at a complete loss, I don’t know what to do. I feel like there is something wrong with this stove, or I just got the wrong stove. I read reviews, but never got into any of the forums to read about how poor people’s experience is with this stove. Has anyone had success? What the folk can I do? I’m losing faith."
}