{
  "url": "https://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/organic-food/art-20043880",
  "title": "Organic foods: Are they safer? More nutritious? - Mayo Clinic",
  "text": "Safe, healthy and budget-friendly foods are a grocery shopper's dream. Do organic foods make that dream come true? Maybe, but don't bypass foods and products grown using standard farming methods. There are benefits to both. People choose foods for many reasons. Factors such as what you like to eat, what you can afford and your values play into your purchases. Also, you may buy certain products based on your current health and the hoped-for future health effects of a certain diet. A healthy diet can include food grown organically or using typical farming methods, called conventional farming. But if you've wondered about organic food, here's how it compares with conventionally grown food. Thinking about adding organic foods to your diet? Here are tips for what to buy and how to make organic food less costly. What is organic food? Organic foods are items grown under specific conditions or products made with those foods. The organic food label says more about how an item was farmed than about the food itself. Organic farming is a type of agriculture that avoids the use of some typical farming practices. Organic farmers can't use some types of soil additives and fertilizers, genetic engineering, or radiation on their products. Organically farmed animals aren't given hormones for growth or antibiotics. Also, these animals get organic feed and must have the option to go outside. What organic food is not Organic doesn't mean the food was grown near you. Organic doesn't automatically mean the food has more nutrients. And while organic food is farmed differently from conventional food, both types of food need to meet the same set of safety standards in the United States. Is organic food healthier than conventional food? Getting the suggested amount of fruits and vegetables every day is more important than choosing those that are organic or conventionally farmed. When it comes to long-term health, studies find that organic food exposes consumers to less pesticide residue. People who eat the highest amount of organic food seem to have the fewest cases of a cancer called non-Hodgkin lymphoma. People who are pregnant might benefit from eating organic food. Contact with pesticides may be linked to pregnancy complications and problems with fetal development. People who eat recommended levels of vegetables, fruits and whole grains can limit their pesticide contact by choosing organic options. Aside from lessened contact with pesticides, proven links between health and organic food are less clear. People who buy organic food also tend to be more active, don't smoke and have a generally healthier diet pattern than the average. These traits are linked to having a lower risk of disease and fewer disease risk factors such as excess weight. So it's hard to say what specific role organic food plays. Nutrients in organic food It isn't clear whether organic food has more nutrients, such as vitamins and minerals, than does conventionally grown food. The level of nutrients in food depends on a host of factors. Nutrients may be different between varieties of a plant. Levels also depend on the quality of the soil, harvest time, and the way products are stored and for how long. Organic ingredients may be added to processed products that are high in calories, sodium or added sugar. So check the label of organic products as you would for any food. Is organic food safer to eat than conventional food? All food in the United States must meet the same safety standards regardless of how it's grown. But there are differences between organic and conventionally grown food. Organic food exposes people to less pesticide residue than does conventionally grown food. Unlike conventional foods, food labeled as organic can't be treated with radiation, a process called irradiation. When food is treated in this way, rays pass through the food, like sun passing through a window. Irradiation is done to kill bacteria and pests and to keep food from spoiling too quickly. In the U.S., certain foods, such as poultry, eggs in shells, spices, and fresh fruits and vegetables, may be treated with radiation. Both organic and conventionally grown food can be contaminated with bacteria, especially E. coli O157:H7 and Salmonella typhimurium. Organic or not, food can be made safer in several ways. Good habits for food safety Make food safety a habit with the food you choose and how you store and process it. Also, keep up with news on food and product recalls. - If you grow produce, follow safe practices. If you grow fruits and vegetables, don't use pesticides or use them as rarely as possible. - Focus on variety. Having a diverse plate helps fuel the body. It could help limit the amount of contact with specific pesticides too. - Buy fruits and vegetables that look fresh, without damage. If you notice a bruise or damage, trim it off before you wash the food. Toss anything that has mold on it or looks like it's gone bad. - Keep fruits and vegetables at the right temperature. That means things like strawberries or lettuce should be kept in the refrigerator, along with anything precut or sold ready to eat. - Don't wash your food unless you're ready to prepare it. And when you are ready, start your food prep by washing your hands. Use cold, flowing water and the action of your hand or a clean vegetable brush to wash produce. This helps remove some germs such as bacteria and some residue from natural or synthetic pesticides. Even if fruits or vegetables have a rind, such as with watermelon or squash, wash them before you cut or peel them. Use a clean vegetable brush instead of peeling fruit or vegetables such as apples or carrots. But throw away the leaves on the outside of leafy vegetables, such as lettuce or Brussels sprouts. Vinegar or baking soda can be used to clean fruits and vegetables, but these products can change the taste of food. Don't wash fruits or vegetables with other cleaning solutions, such as soap. Some washes might leave a residue, and some fruit could absorb the chemicals and make you sick. Is organic food more expensive than conventional food? Taken as a whole, organic food tends to be more expensive than conventional food. But there are ways to help lower the cost. - Buy in-season food from local organic farmers. - Check to see if you can join a community supported agriculture program, also known as a CSA. In a CSA, you pay a fee and then get a share of the foods harvested by the farm. In some areas, CSAs might be a cost-effective option. - Compare costs at stores in your area and online. - Buy frozen organic foods. - Buy bulk organic items, such as grains. About the organic label To get an organic label in the United States, products must have more than 95% certified organic ingredients. You also might see the words \"made with organic\" on a label. That means at least 70% of the ingredients are certified as organic. It also means the nonorganic ingredients were not farmed with any of the practices banned in organic production. In the United States, product packaging can tell you who checked to see that the farms or producers met organic standards. These certifying agencies are required for all large producers of organic food. Be aware that other terms, such as natural, aren't certified in the United States and don't mean the same thing as organic. So consumers must do their own research to figure out what those terms mean on each product. The choice to buy organic The best choice between organic or conventional food is the one that puts the highest amount and variety of fruits, vegetables and grains in the diet. There are ways to fit organic foods into a budget. And research finds that organic foods expose consumers to less pesticide residue. Avoiding contact with pesticide residue may be particularly important for people of some ages and stages of life, such as during pregnancy. But all foods in the United States must meet the same safety standards. So if you can't find organic foods near you or they don't fit into your budget, conventionally grown foods also are safe and nutritious."
}