{
  "url": "https://www.usatoday.com/story/sports/nascar/2026/02/04/nascar-clash-2026-tv-channel-streaming-race-time/88387017007/",
  "title": "NASCAR Cook Out Clash live updates: TV, stream, race time and results",
  "text": "NASCAR Cook Out Clash updates: Live results and how to watch race today It’s finally time to start your engines, NASCAR fans. The 2026 season begins Monday night when Cup Series drivers take the green flag for the Cook Out Clash exhibition race at Bowman Gray Stadium in Winston-Salem, North Carolina. The race was originally scheduled for Sunday, but winter weather caused it to be postponed. The 200-lap race will take place on the short track inside the stadium that hosts Winston-Salem State University football games. Twenty-three drivers will participate in the main event, following a Last Chance Qualifier immediately before the Cook Out Clash. While no points will be awarded and the race has no effect on the 2026 season standings, there is prize money to be won (the total purse in 2025 was $3,002,500). The event also provides drivers a chance to get reacclimated to race conditions before the action shifts to Daytona International Speedway and the iconic Daytona 500 on Feb. 15. Chase Ellliott dominated the 2025 Clash after leading 171 of 200 laps. Will the Hendrick Motorsports driver repeat, or will another driver claim the prize? Here’s how to watch the 2026 NASCAR Cook Out Clash: Ryan Preece retakes the lead at lap 156 Ryan Preece retook the lead with authority during the 156th lap to move ahead of Shane van Gisbergen. Preece made a move inside of van Gisbergen. Preece has remained in the lead through lap 161. Caution flag out for Kyle Larson There was a delay in the action for a caution flag. Kyle Larson's car stalled after running out of fuel during the 153rd lap. According to the Fox broadcast, the race has seen 152 green-flag laps but has also seen 133 laps that were under caution. Short track, short tempers Daniel Suarez was tailing Bubba Wallace during a restart and giving him the business. Wallace responded by slamming his No. 23 car into Suarez's No. 7. Carson Hocevar takes his first lead of the race Lead changes have been minimal, but through all the cautions, stoppages, and restarts, it was Carson Hocevar who came out with the lead, and a sizable one at that. It appears drivers are getting more aggressive in the middle of the pack as well. We've had several close calls and four-stacks going around corners already, which have nearly resulted in catastrophe. But cautions have been avoided entirely. Small pile up on 122 The restart took longer than expected, but perhaps the weather is still playing a factor. Just 20 laps after the restart, that's 5 miles of total track and we had our biggest collision of the night, a three-car trap that included Bubba Wallace, Austin Cindric, and Ryan Blaney. Both Wallace and Cindric had already experienced minor spins earlier in the race. Their opportunities to return to the front of the pack just got harder. Short stoppage Just over halfway through the race (102 laps in), a short stoppage — expected to be ten minutes — has been called due to inclement weather. The rain has gotten serious enough that the drivers are suffering slippage. The drivers will swap tires to rubber more suited for wet conditions and the race will resume shortly. Kyle Larson loses lead Despite leading for nearly the entire race, with Chase Briscoe trailing close behind, it was William Byron who would be the first person to take the lead from Larson. Larson has fallen back drastically, down to eighth. The restart after a spinout from Austin Cindric gave Byron all the room he needed to take advantage. We're on lap 83, closing in on halfway. Bubba Wallace suffers minor spin out lap 53 It's been a tough go for most racers so far. In fact, for many of the drivers, positions haven't changed from where we started. However, we finally got our first real shakeup as a small bump caused Bubba Wallace to suffer a minor spin out. The setback was nothing serious as Wallace was back in the race just moments later, but it was the first major shakeup in the race since it started. Kyle Larson remains out in front with a solid lead more than a quarter of the way through the race. Moment of silence for Greg Biffle prior to race Prior to Wednesday's race, the crowd at Winston-Salem in North Carolina had a moment of silence in honor of Greg Biffle who died in a plane crash on December 18, 2025 in North Carolina. The moment of silence was followed up with motivational speeches and a rendition of The Star-Spangled Banner from officers in the Winston-Salem police department. The race begins next. What time is the NASCAR Cook Out Clash? The 2026 Cook Out Clash is scheduled for Wednesday, Feb. 4 at 6 p.m. ET. It will be preceded by practice sessions and qualifying beginning at 11 a.m. ET, a Last Chance Qualifier at 4:30 p.m. ET and a pre-race show at 5:30 p.m. ET. What TV channel is the NASCAR Cook Out Clash on? The 2026 Cook Out Clash will be televised nationally on FOX at 6 p.m. ET on Wednesday, Feb. 4. Practice and qualifying will be televised live on FS2 Wednesday at 11 a.m. ET. The Last Chance Qualifier can be seen on FOX and HBO Max at 4:30 p.m. ET. Will there be a live stream of the NASCAR Cook Out Clash? The 2026 Cook Out Clash can be streamed on FoxSports.com and the Fox Sports app. All NASCAR races on Fox or FS1 can also be streamed on Fubo, which is offering a free trial. Stream the Cook Out Clash on FuboHow do drivers advance to the NASCAR Cook Out Clash The 20 fastest drivers in qualifying will advance to the main event. The remaining 18 drivers will fight for two transfer spots in the Last Chance Qualifier. The top two finishers in the LCQ will advance to the main event, with a provisional reserved for the driver who finished highest in 2025 driver points that did not otherwise advance. NASCAR Cook Out Clash: How to watch - Date: Wednesday, Feb. 4 - Location: Bowman Gray Stadium (Winston-Salem, North Carolina) - Time: 6 p.m. ET - TV channel: Fox - Streaming: FoxSports.com, Fubo Our team of savvy editors independently handpicks all recommendations. If you purchase through our links, the USA TODAY Network may earn a commission. Prices were accurate at the time of publication but may change."
}