{
  "url": "https://goshenindiana.org/",
  "title": "City of Goshen, Indiana",
  "text": "Welcome to the City of Goshen, Indiana The City of Goshen, Indiana, also known as “The Maple City,” offers a vibrant, welcoming community for residents and visitors alike. This resource connects you to local government services, community planning, recreational activities, and upcoming events. In Goshen, neighbors come together to support one another and work for the common good. Our richly diverse community thrives with a spirit of inclusion, collaboration, and generosity. You’ll find retirees, young professionals, and families enjoying concerts, First Fridays, and downtown’s vibrant charm. Discover why Goshen is an exceptional place to live, work, and visit. Everything truly comes together here. What’s Happening in Goshen Now Photos: Cops & Kids Celebrates the Holiday Season in Goshen The 2025 Cops & Kids event brought Goshen police officers and local children together for an evening of holiday cheer. Officers met their assigned children at the VFW, posed for photos and joined in games before traveling together for holiday shopping at Meijer. The group returned to the VFW for pizza, gift wrapping, raffles and prize drawings to close out the night. Goshen High School Band Earns National Award, Keys to the City The Goshen High School Band program is the 2025 recipient of the prestigous Phi Beta Mu Earl D. Irons Program of Distinction Award, one of the most respected honors in music education. In recognition of the honor, Mayor Gina Leichty awarded Co-Band Directors Tom Cox and Josh Kaufman keys to the City and proclaimed Dec. 17, 2025 as “Goshen High School Band Excellence Day.” Recent Headlines - Goshen Trash Collection Delayed Due to Winter Weather - Where to Find Cold Weather Safety and Warming Shelters in Goshen - Cold Weather Water Safety Tips to Protect Your Home - Public Hearing Notice: Goshen Water Utility Rates and Charges - Public Hearing Notice: Goshen Sewer Utility Rates and Charges - Goshen Leaf Pickup resumes; Christmas tree collection begins"
}