{
  "url": "https://www.llbean.com/llb/shop/510622?page=my-llbean-account",
  "title": "My L.L.Bean Account",
  "text": "My Account Forgot Your Password? Click \"Forgot your password?\" on the login screen and follow the instructions. We'll verify your identity first, and then you'll be able to choose a new password. (Please note Passwords are case sensitive.) How to Create an Account Click here and follow the instructions on the screen. Need help? Contact us. Passwords For a stronger password, we recommend using a combination of characters, including at least one uppercase letter, lowercase letter, number and special character. Passwords can’t contain your first name (as it appears on your account) or email address. For example, if the first name on your llbean.com account is “Tim”, your password cannot contain “Tim”. If the first name on your llbean.com account is a just single letter, like “A”, then your password cannot contain the letter “A”. Forgot Your Password? - Click \"Forgot your password?\" and enter your email address for your account. - Click the CONTINUE button. - Within 10 minutes (but in most cases much sooner) you will receive an email containing your verification code. If you accidentally close the window at this point, you can repeat step 1 and 2 using the same code, which is good for 30 minutes. - Enter the verification code. - Enter a new password and click the CHANGE PASSWORD button. Didn't receive an email verification code? - No longer have access to the email address? You will need to create an account using a valid email address that you can access. - Check Junk/Spam/Promotions folders. Check these folders to see if our email got stuck there. - Add us to your contacts. To help our emails arrive in your inbox, add llbean@e5.llbean.com to your address book Addresses and Personal Information Once you have created an account with llbean.com, you can log in to enter or update your billing address and personal shipping address, and to add or update addresses in your Address Book. Use your Address Book to store shipping addresses under nicknames of your choice. Then, when you're ready to order, you can quickly choose from your list of nicknames to access saved addresses. Email Preferences To manage the emails you'd like to receive from L.L.Bean, log in to your account and then choose \"Email Settings\". Your email address will be used only for L.L.Bean email updates and will not be released to third parties. For more details, read our privacy policy. To unsubscribe from emails, click the “unsubscribe” link included in every email and follow the instructions. From your account you can also subscribe to email updates, update the email address on your current email subscription, or change how often you receive L.L.Bean promotional email. Please note that updating your email address in your profile will also update the email address used as the Login ID for your account. We use this email address to send notifications such as order confirmations and tracking information. Catalog Preferences To change the frequency or type of catalogs you receive from us, log in to your account, click \"Catalog Settings\" and then view \"Update Catalog Mailing Preferences\". You can also contact us directly if you'd like to: 1. Eliminate duplicate catalogs. 2. Limit the L.L.Bean catalogs you receive. 3. Keep your name off our shared lists. 4. Take your name off our mailing list. 5. Continue to receive catalogs at a new address. (Please send us the new information and timeframe it will be in effect.) L.L.Bean® Mastercard® If you’re a cardmember, use this link to manage your account: View Mastercard Account. Please be aware, this link takes you off llbean.com."
}