{
  "url": "https://www.hoopshq.com/rankings/bracketology-2026-mens-ncaa-tournament-projections-4",
  "title": "Bracketology: Men's 2026 NCAA Tournament Projections - Hoops HQ",
  "text": "It was a very good weekend for all projected No. 1 seeds as Arizona, Duke, Michigan and UConn came away with convincing victories. As we step into February, we are beginning to see a little bit of separation at the top of the seed list as these four teams have now been there for the last couple of weeks. That doesn’t mean things can’t change, but to me, these are the clear four best teams in the country at the moment. Pay attention to the order of these teams as well. Particularly Duke and UConn. If Duke winds up as the better overall No. 1 seed, it will likely play in the East region in Washington, DC, while UConn would be in the South region in Houston as the Blue Devils would be placed closer to home. When it comes to the bubble, things are a bit more cloudy. Since San Diego State lost at Utah State on Saturday, there is now one additional at-large spot. And that doesn’t make things easier by any means. One team that dropped out of the field for the first time is Miami (FL). The Hurricanes lost at home to Cal on Saturday and when you dive in and look at their resume, you’ll see that they have not beaten ANY current at-large teams. They also have a Q3 loss to Florida State. Miami (FL) can easily get back into the field due to top 45 resume-metrics, but for now the Hurricanes are my first team out. Here are a few thoughts regarding today’s bracket: - Texas A&M is the clear surprise team in the SEC. The Aggies handled Georgia on the road on Saturday 92-77 to improve to 7-1 in conference play. Yes, that’s first place. They’ve also won at Auburn and at Texas. A sizeable battle is on tap Wednesday as Texas A&M heads to Alabama. This will be the Aggies biggest test of the season and a win has the potential to leap frog their projected seed up multiple seed lines. - Ohio State got off to a 15-4 lead at Wisconsin on Saturday, but was unable to pick up the quality win as it fell 92-82. The Buckeyes entered the weekend as one of my last four teams in the field, but their resume as a whole is very suspect. Their best win of the season came at home against UCLA, a fellow fringe bubble team. Other than that? No wins over likely at-large teams. Ohio State heads to Maryland on Thursday before a home contest against Michigan. - Indiana followed up its biggest victory of the season on Tuesday against Purdue with a double overtime win at fellow bubble team UCLA. The Hoosiers had a great week of results and went from being a team that was far out of the field to a team that is now relatively safe in the field. What also helps them is the fact that they have top 30 predictive metrics. That means if this team is able to get selected into the field, their seed will get boosted in large part due to these metrics. - In a game that had major bubble implications, California came away with the win at Miami (FL) by a score of 86-85. It’s a big win for Cal, who also has wins over UCLA, UNC and at Stanford. Conversely, the loss for the Hurricanes is a problem. You know how many wins they have over teams currently in the field? The answer is zero. - UCF continues to build a very solid resume as it beat Texas Tech on Saturday 88-80. The Knights also own wins over Kansas and at Texas A&M. They are now 3-4 versus Q1 opponents and remain undefeated (14-0) against Q2, Q3 and Q4 opponents. On top of that, they boast top 25 result-based metrics. UCF now gets to play with house money as it heads to Houston on Wednesday. Last 4 Byes USC, St. Mary’s, New Mexico, UCLA Last 4 In Texas, California, Virginia Tech, Missouri First 4 Out Miami FL, George Mason, Seton Hall, Ohio State Next 4 Out Santa Clara, San Diego State, Oklahoma State, TCU"
}