{
  "url": "https://www.nyctourism.com/",
  "title": "NYC Tourism + Conventions | Explore the Best Things to Do in NYC",
  "text": "WELCOME TO NEW YORK CITY There's no time like the present to plan a trip to New York City, with its constant energy and endless supply of sights, attractions and activities. Don't wait—a second spent in NYC is just too valuable to miss. Things to Do Indoors in NYC Don't let a little bad weather ruin your day. Explore New York City while staying cozy and dry. What’s Good in NYC What’s good in New York City? Everything. From delicious eats and iconic sights to our diverse neighborhoods and easily accessible transportation, there’s no better adventure than exploring the five boroughs. Plan your visit now to experience all the thrills of the world’s most welcoming city. ABOUT THE FIVE BOROUGHS So what’s a “borough,” anyway? It’s like a smaller city within our massive metropolis. New York City has five of them. Bronx Island THINGS TO DO No matter what you’re into, you’ll find the best of it in New York City. See upcoming events and other Citywide highlights below. Founded By NYC Learn about the City's past and how to experience milestones in its history today. FIND YOUR NEXT BUDGET ACTIVITY Explore live TV tapings, free festivals and city parks. MAPS & GUIDES NYC is one of the world's most diverse destinations. Explore the City's many cultural enclaves and see the five boroughs from every angle. Zaakirah Muhammad: Accessibility Personal Essay A visitor with vision and hearing disabilities shares her experiences planning a trip to the City and getting around once there. SAVOR NYC Whether you’re looking for neighborhood eateries, global flavors or immersive cuisine, finding a delicious experience in any part of the City is almost effortless. The History of NYC Restaurant Week Discover the story of how one week in 1992 changed NYC dining forever. WHERE TO STAY NYC offers accommodations to fit every taste. Whether you’re looking to visit nearby attractions or be in the center of it all, these hotels will make the City your home away from home. NYC Hotel Week Book now for stays between Jan 2–Feb 12, 2026, and enjoy this epic city your way. From reunions to romantic weekends, group trips or solo escapes, you’ll find the perfect spot to rest and recharge in the City."
}