{
  "url": "https://en.wikipedia.org/wiki/List_of_diplomatic_missions_in_the_United_States",
  "title": "List of diplomatic missions in the United States - Wikipedia",
  "text": "List of diplomatic missions in the United States This is a list of diplomatic missions in the United States. At present, 175 nations maintain diplomatic missions to the United States in the capital, Washington, D.C. Being the seat of the Organization of American States, the city also hosts missions of its member-states, separate from their respective embassies to the United States. Eight nations also attribute their missions at the United Nations in New York City as their official embassies to the United States. However, only those offices in New York City that serve as an official diplomatic mission to the United States are listed here. For a complete list of diplomatic missions to the United Nations, see List of current permanent representatives to the United Nations. Only diplomatic missions operated by a foreign country are listed here. Honorary consulates, typically private offices designated to provide limited services on behalf of a foreign country, are not listed. Embassies in Washington, D.C. [edit]The following 175 countries maintain embassies in Washington, D.C. as their primary diplomatic missions to the United States. Entries marked with an asterisk (*) have chanceries (embassy buildings) located on or near a portion of Massachusetts Avenue known as Embassy Row. - Albania - Algeria - Angola - Antigua and Barbuda - Argentina - Armenia* - Australia* - Austria - Azerbaijan* - Bahamas* - Bahrain - Bangladesh - Barbados - Belarus - Belgium - Belize* - Benin - Bolivia* - Bosnia and Herzegovina - Botswana - Brazil* - Brunei - Bulgaria* - Burkina Faso* - Burundi - Cambodia - Cameroon* - Canada[1] - Cape Verde* - Central African Republic* - Chad - Chile* - China - Colombia - Congo-Brazzaville - Congo-Kinshasa - Costa Rica - Croatia* - Cuba - Cyprus* - Czech Republic - Denmark* - Djibouti - Dominica - Dominican Republic - Ecuador - Egypt - El Salvador[2] - Equatorial Guinea - Eritrea - Estonia* - Eswatini - Ethiopia - Fiji - Finland*[3] - France - Gabon - Gambia - Georgia - Germany - Ghana - Greece* - Grenada - Guatemala* - Guinea - Guyana - Haiti* - Holy See* - Honduras - Hungary - Iceland* - India* - Indonesia* - Iraq*[4] - Ireland* - Israel - Italy* - Ivory Coast* - Jamaica - Japan*[5] - Jordan - Kazakhstan - Kenya - Kosovo[6] - Kuwait - Kyrgyzstan* - Laos - Latvia* - Lebanon - Lesotho* - Liberia - Libya - Liechtenstein - Lithuania - Luxembourg* - Madagascar* - Malawi* - Malaysia - Maldives - Mali - Malta - Marshall Islands* - Mauritania - Mauritius - Mexico[7] - Micronesia[8] - Moldova - Monaco - Mongolia - Montenegro - Morocco - Mozambique - Myanmar - Namibia - Nepal - Netherlands - New Zealand* - Nicaragua - Niger* - Nigeria - North Macedonia - Norway* - Oman - Pakistan - Palau - Panama - Papua New Guinea* - Paraguay* - Peru* - Philippines*[9] - Poland - Portugal*[10] - Qatar - Romania* - Russia - Rwanda - Saint Kitts and Nevis - Saint Lucia - Saint Vincent and the Grenadines - Saudi Arabia - Senegal - Serbia[11] - Sierra Leone - Singapore - Slovakia - Slovenia - Somalia - South Africa* - South Korea* - South Sudan - Spain - Sri Lanka - Sudan* - Suriname - Sweden - Switzerland - Syria[12] - Tajikistan - Tanzania - Thailand - Timor-Leste* - Togo* - Trinidad and Tobago* - Tunisia* - Turkey* - Turkmenistan* - Uganda - Ukraine - United Arab Emirates - United Kingdom* - Uruguay - Uzbekistan* - Vietnam* - Yemen - Zambia* - Zimbabwe Permanent Missions to the Organization of American States (OAS) in Washington, D.C. [edit]The following member-states maintain permanent missions to the Organization of American States. Member-states not listed here have their ambassadors to the United States concurrently accredited to the organization[13] Other missions/delegations to the United States in Washington, D.C. [edit]The following countries or entities have missions in Washington, D.C., though they may not have full diplomatic relations with the United States government. Missions in New York City [edit]New York City, the largest city in the United States, is home to the General Assembly of the United Nations, and all 195 member and observer states send permanent delegations. Nine diplomatic missions in New York City listed below are also formally accredited as each country's official embassy to the United States. There are 107 missions in the city. All are consulates-general unless otherwise noted. - Albania - Algeria[19] - Angola - Antigua and Barbuda - Argentina[19] - Armenia - Australia[19] - Austria - Bahamas - Bahrain - Bangladesh - Barbados[19] - Belgium - Bhutan[22] - Bolivia - Brazil[19] - Bulgaria - Burkina Faso[23] - Canada[19][1] - Chile[19] - China[19] - Colombia - Costa Rica[19] - Croatia - Cyprus - Czech Republic - Denmark - Dominica - Dominican Republic[24] - Ecuador[19] - Egypt - El Salvador[19][2] - Finland[3] - France - Gabon (Consulate) - Georgia[19] - Germany - Ghana - Greece - Grenada - Guatemala[19][25] - Guyana - Haiti - Honduras[19] - Hong Kong, China (Economic and Trade Office)[19] - Hungary - India[19] - Indonesia[19] - Ireland[19] - Israel[19] - Italy[19] - Ivory Coast[19] - Jamaica - Japan[5] - Kazakhstan[19] - Kenya - Kosovo[6] - Kuwait - Lebanon[26] - Lithuania - Luxembourg - Malaysia[19] - Mexico - Monaco[19] - Montenegro - Morocco - Nepal - Netherlands - New Zealand - Nicaragua - Nigeria[19] - Northern Cyprus (Representative Office)[27] - North Macedonia - Norway - Pakistan - Panama - Paraguay - Peru - Philippines[19][9] - Poland - Portugal[10] - Romania - Russia - Saint Kitts and Nevis - Saint Lucia - Saint Vincent and the Grenadines - Saudi Arabia - Senegal - Serbia[11][19] - Singapore (Consulate) - Slovakia - Somalia - South Africa - South Korea - Spain - Sri Lanka - Sweden - Switzerland - Taiwan (Economic & Cultural Office)[16] - Thailand - Trinidad and Tobago - Turkey[19] - Ukraine - United Arab Emirates - United Kingdom - Uruguay - Uzbekistan - Vietnam Cities with ten or more consular missions [edit]The following major cities are host to career consular missions; all of whom are consulates-general unless indicated otherwise. Los Angeles, California [edit]Los Angeles, the second-largest city in the United States, is home to 64 consular missions, more than any other city on the West Coast and any U.S. city except Washington, D.C. and New York City. Many of these consulates are located along Wilshire Boulevard. - Argentina[28] - Armenia[28] - Australia[28] - Austria[28] - Azerbaijan[28] - Bahamas[28] - Bangladesh[28] - Belgium[28] - Belize[28] - Bolivia[28] - Brazil[28] - Bulgaria[28] - Canada[28][1] - Chile[28] - China[28] - Colombia[28] - Costa Rica[28] - Croatia[28] - Czech Republic[28] - Dominican Republic[28][24] - Ecuador (Consulate)[28] - Egypt[28] - El Salvador[28][2] - Finland[28][3] - France[28] - Germany[28] - Greece[28] - Guatemala[28][25] - Honduras[28] - Hungary[28] - India[29] - Indonesia[28] - Iraq[28][4] - Ireland[28] - Israel[28] - Italy[28] - Japan[28][5] - Kenya[28] - Kuwait[28] - Lebanon[28][26] - Lithuania[28] - Malaysia[28] - Mexico[28][7] - Myanmar[28] - New Zealand[28] - Pakistan[28] - Panama[28] - Paraguay[28] - Peru[28] - Philippines(article)[28][9] - Poland[28] - Qatar[28] - Romania[28] - Saint Kitts and Nevis[28] - Saudi Arabia[28] - South Korea[28] - Spain[28] - Sri Lanka[28] - Taiwan (Economic & Cultural Office)[28][16] - Thailand[28] - Turkey[28] - United Arab Emirates[28] - United Kingdom[28] Chicago, Illinois [edit]Chicago, the third largest city in the United States and the largest in the midwestern region of the country, is home to 50 missions, the fourth-most after Washington, D.C., New York and Los Angeles. - Argentina[30] - Australia[30] - Bosnia and Herzegovina[30] - Brazil[30] - Bulgaria[30] - Canada[30][1] - Chile[30] - China[30] - Colombia[30] - Croatia[30] - Czech Republic[30] - Denmark[30] - Dominican Republic[30][24] - Ecuador[30] - Egypt[30] - El Salvador[2] - France[30] - Germany[30] - Greece[30] - Guatemala[30][25] - Haiti[30] - Honduras[30] - Hungary[30] - India[30] - Indonesia[30] - Ireland[30] - Israel[30] - Italy[30] - Japan[30][5] - Kyrgyzstan[30] - Lithuania[30] - Mexico[30][7] - Moldova[31] - Mongolia[30][32] - Netherlands[30] - North Macedonia[30] - Pakistan[30] - Peru[30] - Philippines[30][9] - Poland[30] - Romania[30] - Serbia[11][30] - South Korea[30] - Spain[30] - Switzerland[30] - Taiwan (Economic & Cultural Office)[16] - Thailand[30] - Turkey[30] - Ukraine[30] - United Kingdom[30] Miami, Florida [edit]Miami is home to 45 missions. Due to its location, many Latin American and Caribbean countries maintain consulates there. - Antigua and Barbuda[33] - Argentina[33] - Bahamas[33] - Bangladesh[33][34] - Barbados[33] - Bolivia[33] - Brazil[33] - Canada[33][1] - Chile[33] - Colombia[33] - Costa Rica[33] - Dominican Republic[33][24] - Ecuador (Consulate)[33] - El Salvador[a][33][2] - France[33] - Germany[33] - Grenada[33] - Guatemala[33][25] - Haiti[33] - Honduras[33] - Hungary (Vice-consulate)[33][35] - Ireland[33][36] - Israel[33] - Italy[33] - Jamaica[33] - Japan[33][5] - Mexico[33][7] - Morocco[37] - Netherlands[33] - Nicaragua[33] - Panama[33] - Paraguay[33] - Peru[33] - Romania[33] - Saint Kitts and Nevis (Consulate)[38] - Saint Lucia[b][33] - Serbia[39] - Sierra Leone[33][40] - Spain[33] - Suriname[33] - Taiwan (Economic & Cultural Office)[16] - Trinidad and Tobago[33] - Turkey[33] - United Kingdom[33] - Uruguay[33] Houston, Texas [edit]Houston is the fourth largest city in the United States and is home to 45 missions. - Angola[41] - Argentina[41] - Australia[41] - Bolivia[41] - Brazil[41] - Chile[41] - Colombia[41] - Costa Rica[41] - Denmark[41][42] - Dominican Republic[41][24] - Ecuador[41] - Egypt[41] - El Salvador[41][2] - Equatorial Guinea(article)[41] - Finland[3] - France[41] - Germany[41] - Greece (Consulate)[41] - Guatemala[41][25] - Honduras[41] - Hungary (Vice-consulate)[41][35] - India[41] - Indonesia (article)[41] - Iraq[41][4][43] - Israel[41] - Italy[41] - Japan (article)[41][5] - Mexico[41][7] - Pakistan[41] - Panama[41] - Peru[41] - Philippines (article)[41][9] - Poland[41] - Qatar[41] - Russia(article)[41] - Saudi Arabia[41] - South Korea[41] - Spain[41] - Sweden(article)[44] - Taiwan (Economic & Cultural Office)[41][16] - Turkey[41] - Ukraine[41] - United Arab Emirates[41] - United Kingdom[41] - Vietnam[41] San Francisco, California [edit]San Francisco is home to 44 missions. - Algeria[45][46] - Australia[45] - Brazil[45] - Canada[45][1] - Chile[45] - China[45] - Colombia[45] - El Salvador[45][2] - European Union (Delegation Office)[45] - France[45] - Georgia[45] - Germany[45] - Greece[45] - Guatemala[45][25] - Honduras[45] - Hong Kong, China (Economic and Trade Office)[47] - India[28][45] - Indonesia[45] - Ireland[45] - Israel[45] - Italy[45] - Japan[45][5] - Kazakhstan[45] - Luxembourg[28][45][48] - Mexico[45][7] - Mongolia[28][45] - Nepal[49] - Netherlands[28][45] - Norway[28][45] - Peru[45] - Philippines(article)[45][9] - Portugal[28][45][10] - Serbia[50] - Singapore[28][45] - South Korea[45] - Spain[45] - Sweden(article)[45] - Switzerland[45] - Taiwan (Economic & Cultural Office)[16] - Tonga[c][28][45] - Ukraine[28] - United Kingdom[45] - Uruguay[45] - Vietnam[28][45] Atlanta, Georgia [edit]Atlanta is home to 26 missions. - Argentina[51] - Bahamas[51] - Belgium[51] - Brazil[51] - Canada[51][1] - Colombia[51] - Costa Rica[51] - Ecuador[51] - France[51] - Germany[51] - Greece[51] - Guatemala[51][25] - Haiti[51] - Honduras[51] - India[51] - Ireland[51] - Israel[51] - Japan(article)[51][5] - Mexico[51][7] - Netherlands[51] - Nigeria[51] - Peru[51] - South Korea[51] - Switzerland[51] - Taiwan (Economic & Cultural Office)[16] - United Kingdom[51] Boston, Massachusetts [edit]The Boston area of New England is home to 25 foreign missions. - Brazil - Canada[1] - Cape Verde (Consulate General) - Colombia (Consulate General) - Dominican Republic[24] - El Salvador[2] - France - Germany - Greece - Haiti - Honduras - Ireland (Consulate General) - Israel - Italy - Japan[5] - Mexico[7] - Peru (Consulate General) - Portugal[10] - South Korea (located in Newton) - Spain - Switzerland (Consulate; located in Cambridge) - Taiwan (Economic & Cultural Office)[16] - Turkey - United Arab Emirates - United Kingdom (located in Cambridge) Seattle, Washington [edit]Seattle is home to 10 missions. Other cities with consular missions [edit]Other cities have few consulates, which are often from Mexico, El Salvador, Guatemala, Canada, Japan, Honduras, or Peru. Cities with Mexican consulates only (18) [edit]Due to the large number of Mexican immigrants in the United States, Mexico has 52 consular missions in the United States, more than any sending country has with any other host country. Many of these are smaller cities in the southwestern United States, including a number of border towns. - Albuquerque, New Mexico (Consulate)[7] - Boise, Idaho (Consulate)[7] - Brownsville, Texas (Consulate)[41][7] - Calexico, California (Consulate)[7] - Douglas, Arizona (Consulate)[7] - Eagle Pass, Texas (Consulate)[41][7] - Indianapolis, Indiana (Consulate)[7] - Kansas City, Missouri (Consulate)[7] - Laredo, Texas (Consulate-General)[41][7] - Little Rock, Arkansas (Consulate)[7] - Milwaukee, Wisconsin (Consulate)[7] - New Brunswick, New Jersey (Consulate)[7] - Nogales, Arizona (Consulate-General)[7] - Oxnard, California (Consulate)[7] - Presidio, Texas (Consulate)[41][7] - San Jose, California (Consulate-General)[7] - Santa Ana, California (Consulate)[7] - Yuma, Arizona (Consulate)[7] Countries without formal diplomatic missions to the United States [edit]Several countries do not have formal diplomatic missions accredited to the United States. Consular duties for each country—except Afghanistan, Kiribati, and non-UN members—are instead managed by their respective diplomatic missions to the United Nations in New York. Closed missions [edit]See also [edit]- Foreign policy of the United States - List of diplomatic missions of the United States - Ambassadors of the United States - List of ambassadors to the United States - Visa requirements for United States citizens Notes [edit]- ^ Although officially titled as a consulate-general in Miami, it is physically located in the adjacent city of Doral, which forms part of the Miami-Dade County. - ^ Although officially titled as a consulate-general in Miami, it is physically located in the adjacent city of Coral Gables, which forms part of the Miami-Dade County. - ^ Although officially titled as a consulate-general in San Francisco, it is physically located in the nearby city of Burlingame, which forms part of the San Francisco Bay area. - ^ Although officially titled as a consulate-general in Detroit, it is physically located in the adjacent city of Southfield, which forms part of Metro Detroit. - ^ a b c Closed in the wake of the takeover of Afghanistan by the Taliban - ^ Resident in Ottawa, Ontario, Canada - ^ The East German embassy was closed upon the reunification of Germany in 1990. - ^ The South Vietnamese embassy was closed upon the fall of Saigon in April 1975, thus marking the end of the Vietnam War and the start of a transition period to the formal reunification of Vietnam. References [edit]- ^ a b c d e f g h i j k l m \"Canada and the United States\". Global Affairs Canada. Retrieved June 9, 2025. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac \"Embajadas, Consulados y Misiones Permanentes de la República de El Salvador\" [Embassies, Consulates, and Permanent Missions of the Republic of El Salvador]. Ministry of Foreign Affairs of El Salvador (in Spanish). Retrieved July 30, 2025. - ^ a b c d \"Finland's embassies, consulates general and honorary consulates by country\". Ministry of Foreign Affairs of Finland. Retrieved July 1, 2025. - ^ a b c d \"Iraqi's Missions Abroad\". Ministry of Foreign Affairs of Iraq. Retrieved November 27, 2024. - ^ a b c d e f g h i j k l m n o p q r \"Websites of Japanese Embassies, Consulates and Permanent Missions\". Ministry of Foreign Affairs of Japan. Retrieved June 19, 2025. - ^ a b c \"AMBASADA E REPUBLIKËS SË KOSOVËS / WASHINGTON, SHBA\" [Embassy of the Republic of Kosovo / Washington, USA]. Embassies of Kosova (in Albanian). January 25, 2022. Retrieved June 18, 2025. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au av aw ax ay \"Representaciones de México en Estados Unidos\" [Representations of Mexico in the United States]. Government of Mexico (in Spanish). Retrieved July 1, 2025. - ^ a b c d \"Mission Abroad\". Government of Micronesia. Retrieved July 3, 2025. - ^ a b c d e f g h \"United States of America\". Department of Foreign Affairs. Retrieved June 9, 2025. - ^ a b c d e f g \"Estados Unidos da América\" [United States of America]. Ministry of Foreign Affairs of Portugal (in Portuguese). Retrieved July 1, 2025. - ^ a b c \"United States / Embassies and consulates\". Ministry of Foreign Affairs of Serbia. Retrieved June 30, 2025. - ^ https://www.khaama.com/syrian-embassy-reopens-in-washington-after-over-a-decade/ - ^ \"OAS – Organization of American States: Democracy for peace, security, and development\". August 2009. Archived from the original on December 24, 2018. Retrieved August 29, 2021. - ^ \"Representación Permanente de España ante la OEA\" (in Spanish). Ministry of Foreign Affairs, European Union and Cooperation. Retrieved April 7, 2023. - ^ \"League of Arab States Mission in Washington D.C. – USA – Home\". Arableague.weebly.com. Archived from the original on February 1, 2022. Retrieved February 21, 2022. - ^ a b c d e f g h i j k l m \"ROC Embassies and Missions Abroad\". Portal of Diplomatic Missions, Ministry of Foreign Affairs of the Republic of China. Retrieved July 1, 2025. - ^ \"Delegation of the Government of Catalonia to the United States and to Canada.\" Ministry for Foreign Action and European Union - ^ McGwin, Kevin (January 10, 2014). \"Starting from scratch\". The Arctic Journal. Archived from the original on July 8, 2014. Retrieved August 1, 2014. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai \"Members\". Consular Corps Association of Philadelphia. Retrieved May 21, 2025. - ^ Myanmar’s National Unity Government Opens Office in Washington – The Diplomat - ^ The Office of Tibet, Washington, DC - ^ Consulate-General of Bhutan in New York City - ^ \"Consulate General of Burkina Faso in New York\". Ministry of Foreign Affairs (Burkina Faso). Retrieved November 29, 2023. - ^ a b c d e f g h i j k l \"Consulates\" [Consulates]. Embassy of the Dominican Republic in the United States of America. Retrieved May 14, 2025. - ^ a b c d e f g h i j k l m n o p q r s t u v w x \"Consulados de Guatemala en el Mundo\" (in Spanish). Ministry of Foreign Affairs of Guatemala. Archived from the original on February 5, 2022. Retrieved February 5, 2022. - ^ a b c \"Jurisdictions\". Embassy of Lebanon in Washington, DC, USA. Retrieved November 29, 2024. - ^ \"Missions Abroad\". Ministry of Foreign Affairs of Turkish Republic of Northern Cyprus. March 13, 2014. Archived from the original on December 29, 2021. Retrieved September 7, 2021. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au av aw ax ay az ba bb bc bd be bf bg bh bi bj bk bl bm bn bo bp bq br bs bt bu bv bw bx by bz \"Los Angeles Consular Corps\" (PDF). Board of Supervisors, County of Los Angeles. Office of Protocol, County of Los Angeles. May 23, 2025. Retrieved July 8, 2025. - ^ Consulate General of India, Los Angeles, USA, 22.09.2025 - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au \"Member Nations\". Chicago Consular Corps. Retrieved July 23, 2025. - ^ a b \"Moldovan government appointed consuls general in Padua, Chicago, Sacramento\". Moldpress. March 19, 2025. Retrieved May 4, 2025. - ^ \"Монгол Улсаас АНУ-ын Чикаго хотод суугаа Консулын газар өнөөдрөөс үйл ажиллагаагаа албан ёсоор эхлүүллээ\". March 9, 2022. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au av \"Directory of Consulates, Bi-National Chambers and Sister Cities in Florida\" (PDF). Florida Department of State. Office of International Affairs, Florida Department of State. December 2024. Retrieved July 8, 2025. - ^ \"Missions in Americas\". Ministry of Foreign Affairs. Archived from the original on December 28, 2021. Retrieved December 20, 2021. - ^ a b \"Embassy of Hungary Washington\". Archived from the original on July 17, 2021. Retrieved July 17, 2021. - ^ \"Consulate General of Ireland, Miami\". Department of Foreign Affairs of Ireland. Retrieved November 7, 2022. - ^ Adil Faouzi (June 17, 2025). \"Morocco Opens New Consulate General in Miami\". Morocco World News. Retrieved July 1, 2025. - ^ https://www.foreign.gov.kn/skn-honorary-consuls/ - ^ https://serbiantimes.info/en/good-news-for-serbs-in-america-serbian-consulate-general-to-open-in-miami-this-fall-along-with-a-new-air-route/ - ^ \"Consulate-General of Sierra Leone, Miami, FL\" – via Facebook.[user-generated source?] - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao ap aq ar as at au av aw ax ay az ba bb bc bd be bf bg bh bi bj bk bl bm bn bo \"Consular Offices in Texas\". Secretary of State of Texas. Retrieved October 4, 2025. - ^ \"Consulate General of Denmark in Houston\". Retrieved March 6, 2022. - ^ \"Meeting of the Consul General with the Director of the Texas Regional Office\". Ministry of Foreign Affairs of Iraq. August 15, 2024. Retrieved November 27, 2024. - ^ \"Om oss\" [About us] (in Swedish). Consulate General of Sweden, Houston. July 15, 2025. Retrieved August 19, 2025. - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z aa ab ac ad ae af ag ah ai aj ak al am an ao \"Consulates\". San Francisco Consular Corps. Retrieved May 4, 2025. - ^ Ouverture d’un consulat général d’Algérie aux États Unis (in French) - ^ https://www.hketosf.gov.hk - ^ a b c d e f g h \"List of Consulates & Foreign Trade and Cultural Offices\". Consular Association of Washington. Retrieved June 23, 2025. - ^ \"Nepal's Consulate General in San Francisco to Begin Services from September 22\". The Diplomat Nepal. September 21, 2025. Retrieved September 25, 2025. - ^ https://serbiantimes.info/en/serbia-opens-consulates-in-san-francisco-and-miami-minister-duric-announces-new-diplomatic-missions-in-the-usa-video/ - ^ a b c d e f g h i j k l m n o p q r s t u v w x y z \"Georgia Consular Offices\". Georgia Department of Economic Development. Retrieved July 8, 2025. - ^ a b c d e f g h \"Members\". Colorado Consular Corps. Retrieved May 5, 2025. - ^ \"Aurora\". City of Aurora. Retrieved March 10, 2025. - ^ \"Consulate of the Republic of Korea in Anchorage\". Ministry of Foreign Affairs (South Korea). Retrieved August 30, 2023. - ^ \"Slovenia's Representations Abroad\". Government of Slovenia. Retrieved May 13, 2025. - ^ a b \"Consular Offices\". Department of Development of Ohio. Retrieved May 14, 2025. - ^ \"Consulate of the Republic of Korea in Dallas\". Ministry of Foreign Affairs (South Korea). Retrieved August 30, 2023. - ^ a b c d e f \"Active Members\". Consular Corps of Michigan. Retrieved November 29, 2024. - ^ a b c \"The Headquarters\". Consulate of Italy in Detroit, USA. Retrieved November 29, 2024. - ^ a b c d e f g \"Consular Representation in Hawaii\". Consular Corps of Hawaii. Retrieved November 28, 2024. - ^ Consulate-General of Honduras in Irving, Texas - ^ Diplomatic missions of Ecuador in the United States - ^ a b c d e \"Minnesota Consular Corps\". Global Minnesota. Retrieved July 8, 2025. - ^ a b c d \"Countries\". Louisiana Consular Corps. Retrieved May 5, 2025. - ^ \"Consulado General de Honduras en New Orleans | New Orleans LA\". www.facebook.com. Retrieved September 14, 2025. - ^ a b \"Diplomatic Resources\". Global Oklahoma. Retrieved May 21, 2025. - ^ \"Consulado-Geral em Orlando\" [Consulate-General in Orlando]. Ministry of Foreign Affairs of Brazil (in Portuguese). Retrieved May 14, 2025. - ^ \"Diplomatic Missions\". Ministry of Foreign Affairs and Trade of Samoa. Retrieved June 23, 2025. - ^ \"Consulate of the Republic of Korea in Philadelphia\". Ministry of Foreign Affairs (South Korea). Retrieved May 21, 2025. - ^ \"Resolución Suprema\" [Supreme Resolution] (PDF) (in Spanish). Archived from the original (PDF) on April 17, 2024. - ^ a b \"Peru appoints two consuls general to U.S.\" Peruvian News Agency. November 23, 2023. Retrieved May 19, 2025. - ^ Consulate-General of Honduras in Pittsburgh - ^ a b c \"Members\". Oregon Consular Corps. Retrieved July 3, 2025. - ^ RMI Northwest Consulate in Portland, OR opened to better serve Marshallese in U.S. West - ^ a b c \"Consul Members\". Utah Consular Corps. Retrieved May 19, 2025. - ^ \"Embajadas y Consulados de El Salvador – Consulado General de El Salvador en Silver Spring, Maryland\". embajadasyconsulados.rree.gob.sv. Archived from the original on April 1, 2017. Retrieved April 1, 2017. - ^ Moclair, Will (June 7, 2022). \"El Salvadoran Consulate opens in Springdale\". nwahomepage.com. KNWA/KFTA. Archived from the original on December 11, 2022. Retrieved November 5, 2024. - ^ \"Government\". Embassy of the Republic of the Marshall Islands. Archived from the original on March 30, 2015. Retrieved July 5, 2012. - ^ Consulate-General of Honduras in Tampa - ^ \"Consulate of the Republic of Korea in Hagatna\". Ministry of Foreign Affairs (South Korea). Retrieved August 30, 2023. - ^ Gramer, Robbie (June 6, 2022). \"The Last Days of the Afghan Embassy\". Foreign Policy. Retrieved July 20, 2022. Afghans in the United States will now be referred to the embassy in Canada, which the Canadian government has helped arrange with the U.S. government and leftover Afghan diplomats to remain open, according to several U.S. and former Afghan officials familiar with the matter. - ^ \"Embassy of San Marino in Washington, D.C., United States\". - ^ a b c - Jakes, Lara (March 11, 2022). \"Afghan Embassy, Now Out of Money, Will Shut Down, U.S. Says\". The New York Times. Retrieved April 2, 2022. - Detsch, Jack; Gramer, Robbie (March 15, 2022). \"'Nowhere to Turn to': U.S. Forces Closure of Afghan Embassy\". Foreign Policy. Retrieved April 2, 2022. The Afghan missions will all close this month, with the exception of Afghanistan's permanent mission to the United Nations in New York, which will continue to operate. - Iqbal, Anwar (March 27, 2022). \"Afghan embassy, consulates in US shut their doors\". Dawn. Retrieved April 2, 2022. - ^ Almost all East German travel rules still apply - ^ \"Determination 4,000 Miles Away\". Archived from the original on July 17, 2021. Retrieved July 17, 2021. - ^ \"Foreign diplomatic offices in the United States\" (PDF). Archived (PDF) from the original on June 26, 2021. Retrieved July 17, 2021. - ^ \"U.S. Relations with Sao Tome and Principe\". Archived from the original on January 26, 2018. Retrieved July 17, 2021. - ^ \"The Vietnam Embassy in Washington Closes\". The New York Times. May 24, 1975. Archived from the original on July 20, 2021. Retrieved July 20, 2021. - ^ a b c d e Venezuelan embassy run by opposition in US closes after Guaido ouster - ^ \"Anchorage's Mexican Consulate will close in November\". Alaska Public Media. September 24, 2015. Archived from the original on July 17, 2021. Retrieved July 17, 2021. - ^ \"Australia's consulate in Atlanta closes\". News.com.au. August 2, 2012. Archived from the original on September 20, 2021. Retrieved September 21, 2021. - ^ \"Argentina.gob.ar\". Archived from the original on July 16, 2021. Retrieved July 17, 2021. - ^ \"Decreto 29 de 1987\". Archived from the original on August 16, 2021. Retrieved February 21, 2022. - ^ a b c d e f g h i j k l m n o p q r s t u v w \"La historia de los consulados cubanos en Estados Unidos (1902–1961) Breve aproximación\" (in Spanish). Ministry of Foreign Affairs of Cuba. Archived from the original on September 21, 2021. Retrieved September 21, 2021. - ^ \"Canada ending 'Buffalo shuffle' for visas, closing consulate\". - ^ \"Außenministerium schließt fünf Standorte\" (in German). Der Standard. November 30, 2010. Retrieved March 14, 2023. - ^ \"Vissa anslag m.m. inom Utrikesdepartementets område (prop. 1992/93:100 bil. 4)\" [Some grants, etc. within the area of the Ministry for Foreign Affairs (Bill 1992/93:100 appx. 4)] (in Swedish). Stockholm: Committee on Foreign Affairs. March 23, 1993. Retrieved January 4, 2024. - ^ a b \"Lacalle Pou ordenó a Bustillo cerrar tres consulados en Brasil y uno en EE.UU\" (in Spanish). La Red 21. January 17, 2021. Archived from the original on July 19, 2021. Retrieved July 19, 2021. - ^ a b c \"The Foreign & Commonwealth Office\" (PDF). assets.publishing.service.gov.uk. January 2012. Archived from the original (PDF) on July 20, 2021. - ^ a b \"Prevé SRE cerrar más embajadas por recorte\" (in Spanish). El Universal. December 18, 2002. Archived from the original on August 23, 2021. Retrieved August 23, 2021. - ^ a b \"Dallas' British Consulate to close in money-saving move – Dallas Business Journal\". Archived from the original on July 27, 2009. - ^ \"736 Pearl, by JUDY STALNAKER, PHD. The Foster-McCaulley-Symes-French Consulate House\". October 18, 2019. - ^ \"Decreto 364 de 1994\". - ^ Anna Szczepańska-Dudziak (2017). \"Organizacja i funkcjonowanie polskiej służby konsularnej w latach 1945–1949\" (in Polish). Retrieved February 4, 2022. - ^ \"Decreto 1342 de 1988\". Archived from the original on August 16, 2021. Retrieved February 21, 2022. - ^ a b \"Projet de loi de finances pour 1997 : Affaires étrangères\". Archived from the original on July 17, 2021. Retrieved July 17, 2021. - ^ \"Chinese consulate in Houston closed following US order\". July 24, 2020. Archived from the original on July 25, 2020. Retrieved July 17, 2021. - ^ \"Changes to Norway's Diplomatic Presence Abroad\". Government of Norway. September 9, 2022. Retrieved February 19, 2024. - ^ a b c \"Daniel Ortega cierra otro consulado, esta vez en México\". 100% Noticias (in Spanish). January 25, 2024. Retrieved February 15, 2024. - ^ a b \"Cierran permanentemente consulado de Nicaragua en Houston, opositores opinan que Ortega busca castigar a migrantes\". 100% Noticias (in Spanish). January 24, 2024. Retrieved February 15, 2024. - ^ Hodge, Shelby. \"MIXERS , ELIXIRS AND IMAX SUMMER SOCIALS / Party animals drink with the dinosaurs.\" Houston Chronicle. Star 3. June 22, 2006. Retrieved on January 10, 2009. See \"Fond farewell\" section below. - ^ \"La Suisse ferme trois consulats\" [Switzerland closes three consulates]. Swissinfo (in French). November 19, 2005. - ^ Consulate General of Japan at Kansas City - ^ \"Eight Angolan embassies, consulates to close\". BAL Global. October 23, 2018. Archived from the original on June 13, 2021. Retrieved May 3, 2021. - ^ a b \"Ethiopia: Breaking - Ethiopia Recalls Dozens of Diplomats, Closes Consulates in Various Countries citing operational financial costs\". Addis Standard. July 8, 2021. - ^ a b Hawi Dadhi (August 21, 2021). \"Foreign Office Spokesperson Calls Embassies Closure \"Right-sizing\"\". addisfortune.news. Addis Fortune. Retrieved December 12, 2022. - ^ \"Dictadura cierra Consulado de Nicaragua en Los Ángeles, California\". 100% Noticias (in Spanish). January 19, 2024. Retrieved February 15, 2024. - ^ \"Slovensko má veľvyslanectvo v Spojených arabských emirátoch\" Archived 2016-10-01 at the Wayback Machine, WebNoviny.sk, Bratislava, 1 December 2013. Retrieved on 29 April 2014. - ^ \"Sweden to close New York and LA consulates\". The Local. July 23, 2009. Archived from the original on May 25, 2016. - ^ \"Closure of Swiss consulates general in Karachi and Los Angeles\". Archived from the original on July 27, 2021. Retrieved July 27, 2021. - ^ \"Voordat je verdergaat naar Google Zoeken\". www.google.com. Retrieved September 14, 2025. - ^ \"Consulates.\" Norway in the USA (Norwegian Government). September 28, 2006. Retrieved on April 17, 2017. - ^ \"Chavez orders closure of Miami consulate\". May 14, 2017. Archived from the original on July 28, 2021. Retrieved July 28, 2021. - ^ Neuman, William (January 14, 2012). \"Venezuela Closes Consulate in Miami\". The New York Times. Archived from the original on August 17, 2021. Retrieved July 28, 2021. - ^ \"Model for the 21st Century\". The Norwegian American. February 11, 2009. Archived from the original on July 17, 2021. Retrieved July 17, 2021. - ^ Hansson, Håkan (January 23, 1989). \"Motion till riksdagen 1988/89:U30: Generalkonsulatet i Minnesota\" [Motion to Parliament 1988/89:U30: Consulate General in Minnesota] (in Swedish). Stockholm: Riksdag. Retrieved January 4, 2024. - ^ \"Cancillería anuncia fecha para cierre de embajadas y consulados\" (in Spanish). Semana. November 15, 2002. Archived from the original on July 14, 2021. Retrieved July 15, 2021. - ^ \"Amendments to Annex 18 to the Common Consular Instructions (CCI) – Table of representation for issuing uniform visas\". Archived from the original on September 7, 2021. Retrieved September 12, 2021. - ^ Japanese Consulate one step away from new Nashville home | Tennessee Municipal League - ^ 20 Years of Service | Japan–America Society of Tennessee, Inc. - ^ \"Administrative Order No. 498, s. 1985 | GOVPH\". Official Gazette of the Republic of the Philippines. Archived from the original on December 30, 2021. Retrieved July 19, 2021. - ^ \"Cierre del Consulado en Nueva Orleans\". September 10, 2009. Archived from the original on February 21, 2022. Retrieved July 19, 2021. - ^ \"Spain to close New Orleans consulate\". September 14, 2009. Archived from the original on July 19, 2021. Retrieved July 19, 2021. - ^ Todd Carney (October 21, 2021). \"Belarus to close New York City Consulate at US Request\". Foreign Brief. Retrieved March 27, 2022. - ^ Gabin Dédjila (July 11, 2019). \"Séisme dans la diplomatie béninoise: des ambassades importantes bientôt fermées\". La Nouvelle Tribune (Bénin) (in French). Retrieved January 30, 2024. - ^ \"Slovenia to close embassy in Dublin\". The Irish Times. June 12, 2012. Archived from the original on November 25, 2021. Retrieved August 27, 2021. - ^ \"Embaixada da República da Eslovénia Lisboa, Portugal\". Archived from the original on July 13, 2021. Retrieved August 27, 2021. - ^ \"Background Notes, Suriname\". Archived from the original on September 16, 2021. Retrieved September 16, 2021. - ^ \"Aggiornamenti tabelle territoriali estere al dicembre 2014 – Variazioni comunicate dal Ministero degli Affari Esteri\" (PDF) (in Italian). Archived (PDF) from the original on January 13, 2022. Retrieved January 13, 2022. - ^ \"Changes to UK government representation in Orlando, Florida\". Archived from the original on February 21, 2022. Retrieved July 17, 2021. - ^ \"Canada to close consulates in Philadelphia and Princeton\". WHYY. June 5, 2012. Archived from the original on February 18, 2022. Retrieved February 21, 2022. - ^ \"Decreto 1290 de 1987\". Archived from the original on August 14, 2021. Retrieved February 21, 2022. - ^ wanderer34Mar 12, 2019, 7:28 PM (March 12, 2019). \"Consulates Closing in Philadelphia [Archive] – SkyscraperPage Forum\". Skyscraperpage.com. Archived from the original on February 18, 2022. Retrieved February 21, 2022. {{cite web}} : CS1 maint: multiple names: authors list (link) CS1 maint: numeric names: authors list (link) - ^ \"Israel to close Philadelphia consulate, representations in 4 other cities\". January 6, 2016. Archived from the original on February 18, 2022. Retrieved February 18, 2022. - ^ \"The Portuguese Republic\". March 6, 2015. - ^ \"United Kingdom | Consular Corps Association of Philadelphia\". Consularcorpsofphiladelphia.org. March 6, 2015. Archived from the original on February 18, 2022. Retrieved February 21, 2022. - ^ \"Consulate General of Venezuela | Philadelphia | Pennsylvania | Government Federal\". - ^ \"Political visions and historical scores\" (PDF). Journal of the Institute for Western Affairs in Poznań. 2019. Archived (PDF) from the original on September 14, 2021. Retrieved September 14, 2021. - ^ \"DFA shuts down five overseas posts, with five more to close this year\". GMA News. September 4, 2012. Archived from the original on March 6, 2016. Retrieved June 1, 2020. - ^ Graff, Amy (April 25, 2019). \"SF mansion that housed Egyptian consulate sells for $6.15 million less than original asking\". Sfgate. Archived from the original on August 2, 2021. Retrieved August 2, 2021. - ^ a b \"Nigeria's Abandoned San Francisco Consulate Property Worth Nearly $5 Million\". August 26, 2019. Archived from the original on August 1, 2021. Retrieved August 1, 2021. - ^ \"Nigeria to reopen San Francisco mission in US\". July 27, 2021. Archived from the original on August 1, 2021. Retrieved August 1, 2021. - ^ \"Sorprende cierre de consulado salvadoreño\". Chicago Tribune. November 4, 2011. Archived from the original on September 2, 2021. Retrieved September 2, 2021. - ^ \"Decreto 1304 de 1922\". Archived from the original on August 18, 2021. Retrieved February 21, 2022. - ^ \"Germany replacing Seattle consulate with a volunteer – 2000-05-29 – Puget Sound Business Journal (Seattle)\". Archived from the original on October 24, 2000. - ^ \"Administrative Order No. 116, s. 1965\". Official Gazette. March 20, 1965. Archived from the original on October 28, 2021. Retrieved October 27, 2021. - ^ \"Senate resolution\" (PDF). Archived (PDF) from the original on January 14, 2022. Retrieved January 14, 2022. - ^ \"Trump orders expulsion of 60 Russian diplomats, closure of Seattle consulate\". CBS News. March 26, 2018. Archived from the original on July 19, 2021. Retrieved July 19, 2021. - ^ The History of Trade between Washington State and Japan | Consulate-General of Japan in Seattle - ^ \"Decreto 856 de 1990\". Archived from the original on July 18, 2021. Retrieved February 21, 2022."
}