{
  "url": "https://en.wikipedia.org/wiki/Twix",
  "title": "Twix - Wikipedia",
  "text": "Twix Twix is a chocolate bar made by Mars Inc., consisting of a biscuit applied with other confectionery toppings and coatings (most frequently caramel and milk chocolate).[1] Twix are packaged with one (mini and snack sizes), two (standard and xtra sizes, xtra having double-length biscuits), or four bars (king size) in a wrapper. History [edit]Twix was first produced in the United Kingdom in 1967[2] at Mars's Slough factory.[3] The name is a portmanteau of \"twin sticks\".[4] Mars have also labelled the product in speech as the \"Twix Cookie Bar\".[5] The product was introduced in the United States in 1976 and again in 1979.[2] Twix was called Raider in mainland Europe for many years before its name was changed in 1991, 2000 in Denmark, Finland, Norway, Sweden and Turkey, to match the international brand name.[6] The Raider brand was resurrected for retro editions sold in Germany in 2009, in the Netherlands, Belgium, Finland and Sweden in 2015, and Switzerland in late 2023.[7] Twix launched in Australia in 1989.[8] In 1992 it launched in Russia and Czechoslovakia.[5] Production [edit]Twix bars for the North American market are made in Cleveland, Tennessee, along with M&M's.[9][10] For global markets like Europe and Africa they are produced in Veghel, the Netherlands alongside Mars bars and other Mars, Incorporated chocolates. Advertising [edit]From 1990 to 2001, actor and martial arts master Chuck Norris appeared in commercials for Twix as the biscuit's spokesman. He appeared in selected events and was featured in the Twix advertising campaign.[citation needed] D'Arcy handled Twix advertising globally until 2000 when it was handed over to Grey Global Group.[11] In 2012, Twix launched a campaign called \"Pick a Side,\" creating a rivalry between the two \"sides\" of the Twix bar, which are made in different factories. Each bar was given its own packaging, labeled as either a \"Right Twix\" or a \"Left Twix,\" even though both sides are identical and made on the same packaging line.[12][13][14] In 2017, Mars released packages of Twix labelled \"Two Left\" and \"Two Right,\" implying each package contained either two left Twix or two right Twix.[15] In a poll on Twix's official website, 50% of people voted they preferred the left Twix and 50% preferred the right Twix.[16] In a 2021 poll by the Burlington Record, 64% of people preferred the left Twix over the right.[17] Twix also released a fictional story about the creation of Twix called \"The Tale of Seamus and Earl.\"[18] Two brothers, Seamus and Earl, worked together \"to combine biscuit, caramel and chocolate into one beautiful bar,\"[19] but while making the biscuit bar, the two feuded and disputed techniques, such as how to add the chocolate or caramel. At the grand unveiling of the Twix, the two brothers accidentally broke the Twix bar; that being the final straw, the two brothers split the company into two factories: one for left Twix and one for right Twix. In June 2025, the ASA in Britain banned a Twix advertisement from television for glorifying dangerous driving.[20] Twix products [edit]Bars [edit]The following flavours are available in the United States.[21] - The original Twix candy bar was introduced in 1976 and reintroduced in 1979. It consists of chocolate, caramel, and a cookie crunch. - Twix Salted Caramel is a variation of the original Twix bar. It has a chocolate cookie, but instead of the usual caramel center, it has a salted caramel center. - Twix Cookies & Creme was introduced in 1991. It is a candy bar consisting of a chocolate bar with cookie bits and a white creme taking the place of caramel. - Twix Ice Cream Bar is a frozen confection created by Mars Incorporated. It consists of vanilla ice cream coated in caramel, then enrobed in milk chocolate. - Twix 100 Calories is a candy bar that consists of a caramel-covered cookie with a chocolate coating. It has 100 calories per serving. - Twix Cookie Dough is a variation on the classic Twix candy bar. It has a cookie dough center instead of the traditional caramel and is covered in milk chocolate. Other flavours have also been available internationally. - In Finland, Twix White has a white chocolate outer shell instead. Discontinued products [edit]- Twix Chocolate Fudge is a candy bar produced from 1990 to 1992.[5] It is a variation of the original Twix bar, but with a chocolate fudge center instead of caramel. The candy bar also has a chocolate cookie bottom and is coated in milk chocolate. - Twix Peanut Butter was introduced in approximately 1985 and was marketed until 1997.[5] It is a candy bar consisting of a chocolate cookie filled with peanut butter instead of caramel. Shrinkflation [edit]Like many confectionery items, Twix has been accused of shrinkflation, where Mars, Incorporated has decreased the size of the bar. This accusation is based on the fact that the size of a Twix bar has decreased over time, while the price has been drastically raised.[22][23] Weight and price changes [edit]Source:[23] In popular culture [edit]In an episode of Seinfeld entitled \"The Dealership\", a major plotline in the episode focuses on George Costanza's failed attempts to extract a Twix bar from a vending machine. Also, a recurring joke in the episode is that people confuse a Twix bar with a 5th Avenue Bar. However, George insists that \"Twix is the only candy bar with the cookie crunch.\"[24][25] References [edit]- ^ The biscuit is typically topped with caramel and then coated with milk chocolate. There is also an additional thin layer of chocolate between the biscuit and the caramel. \"Cross-section of a Twix\" Archived 2 July 2016 at the Wayback Machine, ediblegeography.com - ^ a b \"TWIX\", marsfoodservices.com - ^ \"BBC Radio Berkshire - Andrew Peach, 80 things Slough has given the world - Slough 80: Twix\". BBC. Archived from the original on 18 April 2023. Retrieved 4 October 2025. - ^ @twix (17 September 2018). \"Close! It's short for \"twin sticks\"\" (Tweet) – via Twitter. - ^ a b c d \"TWIX(r) 411\". www.twix.com. Archived from the original on 1 March 2000. Retrieved 4 October 2025. - ^ \"Twix — Snack History\". foodnewsorg.com. Retrieved 18 April 2022.[permanent dead link] - ^ \"Toen Twix nog Raider heette\". historiek.net (in Dutch). 9 September 2018. Archived from the original on 26 April 2023. Retrieved 18 April 2022. - ^ Shoebridge, Neil (22 November 1991). \"MARS MILKS NEW MARKETS WITH ITS LIQUID ASSETS\". Australian Financial Review. Retrieved 30 September 2025. - ^ Warnke, Kyle (12 August 2016). \"M&M's and Twix are Made in Tennessee\". WVLT-TV. Knoxville, Tennessee. Archived from the original on 30 June 2018. Retrieved 29 June 2018. - ^ \"Mars expands: Candymaker marks $67 million growth project\". Times Free Press (Chattanooga, Tennessee, USA). 5 April 2013. Archived from the original on 7 November 2017. Retrieved 27 May 2017. - ^ Week, Marketing (14 July 2004). \"Grey Global Twix business under threat\". Marketing Week. Retrieved 30 September 2025. - ^ Joseph, Seb (25 June 2012). \"Mars unveils global Twix campaign\". Marketing Week. Archived from the original on 22 February 2022. Retrieved 22 February 2022. - ^ Lewis, Abbey. \"Mars Releases 'Left' and 'Right' Twix Packs\". CSP Daily News. Archived from the original on 22 February 2022. Retrieved 22 February 2022. - ^ \"Is There Actually A Difference Between Left Twix and Right Twix?\". NBC Chicago. 22 October 2022. Archived from the original on 9 April 2025. Retrieved 31 October 2024. - ^ Lewis, Abbey. \"Mars Releases 'Left' and 'Right' Twix Packs\". CSP Daily News. Retrieved 31 October 2024. - ^ \"LEFT TWIX® OR RIGHT TWIX®?\". Twix. - ^ \"POLL QUESTION: Which is better, the left Twix or the right Twix?\". The Burlington Record. 19 August 2021. Retrieved 31 October 2024. - ^ Adams, Paul (20 July 2022). \"What Is the Difference Between Right Twix and Left Twix? Ask Paul\". Cook's Illustrated. America's Test Kitchen. Archived from the original on 9 April 2025. Retrieved 31 October 2024. - ^ \"The Tale of Seamus and Earl\". Twix. Archived from the original on 5 December 2024. Retrieved 31 October 2024. - ^ Mitchell, Ottilie (11 June 2025). \"Twix ad banned for encouraging unsafe driving\". BBC News. Retrieved 24 June 2025. - ^ \"Explore Left Twix\". twix.com. Archived from the original on 19 March 2022. Retrieved 18 April 2022. - ^ Magliola, Anna Sky (3 January 2023). \"10 chocolate bars which have changed their size\". Planet Radio. Archived from the original on 3 September 2022. Retrieved 3 February 2022. - ^ a b \"Biscuits and chocolates take the 'shrinkflation' test\". 1 February 2018. Retrieved 22 November 2025. - ^ The Twix Bar - Seinfeld Short Episode, archived from the original on 31 March 2023, retrieved 31 March 2023 - ^ \"The Dealership\". SeinfeldScripts. Archived from the original on 31 March 2023. Retrieved 31 March 2023."
}