{
  "url": "https://www.verywellmind.com/the-7-stages-of-dementia-symptoms-and-what-to-expect-6823696",
  "title": "The 7 Stages of Dementia: Symptoms and What to Expect",
  "text": "The 7 Stages of Dementia: What to Expect By Sanjana Gupta Sanjana Gupta Sanjana is a health writer and editor. Her work spans various health-related topics, including mental health, fitness, nutrition, and wellness. Learn about our editorial process Updated on September 29, 2025 Medically reviewed Verywell Mind articles are reviewed by board-certified physicians and mental healthcare professionals. Medical Reviewers confirm the content is thorough and accurate, reflecting the latest evidence-based research. Content is reviewed before publication and upon substantial updates. Learn more. by Shaheen Lakhan, MD, PhD, FAAN Medically reviewed by Shaheen Lakhan, MD, PhD, FAAN Shaheen Lakhan, MD, PhD, is an award-winning physician-scientist and clinical development specialist. Learn about our Medical Review Board Catherine Falls Commercial / Getty Images Close Key Takeaways Dementia progresses in seven stages, from no cognitive decline to very severe cognitive decline.The stages range from mild memory lapses to needing help with all personal care tasks. Dementia is marked by a severe decline in cognitive functions, such as thinking, reasoning, and remembering, to the extent that it interferes with the person's daily life. Dementia typically affects older adults, but it is not a normal part of the aging process. While some amount of forgetfulness is normal with age, dementia is a severe disorder that can affect the person's ability to function on a daily basis. According to the National Institute on Aging, about one-third of all people above the age of 85 have some form of dementia. Dementia can stem from various causes, the most common being Alzheimer's disease. Some of the other causes include Parkinson's disease, Lewy body dementia, and frontotemporal dementia. Dementia progresses in stages, ranging from mild to severe. In 1982, Dr. Barry Reisberg created the Global Deterioration Scale (GDS), which consists of seven stages, to help clinicians categorize the progression of dementia. This article explores the seven stages of dementia so you know what to expect if you or a loved one has been diagnosed with it. The stages are as follows: No cognitive declineVery mild cognitive declineMild cognitive declineModerate cognitive declineModerately severe cognitive declineSevere cognitive declineVery severe cognitive decline Stages 1 to 3 are the pre-dementia stages, whereas stages 4 to 7 are the dementia stages. Clinicians typically compare the person's symptoms to the criteria listed for each stage and use their judgment to determine which stage the patient is at. The 7 Stages of Dementia The seven stages of dementia are outlined below. Stage 1: No Cognitive Decline At this stage, the person can function normally and exhibits no signs of memory loss, confusion, or cognitive impairment. However, the structure and functioning of their brain may have started to deteriorate as the neurons (nerve cells) in their brain start to lose connection with other brain cells and die. Stage 2: Very Mild Cognitive Decline The person starts to experience occasional lapses of memory, such as: Forgetting where they keep familiar everyday objectsForgetting names they once knew very well At this stage, the symptoms are unlikely to affect the person’s work or social interactions. In fact, the symptoms may even be too mild to detect in a clinical interview with a healthcare provider, as the person may be able to adequately perform memory tests during the interview. Stage 3: Mild Cognitive Decline This is the stage at which cognitive impairment starts to become more noticeable to the patient, their friends, family members, and colleagues. The person may start to show symptoms such as: Getting lost while walking or driving, particularly in unfamiliar placesReading something and retaining very little of itForgetting the names of people they’ve just metLosing items of importance or valueHaving trouble concentrating and performing complex tasksExperiencing increasing difficulty in social settingsFrequently forgetting words and the names of loved onesPerforming poorly at work to the extent that it becomes evident to colleagues The person may start to feel anxious as their symptoms begin to become apparent and interfere with their ability to function. Stage 4: Moderate Cognitive Decline In this stage, the person will exhibit a definitive decline in cognitive ability in a clinical interview. Some of the symptoms of this stage may include: Lack of knowledge of current and recent events Difficulty remembering parts of their own personal history Trouble with organizing, planning, traveling, and managing finances At this stage, the person will likely still be able to recognize loved ones’ names and faces and navigate familiar places. However, they may start to avoid challenging situations to prevent anxiety and hide their distress from others. Stage 5: Moderately Severe Cognitive Decline From this stage onward, the person may no longer be able to function without some assistance. These are some of the symptoms of this stage: Difficulty recalling a vital detail such as their address, phone number, or high school Disorientation in terms of place and time, such as confusion regarding the season, date, day of the week, or time of day Difficulty counting backward from 20 by 2s or from 40s by 4s (provided they are educated and were once able to do this calculation) Trouble with making decisions In this stage, the person can likely still remember their own name and the names of their spouse and children, but they may struggle with recalling their grandchildren's names. They may be able to eat and use the bathroom without assistance but may need help with tasks such as deciding what to wear. Stage 6: Severe Cognitive Decline At this stage, the person may require a high degree of care, as they may have symptoms such as: Difficulty remembering the names of their spouse, children, or primary caregiversLack of awareness regarding all the recent events and experiences in their lifePatchy or skewed recollection of their early lifeDifficulty counting backward or forward to 10Lack of awareness regarding their surroundings as well as the time and placeInability to travel alone without assistanceTendency to wander The person is also likely to experience emotional and personality changes, such as: Paranoia, hallucinations, and delusional behavior, such as talking to themselves or believing their caregivers are trying to harm them Obsessive symptoms, such as repeatedly performing cleaning activities Agitation, anxiety, and even violent behavior Loss of willpower due to being unable to carry a thought long enough to complete the action During this stage, the person is likely to still remember their name and distinguish between familiar and unfamiliar people in their environment. They will probably need assistance with daily living activities and may experience incontinence and sleep-related difficulties. Stage 7: Very Severe Cognitive Decline In the final stage, the brain appears to lose its connection to the body and becomes incapable of telling it what to do. The person is likely to progressively lose their motor skills and the ability to speak. They may only be able to utter unintelligible sounds or words, if at all. They will need assistance with all personal care tasks, such as eating, walking, and using the bathroom. 7 Brain Exercises to Strengthen Your Mind Read more: Conditions A-Z Neurological Disorders 7 Sources Verywell Mind uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. National Institute on Aging. What is dementia? Symptoms, types, and diagnosis. MedlinePlus. Dementia. Centers for Disease Control and Prevention. About dementia. Stanford Medicine Health Care. Dementia causes. Reisberg B, Ferris SH, de Leon MJ, Crook T. The Global Deterioration Scale for assessment of primary degenerative dementia. Am J Psychiatry. 1982;139(9):1136-1139. doi:10.1176/ajp.139.9.1136 American Physical Therapy Association. Global Deterioration Scale for assessment of primary degenerative dementia. Beason-Held LL, Goh JO, An Y, et al. Changes in brain function occur years before the onset of cognitive impairment. J Neurosci. 2013;33(46):18008-18014. doi:10.1523/JNEUROSCI.1402-13.2013 By Sanjana Gupta Sanjana is a health writer and editor. Her work spans various health-related topics, including mental health, fitness, nutrition, and wellness. See Our Editorial Process Meet Our Review Board Share Feedback Was this page helpful? Thanks for your feedback! What is your feedback? Helpful Report an Error Other Submit"
}