{
  "url": "https://www.windhaminn.com/menu",
  "title": "Jimmy O'Connor's Windham Mountain Inn | Pub Menu | Discover Our Pub Menu — Jimmy O'Connor's Windham Mountain Inn",
  "text": "Pub Menu Salads $8.00 Small Garden Salad Tomato cucumber, radish, and carrots over iceberg lettuce. $8.00 $12.00 - Add Grilled Chicken $6 Large Garden Salad Tomato cucumber, radish, and carrots over iceberg lettuce $12.00 - Add Grilled Chicken $6 Burgers Lettuce, Tomato, Onion, Cheese, Extra. Pickles 0.50 extra each. Windham Burger Our classic pub burger on our custom poppyseed bun. Lettuce, Tomato, Onion, Cheese, Extra. Pickles 0.50 extra each. $14 $14 Served w / Fries + Salad Steak Dinner Mouth Watering NY Strip steak Grilled to perfection Served w / Fries + Salad $34 $34 Chicken & Fish $16.00 Four Piece Fried Chicken Simple and delicious includes Breast, Leg, Thigh, & Wing. $16.00 $12 Grilled Chicken Sandwich An old favorite Served with lettuce tomato & mayo on our custom poppyseed bun. $12 $13.00 Chicken Tenders w/Fries Three Golden Brown Chicken Tenders Served with your choice of sauce. $13.00 $14.00 Chicken Wings Eight (8) of our popular wings Served with your choice of sauce. $14.00 $15.00 Fish & Chips Three Cod Filets served with Tartar Sauce and lemon. $15.00 Misc & Sides $6 Jimmy's Fries A basket of golden crisp fries what more is there to say. $6 $8 Onion Rings Sliced 'Rings' of onion coated with batter and fried. $8 Impossible™ Burger topped w / Lettuce,Tomato,Mayo on our custom poppyseed bun. $13.00 Veggie Burger Impossible™ Burger topped w / Lettuce,Tomato,Mayo on our custom poppyseed bun. $13.00 $6.00 Grilled Cheese Nothing fancy, just a grilled cheese done right. $6.00 On Tap by the pint $4 Budwiser $4 $6 Stella $6 $8 Fiddlehead IPA $8 By the Bottle / Can $5 Heineken $5 $4 Budweiser $4 $4 Coors Lights $4 $4 Bud light $4 Brewerd in Cork, Ireland. Murphy's Stout Each jet-black pint is filled with the character and resilience of the Irish spirit Brewerd in Cork, Ireland. $7 $7 $8 1911 Hardcider Handcrafted, small-batch beverage made in Lafayette, New York. $8 Non-Alcholic Beer Heineken 0.0 (NA) Unique top ingredients with gentle alcohol removal and blending to achieve a fruity flavor with slight malty notes. Non-Alcholic Beer $5 $5 Wine by the Glass $7 Cabernet Sauvignon $7 $7 Merlot $7 $7 Chardonnay $7 $7 Pinot Grigio $7 $8 Prosecco $8 Classic Mixed Drinks $9 Irish Coffee Clontarf Irish Waskey fresh hot black coffee topped with whipped cream and green sugar. $9 $12 Bloody Mary From Scratch Tomato Juice, House Vodka, Horseradish, Worcestershire sauce, Hot Sauce, Lemon and an olive. $12 Other Beverages $3 Coke, Sprite, Diet Coke, Tonic, Ginger Ale. Hot Tea Hot Coffee"
}