{
  "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/page/3/",
  "title": "On cheese - Page 3 - Dairy and Eggs - Moutfulsfood",
  "text": "Wilfrid Posted October 20, 2024 Author Posted October 20, 2024 Paves de Paris, goat and cow, Dauphinoise, quite the rind. Fiorita, sheep’s milk from Tuscany. These from Formaggio. I bought Montgomery’s cheddar too, but who needs a photo? Quote relbbaddoof Posted October 23, 2024 Posted October 23, 2024 (edited) My Hell's Kitchen apartment is in a cheese wasteland. There have been bright spots here and there -- a small counter run by a grandmotherly type in the lower seventies comes to mind, but it closed -- and Salumeria Rosi on Amsterdam and 83rd carries a few Italian cheeses, but there's been no really good cheese generalist in the area. I have to get down to Formaggio Essex (which I did a couple of weeks ago after a 4+ year gap -- and was glad to be able to chat with Andrew again), or to carry cheese from the Cambridge mothership on Amtrak, and risk being thrown off as the odor leaks from the cooler. But that's now changed with the opening in May of Spitfire Cheese & Sundry on the SW corner of 55th and 8th. I stumbled upon them last week and they show considerable promise. Their cheese case from L to R: Much of what they carry now are the usual suspects (among the blues just above: one Roquefort, a Gorgonzola, a Bayley Hazen, and 2--3 others). You're not going to get multiple Roqueforts to compare (at one glorious point in FK, Cambridge, they had a tasting of 7 Roqueforts from 7 different caves), or anything really unusual. But it's a fantastic start, and I wish them every success. Their cases are clearly set up to have room to grow. I urge you cheesy people to shop here for a bit and boost them. (Go there away from the lunch rush, though. Only the two principals were working there on my two visits and they were too harried and occupied at lunchtime to talk cheese.) The rest of the store is given to what's now expected in \"high end\" food stores: tinned fish, nice oils, potato chips, a few jams, etc. They seem to particularly like inserting Asian touches throughout: their pasta shelf has both Italian pasta and Chinese noodles, their hot sauces are intermingled with chili crisp (LGM, not any fancier brand), etc. All to the good in a neighborhood that's otherwise riddled with chain stores. Edited October 23, 2024 by relbbaddoof Quote mongo Posted October 24, 2024 Posted October 24, 2024 On 4/19/2024 at 5:48 PM, voyager said: Husband did the same thing. Horrible odor but absolutely sublime interior flavor that's enough of that. 1 Quote StephanieL Posted October 26, 2024 Posted October 26, 2024 Fraudsters steal more than 22 tons of \"high-value\" Cheddar from Neal's Yard Dairy. Quote Wilfrid Posted October 26, 2024 Author Posted October 26, 2024 On 10/23/2024 at 3:08 PM, relbbaddoof said: But that's now changed with the opening in May of Spitfire Cheese & Sundry on the SW corner of 55th and 8th. I stumbled upon them last week and they show considerable promise. Most useful. About a month ago I was hurrying to a business meeting at a coffee shop on 8thAve, noticed this place, and promised myself to come back and check it out. Then I forgot. Quote Wilfrid Posted October 26, 2024 Author Posted October 26, 2024 45 minutes ago, StephanieL said: Fraudsters steal more than 22 tons of \"high-value\" Cheddar from Neal's Yard Dairy. You'd think it would be hard to sell 22 tonnes of fancy cheese with nobody noticing. Maybe the entire consignment will be sold to an unscrupulous distributor outside the country. Quote Wilfrid Posted October 27, 2024 Author Posted October 27, 2024 Reminds me of the one time I over-cheesed. A cheese event at a vast warehouse in Queens. Multiple bars, cheese-related events on stage and a massive, endless all-you-can eat cheese buffet curated by Tia Keenan. I ate as much as I could. Didn’t make myself ill, but I did feel weird afterwards. Some kind of cheese drunkenness. Sad bit, I remember running into Anne Saxelby there. 😢 Quote relbbaddoof Posted October 27, 2024 Posted October 27, 2024 (edited) 2 hours ago, Wilfrid said: time I over-cheesed. You, and our two-year-old daughter in 1998. We'd adopted her in 1997 in India and in order to boost her obviously malnourished state fed her such cheese as was available there -- tinned Amul Cheese. We'd place a tiny cube on her tiny tongue. She'd look puzzled and sit there motionless for a while, then spit it out. Ah, we said, she doesn't like cheese. Three months later (it was now early 1998) after the long legal procedures were over we arrived back in Cambridge, stopping off at the local grocery for milk, eggs and sliced bread for what we thought would be our modest first dinner back. An hour after we arrived there was a knock at the door. We opened it to find that the perpetrators --the owners of Formaggio Kitchen, as it turned out -- had fled. At the door was a bag with a roast chicken, some haricot vert, a baguette, several cheeses, and a chocolate cake. That was our daughter's first meal in America. We didn't initially offer her any cheese -- but she pointed and yowled and ate with gusto what we cautiously gave her. Two months later FK had their 7-Roquefort tasting. We couldn't go, but they packaged us a tasting platter. Our daughter gobbled it all up, with a strong preference for the hard-to-get Yves Combes. That night she woke us up crying with pain. Apparently she'd over cheesed. Edited October 27, 2024 by relbbaddoof 1 Quote Wilfrid Posted October 27, 2024 Author Posted October 27, 2024 Great story. I do remember that when my daughter was a toddler she’d eat the smelliest soft cheeses. Growing up she became strictly a hard and mild cheese girl. Quote relbbaddoof Posted October 28, 2024 Posted October 28, 2024 It's her birthday next week, and while we'll have cake her most anticipated treat is a wheel of Hooligan. 1 Quote small h Posted October 28, 2024 Posted October 28, 2024 4 hours ago, Wilfrid said: I remember running into Anne Saxelby there. I miss her a lot. 1 Quote Wilfrid Posted October 28, 2024 Author Posted October 28, 2024 15 minutes ago, small h said: I miss her a lot. Lord yes. Quote relbbaddoof Posted October 28, 2024 Posted October 28, 2024 Yes, Anne Saxelby was great. In the early days, \"Saxelby\" was just a small counter in the old Essex St. Market and she'd be there herself. I learned a lot about American cheeses from talking to her. She also participated in an excellent panel on Public Markets at the Tenement Museum in 2012 (my ticket records show). That was fun, too. 1 Quote small h Posted October 28, 2024 Posted October 28, 2024 The old Essex Market is where I know her from. In addition to her cheese counter, she also did a lot of work organizing the vendors and planning events to publicize the market. Quote Wilfrid Posted October 28, 2024 Author Posted October 28, 2024 And lobbying for extended opening hours. Quote hollywood Posted November 1, 2024 Posted November 1, 2024 On 10/26/2024 at 1:30 PM, Wilfrid said: You'd think it would be hard to sell 22 tonnes of fancy cheese with nobody noticing. Maybe the entire consignment will be sold to an unscrupulous distributor outside the country. Justice prevails. https://www.nbcnews.com/news/world/grate-cheese-robbery-man-arrested-24-tons-cheddar-totaling-390000-stol-rcna178224?utm_source=substack&utm_medium=email Quote Wilfrid Posted November 2, 2024 Author Posted November 2, 2024 First sentence is great. Sorry, grate. Quote Wilfrid Posted November 17, 2024 Author Posted November 17, 2024 Formaggio has Vacherin (and Top Hops has ice cold Brooklyn Cider House Bone Dry cider). Quote Wilfrid Posted November 22, 2024 Author Posted November 22, 2024 And the Vacherin is really good.! Quote small h Posted November 22, 2024 Posted November 22, 2024 I'm liking the Black Betty from Formaggio Essex. I feel like grating it over something. Quote MitchW Posted November 22, 2024 Posted November 22, 2024 (edited) They've had this cheese called Payoyo the last few times I've been there; it's a blend of sheep and goat from Andalucia, and it's quite good. I also bought a giant tin of my favorite potato chips to bring on our road trip down to N. Carolina for Thanksgiving. We're having Katz's the day after Thanksgiving (since it was the easiest thing to send down ahead), and I figure the added sodium can only help. Actually, the chips are not too salty (the other brand, Torres, are quite salty)... Edited November 22, 2024 by MitchW Quote relbbaddoof Posted November 22, 2024 Posted November 22, 2024 Those are very good chips, but their small bags are impossible to open. There's a \"helpful\" indented line near the top, but like the similar line on a packet of imodium it doesn't quite reach to the top. In my hour of need I once had to ask an Amtrak attendant in their lounge (we frequent travelers and our secret lounges) for scissors. For the chips yesterday, I had to resort to a knife. Still, excellent chips. 1 Quote relbbaddoof Posted November 22, 2024 Posted November 22, 2024 21 hours ago, Wilfrid said: And the Vacherin is really good.! The ones they showed me today at the Cambridge mothership were just as good-looking, but I was buying for Thanksgiving, and I go all-American that day, and only-American. I'm sticking with it, despite America's recent decision to abandon people such as me. I \"settled\" for some excellent-looking Winnimere. Hooligan has sadly gone seasonal now, and while I await my first wheel in December, I got some alternatives, plus for the faint-of-palate, a half-wheel of Moses Sleeper. I still have on hand some terrific young Bloomsday from Cato Corner, and a wheel/disc of their Celeste. 1 Quote MitchW Posted November 23, 2024 Posted November 23, 2024 4 hours ago, relbbaddoof said: Those are very good chips, but their small bags are impossible to open. There's a \"helpful\" indented line near the top, but like the similar line on a packet of imodium it doesn't quite reach to the top. In my hour of need I once had to ask an Amtrak attendant in their lounge (we frequent travelers and our secret lounges) for scissors. For the chips yesterday, I had to resort to a knife. Still, excellent chips. At this point, I use scissors for everything! Quote"
}