{
  "url": "https://baike.baidu.com/item/周生生集团国际有限公司/14587863",
  "title": "周生生集团国际有限公司_百度百科",
  "text": "周生生集团国际有限公司（Chow Sang Sang Holdings International Ltd.），股票：周生生（00116.HK），成立于1992年1月31日，是香港首家上市的珠宝业公司，主要从事珠宝制造及零售、贵金属批发等业务。总部设于中国香港九龙弥敦道229号周生生大厦4楼，现任董事会主席为周永成 [16-17] [27]。旗下拥有EMPHASIS、PROMESSA等多个子品牌 [5-6]。 周生生前身为周芳谱1934年在广州创立的周生生金行，1957年在香港注册公司，1973年成为香港首家珠宝业上市公司 [1] [16] [27]。1988年重新进入中国大陆市场并开设分店 [5]，2005年获得De Beers旗下DTC钻石配货商资格 [18]。截至2016年12月31日，周生生在中国内地共有374家分店。 [1]2018年，首间主打轻奢日常佩饰的全新概念店MINTYGREEN在广东省深圳市九方购物中心正式开幕 [5]。2020年首间PROMESSA专属珠宝定制体验店于重庆万象城开业 [5]。2024年通过科学基础目标倡议组织(SBTi)减碳目标认证，同年营业额达211.76亿港元 [22] [26] [28]。2025年上半年，“周生生”关店62家，从771家降至709家。 [29]2026年1月6日，部分定价类金饰调价，涨幅在200元到1500元不等。 [31] - 公司名称 - 周生生集团有限公司 - 外文名 - Chow Sang Sang Holdings International Ltd. [17] - 所属行业 - 珠宝制造和零售 [16] - 成立时间 - 1992年1月31日 [16] - 总部地点 - 中国香港九龙弥敦道229号周生生大厦4楼 [17] - 经营范围 - 珠宝制造及零售、贵金属买卖等 [16] - 公司类型 - 上市公司 - 公司口号 - 亲力亲为，以客为先，货真价实，素质至上 - 年营业额 - 211.76 亿元 [15]（港元 2024年） - 员工数 - 11784 人 [21]（2025年） 发展历史 播报编辑 前身 1934年，周芳谱在中国广州开设首家周生生金行，其名字来自“周而复始，生生不息”。 [1] [37]1938年广州沦陷，周芳谱举家迁往中国澳门，在该地经营生意。1941年，周芳谱将店铺交与各儿子分别经营。周君令、周君廉及周君任三兄弟负责澳门店。1948年，三兄弟在香港旺角上海街开设分店。 1957年，周家三兄弟在香港成立“周生生金行有限公司”。1963年，周生生元朗分行正式营业。1971年，“周生生金行有限公司”改名为“周生生珠宝金行有限公司”。 [37] 1973年，周生生在香港上市，为香港第一家上市的珠宝业公司。 [1] 1988年，周生生重新进入中国大陆市场 [5]。 集团成立 1992年1月31日，周生生集团国际有限公司在中国香港正式成立。 [16-17] [27] 2001年，香港首家珠宝公司设立申商“周生生网上珠宝店” [5]。 2005年，取得全球最大钻坯供应集团De Beers旗下DTC的钻石配货商资格，可以直接购进钻石毛坯。 2013年，周生生顺德工业园正式投入生产。厂房占地28000平方米，设计高度结合节能，减排及绿化环境的环保理念，并引入最先进的生产设备。 持续发展 截至2016年12月31日，周生生在内地共有374家分店。 [1] 2018年，首间主打轻奢日常佩饰的全新概念店MINTYGREEN已于广东省深圳市九方购物中心正式开幕。 中国内地首间EMPHASIS珠宝精品店于11月在广州太古汇隆重开幕 [5]。 2020年，首间PROMESSA专属珠宝定制体验店于重庆万象城开业 [5]。 2021年，首家周生生华宇正式开幕 [5]。 2022年，周生生与英国维多利亚与艾伯特博物馆（Victoria & Albert Museum，以下简称“V&A” ）合作，在香港K11 MUSEA购物中心内开设了一间“V&A博物馆 X 周生生”珠宝概念店。 [5] [38]同年11月10日，周生生正式入驻中国香港海港城，开设全港首间以海洋为主题的全新珠宝概念店。 [38] 截至2024年，集团拥有超过1000家直营店铺，覆盖中国大陆及港澳台地区 [5] [25]。 2025年10月8日，国际金价续创新高，现货黄金日内突破4000美元/盎司关口。国内多家黄金珠宝品牌金饰价格持续攀升，其中周生生足金饰品涨至1165元/克。 [24] 2025年12月30日，国内黄金饰品价格出现大幅回调，周生生公布的足金首饰价格报1353元/克。 [30] 2026年1月6日，周生生部分定价类金饰调价，涨幅在200元到1500元不等。 [31] 企业治理 播报编辑 主要股东 管理人员 主营业务 播报编辑 周生生集团国际有限公司是一家主要从事珠宝制造和零售的投资控股公司。该公司通过四个分部经营其业务。珠宝制造及零售分部分部从事珠宝制造及零售以及经营零售店。贵金属批发分部从事贵金属买卖。证券及期货经纪分部分部提供证券和期货的经纪和买卖服务。其他业务分部从事物业投资和其他与珠宝相关的业务。 [34] 集团根据企业理念的原则，对每个细节不断精益求精，力争为顾客提供一流的产品及服务 [5]。 周生生凝聚近90多年的悠久历史，秉持“周而复始 生生不息”的品牌理念，聚焦品味人士目光，凝铸精湛工艺的坚持与追求，周生生品牌已成为优秀品质及挚诚服务的标志。周生生的每件臻宝杰作均糅合着典雅、优美、时尚及创意元素 [5]。 一直以来，周生生积极引入创新多元化的零售模式，旨在推动奢雅珠宝业的发展。品牌已推出不少跨界、跨地域的项目，当中包括引入国际知名珠宝品牌、开设博物馆主题珠宝体验店等；以多品牌策略拓展集团业务版图，为亚洲地区的顾客提供珠宝饰品选择。现如今，周生生业务已覆盖中国大陆、中国香港、中国澳门及中国台湾地区，拥有超过1000 间直营店铺，同时设立网上购物服务，为全球追求雅致品位的顾客，提供优质珠宝与专业服务 [5]。 一直以来，周生生积极引入创新多元化的零售模式，已推出不少跨界、跨地域的项目，当中包括引入国际知名珠宝品牌、开设博物馆主题珠宝体验店等；以多品牌策略拓展集团业务版图，为亚洲地区的顾客提供珠宝饰品选择。现如今，周生生业务已覆盖中国大陆、中国香港、中国澳门及中国台湾地区，拥有超过1000间直营店铺，拥有超过11000名员工 [5]，荣获19751百万港元销售额 [10]。 周生生集团一直致力打造专属贴心购物体验，让客户突破地域界限，随时、随地、随心选购心爱饰品；集团亦早着先机，透过创新技术发展，用于优化用户体验，如云货架、智能配送中心、店内及电子销售工具，网上购物服务等，发展出远优同业的全渠道销售 [5] 品牌管理 - 旗下品牌和代理品牌 周生生凭借优质雅致品牌形象，多年来一直引领珠宝潮流发展，由婚嫁、送礼、日常饰品及高级珠宝，为顾客提供高质量及多元化产品选择，并提供一站式贴心优质的珠宝购物体验 [5]。 周生生旗下品牌包括有：旗舰钻石品牌「全爱钻™」，婚恋珠宝定制品牌「PROMESSA」，新世代日常珠宝配饰品牌「MINTYGREEN」, 时尚原创设计品牌「EMPHASIS」等 [5-6]。2018年起在中国内地开设精品概念店 [5-6]。 同时，周生生也代理知名的国际品牌包括：意大利手工珠宝品牌「Marco Bicego」 [6]、劳力士、帝舵表 [7]。 品牌代言人 主要产品 播报编辑 钻饰、 [35]珠宝。 [36] 经营状况 播报编辑 2016年，周生生营业额为160.93亿港元，同比下滑16%；净利润7.42亿港元，同比下滑34%。 [1] 2024年3月10日，新京报贝壳财经记者注意到，周生生集团国际有限公司发布公告，预计2023年，来自持续经营业务的公司拥有人应占溢利录得10亿港元至11亿港元，2022年为4.86亿港元。此外，周生生还在公告中提到，2023财年，其营业额上升至逾250亿港元，溢利则以2022年的低基数进行比较。据悉，2022年营业额为206亿港元。 [12] 2025年3月25日，周生生公布2024年业绩，期内集团营业额约211.76亿港元，同比减少15%。公司拥有人应占溢利约8.06亿港元，同比减少20% [15]。 2025年上半年，“周生生”关店62家，从771家降至709家。 [29] 社会责任 播报编辑 周生生肩负企业公民责任，多年来持续为环境及社区作出贡献 设立为2030年环境目标，以逐步加强气候变化的适应能力 [5] 自2014年起参与由香港环境及生态局所举办的《节能约章》 [10] 办公室及分店的照明正逐步转用LED灯，而四个工厂预计将于2024年完成所有更换工程 [5] 采用环保设计和绿色建筑材料兴建佛山工业园及修建西安大都荟旗舰店 [5] 多面向支持公益事务，致力为广泛社群关怀送暖 自2014年与上海市黄浦区教商基金会合作举办生生不息受心助学基金，协助家庭困难的学生完成学业，成就梦想 [5] [8]。 颁赠600万元奖学金予修读香港城市大学——美国哥伦比亚大学双联学士学位课程的学生，为教育及未来人才培养出力 [10]。 周生生于2021年成立了周生生集园研究基金，以支持香港城市大学在材料科学、人工智能和智慧城市领域的研究 [10]。 企业文化 播报编辑 企业理念 自89年前秉承至今，创办人周芳普先生推崇之企业理念—“周而复始，生生不息”乃启发自中国传统典籍《易经》，寓意业务业务演变繁衍，生生不息。此神来之笔既点出姓氏，亦表达了他对企业的祝福，顾客更认为是好意头。多年来，集团致力彰显创新思维，积极创变优化，同时持续积累经验，壮大企业发展 [5]。 核心价值 周生生始终秉承以下四大核心价值，让集团得以巩固珠宝界领导地位，衍变生生不息的业务机遇 [3]。 传承延绵 创新不懈 优质内涵 雅致表征 科技前瞻 环保首要 企业得体 管治有道 [3] 社会荣誉 播报编辑 周生生为香港第一家上市的珠宝业公司 [1]。 1983年，周生生首创足金宝猪摆件，开创卡通生肖之先河 [4]。 周生生贵金属化验所作为香港商营机构第一家，取得香港政府工业署属下，香港实验所认可计划的黄金成色检定资格，并于第二年取得白金成色检定资格认证 [10]。 周生生于1995年首次开设官方网站 [5]，成为香港第一家登上互联网的珠宝公司 [10]。 1998年周生生零售管理系统取得ISO 9002国际品质证书，为珠宝金饰业内第一家获此证书的机构 [10]。 荣获由《哈佛商业评论》及 SAP主办的2021“鼎革奖”数字化转型先锋榜年度企业奖 [9]，以表扬周生生集团实现数字化转型丶全渠道策略及通过科技追求提升顾客体验 [10]。 作为国内知名品牌珠宝商，周生生集团斩获第十一届财经峰会两项大奖，企业荣获\"数字化创新引领奖\" [10-11]。 企业事件 播报编辑 2024年初开始，以周大福、周生生等黄金品牌为例，年初每克黄金价格600元出头，周大福、六福珠宝、周生生等品牌的价格都超过了800元每克。 [14] 2025年9月，周生生等品牌已开始或即将上调“一口价”黄金饰品价格。 [23] 2026年1月9日，有网友发现，周生生天猫旗舰店里一件黄金生生有喜系列珍珠四叶草项链婚嫁五金价格上调至136000元。当日晚间，界面新闻从周生生天猫旗舰店客服获悉，这款项链此前一天售价120800元，一夜之间暴涨15200元；叠加店铺满3800减60的优惠活动，券后价135940元。据客服介绍，这些涨价特选货品包含本身物料价值、设计费、专利费等，因金价飞涨，基于成本不断增加，集团不定期会调整销售价格。同日，各大金饰品牌实时报价再次接近1400元/克。周生生足金饰品克价为1392元/克，比1月5日的1376元/克上涨16元/克。周大福、潮宏基、谢瑞麟报价均为1392元/克。 [32] 2026年1月，广东清远的李女士投诉反映，她新购买的周生生足金福袋挂坠佩戴一天后即被刮花，并出现白色痕迹。因对饰品含金量产生怀疑，她将挂坠送检，结果发现不同点位的金含量数据存在差异。李女士提供的检测结果照片及视频显示，该挂坠纯度最高点位金含量为99.99%，但其他点位的检测结果却出现了不同的数据：其中一个点位金含量为96.21%，另一个点位为83.35%，最低的一个点位仅为64.37%。金含量最高点位和最低点位相差35.62%。此外，检测结果照片还显示，挂坠中含有铁、银、钯等多种其他金属元素。然而，当其据此要求退货时，却一度遭到拒绝。对此，销售门店和周生生方面则表示，出于诚意可退货，愿意陪同到权威机构检测。 [33] 2026年2月3日，周生生官方账号发布情况说明：我们高度重视顾客反映的相关事宜，正积极开展相关工作。感谢社会各界的关注与监督，相关进展我们将及时发布。 [40] 2026年2月3日晚，@周生生 发布情况说明：我们充分理解顾客和公众的顾虑，针对顾客反馈的相关情况，我司高度重视，第一时间复核了当时出厂批次的破坏性检测报告，报告显示该批次货品质量完全符合国家相关标准。同时，今日2月3日，我司已将同批次同款福袋送检至国家珠宝玉石首饰检验集团有限公司（NGTC），采用X射线荧光谱法（XRF）进行检测，该福袋货品的检测结论为足金饰品（报告编号：P-ZSSA2121621）。NGTC对该货品随机选取3个检测点，检测所得金含量结果依次为 99.99%、99.99%、99.98%（详见附件）。感谢社会各界的关注和监督，我司正全力配合相关部门开展工作，相关进展我们将及时公布。 [41]在发布公开情况说明的同一天，周生生官方旗舰店及品牌客服也同步作出补充回应，进一步解答市场及消费者的疑问。客服表示，周生生所有足金饰品均符合国家相关标准，含金量不低于990‰，饰品均带有足金钢印，正规渠道购买的产品均为正品；品牌门店均为直营模式，未设立加盟或代理门店，线上官方渠道也均为正品销售。 [42] 2026年2月4日，从广东省清远市清城区市场监督管理局获悉，针对周生生（顺盈时代广场店）黄金饰品争议问题，清远市清城区市场监督管理局已依法受理并组织调解处理。鉴于消费者对所购买的黄金饰品质量有异议，经消费者与商家双方协商同意，由清远市清城区市场监督管理局把涉事饰品送有资质的第三方检测机构检测，后续将根据检测结果依法依规进行处理。 [43]清城区市场监督管理局在涉事双方的见证下，于3日下午封存样品，4日上午由市场监督管理部门送检。目前，涉事双方均在检测现场。该局工作人员介绍，此次送检机构具备鉴定资质，出具的结果具有法律效力。为保证此次检测过程不受干预，该局工作人员未向记者透露具体检测机构地点及名称。 [44]"
}