{
  "url": "https://www.nicolas.com/en/",
  "title": "Nicolas : Wine, Champagne. 500 stores in the world",
  "text": "Where to find us + than 500 stores Nicolas in France My account Our selection - WineLoire Centre Touraine Sauvignon AOC /Touraine Chenonceaux AOC 202410, € 208, € 65 8.65 i.e. 11.53 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - WineMéditerranée Côtes De Provence AOC 202411, € 909, € 50 9.50 i.e. 12.67 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - WineLanguedoc-Roussillon Corbieres AOC/ Corbières Boutenac AOC 202314, € 9511, € 95 11.95 i.e. 15.93 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - Sparkling wineChampagne Champagne AOC35, € 0029, € 75 29.75 i.e. 39.67 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h Big deals - WineBordeaux Bordeaux AOC 20224, € 503, € 15 3.15 i.e. 4.2 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - WineMaroc7, € 705, € 35 5.35 i.e. 7.13 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - WineVin De France 20238, € 706, € 95 6.95 i.e. 9.27 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h - WineRhône Luberon AOC 202315, € 9512, € 75 12.75 i.e. 17 € / liter Bottle 75 cL From February 02 to February 15 2026Delivery in 24/72h Gift ideas Our services Maison Nicolas : buyer of wines, champagnes and spirits since 1822 Welcome to Maison Nicolas. You will find in one of our 500 stores and on Nicolas.com, all news, gift ideas, best vintages and of course, all bottles that have marked the year. At Maison Nicolas, there is something for everyone’s taste and desires. The challenge is to find the bottle which corresponds to each opportunity. Whether for a wedding, dinner with friends or simply for pleasure to offer, we help you to find the perfect wine that will sublimate each event. Discover our wide range of red wines, white wines, rosé wines through the whiskies, cognac, Armagnac and other alcohols, including our selection of champagnes and cremants for giving sparkling at all important moments of your life. The most emblematic wine-growing regions are represented. You will find all wines of your favorite vineyard. Thirst for discovery? Let your taste buds travel with our foreign wines selection: Australia, Argentina, South Africa, New Zealand… The destinations proposed will offer you pleasant surprises to expand your horizons. Access without further delay to the wine selection, bargains, crushes of cellarmen, gift ideas. You will find surprising bottles with authentic taste."
}