{
  "url": "https://mail.cityofmartin.net/about.htm",
  "title": "About Martin",
  "text": "Martin is located in Weakley County, 130 miles northeast of Memphis, and 150 miles northwest of Nashville. Martin is the largest city in Weakley County. The city is served by U. S. Highway 45E, Tennessee State Highway 22, and the West Tennessee Railroad. (see the location map). The Martin area is characterized by level to gently rolling land with an average elevation of about 400 feet. Most industrial areas are suitable for immediate construction with very little site preparation required. Martin was founded in 1873 and incorporated in 1874. Two principal industries developed in Martin in the early 1880's, the Martin Roller Mills Company and the Martin Planing Mill, and they represented capital stocks of $50,000 and $25,000 respectively. The Bank of Martin opened for business in 1886. The city has been a pioneer in activities of higher education since the year 1900 when Hall Moody Institute, the first advanced educational institution, was established. In 1927, the school became The University of Tennessee Junior College and became a senior college in 1951, when it was named The University of Tennessee Martin Branch. In 1967, it officially became The University of Tennessee at Martin, a primary campus of the University of Tennessee. The University is perhaps one of the most important factors contributing to the growth and development of Martin and its economy. This community seeks new industry and has a cooperative municipal government and citizenry. Martin maintains a sound business climate which is receptive to business, believes in and encourages the free enterprise system, has a realistic tax structure, and encourages good labor management relations. Martin is located in northwestern Weakley County, 130 miles northeast of Memphis and 150 miles northwest of Nashville. It is the largest city in Weakley County with a population of 10,515.Martin is at the heart of a five-county metropolitan region of over 100,000 people. Our city is readily accessible from five exits off of Highway-22, and provides quick access to (Martin City Hall located at 101 University Street at an elevation of approximately 400 feet above sea level.) The city was founded in 1873 and named in honor of Captain William Martin, a prosperous landowner who settled in the area in 1838. By the late 1850's Captain Martin influenced the Nashville and Northwestern Railway to construct a line which would run through the Martin estates, thus serving the citizens of the area. During the early 1870's Marshall and George Martin, sons of Captain Martin, began an intensive campaign to convince the Mississippi Central Railroad to route its railway through the town of Greenbriar Glade where the Martin Estate was located. They donated land for the railroadâs right-of-way, as well as land for the creation of a town park. Mississippi Central officials agreed with the proposal and the railroad was completed in December 1873. Soon after the completion of the Mississippi Central, the townâs name Greenbriar Glade, was changed to Frost in honor of a railroad official. As the name Frost did not appeal to those wanting to settle in northwest Tennessee, George and Marshall petitioned to rename the town Martin, in honor of their father. Within a short time the name was officially changed. Th City of Martin has been a pioneer in the establishment of higher education since1900. Members of the First Baptist Church, under the leadership of Dr. I. N. Penick, established the first advanced educational institution in Martin, first known as Hall-Moody Normal. The name was later changed to Hall-Moody Institution. The growth of the educational institution was recognized through the University of Tennessee Agricultural School. The name was changed to the University of Tennessee Junior College and the first accredited college studies were offered. In 1951, the Junior College was designated the University of Tennessee Martin Branch with degrees offered in several areas. By 1967, the State Legislature named the institution - The University of Tennessee at Martin. ."
}