{
  "url": "https://voyageforum.com/forum/maroc_renseignement_pour_un_guide_marrakech_d529746/",
  "title": "Renseignement pour un guide à Marrakech | Forum: Maroc | Voyage Forum",
  "text": "bonjour, je vous souhaite les bienvenues au marocpour repondre a vos questions, si vous passez par une agence de voyage ca vous coutera un peu plus cher et vous serez pas totalement libre de visiter et d'etre emerveillé par la simplicite de vie des habitants. pour commencer; une Promenade qui vous permettra de découvrir divers monuments, caractéristiques de lArt Islamique et Mauresque de Marrakech. -Koutoubia : Elle servit de modèle à la Giralda de Séville. Aussi haute que celles de Notre Dame de Paris, les quatre faces sont différentes. -Tombeaux Saâdiens : la porte dentrée est au fond dune petite impasse après le mûr de la mosquée Mausolée du XVIème siècle, qui abrite la tombe du Sultan Ahmed el-Mansour, entouré de ses fils. -Palais El -Badie: Construit en un temps record -Musée de Tiskiwin : il est entre le palais de la Bahia et le musée Dar Si Saïd.... la Médersa Ben Youssef, chef duvre des monuments de la ville. La Ménara Marrakech, symbole de Marrakech au même titre que le Minaret de la Koutoubia. -jardin des majorelles:qui furent crée par le peintre français jacques majorelle. bab ed dbagh:donne accès au quartier des tanneurs les méthodes traditionnelles de traitement des peaux et du travail des cuirs. ensuite partir en dehors de la marrakech. Ballade \"Au coeur du pays berbère\" à travers l'une des vallées les mieux préservées du Maroc.vous passerez par de multiple village comme village aghbalou, un peu plus loin village aitmechkoul jusqu'a siti fadma situé a prés de 1500 m d'altitude (les 7 cascades) ou vous pouvez vous reposer et manger un bon tajine berbere aussi vous pouvez aller voir: moulay brahim:Saint au Maroc, Pèlerinage Maroc, Brahim, à 5 km d'Asni asni:, ToubkalAsni, village berbère à 47 km de Marrakech, est situé à plus de 1000 m d'altitude, et se trouve au pied du mont le plus haut du Maroc (Djebel Toubkal à4165m). C'est le souk du samedi qui est le plus intéressant. et si vous continuez vers la route de taroudant vous emprunteriez la route de tizint test merveilleuse pour les paysages que vous allez decouvrir.et bien sur vers le sud ouarzazat et ses beau paysages magique. je vous propose aussi de visiter la ville d' essaouira a 178km de marakech une petite ville a visiter dans moins d'une journée. pour le transport y a des grand taxi qui vous emmenent jusqu'a ces endroits, mais ce qui sera mieux de louer une voiture comme ca vous serez trankil et vous visiterez tant que vous voudrez, et si vous voulez je vous ferais visiter ces endroits. si vous avez des questions, de savoir d'autre informations je suis a votre disposition.et j'aimerais bien vous invite dans notre medeste maison, a manger un vrai delice qui est le couscous suivi d'un bon the. coordialement mohamed"
}