{
  "url": "https://en.m.wikipedia.org/wiki/Pete_Davidson",
  "title": "Pete Davidson - Wikipedia",
  "text": "Pete Davidson Peter Michael Davidson (born November 16, 1993) is an American comedian, actor, and writer. He began his career in the early 2010s with minor guest roles on Brooklyn Nine-Nine, Friends of the People, Guy Code, and Wild 'n Out before being hired as a cast member on the NBC late-night sketch comedy series Saturday Night Live which he starred in for eight seasons from 2014 to 2022. Following his rise to prominence on SNL, Davidson starred in and executive produced the comedy film Big Time Adolescence (2019), and co-wrote and starred in the semi-autobiographical comedy-drama film The King of Staten Island (2020), and the Peacock series Bupkis (2023). He continued acting in films such as The Suicide Squad (2021), Bodies Bodies Bodies, and Meet Cute (both 2022). Davidson has also released three comedy specials: Pete Davidson: SMD (2016), Pete Davidson: Alive from New York (2020), and Pete Davidson: Turbo Fonzarelli (2024). Early life and family Peter Michael Davidson[1] was born on November 16, 1993, in the Staten Island borough of New York City to parents Amy (née Waters) and Scott Matthew Davidson.[2][3] Scott was a New York City firefighter for Ladder 118 who died in service during the September 11th attacks, along with the rest of his unit.[4] He was last seen running up the stairs of the Marriott World Trade Center in Downtown Manhattan just before the building was destroyed when the Twin Towers collapsed. His Requiem Mass was held at St. Clare's Catholic Church in Great Kills, Staten Island. Davidson, then aged seven, later told The New York Times that it was \"overwhelming\" and that he later acted out in school as a result of the trauma, at one point ripping his hair out until he was bald.[5] In October 2016, he revealed on The Breakfast Club morning radio show that he struggled with suicidal thoughts when he was younger and that the music of Kid Cudi saved his life.[6] Davidson's father was predominantly of Jewish ancestry,[7][8] with some distant German, Irish and Italian roots. His mother is of mostly Irish ancestry, with some distant German roots.[5] He has a younger sister named Casey,[9][10] and was raised Catholic.[5][11] Davidson attended St. Joseph by-the-Sea High School, and then Tottenville High School in Huguenot, before transferring to Xaverian High School in Bay Ridge, Brooklyn and graduating from there in 2011. After high school, Davidson enrolled at St. Francis College in Brooklyn Heights,[3] which he attended for one semester upon which he decided to drop out to pursue a full-time career in comedy.[12][13] He first tried stand-up comedy at age sixteen in a Staten Island bowling alley, where a group of friends that included future professional baseball player Matt Festa, knowing of his comedy aspirations, dared him to take to the stage.[14] Career Early career (2013–2014) Davidson's earliest onscreen appearance was in the third episode of the MTV comedy series Failosophy, which premiered February 28, 2013.[15] The following month, he appeared in \"PDA and Moms\", a third-season episode of the MTV2 reality TV comedy series Guy Code, the first of four episodes in which he was featured.[16] That June, his first televised standup aired as part of a second-season episode of the Comedy Central program Gotham Comedy Live, which showcases standup comedians at the Gotham Comedy Club in New York City. The following month, he returned to MTV2 with an appearance on Nick Cannon Presents: Wild 'N Out, his first of six appearances on that show. He subsequently made standup appearances on television and appeared in Brooklyn Nine-Nine.[17] In 2014, he acquired a role in a Fox comedy pilot, Sober Companion,[18] but it ultimately did not make it to series.[19] Saturday Night Live and breakthrough (2014–2022) Davidson joined the cast of Saturday Night Live with the show's 40th-season premiere, which aired on September 27, 2014. At age 20, he was the first SNL cast member to be born in the 1990s and one of the youngest cast members ever.[13][20] The first new addition to the cast that season,[12] Davidson was given a chance to audition for the show through regular Bill Hader, whom he had met while filming a small part in the 2015 Judd Apatow feature film comedy Trainwreck.[21] Hader subsequently told producer Lorne Michaels about him. His debut garnered positive critical notice,[21][22] with his most noted skits during the season including an Indiana Jones-style sketch in which he and Dwayne \"The Rock\" Johnson, after being pelted with poison darts, were forced to mutually suck poison out of each other's various body parts,[14][23] an endeavor that eventually found them entangled in the \"69\" position.[24] Another involved Davidson being shot in the chest with an arrow by Norman Reedus.[14] Over the years, Davidson played a number of characters, the most famous being Chad, an easily distracted apathetic man who first appeared in the season 41 episode hosted by Julia Louis-Dreyfus, as a pool boy who becomes entangled with a lonely housewife. In March 2015, Davidson was a roaster on the Comedy Central Roast of Justin Bieber, and his set was praised as one of the best of the show.[25] Among his bolder jokes was one at the expense of fellow roaster Snoop Dogg, host Kevin Hart, and their 2004 film Soul Plane. Davidson, whose firefighter father died responding to the September 11 attacks, called the film \"the worst experience of [his] life involving a plane\".[14] In 2016, he was placed on the Forbes 30 under 30 list.[26] In April of that year, Comedy Central filmed Davidson's first stand-up special, Pete Davidson: SMD, in New York City.[27] In January 2019, it was announced that Davidson would be touring with John Mulaney in New York, New Jersey, Pennsylvania, and Massachusetts for a limited series of comedy shows titled \"Sundays with Pete & John\". Mulaney and Davidson became close after appearing together on The Tonight Show Starring Jimmy Fallon and Saturday Night Live.[28] That May, after the 44th-season finale of SNL, Travis M. Andrews of The Washington Post credited Davidson with being the most memorable performer that season and its breakout star, which Andrews attributed to Davidson's mining of his personal struggles and his admission of his comedic missteps, which Andrews felt gave the season a mixture of comedy and pathos.[29] Davidson collaborated with Machine Gun Kelly to write the sketch \"A Message from the Count\" for Kelly's album Hotel Diablo. In 2019 he starred in Jason Orley's Big Time Adolescence, and had supporting roles in Adam Shankman's What Men Want, Jeff Tremaine's The Dirt, Thurop Van Orman's The Angry Birds Movie 2, and John Turturro's The Big Lebowski spin-off The Jesus Rolls. In February 2020, Davidson released his stand up special Alive from New York on Netflix.[30] In May 2020, The King of Staten Island was released, which Davidson both starred in and co-wrote with Judd Apatow, who also directed. Davidson was nominated for The Comedy Movie Star of 2020 for his work in The King of Staten Island and The Comedy Act of 2020 Pete Davidson: Alive from New York at the 46th People's Choice Awards.[31] In April 2021, Davidson was cast as Joey Ramone in a Netflix biopic I Slept With Joey Ramone, based on the late singer's brother's memoir of the same name. Davidson will also serve as co-writer and executive producer.[32] In August 2021, he appeared as Blackguard in The Suicide Squad directed by James Gunn.[33] He voiced Marmaduke in an animated film released on Netflix on May 6, 2022.[34] Following lengthy absences in season 47, it was announced shortly before its finale that it would be Davidson's last on Saturday Night Live.[35] Stardom and Bupkis (2023–present) In 2023, Davidson starred in the Peacock original series Bupkis, which he also co-wrote.[36] The series debuted to mixed reviews with The Guardian describing it as \"messy\" and compared it unfavorably to other shows, writing, \"Though every piece seems to come from somewhere else, a derivative streak that undercuts the touches of personal specificity. Pete’s existential ambling suggests a dumber Louie, his travails in the surreal demimonde of celebrity suggest a dumber Atlanta, and his dealings with his coterie of hangers-on suggest a slightly less-dumb Entourage.\"[37] Despite Peacock renewing the series for a second season, Davidson chose to not move forward with one.[38] In 2023 Davidson acted in three high-profile action franchise films. He appeared as Phlektik in Guardians of the Galaxy Vol. 3, Bowie in Fast X, and voiced Mirage in Transformers: Rise of the Beasts. In January 2026, Davidson began a weekly video podcast on Netflix, called The Pete Davidson Show.[39] Comedy style Davidson has been praised for basing his comedy on his own life and employing aspects of his life that have been likened to \"a series of brutal truths and vulgar confessions\" which make him relatable to audiences. He touches upon topics such as marijuana, sex, and relationships. He talks about incidents from his awkward high school experiences to living in a dormitory during his brief stint at St. Francis College.[13] He jokes about highly sensitive subjects, including the loss of his father during the September 11 attacks. He says he finds that it empowers him to address the feeling of powerlessness that experiencing such tragedy at a young age inflicted upon him.[5] Personal life In October 2015, Davidson lived in Brooklyn Heights, New York.[5] In 2019, he lived in Staten Island with his mother in a home they purchased together.[40][41][42] In April 2021, he moved into his own residence in Staten Island.[43] In February 2022, Davidson announced plans to move from Staten Island to Brooklyn to be closer to work.[44] Davidson is the godfather of Leo, the son of fellow comedian and friend Ricky Velez.[45] He is close friends with Cleveland Guardians pitcher Matthew Festa; the two were classmates at St. Joseph by the Sea High School. Davidson once had many tattoos, but had had about 200 removed by 2025, \"trying to clean slate it, trying to be an adult\", though he said he intended to keep two or three.[46] Davidson supported Hillary Clinton in the 2016 U.S. presidential election, and on December 5, 2017, he wrote on his Instagram account that he got a tattoo on his leg of Clinton, whom he called his \"hero\", a \"badass\", and \"one of the strongest people in the universe\". Clinton thanked Davidson, joking: \"This makes it significantly less awkward that I've had a Pete Davidson tattoo for years.\"[47] He supported Joe Biden in the 2020 U.S. presidential election.[48] In 2023, Davidson and fellow SNL comedian Colin Jost purchased a decommissioned Staten Island Ferry boat.[49][50][51] The ferry was used in the film Screamboat.[52] Health Davidson was diagnosed with Crohn's disease at age 17 or 18, for which he receives intravenous biologic therapy, and has used medical marijuana for pain management and recreationally.[53] On March 6, 2017, Davidson announced on his Instagram account that he had quit drugs and was sober for the first time in eight years.[6] During an interview on comedian Marc Maron's podcast, Davidson clarified that the only drug he used was cannabis and, while he has since cut back on its use considerably, the personal and emotional problems he initially assumed were the result of his daily use were actually caused by his newly diagnosed borderline personality disorder, for which he has since been undergoing treatment.[54][55] On December 3, 2018, Davidson shared a candid Instagram post in which he expressed thoughts of suicide before deleting his account.[56] The New York Police Department conducted a wellness check on Davidson in response to social media posts from followers and former fiancée Ariana Grande.[57][58] Davidson had been at the Saturday Night Live studio at the time preparing for the last episode of the year before its holiday hiatus. Davidson and John Mulaney, comedian and former SNL writer, made humorous references to the Instagram post during the Weekend Update segment of the first episode following the holiday hiatus on January 19, 2019.[59] Relationships Davidson dated comedian Carly Aquilino from 2014 until 2015[15] and actress Cazzie David from 2016 to 2018.[60][61][62] In May 2018, he started dating singer Ariana Grande after she broke up with Mac Miller.[63] In June 2018, Davidson confirmed he was engaged to Grande, but the engagement was called off in October 2018 after Miller's death.[64][65][66][67] Grande's song about Davidson, \"Pete Davidson\", is on her 2018 album Sweetener. She also referenced him in her song \"Thank U, Next\" with the lyric, \"Even almost got married / And for Pete I'm so thankful\".[68] The relationship is also notable for popularizing the term \"big dick energy\".[69] In January 2019, Davidson was reported to be in a relationship with actress Kate Beckinsale, but by April they had \"called time on their romance\".[70] In response to media comments about their age difference, he said that such an age gap was new to him and that the media should ask older men in longer relationships with younger women such as Leonardo DiCaprio, Alec Baldwin, Larry King, and Donald Trump about it.[71] Later in 2019, Davidson dated actress Margaret Qualley. Their relationship ended in October.[72] He was involved with model Kaia Gerber from October 2019 to January 2020.[73] In August 2021, he split from Bridgerton actress Phoebe Dynevor after a five-month relationship.[74] Davidson and Kim Kardashian were first spotted out together in October 2021 after Kardashian appeared on Saturday Night Live.[75] During her time hosting an episode of SNL, the two shared an on-screen kiss in a Disney-themed sketch where they played Jasmine and Aladdin.[76] They began dating in November 2021.[75] Kardashian filed for divorce from Kanye West in February 2021.[75] She was legally declared single by a judge in March 2022.[76] West referenced the relationship in his 2022 track \"Eazy\", in which he threatens to \"beat Pete Davidson's ass\".[75] The video for \"Eazy\" depicts a claymation figure of Davidson being kidnapped, buried, and shown his severed head.[76] West further attacked Davidson on Instagram in February 2022, calling him a \"dickhead\" and \"Hillary Clinton's ex boyfriend\".[77] In August 2022, Davidson and Kardashian split up after nine months of dating.[78] Between December 2022 and August 2023, Davidson dated actress Chase Sui Wonders.[79][80] They met on the set of Bodies Bodies Bodies and she later co-starred in Davidson's streaming series Bupkis.[81] He dated actress Madelyn Cline from September 2023 to July 2024.[82] In March 2025, Davidson began a relationship with model and actress Elsie Hewitt.[83] The couple made their red carpet debut at the Blossom Ball in May and later moved in together, dividing time between residences in Brooklyn and upstate New York. On July 16, 2025, Hewitt announced via Instagram that they were expecting a child.[84] On December 18, 2025, Davidson and Hewitt welcomed a daughter, Scottie Rose Hewitt Davidson, named for Davidson's late father.[85] Space flight In March 2022, spaceflight company Blue Origin announced that Davidson would be an \"honorary guest\" alongside five paying customers onboard NS-20, a suborbital flight of its New Shepard craft planned for later that month,[86] but the flight was rescheduled, and Blue Origin announced that Davidson was \"no longer able\" to join the crew of the craft.[87] Car crash incident On March 4, 2023, Davidson crashed his car into a house while driving late at night. No one was injured in the crash. He was later charged with a misdemeanor for \"reckless driving\",[88][89] and agreed to complete 50 hours of community service and attend 12 hours of traffic school as part of a diversion program.[90] Controversies Catholic Church–R. Kelly comparison The Roman Catholic Diocese of Brooklyn demanded an apology from Davidson in March 2019 after an SNL sketch in which he compared the Catholic Church to R. Kelly, an entertainer who had been convicted of pedophilia. In the sketch, Davidson said, \"[Kelly] is a monster and he should go to jail forever. But if you support the Catholic Church, isn't that like the same thing as being an R. Kelly fan? I don't really see the difference, except for one's music is significantly better.\"[91] In a statement on its website, the diocese criticized the \"disgraceful and offensive skit\" and added, \"The faithful of our Church are disgusted by the harassment by those in news and entertainment, and this sketch offends millions. The mockery of this difficult time in the Church's history serves no purpose.\"[92] Davidson's comments came after the Diocese of Brooklyn and Queens agreed to a record $27.5 million settlement for sex abuse allegations in September 2018.[93] Dan Crenshaw Davidson was criticized for mocking Republican congressional candidate Dan Crenshaw, who wears an eyepatch as a result of a wound incurred while serving in Afghanistan.[94] He compared Crenshaw to \"a hitman in a porno movie\" and added, \"I'm sorry, I know he lost his eye in war or whatever.\"[95][96][97][98][99] In response to backlash over the comments, Davidson apologized and appeared beside Crenshaw the next Saturday on an SNL Weekend Update segment. Crenshaw accepted Davidson's apology and called on Americans to \"never forget\" the service and sacrifices of veterans.[100] 2025 Riyadh Comedy Festival Davidson was among the comedians signed up to perform at the Riyadh Comedy Festival, which Joey Shea, Saudi Arabia researcher at Human Rights Watch, said the Saudi government used to whitewash its human rights abuses.[101][102] Davidson's participation in particular drew widespread condemnation due to his father dying in the September 11 attacks and the alleged Saudi role in said attacks; a BBC report identified Saudi Arabia as the primary funding source for Al-Qaeda,[103] and 15 of the 19 hijackers were Saudi citizens.[104][105][106][107] The festival was criticized by other comedians, including Marc Maron, Shane Gillis, and Zach Woods, who slammed the event and the comedians performing there.[108][109] In an appearance on This Past Weekend with Theo Von, Davidson said, \"I've heard there's subreddits of 'I think all these people are in bed with' being influenced by the Saudi Royal Family. I just—you know, I get the routing and then I see the number and I go, 'I'll go.'\"[110] Dustin Rowles of Pajiba said, \"Is there something to be said for Davidson's radical honesty? I mean, no. Not really. It's the same reason every other comedian who accepted is going. They're selling out for the Saudi Royal Family. And while they like to claim it's just another gig, it's not. Again, they're being paid vast sums of money so that Saudi Arabia might be thought of as a destination for popular comedy instead of the country that engages in forced labor and executes journalists. The comedy festival is literally being promoted on Saudi Arabia's tourism page.\"[111] Accolades Filmography Film Television Discography See also References - ^ \"Pete Davidson\". Biography. Archived from the original on October 3, 2018. Retrieved October 3, 2018. - ^ \"Pete Davidson Biography\". TV Guide. Archived from the original on September 30, 2015. - ^ a b Steussy, Lauren (September 15, 2014). \"Staten Island Native Pete Davidson, Son of 9/11 Hero, Joining Cast of Saturday Night Live\". Staten Island Advance. Advance Publications. Archived from the original on September 16, 2014. Retrieved April 5, 2015. - ^ Steussy, Lauren (September 30, 2014). \"Pete Davidson: 5 Things You Need to Know About the New Saturday Night Live Superstar\". Staten Island Advance. Advance Publications. Archived from the original on April 6, 2015. Retrieved April 5, 2015. - ^ a b c d e Caramanica, Jon (October 1, 2015). \"Pete Davidson Nuzzles Up to the Prickly Joke\". The New York Times. Archived from the original on March 6, 2017. Retrieved March 3, 2017. - ^ a b \"SNL's Pete Davidson Says He's 'Happy and Sober for the First Time in 8 Years' in Emotional Instagram Post\". Entertainment Tonight. March 7, 2017. Archived from the original on March 7, 2017. Retrieved March 7, 2017 – via Yahoo! Entertainment. - ^ Hot 97 (December 21, 2017). Pete Davidson Just Discovered He's Jewish, + Thoughts on Floyd Mayweather Octagon Fight. Event occurs at 5:20. Archived from the original on May 31, 2022. Retrieved April 7, 2021. - ^ Hoffman, Jordan (June 8, 2020). \"The King of Staten Island: A Touchingly Funny Film About the Loser You Love\". The Times of Israel. Archived from the original on August 13, 2020. Retrieved July 28, 2020. - ^ Steussy, Lauren (December 16, 2004). \"SNL Star Pete Davidson Is Proud Staten Island Bro: Tweets Support for Sister's Basketball Skills\". Staten Island Advance. Archived from the original on September 27, 2017. Retrieved March 7, 2017. - ^ Azzara, Mike (October 10, 2001). \"Scott Davidson, 33, Firefighter, Was Fierce Sports Competitor\". Staten Island Advance. Archived from the original on August 22, 2019. Retrieved April 8, 2020. - ^ Dachille, Arielle (April 10, 2015). \"Pete Davidson's Family Background Is A Favorite Joke Topic For Him, So Let's Investigate His History\". Bustle. Archived from the original on February 5, 2017. Retrieved February 5, 2017. - ^ a b Bacle, Ariana (September 15, 2014). \"Pete Davidson Added to Saturday Night Live as Featured Player\". Entertainment Weekly. Archived from the original on September 16, 2014. Retrieved September 16, 2014. - ^ a b c Errigo, Michael (February 8, 2015). \"Pete Davidson: a comedian who's one of us\". The Diamondback. Maryland Media, Inc. Archived from the original on March 5, 2016. Retrieved September 14, 2015. - ^ a b c d Vaziri, Aidin (August 12, 2015). \"At 21, Pete Davidson Is a Stand-Up Veteran\". San Francisco Chronicle. Archived from the original on August 24, 2015. Retrieved September 14, 2015. - ^ a b Norwin, Alyssa (May 22, 2018). \"Pete Davidson: 5 Things To Know About Ariana Grande's Rumored New BF\". Hollywood Life. Archived from the original on December 18, 2018. Retrieved December 17, 2018. - ^ Roth, Madeline (September 15, 2014). \"Pete Davidson From 'Guy Code' Is Joining 'Saturday Night Live' Cast\". MTV. Archived from the original on April 28, 2016. - ^ Brooklyn Nine-Nine: The Slump | TVmaze, archived from the original on March 28, 2020, retrieved January 20, 2019 - ^ Goldberg, Lesley (February 25, 2014). \"Justin Long to Star in Fox Comedy Sober Companion\". The Hollywood Reporter. Archived from the original on June 21, 2018. Retrieved February 24, 2022. - ^ Andreeva, Nellie (May 12, 2014). \"We Are... Not Picked Up Yet? Fox Upfront Features 'Sober Companion' Poster\". Deadline Hollywood. Archived from the original on November 25, 2018. Retrieved April 17, 2020. - ^ Rife, Katie (September 15, 2014). \"Dust Settles at SNL with New Cast Member and a \"Genuinely Happy\" Cecily Strong\". The A.V. Club. Archived from the original on October 30, 2016. Retrieved April 17, 2020. - ^ a b Rahman, Ray (September 29, 2014). \"Bill Hader Discusses SNL Newbie Pete Davidson, His Own Hosting Debut\". Entertainment Weekly. Archived from the original on May 2, 2019. Retrieved April 17, 2020. - ^ Robinson, Will (May 21, 2015). \"Pete Davidson Live Tweets His Harry Potter Marathon, Gives 'Dope as F---' Review\". Entertainment Weekly. Archived from the original on January 13, 2020. Retrieved April 17, 2020. - ^ Brathwaite, Les Fabian (March 30, 2015). \"The Rock Bares His Butt, 69s With SNL's Pete Davidson\". Logo TV. Archived from the original on June 1, 2016. - ^ Wright, Megh (July 13, 2015). \"Pete Davidson Looks Back on His Weekend Update Debut (and 69ing The Rock)\". Vulture. Archived from the original on May 18, 2016. Retrieved February 24, 2022. - ^ Thompson, Paul (March 16, 2015). \"Don't #Beliebe the Hype: Inside Justin Bieber's Roast\". Rolling Stone. Archived from the original on September 21, 2017. Retrieved September 8, 2017. - ^ \"Forbes 30 Under 30 2016\". Forbes. Archived from the original on April 24, 2017. Retrieved April 23, 2017. - ^ Steussy, Lauren (October 24, 2016). \"Pete Davidson's SMD Comedy Special Teaser: Staten Disses and More\". Staten Island Advance. Archived from the original on May 28, 2019. Retrieved May 28, 2019. - ^ Husband, Andrew (March 1, 2019). \"John Mulaney and Pete Davidson Are Becoming Quite the Comedy Duo\". Forbes. Archived from the original on May 22, 2019. Retrieved May 12, 2019. - ^ Andrews, Travis M. (May 27, 2019). \"Saturday Night Live Tackled Trump Every Week. But Pete Davidson Had the Most Memorable Season\". The Washington Post. Archived from the original on May 27, 2019. Retrieved May 28, 2019. - ^ Harvilla, Rob (February 25, 2020). \"The Big Yikes Energy of Pete Davidson's New Netflix Special\". The Ringer. Archived from the original on February 26, 2020. Retrieved February 26, 2020. - ^ Jackson, Vanessa (October 1, 2020). \"2020 People's Choice Awards: Complete List of Nominees\". E!. Archived from the original on September 4, 2019. Retrieved October 24, 2020. - ^ Rubin, Rebecca (April 15, 2021). \"Pete Davidson to Play Joey Ramone in Netflix Biopic 'I Slept With Joey Ramone'\". Variety. Archived from the original on April 15, 2021. Retrieved April 15, 2021. - ^ \"Pete Davidson in talks to star in 'The Suicide Squad'\". ANI News. September 4, 2019. Archived from the original on January 13, 2022. Retrieved January 13, 2022. - ^ Lang, Jamie (April 8, 2022). \"Netflix Acquires Animated 'Marmaduke' Feature For May Release\". Cartoon Brew. Archived from the original on November 27, 2022. Retrieved April 8, 2022. - ^ Andreeva, Nellie; White, Peter (May 20, 2022). \"'SNL': Kate McKinnon, Aidy Bryant & Kyle Mooney To Exit Alongside Pete Davidson As Major Cast Shake-Up Set For Season Finale\". Deadline. Archived from the original on May 20, 2022. Retrieved May 20, 2022. - ^ Flam, Charna; MacCary, Julia (March 15, 2023). \"Pete Davidson Series 'Bupkis' Premiere Date, First Look Photos Revealed (TV News Roundup)\". Variety. Archived from the original on March 24, 2023. Retrieved March 24, 2023. - ^ Bramesco, Charles (May 3, 2023). \"Bupkis review – Pete Davidson plays Pete Davidson in messy series\". The Guardian. Archived from the original on June 8, 2023. Retrieved June 8, 2023. - ^ Schneider, Matthew (March 21, 2024). \"Pete Davidson's Peacock Comedy Bupkis Will Not Return for a Season 2 Despite Renewal\". Variety. Retrieved March 21, 2024. - ^ Vecera, Mattea (January 27, 2026). \"Pete Davidson shares new podcast details on Fallon: 'I should have put more effort into it'\". silive. Retrieved January 28, 2026. - ^ \"Pete Davidson Jokes He's \"Lonely\" and Opens Up About Living With His Mom\". E!. April 19, 2019. Archived from the original on April 21, 2019. Retrieved February 24, 2022. - ^ \"Here's What Pete Davidson Nicknamed His Apartment in the Home He Shares with His Mom\". Architectural Digest. April 19, 2019. Archived from the original on April 21, 2019. Retrieved April 21, 2019. - ^ \"Pete Davidson Jokes He's 'Lonely' While Opening Up About Living with His Mom\". People. Archived from the original on April 21, 2019. Retrieved April 21, 2019. - ^ \"Pete Davidson Buys New $1.2 Million Condo in Staten Island\". Architectural Digest. April 6, 2021. Archived from the original on October 1, 2021. Retrieved October 1, 2021. - ^ Travis, Emlyn (February 10, 2022). \"King of Staten Island Pete Davidson Shares Why He's Officially Moving To Brooklyn\". Yahoo.com. Archived from the original on February 14, 2022. Retrieved February 21, 2022. - ^ Wilstein, Matt (June 12, 2021). \"Pete Davidson's Best Friend Ricky Velez Speaks Out: He 'Truly Hates' Attention\". The Daily Beast. Archived from the original on November 8, 2021. Retrieved November 8, 2021. - ^ Robinson, KiMi (January 31, 2025). \"Pete Davidson's 200 tattoos are 'almost gone' after years of lasering\". USA TODAY. - ^ Hearon, Sarah (December 15, 2017). \"SNL's Pete Davidson Posts Picture of Hillary Clinton Tattoo on Instagram\". Us Weekly. Archived from the original on December 17, 2017. Retrieved December 17, 2017. - ^ Hoglund, Andy (October 10, 2020). \"Saturday Night Live Recap: Bill Burr Hosts, with Replacement Musical Guest Jack White\". Entertainment Weekly. Archived from the original on December 24, 2020. Retrieved October 11, 2020. - ^ France, Lisa Respers (July 3, 2023). \"Pete Davidson jokes he and Colin Jost are in the 'hole' after buying ferry boat\". CNN. Archived from the original on July 13, 2023. Retrieved September 20, 2023. - ^ \"Colin Jost says he was 'actually stone-cold sober' when buying ferry with Pete Davidson\". USA TODAY. Archived from the original on July 26, 2023. Retrieved September 20, 2023. - ^ Tinoco, Armando (June 7, 2023). \"Pete Davidson Hopes Staten Island Ferry He Bought With Colin Jost \"Turns Into A Transformer\" So He \"Can Stop Paying For It\"\". Deadline Hollywood. Archived from the original on June 14, 2023. Retrieved September 20, 2023. - ^ Heinrichs, Audra (November 27, 2024). \"A Horror Movie Was Made on a Staten Island Ferry Owned by Pete Davidson & Colin Jost\". Jezebel. Retrieved March 6, 2025. - ^ Danko, Danny (September 30, 2016). \"Pete Davidson: 'I Wouldn't Be Able to Perform on SNL if I Couldn't Smoke Weed!'\". High Times. Archived from the original on October 1, 2016. Retrieved October 1, 2016. - ^ \"Episode 849 – Pete Davidson\". WTF with Marc Maron. September 25, 2017. Archived from the original on September 26, 2017. Retrieved September 26, 2017. - ^ Hautman, Nicholas (September 26, 2017). \"SNL's Pete Davidson Reveals Borderline Personality Disorder Diagnosis: 'I'm Depressed All the Time'\". Us Weekly. Archived from the original on September 26, 2017. Retrieved September 26, 2017. - ^ \"Pete Davidson, After His Split with Ariana Grande, Posted a Candid Instagram About Getting Bullied and Being Suicidal\". BuzzFeed News. December 3, 2018. Archived from the original on April 29, 2020. Retrieved December 4, 2018. - ^ Caron, Christina; Mays, Jeffery C. (December 15, 2018). \"Pete Davidson of 'Saturday Night Live' Is Accounted For After a Worrying Instagram Post\". The New York Times. Archived from the original on December 15, 2018. Retrieved December 16, 2018. - ^ \"SNL: Miley Cyrus Joined by Mark Ronson, Sean Lennon for 'Happy Xmas (War Is Over)'\". Variety. December 16, 2018. Archived from the original on December 16, 2018. Retrieved December 16, 2018. - ^ Perkins, Dennis (January 20, 2019). \"Pete Davidson Returns to SNL, Smuggling In Pal John Mulaney to Trash Clint Eastwood's The Mule\". The A.V. Club. Archived from the original on December 8, 2019. Retrieved May 9, 2020. - ^ \"SNL's Pete Davidson Confirms Split from Cazzie David: 'We're Not Together Anymore'\". Archived from the original on June 23, 2018. Retrieved June 23, 2018. - ^ Arnold, Amanda (June 12, 2018). \"It Looks Like Pete Davidson Covered Up His Tattoo of Cazzie David\". Archived from the original on June 23, 2018. Retrieved June 23, 2018. - ^ \"Cazzie David, Pete Davidson, And The Myth Of \"Winning\" Your Breakup\". June 15, 2018. Archived from the original on June 23, 2018. Retrieved June 23, 2018. - ^ Stone, Natalie (June 11, 2018). \"Everything to Know About Cazzie David, Larry David's Writer Daughter Who Dated Pete Davidson\". People. Archived from the original on December 22, 2020. Retrieved November 18, 2020. - ^ Mallenbaum, Carly. \"Pete Davidson confirms Ariana Grande engagement: 'I feel like I won a contest'\". USA Today. Gannett. Archived from the original on June 21, 2018. Retrieved June 21, 2018. - ^ \"Ariana Grande and Pete Davidson end engagement\". CNN. Archived from the original on October 15, 2018. Retrieved October 14, 2018. - ^ Goldstein, Joelle (October 24, 2018). \"Ariana Grande Says She's Healing Through Music After Pete Davidson Split\". Entertainment Weekly. Archived from the original on November 12, 2018. Retrieved November 11, 2018. - ^ Henderson, Cydney (October 17, 2018). \"Ariana Grande Finally Addresses Pete Davidson Breakup, Calls It 'Very Sad'\". USA Today. Archived from the original on November 12, 2018. Retrieved November 11, 2018. - ^ Nelson, Jeff (November 30, 2018). \"Ariana Grande Included Her Exes (and Apologized to Pete Davidson) in 'Thank U, Next' Music Video\". People. Archived from the original on December 16, 2018. Retrieved December 17, 2018. - ^ Hosie, Rachel (October 7, 2020). \"What is 'big dick energy' and how do you know if you have it?\". The Independent. Independent Digital News & Media Ltd. Retrieved December 14, 2024. - ^ Sporn, Natasha (April 26, 2019). \"Kate Beckinsale and Pete Davidson 'split after a few months of dating'\". Evening Standard. Archived from the original on April 26, 2022. Retrieved March 29, 2022. - ^ \"Pete Davidson jokes about Kate Beckinsale age difference on SNL\". The Independent. March 10, 2019. Archived from the original on December 11, 2020. Retrieved November 29, 2020. - ^ Bonner, Mehera (October 17, 2019). \"Pete Davidson and Margaret Qualley Just Broke Up\". Cosmopolitan. Archived from the original on March 8, 2021. Retrieved March 6, 2021. - ^ Sanchez, Chelsey; Mackelden, Amy (April 25, 2020). \"Are Pete Davidson and Kaia Gerber a Couple?\". Harper's Bazaar. Archived from the original on April 16, 2021. Retrieved April 24, 2021. - ^ Nardino, Meredith (August 16, 2021). \"Pete Davidson Splits From Bridgerton's Phoebe Dynevor After Whirlwind Romance: Distance 'Made It Hard'\". US Weekly. Archived from the original on August 20, 2021. Retrieved August 20, 2021. - ^ a b c d \"Kim Kardashian Reveals the Unexpected Reason She's Thankful for Pete Davidson\". E! Online. April 11, 2022. Archived from the original on April 12, 2022. Retrieved April 12, 2022. - ^ a b c Mizoguchi, Karen (April 11, 2022). \"Kim Kardashian Shares PDA Photos of Her and Pete Davidson from Date Night: 'Late Nite Snack'\". PEOPLE.com. Archived from the original on April 12, 2022. Retrieved April 12, 2022. - ^ \"Kanye West Disses \"Hillary Clinton's Ex-Boyfriend\" Pete Davidson\". Nylon. February 14, 2022. Archived from the original on April 6, 2022. Retrieved April 17, 2022. - ^ \"Kim Kardashian and Pete Davidson Break Up After 9 Months of Dating – E! Online\". www.eonline.com. August 5, 2022. Archived from the original on May 7, 2023. Retrieved August 5, 2022. - ^ \"Pete Davidson Met Chase Sui Wonders' Family as Source Says They're 'Seeing Where It Goes'\". People. Archived from the original on May 8, 2023. Retrieved May 8, 2023. - ^ Melendez, Miguel A. (August 24, 2023). \"Pete Davidson and Chase Sui Wonders Break Up After 9 Months of Dating\". Entertainment Tonight. Archived from the original on August 26, 2023. Retrieved August 26, 2023. - ^ Perkins, Njera (May 4, 2023). \"Pete Davidson Tells Chase Sui Wonders He's Going Back to Rehab in Exclusive \"Bupkis\" Clip\". POPSUGAR Entertainment. Archived from the original on September 17, 2023. Retrieved May 8, 2023. - ^ Moore, Julia (January 10, 2024). \"Pete Davidson Shows Glimpse of Private Jet-Setting Lifestyle with Girlfriend Madelyn Cline in New Netflix Special\". Entertainment > TV. People. ISSN 0093-7673. OCLC 794712888. Retrieved April 10, 2024. - ^ Moore, Julia; Rosner, Elizabeth (March 20, 2025). \"Pete Davidson Dating Model Elsie Hewitt, Make Out in Ocean in Miami\". People. Retrieved July 16, 2025. - ^ Hatcher, Kirsty (July 16, 2025). \"Pete Davidson Is Going to Be a Dad! Comedian Expecting His First Baby with Girlfriend Elsie Hewitt\". People. Retrieved July 16, 2025. - ^ Grant, Kayla; Jones, Sarah (December 18, 2025). \"Pete Davidson and Elsie Hewitt Welcome 'Perfect Angel Girl' Named After Pete's Late Dad\". People. Retrieved December 19, 2025. - ^ Gorman, Steve (March 15, 2022). \"Blue Origin to fly 'SNL' star Pete Davidson to space next week\". Reuters. Archived from the original on March 15, 2022. Retrieved March 15, 2022. - ^ Porter, Jon (March 18, 2022). \"Pete Davidson won't actually be going to space on the next Blue Origin flight\". The Verge. Archived from the original on March 18, 2022. Retrieved March 18, 2022. - ^ \"Pete Davidson Charged With Reckless Driving After Allegedly Crashing Car Into A House Earlier This Year\". Archived from the original on June 16, 2023. Retrieved June 16, 2023. - ^ Dazio, Stefanie (June 16, 2023). \"Comedian Pete Davidson charged with reckless driving after Beverly Hills crash\". AP NEWS. Archived from the original on June 17, 2023. Retrieved June 17, 2023. - ^ Tapp, Tom (July 24, 2023). \"Pete Davidson Agrees To Enter Diversion Program To Address Reckless Driving Charge, Says L.A. DA\". Deadline Hollywood. Archived from the original on August 26, 2023. Retrieved August 26, 2023. - ^ Heil, Emily (March 12, 2019). \"Pete Davidson made a joke on SNL about the Catholic Church. Now officials are demanding an apology\". The Washington Post. Archived from the original on March 15, 2019. Retrieved March 17, 2019. - ^ Henderson, Cydney (March 13, 2019). \"Catholic diocese demands apology from 'SNL' after Pete Davidson compares church to R. Kelly\". USA Today. Archived from the original on March 14, 2019. Retrieved March 17, 2019. - ^ Yakas, Ben (March 11, 2019). \"Brooklyn Diocese Demands 'Immediate Public Apology' From SNL Over Pete Davidson's R. Kelly/Church Joke\". Gothamist. Archived from the original on November 23, 2021. Retrieved November 23, 2021. - ^ Leeman, Zachary (March 12, 2019). \"Catholic Church's Brooklyn Diocese Calls Pete Davidson's Anti-Faith Joke 'Disgraceful'\". LifeZette. Archived from the original on April 3, 2019. Retrieved March 17, 2019. - ^ Concha, Joe (November 4, 2018). \"SNL's Pete Davidson ripped for mocking GOP candidate who lost eye in combat\". The Hill. Archived from the original on November 4, 2018. Retrieved November 4, 2018. - ^ Fink, Jenni (November 4, 2018). \"'Hitman In A Porno Movie': SNL's Pete Davidson Mocks Veteran Dan Crenshaw Who Lost His Eye In Afghanistan\". Newsweek. Archived from the original on November 4, 2018. Retrieved November 4, 2018. - ^ Burkitt, Bree (November 4, 2018). \"Meghan McCain calls out 'Saturday Night Live' for 'tone-deaf' joke about veteran\". Arizona Republic. Archived from the original on June 16, 2020. Retrieved November 6, 2018. - ^ \"'Their Apology Won't Mean Anything to Me.' GOP CandidateResponds to Pete Davidson Making Fun of His Eyepatch\". Time. Archived from the original on November 6, 2018. Retrieved November 6, 2018. - ^ Robinson, Joanna (November 6, 2018). \"S.N.L. Is Still Grappling with Fallout from Latest Pete Davidson Controversy\". Vanity Fair. Archived from the original on November 22, 2018. Retrieved March 17, 2019. - ^ Itzkoff, Dave (November 11, 2018). \"'S.N.L.': Dan Crenshaw Accepts Pete Davidson's Apology and Delivers Some Zingers\". The New York Times. Archived from the original on November 19, 2018. Retrieved November 19, 2018. - ^ \"Saudi Arabia: Riyadh Comedy Festival Whitewashes Abuses\". Human Rights Watch. September 23, 2025. Retrieved September 25, 2025. - ^ \"Major U.S. comedians set to perform in Saudi Arabia urged not to help cover up \"abuses of a repressive regime\"\". CBS News. September 16, 2025. Retrieved September 25, 2025. - ^ \"9/11 probe clears Saudi Arabia\". BBC News. June 17, 2004. Archived from the original on March 11, 2006. Retrieved April 14, 2010. - ^ Thomas, Cal. \"The Saudis channel the mafia: Fears of Saudi retaliation deter truth about 9/11\". The Washington Times. Archived from the original on April 28, 2016. Retrieved April 28, 2016. - ^ Vargas, Karen Silva; Katryniok, Benjamin; Araque, Marcia (2021). \"Isobaric VaporLiquid Equilibrium Data for Six Binary Systems: Prop-2-en-1-ol (1)Hexan-2-ol (2), Prop-2-en-1-ol (1)Hexan-2-one (2), Hexan-2-one (1)Hexan-2-ol (2) Prop-2-en-1-ol (1)4-Methyl-pentan-2-ol (2), Prop-2-en-1-ol (1)4-Methyl-pentan-2-one (2), and 4Methyl-pentan-2-one (1)4Methyl-pentan-2-ol (2) at 101.32 kPa\". Journal of Chemical & Engineering Data. 66 (2): 1055–1067. doi:10.1021/acs.jced.0c00861. Retrieved September 26, 2025. - ^ \"Major U.S. comedians set to perform in Saudi Arabia urged not to hel"
}