{
  "url": "https://terra.nasa.gov/",
  "title": "Terra | The EOS Flagship",
  "text": "As most data users are aware, the Terra satellite has recently been experiencing power-based limitations caused by orbital changes and solar array efficiency. In order to maintain power margins, the Terra team moved the MOPITT instrument from science mode into safe mode on February 4th, 2025, ceasing data collection. On April 9th, 2025, the Terra project determined that additional power was needed for the platform and MOPITT was moved from survival mode and fully turned-off. More information is available in a recently-released Terra blog post and on the Canadian Space Agency MOPITT website. ASTER VNIR, one of the CERES instruments, MISR, and MODIS instruments are all still producing science, and the team is currently working to restore ASTER TIR science data (see below). UPDATE ON ASTER VNIR/TIR: After investigation and monitoring of platform battery status, the Terra Flight Operations Team (FOT) determined thatthere was sufficient power to resume imaging with ASTER’s VNIR instrument. The FOT will continue to monitor the power usage, but as a result, ASTER once again began collecting VNIR data on January 17, 2025. The team is currently working to restart ASTER TIR data collection, and updates will be posted here. To view recent imagery, visit this linked Land Processes Distributed Active Archive Center webpage. Terra: The EOS Flagship Terra explores the connections between Earth’s atmosphere, land, snow and ice, ocean, and energy balance to understand Earth’s climate and to map the impact of human activity and natural disasters on communities and ecosystems Connecting Earth’s Systems with Terra’s Observations Examples of each instrument’s capabilities (clockwise): land composition (ASTER), reflected energy (CERES), aerosols (MISR), vegetation snow and ice (MODIS), carbon monoxide (MOPITT) Important Terra Updates and Information Terra mission updates related to platform power supply, instrument status, and other related information will be issued and posted as banners at the top of this page. For an archive of all previously-issued banners, please visit the Instrument Updates (Archive) page, linked here. Terra data users have expressed the need for weekly updates on Terra’s equator crossing time (in Mean Local Time), as well as orbital altitude. Starting this month, we’ll be adding this information to the Terra homepage and updating it weekly using data provided by the Operations Team. Move your cursor over the chart below to view both Terra’s Mean Local Equator Crossing Time in UTC and orbital altitude for each month through 2026. Update on Terra’s New Orbit: Since 2020, Terra has been drifting to an earlier equator crossing time, and in October 2022 was lowered by ~5km in altitude. These changes in orbit did not reduce the data quality of Terra products, and only created minor changes to orbital repeat time and swath width (for some instruments). See Terra’s New Orbit for more information. (Updated December 2025) Click the links below to catch up on all the latest Terra news and updates! It’s hard to believe, but it’s been one year since we celebrated Terra’s 25th Anniversary! (In case you missed it, you can get all the highlights on the Terra website). Today, we celebrate Terra for making yet another trip around the sun (and thousands around the Earth, too!) Happy 26 years (and counting!) to Terra … In honor of Terra’s recent 25th birthday, we decided to host a Terra Animation Celebration during this year’s 2025 Space Apps Challenge…. and we’re inviting YOU to join us! Check out the following animated 😅 video for more information about NASA’s 2025 Space Apps Challenge event! Do you have some spare time this weekend (October … Registration is now open for this year’s NASA International Space Apps Challenge hackathon, to be held on October 4-5. This year, NASA is inviting innovators of all ages to Learn, Launch, Lead alongside a vibrant community of scientists, technologists, and storytellers at more than 450 Local Events worldwide. Over the course of two days, teams will develop projects … After more than 20 years orbiting at 705 km above Earth’s surface and routinely crossing the equator at approximately the same time every day, Terra is now drifting. With no maneuvers planned to sustain Terra’s altitude and crossing time, Terra will slowly get closer and closer to Earth – crossing the equator earlier and earlier as time passes. However, despite impacts to some of Terra’s nearly 100 data products, Terra’s five sensors continue to collect meaningful scientific data, producing one of the longest continuous climate data records collected by a satellite. Read more… There is no question that technology has changed. But, at the same time that our lives on Earth were being shaped by our access to technology, 705 kilometers above us, a satellite was changing how we understood our planet. For 20 years, Terra, the flagship Earth observing satellite, has chronicled changes on Earth. Designed and built in the 1980s and 90s, NASA and Lockheed Martin engineers set out to build a satellite that could take simultaneous measurements of Earth’s atmosphere, land, and water. Its mission – to understand how Earth is changing and to identify the consequences for life on Earth. Season after season, Terra data continues to help us understand how the evolving systems of our planet affect our lives – and how we can use that data to benefit society. Read more and find resources from our anniversary events, Terra 20 Events Update on Terra’s New Orbit: Since 2020, Terra has been drifting to an earlier equator crossing time, and in October 2022 was lowered by ~5km in altitude. These changes in orbit did not reduce the data quality of Terra products, and only created minor changes to orbital repeat time and swath width (for some instruments). See Terra’s New Orbit for more information."
}