{
  "url": "https://en.wikipedia.org/wiki/Galletas_Gullón",
  "title": "Galletas Gullón - Wikipedia",
  "text": "Galletas Gullón Galletas Gullón (English: Gullón Biscuits) is a Spanish food sector company dedicated to the manufacture of crackers and biscuits. Founded in 1892, in Aguilar de Campoo in the province of Palencia surrounded by wheat fields, Gullón has been the leading producer of biscuits in Spain. In 2009, it had an annual production of 102 million kg and a turnover of 163 million euros[2] and in 2014 with a turnover of 286.6 million euros.[3] Gullón had a turnover of 630 million euros in 2023.[4] Gullón has two production factories; in Aguilar de Campoo, the second Gullón II, located next to the Cantabria-Meseta motorway and opened in 2003, covers an area of 100,000 m2, and is the largest biscuit factory in Europe.[1] Gullon’s CEO and Managing Director since 1983 has been María Teresa Rodríguez Sainz-Rozas, who defends the profit reinvestment policy and allocates almost 2% of turnover to R&D intensity projects.[3] Most of Gullón’s employees are from Aguilar de Campoo and other nearby towns such as Cervera, Herrera or Guardo, in Palencia; or Reinosa and Santander.[3] Gullon is represented in the United States by Florida-based Jurakan International Corporation.[3] In 2021, the company experienced growth of more than 10 million euros, 2.5% more than the previous year, reaching a turnover of 419 million euros.[5][6] In 2022, the company celebrated the 130th anniversary of its foundation.[7] References [edit]- ^ a b RTVE «Gullón se enzarza en la guerra de las galletas» (in Spanish) Retrieved September 29, 2010. - ^ Carrión Digital «Félix Gullón Rodríguez, director general de Galletas Gullón Archived 2012-03-11 at the Wayback Machine» (in Spanish) Retrieved August 30, 2010 - ^ a b c d Gullón GULLÓN OPENS ITS NEW INDUSTRIAL PLANT VIDA 2015, accessed 20 July 2018 - ^ \"Galletas Gullón, imparable: crece un 18% en 2023 y alcanza los 630 millones de facturación\". El Economista. 2024-01-11. Retrieved 2024-08-23. - ^ \"Galletas Gullón factura 419 millones de euros en 2021\". Financial Food (in Spanish). 2022-02-03. Retrieved 2022-04-28. - ^ \"\"Gullón crecerá este año por encima del 2,5% logrado en 2021\"\". EXPANSION (in Spanish). 2022-02-03. Retrieved 2022-04-28. - ^ \"Galletas Gullón cumple 130 años apostando por reinvertir sus beneficios e innovar\". www.efe.com (in Spanish). Archived from the original on 2022-01-12. Retrieved 2022-04-28. External links [edit]- Official page (in English) - Gullon Distributor In the USA (in English)"
}