{
  "url": "https://sudachirecipes.com/homemade-ikura/",
  "title": "Homemade Ikura Caviar (Japanese Soy Cured Salmon Roe) | Sudachi",
  "text": "Did you know that making authentic ikura is not that hard as long as you can get salmon roe? I got this salmon roe online and created home-marinated ikura by washing. Cleaning. Then marinating. And voila! Curious about the exact steps? Keep reading to find out! What is Ikura? Salmon roe is a tasty delicacy with a vibrant orange hue and a burst of flavor. In Japan, it’s called “ikura (いくら),” and it has an intriguing history and preparation process that makes it special. Ikura is the Japanese term for individual salmon eggs that have been carefully separated from their membrane, but these days, it often describes salmon roe marinated in soy sauce too. The word “ikura” has an interesting origin – it’s derived from the Russian word “ikra,” meaning fish roe. This linguistic connection reveals the cultural exchange between Japan and Russia, particularly in Hokkaido, Japan’s northernmost island. Legend has it that Japanese traders, upon hearing Russians refer to salmon roe as “ikra,” adopted the term, believing it to be the specific name for the delicacy. The Russian influence on ikura goes beyond just its name. During the Taisho period (1912-1926), Japanese producers started trying out Russian methods of salt-preserving salmon roe. This cross-pollination of cuisines laid the foundation for the ikura we know and love today. These days, soy sauce-marinated ikura is the mainstream in Japan. It’s become a must-have ingredient in high-end sushi and a luxurious topping for seafood rice bowls. How I Developed This Recipe I had no idea it was so easy to make soy-marinated ikura at home! In Japan today, real salmon roe is a luxury item that costs a lot. Even fast-food sushi places often use artificial look-alikes or cheaper alternatives like trout roe. But guess what? I decided to give it a shot in my own kitchen, and it turned out amazing! If you can get your hands on some salmon roe, I highly recommend trying this recipe. It’s a great way to create a special dish without spending a fortune. Plus, there’s nothing better than the satisfaction of making a luxury dish with your own two hands. Key Ingredients & Substitution Ideas - Salmon roe (sujiko): These are salmon eggs still connected by the membrane, while ikura refers to the individual eggs. - Sake: I always use drinking-grade sake for the best flavor. It’s worth the investment, as cooking sake often contains added salt. Choose an inexpensive but drinkable variety for a clean taste that enhances the other ingredients. - Dashi stock: Opt for homemade or dashi packets. For a quick weeknight meal, I always keep dashi packets on hand. - Mirin: Use “Hon Mirin” if possible. For more details on hon mirin, check out my in-depth mirin guide. - Light soy sauce: I prefer light soy sauce here, but dark soy sauce works too. Light soy sauce allows the salmon roe’s natural taste and color to shine through. - Kombu: A small piece of this dried kelp adds incredible depth. Since we’re using dashi, you can omit it if you like. Visual Walkthrough & Tips Here are my step-by-step instructions for how to make Soy-Marinated Salmon Roe at home. For ingredient quantities and simplified instructions, scroll down for the Printable Recipe Card below. This section aims to provide a comprehensive overview of the cooking steps and techniques with visuals. It also includes more in-depth tips and tricks and explains why I do what I do. Gently break apart the sack of salmon roe (sujiko) by hand while it’s still connected to the membrane. At this point, it is not necessary to completely separate all of them. Heat water and salt in a pot to 70℃ (160°F). You’ll know it’s ready when you see small bubbles forming at the bottom of the pot. Place the sujiko in a heatproof bowl and pour the salted water over it. Use chopsticks to stir gently, loosening the roe. Remove the membrane as you go, continuing until most of the membrane is gone and the salmon roe separates into individual eggs. For stubborn grains stuck to the membrane, gently pinch the roe between your thumb and forefinger to push them out. Once all the membrane is removed, pour off the water. Add cold water and gently stir by hand to remove any remaining debris or thin skin. Pour out the water and repeat this rinsing process until the eggs are thoroughly clean. Transfer the cleaned eggs to a colander to drain. Place the colander over a bowl and sprinkle salt over the eggs, shaking to distribute evenly. Cover the top with plastic wrap and refrigerate for 1 hour. Don’t worry if the eggs appear white at this point; this is due to the proteins and oils on the surface reacting with the warm water and denaturing, and not because the inside has been cooked. They will turn beautifully red after this salting process. The salt helps to firm up the roe and enhance its flavor. While waiting, prepare the marinade. In a saucepan, combine sake and mirin. Bring to a boil over medium heat for 30 seconds to release the alcohol. Transfer the mixture to a sealable container and add light soy sauce, dashi, and kombu. Let it cool completely. After one hour, remove the salmon roe from the refrigerator. Add it to the container with the cooled marinade, ensuring the roe is completely submerged. Seal the container and marinate in the refrigerator for one day. After one day, the marinated ikura is ready to use. Jump to Full Recipe MeasurementsHow to Store If you have leftover homemade soy-marinated ikura, place the entire batch in an airtight container and refrigerate for 3 to 4 days. For extended preservation, freeze the roe in small portions. This method allows you to keep it for up to a month. To use frozen roe: - Transfer the desired portion to the refrigerator. - Allow it to thaw naturally for about 12 hours. More Japanese Seafood Recipes Homemade Ikura (Marinated Salmon Roe) Ingredients - 1 sack salmon roe (sujiko) - 1000 ml water - 1 tsp salt to wash - ½ tsp salt to enhance color Marinade - 60 ml sake - 45 ml dashi stock - 30 ml mirin - 30 ml Japanese light soy sauce (usukuchi shoyu) - 3 g dried kelp (kombu) My recommended brands of ingredients and seasonings can be found in my Japanese pantry guide. Can’t find certain Japanese ingredients? See my substitution guide here. Instructions - Open 1 sack salmon roe by hand (do not use a knife) and place it in a large heatproof bowl. Gently massage to help loosen the roe, and remove what you can from the membrane. (Don't worry about removing all of them at this point.) - Pour 1000 ml water into a pot and add 1 tsp salt. Mix and heat until it reaches 70 °C (158 °F). - Pour the hot water over the salmon roe and separate the roe from the membrane using chopsticks, removing the membrane as you go. - Once you've removed all of the membrane and separated all of the roe, pour the contents of the bowl through a sieve to drain. Fill the bowl with cold water and gently wash the roe to remove any leftover debris. Drain and repeat until clean. - Drain once more and set the sieve of roe over an empty bowl. Sprinkle with ½ tsp salt and shake to evenly distribute it through the roe. Cover with plastic wrap and store in the refrigerator for 1 hour. - While you wait, make the marinade. Add 60 ml sake and 30 ml mirin to a saucepan and boil for 30 seconds to release the alcohol. - Pour the sake and mirin mixture into a container and add 45 ml dashi stock, 30 ml Japanese light soy sauce (usukuchi shoyu) and 3 g dried kelp (kombu). Cool completely before adding the roe. - Transfer the roe to the marinade, make sure they are all submerged. Cover with a lid and marinate for 24 hours in the refrigerator. - Enjoy with sushi or donburi!"
}