{
  "url": "https://en.wikipedia.org/wiki/Madam",
  "title": "Madam - Wikipedia",
  "text": "Madam Madam (/ˈmædəm/), or madame (/ˈmædəm/ or /məˈdɑːm/),[1] is a polite or impolite form of address for women in the English language, often contracted to ma'am[2] (pronounced /ˈmæm/ in American English[2] and this way but also /ˈmɑːm/ in British English[3]). The term derives from the French madame, from \"ma dame\" meaning \"my lady\". In French, the abbreviation is \"Mme\" or \"Mme\" and the plural is mesdames (abbreviated \"Mmes\" or \"Mmes\"). These terms ultimately derive from the Latin domina, meaning \"mistress\".[4] Use as a form of address [edit]Formal protocol [edit]After addressing her as \"Your Majesty\" once, it is correct to address the Queen of the United Kingdom as \"Ma'am\" with the British short pronunciation (rhyming with \"jam\") for the remainder of a conversation.[5] A letter to the Queen may begin with Madam or May it please Your Majesty.[6][7] Other female members of the British royal family are usually addressed in conversation first as Your Royal Highness and subsequently as Ma'am.[7] Madam President or Madame President is a formal form of address for female presidents and vice presidents of republics.[8][9][10][11] Madam Secretary is a formal form of address for a female member of the United States Cabinet;[12][13] a female Attorney General of the United States is formally addressed Madam Attorney General.[14][15] Madam Speaker is a correct form of address for a female speaker of the United States House of Representatives (e.g. Nancy Pelosi),[16] British House of Commons (e.g. Betty Boothroyd),[17] Canadian House of Commons,[10] or Canadian Senate.[10] In the United States, between the early 19th century and 1980, justices of the Supreme Court were formally called Mr. Justice (surname). In 1980, the title was dropped in \"to avoid the awkward appellation 'Madam Justice'\" in anticipation of a woman joining the court.[18] Plaques on chamber doorways reading \"Mr. Justice\" were removed after Sandra Day O'Connor joined the court in 1981.[19] Female members of state supreme courts were previously sometimes styled as Madam Justice, matching the Mr. Justice formally used. Justice Rosemary Barkett of the Florida Supreme Court disliked the title, since she was unmarried, and announced that she would simply be called Justice Barkett, leading all the male justices to drop Mr. from their forms of address.[20] In Canada, the appellation Mr./Madam Prime Minister and Mr./Madam Minister is \"often heard informally\" for prime ministers and other ministers[10] but that is incorrect and Mr./Madam are not used in addressing a prime minister or other minister. Instead, they are addressed simply as \"Prime Minister\" or \"Minister\", as applicable. Madam is an appropriate title in conversation with a female Governor General of Canada or female spouse of a Governor General on second and subsequent reference (after \"Your Excellency\" or \"Excellency\" is used on initial reference).[10] Female members of the Supreme Court are addressed by counsel in hearings as either Madam Justice or Justice; in writing, a female justice is addressed as The Honourable Madame (Chief) Justice.[21] The same style is used for other female members of the Canadian federal courts.[10] In the courts of England and Wales, a magistrate is addressed as \"Your Worship\" or \"Sir\" (if male) or 'Madam' (if female).[22] A female judge of the District Court may be addressed in writing as Dear Judge or Dear Madam, while a female judge of the High Court may be addressed as Dear Madam or Dear Dame (first name) or Dear Judge.[22] While in court, however, District Court judges are addressed as Judge (or according to title), and female High Court judges are addressed as My Lady or Mrs/Ms Justice (last name).[22] In diplomacy, either Madam Ambassador and Ambassador (lastname) is an appropriate formal mode of address for a female ambassador.[10][11] In some countries, the wife of an ambassador also may be referred to as Madam Ambassador.[11][23] This is the case in French-speaking countries,[11] but not among U.S. diplomats or the foreign diplomatic corps in Washington.[23] In countries where the wives of ambassadors may also be titled Madam Ambassador, the Foreign Service Institute advises U.S. diplomats to \"refer to a female ambassador by her last name (Ambassador Jones) to avoid confusion and ensure that she receives her due respect.\"[11] Madam High Commissioner is an appropriate formal mode of spoken address for a female high commissioner.[10] The title Madam may also be used to address female chargés d'affaires although titles \"Mrs.\" or \"Ms.\" may be used instead.[11] Other settings [edit]Outside the settings of formal protocol, the term ma'am may be used to address a woman with whom one is not familiar.[24][25] The term is \"meant to convey respect and graciousness lightly salted with deference.\"[25] For example, waiters, store clerks, or police officers may use the term.[25] Unlike miss, the term ma'am tends to be used for older women, which is one reason some dislike the term.[24][25] Others dislike the term for other reasons, such as the distance it created between the speaker and the person addressed; the \"whiff of class distinctions\" implied; and \"dismissive, stiff and drab\" associations.[25] Others, such as etiquette authority Judith Martin, defend the term as dignified.[25] Martin writes that Madam (or Ma'am) and Sir are \"all-purpose titles for direct address, as a foolproof way of conveying the respect due to people whose names escape you.\"[26] There are regional differences in use; in the United States, ma'am is more commonly heard in the South and Midwest and less common on the East and West Coasts.[25] Military and police usage [edit]\"Ma'am\" is commonly used as a verbal address for female officers of inspector and higher ranks in British police forces.[27] The word is also used by junior personnel to address female superiors in the British Armed Forces.[28] The use of sir and ma'am as forms of address for superiors are common in the United States armed forces.[29] U.S. Army and U.S. Air Force regulations state that ma'am is an appropriate greeting for junior personnel when rendering a hand salute to a female superior.[30][31] The use of formal modes of address such as sir or ma'am, ingrained in military culture, is distinct from the American corporate or civilian setting, where most co-workers refer to each other by first name and use of formal titles is considered awkward.[32] A 2017 U.S. Army Human Resources Command publication noted that in the Northern United States, \"it is common to hear young to middle-aged women say, 'Don't call me ma'am,' as it is seen as a title reserved for older women.\"[32] In the Canadian Forces, \"ma'am\" is a proper response when coming to attention to a female officer or chief warrant officer calling the roll.[33] Use in non-native English-speaking societies [edit]The title Madame is commonly used in English for French-speaking women, e.g. \"President and Madame De Gaulle.\" The terms Madame Mao and Madame Chiang Kai-shek were frequently used in English to refer to Jiang Qing (the wife of Mao Zedong) and Soong Mei-ling (the wife of Chiang Kai-shek), respectively; Madame approximated the Chinese respectful forms of address.[34][35][36] References [edit]- ^ \"Madame — Meaning & Definition for UK English\". Lexico — Powered by Oxford. Archived from the original on October 19, 2021. Retrieved 2 December 2021. - ^ a b \"Ma'am Definition & Meaning\". Dictionary by Merriam-Webster. Retrieved 2 December 2021. - ^ \"Ma'am — Meaning & Definition for UK English\". Lexico — Powered by Oxford. Archived from the original on October 29, 2020. Retrieved 2 December 2021. - ^ \"Madame - Dictionnaire de l'Académie française, 9e édition\". Dictionnaire de l’Académie Française. Retrieved 2 December 2021. - ^ \"Greeting The King and Queen\". The Official Website of the Royal Family. Retrieved 28 March 2024. - ^ \"Addressing Royalty\". Debrett's. February 19, 2021. Archived from the original on 2020-10-19. - ^ a b \"Greeting a Member of The Royal Family\". The Royal Household. Retrieved February 19, 2021. - ^ Helen Cooper, Madame President: The Extraordinary Journey of Ellen Johnson Sirleaf (Simon & Schuster, 2017). - ^ Protocol Reference, Office of the Chief of Protocol, United States Department of State. - ^ a b c d e f g h Styles of address, Canadian Heritage (last accessed February 19, 2021). - ^ a b c d e f Protocol for the Modern Diplomat, U.S. Department of State Foreign Service Institute, pp. 2-5 (last reviewed July 2013). - ^ DeLysa Burnier, Frances Perkins' Disappearance from American Public Administration: A Genealogy of Marginalization, Administrative Theory & Praxis, Vol. 30, Issue 4 (2008), pp. 398-423. - ^ Madeleine Albright, Madam Secretary: A Memoir (Macmillan: 2012). - ^ Briefing by the Vice President and Attorney General Janet Reno, American Presidency Project, UC Santa Barbara (March 1, 1994). - ^ U.S. Department of Justice: Office of the Inspector General: Semiannual Report to Congress, October 1, 1999 - March 31, 2000. - ^ Marc Sandalow, Madam Speaker: Nancy Pelosi's Life, Times, and Rise to Power (Rodale Books, 2008). - ^ Paul Routledge, Madam[dead link] Speaker: The Life of Betty Boothroyd (HarperCollins: 1995). - ^ Linda Greenhouse, Court Dropping Mr. Justice, New York Times (November 19, 1980). - ^ Evan Thomas. Behind the Scenes of Sandra Day O'Connor's First Days on the Supreme Court, Smithsonian Magazine (March 2019). - ^ Justice Rosemary Barkett, Florida Supreme Court (last accessed February 19, 2021). - ^ Frequently Asked Questions (FAQ), Supreme Court of Canada (last accessed February 19, 2021). - ^ a b c Forms of Address: Law, Debrett's (last accessed February 19, 2021). - ^ a b Judith Martin, Nicholas Martin & Jacobina Martin, Miss Manners: Flowery courtesy titles are not really needed, Washington Post (March 20, 2016). - ^ a b Laura Boyd, Please Call Me Miss, Not Ma'am, New York Times (September 26, 2013). - ^ a b c d e f g Natalie Angier, The Politics of Polite, New York Times (August 28, 2010). - ^ Judith Martin, 'Yo' and Other Respectful Titles, Washington Post (February 6, 2000). - ^ Forms of Address: The Police: Debrett's. - ^ Forms of Address: The Armed Forces, Debrett's - ^ Alison Stewart, What's In A Title, Ma'am?, NPR, Weekend Edition Saturday (June 20, 2009). - ^ Personnel—General Salutes, Honors, and Courtesy: 2–1, Army Regulation 600–25. - ^ Personnel—General Customs and Courtesies: 8.1.2, Air Force Instruction 34-1201 (August 18, 2020_. - ^ a b Jenny Hale, Translating Military Culture to the Civilian Workplace, U.S. Army Human Resources Command (June 14, 2017). - ^ \"Chapter 2: Squad drill at the halt without arms\". Drill and Ceremonial Manual. Canadian Armed Forces. August 23, 2018. - ^ Ross Terrill, Madame Mao: The White Boned Demon (Stanford University Press: 1999). - ^ Thomas A. DeLong, Madame Chiang Kai-shek and Miss Emma Mills: China's First Lady and Her American Friend (McFarland: 2007). - ^ Laura Tyson Li, Madame Chiang Kai-Shek: China's Eternal First Lady (Grove Press: 2007)."
}