{
  "url": "https://support.google.com/mail/answer/8395?hl=en&co=GENIE.Platform=Desktop",
  "title": "Create a Gmail signature - Computer - Gmail Help",
  "text": "An email signature is text, like your contact information or a favorite quote, that’s automatically added at the end of Gmail messages as a footer. Add or change a signature You can put up to 10,000 characters in your signature. - Open Gmail. - At the top right, click Settings See all settings. - In the \"Signature\" section, add your signature text in the box. If you want, you can format your message by adding an image or changing the text style. - Tip: Your image also counts toward the character limit. If you get an error, try to resize the image. - At the bottom of the page, click Save Changes. Manage multiple signatures You can use different signatures for your emails. For example, you can set a signature default for new emails you compose or reply to. You can also choose a different signature with each email you send. - Open Gmail. - At the top right, click Settings See all settings. - Under \"General,\" scroll to \"Signature\" and click the signature you want to edit. - Use the text box to make your changes. - To change the signature name, click Edit . - At the bottom, click Save Changes. Tip: You can also choose a signature default for new emails and emails that you reply to. - Open Gmail. - At the top right, click Settings See all settings. - Under \"General,\" scroll to \"Signature.\" - Click the signature you want to remove. - Click Delete Delete. - At the bottom, click Save Changes. Add a signature if you're using the \"Send mail as\" feature If you use the \"Send mail as\" feature to send from different addresses in your account, you can add a different signature for each address. To select an address, use the drop-down menu above the signature text box on the Settings page. If you don’t see the drop-down menu: - Open the Accounts and Import settings page. - Check that your addresses are listed in the \"Send mail as\" section. Troubleshoot issues If you have problems with images in a Gmail signature, learn how to troubleshoot issues with Gmail signatures."
}