{
  "url": "https://www.buck.co/work/mirinda",
  "title": "Mirinda | BUCK",
  "text": "Mirinda 2023 Mirinda, the fruit-flavored soft drink from Pepsi, needed a makeover — something bright, something fresh, and something playful to appeal to Gen Z. We worked with PepsiCo Design and Innovation alongside Bulletproof agency to create a new visual identity for the drink, as well as 3,000 key visual assets to help them market Mirinda to their large (and growing) global audience. The Mirinda team wanted us to evolve and elevate their existing brand identity to match their new product and feel. But with that design system they needed a large, flexible library of assets and a modular toolkit that their internal teams could use to market Mirinda in every corner of the world. Visual Refresh The logo’s signature green color got brighter with sharper corners and cleaner lines. An attention-grabbing “M” is front and center on the can and serves as a canvas for the brand’s creativity. All 50 flavors (or flavours as they say across the pond) received their own separate color palette with contrasting colorways. These are paired with zesty fruit illustrations that represent the flavors through a range of distinct, swirling spherical forms. This design system unites the brand’s 50 flavors for the first time with a flexible and adaptable system. This new, punchy, and bright identity coupled with an up-to-date tagline (“There’s no flavour like your flavour”) are positioned to the Gen Z market and to the “vibrancy of a generation of young creatives” — made for those who aren’t afraid to stand out. In the end, we delivered a design system, an asset library, thousands of key visuals, a brand guideline, and films for 9 of their key markets. How do you like your Mirinda? BUCK Executive Creative Director Vincent Lammers Executive Producer Chance Woodward Creative Direction Richard Gray Art Director Simon Buijs Producer Katie Liston Bárbara Scatolini Production Coordinator Benedicte Gold-Dalg Jennifer Blackwell Head of 3D / 3D Supervisor Joao Rema Art Director Fabrizio Lenci Estefan Richter Animation Director Daniel Rodrigues Lead 3D Artist Ty Coyle 2D Animation Lead Jardeson Rocha Marco van der Vlag Design Yana Abramova Anna Moessnang Mijke Coebergh Bernd Bousard Juan Behrens Lea Zhang Bianca Beneduci Adolfo Correa Technical Director Jeroen Hoolmans Ben Rohel Jose Fuentes Post Production Supervisor Jose Fuentes Look Development Shane O'Hara Compositing Floris van der Lee 3D Animation Katherine Guggenberger Ida Zhu Solomon Asmah 3D Artists Beatrice Viguier Charlotte Vallet Manon Sailly Alex Lopez Sonal Jadhav Kat Smith 2D Animation Greta Sennekamp Andres Cuevas Albert Oriol Marco van der Vlag Laurentiu Lunic Tomasz Czajka Creative Technologist Ben Rohel Editor Paal Rui Dave Conte Assistant Editor Robert Bailey Production Assistant Jennifer Blackwell Live Action Line Producer Kasper Hering Director of Photography Floris van der Lee Production Company Northwest Productions Sound Music Studio Antfood Color Color Studio Captcha Colorist Barry Clarke"
}