{
  "url": "https://www.stabroeknews.com/news/guyana/",
  "title": "Guyana News - Stabroek News",
  "text": "A truck rolled backwards on the approach to the new Bharrat Jagdeo Demerara River Bridge earlier today and was stuck for some time on the structure, causing a severe buildup of traffic on the western approach to the bridge. WIN MP and former GuySuCo executive Vishnu Panday yesterday flayed the government over its management of the sugar industry triggering loud and sustained heckling and a push back later from Minister of Agriculture Zulfikar Mustapha. Panama is to open an embassy here, according to a release yesterday from the Office of the President. The release said that President Irfaan Ali and Panamanian President José Raúl Mulino held a constructive meeting focused on deepening bilateral ties. Guyana and Belize signed a series of Memoranda of Understanding (MoUs) during President Irfaan Ali’s three-day State visit to that country which concluded yesterday and they span defence, education, tourism, digital transformation, and investment. Several persons have been arrested and are in police custody following the murder of Rupununi tour guide, Leon Baird. Regional Division #9 Commander, Superintendent Mohamed Ally, told Stabroek News yesterday that the investigation is active. Odelle Garnette called ‘Crab’ was yesterday committed to stand trial at the High Court for the murder of seven-year-old Jeremiah Gustave when he appeared at the Georgetown Magistrate’s Court before Magistrate Fabayo Azore. (Trinidad Guardian) Five Caribbean leaders in science, civic work, entrepreneurship and the arts have been named as the 2026 recipients of the Anthony N Sabga Caribbean Excellence Awards. A written reply to APNU MP Terrence Campbell by the Ministry of Finance circulated in Parliament yesterday showed a sharp rise in the value of poultry and beef imports in 2024 despite the government’s focus on cutting the food import bill and expanding poultry production in particular. APNU Member of Parliament Riaz Rupnarain delivered a critique of the Ministry of Foreign Affairs during the 2026 Budget Debate yesterday, accusing the government of maintaining a “reactive” foreign policy that leaves border communities in a state of fear and fails to educate the nation’s youth on territorial integrity. The Dr Balwant Singh Hospital announced in a release yesterday that it is now the first private hospital in Guyana to launch a comprehensive digital platform that allows patients to access their medical information and manage healthcare services online. The Government of Guyana yesterday announced the Architecture for REDD+ Transactions’ (ART’s) issuance of 9,085,923 high-integrity The REDD+ Environmental Excellence Standard (TREES) carbon credits for the year 2023. This year’s Grammy Awards Best New Artist winner and British soul-pop sensation Olivia Dean, on Sunday night paid tribute to her Guyanese grandmother, Carmen, as she honoured immigrants worldwide. -after boom touches high voltage line Police in Regional Division # 2 are investigating an incident which occurred on Sunday at about 10.30 hours at Barakat Dam, Essequibo Coast, which resulted in the death of Toolsie Ram Singh, called ‘Base Man’, a 63-year-old truck operator of New Road, Essequibo Coast. -flays WIN’s Barker for `hypocrisy’ The debate over allocations in the education sector intensified on Monday night in the National Assembly, as Opposition members of Parliament challenged the Government over what they described as persistent gaps between headline spending and conditions in schools, while Education Minister Sonia Parag moved to defend the GOAL and school feeding programmes. Minister of Natural Resources, Vickram Bharrat, and APNU Member of Parliament, Sharma Solomon, yesterday locked horns over the management of Guyana’s vast extractive wealth. Police in Regional Division # 9 are investigating the discovery of a firearm and ammunition on Monday at about 19.05 hours at Hiawa Village, Central Rupununi. -as 2026 debate takes off Debate on the 2026 budget kicked off with WIN MP Dr. André Lewis charging that the link between massive spending and quality of remains unseen while Minister of Public Works Juan Edghill said that it formed a “social contract of inclusion”. Yesterday’s start of the budget debate was marred by stringent rules introduced for the media by the Speaker of the National Assembly, Manzoor Nadir and these have been condemned by the GPA and APNU which said that press freedom is under attack When reporters turned up for the commencement of the 2026 budget debate, they were informed that in order to enter the dome of the Arthur Chung Conference Centre where the sitting of the National Assembly was taking place, they were required to surrender their national identification cards in exchange for a temporary badge. We Invest in Nationhood (WIN) MP Natasha Singh-Lewis and Minister of Human Services Dr. Vindhya Persaud yesterday presented opposing realities of life in Guyana as they made their contributions to the 2026 budget debate. For more than 15 years, the number of persons who died in the violence that followed the February 23rd, 2002 Camp Street jailbreak and the circumstances of their deaths have been the sources of heated disputation. As part of a public service journalism project to shed more light on that period, Stabroek News has compiled from its archives a list of persons killed between February 23, 2002 and August 28, 2008 along with basic facts surrounding their cases."
}