{
  "url": "https://support.microsoft.com/en-us/windows/use-snipping-tool-to-capture-screenshots-00246869-1843-655f-f220-97299b865f6b",
  "title": "Use Snipping Tool to capture screenshots - Microsoft Support",
  "text": "Take a snapshot to copy words or images from all or part of your PC screen. Use Snipping Tool to make changes or notes, then save, and share. Capture any of the following types of snips: When you capture a snip, it's automatically copied to the Snipping Tool window where you make changes, save, and share. Use Copilot+ PC features in Snipping Tool On a Copilot+ PC, you can also use these AI-powered features: Open Snipping Tool Select the Start button, enter snipping tool, then select Snipping Tool from the results. You can use these shortcuts for getting things done with Snipping Tool faster: - Press Windows logo key + Shift + S to open the snipping tool overlay to capture an image snapshot. - Press Windows logo key + Shift + R to open the snipping tool overlay to capture a video clip. - Press Print Screen (PrtSc) for a static image snapshot of your entire screen and place it in your clipboard. Work with your screenshots With Snipping Tool open, select one of the following to create and work with your screenshots. In Snipping Tool, select Snipping Mode. and choose the kind of snip you want and select New. - Rectangle: Allows you to select a rectangular area to capture. - Window: Allows you to select a window that you want to capture. - Full screen: Immediately captures a snapshot of the entire screen. - Freeform: Allows you to draw a freeform shape to select the area you want to capture. Depending on the option you select, you would see the entire screen change slightly to gray indicating you're ready to capture a snip. Notes: - Perfect screenshot is only available on a Copilot+ PC. In Snipping Tool, select Perfect Screenshot, then select a rectangular area on the screen. Perfect Screenshot automatically adjusts the capture area to tightly frame on-screen content, reducing the need for post-capture cropping. When activated, the tool uses a rectangular selection that analyzes the visible screen and snaps around the most prominent content in view. It provides crop handles for optional fine-tuning and is designed to make captures cleaner and more efficient with minimal effort. Notes: - Color picker is only available on a Copilot+ PC. In Snipping Tool, select Color picker, then select a color from your screen, and copy it to the clipboard. After you capture an image snip, you can: - Write or draw on or around it by selecting the Pen or Highlighter buttons. - Add shapes or emojis to the snip by selecting the Shapes button. - Select Eraser to remove the lines or shapes you've added. - Crop the image by selecting the Image crop button. - Select Text actions button to extract and copy desired text from the snip. - Select Undo or Redo to undo or redo your annotations. To capture a video snip, open Snipping Tool, select the Record button, then select New, or press Windows logo key + Shift + R. Select the area of the screen you wish to record, then select Start. When you are done, select Stop. At this point you can save the recording as-is or select Edit in Clipchamp to work with it in the Clipchamp video editor. When you finish recording a video snip, select the Edit in Clipchamp button to add Captions or Audio. Generate and add captions - Navigate to the Captions tab and select the Transcribe media button. - Choose your language and filter options from the pop-up. - Navigate and select Transcribe media to generate captions. Add and detach audio from the video snip - Select the Audio tab from the sidebar. - Adjust the volume within a range of 0 to 200%. - To download the audio separately, select the Detach audio button. - To access the downloaded audio file, press the Windows logo key + R and type \"downloads\" in the dialog box. For more information, refer to Add captions and audio description to a Snip video. Notes: - To add an auto caption to the video snippet, refer to How to use autocaptions in Clipchamp. - To use the text to speech feature, refer How to use the text to speech feature. After you capture a snip, it is automatically saved to your Screenshots folder. To change the automatic save behavior or the default Screenshots folder, select See More then select Settings. You can also save an additional copy of the captured snip by selecting the Save as button, then select the location and filename and Save the file. After you capture a snip, select the See More menu on top right, and then select Share. Once you've captured a snip, select the Text actions button to activate the Optical Character Recognition (OCR) feature. This allows you to extract text directly from your image. From here, you have the option to either select and copy specific text or use the tools to Copy all text or to Quick redact any email addresses or phone numbers in the snip. All text recognition processes are performed locally on your device. With your capture open in Snipping Tool, select Edit > Edit with Paint to use features for sizing, color, text, and many other enhancements. In the folder where you’ve saved your snip, right click on the snip. Select Print from the options and make choices for how you want to print your image. In the search box on the taskbar, type snipping tool. You’ll see the Snipping Tool app and a list of actions you can take. Select Pin to taskbar. First, identify the menu or other components you want to capture. In Snipping Tool, select Delay and then select, for example, 5 seconds. Select the desired Snipping Mode, then select New to start the 5-second countdown. Within 5 seconds, open a menu or otherwise compose your image. At 5 seconds, when you see the screen turn gray, use the mouse to draw around the area you want. Take a snapshot to copy words or images from all or part of your PC screen. Use Snipping Tool to make changes or notes, then save, and share. Capture any of the following types of snips: When you capture a snip, it's automatically copied to the Snipping Tool window where you make changes, save, and share. Open Snipping Tool There are three ways to open Snipping Tool: - Select the Start button, enter snipping tool, then select Snipping Tool from the results. - Press Windows logo key + Shift + S. - Press Print Screen (PrtSc). Work with your screenshots With Snipping Tool open, select one of the following to create and work with your screenshots. In Snipping Tool, select Mode. and choose the kind of snip you want. - Rectangle: Allows you to select a rectangular area to capture after you select New. - Window: Allows you to select a window that you want to capture after you select New. - Full screen: Immediately captures a snapshot of the entire screen. - Freeform: Allows you to draw a freeform shape to select the area you want to capture after you select New. Depending on the mode you select, you would see the entire screen change slightly to gray indicating you're ready to capture a snip. - After you open Snipping Tool, open the menu that you want to capture. - Press Ctrl + PrtSc keys. The entire screen changes to gray including the open menu. - Select Mode, or in earlier versions of Windows, select the arrow next to the New button. Select the kind of snip you want, and then select the area of the screen capture that you want to capture. After you capture a snip, you can write or draw on or around it by selecting the Pen or Highlighter buttons. Select Eraser to remove the lines you've drawn. - After you capture a snip, select the Save Snip button. - In the Save As box, type a file name, location, and type, and then select Save. When you capture a snip from a browser window and save it as an HTML file, the URL appears below the snip. To prevent the URL from appearing: - In the Snipping Tool, select the Options button. - In the Snipping Tools Options box, clear the Include URL below snips (HTML only) check box, then select OK. After you capture a snip, select the arrow next to the Send Snip button, and then select an option from the list. With your capture open in Snipping Tool, select Edit > Edit with Paint 3D to use features for sizing, color, text, and many other enhancements. With your capture open in Snipping Tool, select File > Print and make choices for how you want to print your image. In the search box on the taskbar, type snipping tool. You’ll see the Snipping Tool app and a list of actions you can take. Select Pin to taskbar. First, identify the menu or other components you want to capture. In Snipping Tool, select Delay and then select, for example, 5 seconds. Select Mode to start the 5-second countdown. Within 5 seconds, open a menu or otherwise compose your image. At 5 seconds, when you see the screen turn gray, use the mouse to draw around the area you want."
}