{
  "url": "https://www.grammareer.com/irregular-verbs-list/",
  "title": "300 Irregular Verbs List in English with Examples - Grammareer",
  "text": "You may find it difficult when a verb does not follow the usual “-ed” rule, and this can interrupt both reading and simple writing tasks. I see this challenge often, especially when similar verbs change in different ways and create confusion in everyday English. That is why I’ve prepared this huge Irregular Verbs List with useful and easy examples that show how each form is used in English. In this article, you will got through irregular verbs with short sentences that help you learn how each form is used in daily English communication. As you read the examples, you build a stronger understanding of these verbs and gain confidence using them in both speaking and writing and enhance your accuracy of using tenses in English. Table of Contents What Are Irregular Verbs Irregular verbs are verbs that do not follow the typical pattern of forming their past simple tense and past participle by adding $-ed$ to the base form. Instead of following this regular rule, they change their form in various ways. These changes can involve the vowel sound within the verb, a complete change of the word, or in some cases, no change at all between the base form, past simple, and past participle. For example, the base verb go changes to went for the past simple and gone for the past participle, unlike a regular verb like walk, which becomes walked and walked. The specific form an irregular verb takes for its past simple and past participle must be memorized as there is no single rule governing all of them. Types of Irregular Verbs Irregular verbs follow different change patterns in English. These patterns help you predict how the base form changes into the past form and the past participle. No-change Verbs These verbs keep the same form in all three parts. Examples: put, cut, set Same Past and Participle The past and participle match, but both differ from the base form. Examples: build – built – built, send – sent – sent, keep – kept – kept Vowel-change Verbs Only the internal vowel shifts across forms. Examples: sit – sat – sat, win – won – won, dig – dug – dug Full-change Verbs All three forms are different. Examples: go – went – gone, be – was/were – been, drink – drank – drunk Mixed-change Verbs Part of the verb follows a pattern while another part changes. Examples: bring – brought – brought, think – thought – thought, catch – caught – caught “n” Participle Group The participle ends with the letter n. Examples: speak – spoken, write – written, take – taken “en” Participle Group A subset where the participle ends with en. Examples: break – broken, choose – chosen, freeze – frozen Common Irregular Verbs List Alphabetical List of 300 Irregular Verbs List of Irregular Verbs Forms: Base, Past, Past Participle - Abide – abode – abided - Arise – arose – arisen - Awake – awoke – awoken - Bend – bent – bent - Bite – bit – bitten - Bleed – bled – bled - Blow – blew – blown - Build – built – built - Burn – burnt – burnt - Buy – bought – bought - Catch – caught – caught - Choose – chose – chosen - Cling – clung – clung - Come – came – come - Cost – cost – cost - Creep – crept – crept - Cut – cut – cut - Deal – dealt – dealt - Dig – dug – dug - Do – did – done - Draw – drew – drawn - Drink – drank – drunk - Drive – drove – driven - Eat – ate – eaten - Fall – fell – fallen - Feed – fed – fed - Feel – felt – felt - Fight – fought – fought - Find – found – found - Fly – flew – flown - Forget – forgot – forgotten - Get – got – gotten - Give – gave – given - Go – went – gone - Grow – grew – grown - Hang – hung – hung - Have – had – had - Hear – heard – heard - Hide – hid – hidden - Hit – hit – hit - Hold – held – held - Keep – kept – kept - Know – knew – known - Lay – laid – laid - Lead – led – led - Learn – learnt – learnt - Leave – left – left - Lend – lent – lent - Let – let – let - Lie – lay – lain - Light – lit – lit - Lose – lost – lost - Make – made – made - Mean – meant – meant - Meet – met – met - Pay – paid – paid - Put – put – put - Read – read – read - Ride – rode – ridden - Ring – rang – rung - Rise – rose – risen - Run – ran – run - Say – said – said - See – saw – seen - Sell – sold – sold - Send – sent – sent - Set – set – set - Shake – shook – shaken - Shine – shone – shone - Shoot – shot – shot - Show – showed – shown - Shut – shut – shut - Sing – sang – sung - Sit – sat – sat - Sleep – slept – slept - Speak – spoke – spoken - Spend – spent – spent - Stand – stood – stood - Steal – stole – stolen - Stick – stuck – stuck - Swim – swam – swum - Take – took – taken - Teach – taught – taught - Tear – tore – torn - Tell – told – told - Think – thought – thought - Throw – threw – thrown - Understand – understood – understood - Wake – woke – woken - Wear – wore – worn - Win – won – won - Write – wrote – written Irregular Verbs Used in Example Sentences - I went to the market yesterday. - She has been a great teacher. - They took the bus to school this morning. - I ate pizza for lunch. - He read the book last night. - She wrote a letter to her friend. - They sang songs at the concert. - We have seen that movie before. - He spoke loudly during the meeting. - I bought a new phone yesterday. - She found her keys in the kitchen. - He drove to the office. - They ran in the park. - I chose the red shirt. - She taught me how to cook. - He gave me a gift for my birthday. - They spent the whole day shopping. - I caught the ball. - She kept her promise. - We have had enough time to prepare. - They flew to Paris for vacation. - He understood the problem very well. - She broke the glass. - I met him at the coffee shop. - We had a great time at the party. - They told us about the new movie. - I made dinner for my family. - She sat by the window. - He lost his wallet at the mall. - They showed us their new house. FAQs Many irregular verbs come from Old English and have evolved over centuries. They don’t follow the typical “ed” ending because they preserve older language patterns. Common irregular verbs in English include be, have, go, do, make, take, come, see, get, and give. Irregular verbs are verbs that don’t follow the usual “-ed” rule for past tense. Instead, their forms change completely, like go → went, or eat → ate. These verbs are commonly used and must be memorized. Go – Went – Gone Eat – Ate – Eaten Take – Took – Taken See – Saw – Seen Give – Gave – Given Come – Came – Come Speak – Spoke – Spoken Write – Wrote – Written Begin – Began – Begun Break – Broke – Broken…………….. You May Also Like"
}