{
  "url": "https://www.cnn.com/2026/02/03/us/nancy-guthrie-missing-savannah-mom",
  "title": "Nancy Guthrie’s disappearance: ‘Please help us bring Nancy Guthrie home,’ FBI pleads as search stretches into third day | CNN",
  "text": "Three days after Nancy Guthrie, the 84-year-old mother of “Today” anchor Savannah Guthrie, was reported missing from her Arizona home, investigators are examining evidence and asking the public for leads. “Every lead and tip is important. We are aggressively pursuing and looking into every single one again,” Jon Edwards, assistant special agent in charge of FBI’s Tucson office, told reporters Tuesday. “Please help us bring Nancy Guthrie home.” Pima County Sheriff Chris Nanos has not indicated if there are any leads that would point to a suspect in Nancy Guthrie’s disappearance. “We do believe that Nancy was taken from her home against her will, and that’s where we’re at,” Nanos said Tuesday afternoon. Nancy Guthrie was last seen Saturday night at her home in the Catalina Foothills near Tucson, and police say time is of the essence to find her, especially since she is without crucial daily medication. After her family reported her missing Sunday, law enforcement found a “very concerning” scene at her house that spurred a criminal investigation, Nanos said earlier this week. Savannah Guthrie, who traveled to Tucson after learning her mother was missing, is now asking for prayers for her family. She remains in the area with her two siblings to assist the investigation. Here’s what we know: Sheriff on Tuesday: Nothing yet to indicate a suspect Nanos on Tuesday largely declined to share specific details about investigators’ findings and at times candidly admitted to not having answers. When asked if more than one person could have been involved, the sheriff answered: “No clue.” In an interview with CBS News, Nanos said investigators are “absolutely not” dismissing a purported ransom note, though authorities have not confirmed its authenticity. When asked by CBS about what authorities were taking as credible in the note, Nanos said: “The entire note.” “When the note comes to us, it’s like any piece of evidence. You give it to us. You give us a lead. We’re going to look at every aspect of that lead and work it as a lead,” Nanos said. “So you’re not dismissing this note at this point?” CBS News reporter Jonathan Vigliotti asked. Nanos responded: “Absolutely not.” The sheriff said investigators reviewed the note and decided to share it with Savannah Guthrie, CBS reports. CNN has reached out to the FBI and Savannah Guthrie’s representatives. CBS interviewed Nanos after TMZ had reported it received what appeared to be a ransom note. TMZ says it forwarded the possible ransom note to the sheriff’s office. One other newsroom, a TV station in Tucson, said it also received what appears to be a ransom note and shared it with authorities. The sheriff’s department said earlier Tuesday it was “aware” of reports involving possible ransom notes in connection with the disappearance. It has not provided additional details about the alleged ransom notes. When asked by CNN whether a note had been shared with Savannah Guthrie and its details, the sheriff’s department directed CNN to a previous statement: “All tips and leads are being taken seriously and are forwarded directly to our detectives, who are coordinating with the FBI.” Samples of DNA from Guthrie’s home have been submitted to labs for testing, Nanos said. “We’ve gotten some (results) back, but nothing to indicate any suspects,” he said. Investigators have processed the scene inside and outside the residence and have turned the house over to the Guthrie family, officials said Tuesday. Reporters pressed the sheriff to share details on whether there were signs of forced entry in the home, items missing, blood at the scene, or if there is a specific time frame the public should focus on. “I don’t really want to get into narrowing down the time, because narrowing it down means we can miss some tips and leads,” Nanos said. Recognizing the sensitive nature of the situation, the Guthrie family has been seeking to keep some details related to the investigation out of the media. When was she last seen? Nancy Guthrie was last seen Saturday when her family took her home from dinner around 9:30 or 9:45 p.m., Nanos told CNN. They got her in the house, and she went to bed, he said. When Guthrie did not show up to church Sunday morning, a church member called her relatives, who went to her home around 11 a.m. to look for her, the sheriff said at a news conference Monday. A family member called 911 around noon Sunday to report her missing, Nanos said, and homicide detectives were sent to the home. “Something that they told me about that scene made me believe that there’s more than just a missing person,” Nanos said about the decision to start a criminal investigation. The case is “not dementia-related,” Nanos had said Monday, and Guthrie is “of great sound mind” and “sharp as a tack.” But she also has limited mobility and “couldn’t walk 50 yards,” the sheriff said, leading investigators to believe she was taken from the house. “This isn’t somebody who wandered off,” Nanos said Monday. Officials do not know what time she was taken, Nanos said. Right now, “time is very critical” in finding her, the sheriff said Monday. Missing her daily medication “could be fatal” for Guthrie, he said. Nancy Guthrie’s neighbor Jeff Lamie described her as a “normal person” whom he would see every day while walking his dogs, adding that she had lived alone since her own dog had died. Lamie told CNN’s Erin Burnett that her disappearance is “shocking” and people in the neighborhood are “unsettled.” He said authorities have been scouring the area, asking residents to check the heavy brush around their homes and to watch doorbell camera footage to see if they notice anything out of the ordinary. “Unfortunately, thus far, we can’t provide any assistance in that regard,” he said. What was found at the house? Law enforcement is treating Guthrie’s house as a crime scene and has described the circumstances around her disappearance as suspicious, Nanos has said. Authorities found blood inside Guthrie’s home, the Los Angeles Times reported Tuesday, citing law enforcement sources not authorized to discuss the case publicly. The report did not detail whose blood was found or where in the house it was found. CNN has reached out to the Pima County Sheriff’s Department for comment about the blood. Nanos declined to elaborate Tuesday on whether blood was found inside the home. “We also have some things at that scene that indicate to us that she was removed from that scene against her will. I can’t go into all those details” to protect the integrity of the case, Nanos said Monday. He also declined Monday to say whether it appears Guthrie was hurt during the incident. Police have Guthrie’s cell phone and are looking through that as well, Nanos said. Asked by CNN whether Guthrie could have been part of a kidnapping-for-ransom plot, given her daughter’s high profile, Nanos said Monday that is not the direction investigators are taking, but “we’ll never rule it out.” Investigators also do not believe it was a home invasion or robbery gone wrong, Nanos told MS NOW, adding they’re not dismissing that possibility, either. Who’s involved in the investigation? Local authorities are leading the investigation — with about 100 sheriff’s detectives assisting in the case — and FBI agents from across Arizona are “fully engaged” and offering technical resources, a law enforcement source familiar with the investigation told CNN Monday. This includes assisting with analysis of data from cell phone towers near the Guthrie home. A priority for investigators is downloading security footage from the house, Nanos said Monday. Private companies such as Google and Apple have also been offering assistance, the sheriff said. Investigators also are “working through” any data that may be available about a pacemaker, though authorities have not released any specific timeframes related to the device, sheriff’s officials said in an update Tuesday. The sheriff’s department set up a tip line for people to submit videos or images that may be useful to the investigation, and a reward of up to $2,500 is being offered for information leading to an arrest. Authorities are also looking through digital evidence, including by using a license plate reader and scrubbing surveillance video. It is unclear whether a vehicle was involved, Nanos said Monday. Border Patrol brought its dog team to help in the search, he told CNN. Despite the growing attention and crucial hours slipping by in the investigation, the US Marshal Service — one of the most trained and capable federal agencies in finding victims and criminals — has yet to be asked to join in the search, a federal law enforcement source told CNN. Because the search is ongoing and continues to be in flux, the source noted, federal officials could still approach the agency to join in the effort. The sheriff was optimistic, saying Monday: “I really believe that we’ll find her.” What has Savannah Guthrie said? The “Today” show opened Monday with a statement from Savannah Guthrie: “On behalf of our family, I want to thank everyone for the thoughts, prayers and messages of support. Right now, our focus remains on the safe return of our dear mom.” The statement also urged anyone with information to contact the sheriff’s office. The anchor’s security team has also been in touch with the sheriff’s department, Nanos said, adding law enforcement is not aware of any threats against the TV anchor. “Thank you for lifting your prayers with ours for our beloved mom, our dearest Nancy,” Savannah Guthrie wrote in an Instagram post late Monday. “Raise your prayers with us and believe with us that she will be lifted by them in this very moment. We need you,” she wrote, quoting a Bible passage from Isaiah before ending with a solemn message: “Bring her home.” Whomever has her “could drop her off at any fire station, hospital, grocery store,” etcetera, and “there would be no questions asked,” a source close to the family told CNN. Guthrie’s cohosts on “Today” continued their emotional pleas for help in finding Nancy Guthrie on Tuesday’s program. “I saw that post from Savannah last night. I hit my knees and prayed,” Carson Daly said. “I don’t think I’ve ever prayed for anything harder in my life.” The White House offered prayers for the Guthrie family and Nancy’s safe return Tuesday in a post on X, and urged anyone with information about her to contact law enforcement. President Donald Trump said he will call Savannah Guthrie and indicated he’s open to committing more federal resources to the search for her mother. Savannah Guthrie was set to travel to Italy on Monday for NBC’s coverage of the 2026 Winter Olympics, but she will no longer be joining the reporting team, NBC Sports said in a statement. “Savannah will not be joining us at the Olympics as she focuses on being with her family during this difficult time,” the statement read. “Our hearts are with her and the entire Guthrie family as the search continues for their mother.” Savannah Guthrie often has spoken highly of her mother and their close relationship. During a celebration of her mom’s 80th birthday on “Today,” the anchor described her as someone who “lived a life of integrity and loyalty” and raised three kids after their father died before Guthrie’s senior year of high school, the anchor said. “She has met unthinkable challenges in her life with grit, without self-pity, with determination, and always, always with unshakeable faith,” Guthrie said in that tribute. This story has been updated with additional information. CNN’s Brian Stelter and Holmes Lybrand contributed to this report."
}