{
  "url": "https://support.google.com/mail/answer/9259955?hl=en",
  "title": "View & find email - Gmail Help",
  "text": "With Gmail, you can choose whether messages are grouped in conversations, or if each email shows up in your inbox separately. Plus, you get powerful AI and search capabilities to help you find messages quickly. On this page - View individual messages or conversation threads - Change the order of messages - Find messages by searching - Get notified of new email - View archived email - View deleted email Note: The instructions in this guide are primarily web only. Get switching information for mobile devices. View individual messages or conversation threads - In Outlook: Arrange by conversation or sender. Scroll to view all messages or conversations (desktop view). In Outlook conversation threads, the newest message is at the top. - In Gmail: Use quick settings to change conversation view. View up to 100 messages or conversations per screen (web view). In Gmail conversation threads, the newest message is at the bottom. - On your computer, open Gmail. - At the top right, click Settings See all settings. - Scroll to the \"Conversation View\" section. - Select Conversation view on or Conversation view off. - At the bottom, click Save Changes. Tip: The settings are also available in the Quick settings sidebar. Click Settings , then scroll to the Email Threading section at the bottom of the Quick settings sidebar. Change the order of messages - In Outlook: Use the Filter or Sort menu in your inbox. - In Gmail: Set up your inbox to show messages or conversation threads in the order they arrive (Default). Or view starred, unread, or important messages first. You can also change the order from newest to oldest. Choose your inbox type - On your computer, go to Gmail. - Click Settings . - Under \"Inbox type,\" select: - Default - Important first - Unread first - Starred first - Priority Inbox - Multiple Inboxes Tip: The settings are also available in the Quick settings sidebar. Click Settings , then scroll to the Inbox type section of the Quick settings sidebar. Learn more at the Gmail Help Center Change the order from newest to oldest - Open Gmail. - In the message window, point to the numbers above your inbox. These numbers tell you how many messages are on the page and in your inbox. For example, 1-42 of 42 means you're viewing messages 1-42 on the page, and you have 42 messages in your inbox. - To see the oldest messages first, click Oldest. - To see the most recent messages first, click Newest. - If you have more than 100 messages, clickto go to the next page of messages. Find messages by searching - In Outlook: Use the search bar or the filter menu in your inbox. - In Gmail: Search using advanced search criteria, chips, and apps search overlay. - Open Gmail. - At the top, in the search box, enter your search criteria. - Press Enter. - (Chat in Gmail enabled only) Choose where to search by clicking Mail, Conversations, or Spaces: - Mail searches your email. - Conversations searches existing messages in chats and spaces. - Spaces searches the names of spaces that you have joined and spaces that you can join. Narrow your email search At the top of your inbox, search for one or more keywords that appear anywhere in the email—in the subject, body, or sender name. If you’re looking for something specific, click Show search options to use advanced search. Example: Search for: - Senders—Example: From:(sam@your-company.com) - Date ranges—Example: after:2019/3/29 before:2019/4/5 - Keywords—Example: Company confidential - Message attributes, such as attachments—Example: has:attachment Get notified of new email - In Outlook: Set up desktop alerts. - In Gmail: Set up browser alerts. - Open Gmail. - At the top right, click Settings See all settings. - Scroll down to Desktop notifications and select New mail notifications on or Important mail notifications on (if you use Priority Inbox). - Click Save Changes. View archived email - In Outlook: Search the Archive folder. Or, if you're using AutoArchive, open a .pst file. - In Gmail: Search All Mail. - On your computer, open Gmail. - On the left, click More All Mail. Tip: To search for archived messages: - At the top of Gmail, click the search bar. - Enter: in:archive View deleted email - In Outlook: Go to the Deleted Items folder. Whether you can move or recover deleted items depends on your settings. - In Gmail: Search Trash. If you deleted your messages in the last 30 days, you can move them out of your trash. - On your computer, go to Gmail. - On the left, click More Trash. - On the left of each message you want to move, check the box. - At the top, click Move to. - In the “Move to” menu, choose where you want to move the messages. Related topics - Find missing messages - Get help with your Gmail account or password - Move Outlook messages to Gmail - Troubleshoot Outlook migration issues Google, Google Workspace, and related marks and logos are trademarks of Google LLC. All other company and product names are trademarks of the companies with which they are associated."
}