{
  "url": "https://www.aaas.org/news/unleashing-brazils-potential-conversation-luciana-santos-brazils-minister-science-technology",
  "title": "Unleashing Brazil’s Potential: A Conversation with Luciana Santos, Brazil’s Minister for Science, Technology, and Innovation | American Association for the Advancement of Science (AAAS)",
  "text": "This conversation was originally published in Science & Diplomacy, available here. Luciana Barbosa de Oliveira Santos has served as Brazil’s Minister of Science, Technology and Innovation since January 2023 and is the first woman to hold the position. Santos is an electrical engineer with a degree from the Federal University of Pernambuco. Previously, she was the president of the Institute of Weights and Measures of Pernambuco (IPEM); mayor of Olinda; state secretary of Science, Technology and Environment; representative to the National Congress; and vice governor of Pernambuco, among other leadership roles. Science & Diplomacy staff spoke with Minister Santos. This conversation is the first edition of the AAAS-IAI Minister Conversation Series, a collaboration between the AAAS Center for Science Diplomacy—publisher of Science & Diplomacy—and the Inter-American Institute for Global Change Research’s Science Diplomacy Center. Q: Brazil’s Ministry of Science, Technology and Innovation (MCTI) includes the National Council for Scientific and Technology Development (CNPq), the National Institute for Space Research (INPE), the National Institute of Amazonian Research (INPA), the National Institute of Technology (INT), and the National Centre for Monitoring and Early Warning of Natural Disasters (CEMADEN). You have been the MCTI Minister since the start of 2023. What are your priorities for the Ministry and how are they connected to Brazil’s broader international agenda? Minister Santos: The timing of this question is very appropriate since Brazil is launching its National Strategy for Science, Technology and Innovation early this year. The strategy is for 2025 to 2035 and is built on four pillars: (1) recovery, expansion, and consolidation of the national science, technology, and innovation (STI) system; (2) reindustrialization on novel bases and support for innovation in companies; (3) STI for national strategic programs and projects; and (4) STI for social development. The strategy proposes a collaborative approach between universities, companies, and different levels of government, collectively known as the National Science, Technology and Innovation System, to advance Brazil’s competitiveness. The strategy also will provide institutional alignment for the agencies and units within the Ministry with programs that leverage the country’s economic and social development. Finally, it is worth mentioning that international cooperation cuts across the four pillars. Along with the strategy, the current administration has used the National Fund for Scientific and Technological Development (FNDCT) in ten structural programs focused on innovative and sustainable reindustrialization, and resources for international actions.1 I would also like to highlight Brazil’s New Industry Program, which aims to boost national industry by making it more competitive, generating jobs, and promoting innovation. The program’s six missions relate to aiming for more autonomy in the production of critical technologies, decarbonization and energy transition, and modernizing the Brazilian industrial base.2 Q: In our recent conversation with Ambassador Viotti, Brazil’s Ambassador to the United States,3 she discussed the Brazil-U.S. S&T Agreement and Brazilian initiatives like the Alcantara Launch Centre, which require close coordination between MCTI, the Ministry of Foreign Affairs (MRE), and other parts of Brazil’s federal government. Can you share with us how your Ministry promotes Brazil as an international player in STI? How does the Ministry collaborate with Brazil’s Embassies and International Missions? Minister Santos: MCTI is the Brazilian body responsible for national STI policies and internal coordination.4 MCTI hosts activities related to international cooperation, and establishes and implements international STI agreements. The interface with other countries and international organizations is carried out jointly with the Ministry of Foreign Affairs (MRE), which has a specific department (Department of Science and Technology) to promote dialogue on STI with Brazilian embassies and missions in international organizations. One of MRE’s main initiatives is the Innovation Diplomacy Program, which is designed to showcase Brazil’s strengths in innovation, to build connections between Brazilian and international partners, and to support the internationalization of Brazil’s innovation players. As Ambassador Viotti mentioned in her conversation with you, the MRE relies on an extensive network of STI sections (SECTECs) to identify opportunities for cooperation around the world. The MCTI is the MRE’s main partner in implementing the Innovation Diplomacy Program, providing critical insights into Brazil’s cutting-edge developments in STI to ensure that the MRE is well equipped to showcase Brazil’s strengths and identifying opportunities for strategic international collaboration. Through these efforts, we ensure not only the promotion of STI but also the strengthening of Brazil’s position in multilateral forums and global networks. Q: You had a key leadership role in the Brazilian Artificial Intelligence Plan, drafted by scientists and presented to President Lula during the National Conference on Science, Technology and Innovation in July 2024. Harnessing AI for sustainable development has been a key focus of Brazil in its G-20 presidency. What are the international implications of the plan? How do you envision Brazil’s international role in using AI for good? Minister Santos: The Brazilian Artificial Intelligence Plan has five axes, which are aimed at developing national capabilities in key areas of AI. The plan is focused on improving national skills and technological development and promoting Brazil’s leading role in AI, but international cooperation is a key aspect as well. The AI Infrastructure and Development axis of the Brazilian Artificial Intelligence Plan (PBIA) aims at positioning Brazil as a world leader in AI by promoting projects and research that substantially improve the lives of Brazilians. It seeks to establish international partnerships for the development of supercomputer nodes and accelerator chips, equipping the country with an advanced technological infrastructure—including one of the five most powerful supercomputers in the world, powered by renewable energy. In addition, the plan encourages collaboration with other developing countries, especially in Latin America, the Caribbean, and Africa. Within this same area, the Program for Structuring the Data and Software Ecosystem for AI advocates for AI models based on Brazil’s national data. This benefits other Portuguese-speaking countries and recognizes the cultural, social, and linguistic diversity of Brazil. Another important premise of the AI plan are ethics and responsibility. As an international leader, Brazil strives to serve as an example of good practices in the field of AI. Our government believes AI must be human-centered and accessible to all; based on respect for dignity, social rights, cultural diversity, and the valorization of work; and free of inequality and discriminatory biases. AI must be used as a tool to overcome social, environmental, and economic challenges, and contribute to the achievement of the Sustainable Development Goals. The plan has an expected public investment of US $4 billion over the next four years — one of the largest among all countries. We are certain that, with all these efforts, we can transform Brazil into a global reference in AI, use AI to promote inclusive sustainable development, and strengthen our cooperation in AI with other countries and international organizations. Q: You have advocated for bio-economy and more sustainable forms of production to combat the severe impacts of climate change. Brazil’s biodiversity is critical for the planet; having over 60% of the Amazon within your territory comes with great responsibility. Brazil is also one of the largest agricultural producers in the world. Can you describe any initiatives by MCTI that use STI to address global challenges like climate change and food security? Minister Santos: Indeed, Brazil considers bio-economy to be a priority in its National Strategy for Science, Technology and Innovation. To increase the country’s competitiveness in this space, in 2018, Brazil released the Science, Technology and Innovation in Bio-economy Action Plan on reviewing and adapting the country’s regulatory frameworks on bio-economy. The plan includes thematic axes of science, technology, and innovation and the design of the National Information and Knowledge System on the Bio-economy—all of which directly relate to the work of our Ministry. Based on contributions from the MCTI and the other relevant ministries, bio-economy gained prominence on the national stage with the establishment of the recently created National Bio- economy Strategy. Also, during the 2024 G20 Brazilian presidency, we played a leading role in the preparation and unprecedented approval of the Bio-economy High-Level Principles, under the G20 Bio-economy Initiative. Along with high-level plans and multilateral initiatives, there are several research projects on bio-economy being conducted by institutions linked to the MCTI. These projects include genetic studies on diverse organisms from the Atlantic Forest that might be inputs for the green economy, for instance as biofuels; the production of bio-hydrocarbons from agroforestry waste; and large-scale production of bioplastic extracted from sugarcane. Additionally, the Climate Change Impacts Information and Analysis System (Adapta Brasil Platform) uses science-based information to promote adaptation to climate change, impacting a wide variety of sectors including food and energy security, geo-hydrological disasters, and infrastructure. This platform was jointly developed by the National Institute for Space Research (INPE) and the National Research and Education Network (RNP), both units under this Ministry. Q: Since taking over the leadership of the Ministry, you have expressed an interest in addressing inequalities in science, including challenges that women and minorities face in science, technology, engineering, math, and medicine (STEMM) and using the full potential of Brazilians intellect. Can you share your plans to address these inequalities and how you work together with other national stakeholders—including the recently created Ministry of Indigenous Peoples—to ensure everyone’s contribution to STI is taken into account? Minister Santos: Combating inequalities in science, and breaking down gender, social, racial, national, economic, and knowledge barriers, is truly a concern of my administration. As a first step in the Ministry, we created the Secretariat of Science and Technology for Social Development. Within this framework, we have developed several initiatives, such as the STI Program for Food Security and Hunger Eradication, which aims to develop innovative solutions for social inclusion. Overcoming social inequalities is achieved by the promotion of research and projects, development of networks and initiatives, and national and international scientific cooperation. As the first woman to be the Minister of Science, Technology and Innovation, I am aware of my responsibility to address the historical gap in public policies for women. In this context, the MCTI launched a call for proposals of US$16.5 million, in partnership with the Ministry of Women and the National Council for Scientific and Technological Development (CNPq), to support projects that encourage the entry, training, and retention of girls and women in the exact sciences, engineering, and computing. The call states that at least 40% of junior scholarships must be allocated to Black and/or Indigenous girls. The selected projects will receive funding for costs, scholarships for high school and undergraduate students, and stipends for participating teachers for 36 months. Other initiatives aimed at promoting gender equality include the Innovative Women Program, a start-up acceleration program launched in partnership with the Funding Agency for Studies and Projects (Finep), aimed at reducing the gender gap in company leadership roles; and the Future Scientists Program, which for more than a decade has encouraged female students and teachers in the public school system to engage with the STEM fields. Finally, I want to mention the Beatriz Nascimento Interministerial Program for Women in Science, a joint initiative of the Ministries of Racial Equality, of Women, and of Indigenous Peoples, and MCTI and CNPq, which aims to allocate doctoral and postdoctoral scholarships abroad to Black, Quilombola, and Indigenous women, among other minorities. The participation of women in scientific and technological production and in the innovation ecosystem is not only a question of equity; it is also a question of excellence. Q: You are an electrical engineer by training and have held many leadership roles in your home State of Pernambuco, including serving as the vice governor. How have you benefitted from your technical background in your current role as the Minister of Science, Technology and Innovation? Has this been an asset during your role in international negotiations and when providing scientific advice? Minister Santos: My training as an electrical engineer together with experience in politics has helped me not only in the formulation and implementation of public policies, but in the decision- making process in the domestic and international spheres. Technological innovation is a driving force in the advancement of electrical engineering. In the state of Pernambuco, I had the honor of serving as Mayor of Olinda twice; Secretary of Science, Technology and Environment; Vice- Governor of the state; and as Representative of Pernambuco in the National Congress. In all these roles, I had the privilege of learning how technical and political skills are important to conduct inclusive, effective, and mutually beneficial negotiations with diverse counterparts, including with international partners. Q: How is the MCTI supporting the development of science advisers to support decision-making in Brazil? Minister Santos: The Ministry is launching the STeP Fellowship program, a collaboration with the Santa Catarina Research Foundation as the funding agency and the Inter-American Institute for Global Change Research (IAI). MCTI will provide technical and institutional support to train future advisors to decision-makers, and leaders knowledgeable in science diplomacy and technical cooperation in the public and private sector throughout the Americas. Given this context, the First MCTI-IAI Workshop and Forum on Science Diplomacy, organized in collaboration with the IAI’s Science Diplomacy Center, will be held in August 2025 in Brasília. By strengthening professionals’ capacities in science diplomacy, it will address issues of national and regional priority to promote, foster, and facilitate decision-making processes, regional integration, and international cooperation in STI. Q: We would like to end by asking what excites you about the science, technology, and innovation ecosystem in Brazil. Thinking about your home state of Pernambuco, is there an STI- related initiative or institution which you would like to highlight for our international readers? Minister Santos: The national STI system involves a wide range of actors, including political stakeholders, funding agencies, and operators, that jointly drive progress. It is exactly this interaction that excites me the most about the Brazilian science, technology, and innovation ecosystem. After several years lacking resources, the current administration is significantly increasing funds for STI. Together with the creativity and knowledge of our researchers, and public and private actors, the funds that we are providing will improve the social, economic, and environmental situation of Brazil. Pernambuco is at the forefront of this new moment for Brazil. I could mention several institutions and innovation ecosystems that exemplify this, such as the Porto Digital, one of the main science parks in Brazil and a successful case of public policy for innovation. We also have multiple institutions of excellence such as our universities and the Centre for Advanced Studies and Systems, which has an impressive portfolio of private sector clients such as Dell, Epson, and Ford. Finally, I would like to mention the Centre for Strategic Technologies, a technological research institution linked to the MCTI whose mission is to support technological and economic development in Brazil’s northwestern region. Disclaimer This conversation was edited for length and clarity. Endnotes - “Research and Innovation in Brazil: Support and Funding,” DWIH São Paulo, accessed February 13, 2025, www.dwih-saopaulo.org/en/research-innovation/the-research-and-innovation-landscape-in- brazil/research-and-innovation-in-brazil-support-and-funding. - “Brazil launches new industrial policy with development goals and measures up to 2033,” Presidency of the Republic, January 26, 2024, www.gov.br/planalto/en/latest-news/2024/01/brazil-launches-new- industrial-policy-with-development-goals-and-measures-up-to-2033. - Serving Humanity, Protecting Our Planet: A Conversation with Ambassador Maria Luiza Viotti, Brazil’s Ambassador to the United States, Science & Diplomacy, July 11, 2024, https://www.sciencediplomacy.org/conversation/2024/serving-humanity-protecting-our-planet- conversation-ambassador-maria-luiza-viotti. - “Ministry of Science, Technology and Innovation,” accessed February 13, 2025, www.gov.br/mcti/pt-br."
}