{
  "url": "https://en.wikipedia.org/wiki/Atalanta",
  "title": "Atalanta - Wikipedia",
  "text": "Atalanta Atalanta (/ˌætəˈlæntə/; Ancient Greek: Ἀταλάντη, romanized: Atalántē, lit. 'equal in weight') is a heroine in Greek mythology. There are two versions of the huntress Atalanta: one from Arcadia,[2] whose parents were Iasus and Clymene[3][4] and who is primarily known from the tales of the Calydonian boar hunt and the Argonauts;[5] and the other from Boeotia, who is the daughter of King Schoeneus[6][7][5] and is primarily noted for her skill in the footrace.[6] In both versions, Atalanta was a local figure allied to the goddess Artemis;[8] in such oral traditions, minor characters were often assigned different names, resulting in minor regional variations.[9] Mythology [edit]Early life [edit]At birth, Atalanta was taken to Mount Parthenion to be exposed because her father had desired a son.[4] A she-bear—one of the symbols of Artemis—whose cubs had been recently killed by hunters came upon Atalanta and nursed her until those same hunters discovered her and raised her themselves in the mountains.[2] Atalanta then grew up to be a swift-footed virgin who eschewed men and devoted herself to the huntress Artemis.[4] Atalanta modelled herself after Artemis, wearing a simple sleeveless tunic that reached her knees and living in the wilderness.[2][3] While living in the wild, Atalanta slew two centaurs with her bow and arrows, Rhoecus and Hylaios, after her beauty caught their attention and they attempted to rape her.[2][3][4] The voyage of the Argonauts [edit]Atalanta is only occasionally mentioned in the legend of the Argonauts;[9][10] however, her participation is noted in Pseudo-Apollodorus's account, which says that during the search for the Golden Fleece, Atalanta, who was invited and invoked the protection of Artemis, sailed with the Argonauts as the only woman among them.[11] In Diodorus Siculus's account, Atalanta is not only noted to have sailed with the Argonauts but to have fought alongside them at the battle in Colchis, where she, Jason, Laertes, and the sons of Thesipae were wounded and later healed by Medea.[12] In the account of Apollonius of Rhodes, Jason prevents Atalanta from joining not because she lacks skill but because as a woman she has the potential to cause strife among men on the ship.[13] After the death of King Pelias in Iolcus, funeral games were held in which Atalanta defeated Peleus in a wrestling match.[4] This match became a popular subject in Greek art.[8] The Calydonian boar hunt [edit]In an annual celebration, King Oeneus of Calydon had forgotten to honour Artemis with a sacrifice in his rites to the gods.[14][3] In anger, she sent the Calydonian boar, a monstrous wild boar that ravaged the land, cattle, and people, and prevented the crops from being sown.[14][15] Atalanta was called upon to join Meleager, Theseus, Pollux, Telamon, Peleus, and all those who were part of the Argonaut expedition on the hunt for the boar.[14][7] Many of the men were angry that a woman was joining them, but Meleager, though having a family of his own, convinced them otherwise as he desired to father a child with Atalanta after hearing of her expertise in archery and beauty while hunting.[14][3][16] During the hunt Hyleus and Ancaeus were killed, Peleus accidentally killed a fellow hunter and others were wounded. Atalanta drew first blood on the boar with her bow.[14] After this feat, killing the boar became a collective effort as, after the initial blow, Amphiaraus shot the boar's eye and Meleager ended its life.[14] Meleager awarded the hide to Atalanta for her valor,[7][17] but it was taken away by Meleager's uncles, Plexippus and Toxeus, who considered it dishonorable for a woman to hold such a prize.[14] In response, Meleager killed his uncles.[14] Althaea, Meleager's mother, became grief-stricken after hearing of her brothers’ deaths and threw the log that was tied to her son's life into a fire, killing him.[14][7] Footrace [edit]According to Ovid, before her adventures, Atalanta had consulted an oracle who prophesied that marriage would be her undoing. As a result, she chose to live in the wilderness.[18] After the Calydonian boar hunt, Atalanta was discovered by her father, who accepted her as his daughter and began to arrange a marriage for her.[4] To prevent this, she agreed to marry only if a suitor could outrun her in a footrace, which swift-footed Atalanta knew was impossible.[6][note 1] If the suitor was unsuccessful, he would be killed.[4][7] Her father agreed to the terms, and many suitors died in the attempt until Hippomenes,[6][18][note 2] who fell in love with Atalanta at first sight, appealed for divine help.[4] Hippomenes knew he could not best Atalanta even with the advantage of a head start, so he prayed to the goddess Aphrodite for assistance.[6] Aphrodite, who felt spurned because Atalanta was a devotee of Artemis and rejected love, gave Hippomenes three irresistible golden apples.[4][18] As the race began, Atalanta, wearing armour and carrying weapons, quickly passed Hippomenes, but she was diverted off the path when he tossed an apple for her to retrieve;[7] each time Atalanta caught up with Hippomenes, he would toss another apple,[18] ultimately winning the race and Atalanta herself.[6][4] Atalanta bore a son, Parthenopaios (who may have been fathered by Meleager or Ares), who became one of the Seven against Thebes.[4][20][21] Metamorphosis into lions [edit]After the footrace, Hippomenes forgot to thank Aphrodite for her aid, and while the couple were out hunting, the goddess afflicted them with such sexual passion that they had sex in a sanctuary belonging to either Zeus[7] or Rhea.[18] They were turned into lions for their sacrilege by either Artemis (angered by Atalanta losing her virginity), the goddess Cybele, or Zeus himself.[4] The belief at the time was that lions could not mate with their own species, only with leopards; therefore Atalanta and Hippomenes would never be able to have \"intercourse of love\".[7][10] Modern [edit]In 1865, Algernon Charles Swinburne published the play Atalanta in Calydon which retells the Greek myth of the Calydonian boar hunt. The play was in 1901 republished in the book Atalanta in Calydon: and lyrical poems. The Italian football club Atalanta, based in Bergamo, took its name from the heroine, and the club's crest depicts her face.[22] The English football club Huddersfield Atalanta Ladies F.C. was also named after the heroine. A version of Atalanta's story appears in the multimedia children's entertainment project Free to Be... You and Me.[23][24] She is also the focus of the 2017 historical novel For the Winner, by the British Classicist and author Emily Hauser, which retells the story of Atalanta's voyage with the Argonauts.[25] In the light novel Fate/Apocrypha, Atalanta is summoned as the Archer-class Servant of the Red faction. Olympic-medal-winning javelin thrower Fatima Whitbread said that she took up an interest in track and field events after being inspired by the myth of Atalanta, \"whom no man could outrun except by cheating, and whose javelin killed a terrible monster.\"[26] A version of Atalanta's story is told in Atalanta by Jennifer Saint (2023). This modern feminist retelling claims Atalanta as the daughter of Iasus and follows both the tales of the Argonauts and the Calydonian boar hunt and the tales of her skill in the footrace.[27] The European Union anti-piracy mission in Somalia is named \"Operation Atalanta\" in reference to the Greek heroine.[28] Gallery [edit]- Oil painting of Atalanta and Meleager hunting the Calydonian boar (Jan Fyt, 1648). The Ringling, Bequest of John Ringling, 1936. - Meleager presenting Atalante the head of the Calydonian Boar in 16th century alabaster, Bode Museum - Landscape painting of the hunt. Jan Wildens, 17th century. - Meleager et Atalanta, from a drawing by Giulio Romano, engraved by François Louis Lonsing. Atalanta is at far left with bow; Meleager is right of her, spearing the Calydonian boar (1773). - Meleager Presenting the Head of the Calydonian Boar to Atalanta at the Temple of Artemis. M. Maurice Stora (1530–1535). - Atalanta and Meleager hunting the Calydonian boar. Woodcut by Giovanni Battista Palumba, print in the British Museum. - Meleager and Atalante. Jacob Jordaens (1620–1650), Museo Nacional del Prado. - The Race between Atalanta and Hippomenes. Nicolas Colombel (1644–1717), Liechtenstein Museum, Vienna. - Oil painting depicting the footrace between Hippomenes and Atalanta by Noël Hallé, housed in the Louvre Museum - A woodcut engraving of the transformation of Atalanta and Hippomenes. Rijksmuseum Explanatory notes [edit]Citations [edit]- ^ Cleveland Museum of Art, 1966.114. - ^ a b c d \"Aelian: Various Histories. Book XIII, Ch. 1\". penelope.uchicago.edu. Retrieved 2021-03-08. - ^ a b c d e \"CALLIMACHUS, HYMNS 1-3 - Theoi Classical Texts Library, HYMN 3\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ a b c d e f g h i j k l m \"APOLLODORUS, THE LIBRARY BOOK 3.9.2 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ a b Apollodorus, 1.9.16 - ^ a b c d e f \"HESIOD, CATALOGUES OF WOMEN FRAGMENTS, FRAGMENT 14 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ a b c d e f g h i \"Hyginus, Fabulae. 173-174 and 185\". topostext.org. Archived from the original on 2018-08-26. Retrieved 2021-03-08. - ^ a b Boardman, John (1983). \"Atalanta\". Art Institute of Chicago Museum Studies. 10: 3–19. doi:10.2307/4104327. JSTOR 4104327. - ^ a b Howell, Reet A.; Howell, Maxwell L. (1989). \"The Atalanta Legend in Art and Literature\". Journal of Sport History. 16 (2): 127–139. JSTOR 43609443. - ^ a b Barringer, Judith M. (1996). \"Atalanta as Model: The Hunter and the Hunted\". Classical Antiquity. 15 (1): 48–76. doi:10.2307/25011031. ISSN 0278-6656. JSTOR 25011031. - ^ \"Apollodorus, Library, book 1, chapter 9, section 16\". www.perseus.tufts.edu. Retrieved 2021-03-09. - ^ \"DIODORUS SICULUS, LIBRARY OF HISTORY BOOK 4.48.5 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ \"APOLLONIUS RHODIUS, ARGONAUTICA BOOK 1.768 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ a b c d e f g h i \"APOLLODORUS, THE LIBRARY BOOK 1.8.2-3, Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ \"PHILOSTRATUS THE YOUNGER, IMAGINES 13 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2008-07-05. Retrieved 2021-03-08. - ^ \"OVID, METAMORPHOSES 8.300 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2007-09-30. Retrieved 2021-03-08. - ^ \"Pausanias, Description of Greece, Arcadia, chapter 45, section 2\". www.perseus.tufts.edu. Retrieved 2021-03-08. - ^ a b c d e \"OVID, METAMORPHOSES 10.560-681 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2007-09-30. Retrieved 2021-03-08. - ^ \"Pausanias, Description of Greece, Elis 1, chapter 19, section 2\". www.perseus.tufts.edu. Retrieved 2021-03-13. - ^ \"AESCHYLUS, SEVEN AGAINST THEBES, 526 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ \"DIODORUS SICULUS, LIBRARY OF HISTORY BOOK 4.65-7 - Theoi Classical Texts Library\". www.theoi.com. Archived from the original on 2006-11-20. Retrieved 2021-03-08. - ^ Munday, Billy (9 March 2020). \"Behind the badge: the story of Atalanta's logo\". thesefootballtimes.co. Retrieved 22 December 2020. - ^ Powers, Janis (26 October 2013) [26 August 2013]. \"Atalanta and the No-Choice Generation\". The Blog. HuffPost. Retrieved 25 May 2022. - ^ \"The History of Free to Be You and Me: As Remembered by Marlo Thomas, Carole Hart, Stephen Lawrence and Letty Cottin Pogrebin\". The Free to Be Foundation. Retrieved 25 May 2022. - ^ Penguin Books (2017). Emily Hauser: For the Winner. Penguin Books. Retrieved 14 November 2022. - ^ Whitbread, Fatima; Blue, Adrianne (1988). Fatima: The Autobiography of Fatima Whitbread. London: Pelham. ISBN 978-0-7207-1856-0. - ^ Saint, Jennifer 2023, Atalanta, Wildfire, London. - ^ \"OPERATION ATALANTA, THE EUROPEAN UNION NAVAL FORCE FOR SOMALIA TAKES STOCK AFTER 13 YEARS OPERATING\". European External Action Service. 10 September 2021. Retrieved 8 July 2024. The EU launched Operation Atalanta, named after the mythological Greek huntress, in December 2008 as a collective initiative of its Member States... General and cited sources [edit]- Aelian: Various Histories. Book XIII. Translated by Thomas Stanley, - Aeschylus, Prometheus Bound, Suppliants, Seven Against Thebes. Translation by Vellacott, P. The Penguin Classics. London. Penguin Books - Apollodorus, The Library of Greek Mythology. Translation by Aldrich, Keith. Lawrence, Kansas: Coronado Press, 1975. - Apollodorus, The Library. English Translation by Sir James George Frazer, F.B.A., F.R.S. in 2 Volumes. Cambridge, MA, Harvard University Press; London, William Heinemann Ltd. 1921. Includes Frazer's notes. - Apollonius Rhodius, Argonautica. Translation by Rieu, E. V. The Penguin Classics. London: Penguin Books. - Barringer, Judith M. (1996). \"Atalanta as Model: The Hunter and the Hunted\". Classical Antiquity. 15 (1): 48–76. doi:10.2307/25011031. JSTOR 25011031. - Boardman, John (1983). \"Atalanta\". Art Institute of Chicago Museum Studies. 10: 3–19. doi:10.2307/4104327. JSTOR 4104327. - Callimachus, Hymns & Epigrams. Translation by Mair, A. W. & Mair, G. R. Loeb Classical Library Volume 129. Cambridge, Massachusetts: Harvard University Press. - Diodorus Siculus, Library of History. Translation by Oldfather, C. H. Loeb Classical Library Volumes 303, 377. Cambridge, Massachusetts : Harvard University Press. - Hesiod, The Homeric Hymns, Translation by Evelyn-White, H. G. Loeb Classical Library Vol 57. Cambridge, Massachusetts: Harvard University Press. - Howell, Reet A.; Howell, Maxwell L. (1989). \"The Atalanta Legend in Art and Literature\". Journal of Sport History. 16 (2): 127–139. JSTOR 43609443. - Ovid, Metamorphoses. Translation by Melville, A. D - Hyginus, Fabulae from The Myths of Hyginus, translated and edited by Mary Grant. University of Kansas Publications in Humanistic Studies, no. 34. https://topostext.org/work/206 - Pausanias. Description of Greece. English Translation by W.H.S. Jones, Litt.D., and H.A. Ormerod, M.A., in 4 Volumes. Cambridge, MA, Harvard University Press; London, William Heinemann Ltd. 1918. - Philostratus Elder, Philostratus Younger, Callistratus. Translation by Fairbanks, A. Loeb Classical Library Vol 256. Cambridge, Massachusetts: Harvard University Press. Further reading [edit]- Bolen, Jean Shinoda. Artemis: The Indomitable Spirit in Everywoman, Conari Press, 2014. - Faraone, C. A. (1990). \"Aphrodite's ΚΕΣΤΟΣ and Apples for Atalanta: Aphrodisiacs in Early Greek Myth and Ritual\". Phoenix. 44 (3): 219–243. doi:10.2307/1088934. JSTOR 1088934. - Mathews, Richard (1971). \"Heart's Love and Heart's Division: The Quest for Unity in \"Atalanta in Catydon\"\". Victorian Poetry. 9 (1/2): 35–48. JSTOR 40001587. - Reid, Heather (1 September 2020). \"Plato on women in sport\". Journal of the Philosophy of Sport. 47 (3): 344–361. doi:10.1080/00948705.2020.1811713. S2CID 225230978. - Salinger, Margaretta (1944). \"Rubens's Atalanta and Meleager\". The Metropolitan Museum of Art Bulletin. 3 (1): 8–13. doi:10.2307/3257236. JSTOR 3257236. External links [edit]- Atalanta—World History Encyclopedia - Atalanta, a summary at the Theoi Project - Classical sculpture head of either Hygieia or Atalanta, a replica from the Louvre. - Atalanta and Hippomenes art collection Archived 2021-07-28 at the Wayback Machine, National Museum of Scotland. - The Warburg Institute Iconographic Database (images of Atalanta) - Atalanta - Greek mythological heroes - Argonauts - Women of Ares - Mortal parents of demigods in classical mythology - Metamorphoses characters - Deeds of Aphrodite - Mythological Arcadians - Mythological Boeotians - Princesses in Greek mythology - Metamorphoses into animals in Greek mythology - Deeds of Zeus - Mythological Greek archers - Mythological lions - Mythological hunters"
}