{
  "url": "https://sra.maryland.gov/contact",
  "title": "Contact - Maryland State Retirement and Pension System",
  "text": "Contact Contact Retirement Benefits Specialists are employees of the Maryland State Retirement Agency committed to helping you understand your retirement benefits. These highly-trained professionals are waiting to assist you via telephone, one-on-one counseling, correspondence and seminar. Our specialists can explain how to file for benefits, your retirement options, types of retirement and survivor benefits. Ways to Contact Us Secure Message The quickest and most secure method of communicating with a Retirement Benefit Specialist is by sending a secure message through the mySRPS portal. Log into your mySRPS account to access this feature. Not yet a mySRPS user? Click here for instruction on how to register. Virtual Assistant The SRPS Virtual Assistant, also known as Chatbot, can answer general questions about retirement benefits. You can access this resource by clicking on the Chatbot icon in the bottom right corner of our webpage. For your safety, please do not provide personal or confidential information such as a credit card number, Social Security number, or bank account number. The SRPS virtual assistant can give general information, but we only can pay benefits based on Maryland law and regulations. Nothing Chatbot says creates a legal promise or obligation. If you need help with your personal situation, please contact a Retirement Benefits Specialist. Phone Our main telephone line also functions as an interactive phone system. Use it to look up your basic account information any time, day or night. During normal business hours, if you prefer, stay on the line to speak with a Retirement Benefits Specialist. We maintain two email addresses, one for asking general questions and the other for submitting forms. For quickest service, choose the appropriate email address below. Email for Member/Retiree Services and General Information Email to Submit Forms Important: Not all forms may be submitted by email. Please review the form instructions before submitting. Password-protected or encrypted emails and attachments are not accepted and will delay processing. Pre-Retirement Counseling Schedule an In-Person or Virtual Counseling Appointment Address Maryland State Retirement Agency 120 East Baltimore Street Baltimore, MD 21202 Directions, maps, and parking information… For division-specific communication, see our phone directory. Website Problems Report broken pages, technical or accessibility issues, or feedback about the website to our Webmaster. Public Records Requests Maryland’s Public Information Act (“PIA”) gives the public the right to access government records without unnecessary cost and delay. The PIA applies to all three branches of Maryland state government as well as local government entities. The PIA is found in the General Provisions Article (“GP”), §§ 4-101 through 4-601, Annotated Code of Maryland. It is similar to the federal Freedom of Information Act which applies to federal executive branch agencies and independent federal regulatory agencies. Interactive Phone System Call Us Live Assistance We are available by phone from 8:30 a.m. until 4:30 p.m. For live questions and assistance, use our main lines. For department-specific communication, see our phone directory. Interactive Phone System If you have a touch-tone phone, you can use the interactive features of our phone system to access your account information, schedule an appointment, or hear current news on your pension plan. Directions and Parking Directions to the Agency We’re on the 14th floor of the Truist Building at 120 East Baltimore Street (the corner of Baltimore and Calvert Streets). When you enter the lobby, please sign in at the attendant’s desk and you’ll be directed to our offices. If you’d like to speak with a retirement benefits specialist, our 14th floor receptionist will assist you."
}