{
  "url": "https://mb.srb2.org/addons/sonic-adventure-dx-legacy.6442/",
  "title": "[Open Assets] - Sonic Adventure DX (Legacy) | SRB2 Message Board",
  "text": "- What permissions do you give others to modify and/or maintain your submission? - Modify: YES - Maintain: YES - I give permission for my entire submission to be modified by others or used in their own work. I give permission for my entire submission to be maintained by others as well. - I made sure my file(s) follow the Submissions Guidelines - Yes - I named my file(s) correctly (see Filename Conventions) - Yes Experience the old 2.0 level pack like never before! This is an update to E123OmegaShow's 10 years old Sonic Adventure DX level pack for SRB2 2.0, now for SRB2 2.2! Note that this is based on the 2.0 version and not on the 2.1 version! The idea of porting it came to my mind during touching EHZHangout or Sunshine Isles up for release. And then, one day after I submitted the latter, I decided to start working on this! So, here you go. After a bit more than 2 months of development, it's here! This level pack is an adaption of Sonic Adventure DX into SRB2. The level design is completely different from the original stages featured in the game. I hope you will have fun with this level pack! It's also 10 years old now lol. Important for hosters: IT'S RECOMMENDED TO USE THE PATCH INCLUDED IN THE ADDON FOR ONLINE! IF YOU USE IT, LOAD IT AFTER YOU LOAD THE MAIN MOD! This mod forces characters in every map, except the 2 bonus maps, and the patch basically removes that for map 01-10, 22, 28 and A1. These maps are Sonic's story (01-10), Hot Shelter (22) and the 2 bonus maps. Find the latter out for yourself :P. It also tweaks some of the maps to be beatable by everyone. - New textures - Skyboxes! - Some textures have been replaced with a higher quality/different version - Some new textures - Brand new title screen! - Title screen demos! - Texture alignment improvements/changes - Some maps have scrolling water textures - Different water textures - Big the Cat is now purple - Amy has a Hammer Jump courtesy of Pyrakid Wolfo! - No more air walking, this was done by EeveeEuphoria - Colormapped water! - Some level design changes (such as removing almost every \"kill all enemies\" sections) - Reworked Tails' story - Stories are now unlocked by beating one, instead of collecting emblems. So you beat Sonic's and then you get Tails', then you beat his and you get Knuckles', etc. - HQ music and SFX! - Multiplayer patch! - Hot Shelter and a bonus map got retextured - Torches now have coronas! - There isn't a single map gap between map 23 and 25, the map ID 25 is now 24 and the other map IDs until A1 got changed too - Speed Highway's Speed Pads are replaced by SRB2's Speed Pads - New springs, checkpoints, monitors, explosions and speed pads, courtesy of Ace Premier! - Some additional recoloring for HUD sprites that didn't have it - Skyboxes! - Some textures have been replaced with a higher quality/different version - Some new textures - Brand new title screen! - Title screen demos! - Texture alignment improvements/changes - Some maps have scrolling water textures - Different water textures - Big the Cat is now purple - Amy has a Hammer Jump courtesy of Pyrakid Wolfo! - No more air walking, this was done by EeveeEuphoria - Colormapped water! - Some level design changes (such as removing almost every \"kill all enemies\" sections) - Reworked Tails' story - Stories are now unlocked by beating one, instead of collecting emblems. So you beat Sonic's and then you get Tails', then you beat his and you get Knuckles', etc. - HQ music and SFX! - Multiplayer patch! - Hot Shelter and a bonus map got retextured - Torches now have coronas! - There isn't a single map gap between map 23 and 25, the map ID 25 is now 24 and the other map IDs until A1 got changed too - Speed Highway's Speed Pads are replaced by SRB2's Speed Pads - New springs, checkpoints, monitors, explosions and speed pads, courtesy of Ace Premier! - Some additional recoloring for HUD sprites that didn't have it Issues marked with * are fixed in a future update and will be removed once said update is out - The Windy Valley trampolines don't work on the web port. I won't fix this, the web port runs on 2.2.4, and that version's outdated as hell. Sorry, web port users... Maybe the issue above happens with this too, idk. I wouldn't be surprised - The title screen's background looks wrong on non-green resolutions - Monitors don't look exactly right in OpenGL. They function like intended otherwise - Checkpoints and monitors don't look right in Multiplayer, if you're not the host. The host can fix this by reloading the map or warping to a different one. The 2 things still do what they have to do, aside from being a bit bugged visually* - Disabling the asset replacements don't happen instantly (you have to restart twice just to turn off them) and you can't turn off the spring replacements* - If playing as Mighty (from the Chaotix mod), then his stomping attack becomes ear-rape when landing* - The Windy Valley trampolines don't work on the web port. I won't fix this, the web port runs on 2.2.4, and that version's outdated as hell. Sorry, web port users... Maybe the issue above happens with this too, idk. I wouldn't be surprised - The title screen's background looks wrong on non-green resolutions - Monitors don't look exactly right in OpenGL. They function like intended otherwise - Checkpoints and monitors don't look right in Multiplayer, if you're not the host. The host can fix this by reloading the map or warping to a different one. The 2 things still do what they have to do, aside from being a bit bugged visually* - Disabling the asset replacements don't happen instantly (you have to restart twice just to turn off them) and you can't turn off the spring replacements* - If playing as Mighty (from the Chaotix mod), then his stomping attack becomes ear-rape when landing* - Add slopes - Revamp Twinkle Park and Casinopolis - Fix bugs! - Add Super Sonic's story - Change up the level design in some places - Revamp Twinkle Park and Casinopolis - Fix bugs! - Add Super Sonic's story - Change up the level design in some places - Adventure Sonic - Of course he's here, he's... Adventure Sonic! All with his speedy tricks in his pocket! - Adventure Style Emblems - Adventure-like emblems! - Sonic Adventure style HUD - The Sonic Adventure 1/Sonic Adventure DX HUD. - E-102 Gamma - Unfortunately, he wasn't included in the original mod, and so he isn't included in this mod by default. But luckily, TehRealSalt made a REAL Gamma mod, so if you want, you can play as him in \"\"\"SADX\"\"\" now! - SA1 Spindash - So that everyone has the spamdash. Note that this breaks Amy and Adventure Sonic. - Knuckles dig - Makes Knuckles... well, dig - 1.09.4 Light Dash port - Adds the Light Dash for everyone! - Jump Leniency - Coyote Time and being able to recover from getting hit, just like in the Adventure games! - Peppermint's Official Game Models - SA1 Sonic model for Adventure Sonic, SA1 Tails model for Tails and a custom SA1-style Classic Sonic model for Sonic by GigglyMan! IMPORTANT: The SA1 Sonic model doesn't work properly for Adventure Sonic v1.8 onwards, see this post for fixing it. - Adventure Style Emblems - Adventure-like emblems! - Sonic Adventure style HUD - The Sonic Adventure 1/Sonic Adventure DX HUD. - E-102 Gamma - Unfortunately, he wasn't included in the original mod, and so he isn't included in this mod by default. But luckily, TehRealSalt made a REAL Gamma mod, so if you want, you can play as him in \"\"\"SADX\"\"\" now! - SA1 Spindash - So that everyone has the spamdash. Note that this breaks Amy and Adventure Sonic. - Knuckles dig - Makes Knuckles... well, dig - 1.09.4 Light Dash port - Adds the Light Dash for everyone! - Jump Leniency - Coyote Time and being able to recover from getting hit, just like in the Adventure games! - Peppermint's Official Game Models - SA1 Sonic model for Adventure Sonic, SA1 Tails model for Tails and a custom SA1-style Classic Sonic model for Sonic by GigglyMan! IMPORTANT: The SA1 Sonic model doesn't work properly for Adventure Sonic v1.8 onwards, see this post for fixing it. Credit goes to: - First of all, E123OmegaShow/STHE123O for creating this mod and also other level packs! Thank you man. - SEGA/Sonic Team for creating the original Sonic Adventure DX/Sonic Adventure 1 and the sound effects/music/textures/sprites (a part of them) - M1STQ and InfernoMelon for beta testing the mod and feedback! - Troplucky for fixing the Windy Valley music loop! Thank you, friend! - ItsEmily for creating the original cancelled 2.2 port of this mod and also the Danger sign sprite and the Destroy All Badniks sign - Ace Premier for the springs, checkpoint, speed pads, monitors, etc. from his upcoming Adventure Styles mod! - Pyrakid Wolfo for the Hammer Jump - EeveeEuphoria for the air walking removing script from Many Minor Tweaks - LucasL for a few Speed Highway textures from his Speed Highway mod - Mikhael Blur for the Emerald Coast sky texture and the emptified pre-flash Title Screen assets from his port of another Omega level pack, SRB2 '06 - XtremeXavier for the Rhinotank - Princess Plushima for the Flight Boosters - First of all, E123OmegaShow/STHE123O for creating this mod and also other level packs! Thank you man. - SEGA/Sonic Team for creating the original Sonic Adventure DX/Sonic Adventure 1 and the sound effects/music/textures/sprites (a part of them) - M1STQ and InfernoMelon for beta testing the mod and feedback! - Troplucky for fixing the Windy Valley music loop! Thank you, friend! - ItsEmily for creating the original cancelled 2.2 port of this mod and also the Danger sign sprite and the Destroy All Badniks sign - Ace Premier for the springs, checkpoint, speed pads, monitors, etc. from his upcoming Adventure Styles mod! - Pyrakid Wolfo for the Hammer Jump - EeveeEuphoria for the air walking removing script from Many Minor Tweaks - LucasL for a few Speed Highway textures from his Speed Highway mod - Mikhael Blur for the Emerald Coast sky texture and the emptified pre-flash Title Screen assets from his port of another Omega level pack, SRB2 '06 - XtremeXavier for the Rhinotank - Princess Plushima for the Flight Boosters"
}