{
  "url": "https://support.google.com/families/answer/7101025?hl=es",
  "title": "Empezar a utilizar Family Link - Ayuda de Google For Families",
  "text": "Con la aplicación Family Link, puedes crear una cuenta de Google para tu hijo/a si tiene menos de 13 años (o la edad estipulada en tu país). También puedes usarlo para añadir funciones de supervisión a la cuenta de Google actual de tu hijo. Importante: - Es posible que Family Link no esté disponible en todos los países o regiones. - Los dispositivos iPhone y iPad, y los ordenadores que no sean Chromebooks no se pueden supervisar con Family Link. - Las cuentas de Google Workspace for Education no se pueden gestionar con Family Link. - Los ajustes de autorización de compras de Family Link solo se aplican a las compras realizadas a través del sistema de facturación de Google Play. Como padre o madre, puedes usar Family Link para hacer cosas como: - Modificar parte de la configuración de la cuenta de Google de tu hijo/a. - Gestionar las aplicaciones de tu hijo/a en los dispositivos supervisados: decide qué aplicaciones puede descargar o comprar tu hijo/a, bloquea o permite aplicaciones y cambia los permisos de las aplicaciones. - Gestionar el tiempo de pantalla de tu hijo/a en los dispositivos supervisados: define una hora de dormir o límites de pantalla diarios y consulta cuánto tiempo pasa en determinadas aplicaciones. - Comprobar la ubicación del dispositivo Android o del dispositivo Fitbit compatible de tu hijo/a. - Restringir el contenido no apto para menores en Google Play. Requisitos Gestionar la cuenta de Google de tu hijo/a- Tener una cuenta de Google. Si no la tienes, puedes crear una sin coste económico. - Ser mayor de 18 años (o la edad requerida en tu país) y tener una cuenta de Google. - Tener un dispositivo Android (6.0 o versiones posteriores), iPhone o iPad (iOS 16 o versiones posteriores) o un Chromebook que sea compatible con las aplicaciones Android para poder descargar la aplicación Family Link. También puedes gestionar algunos ajustes en familylink.google.com. - Vivir en el mismo país que tu hijo/a. Configurar funciones clave Establecer límites de tiempo diarios por primera vez - Abre la aplicación Family Link . - Arriba a la izquierda, selecciona a tu hijo/a. - Abajo a la izquierda, toca Tiempo de pantalla Límites de tiempo. - Activa Límite diario. - Toca Programación semanal. - Para configurarlo por primera vez, toca Editar cada día. - Selecciona un día. - Indica el tiempo máximo que puede pasar tu hijo/a frente a la pantalla del dispositivo. - Para aplicar el límite a todos los días de la semana, toca Aplicar a todos los días de la semana Hecho. Cambiar el límite del día actual con el dispositivo del padre o la madre Para acceder a la configuración de la cuenta de tu hijo/a que visitaste por última vez en la aplicación Family Link, toca el siguiente botón: Cambiar los límites diariosEditar la programación semanal de límites con el dispositivo del padre o la madre - En tu dispositivo, abre Family Link . - Arriba a la izquierda, selecciona a tu hijo/a. - Abajo a la izquierda, toca Tiempo de pantalla Límites de tiempo Programación semanal. - Para configurarlo por primera vez, toca Editar cada día. - Selecciona un día. - Indica el tiempo máximo que puede pasar tu hijo/a frente a la pantalla del dispositivo. - Para aplicar el límite a todos los días de la semana, toca Aplicar a todos los días de la semana Hecho. Dar a tu hijo/a tiempo extra Puedes permitir que tu hijo/a pase más tiempo usando su dispositivo un día concreto sin cambiar el límite diario, el horario escolar ni la programación del tiempo de descanso. Además, puedes añadir tiempo extra mientras su dispositivo Android está bloqueado o a punto de bloquearse. - Abre la aplicación Family Link . - Arriba a la izquierda, selecciona a tu hijo/a. - Abajo a la izquierda, toca Tiempo de pantalla . - Debajo del nombre del dispositivo de tu hijo/a, toca Tiempo extra . - Indica la cantidad de tiempo extra. - Para aumentar el tiempo extra, selecciona . - Para reducir el tiempo extra, selecciona . - Para definir un tiempo concreto, toca el número. - Toca Hecho. Con el dispositivo de tu hijo/a - En el dispositivo de tu hijo/a, abre Ajustes . - En Android 8.1 (O) y versiones posteriores, toca Bienestar digital y control parental. - En otras versiones de Android, toca Google Control parental. - Para ver la configuración actual, toca Límite diario. - Para editar la configuración del límite diario, inicia sesión o utiliza tu código de acceso parental para verificar que eres el padre o la madre. Para acceder a los ajustes de la cuenta de tu hijo/a que visitaste por última vez en la aplicación Family Link, toca el botón que aparece abajo: Bloquear o desbloquear una aplicación en Family LinkLa aplicación se bloqueará o desbloqueará al cabo de unos 5 minutos o cuando el dispositivo se conecte a Internet. Si tu hijo/a está usando la aplicación en el momento en que la bloquees, se le avisará de que tiene un minuto para terminar lo que esté haciendo en ella antes de que se bloquee. La aplicación quedará bloqueada en todos sus dispositivos Android o Chromebook. - Abre la aplicación Family Link . - Selecciona a tu hijo/a. - En la parte inferior izquierda, toca Tiempo de pantalla Límites de tiempo Límites de aplicaciones. - Revisa la lista de aplicaciones. Las aplicaciones bloqueadas se marcan como \"Bloqueada\" . Las aplicaciones permitidas no tienen este icono. - Para bloquear o permitir una aplicación: - Para bloquear una aplicación: - Selecciona la aplicación. - Toca el interruptor Permitida. - El estado de la aplicación cambia a Bloqueada . - Toca Hecho. - Para permitir una aplicación: - Selecciona la aplicación. - Toca el interruptor Bloqueada. - El estado de la aplicación cambia a Permitida . - Toca Hecho. - Para bloquear una aplicación: Para acceder a la configuración de la cuenta de tu hijo/a que visitaste por última vez en la aplicación Family Link, toca el siguiente botón: Ver la ubicación de tu hijo/aSi eres el padre o la madre, puedes ver la ubicación del dispositivo Android de tu hijo/a en la aplicación Family Link. - Abre la aplicación Family Link . - Toca Ubicación. - Toca Configurar ubicación. - Si tienes varios hijos, selecciona aquellos para los que quieras activar la función Compartir ubicación. - Toca Activar. - Abre la aplicación Family Link . - Para cambiar de un miembro de la familia a otro, desliza por la esquina superior izquierda."
}