{
  "url": "https://www.google.com/intl/es_es/chrome/",
  "title": "Navegador web Google Chrome",
  "text": "- Prioriza el rendimiento Chrome se ha diseñado pensando en el rendimiento. Optimiza la experiencia con funciones como Ahorro de Energía y Ahorro de Memoria. - No pierdas de vista las pestañas Las herramientas de Chrome te ayudan a gestionar las pestañas que aún no quieres cerrar. Asigna un grupo, una etiqueta y un color a tus pestañas para organizarte y trabajar más rápido. - Optimizado para tu dispositivo Chrome se ha diseñado para funcionar con tu dispositivo en distintos sistemas operativos. Esto te permite disfrutar de una experiencia fluida en cualquier dispositivo que uses. - Actualizaciones automáticas Hay una nueva actualización de Chrome cada cuatro semanas, lo que te permite disponer de las funciones más recientes y de un navegador más rápido y seguro. - Prioriza el rendimiento Chrome se ha diseñado pensando en el rendimiento. Optimiza la experiencia con funciones como Ahorro de Energía y Ahorro de Memoria. - No pierdas de vista las pestañas Las herramientas de Chrome te ayudan a gestionar las pestañas que aún no quieres cerrar. Asigna un grupo, una etiqueta y un color a tus pestañas para organizarte y trabajar más rápido. - Optimizado para tu dispositivo Chrome se ha diseñado para funcionar con tu dispositivo en distintos sistemas operativos. Esto te permite disfrutar de una experiencia fluida en cualquier dispositivo que uses. - Actualizaciones automáticas Hay una nueva actualización de Chrome cada cuatro semanas, lo que te permite disponer de las funciones más recientes y de un navegador más rápido y seguro. - GESTOR DE CONTRASEÑAS Usa contraseñas seguras en todos los sitios web. Chrome tiene integrado el Gestor de Contraseñas de Google, que permite guardar, gestionar y proteger tus contraseñas en Internet. Además, te ayuda a crear contraseñas más seguras para todas tus cuentas. - NAVEGACIÓN SEGURA MEJORADA Navega con la tranquilidad de tener más seguridad online. La Navegación segura de Chrome te avisa de malware y ataques de suplantación de identidad. Activa la función Navegación segura mejorada para obtener más medidas de protección de seguridad - COMPROBACIÓN DE SEGURIDAD Comprueba tu nivel de seguridad en tiempo real con solo un clic. La función Comprobación de seguridad de Chrome confirma la seguridad y privacidad generales de tu experiencia de navegación, incluidas tus contraseñas guardadas, extensiones y configuración. Si algo requiere atención, Chrome te ayudará a solucionarlo. - GUÍA DE PRIVACIDAD Mantén tu privacidad bajo control de una manera fácil. Con Chrome es fácil saber con exactitud qué estás compartiendo online y con quién. Solo tienes que consultar la Guía de privacidad para revisar en detalle tu configuración de privacidad. Personaliza tu navegador Chrome Personaliza tu navegador con temas, el modo oscuro y otras opciones creadas especialmente para ti. Navega en diferentes dispositivos Inicia sesión en Chrome en cualquier dispositivo y accede a tus marcadores, contraseñas guardadas y más. Ahorra tiempo con Autocompletar Usa Chrome para guardar direcciones y contraseñas (entre otras cosas) y, así, autocompletar rápidamente tus datos. Personaliza tu navegador Chrome Personaliza tu navegador con temas, el modo oscuro y otras opciones creadas especialmente para ti. Navega en diferentes dispositivos Inicia sesión en Chrome en cualquier dispositivo y accede a tus marcadores, contraseñas guardadas y más. Ahorra tiempo con Autocompletar Usa Chrome para guardar direcciones y contraseñas (entre otras cosas) y, así, autocompletar rápidamente tus datos. Amplía la experiencia que te ofrece Chrome Descubre extensiones en Chrome Web Store para mejorar tu experiencia, ya sean de compras, entretenimiento o productividad. - La IA de Google Accede a los superpoderes de IA mientras navegas. En Google, estamos integrando la inteligencia artificial para hacer que nuestros productos sean más útiles. Usamos la IA en funciones como la Búsqueda y el Traductor de Google, entre otras, y estamos desarrollando innovaciones tecnológicas de forma responsable. - Búsqueda de Google Tu barra de búsqueda favorita está integrada. Todo un mundo de conocimientos a tu alcance. Consulta el tiempo, resuelve ecuaciones matemáticas y obtén resultados de búsqueda instantáneos, todo desde la barra de direcciones de tu navegador. - GOOGLE WORKSPACE Haz todo tipo de tareas con o sin Wi-Fi. Haz todo tipo de tareas en Gmail, Google Drive, el Traductor de Google y Documentos, Presentaciones y Hojas de cálculo de Google, aunque no tengas conexión a Internet."
}