{
  "url": "https://icriforum.org/indias-coral-reefs-2025/",
  "title": "Coral reefs of the Gulf of Mannar, Tamil Nadu, India - Decadal changes in status and management paradigms | ICRI",
  "text": "The recently released report, Coral Reefs of the Gulf of Mannar, Tamil Nadu, India: Decadal Changes in Status and Management Paradigms, by ICRI Member, Suganthi Devadason Marine Research Institute (SDMRI), and the Tamil Nadu government, provides an in-depth analysis of two decades of changes in the Gulf of Mannar’s coral reefs. This region, recognized for its ecological and economic significance, has experienced marked transformations due to natural and anthropogenic stressors. The report reveals a decline in live coral cover, from 37% in 2005 to 27.3% in 2021, with peaks and valleys corresponding to environmental events. Coral cover rose to 42.9% in 2009 following the cessation of coral mining but plummeted after the 2010 and 2016 global bleaching events. These events highlighted the vulnerability of the reefs, particularly in the Mandapam region, which faced greater impacts compared to Keelakarai and Tuticorin. Beyond bleaching, destructive fishing practices, pollution, and invasive species like Kappaphycus alvarezii have led to shifts in benthic communities. By 2021, reef areas decreased significantly from 11,060 hectares in 2005 to 6,628 hectares, with many now dominated by macroalgae or seagrasses. Despite these challenges, coral species diversity increased from 117 to 132, reflecting ongoing discoveries and updates to taxonomy. The report underscores ongoing efforts to restore and conserve these ecosystems. Key strategies include coral transplantation, artificial reef deployment, and seagrass rehabilitation. The Tamil Nadu government is also exploring policy measures such as a Coral Reef Conservation Action Plan to address threats and enhance the resilience of these critical habitats. The Gulf of Mannar’s coral reefs are vital for marine biodiversity, coastal protection, and the livelihoods of thousands of fisherfolk. Continued conservation and adaptive management are essential to ensure their survival amidst escalating climatic and human pressures."
}