{
  "url": "https://www.parisglobalforum.org/2019/02/01/reykjavik-ville-verte-et-ecologique/",
  "title": "Reykjavik, ville verte et écologique | Paris Global Forum",
  "text": "Reconnue pour être une des villes les plus écologiques du monde, Reykjavik, capitale de l’Islande, est un exemple à suivre en matière de développement durable. Sa particularité ? La production d’énergie renouvelable couvre 100 % de ses besoins en électricité. « Terre de feu et de glace », l’Islande, située à 250km du cercle polaire, est particulièrement connue pour ses richesses naturelles. Volcans en activités, sources d’eau chaude, geysers, l’Islande est l’un des pays les plus actifs du point de vue géologique. Peu urbanisé, l’état insulaire compte moins de 340 000 habitants, dont les deux tiers environ vivent à Reykjavik et son agglomération. Terre préservée, l’Islande est façonné par d’immenses étendues vierges. Grace à sa géologie unique, l’île est, à ce jour, le seul pays au monde à produire une énergie 100% renouvelable à bas coût. Issue de la géothermie – chaleur venue des profondeurs de la Terre – et des barrages hydroelectriques, 15 usines permettent d’alimenter entièrement la capitale en énergie verte. Jusqu’aux années 70, le pays dépendait des énergies fossiles et l’utilisation des énergies propres était très limitée. Les crises pétrolières et leurs conséquences sur la variation des prix ont poussé le gouvernement à recourir aux énergies durables et ce, dans plusieurs domaines. Reykjavik, une ville durable Redoublant d’efforts et d’initiatives, la capitale a opté dès 1990 pour un transport urbain propre et écologique. Équipés d’un moteur à hydrogène, les bus sont aujourd’hui les moins polluants au monde. Reykjavik est également la ville qui offre le plus d’espaces verts avec 410m² d’espaces verts par habitant. La ville se développe en étroite relation avec la nature : toitures végétales, parcs, jardins, voies piétonnes ou cyclistes. Alors que le réchauffement climatique est au cœur des débats internationaux, l’Islande entreprend depuis trois décennies une politique écologique novatrice, centrée sur la préservation de son patrimoine naturel."
}