{
  "url": "https://japan.recipetineats.com/okinawa-soba-soki-soba/",
  "title": "Okinawa Soba (Sōki Soba) - RecipeTin Japan",
  "text": "Okinawa Soba (Sōki Soba) is a famous home-cooking noodle soup in Okinawa. Sweet and tender pork ribs on top of egg noodles in pork broth makes a hearty and flavoursome noodle soup. The pork ribs are so tender that they melt in your mouth. Although the dish is called ‘soba’, the noodles used in Okinawa Soba are not buckwheat noodles. They are egg noodles and are actually very similar to ramen noodles. Here is a bit of history about why they are called ‘soba’ but not buckwheat noodles. Soba or Ramen? Before ramen was invented from the Chinese noodle soup dishes in Japan, noodles were called ‘soba’ and that meant buckwheat noodles, which have very long history in Japan. When Chinese-style wheat noodles were introduced, they called it ‘chūka soba’ (中華そば), meaning Chinese noodles, to distinguish it from the traditional Japanese buckwheat noodles. The word ‘ramen’ only came about in the 1950s. Similarly, noodles developed in Okinawa were called ‘Okinawa soba‘ (沖縄そば) to distinguish them from buckwheat noodles. But Okinawa soba is made of wheat like ramen. In 1971, the Japanese fair trade commission advised Okinawa that they could not use the word ‘soba’ since soba noodles must contain more than 30% buckwheat. However, after numerous negotiations, Okinawa was permitted to retain the name ‘Okinawa soba’ as the only exception to the rule. Buckwheat is called ‘soba’ and the kanji character for it is 蕎麦. To indicate that Okinawa soba is not using buckwheat, it does not use these kanji characters when written in Japanese. It is expressed in hiragana as ‘そば’. For the same reason, Yakisoba is written ‘焼きそば’, not ‘焼き蕎麦’ as the noodles are made of wheat. What’s in Okinawa Soba (Sōki Soba) The uniqueness of Sōki Soba is the broth and the topping made from pork ribs. It is not a complicated noodle dish at all. The noodles are similar to ramen noodles, but with the unique flavour of the broth it tastes nothing like ramen. The broth itself is actually much lighter than ramen broth. The broth is made from pork ribs with bonito flakes, salt, soy sauce, mirin and sake added to it. The flavour of bonito flakes makes the broth very unique. The pork ribs then become the topping. The toppings consist of simmered pork ribs, sliced kamaboko (かまぼこ, steamed fish cakes), chopped shallots/scallions and red pickled ginger. Kamaboko is sold frozen at Japanese grocery stores and some Asian stores. It looks like this. More about each key component is discussed in the following sections. Okinawan Noodles In Okinawa, the noodles for Sōki Soba are called Okinawa soba. These are the same Japanese characters as the generic name for Okinawan noodle soups that I explained earlier (very confusing). They are egg noodles and almost the same thing as ramen noodles. However, traditional Okinawan noodles are thicker than ramen noodles, or sometimes flat like fettuccini. Click here to see the images of Okinawa Soba noodles. The ingredients of the noodles are identical to ramen noodles but the process of making them is slightly different. In the case of Okinawan noodles, cooked noodles are coated in oil and then left to cool down, during which a unique texture of noodles is developed. Some Okinawan noodle makers also add lye instead of carbonated water as it is a very traditional method of making Okinawan noodles. So, although Sōki Soba are called ‘soba‘, they really sit in the category of ‘ramen’. Where I live, I can’t get genuine Okinawan noodles so I use other egg noodles that I can buy in Asian grocery stores. I used the flat egg noodles in the pack below and they were firm and quite good. You can of course use other egg noodles including ramen noodles. Use thick noodles if possible but not those noodles that are sold as Hokkien noodles with a dark yellow and oily surface. I also used Shanghai noodles (photo below), which are not yellow noodles and look similar to udon noodles but the thickness and firmness of the noodles are just right. Since the broth has the flavour of bonito flakes, udon noodles work well, too. About Sōki Sōki is the Okinawan terminology for pork ribs with bones intact. That’s why today’s Okinawa Soba is called Sōki Soba. If topping is pig’s trotters, they call it ‘tebichi soba‘. Tebichi is the Okinawan word for pig’s trotters. If topping is pork ear, they call it ‘mimigā soba’ If the topping is pork belly, it is called Okinawa soba which is also the generic name for Okinawan soba noodles. You will need pork ribs with a good amount of meat on bones. Rib bones can be hard bones or soft bones. The strip in the photo below was about 7cm/2¾” wide and had 3-4cm/1⅛” thick meat on the hard bones. I also used a pork lib strip with soft bones and its width was 5cm/2″. I live not far from the suburb of Eastwood where many Chinese and Korean butchers are trading. So I go there to buy pork rib strips. Making Broth and Topping from Sōki Cut the pork rib strip between each bone and pre-boil it to remove the scum. Then cook with sliced ginger for 1.5 hours. The meat becomes very tender by then. The broth in which the pork pieces were cooked become the basis for the soba broth. Cook the pork pieces in soy sauce, sake, mirin and sugar for several minutes. Simmered Sōki has a very similar flavour to my Kakuni (Japanese Simmered Pork Belly). Where I indicated ‘sake’, traditional Okinawa recipes use indigenous Okinawan local sake called ‘awamori’ (泡盛). It is made from long grain rice and distilled, unlike Japanese rice wine ‘sake’. Compared to sake, it has a richer and mellow scent and is marginally sweeter. Simmered Sōki keeps about a week in the fridge. You can also keep the broth a few days in the fridge and a month in freezer. I am glad that I can add one more ramen dish to my collection of ramen recipes. I hope you try Sōki Soba. Here is the list of ramen dishes that I posted. Click the photo below to display Ramen Collections. Yumiko P.S. Don’t forget to see the section ‘MEAL IDEAS’ below the recipe card! It gives you a list of dishes that I have already posted and the new recipe in this post that can make up a complete meal. I hope it is of help to you. Okinawa Soba (Sōki Soba) is a famous home-cooking dish in Okinawa. Sweet and tender pork ribs on top of egg noodles in broth that is made from pork ribs and bonito flakes. It is a hearty and flavoursome noodle soup. The pork ribs melt in your mouth. You can make Simmered Soki and soba broth ahead of time. - 400g/0.9lb egg noodles (note 1) - 120g/5.3oz kamaboko or chikuwa , sliced to 7mm/¼\" thick (note 2) - 8 tbsp finely chopped shallots/scallions - 4 tbsp beni shōga (note 3) - 1kg/2.2lb pork rib strips (note 4) - 30g/1.1oz ginger , sliced - 1400 ml broth from boiling pork (note 6) - 10g/0.4oz bonito flakes (note 7) - 2 tsp salt - 2 tsp soy sauce - 2 tbsp mirin - 1 tsp sake (note 5) - Cut pork rib strip between the rib bones so that each piece gets meat with a bone (note 8). - Put the pork pieces in a pot and fill with water to fully cover the pork. - Bring it to a boil and cook for 5 minutes. Drain and discard the fluid. Rinse the pork pieces ensuring that scum is removed. - Remove the scums from the pot cleanly, return the pork to the pot and add ginger pieces. - Fill water to fully cover the pork pieces and bring it to a boil. Reduce heat to low and simmer for 1.5 hours with a lid on, until the pork becomes very tender but not breaking easily. - Remove the pork pieces from the pot and keep the broth. - Transfer the pork pieces to another large pot or a frying pan, preferably large enough to place the pork pieces in without overlapping. - Add the Sōki Flavouring ingredients to the pot/pan with the pork and bring it to a boil. - Reduce the heat to low and cook for about 5 minutes, turning the pork pieces over so that the flavour coats them. - Bring the heat to high and continue to cook until the sauce almost evaporates. Turn the heat off. - Add bonito flakes to the broth and bring it to a boil. Reduce the heat to simmer and cook for few minutes. - Put the broth through a sieve to remove ginger, bonito flakes and tiny pork bits (note 9). - Add the remaining Soba Broth ingredients and bring it to a boil. Turn the heat off. - Boil water in a pot and cook noodles as per the instructions on the pack. - Drain water well and place noodles in each serving bowl. - Pour 350ml of the soba broth into each of the bowls, topped with the simmered sōki, kamoaboko/chikuwa and shallots. Serve immediately. 1. Traditional Okinawan noodles are thicker than ramen noodles. Sometimes flat noodles (similar to fettuccini) are used as well. You can use thick egg noodles from Asian grocery stores but do not use oily thick egg nooddles that are used to make Hokkien Noodles. Alternatively, you can use Shanghai noodles that are whitish and are similar to udon. They are available at Asina grocery stores. If you are in NSW, they are also sold at Harris Farm Markets. 2. Kamaboko is a steamed fish cake and usually comes in a semi-cylinder shape (see the photo in the post), while chikuwa (photo below) is broiled after fish paste is wrapped around a stick and comes as a tube. They are sold in the frozen section of Japanese/Asian grocery stores. If using chikuwa, diagonally slice each tube like the photo below. 3. Beni shōga is red pickled ginger which usually comes in shredded form. You can buy beni shōga at Japanese/Asian grocery stores, possibly at some supermarkets. Please visit Japanese Beef Bowl (Gyū-don) for more details with photos. 4. The bones attached to the pork rib strip can be hard bones or soft bones. For the best result, the width of the strip should be 5-7cm/2-2¾”. 5. If you have access to ‘awamori’ (泡盛), which is an indigenous Okinawan local sake, you may want to use awamori instead. Compared to sake, it has a richer and mellow scent and is marginally sweeter. 6. If not enough, add water. 7. I use a spice bag or a disposable dashi bag that you can buy at Japanese grocery stores, particularly if your bonito flakes contain tiny powdery bits. Using a bag will maintain the clarity of the broth better. See the recipe notes section of Home-made Ramen Broth Recipe for the sample photo of disposable dashi bag. 8. If you can only find a narrow strip, you may want to cut it at every alternate rib bone so that the size of each pork piece is not too small. 9. Unless I am serving to friends or visitors, I use a fine mesh skimmer spoon to remove bits the broth so that I needn't use another container with a strainer. Meal Ideas A typical Japanese meal consists of a main dish, a couple of side dishes, a soup and rice. I try to come up with a combination of dishes with a variety of flavours, colours, textures and make-ahead dishes. I decided to make today’s meal close to the set meal you might find in Okinawa. For this reason, I had to include Goya Chanpuru. Since the topping of Sōki Soba is quite sweet, there should be a vinegar flavour to cleanse the palate. In Okinawa, they often serve sunomono (vinegar dressing) with Okinawan seaweed called ‘mozuku’ (もずく), which is slightly slimy and comes in long thin strands. So, I decided to add sunomono to go with the other Okinawan dishes. If you prepare Simmered Sōki and broth a head of time, putting these dishes together on the day is not too hard. - Main: Okinawa Soba (Sōki Soba) – today’s recipe, make ahead broth and simmered sōki. - Side dish 1: Gōya Chanpuru (Bitter Melon Stir Fry Okinawa Style) - Side dish 2: Cucumber and Wakame Seaweed Sunomono (Vinegar Dressing)"
}