{
  "url": "https://invisionhealth.com/",
  "title": "Local Health Care Provider | Comprehensive Health Care | Buffalo, NY | Invision Health",
  "text": "Your Life. Your Health. Your Choice. Make us your new local health care provider in Buffalo, NY Choosing a local health care provider is a big decision. But at Invision Health, we make that choice simple. We provide an innovative suite of health, wellness, preventative care, diagnostic and surgical services for our patients in Buffalo, NY. Through our variety of specialties and extensive team of skilled practitioners, you can be sure you'll get the care you deserve. Discover comprehensive health care services you won't find anywhere else. To learn more about the medicine and practices we specialize in, call 716-631-3555 today. Looking for a New Family Doctor? Our doctors specialize in family medicine, weight management and more Experience State-Of-The-Art Health Care For the past 20 years, Invision Health has been a leading local health care provider of the Buffalo, NY region. We offer a variety of health care services. We're currently accepting patients in all specialties. You can find out more about our comprehensive health care services by getting in touch with a staff member today. We change the way patients are cared for Our goal is to provide our patients with expert care in a compassionate and comprehensive manner, all while using advanced technology. Since we've grown our practice, we now have over 50 providers. From weight management to gynecology, we have doctors ready to care for every one of your needs. You can trust you'll walk away having been cared for by the best of the best. DIA Invision Health is an outpatient radiology practice offering comprehensive radiology services to the adult and pediatric community. Choose DIA Invision Health for all of your diagnostic needs and benefit from the advanced technology and radiology expertise. The stresses of everyday life can exact a toll. Our massage therapists and estheticians offer customized health and wellness solutions. Experience Spa400, where our staff is at your service to ensure an ideal respite to renew body, mind and soul. Brain and spine injuries can be extremely debilitating, and that's why our mission is so important. The Invision Health Foundation exists to increase awareness and fund research into treatments for these types of injuries. We connect patients with the resources they need to optimize their health and well-being. Peace of Mind. Invision Health is the leading comprehensive health-care provider for the Buffalo Niagara region. Invision Health provides an innovative suite of health, wellness, preventative care, diagnostic and surgical services. Select Invision Health for patient- centered care. Your life, Your health. Your choice. Weight Management Let us help you reach your nutrition, weight and wellness goals. We offer multiple services that focus on your unique needs."
}