{
  "url": "https://texags.com/forums/35/topics/3593150",
  "title": "Any power outages to report? | TexAgs",
  "text": "Forums Football News Schedule SEC Standings Roster Staff Class Breakdown Recruiting News A&M Commits A&M Offers Liucci 44 Rankings Out of State All Recruits Basketball Recruiting Sports Football Basketball Baseball Women's Basketball Soccer Softball Volleyball Premium Premium Feed Chat Subscription Benefits Subscribe Now Sponsors Sponsors Advertise With Us United More Podcasts Media TexAgs Live Post of the Day iOS App Search Store Pick-Off 12th Man Foundation Our Staff Contact Us Help Center Live LIVE CHAT 0 USERS subscribe subscribe Log In | Register admin menu Sports Forums Billy Liucci's TexAgs Premium The Premium Pub Aggies Only Varsity Texas A&M Football Texas A&M Men's Basketball Texas A&M Women's Basketball Texas A&M Baseball & Softball Texas A&M Soccer Texas A&M Volleyball SEC Country Old Rivalries NFL & Fantasy Football NBA & Other Basketball MLB & Other Baseball Recruiting Outdoors Golf Other Sports Ticket Exchange General Forums Five Star General General Job Network Entertainment Food & Spirits Bonfire Religion & Philosophy Politics Business & Investing Real Estate Academics Automotive The Nerdery Health & Fitness Military History Classifieds Travel Home Improvement Aggie Network Forums Aggieland Austin San Antonio Metroplex Houston Central Texas Panhandle / South Plains West Texas South Texas East Texas Gulf Coast Around the Nation Across the Globe Public Service Forums Coronavirus/COVID-19 News & Information Support Forums Technical Support Aggieland Post Reply 1 of 1 Last 1 Any power outages to report? 970 Views | 1 Replies | Last: 10 days ago by ShawnTxAg studioone You must be a subscriber to . Subscribe Now Joined: May 3, 2007 Posts: 3,543 User Profile Ignore User Stop Ignoring How long do you want to ignore this user? 24 hours One week Permanently Cancel 6:43a, 1/25/26 Other than the guy who ran into the power pole on rio grande? Reply Quote 0 ShawnTxAg You must be a subscriber to . Subscribe Now Joined: Sep 28, 2006 Posts: 4,078 User Profile Private Message Ignore User Stop Ignoring How long do you want to ignore this user? 24 hours One week Permanently Cancel 7:03a, 1/25/26 AG Off Texas Ave around MLK a few city blocks appear to be without power as i drove thru between 4-5am, towards Downtown Bryan. Reply Quote 0 1 edit Skip to Last Page 1 Page 1 of 1 Refresh Page 1 of 1 This post has been flagged. Click to display linked image. Live Show Home Account Advertise Help Contact Terms & Privacy Site Map Mobile Site App Follow TexAgs × Subscribe subscribe Verify your student status Log In See Subscription Benefits Trial only available to users who have never subscribed or participated in a previous trial."
}