{
  "url": "https://www.yocrunch.com/yogurt-with-toppings/oreo-yogurt/",
  "title": "OREO® Cookie Pieces with Lowfat Yogurt in 3 Flavors",
  "text": "Your Favorites, Together Your Favorites, Together America’s favorite cookie™? Yes! Strawberry yogurt and M&Ms®? Wow! Just close your eyes, grab a cup, and surprise yourself with one delicious snack. America’s favorite cookie™? M&Ms®? Why choose! Two of your favorites in one easy-to grab pack. Whatever you get, you know you’re gonna have a good time! Talk About A Next Level Dunk. Next Level Dunkalicious. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Talk About A Next Level Dunk. Next Level Dunkalicious. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Your Favorites, Together Your Favorites, Together America’s favorite cookie™? M&Ms®? Why choose! Two of your favorites in one easy-to-grab pack. Whatever you get, you know you’re gonna have a good time! America’s favorite cookie™? M&Ms®? Why choose! Two of your favorites in one easy-to grab pack. Whatever you get, you know you’re gonna have a good time! Talk About A Next Level Dunk. Next Level Dunkalicious. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Next Level Dunkalicious. Talk About A Next Level Dunk. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Your favorite cookie and your favorite yogurt are now your favorite snack. That’s what happens when you combine OREO® cookies and our delicious yogurt. It’s a next level dunk. Vanilla Lowfat Yogurt with other natural flavors and Oreo® Cookie Pieces Nutrition - Serving Size: 1 Container (170g) - Calories 170 - - Amount/Serving %DV* - Total Fat 3.5g 4% - Saturated Fat 1.5g 8% - Trans Fat 0g - Polyunsaturated Fat 0g - Monounsaturated Fat 0g - Cholesterol 5mg 2% - Sodium 110mg 5% - Total Carbohydrate 30g 11% - Dietary Fiber 0g 0% - Total Sugars 22g - Added Sugars 16g32% - Protein 5g 10% - - Vitamin D 4.3mcg 20% - Calcium 190mg 15% - - Iron 0.6mg 4% - Potassium 240mg 6% - *Percent Daily Values are based on a 2,000 calorie diet. According to the Dietary Guidelines for Americans (2020), there are critical nutrients to encourage (calcium, vitamin D, dietary fiber and potassium) and nutrients to limit (saturated fat, added sugar, sodium). Nutrients to encourage Excellent Source of Vitamin D (20%) Good Source of calcium (15% DV) Nutrients to limit Added sugars (32% DV) Saturated fat (8% DV) Sodium (5% DV) Ingredients LOWFAT YOGURT CULTURED PASTEURIZED GRADE A LOWFAT MILK, WATER, SUGAR, MODIFIED CORN STARCH, CONTAINS LESS THAN 1% OF: NATURAL FLAVORS, VITAMIN D3. OREO® COOKIE PIECES UNBLEACHED ENRICHED FLOUR (WHEAT FLOUR, NIACIN, REDUCED IRON, THIAMINE MONONITRATE [VITAMIN B1], RIBOFLAVIN [VITAMIN B2], FOLIC ACID), SUGAR, PALM OIL, SOYBEAN AND/OR CANOLA OIL, COCOA (PROCESSED WITH ALKALI), INVERT SUGAR, LEAVENING (BAKING SODA AND/OR CALCIUM PHOSPHATE), SOY LECITHIN, SALT, CHOCOLATE, NATURAL FLAVOR. CONTAINS YOGURT CULTURES: S. THERMOPHILUS AND L. BULGARICUS CONTAINS: CONTAINS MILK, WHEAT AND SOY. MAY CONTAIN PEANUTS, TREE NUTS AND EGGS. Delicious yogurt. Amazing toppings. With so many choices, you can always find your flavor of fun."
}