{
  "url": "https://www.altogain.it/en/palantir-technologies-riporta-i-risultati-del-q4-2025/",
  "title": "",
  "text": "Palantir Technologies ' (NASDAQ: PLTR) Q4 2025 earnings, announced on February 2, 2026, surpassed Wall Street's expectations and reignited investor enthusiasm for one of the most controversial and hotly debated stocks in the AI sector. With revenues up 70% year-over-year and 2026 guidance that blew analysts' estimates, the company led by Alex Karp has demonstrated that its AI-based business model is more than just hype, it's a reality. Before delving into the numbers, it's worth remembering the context in which these quarterly results were released. PLTR stock had lost about 29% from its November 2025 highs and was among the 15 worst performers in the S&P 500 since the beginning of the year, down more than 15%. Investors had become more cautious about the valuations of AI companies, and skepticism from some analysts, combined with Michael Burry's short bet revealed in November, had weighed on sentiment. The numbers that made Wall Street tremble Let's start with total revenue: $1.407 billion in the fourth quarter, versus consensus expectations of around $1.33 billion. This represents 70% growth compared to the same period last year and 19% quarter-over-quarter. For a company now 23 years old, this pace of acceleration is simply extraordinary. But the figure that truly sparked excitement was the US commercial business. US commercial revenue reached $507 million , up 137% year-over-year and 28% quarter-over-quarter. This segment more than doubled in just twelve months. For years considered Palantir's Achilles heel, overly dependent on government contracts, US commercial has become the company's true growth engine. On the profitability front, Palantir reported GAAP net income of $609 million , with a 43% margin. GAAP operating income reached $575 million (a 41% margin), while adjusted operating income reached $798 million with a 57% margin. These numbers, Alex Karp described in his letter to shareholders, as \"pure and uncontrived\" profit, pointing the finger at other AI companies that might be tempted to manipulate their financial results. The 2026 guidance that swept away the consensus If the Q4 results were impressive, the guidance for 2026 was even more explosive. Wall Street expected annual revenues of around $6.22 billion according to FactSet estimates. Palantir instead announced a forecast of between $7.182 billion and $7.198 billion , a full 15% above the consensus. Expected growth of 61% year-over-year is simply off the charts for a company of this size. * Midpoint Guidance For the first quarter of 2026, Palantir forecasts revenue between $1.532 billion and $1.536 billion, versus expectations of $1.32 billion. But the most impressive number once again concerns US commercial: the company expects revenue in this segment to exceed $3.144 billion for the full year 2026, representing growth of at least 115% year-over-year. Total Contract Value tells a different story There's a metric that often goes unnoticed but can reveal a lot about the future health of a software company: Total Contract Value (TCV), or the total value of contracts closed during the period. In Q4 2025, Palantir recorded a record TCV of $4.262 billion , up 138% year-over-year. This means the future revenue pipeline is stronger than ever. The company closed 180 deals worth at least $1 million each, 84 deals worth at least $5 million, and 61 deals worth at least $10 million. US commercial remaining deal value reached $4.38 billion, representing 145% year-over-year growth. These numbers indicate that demand for Palantir solutions isn't slowing down; in fact, it's accelerating. Stock reaction and short-term outlook Following the results release, PLTR stock jumped 5-7% in after-hours trading, fluctuating between $144 and $161 with volumes exceeding 71 million shares. This is typical of a highly volatile stock like Palantir, where retail investors' expectations are always high and reactions to results tend to be amplified. In the short term, the stock could benefit from the enthusiasm generated by these exceptional results. Analyst Louie DiPalma of William Blair, who upgraded the stock to \"Outperform\" just the day before the earnings call with a $200 price target, emphasized that even in the event of a post-earnings correction, he expects the stock to return above $200 within the next 12 months. Options traders had forecast a post-earnings move of 8.9%, and the published numbers appear to justify this expectation. Ratings: The Elephant in the Room It's impossible to discuss Palantir without addressing valuation. The stock is trading at approximately 349x trailing earnings and 142-166x forward earnings, the third-highest multiple in the entire S&P 500. These numbers are unsettling for many analysts, and it's no coincidence that the distribution of recommendations is unbalanced: 17 Holds versus just 4 Buys, with an average target price of around $190. However, as DiPalma noted, when comparing these valuations to recent funding rounds of other AI ecosystem companies, Palantir's premium appears more defensible. The company has demonstrated its ability to translate AI hype into real revenue and tangible profits, something many competitors cannot match. Bullish Factors - US Commercial Growth +137% YoY - 2026 Guidance 15% above consensus - Rule of 40 at 127% (exceptional) - TCV record $4.26B (+138% YoY) - Net GAAP margin at 43% - Cash position $7.2 billion Bearish Factors - Trailing P/E ~350x (among the highest S&P 500) - Stock down 29% from November highs - 17 Holds vs. 4 Buys among analysts - Institutional selling (JPMorgan -32%) - Slower international growth - Dependence on the US market The strategic context: the AI Platform as a differentiator In his letter to shareholders, Alex Karp devoted extensive space to the philosophy driving Palantir's growth. The company positions itself as the bridge between Large Language Models and the real world of business, providing the \"grammar and structure\" needed to transform AI models' probabilistic predictions into concrete actions. The Artificial Intelligence Platform (AIP) is proving to be a true game changer. Palantir's \"bootcamps\" for potential customers are rapidly turning into tens of millions of dollars in contracts within weeks, not months. This accelerated sales cycle is a strong sign of the platform's maturity and its ability to demonstrate tangible value quickly. On the government front, which still accounts for over half of its revenue, Palantir continues to consolidate its position. The $10 billion contract with the U.S. Army signed last summer and the $448 million agreement with the U.S. Navy to accelerate naval production are just the latest examples of a government pipeline that remains robust. Karp emphasized that demand is so strong in the United States that the company has decided to postpone the launch of new products to allies to focus on the domestic market. Investor Outlook: What to Expect For those who already hold positions in PLTR, these results represent an important validation of the investment thesis. The company is demonstrating that its business model is sustainable, profitable, and rapidly accelerating. The Rule of 40 ratio of 127% places Palantir among the best software companies in the world in terms of growth and profitability. For those considering a buyout, the timing is complex. On the one hand, valuations remain high, and the stock has already recovered some of its post-earnings losses. On the other, the aggressive guidance for 2026 suggests that multiples could naturally compress if the company continues to grow at this pace. Analysts at 24/7 Wall St. have set a price target of $202.50 for the end of 2026, with revenue projections reaching $11.9 billion by 2030. If these numbers materialize, the current valuation may not seem so extreme in hindsight. A note of caution, however, comes from the behavior of institutional investors. JPMorgan reduced its position by more than 32%, while T. Rowe Price cut by 24%. This \"smart money selling\" is a sign worth paying attention to, although it could simply reflect profit-taking after the 2025 rally rather than a loss of confidence in the business. In conclusion, Palantir delivered a quarterly report that exceeded all expectations and sent a clear message to the market: the AI era is generating real revenue for those who have built the right infrastructure. Whether the stock is overvalued or not will depend on the company's ability to maintain this extraordinary growth rate. The coming quarters will tell us whether we are truly at the beginning of a \"generational project,\" as Karp called it, or whether expectations have outpaced reality."
}