{
  "url": "https://www.bordeaux.com/en/appellations/bordeaux-et-bordeaux-superieur/bordeaux-superieur/",
  "title": "Bordeaux supérieur rouge : les vins rouges de l’appellation",
  "text": "Bordeaux Supérieur, intensity through and though Full-bodied red wines and a few, ultra delicious sweet white wines… Bordeaux Sup’ (for those in the know) are never opened by chance. Be sure to pick out one of these bottles when you want to add a little extra sparkle to special occasions. What is the Bordeaux Supérieur PDO wine region? Key points to remember - When it comes to producing Bordeaux Supérieur wines, 1,600 winegrowers have their pick of 12,191 hectares. - These wines can be produced throughout the Bordeaux wine region, offering an incredible diversity of terroirs, and making it impossible to tire of them! - They have different production rules from their Bordeaux counterparts. Starting with the red wines, a minimum of nine months aging, lower yields and greater ripeness at harvest, hence the reason for their additional intensity. The Bordeaux Supérieur PDO is no better than the Bordeaux PDO – it’s just different! Why do people love Bordeaux Supérieur and its wines? - Because they offer excellent value for money - Because the complex and well-structured red wines go very well with many dishes - Because the whirlwind of aromas in the white wines means they can be served alone or in a refreshing cocktail. Add ice and orange zest, and you’re good to go! - Because the winegrowers have an outstanding knowledge of their terroir and demonstrate formidable precision and expertise - Because here you will find a host of different estates, from those producing small-lot wines (the ancestors of garage wines) to prestigious châteaux. A wide array that can grace every table all over the world! - Because such an extensive wine region makes for an infinite playground for wine tourism, from must-visit sites to unusual experiences What is Bordeaux Supérieur style? You might have heard us mention earlier that, compared to the Bordeaux PDO, intensity steps up a notch in Bordeaux Supérieur wines. The result is bold red wines and white wines with a distinctive aromatic profile. Bordeaux Supérieur red wines stand out for their power, structure, and beautifully round tannins. Not to mention their aromatic richness combining ripe fruit (cherry, raspberry, blackcurrant), oaky notes (cedar overtones) and spicy nuances. The kind of character that leaves a lasting impression. Bordeaux Supérieur white wines opt for delicious concentration. They are brimming with natural sweetness and exuberant nuances predominated by tropical fruit, retaining an irresistible freshness all the while. These wines can be cellared for many years no matter the style… and the white wines retain their freshness, even after several weeks in the fridge. Which kind of wines can be found in the Bordeaux Supérieur PDO? Almost exclusively red wines, and a few sweet white wines. For blending, the PDO has an “à la carte” choice from a comprehensive menu of Bordeaux grape varieties: Merlot, Cabernet Sauvignon, Cabernet Franc, Malbec, Petit Verdot and Carmenère for the red wines; Sauvignon Blanc, Sauvignon Gris, Sémillon and Muscadelle for the white wines. Fun facts Three fun facts you need to know about Bordeaux Supérieur Thought we’d covered all the interesting facts about the appellation? Far from it… 1. True to their heritage (we’ll reveal more about that below), these wines are a must-buy if you are planning a get-together with friends over a hearty farmhouse pâté or a favorite dish lovingly simmered for hours. 2. The PDO’s red wines are often produced from old vines, and many are barrel-aged. Oh yes, the winegrowers must take care at every stage of production to obtain the Bordeaux Supérieur appellation and allow the terroir to express itself to the full. 3. More discreet than their Sauternes or Barsac counterparts, Bordeaux Supérieur white wines are produced by a handful of passionate people. Indeed, these winegrowers need a good dose of patience and precision to tame Botrytis cinerea, the precious fungus that saturates the grapes with sugar and aromas. Let’s talk about the soil With a vineyard that spans the entire Bordeaux wine region, the appellation’s terroirs offer an infinite number of blends. En voir plus Each wine labeled Bordeaux Supérieur tells the story of a unique soil, depending on where its grapes grew. The main production area is located in Entre-deux-Mers, on clay-limestone soils mixed with sand, which are perfect for adding structure and character to the wines. Let’s travel back in time Bordeaux Supérieur wines were initially created from the simple idea of offering local families a “Sunday wine” that differed from the Bordeaux wines enjoyed day-to-day. That is how the Bordeaux Supérieur PDO was officially created in 1943. En voir plus Until the 1980s, these wines were particularly known for their full-bodied, tannic character. They were all the rage in bistros and the iconic bouillon restaurants of Paris – not surprising given that they are inexpensive, consistent in quality and a tad more robust than the usual Bordeaux wines. They changed tempo from the 2000s. Riper fruit and greater roundness were sought-after early on in the decade, but they stayed true to their ideal pairing with bistro cuisine, which also evolved over time to become more refined and indulgent. All in all, Bordeaux Supérieur wines are classics that can adapt without losing their essence."
}