{
  "url": "https://www.heinz.com/our-story",
  "title": "Heinz – Our Story | Kraft Heinz | Heinz",
  "text": "THE MAN BEHIND IT ALL At 25, Henry was living at home with his mother in Pittsburgh, USA. That's where he created his first product - a 'pure and superior' grated horseradish, using his mother's recipe. Henry grew the horseradish on a patch of garden his father gave him. At the time, most companies used brown bottles to obscure their lower-grade ingredients. Henry Heinz bottled his horseradish in clear glass, to display its purity and quality. IT’S CALLED CATSUP Heinz Tomato Ketchup first appeared on US shelves in 1876. It was originally called 'Catsup', and was made from five simple ingredients, including sun-ripened tomatoes. Henry soon took 'Catsup' international, selling his first product to Fortnum & Mason in London. 57 VARIETIES Henry was a born innovator, and created a whole series of new products over this period. By 1896, he sold over 60 products. When he spotted a shoe company advertising 21 styles of shoe, he was inspired to create our iconic '57 varieties' slogan. Why 57? No one knows for sure. Henry claimed five was his lucky number, and seven was his wife's. But he also believed seven was a significant number for people of all ages. Whatever his reasons, the number stuck! BEANZ, SOUP AND SALAD CREAM In the early twentieth century, canned goods were a luxury. But that didn't stop us - we'd already become the world's largest manufacturer of tomato products. It was around this time that Heinz Baked Beans got their delicious debut in the UK. Henry worked tirelessly on ad campaign after ad campaign, to show the world how tasty, nutritious and affordable Heinz Baked Beans could be. Baked Beans quickly became a favourite food for the nation. The public loved it so much that we opened up not one, but two factories in the UK. In 1910, Henry added Heinz Cream of Tomato Soup to his UK range. It was made in Canada until UK production started in the late 1920s. And in 1914, he launched Heinz Salad Cream exclusively in the UK too. GOING INTERNATIONAL The UK truly went Heinz-crazy in the 1920s. In our first year alone, our factories produced 10,000 tonnes of food! WARTIME Then came the Great Depression. The economic crash left people struggling to feed their families. So we decided to help, by adding high-quality, ready-to-serve soups and baby foods to our range. They ended up as top sellers, becoming a permanent fixture on UK shelves. Soon after came World War II, and ingredients were in very short supply. Heinz Tomato Ketchup completely disappeared off UK shelves - in fact, it took ten years before anyone saw the classic recipe return to shops. Instead, the company helped the UK deal with food shortages. In fact, the Ministry of Food declared Heinz Baked Beans an 'essential food' item. THE ROYAL WARRANT In 1954, Queen Elizabeth granted the company a Royal Warrant. It means that we officially supply the Royal households. We also opened a Heinz Beanz factory in Kitt Green in 1959. Today, it's the largest food processing plant in Europe and our biggest factory ever. BEANS MEANZ HEINZ In the 1960s, we had some catchy advertising. Every radio station was playing the Heinz 57 jingle: 'Heinz 57, Heinz 57. You've a family to feed. Heinz have everything you need. Ready when you are, yes indeed. That's Heinz 57!' And who could forget Beanz Meanz Heinz? Maurice Drake thought up the phrase while sitting in a London pub. Now, it's considered to be one of the best-known advertising slogans in the UK. KETCHUP IN SPACE How much further can you go than getting a Royal Warrant? Outer space, of course. In the 1990s, Heinz Tomato Ketchup was officially approved by NASA for use on the International Space Station. It's one small step for Heinz... 50 YEARS IN THE MAKING In 2009, the Heinz Beanz factory in Kitt Green - Europe's largest food plant - turned 50. And we invited two very special guests - Her Majesty The Queen and His Royal Highness The Duke of Edinburgh - to celebrate with us. The Royals paid their first visit to the factory, and Her Majesty also opened a new packing operation. A DECADE OF INNOVATION By 2010, we officially marked a full decade of innovation at Heinz. We set up a dedicated Research & Development Centre in the Netherlands to understand why we eat what we eat, and the way we eat it. Here, a top team of chefs, culinary experts, food scientists and technicians look for ways to innovate and meet evolving customer needs around the world. From making pouring easier in the 80s with an upside-down bottle to going organic and reducing salt and sugar in 2010, Heinz research has changed the way we enjoy food today. 150 YEARS ON Ever had a meal so good you've practically licked the plate clean? With Heinz, that's a given. To celebrate 150 years of clean plates, we took things back to where they started with limited-edition retro packaging for Heinz Beanz, Heinz Cream of Tomato soup and Heinz Tomato Ketchup. The packaging acted as a reminder of simpler times - and sparked some amazing memories from older Heinz fans. The cans and bottles went on sale at Fortnum & Mason and other supermarkets across the UK."
}