{
  "url": "https://en.m.wikipedia.org/wiki/Babushka_Lady",
  "title": "Babushka Lady - Wikipedia",
  "text": "Babushka Lady The Babushka Lady is an unidentified woman present during the 1963 assassination of US President John F. Kennedy who is speculated to have photographed or filmed the events that occurred in Dallas’ Dealey Plaza at the time President Kennedy was shot. Her nickname arose from the US Army headscarf she wore, which was similar to scarves worn by elderly Russian women. Babushka (Russian: бабушка) literally means \"grandmother\" or \"old woman\" in Russian. The Babushka Lady was seen to be holding a camera by eyewitnesses and was also seen in film accounts of the assassination.[1][2] She was observed standing on the grass between Elm and Main streets, standing amongst onlookers in front of the Dallas County Building, and is visible in the Zapruder film, as well as in the films of Orville Nix,[3] Marie Muchmore, and Mark Bell,[4] 44 minutes and 47 seconds into the Bell film; even though the shooting had already taken place and most of her surrounding witnesses took cover, she can be seen still standing with the camera at her face. After the shooting, she crossed Elm Street and joined the crowd that went up the grassy knoll. The Babushka Lady is last seen in photographs walking east on Elm Street. Neither she, nor the film she may have taken, have ever been positively identified. Her first appearance on film chronologically is on the sidewalk in front of the Dallas County Building, which is visible in an image as being on Kennedy's right. She would have crossed Houston Street and onto Dealey Plaza in order to be visible in the Dealey Plaza images. This may imply that the images show two different women of similar appearance. It is plausible that once the motorcade passed by she was able to cross the street to catch a second motorcade drive past on Dealey Plaza where she would be on Kennedy's left. Beverly Oliver's claim [edit]In 1970, a woman named Beverly Oliver told conspiracy researcher Gary Shaw at a church revival meeting in Joshua, Texas, that she was the Babushka Lady.[5] Oliver stated that she filmed the assassination with a Super 8 film Yashica and that she turned the undeveloped film over to two men who identified themselves to her as FBI agents.[5] According to Oliver, she obtained no receipt from the men, who told her that they would return the film to her within ten days. She did not follow up with an inquiry.[5] Oliver reiterated her claims in the 1988 documentary The Men Who Killed Kennedy.[5] According to Vincent Bugliosi, Oliver has \"never proved to most people's satisfaction that she was in Dealey Plaza that day\".[5] Confronted with the fact that the Yashica Super-8 camera was not made until 1969, she stated that she received the \"experimental\" camera from a friend and was not sure the manufacturer's name was on it.[5] Oliver's claims were the basis for a scene in Oliver Stone's 1991 film JFK, in which a character named \"Beverly\" meets Jim Garrison in a Dallas nightclub.[6] Played by Lolita Davidovich, she is depicted in the director's cut as wearing a headscarf at Dealey Plaza and speaking of having given the film she shot to two men claiming to be FBI agents. House Select Committee on Assassinations report [edit]In March 1979, the Photographic Evidence Panel of the United States House Select Committee on Assassinations indicated that they were unable to locate any film attributed to the Babushka Lady.[7] According to their report: \"Initially, Robert Groden, a photographic consultant to the committee advised the panel as to pertinent photographic issues and related materials. Committee investigators located many of the suggested films and photographs, however, some items were never located, i.e. the Babushka Lady film, a color photograph by Norman Similas, and the original negative of the Betzner photograph.\"[7] Public hearings of the Assassination Records Review Board [edit]On November 18, 1994, assassination researcher Gary Mack testified before the Assassination Records Review Board that he had recently been told by an executive in Kodak's Dallas office that a woman in her early 30s with brunette hair brought in film purported to be of the assassination scene while they were processing the Zapruder film.[8] According to Mack, the executive said the woman explained to federal investigators already at the film processing office that she ran from Main Street across the grass to Elm Street where she stopped and snapped a photo with some people in the foreground of the presidential limousine and the Texas School Book Depository.[8] Mack said that he was told by the Kodak executive that the photo was extremely blurry and \"virtually useless\" and indicated that the woman likely went home without anyone recording her identity.[8] After suggesting that the woman in the story may have been the Babushka Lady, Mack then told the Board: \"I do not believe that Beverly Oliver is the Babushka Lady, or, let me rephrase that, she certainly could be but the rest of the story is a fabrication.\"[8] Also appearing that same day before the ARRB as \"Beverly Oliver Massegee\", Oliver stated that she was 17 years old at the time of the assassination.[8] She told the Board that she was filming with an \"experimental\" 8 mm movie camera approximately 20 to 30 feet (6 to 9 m) from Kennedy when he was shot and that the film was confiscated by a man who identified himself as an FBI agent.[8] According to Oliver, she handed over the camera because the man was an authority figure and because she feared being caught in possession of marijuana.[8] Oliver's claims were addressed point by point and debunked by conspiracy theory researcher John McAdams.[9] See also [edit]References [edit]- ^ \"Muchmore frame\". Archived from the original on March 9, 2012. Retrieved October 9, 2003. - ^ \"Zapruder Frame 285\". Archived from the original on September 23, 2015. Retrieved September 17, 2005. - ^ \"JFK Assassination Films\". Jfk-online.com. Archived from the original on February 25, 2021. Retrieved December 3, 2009. - ^ \"JFK Assassination Films\". Jfk-online.com. Archived from the original on February 26, 2021. Retrieved December 3, 2009. - ^ a b c d e f Bugliosi, Vincent (2007). Reclaiming History: The Assassination of President John F. Kennedy. New York: W. W. Norton & Company. p. 1405. ISBN 978-0-393-04525-3. - ^ Stone, Oliver; Sklar, Zachary (1992). \"JFK: The Documented Screenplay\". JFK: The Book of the Film : The Documented Screenplay. New York: Applause Books. pp. 119–121. ISBN 9781557831279. Retrieved June 7, 2012. - ^ a b Appendix to Hearings before the Select Committee on Assassinations of the U.S. House of Representatives. Vol. VI Photographic Evidence. Washington, D.C.: United States Government Printing Office. 1979. p. 13. Archived from the original on April 17, 2008. Retrieved June 9, 2012. - ^ a b c d e f g United States of America Assassination Records Review Board: Public Hearing. Washington, D.C.: United States Government Printing Office. November 18, 1994. pp. 25–26, 41–43. Archived from the original on January 19, 2023. Retrieved June 9, 2012. - ^ [1]"
}