{
  "url": "https://revistacasaejardim.globo.com/arquitetura/noticia/2025/09/arquitetura-colonial-brasil.ghtml",
  "title": "Arquitetura colonial no Brasil: características, exemplos e cidades históricas",
  "text": "Arquitetura colonial no Brasil: características, exemplos e cidades históricas Desenvolvida entre os anos de 1500 e 1822, ela traz elementos de diversos estilos vindos da Europa, além de influências africanas e indígenas A arquitetura colonial é aquela que se desenvolveu no Brasil entre 1500, o ano da chegada dos portugueses, e 1822, quando ocorreu a Independência do país. Segundo o arquiteto Jill Castilho, ela traz uma mistura dos estilos renascentista, maneirista, barroco e rococó vindos da Europa. \"Porém, com grandes adaptações às condições locais e sociais do Brasil, e com influências africanas e dos povos originários\", diz. De acordo com a arquiteta Adriane Acosta Baldin, professora do curso de Arquitetura e Urbanismo do Centro Universitário Belas Artes, em São Paulo, como o território nacional é extenso, há diferentes técnicas construtivas na arquitetura colonial, em função do clima, dos materiais e mão de obra disponível em cada região. \"As técnicas construtivas vindas com os portugueses eram ensinadas aos nativos, indivíduos que faziam as obras. Em algumas localidades, como o Vale do Paraíba, até o século 18 predominavam técnicas e práticas indígenas, como o uso de redes dentro das casas. Já a mão de obra africana trouxe um conhecimento construtivo das técnicas milenares em barro cru, como o adobe [tijolos de terra crua] e as taipas\", detalha Adriane. Características da arquitetura colonial brasileira As construções eram simples, geminadas e implantadas em terrenos retangulares, prática ainda presente nos traçados urbanos das cidades brasileiras que se configura como uma forte herança colonial. Os materiais mais utilizados eram madeira, pedra, adobe, taipa de mão, taipa de pilão, telhas de barro, azulejos e ladrilhos hidráulicos portugueses. As edificações eram construídas alinhadas às ruas, com grandes janelas em simetria. \"As casas no estilo colonial eram estreitas e alongadas, sem recuos laterais, sendo construídas de forma enfileirada. Nem todos os cômodos apresentavam aberturas para iluminação e ventilação naturais, apenas os ambientes que se localizavam na fachada e no fundo\", descreve Jill. O arquiteto Mateus Rosada, professor de Arquitetura da Universidade Federal de Minas Gerais (UFMG) e coordenador do Museu da Escola de Arquitetura (MARQ), explica que os imóveis tinham paredes caiadas (mistura rústica de cal e água) e eram predominantemente brancas, com janelas e portas em cores como azul, vinho, marrom, verde e preto. As residências tinham também telhados de duas águas, feitos com estrutura de madeira e telhas de barro aparentes. \"Geralmente eram térreas, tinham pouquíssimos sobrados. As cidades que tinham muitos sobrados eram cidades ricas, geralmente capitais. Elas também não tinham porão, ficavam na altura do chão e seguiam o desnível do terreno. Se era inclinado, 'caiam' para o fundo ou para frente\", ele detalha. Outros elementos característicos eram o arco batido das janelas, as cornijas (moldura saliente que serve de arremate superior à fachada de um edifício), os cunhais (pilastras localizadas na quina de uma construção), e os grandes beirais de madeira e varandas para trazer sombra e mais ventilação às edificações. O vidro era pouco usado, visto que o material era importado e bastante caro, além de ser difícil de transportar a longas distâncias. Para dar maior privacidade às residências, usavam-se postigos (janelinha em portas ou janelas), rótulas (painel de madeira com ripas) e muxarabis, elemento de origem árabe, dando maior fechamento às aberturas. Os pisos eram de tijolos, mas se usava também piso de pedra — mosaico, seixo rolado ou capistrana (grandes lajes de pedra) — e de terra batida. Os assoalhos de madeira eram mais comuns em casas de pessoas abastadas. O telhado da maior parte das edificações era de telha de barro, e os forros, de madeira, o que ajudava a diminuir o calor dentro dos imóveis. Como o Brasil era uma colônia, não existiam palácios ou edifícios públicos com grandes ornamentações externas. \"A ornamentação, na maior parte das vezes, estava por dentro, nas casas mais nobres, com pinturas nos tetos, e nas edificações religiosas\", fala Mateus. O interior das residências era rústico, com pouca mobília. Os acabamentos eram mais simples, com poucos ornamentos, normalmente talhados em madeira. “No período colonial, a morada do brasileiro era um lugar austero, privado de conforto. Do século 16 até meados do 19, as casas brasileiras não ofereciam muita novidade\", escreve Adriane em seu livro Maria do Brasil, as moradas da santa de barro. \"Seus poucos móveis eram feitos de madeira maciça que eram extraídas das florestas próximas. Em algumas casas, de famílias mais abastadas, era possível ver modestas louças importadas da Europa e alguma mobília mais refinada, como um banco de madeira torneada com palhinha no encosto\", continua a arquiteta na obra. Exemplos da arquitetura colonial brasileira Para mergulhar na arquitetura colonial, os especialistas indicam cidades que preservam muitos elementos desta época e que valem a visita: - Alagoas: Penedo. - Bahia: Salvador, que já foi capital do Brasil, e as cidades de Cachoeira e Rio de Contas. - Goiás: as cidades que nasceram da exploração do ouro na região, como Cidade de Goiás (antiga capital do Estado), Pirenópolis, Corumbá de Goiás, Goiás Velho, Vila Boa de Goiás, Pilar de Goiás e Jaraguá. - Maranhão: São Luís. - Minas Gerais: Ouro Preto, Mariana, São João del-Rei, Diamantina, Tiradentes, Catas Altas, Santa Bárbara e Barão de Cocais. - Pernambuco: Olinda. - Rio de Janeiro: Paraty. - São Paulo: Santana do Parnaíba, São Luís do Maraitinga e Iguape. Entre os monumentos e construções do período colonial, a obra pública mais importante feita no Brasil foi o aqueduto da Carioca, atual Arcos da Lapa, para abastecimento de água na cidade do Rio de Janeiro. \"Podemos citar, ainda, as igrejas mineiras de São Francisco de Paula, em Ouro Preto, e o Santuário do Bom Jesus de Matosinhos, em Congonhas. Uma residência importante é a casa da Chica da Silva, em Diamantina, que tem muxarabis em sua fachada\", fala a arquiteta Adriane. Jill destaca a Igreja de Nossa Senhora da Glória do Outeiro, no Rio de Janeiro; o Palácio dos Governadores, em Olinda; e as igrejas Nossa Senhora do Pilar, São Francisco de Assis e Nossa Senhora da Conceição de Antônio Dias, todas em Ouro Preto. Mateus aponta como locais históricos importantes o centro histórico de Belém do Pará, chamado de Feliz Lusitânia; a Casa dos Contos, em Ouro Preto, que foi fundição e residência de um funcionário público importante; e o Museu Wanderley Pinho, na cidade de Candeias, um antigo engenho de açúcar que se chamava Engenho Freguesia. \"Mas há inúmeros exemplos de casinhas que têm uma porta, uma janela, o telhado que cai só para frente e para o fundo, encostadas nas vizinhas, sem corredor lateral. Esse era o tipo mais comum de residência que tínhamos\", ele aponta. Arquitetura colonial atualmente Hoje, ainda podemos encontrar elementos arquitetônicos inspirados no período colonial, chamados de neocoloniais. \"Telhados com estruturas de madeira aparente, portas e janelas de madeira. Elementos ornamentais decorativos em fachadas, como também requadros, ainda são frequentemente utilizados\", afirma Jill. Já as técnicas em terra crua estão sendo retomadas por alguns profissionais por questões de sustentabilidade. \"Os cobogós e elementos vazados, muito usados na arquitetura moderna e contemporânea, guardam semelhanças e inspiração nas rótulas e muxarabis de origem árabe, presentes nas cidades coloniais brasileiras\", diz Adriane. Além disso, segundo Mateus, a arquitetura do movimento moderno brasileiro se inspirou na arquitetura colonial. \"O Brasil é o único país onde a arquitetura moderna tem painéis decorativos de azulejos. Isso era algo da cultura luso-brasileira, vinda de Portugal, os chamados painéis coloniais. E a arquitetura moderna vai fazer painéis com Candido Portinari\", exemplifica."
}