{
  "url": "https://support.google.com/youtubemusic/answer/6313529?hl=pt-BR",
  "title": "O que é o YouTube Music? - Ajuda do YouTube Music",
  "text": "Com o app YouTube Music, você assiste clipes, se conecta com seus artistas preferidos e descobre músicas e podcasts para ouvir em todos os seus dispositivos. How to use and navigate the YouTube Music App to customize your listening experience Observação: a experiência na plataforma pode ser um pouco diferente dependendo do país ou da região em que o usuário está. YouTube Music com anúncios O YouTube Music funciona mesmo sem uma assinatura paga. Na versão com anúncios, você pode: - reproduzir podcasts, músicas e vídeos on demand; - acessar somente o áudio, reproduzir em segundo plano e baixar a maioria dos podcasts; - colocar na fila, repetir e pular quantas vezes quiser; - acessar a guia \"Descobertas\"; - usar a sintonia musical; - ganhar selos de fã, como o de maior ouvinte. YouTube Music Premium Com o YouTube Music Premium, você tem acesso a todos os recursos listados acima, além de benefícios exclusivos para assinantes que incluem: - Tocar música em segundo plano - Músicas sem anúncios - Reprodução de música somente em áudio - Download de músicas Atualmente o YouTube Music está disponível nestes países ou regiões. Conheça os benefícios do YouTube Music Premium ou assine o serviço. Os assinantes do YouTube Music Premium ainda podem receber anúncios em podcasts. Observação: - Alguns recursos do YouTube Music não estão disponíveis em contas supervisionadas. Acesse este link e saiba mais sobre as experiências supervisionadas no YouTube. - Branding ou promoções incorporadas em podcasts pelo criador de conteúdo ainda podem aparecer para membros do YouTube Music Premium e do YouTube Premium. Se adicionados ou ativados pelo criador de conteúdo, também aparecerão links promocionais, seções e outros recursos dentro e fora do conteúdo. Anúncios ou promoções também podem aparecer nos canais do Primetime ou durante eventos ao vivo transmitidos no YouTube, como os esportivos."
}