{
  "url": "https://cris.parks.ny.gov/",
  "title": "Cultural Resource Information System (CRIS)",
  "text": "Cultural Resource Information System Legal Disclaimer The New York State Historic Preservation Office (SHPO) disclaims any express or implied warranty with regards to the information found in CRIS database. Although the information found in CRIS has been produced and processed from sources believed to be reliable, no warranty express or implied is made or assumed regarding accuracy, completeness, legality, reliability or usefulness of any such information. The SHPO provides this information on an \"as is\" basis. The user specifically acknowledges that the SHPO is not liable in any way with respect to the use of any such information, and that the risk of injury from any use of the information found in these web pages rests entirely with the user. It is recommended that careful attention be paid to the contents of any information provided in these web pages, and that the SHPO be contacted with any questions regarding the data and appropriate use. Viewing this material does not constitute \"consultation\" with the SHPO under section 106 of the National Historic Preservation Act of 1966 or Section 14.09 of the New York State Historic Preservation Act. Viewing this material does not constitute \"consultation\" with the SHPO under section 106 of the National Historic Preservation Act of 1966 or Section 14.09 of the New York State Historic Preservation Act. As a convenience to our users, the SHPO offers links to web sites created and maintained by other public and private entities. These links are provided as an information resource only. Links to other computer systems are not supervised nor reviewed by the SHPO. Any information, endorsements, or products or services, materials or personal opinions appearing on such external sites are not controlled, sponsored nor approved by the SHPO. The user specifically acknowledges that the SHPO is not liable for defamatory, offensive, or illegal conduct of other users, links or third parties and that the risk of injury from the foregoing rests entirely with the user."
}