{
  "url": "https://en.wikipedia.org/wiki/Dole_plc",
  "title": "Dole plc - Wikipedia",
  "text": "Dole plc Dole plc (previously named Dole Food Company and Standard Fruit Company) is an Irish-American agricultural multinational corporation headquartered in Dublin, Ireland. The company is among the world's largest producers of fruit and vegetables, operating with 38,500 full-time and seasonal employees who supply some 300 products in 75 countries.[2][3] Dole reported 2021 revenues of $6.5 billion.[2][3] As of 2021, the company had approximately 250 processing plants and distribution centers worldwide in addition to 109,000 acres (44,000 ha) of farmland and real estate. The company operates through four segments: Fresh Fruit (bananas and pineapples; about 35% of 2020 revenues); Diversified Fresh Produce in Europe, the Middle East, and Africa; Diversified Fresh Produce in the Americas and other world regions (combined 37% of 2020 revenues); and Fresh Vegetables (29% of 2020 revenues).[2][4] Dole grows and markets bananas, pineapples, grapes, berries, deciduous and citrus fruits, and vegetable salads.[4] Dole operates a 13-vessel shipping line for importing its produce and exporting third-party goods to Central America.[3][4][5] The multinational company PepsiCo sells bottled fruit beverages under license using the Dole brand.[6] Dole has a comarketing agreement with The Walt Disney Company to encourage the public, including children, to consume fruits and vegetables.[7] History [edit]1851–1900: Early years [edit]Dole plc traces its origins to the foundation of Castle & Cooke in 1851, and Charles McCann's Fish, Fruit and Vegetable Market in the 1850s in Ireland.[8][9] Castle & Cooke, a sugar and logistics company, was founded in Hawaii by Amos Starr Cooke and Samuel Northrup Castle.[10] 1900–1969: Expansion and acquisition [edit]In 1899, industrialist James Dole moved to Hawaii. James was the cousin of Sanford B. Dole, who had helped overthrow the Kingdom of Hawaii in 1893, and became the governor of Hawaii in 1898.[11] Two years after James Dole's arrival, he formed the Hawaiian Pineapple Company (HPC). The HPC delivered its first shipment of canned pineapple in 1903.[12] Early products of the Hawaiian Pineapple Company were not marketed under a particular brand name, often assuming the names of the distributors.[13]: 150 In the early 20th century, pineapple was still relatively unknown, and James Dole and other growers mounted a marketing campaign in magazines in what the company now refers to as one of the first nationwide advertising campaigns in the United States.[14] The company made technological advances in the early decades of the 20th century in processing the fruit—most notably the Ginaca Machine, created in 1911—that made canning pineapple commercially viable.[15] In 1922, Dole purchased the Hawaiian island of Lanai and turned it into the largest pineapple plantation in the world.[16] The same year, Castle & Cooke acquired 33% of the company via lease agreement. In 1927, the HPC began stamping its cans with the Dole brand name, with numbers to indicate the grade. These stamps ensured the Dole name would still be visible even if the label was changed by a distributor.[13]: 151, 154 By the end of the 1920s, the company grew more than 75% of all pineapples in the world. However, the Hawaiian Pineapple Company struggled to stay financially sound during the Great Depression and Castle & Cooke took control of it in 1932.[17][13]: 149 The HPC was renamed the \"Dole Company\" and became a subsidiary of Castle & Cooke in 1961. Two years later, the company began expanding its fruit growing operations into southeast Asia, opening plantations and canneries in the Philippines and Thailand.[15] While the HPC was getting established, the tropical fruit trade was growing in Central and South America, primarily with the banana trade. One of the major players in that trade, the Standard Fruit and Steamship Company, was established in 1906 by the Vaccaro brothers and Salvador D'Antoni as Vaccaro Brothers and Company. However, the quartet had been making shipments of tropical fruit such as bananas and coconuts, as well as other items, since 1899.[18]: 2, 4, 16 The firm grew rapidly in its early years, establishing a headquarters in La Ceiba, Honduras, purchasing housing and cargo ships, and building rail and telephone lines at its plantations.[18]: 14,16 The company's rapid growth has been attributed to the destruction of property records in the early 20th century, leading the firm to take control of large swaths of land with the support of the Honduran government.[19]: 145 In 1924, the firm went public as the Standard Fruit and Steamship Company.[18]: 91-92 In the 1920s, as Panama disease was destroying crops of the Gros Michel banana, Standard Fruit began looking for other cultivars to grow, settling on the Cavendish banana. Switching to the Cavendish allowed Standard Fruit to become the largest banana producer in the world by the 1960s.[20] Standard Fruit merged with Castle & Cooke in 1968.[18]: 292-293 While these companies were forming in the United States, the McCanns expanded their operations in Ireland, opening a store in Dundalk in 1902.[21] In the 1950s, the McCanns began consolidating with other companies in Ireland, creating United Fruit Importers and then Fruit Importers of Ireland, which became a publicly traded company.[22] 1970–2000: Expansions, selloffs, and splits [edit]Ten years after its merger with Standard Fruit, Castle & Cooke acquired Bud Antle Inc., a California-based vegetable company.[24][25] However, Castle & Cooke began to struggle financially and was purchased in 1985 by billionaire David H. Murdock.[26] After the purchase, Dole began expanding its offerings by purchasing other food companies, buying several West Coast fruit and nut producers and distributors between 1985 and 1990, including Bonner Packing Company in California and Wells and Wade Fruit Company in Washington.[27] Meanwhile, in Ireland, Fruit Importers of Ireland purchased Fyffes from Chiquita in 1986.[22] In 1985, the Hawaiian island of Lanai passed into the control of Castle & Cooke, which was then the owner of Dole. High labor and land costs led to a decline in Hawaii pineapple production in the 1980s, with Dole phasing out its pineapple operations on Lanai in 1992.[28] Murdock separated Dole and Castle & Cooke in 1996, turning the latter into a real estate development company.[29] 2000–present: Recovery and merger with Total Produce [edit]In the early 2000s, Dole struggled financially and was nearly bankrupt.[30] Murdock rescued the company, which had been publicly traded, and took it private in 2003.[26] During this same period, lawsuits related to the use of the pesticide DBCP were filed against Dole. The company, along with Shell and Dow Chemical Company, was ordered by a court in Managua, Nicaragua, to pay banana workers $489.4 million in 2003, but the companies declined to pay the fine.[31] In 2007, a California judge awarded $2.3 million to Nicaraguan banana workers who sued Dole for its DBCP use. However, the ruling was overturned in 2010, with another judge noting a lack of evidence connecting the workers to Dole plantations and fraud committed by the plaintiffs' lawyers.[32] Swedish filmmaker Fredrik Gertten made a documentary about the latter lawsuit, entitled Bananas!*, which led to a defamation lawsuit by Dole.[33] Dole lost the suit and was ordered to pay the filmmakers SEK 1,400,000.[34] Gertten made a follow-up documentary about the defamation suit that premiered in 2012, entitled Big Boys Gone Bananas!*.[35] Total Produce was spun off from Fyffes in 2006 as a fresh fruit and vegetable business separate from the tropical fruits business of Fyffes.[9] Upon establishment, the firm was one of the largest produce companies in Europe, leading in Ireland, Spain, Sweden, Denmark, and the Czech Republic.[36] In 2007, Total Produce expanded further into the United Kingdom, purchasing British firm Redbridge Holdings for £11.75 million.[37] In 2009, Dole was sued by families of banana workers in Colombia, who alleged that the company had bankrolled militias that killed thousands of Colombians, including trade union organizers.[38] The suit was dismissed with prejudice the following year.[39][40] Murdock took Dole public again in 2009, raising $446 million in the process.[41] In 2012, Dole reached a deal to sell its packaged food division and Asian fresh produce operations to the Japanese firm Itochu for $1.7 billion,[42] with the purchase concluding in April 2013.[43] As part of the Itochu deal, the Dole brand continued to be used for some packaged food products worldwide and fresh produce in Asia, Australia and New Zealand, although the Dole Food Company had no business involvement for these products.[42][43] In August 2013, Murdock reacquired Dole as a private company at a valuation of $1.6 billion.[44] He and Dole Food Company President Michael Carter were later sued by investors for undervaluing the company during the Itochu deal, and in 2015, a judge in Delaware ordered the pair to pay shareholders $148 million for intentionally lowering the value of Dole stock prior to the buyout.[45] Total Produce purchased a 45% stake in the Dole Food Company in 2018, and merged with Dole in 2021 to form Dole plc.[9][46] Dole plc (NYSE: DOLE) began trading on the New York Stock Exchange in July 2021.[47] Operations [edit]Covering five continents, Dole has 109,000 acres (44,000 ha) of its own farmland, 13 cargo vessels, five manufacturing plants, 75 packing houses and 160 distribution centers.[4] Dole is a vertically integrated producer, owning plantations in Central America.[48] Its container ships are specially equipped with refrigerated containers, and use their own cranes instead of relying on port infrastructure.[4][49] Management [edit]As of 2021, Rory Byrne is CEO, Carl McCann is chairman, and Johan Lindén is chief operating officer.[2] Headquarters [edit]Following the 2021 merger with Total Produce, Dole plc has world headquarters in Dublin, Ireland, and US headquarters in Charlotte, North Carolina.[4] Public relations [edit]The Guinness Book of World Records (2007) lists the pineapple maze at the Dole Plantation on Oahu, Hawaii as the world's largest maze.[50] Bobby Banana, a mascot of Dole plc, is an anthropomorphic banana who appears in Dole comics and games for children.[51] Products [edit]Including pineapples, Dole products include some 300 fresh plant foods as whole deciduous and citrus fruits, berries, and fresh-cut vegetables; salad products include greens, salad kits, and shreds.[4][52][53][54] Brand licensing [edit]As of 2022, Dole has a brand licensing arrangement with The Walt Disney Company for fruits and vegetables branded with Disney, Pixar, Marvel, and Star Wars fictional characters to encourage produce consumption among children, such as using stickers on bananas.[7][55] The arrangement includes cobranded recipes featuring Disney films, including Star Wars: The Force Awakens and Frozen II.[7][55][56] The Dole brand is also under license with Pepsico for bottled fruit beverages.[6] Food safety [edit]As Dole products include fruits and vegetables grown in open fields, Dole uses rigorous food safety procedures under Good Agricultural Practices for its own farms and those of contract growers.[57] In California, Dole is a certified member of the Leafy Greens Marketing Agreement (LGMA), a collaboration of food scientists and safety experts, government, farmers, shippers, and processors.[57][58] Dole operates a SafetyChain system, which is a cellphone-based process for quality assurance on the farm (region, grower, and lot number), including immediate reports on non-compliance issues.[57] Over decades, Dole has initiated several recalls of its products and shut down manufacturing facilities for cleaning in response to outbreaks of foodborne illnesses, primarily related to bagged salads and leafy greens. 2000s [edit]Officials with the Minnesota Department of Health found Escherichia coli O157:H7 in Dole bagged lettuce in 2005. The outbreak infected 25 people in Minnesota, Wisconsin, and Oregon.[59] The following year, an E. coli outbreak that infected more than 200 people and killed three was traced back to a spinach processor in California which packaged spinach under the Dole brand.[60] Dole initiated a recall of the tainted spinach.[61] According to Dole personnel and the California LGMA, this 2006 E. coli outbreak led to harmonizing new rigorous farm and handling practices across the fresh produce industry to minimize microbial contamination.[57][58] 2010s [edit]Dole recalled its \"Seven Lettuces\" salads in 2012 after random testing by New York health officials found salmonella in the salads.[62] The same year, the company issued two recalls of its bagged salads due to contamination by Listeria monocytogenes.[63] The company initiated another recall due to contamination by L. monocytogenes in 2014.[64] The following year, Dole recalled bagged spinach due to contamination with salmonella following safety testing conducted by the United States Food and Drug Administration at a plant in Springfield, Ohio.[65] In 2016, an outbreak of listeriosis tied to the Springfield plant led to the hospitalization of 33 people and four deaths. The plant closed for four months that year, and later reporting revealed Dole knew about the listeria contamination in July 2014, more than a year before the plant's closure. The United States Department of Justice initiated a criminal probe into the issue.[66] Dole settled two civil lawsuits related to the outbreak in 2017.[67] 2020s [edit]In December 2021, Dole recalled 180 varieties of packaged salad due to possible listeria contamination and closed packaging facilities in Yuma, Arizona, and Bessemer City, North Carolina, to sanitize them.[68] The outbreak led to an investigation by the Centers for Disease Control and Prevention after two people died and 17 became ill.[69] References [edit]- ^ Dole: Company History Archived November 17, 2007, at the Wayback Machine (Retrieved November 29, 2007) - ^ a b c d e f \"Profile - Dole plc\". Yahoo! Finance. 15 September 2022. Retrieved 15 September 2022. - ^ a b c \"SEC Form 20-F; Dole plc for the fiscal year ended 31 December 2021\". United States Securities and Exchange Commission. 22 March 2022. pp. 24–25, 38. Retrieved 1 June 2022. - ^ a b c d e f g \"Dole plc: Our Commercial Strengths\". Dole plc Corporate Website. 2022. Retrieved 15 September 2022. - ^ Manion BC (21 September 2021). \"Port Tampa Bay's impact is far-reaching\". The Laker/Lutz News. Retrieved 1 June 2022. - ^ a b \"Pepsico partners\". PepsiCo. 2022. Retrieved 6 November 2022. - ^ a b c \"Dole-Disney partnership: The one time you want a mouse on your produce\". The Produce News. 19 October 2019. Retrieved 6 November 2022. - ^ \"The History of Dole plc\". Dole plc. Retrieved 2 June 2022. - ^ a b c \"History and Growth\". Total Produce. Retrieved 7 June 2022. - ^ Nellist, George F., ed. (1925). The Story of Hawaii and Its Builders. Honolulu, Hawaii: Honolulu Star-Bulletin. pp. 87–91. Retrieved 2 June 2022. - ^ \"Hawaiian Monarchy Overthrown; Territory of Hawaii\". Nisei Veterans Legacy. 2022-08-31. Retrieved 2023-04-01. - ^ Rhodes, Jesse (20 March 2013). \"It's Pineapple Season, But Does Your Fruit Come From Hawaii?\". Smithsonian Magazine. Retrieved 2 June 2022. - ^ a b c Hawkins, Richard A. (2007). \"James D. Dole and the 1932 Failure of the Hawaiian Pineapple Company\" (PDF). The Hawaiian Journal of History. 41: 149–170. Retrieved 7 June 2022. - ^ Leigh, Wendy (12 May 2022). \"The Real Reason Americans Often Associate Pineapples With Hawaii\". Tasting Table. Retrieved 17 May 2022. - ^ a b Trumbull, Robert (21 December 1980). \"Perhaps you hadn't heard, but Hawaii almost lost its pineapples\". The New York Times. Retrieved 1 June 2022. - ^ Paiva, Derek (4 November 2009). \"End of an era: Maui Land & Pineapple closing its pineapple operations\". Hawaii Magazine. Retrieved 18 May 2022. - ^ Eriksmoen, Curt (24 January 2016). \"North Dakota native leads Hawaiian company\". The Bismarck Tribune. - ^ a b c d Karnes, Thomas L. (1978). Tropical enterprise : the Standard Fruit and Steamship Company in Latin America. Baton Rouge, Louis.: Louisiana State University Press. ISBN 978-0-8071-0395-1. Retrieved 2 June 2022. - ^ Koeppel, Dan (2008). Banana: The Fate of the Fruit that Changed the World. New York: Hudson Street Press. ISBN 9781101213919. Retrieved 7 June 2022. - ^ Shedd, Karin (19 April 2019). \"The banana business of Chiquita, Fresh Del Monte, and Dole is at risk due to a deadly fungus\". CNBC. Retrieved 9 June 2022. - ^ \"One of Dundalk's most successful and extraordinary businessmen\". Irish Independent. 3 August 2011. Retrieved 7 June 2022. - ^ a b \"Elder statesman of Irish business\". The Irish Times. 30 July 2011. Retrieved 7 June 2022. - ^ \"Dole Completes Spinoff of Real Estate, Resorts\". Los Angeles Times. 1996-01-09. Retrieved 2026-02-03. - ^ Keppel, Bruce (8 October 1988). \"California marketers stalk big bucks in celery\". Los Angeles Times. Retrieved 6 June 2022. - ^ Crittenden, Ann (27 November 1980). \"The Big Business of Lettuce\". The New York Times. Retrieved 2 June 2022. - ^ a b Chaudhuri, Saabira; Jargon, Julie (12 August 2013). \"Dole Food Agrees to $1.2 Billion Buyout Offer\". The Wall Street Journal. Retrieved 16 March 2022. - ^ Koepppel, Dan (20 October 1990). \"Dole Wants The Whole Produce Aisle; Branded fruits and vegetables are turning the nation's supermarkets into Dole country\". Adweek. - ^ Dipietro, Ben (4 October 1992). \"'Pineapple Island' Residents See Way of Life Vanishing: Development: Farming is being phased out on Lanai and resorts are the new economic base. Many islanders prefer the old lifestyle\". Los Angeles Times. Retrieved 8 May 2025. - ^ de la Merced, Michael J. (25 April 2017). \"Dole Looks to Return to Stock Markets, Again\". The New York Times. Retrieved 17 May 2022. - ^ Mohan, Geoffrey (August 30, 2017). \"Dole, the world's largest fresh fruit and vegetable company, is stepping back from Southland\". Los Angeles Times. Retrieved June 1, 2022. - ^ Gonzalez, David; Loewenberg, Samuel (18 January 2003). \"Banana Workers Get Day in Court\". The New York Times. Retrieved 9 June 2022. - ^ Kim, Victoria (16 July 2010). \"Judge throws out verdict awarding millions to Dole workers\". Los Angeles Times. Retrieved 17 March 2022. - ^ Keating, Gina (8 July 2009). \"Dole sues \"Bananas\" documentary maker\". Reuters. Retrieved 18 May 2022. - ^ Mlik, Nora (16 January 2013). \"The movie \"Bananas\" won against Dole\". Dagens Nyheter (in Swedish). Archived from the original on 16 January 2013. Retrieved 17 March 2022. - ^ Monk, Katherine (28 January 2012). \"Free speech, corporate lies and bananas; Hard-hitting documentary tells how Swedish filmmaker and Canadian producer took on the big boys at Dole Food Company\". Ottawa Citizen. - ^ \"Fruitful strategy\". The Irish Times. 6 April 2007. Retrieved 22 July 2022. - ^ Keena, Colm (13 January 2007). \"Total purchase boosts share price\". The Irish TImes. - ^ Meyer, Bill (28 April 2009). \"Suit claims Dole Foods bankrolled Colombian death squads to kill labor organizers, farmers\". Cleveland.com. Retrieved 18 May 2022. - ^ \"Suit linking Dole to Colombia militias dismissed\". Cleveland.com. Associated Press. 17 September 2010. Retrieved 18 May 2022. - ^ Crowe, Deborah (17 September 2010). \"Worker Lawsuit Against Dole Dismissed\". Los Angeles Business Journal. Retrieved 25 July 2022. - ^ Hoffman, Liz (27 August 2015). \"Dole Executives Ordered to Pay $148 Million in Buyout Lawsuit\". The Wall Street Journal. Retrieved 16 March 2022. - ^ a b Sheldrick, Aaron (17 September 2012). \"Dole Food sells two businesses to Itochu for $1.7 billion\". Reuters. Retrieved 16 March 2022. - ^ a b \"Itochu completes purchase of Dole businesses\". Food Business News. 2 April 2013. Retrieved 20 October 2022. - ^ \"David H. Murdock Completes Acquisition of Dole Food Company, Inc\". Businesswire. 1 November 2013. Retrieved 20 October 2022. - ^ Chase, Randall (August 27, 2015). \"Dole Food CEO, former top exec ordered to pay $148M\". Associated Press. Retrieved May 27, 2022. - ^ O'Brien, Ciara (2 February 2018). \"Total Produce to buy stake in Dole Food Company for $300m\". The Irish Times. Retrieved 17 May 2022. - ^ Lucas, Amelia (30 July 2021). \"Dole stock slides 9% in public market debut on New York Stock Exchange\". CNBC. Retrieved 18 May 2022. - ^ Wang, Dan. \"Meet Dole, the World's Full-Stack Banana Company\". Flexport. Retrieved 5 January 2016. - ^ \"Vessels\". Dole Ocean Cargo. Archived from the original on 6 December 2015. Retrieved 5 January 2016. - ^ \"Dole Plantation – Hawaii's Complete Pineapple Experience – Maze\". Dole Plantation, Inc. Archived from the original on 2008-01-21. Retrieved 2008-02-14. - ^ \"Dole surprises LA youth art director with 'Everyday Hero' honors\". Produce Blue Book. 24 June 2022. Retrieved 13 October 2022. - ^ Trentmann, Nina (21 December 2021). \"Dole Looks for Deals and Operational Efficiency After NYSE Listing\". The Wall Street Journal. Retrieved 13 May 2022. - ^ Garcia, Tonya (30 July 2021). \"Dole IPO: 5 things to know about the newly-public fruit and vegetable giant\". MarketWatch. Retrieved 17 May 2022. - ^ Hersko, Tyler (7 February 2018). \"Irish company Total Produce buys 45 percent stake in Dole Food Co\". Ventura County Star. Retrieved 17 May 2022. - ^ a b Bhattarai, Abha (18 October 2016). \"Can Cinderella and Elsa convince kids to eat vegetables?\". The Washington Post. Retrieved 7 June 2022. - ^ Faughnder, Ryan (21 November 2019). \"'Frozen 2' will be a box office monster. But can it top the first one?\". Los Angeles Times. Retrieved 7 June 2022. - ^ a b c d Lisa Lupo (10 October 2013). \"Dole fresh vegetables\". Quality Assurance and Food Safety. Retrieved 21 October 2022. - ^ a b \"Certified members\". California Leafy Greens Marketing Agreement. 2022. Retrieved 21 October 2022. - ^ Murphy, Joan (17 October 2005). \"Minnesota finds E. coli in lettuce bags\". The Produce News. Archived from the original on 8 February 2009. Retrieved 17 March 2022. - ^ Parsons, Larry (24 March 2007). \"Inside the CDC's report on the deadly E. coli spinach outbreak\". Santa Cruz Sentinel. Archived from the original on 30 September 2007. Retrieved 8 June 2022. - ^ Newman, Jesse; Brat, Ilan (22 January 2016). \"Listeria Outbreak Linked to Dole Salads From Ohio Facility\". The Wall Street Journal. Retrieved 17 March 2022. - ^ \"Dole Recalls Bagged Salads For Salmonella Risk\". NPR. Associated Press. 15 April 2012. Archived from the original on 1 May 2012. Retrieved 8 June 2022. - ^ Jaslow, Ryan (24 August 2012). \"Dole Italian Blend salads recalled after positive Listeria test\". CBS News. Retrieved 8 June 2022. - ^ Marler, Bill (2 May 2016). \"Publisher's Platform: Will the Justice Department look at Dole's history of recalls and outbreaks?\". Food Safety News. Retrieved 18 March 2022. - ^ Bacon, John (14 October 2015). \"Salmonella risk: Dole recalls spinach in 13 states\". USA Today. Retrieved 8 June 2022. - ^ Strom, Stephanie (29 April 2016). \"Dole Knew About Listeria Problem at Salad Plant, F.D.A. Report Says\". The New York Times. Retrieved 17 May 2022. - ^ Sanctis, Matt (28 April 2017). \"Dole settles civil suits related to listeria outbreak\". Springfield News-Sun. Retrieved 8 June 2022. - ^ Treisman, Rachel (23 December 2021). \"Fresh Express and Dole recall hundreds of salad products over listeria concerns\". NPR. Retrieved 8 June 2022. - ^ Sealy, Amanda (3 February 2022). \"Two dead from Listeria outbreak linked to Dole packaged salads, CDC says\". CNN. Retrieved 8 June 2022. External links [edit]- Media related to Dole Food Company at Wikimedia Commons - Official website - Business data for Dole plc: - Dole plc - 1851 establishments in Hawaii - 2013 mergers and acquisitions - Agriculture companies of Ireland - Banana production - Business in Hawaii - Companies based in Dublin (city) - Companies listed on the New York Stock Exchange - Dole family - Food and drink companies established in 1851 - Fruit production - Multinational companies headquartered in the Republic of Ireland - Multinational food companies - Pineapple production - Tax inversions - American companies established in 1851 - Banana production in the United States"
}