{
  "url": "https://coloradomountaindogs.com/what-is-a-colorado-mountain-dog",
  "title": "What is a Colorado Mountain Dog/Caspian Mountain Dog? — Colorado Mountain Dogs",
  "text": "What Is A Caspian Mountain Dog, Colorado Mountain Dog? Contact:. Wendy Francisco, Breed Founder - coloradomountaindogs@gmail.com Anne Larson, CMDR Registrar - cmdrregistrar1@gmail.com What is a Caspian Mountain Dog? The Colorado Mountain Dog is the developmental stage of the Caspian Mountain Dog. For a decade and a half, thousands of these dogs have spread across the country. We’ve pulled in the desired traits from landrace LGDs. Our breeders have prioritized function, temperament, intelligence, guarding abilities, and small farm suitability, over what the dogs look like, though we have always kept an eye to type. Caspian Mountain Dogs are Colorado Mountain Dogs who have met standard. CASP designations go to dogs that meet both function and type, owned by the farms that have supported the CMDR in spirit, and have enthusiastically helped our staff to learn and educate the central vision through every stage of growth and change. Caspian would be proud. <3 The CMDR Colorado Mountain Dog is the genetically diverse and function based gene pool for developing the Caspian Mountain Dog, which is close to breed standard in both type and function- being developed as a livestock guardian for use on small farms - less barking, wandering, and less aggressive towards people it doesn’t know. The CMDR is the registry doing the genetic development of the CMD, directed by the breed founder. The CMD began in 2008, with a single dog, Caspian, just as the Morgan Horse breed was developed from the careful lines crosses of a single stud. Caspian had a wonderful combination of working aptitudes which made him suitable for small acreage farming. He barked and wandered less, and was accepting of people he didn’t know, as long as they didn’t pose a threat. Caspian was huge, nearly 32 at the shoulder. He was lean built, with a non-drooling muzzle, and very athletic. He was a stunning dog, and people stopped in their tracks to ask about him. Not all lines of CMDs have Caspian genetics. We continue to strive for a huge, tall, gentle dog who wanders and barks less, and who can either be kept in fields or pens. But the breed is inspired by Caspian, and by he very utilitarian cross done on ranches nationwide, of a GP and ASD. What is the actual breed cross? Though mostly Great Pyrenees x Anatolian Shepherd, the CMD is not a specific breed (designer) cross, but function bred. Although Caspian was a Pyr x Anatolian Shepherd, the dogs are being individually selected for temperament and guarding aptitudes specifically for smaller farms where barking, aggression farm visitors, and wandering can be liabilities. Currently the breed may consist of Great Pyrenees, Anatolian Shepherd, Boz, Maremma, Kuvasz, Akbash, or other livestock guardian working group breed. Dogs that pull up small percentages of other breeds in a DNA test are considered on a dog by dog basis depending on function. Many people think that any Pyr/Anatolian cross dog can be called a CMD, but that is not true. All lines of CMDs must be screened by the CMDR for the traits we are looking for, for joint and hip soundness, DNA tested, and registered with the CMDR. Many people think a Colorado Mountain Dog is a Pyr hybrid” but that is untrue. The CMD is not a “designer breed” but a function selected dog. Do CMDs accept all people? Yes and no. A CMD should greet daytime visitors in a friendly manner, but they should also discern an obvious threat and begin to protect. Does the CMD have a Physical Type? Yes. Type takes a second seat to function at this stage of development, but the physical type is based on the founding stud. Caspian was a stunning, giant dog, more slender than some LGD breeds, tall, with good bone and powerful legs and feet. The heads are more refined and non-drooling. The builds are wolflike, and not mastiff type. Read the breed standard, linked on our articles page. How Does The CMD Dog Do At Guarding? The trait which softens the CMD towards people has nothing to do with its guarding abilities. Some of our most tender people dogs are the fiercest with predators. How Widespread is the CMD? The CMDR currently has thousands of registered dogs on small farms nationwide. We are the only legitimate registry for the CMD. Notably, our pedigree database has nearly 300 unrelated dogs at the foundation dog level, FD. Our stud books are still open and we accept dogs who would fit in our program. Candidates for a CMDR foundation dog will be DNA tested, screened for joint health, and we will interview for temperament, guarding aptitudes. Contact the breed founder, email link above."
}