{
  "url": "https://www.jlmwholesale.com/our-story/",
  "title": "Our Story - JLM Wholesale",
  "text": "Company Story: In 1918 a man with a vision of the American dream walked down Gratiot Avenue with a cart in the beautiful city of Detroit. From the cart, Victor Mirku offered key cutting, scissor sharpening and other miscellaneous services to whomever walked along his path. His start was so successful that he opened up his own shop on Gratiot Avenue. He continued to offer his locksmithing services and products. After only a few years with his new business, Victor was struck down with pneumonia. Victor’s son, David V. Mirku, had to step in and help his mother manage the family business. David V. was 19 years old at the time. David V. was very devoted to the company. He worked long hours and offered the same great quality workmanship and customer service that his father did. As a result, he developed the “Mirku Lock Company” into a successful full service company. David V. Mirku married Freda Hartline in 1941 and together they raised two children, David F. and Dennis. David V. soon opened a general hardware store in the same location as his locksmithing shop, but chose to close it down in 1959 when a “supermarket type store,” K-Mart, moved in nearby. K-Mart offered wholesale prices to his customers. David V. went back to offering the quality products and services that Mirku Lock was built on. In 1961 David F. Mirku entered the family business with hopes of carrying on the family tradition. A year later he married Janet Ross and together they brought one child, Annette, into the world. Meanwhile, Dave (David F.) realized that the world was turning toward electronic security products. In 1970, Dave’s foresight became a reality for the family. Dave started “Electronic Security Systems.” This company offered new electronic products to their clients. They combined a solid locksmithing background with employees who knew electronics. Offering only the best electromechanical products and services, “ESS” soon grew into the best total security provider in S.E. Michigan. Dave’s daughter, Annette, met Ray Baldwin in high school. They married in 1983 and have two children, Kristine and Kayla. In 1984 the products that ESS had to offer were very popular. Supply was shorter than demand and factory lead times became longer. Dave and his wife Janet realized that there were few wholesale suppliers of these products. They started a new security hardware business, JLM Wholesale. Since Dave was still busy with ESS, Jan started JLM Wholesale. Since past vendor relationships were already established, JLM was able to pick from any product lines available. JLM chose only a few select manufacturers to wholesale. However, product lines were not enough. JLM had to offer each product line in depth and at wholesale prices. Sadly, in 1990 David V. Mirku passed on from pancreatic cancer. After years of hard work, Dave and Jan retired in 1997 from their respective positions. JLM Wholesale’s control was turned over to Ray Baldwin. By December of that year Ray purchased ownership of JLM Wholesale from Dave and Jan. Ray started his own path in the wholesale hardware business. In 1999 he opened a new branch of JLM in Charlotte, N.C. (JLM Wholesale S.E.) by purchasing an existing company that distributed security hardware and washroom accessories. In July 2000 JLM Wholesale launched the industry’s first and only online Internet ordering website. Featuring available In-stock quantities and Individual customer pricing with live up to date information. In 2012 JLM Wholesale opened a third branch in Plano, Texas in order to offer customers in the south central and south west United States shorter shipping lead times. As of February 1st, 2024, JLM Wholesale is now part of the Lockmasters, Inc. family. Today we are in an age of manufacturers merging, wholesalers selling direct to end users and mass merchandisers offering products to the public. JLM Wholesale supports installers and security integrators by providing the best products and technical services currently available. Quality service consists of many different things. At JLM we believe that it is a mixture of people, products, competitive prices and technical abilities. Whether pushing a cart on the sidewalks of Gratiot, providing locksmithing services to the public, selling and installing high-tech security products or wholesaling millions of dollars in security products to dealers, one thing has stayed consistent over the years – Quality."
}