{
  "url": "https://kronenbourg.com/",
  "title": "L'entreprise Kronenbourg SAS, brasseur depuis 1664",
  "text": "Brasseries Kronenbourg est fier d’avoir remporté le Grand Prix de l’Innovation Carrefour 2025 dans la catégorie Bières, Vins et Spiritueux avec 1664 Rosé. Une vraie fierté pour nos équipes. Merci à carrefour pour cette superbe mise en lumière, et un merci tout particulier aux 2,4 millions de votants qui ont pris le temps de soutenir notre boisson fruitée Dès 2026, 1664 Blonde sera brassée uniquement avec du malt issu de la filière Orge Responsable tracée, lancée en 2022 avec Soufflet Malt et Soufflet Agriculture. Cette démarche associe agriculture régénératrice, traçabilité blockchain et engagements forts pour l’environnement et les agriculteurs. En trois ans, le réseau est passé de 45 à 216 agriculteurs et couvre 5 800 hectares. À terme, 1 bière sur 10 en France sera issue de cette filière, faisant de 1664 Blonde la première bière française 100 % responsable et tracée. Chaque bouteille offrira une transparence totale via QR code : déjà plus de 370 000 consommateurs ont adopté cette expérience, confirmant l’adhésion du public à cette innovation. Somersby : après la reconnaissance des consommateurs, celle des pros Somersby franchit le cap du million de foyers acheteurs en France, seulement 8 mois après son lancement. Désormais, ce succès est aussi salué par les professionnels : la marque remporte le Trophée Innovation LSA dans la catégorie Boissons alcoolisées, une distinction qui récompense les innovations les plus marquantes de la grande consommation. Cette reconnaissance met en avant le caractère innovant de Somersby : des recettes originales développées à la brasserie d’Obernai, un rituel de dégustation inédit avec glaçons pour un rafraîchissement maximal, et un univers visuel pop et coloré qui bouscule les codes du rayon et séduit une nouvelle génération de consommateurs. Ce double succès, auprès du grand public comme des experts, conforte notre ambition de révolutionner le segment des bières fruitées et aromatisées. Bravo aux équipes mobilisées et aux enseignes de la grande distribution qui font vivre Somersby en rayon Nous sommes brasseurs en Alsace depuis 1664 et la filiale française du Groupe Carlsberg depuis 2008. Depuis plus 350 ans, nous travaillons avec passion à parfaire notre art pour le plaisir des amateurs de bière. Construite en 1969, notre brasserie d'Obernai est la plus grande brasserie de France avec plus de 70 hectares de surface. Grimbergen et Anosteké rejoignent l’expérimentation ReUse avec Citeo : une nouvelle étape vers le réemploi à grande échelle Dès août 2025, Brasseries Kronenbourg, en partenariat avec la Brasserie du Pays Flamand, participe à l’expérimentation ReUse coordonnée par Citeo dans quatre régions pilotes. Deux bières emblématiques, Grimbergen Blonde et Anosteké Blonde, seront proposées dans une bouteille standard de 75cl réemployable. Cette initiative inédite s’inscrit dans notre programme « Agir pour demain » et notre stratégie de décarbonation, avec l’objectif de démocratiser le réemploi en grande distribution. Avec 62 % de nos émissions de CO₂ liées au packaging, développer des solutions circulaires est plus que jamais une priorité. Déployée dans les Hauts-de-France, la Normandie, la Bretagne et les Pays de la Loire, cette expérimentation à grande échelle vise à sensibiliser les consommateurs et faciliter l’adoption de nouveaux gestes plus durables, dans un parcours simple et intuitif. 📍 Plus d’infos et liste des magasins participants sur reflexe-gagnant-reemploi.fr"
}