{
  "url": "https://fr.wikipedia.org/wiki/Arc_de_triomphe_de_l'Étoile",
  "title": "Arc de triomphe de l'Étoile — Wikipédia",
  "text": "Arc de triomphe de l'Étoile L'arc de triomphe de l'Étoile[a], le plus souvent appelé simplement l'Arc de Triomphe[b], est un monument de type tétrapyle situé à Paris, en un point haut à la jonction des territoires des 8e, 16e et 17e arrondissements, notamment au sommet de l'avenue des Champs-Élysées et de l'avenue de la Grande-Armée, lesquelles constituent un grand axe est-ouest parisien partant de la pyramide du Louvre, passant par l'obélisque de La Concorde, l'Arc de Triomphe lui-même et se terminant au loin par l'arche de la Défense. Sa construction, décidée par l'empereur Napoléon Ier, débute en 1806 et s'achève en 1836 sous le règne de Louis-Philippe. Place de l'Étoile de Paris [modifier | modifier le code]L'Arc de Triomphe s'élève au centre de la place Charles-de-Gaulle (anciennement place de l'Étoile) dans les 8e, 16e, et 17e arrondissements de Paris[1]. Il est situé dans l'axe et à l'extrémité ouest de l'avenue des Champs-Élysées, à 2,2 kilomètres de la place de la Concorde. C'est un tétrapyle haut de 49,54 mètres, large de 44,82 mètres et profond de 22,21 mètres, géré par le centre des monuments nationaux[2]. La hauteur de la grande voûte est de 29,19 mètres et sa largeur de 14,62 mètres. La petite voûte mesure 18,68 mètres de haut et 8,44 mètres de large. Le monument pèse 50 000 tonnes — en fait 100 000 tonnes, en prenant en compte les fondations qui s'enfoncent à 8,37 mètres de profondeur. Le coût total de la construction a été de 9 651 116 francs[3]. La place de l'Étoile forme un énorme rond-point de douze avenues percées au XIXe siècle sous l'impulsion de Napoléon III et du baron Haussmann, alors préfet du département de la Seine. Ces avenues « rayonnent » en étoile autour de la place, notamment l'avenue Kléber, l'avenue de la Grande-Armée, l'avenue de Wagram et, la plus connue, l'avenue des Champs-Élysées. Des pavés de couleurs différentes dessinent sur le sol de la place deux étoiles dont les pointes arrivent pour l'une au milieu des avenues, pour l'autre entre les avenues. Ce site est desservi par la station de métro Charles de Gaulle - Étoile. Histoire [modifier | modifier le code]Napoléon Ier, au lendemain de la bataille d'Austerlitz, déclare aux soldats français : « Vous ne rentrerez dans vos foyers que sous des arcs de triomphe. » L'Empereur s'est référé aux arcs de triomphe érigés sous l'Empire romain afin de commémorer un général vainqueur défilant à la tête de ses troupes[4]. Par un décret impérial daté du , il ordonne la construction de cet arc de triomphe consacré à perpétuer le souvenir des victoires des armées françaises[5]. Son projet initial est d'ériger le monument « à l'entrée des boulevards, près du lieu où était la Bastille, de manière qu'en entrant dans le faubourg Saint-Antoine on passe sous cet arc de triomphe ». Il veut ainsi en faire le point de départ d'une avenue triomphale traversant notamment le Louvre et la place de la Bastille. Le ministre de l'Intérieur Jean-Baptiste de Champagny avise l'Empereur que le choix de la Bastille serait dispendieux et le convainc d'ériger l'Arc à l'ouest de Paris sur la place de l'Étoile qui permettait le dégagement de belles perspectives[6]. Le comte Jean Bérenger, conseiller d'État, se charge du financement comme directeur général de la Caisse d'amortissement. Le décret impérial du , qui ordonne l'érection d'un arc de triomphe, prévoit en effet que « sera pris un million pour cet objet sur les contributions provenant de la Grande Armée. La Caisse d'amortissement tiendra chaque mois, à dater du , une somme de cinquante mille francs à la disposition du futur architecte et celle de quinze mille francs pour les travaux d'art et de sculpture »[7]. Pour la conception du monument, l'architecte Jean-François Chalgrin est en concurrence avec son confrère Jean-Arnaud Raymond, chargé de collaborer avec lui. Le premier souhaite orner l'arc de colonnes isolées tandis que le second les veut engagées. L'incompatibilité de ces deux conceptions rend impossible toute collaboration entre les deux architectes. Un arbitrage rendu par Champagny force Raymond à se retirer honorablement. Chalgrin supprime alors les colonnes de son projet[8] et s'inspire de l'arc tétrapyle de Janus et de l'arc de Titus à Rome, alors en pleine restauration[9]. Construction [modifier | modifier le code]La première pierre en forme de bouclier portant une inscription est posée le (pour l'anniversaire de l'Empereur) et recouverte d'une plaque en bronze pour la protéger. Cette pose a lieu sans cérémonie officielle, dans l'indifférence générale[10]. Les fondations (un massif de 54,56 mètres de longueur sur 27,28 mètres de largeur et 7,55 mètres de profondeur)[11] exigent deux années de chantier. En 1810, les quatre piles s'élèvent à environ un mètre au-dessus du sol. À l'occasion de son mariage avec l'archiduchesse Marie-Louise et de l'entrée de celle-ci dans Paris, l'Empereur délègue des crédits qui permettent à Chalgrin de construire une maquette en vraie grandeur en charpente, stuc et toiles peintes qui restent assez longtemps en place et sous laquelle la princesse passe. L'architecte meurt assez subitement en 1811, suivi, huit jours après lui, par son confrère Raymond[10]. Les piliers de la construction ne s'élèvent qu'à une douzaine de mètres, au niveau des assises de la voûte de la grande arche quand Louis-Robert Goust, élève de Chalgrin, lui succède à la tête du projet[12]. Lors des premières défaites napoléoniennes (campagne de Russie en 1812), et des événements de 1814, l'Arc de Triomphe est élevé jusqu'aux voûtes (l'imposte de la grande arcade est posée avec la 45e assise), mais la construction est interrompue puis abandonnée sous la Restauration. En 1823, Louis XVIII reprend la construction avec les architectes Louis-Robert Goust puis Jean-Nicolas Huyot et sous la direction de Louis-Étienne Héricart de Thury. L'Arc doit désormais commémorer l'expédition victorieuse d'Espagne. En 1830, Louis-Philippe reprend la pensée initiale de Napoléon mais, dans un esprit de réconciliation, associe les armées qui ont combattu entre 1792-1815. C'est Louis-Philippe et Adolphe Thiers qui décident du choix des thèmes et des sculpteurs : Le Départ des volontaires de 1792, communément appelé La Marseillaise, de François Rude et Le Triomphe de Napoléon de Jean-Pierre Cortot. Plus spectaculaire est la frise située au sommet de l'Arc et qui se divise en deux parties : Le Départ des armées et Le Retour des armées avec une longue scène centrale à la gloire de la Nation. La construction est menée à bien entre 1832 et 1836 par l'architecte Guillaume Abel Blouet, dont le nom est mentionné sur la plaque commémorative au troisième étage du monument[12]. - Mariage de Napoléon et de Marie Louise devant la maquette grandeur nature de l'Arc de Triomphe, . - Maquette en vraie grandeur de l'Arc de Triomphe en bois, stuc et toile peinte construite par Chalgrin. - L'Arc de Triomphe inachevé entre les pavillons de la barrière de l'Étoile, 1818. - Vue générale de Paris prise du haut de l'Arc de Triomphe en construction, c. 1830. Inauguration [modifier | modifier le code]L'Arc de Triomphe est inauguré le pour le sixième anniversaire des Trois Glorieuses. Au départ, une grande revue militaire en présence de Louis-Philippe est prévue. Mais, alors qu'il vient d'être visé par un nouvel attentat le , le roi décide de s'en abstenir. La revue militaire est décommandée et remplacée par un grand banquet offert par le roi à trois cents invités, tandis que le monument est découvert en catimini à sept heures du matin, en la seule présence d'Adolphe Thiers et de son ministre des Finances, Antoine d'Argout[13]. Durant le transfert des cendres de Napoléon, le , le cortège passe sous l'Arc de Triomphe. En 1842, Honoré de Balzac en fait un symbole de la fidélité des soldats à l'Empereur : « mais tous les cœurs, même les plus hostiles à l'empereur, adressaient au ciel des vœux ardents pour la gloire de la patrie. Les hommes les plus fatigués de la lutte commencée entre l'Europe et la France avaient tous déposé leurs haines en passant sous l'arc de triomphe[14] ». Dans l'esprit des concepteurs, le sommet de l'Arc devait être couronné par un groupe sculpté monumental. Plusieurs projets, dont certains très fantaisistes, sont présentés : la France victorieuse, un aigle colossal, Napoléon sur une sphère, un réservoir d'eau, un éléphant, etc. En 1882, un quadrige conçu par le sculpteur Alexandre Falguière est installé sur le socle laissé vide : cette maquette en charpente et en plâtre, grandeur naturelle, représente une allégorie de La France ou de La République, tirée par un char à l'antique s'apprêtant à « écraser l'Anarchie et le Despotisme ». La sculpture monumentale, baptisée le Triomphe de la Révolution, est enlevée dès 1886 car elle commence à se dégrader, son remplacement définitif par un bronze ne s'étant jamais fait par la suite[15]. On peut observer le monument pourvu du groupe de Falguière sur diverses photographies, tout particulièrement celles prises lors des funérailles grandioses de Victor Hugo, en 1885 (voir section « Événements »). Une réplique en marbre de petite dimension (environ 1,2 mètre) du Triomphe de la Révolution est exposée en salle 17 du musée de Grenoble[16]. L'Arc de Triomphe est classé au titre des monuments historiques depuis le [17]. - Retour des cendres de Napoléon, le . - La remise des drapeaux lors de la fête de la Fraternité, . - L'Arc de Triomphe sur la place de l'Étoile en 1868. - Quadrige en platre installé sur l'Arc de Triomphe entre 1882 et 1886. Au XXe siècle [modifier | modifier le code]A l'occasion de la cérémonie du , un cénotaphe monumental, réalisé par l'architecte Antoine Sartorio, constitué d'une tour en plâtre doré de 17,5 mètres de haut pesant 30 tonnes, orné de déesses de la victoire, est placé sous l'Arc de Triomphe, une dizaine de mètres en avant et légèrement décalé vers la droite pour permettre le passage des troupes[18]. La tombe du Soldat inconnu est installée sous l'arc de triomphe de l'Étoile le . Elle accueille le corps d'un soldat français, mort lors de la Première Guerre mondiale pour commémorer symboliquement l'ensemble des soldats qui sont morts pour la France au cours de l'histoire. En 1938, un moulage de la sculpture originale de La Marseillaise de Rude est effectué pour prévenir les éventuelles destructions dans une guerre, avec notamment le développement de l'aviation et des bombardements[19]. Le , les troupes nazies défilent pour la première fois sous l'Arc de Triomphe. Le de la même année, une manifestation de lycéens et d'étudiants sur les Champs-Élysées et devant l'Arc de Triomphe, l'un des tout premiers actes publics de résistance à l'occupant en France, est durement réprimée par les nazis. Le , après la libération de Paris, le général Charles de Gaulle descend les Champs-Élysées, précédé par quatre chars de la 2e division blindée. Le , en réaction à la crise étudiante et syndicale, une grande manifestation de soutien au président Charles de Gaulle remonte les Champs-Élysées, réunissant entre 300 000 et 500 000 personnes[20]. Le , à l'issue de la victoire 3-0 de l'équipe de France de football en finale de la Coupe du monde, plus d'un million de personnes célèbrent la victoire sur les Champs-Élysées. Le lendemain, les Bleus paradent sur l'avenue à bord d'un bus. Des scènes similaires se reproduiront en 2000 après la victoire en finale de l'Euro. - Vue aérienne de Paris, centrée sur l'Arc de Triomphe, 1921. - L'Arc de triomphe de la place de l'Étoile, dans les années 1920. - L'Arc de Triomphe lors de la libération de Paris, le 1944. - Vue de l'Arc de Triomphe depuis l'avenue Foch, 1962. Au XXIe siècle [modifier | modifier le code]En est inaugurée la nouvelle scénographie permanente de l'Arc de Triomphe due à l'artiste Maurice Benayoun et à l'architecte Christophe Girault. Renouvelant l'exposition des années 1930, cette nouvelle muséographie accorde une large place au multimédia. Intitulée « Entre guerres et paix », elle propose une lecture de l'histoire du monument prenant en compte l'évolution de sa symbolique jusqu'à la période actuelle, période où les valeurs du dialogue et de la rencontre prennent le pas sur le conflit armé. Une présentation multimédia raconte en sept stations et sur trois niveaux l'histoire du monument de façon contemporaine, interactive et ludique. Elle permet de découvrir ce qui aurait pu être (les projets non réalisés), ce qui a disparu et ce qui ne peut être facilement vu (le décor sculpté). La dégradation de l'Arc de Triomphe le a lieu lors de l'Acte III du mouvement des Gilets jaunes à Paris. Le monument est investi par des manifestants et subit d'importantes dégradations. Le ministre de la Culture, Franck Riester, avance un coût global de remise en état à hauteur de 1,2 million d'euros. Lors du procès de , huit manifestants sont reconnus coupables d'avoir pénétré par effraction dans l'Arc de Triomphe et dégradé celui-ci. Ils sont condamnés à des peines modestes, les principaux auteurs des faits n'ayant pas pu être identifiés[21],[22],[23]. - Nouvelle scénographie permanente de l'Arc de Triomphe, inaugurée en 2008. - Vue de l'Arc de Triomphe depuis l'avenue d'Iéna, 2012. - Dégradation de l'Arc de Triomphe, le 2018. - Illumination de l'Arc de Triomphe pendant les Jeux olympiques d'été de 2024. Symbole historique [modifier | modifier le code]L'Arc de Triomphe fait partie des monuments nationaux à forte connotation historique. La dépouille du Soldat inconnu, tué lors de la Première Guerre mondiale, est inhumée sous l'arche le . La sépulture, entourée de bornes de métal noir reliées entre elles par des chaînes, se compose d'une dalle de granite de Vire sur laquelle est inscrite l'épitaphe : « Ici repose un soldat français mort pour la Patrie, 1914-1918 ». Deux ans plus tard, André Maginot, alors ministre de la Guerre, a soutenu le projet d'y installer une « flamme du souvenir » qui a été allumée pour la première fois le par le ministre[24]. Elle commémore le souvenir des soldats morts au combat et ne s'éteint jamais : elle est ravivée chaque soir à 18 h 30 par des associations d'anciens combattants ou de victimes de guerre[25]. Ce geste de ravivage symbolique a été accompli même le , où l'armée allemande est entrée dans Paris et défilait sur la place de l'Étoile : ce jour-là, le ravivage a eu lieu devant les officiers allemands qui ont autorisé la cérémonie. - Cénotaphe élevé à la mémoire des morts de la Grande Guerre sous l'Arc de Triomphe, 1919. - Sous l'Arc se trouve la dalle de la tombe du Soldat inconnu. - Une flamme éternelle ravivée chaque soir à 18 h 30 commémore le souvenir des soldats morts au combat. - Un immense drapeau tricolore est fixé sous l'Arc de Triomphe lors d'événements importants, comme pour le défilé militaire du 14 Juillet. Détails des sculptures [modifier | modifier le code]L'élévation de cet arc monumental tétrapyle est la suivante : devant les façades principales des piédroits, le premier registre est orné de groupes en ronde-bosse sur des piédestaux. Ce bandeau est surmonté d'un premier entablement constitué d'une frise de grecques et d'une corniche saillante. Le second registre est animé de grands cadres de pierre rectangulaires, orné d'un bas-relief, et surmonté d'un entablement, comprenant une frise historiée, sous une corniche saillante. Le troisième registre dans la partition verticale de l'édifice est un important étage d'attique orné de 30 boucliers. Le programme iconographique comprend : - Quatre hauts-reliefs allégoriques posés sur des socles élevés, adossés aux piédroits et hauts de 18 mètres. Ce sont : - Le Départ des volontaires de 1792, aussi appelé La Marseillaise, par François Rude (face sud droite). Ce haut-relief représente le rassemblement de tous les Français, pour défendre la nation en partant au combat. L'ensemble et la diversité du peuple français sont mis en avant par la diversité des soldats, jeunes et moins jeunes. Au-dessus d'eux, le Génie de la Guerre les guide [26]. Cette figure fut vite considérée comme une allégorie de La Marseillaise. L'architecture générale mélange le style antique (le Génie de la Guerre casqué et ailé portant l'égide, les drapés, les cuirasses, les armes, le nu) avec le style appartenant au romantisme caractéristique du XIXe siècle en France (gestes véhéments, expression marquée des visages, mouvement général). - Le Triomphe de 1810, par Jean-Pierre Cortot (face sud gauche). - La Résistance de 1814, par Antoine Étex (face nord droite). - La Paix de 1815, par Antoine Étex (face nord gauche). - Le Triomphe de 1810, par Jean-Pierre Cortot. - La Résistance de 1814, par Antoine Étex. - La Paix de 1815, par Antoine Étex. - Six bas-reliefs plus petits gravés sur les faces de l'arc, retraçant des scènes de la Révolution et de l'Empire. Ils se situent au-dessus des quatre groupes ainsi que sur les côtés de l'arc : - La Bataille d'Aboukir, , par Bernard Seurre (face sud gauche). - Les Funérailles du Général Marceau, , par Henri Lemaire (face sud droite). - La Bataille de Jemappes, , par Carlo Marochetti (face est). - La Prise d'Alexandrie, , par John-Étienne Chaponnière (face nord gauche). - Le Passage du pont d'Arcole, , par Jean-Jacques Feuchère (face nord droite). - La Bataille d'Austerlitz, , par Théodore Gechter (face ouest). - La Bataille de Jemappes, , par Carlo Marochetti. - La Bataille d'Austerlitz, , par Théodore Gechter. - La Bataille d'Aboukir, , par Bernard Seurre. - Les Funérailles du Général Marceau, , par Henri Lemaire. - La Prise d'Alexandrie, , par John-Étienne Chaponnière. - Le Passage du pont d'Arcole, , par Jean-Jacques Feuchère. - L'attique orné de 30 boucliers en quinconce par des glaives dressés. Sur les boucliers sont gravés les noms de grandes batailles de la Révolution et de l'Empire : Valmy, Jemappes, Fleurus, Montenotte, Lodi, Castiglione, Arcole, Rivoli, Pyramides, Aboukir, Alkmaar, Zurich, Héliopolis, Marengo, Hohenlinden, Ulm, Austerlitz, Iéna, Friedland, Somosierra, Essling, Wagram, Moskowa, Lützen, Bautzen, Dresde, Hanau, Montmirail, Montereau et Ligny. - Le bas-relief de la frise du grand entablement qui tourne sur les quatre faces de l'édifice. Il représente : - Le Départ des armées, par Joseph-Silvestre Brun, Georges Jacquot et Charles-René Laitié. Sur cette frise on peut voir la représentation de plusieurs personnalités de la Révolution et de l'Empire. De gauche à droite, on y distingue, Chénier, Moitte, Roland, Me Roland, Penthièvre, Marceau, Hoche, Soult, Carnot, Cambronne, Joubert, La Tour d'Auvergne, Championnet, Jourdan, Beurnonville, La Fayette, Sieyes, Duc d'Orléans, Bailly, Duc de Bourbon, Talleyrand, Mirabeau, Custine, Foy, Desaix, le Duc de Chartres, Masséna, Kléber, Houchard, Kellermann, Daboville, Lefebvre, Augereau, Dumouriez, Miranda, Gouvion-Saint-Cyr, Eugène et Joséphine de Beauharnais, David, Gossec, Rouget de l'Isle. - Le Retour des armées, par Louis-Denis Caillouette, François Rude et Bernard Seurre. - Les grandes arcades qui sont rehaussées dans leurs écoinçons de figures allégoriques représentant des personnages de la mythologie romaine (Renommées avec le pied posé sur un globe, leurs mains tenant une trompette et Victoires tendant une couronne de laurier), exécutées par James Pradier[27]. - Une Renommée tenant une trompette (face nord, écoinçon gauche). - Une Victoire tendant une couronne de laurier (face nord, écoinçon droit). - Une Renommée (face sud, écoinçon gauche). - Une Renommée (face sud, écoinçon droit). - Les petites arcades rehaussées de figures allégoriques représentant L'Infanterie par Théophile Bra, La Cavalerie par Achille Valois, L'Artillerie par Joseph De Bay père et La Marine par Charles Émile Seurre. - Figures allégoriques représentant L'Infanterie. - Figures allégoriques représentant La Cavalerie. - Figures allégoriques représentant L'Artillerie. - Figures allégoriques représentant La Marine. - Sur les faces intérieures des piliers des grandes arcades, sont gravés les noms des grandes batailles de la Révolution et de l'Empire. - Batailles gravées sous les grandes arcades (noter les séparateurs). - Sur les faces intérieures des petites arcades, sont gravés les noms des personnalités de la Révolution et de l'Empire. Les noms de ceux qui sont morts au combat sont soulignés à l'instar du général français Frédéric Guillaume de Donop mort à Waterloo[28]. - Pilier nord. - Pilier est. - Pilier sud. - Pilier ouest. - Quatre bas-reliefs se situent au-dessus des noms des personnalités de la Révolution et de l'Empire. Ils portent le nom de batailles célèbres de la Révolution et de l'Empire : - Attributs des Victoires du nord, par François-Joseph Bosio. La scène indique les batailles d'Austerlitz, d'Iéna, de Friedland, d'Ulm, de Wagram et d'Eylau. - Attributs des Victoires de l'est, par Jacques-François Walcher. La scène indique les batailles d'Alexandrie, des Pyramides, d'Aboukir et d'Héliopolis. - Attributs des Victoires du sud, par Antoine-François Gérard. La scène indique les batailles de Marengo, de Rivoli, d'Arcole et de Lodi. - Attributs des Victoires de l'ouest, par Jean-Joseph Espercieux. La scène indique les batailles de Jemmapes et de Fleurus. - Attributs des Victoires du nord, par François-Joseph Bosio. - Attributs des Victoires de l'est, par Jacques-François Walcher. - Attributs des Victoires du sud, par Antoine-François Gérard. - Attributs des Victoires de l'ouest, par Jean-Joseph Espercieux. - Les intrados des grandes et petites arcades sont ornés de caissons : - Voûtes des grandes et petites arcades. - Drapeau tricolore suspendu à la voûte de la grande arcade. - Voûte de la grande arcade. - Voûtes des grandes et petites arcades. - Le monument est encerclé par cent plots symbolisant les Cent-Jours. Événements [modifier | modifier le code]En 1810, à l'occasion de son mariage avec l'archiduchesse Marie-Louise et de l'entrée de celle-ci dans Paris, l'Empereur Napoléon Ier fait construire par Chalgrin une maquette grandeur réelle (afin de donner l'illusion du monument achevé) en charpente, stuc et toiles peintes en trompe-l'œil pour simuler les bas-reliefs des piédroits sous laquelle la future impératrice passa solennellement. Le corps de Victor Hugo est veillé sous l'Arc la nuit du , avant d'être enterré au Panthéon. À l'occasion des funérailles, le monument est partiellement voilé de crêpe noir[29],[30]. Le , un aviateur militaire expérimenté, Charles Godefroy, réussit à passer en avion (avec un appareil biplan Nieuport 17 de 15 mètres carrés de surface portante et 9 mètres d'envergure à moteur de 120 chevaux[31]) sous l'Arc de Triomphe, photographié par Jacques Mortane[32]. Cet exploit est mis en scène en 1968 dans le film Les Aventuriers de Robert Enrico. Le célèbre as Jean Navarre s'était tué à proximité de Villacoublay le de la même année au cours d'un vol d'entraînement pour réaliser cet exploit[33]. Le , une manifestation de lycéens et d'étudiants sur les Champs-Élysées et devant l'Arc de Triomphe, l'un des tout premiers actes publics de résistance à l'occupant en France, est durement réprimée par les nazis. En 1997, un Australien essaye de se faire cuire des œufs au plat sur la flamme du Soldat inconnu, ce qu'a fait quelques années plus tôt un chanteur de rock du nom d'Hector, à la suite d'un pari avec Jean Yanne. En , Alain Marchand réédite le passage sous l'Arc de Triomphe à bord d'un MS 880 Rallye ; il est condamné à 5 000 francs d'amende[34]. Le , un pilote non identifié passe de nouveau sous l'Arc et la tour Eiffel aux commandes d'un Mudry Cap-10B, déclaré volé à l'aéro-club de Lognes[35],[36]. Dans le film Les Aventuriers (1967), le personnage joué par Alain Delon envisage de passer en avion sous l'Arc de Triomphe, mais échoue à cause du drapeau qui y est déployé[37]. Des pics de sécurité sont installés[Quand ?] après que l'on eut constaté 33 suicides depuis le toit du monument[38]. Six fois par an (les 7, 8 et et les 3, 4, ), le Soleil se couche dans l'axe des Champs-Élysées. Pour une personne située sur les Champs-Élysées, le disque solaire est ainsi visible quelques minutes sous l'arche de l'Arc de Triomphe[39]. Le , le phénomène s'accompagne d'une éclipse partielle de Soleil, observée par près de 200 000 personnes[40]. En sens opposé vu de la porte Maillot, le Soleil se lève quatre fois par an dans l'Arc de Triomphe, les 4, 5, , et le , informations confirmées par l'Institut de mécanique céleste et de calcul des éphémérides[39]. « Des Napoléoniens convaincus à travers des brochures ou des sites internet, colportent encore à ce sujet plusieurs informations fantaisistes… Ils ont tenté de répandre l'idée que le soleil se couchait sous l'Arc de Triomphe le jour de l'anniversaire de l'Empereur, le , et qu'il se levait parfaitement dans l'axe le , jour anniversaire de la bataille d'Austerlitz[39] ». L'Arc de Triomphe est empaqueté du au par Christo et Jeanne-Claude. Il s'agit d'une œuvre posthume du couple d'artistes, intitulée L'Arc de Triomphe, Wrapped (littéralement L'Arc de Triomphe, emballé). Christo avait commencé à travailler sur ce projet en 1961. L'œuvre temporaire a nécessité 25 000 m2 de toiles argent bleuté et trois kilomètres de cordes rouges[41]. Philatélie [modifier | modifier le code]Dès 1929, l'Arc de Triomphe est représenté sur un timbre de France d'une valeur de 2 francs de couleur brun-rouge. En 1938, il figure sur un timbre de 1,75 franc outremer, émis lors de la visite des souverains britanniques en regard de la tour du palais de Westminster. Le visuel est repris pour un entier postal. La même année un timbre rouge carminé de 65 centimes surtaxé 35 centimes est émis pour célébrer le 20e anniversaire de la victoire. L'Arc est au centre avec le défilé du sur les côtés du timbre. Le visuel est également repris pour un entier postal. En 1944, le Gouvernement provisoire en fait un symbole de la République et une série de dix timbres d'usage courant est émise (valeurs entre 5 centimes et 10 francs). Ces timbres sont émis par les États-Unis pour servir en France libérée. Une nouvelle série de dix timbres toujours imprimée aux États-Unis sort en 1945 ; les chiffres de la valeur sont en noir et compris entre 30 centimes et 3 francs. En 1968, il est présent pour le cinquantenaire de l'armistice du sur un timbre à 25 centimes carmin et bleu. En 1971, il est en arrière-plan d'un timbre rouge émis dans la bande émise à l'occasion de la mort du général de Gaulle. Il représente la descente des Champs-Élysées en 1944. En 1973, la poste célèbre le 50e anniversaire de la flamme sous l'Arc de Triomphe par un timbre de 40 centimes lilas, rouge et bleu. En 1989, la poste présente un panorama de Paris sur une bande. L'Arc y figure en arrière-plan de deux timbres multicolores à 2,20 francs représentant l'arche de la Défense et la tour Eiffel. Les visuels sont repris sur des entiers postaux. En 1995, à l'occasion du cinquantenaire de la victoire du , il figure en arrière-plan d'un portrait du général de Gaulle pour une valeur de 2,80 francs. En 1999, il figure sur un timbre de distributeur à valeurs variables[42]. En 2001, il figure pour une valeur de 3 francs ou 46 centimes d'euros, sur un timbre de très grand format émis à l'occasion du centenaire de la naissance du dessinateur et graveur Albert Decaris. En 2003, il est inclus dans un bloc feuillet : « Portraits de régions. La France à voir ». Dans cette série de dix timbres, il est le sujet unique d'un timbre à 50 centimes d'euro. - L'Arc de Triomphe vu depuis la terrasse Publicis en 2015. Travaux de conservation et restauration [modifier | modifier le code]Confortement des fondations par injection de coulis [modifier | modifier le code]Le confortement des fondations de l'Arc de Triomphe par injection de coulis a été réalisée à la fin des années 1980 en cinq étapes[43]. 1re étape : apparitions des désordres de l'édifice [modifier | modifier le code]L'Arc souffrait de désordres apparents, telles des fissures et chutes de pierres. Un examen visuel a permis d'identifier les fentes et d'en tracer le relevé. La conclusion des reconnaissances et investigations fut que la cause principale des perturbations était un tassement dû au délavage du mortier à la chaux aérienne des fondations par l'eau de ruissellement. Divers travaux de réhabilitation furent décidés, visant à redonner un aspect neuf au monument, à le prémunir contre de telles altérations et à le conforter. La restauration a été conduite par Michel Marot, architecte des bâtiments civils et palais nationaux. Le Bureau Michel Bancon, spécialisé dans les études de structure et de réhabilitation des édifices anciens, a été chargé de l'expertise du bâtiment afin de définir un programme de consolidation. Solétanche, entreprise spécialisée, a réalisé l'ensemble des travaux sous la direction de Jean-Pierre Gadret[44]. Les travaux de confortement comportaient essentiellement la régénération des maçonneries de fondation et la consolidation de la superstructure. À partir de , d'autres travaux de restauration ont débuté. Trois parties étaient concernées : la terrasse et la balustrade de l'attique, la voûte d'ogive intérieure et les salles de la partie basse, la voûte en berceau de la grande arche centrale et son décor sculpté de rosaces. Ces travaux, qui se poursuivront jusqu'en , ont été engagés pour des raisons de sécurité, d'entretien de l'édifice et s'inscrivent dans la perspective d'aménagements intérieurs. 2e étape : campagne de mesures et d'essais [modifier | modifier le code]Afin d'établir un diagnostic précis et déduire les origines du phénomène et la nature des travaux les plus rationnels, une série de mesures a été opérée : - mesures des vibrations au sol et dans la partie supérieure ; - équipement des fissures et mesures de leur évolution ; - pose sur l'édifice de niveaux de précision et suivi de leur évolution ; - mesures de la rotation des piles et de leur verticalité ; - mesures de l'horizontalité des corniches sur les quatre faces ; - forages dans les fondations au droit des piles et examens. 3e étape : analyse des désordres [modifier | modifier le code]Cette analyse, facilitée par l'existence des plans de l'édifice, a permis de constater que le bâtiment souffrait d'un tassement différentiel des joints de maçonnerie des dix-sept assises de fondations (8,5 mètres), avec un mouvement hélicoïdal de l'Arc. Les fondations constituées de gros blocs en pierre ont subi des mouvements consécutifs à la dégradation de leurs joints. L'eau de pluie de l'esplanade, l'eau de ruissellement des façades et l'eau de terrasse canalisée vers des collecteurs, sans doute fuyards, sont la cause des circulations d'eau qui délavent les joints entraînant une forte altération du mortier à la chaux aérienne. Le tassement différentiel des fondations ainsi généré entraîne une déformation dite en selle de cheval en partie supérieure de l'édifice avec une tendance à l'éloignement des sommets de piles dans le sens des petits côtés et d'une convergence dans l'autre sens. Michel Bancon explique ce comportement différentiel par la configuration des nombreuses cavités ménagées dans l'Arc qui, par leur emplacement et leur géométrie, sollicitent plus le bâtiment dans l'axe des petits côtés. Une analyse par libération des contraintes montre que celles-ci varient à l'intérieur des maçonneries de 0 à 50 bars. 4e étape : travaux de confortement [modifier | modifier le code]Ces analyses ont permis d'établir un plan de confortement comprenant cinq phases : - Traitement des vides existant dans les joints de maçonnerie et régénération des mortiers délavés par injection partielle de coulis spéciaux dans les fondations ; - Traitement des fissures en superstructures par injection de coulis de ciment ; - Confortement des superstructures par mise en place de tirants précontraints à l'intérieur de l'édifice ; - Injections complémentaires de coulis dans les massifs de fondations ; - Étanchéification des abords de l'Arc (plate-forme centrale, réseaux d'égouts…). 5e étape : travaux d'injection [modifier | modifier le code]Pour remédier à la dégradation des joints de fondation, il a été décidé, à la suite d'une campagne dite de convenance, de procéder à des injections d'abord partielles, sur un huitième de la surface de trois massifs et sur un quart de la surface de celui qui supporte la pile nord-ouest. L'entreprise Solétanche a été choisie pour mener la première campagne d'injection nécessaire. Il a été décidé d'utiliser deux types de coulis, le « Microsol » et le « Silacsol », mis au point, l'un et l'autre, par cette entreprise. L'usage d'un ciment classique était à rejeter, puisqu'il fallait, d'une part combler au maximum des vides dans les joints des moellons, d'autre part conforter les parties de ces joints qui étaient désagrégées. La granulométrie des produits traditionnels (0 à 100 µm) et la formation qu'ils entraînent de paquets de grains (d'environ 500 µm) auraient empêché une exécution correcte de l'opération. Confortement par précontrainte additionnelle [modifier | modifier le code]Dans le cas de l'Arc de Triomphe, il s'agit d'une précontrainte additionnelle réalisée à l'intérieur de la structure permettant de comprimer les zones fracturées et de recentrer les efforts obliques engendrés par la poussée des voûtes. Cette précontrainte additionnelle a été réalisée par 112 demi-tirants ancrés dans les parements et raccordés par paires en leur milieu par des coupleurs actifs. La répartition des tirants tient compte : - du rééquilibrage des contraintes qui nécessite quatre étages de tirants dans le sens du petit côté et deux étages suivant le grand côté ; - de la présence d'équipements existants à l'intérieur de l'ouvrage ; - du phasage des travaux, la mise en tension devant pouvoir se faire de manière progressive, afin d'équilibrer les efforts à répartir ; - de la possibilité de réglages ultérieurs des efforts dans les tirants ; - de l'esthétique finale du renforcement compatible avec le cadre de l'édifice. Galerie [modifier | modifier le code]- Escaliers en spirale situés dans les piliers de l'Arc. 240 marches mènent au musée, 284 à la terrasse. - Salle du musée interactif au sommet de l'édifice, sous la terrasse. - Statue de la Première Guerre mondiale. - Terrasse au sommet de l'Arc de Triomphe. - Vue panoramique de Paris depuis la terrasse au sommet de l'Arc de Triomphe. Notes et références [modifier | modifier le code]Notes [modifier | modifier le code]- ↑ On écrit « l'arc de triomphe de l'Étoile » (si on fait figurer le nom « de l'Étoile ») et « l'Arc de Triomphe » (pour désigner celui de l’Étoile — et pas seulement la structure, un arc de triomphe — si le nom « de l'Étoile » est absent, car il est alors implicite), ce conformément aux conventions typographiques concernant les monuments et bâtiments publics. - ↑ On peut également écrire « l'Arc de triomphe », conformément aux conventions typographiques concernant les monuments et constructions. Cette forme est notamment employée sur le site officiel de l'arc de triomphe de l'Étoile : Bienvenue à l'Arc de triomphe. Références [modifier | modifier le code]- ↑ « Place Charles-de-Gaulle », sur le site de ViaMichelin (consulté le ). - ↑ « Arc de triomphe », sur le site du centre des monuments nationaux (consulté le ). - ↑ Quid, Robert Laffont, , p. 357. - ↑ Daniel Brandy, Paris et les caprices du pouvoir : l'aventure politique des monuments parisiens, Presses franciliennes, , p. 88. - ↑ Maxime Weygand, L'Arc de Triomphe de l'Étoile, Flammarion, , p. 31. - ↑ Henri Malorey, L'Arc de triomphe de l'étoile, Paris, Paris, H. Basuyau, , 112 p. (lire en ligne), p. 8. - ↑ Le directeur général du musée Napoléon à M. Bérenger, conseiller d'État, directeur de la caisse d'amortissement. Éditions de la Réunion des musées nationaux, Paris, 1999. 915 Archives des musées nationaux, registre *AA5, p. 233, Denon. - ↑ Gallet 1995, p. 116. - ↑ Isabelle Rouge, L'Arc de Triomphe de l'Étoile : panthéon de la France guerrière : art et histoire, Dijon, Faton, , 397 p. (ISBN 978-2-87844-106-2, BNF 41410005, lire en ligne), p. 55. - Anne Muratori-Philip, L'Arc de triomphe, éditions du patrimoine, , p. 5. - ↑ Isabelle Rouge, L'Arc de Triomphe de l'Étoile : art et histoire, Faton, , p. 95. - « Histoire de l'Arc de triomphe », sur paris-arc-de-triomphe.fr (consulté le ). - ↑ « Le jour où l'Arc de Triomphe a enfin été inauguré », sur cnews.fr, (consulté le ). - ↑ Honoré de Balzac, La Femme de trente ans (1829 – 1842), édition du Furne, 1845, vol. 3, p. 7. - ↑ Isabelle Rouge, L'Arc de Triomphe de l'Étoile : art et histoire, Faton, , p. 295. - ↑ « Le Triomphe de la Révolution (salle 17) », sur museedegrenoble.fr (consulté le ). - ↑ Notice no PA00088804, sur la plateforme ouverte du patrimoine, base Mérimée, ministère français de la Culture. - ↑ « Cénotaphe élevé à la mémoire des morts de la grande guerre sous l'arc de Triomphe, Paris | Paris Musées », sur parismuseescollections.paris.fr (consulté le ). - ↑ « Gilets jaunes : Dijon possède une copie du moulage de La Marseillaise détruite à l'Arc de Triomphe », sur France 3 Bourgogne-Franche-Comté, (consulté le ). - ↑ Frank Georgi, « \"Le pouvoir est dans la rue\". 30 mai 1968 la \"manifestation gaulliste\" des Champs-Élysées », Vingtième Siècle : Revue d'histoire, 1995, no 48, p. 46-60. - ↑ « « Gilets jaunes » : le , le jour où tout a basculé avec la « prise » de l'Arc de triomphe. », Le Monde, (lire en ligne , consulté le ). - ↑ « Au procès du saccage de l'Arc de triomphe par des « gilets jaunes », des peines modestes et une relaxe. », Le Monde, (lire en ligne , consulté le ). - ↑ « L'Arc de Triomphe vandalisé. », sur La Tribune de l'art, (consulté le ). - ↑ Jean-Yves Le Naour, Le soldat inconnu : la guerre, la mort, la mémoire, Gallimard, , p. 61. - ↑ « Organisation et missions », sur le site de la fédération d'associations « La Flamme sous l'Arc de Triomphe, Flamme de la Nation » (consulté le ). - ↑ J. Thierry et G. Coulon, Notice historique sur l'arc de triomphe de l'Étoile, Paris, J. Thierry, Rosselin, 1837, p. 4. - ↑ Henri Malorey, L'Arc de triomphe de l'étoile, H. Basuyau, , p. 61. - ↑ « Les 660 noms inscrits sur l'Arc de Triomphe de Paris » (consulté le ). - ↑ « De l'Arc de triomphe au Panthéon : les funérailles de Victor Hugo », sur lhistoire.fr (consulté le ). - ↑ « Victor Hugo et l'Arc de triomphe », sur paris-arc-de-triomphe.fr (consulté le ). - ↑ Le dans le ciel : l'aviateur Godefroy passe sous la voûte de l'Arc de Triomphe Air-journal.fr 7 août 2014. - ↑ « Les débuts de l'aviation : Charles Godefroy », sur histoire-image.org. - ↑ « Jean Navarre, Les traces qu'il a laissées dans l'histoire ». - ↑ « Un avion sous l'Arc de Triomphe », sur franceinter.fr (consulté le ). - ↑ « Un émule du \"baron noir\" a survolé Paris », Le Monde, (lire en ligne ). - ↑ « Un avion est passé dimanche sous la tour Eiffel et l'Arc de triomphe », Le Soir, (lire en ligne). - ↑ « Les Aventuriers », sur cinema-francais.fr (consulté le ). - ↑ Philippe Bouvard, « GDF adresse au soldat inconnu une facture annuelle de 10 000 euros », Le Figaro Magazine, semaine du 11 août 2017, p. 94. - Daniel Brandy, Paris et les caprices du pouvoir : l'aventure politique des monuments parisiens, Presses franciliennes, , p. 93. - ↑ [vidéo] « Eclipse Paris », , Paris, Institut national de l'audiovisuel. - ↑ « Paris : Christo va emballer l'Arc de Triomphe en 2020 », sur leparisien.fr, . - ↑ Catalogue Yvert et Tellier, Tome 1. - ↑ René Dinkel, L'Encyclopédie du patrimoine (Monuments historiques, Patrimoine bâti et naturel - Protection, restauration, réglementation. Doctrines - Techniques : Pratiques), Paris, éditions Les Encyclopédies du patrimoine, , 1 512 p. (ISBN 978-2-911200-00-7, BNF 36966587)Chapitre III L'apport des techniques, La confortation des maçonneries et des fondations. A. Par injection de coulis : La confortation des fondations de l'Arc de Triomphe par injection de coulis, B. La confortation par précontrainte additionnelle, pp. 62 à 73. - ↑ La société Vinci a acheté, en 2007, 81 % du capital de Solétan"
}