{
  "url": "https://nameberry.com/b/girl-baby-name-laura",
  "title": "Laura - Baby Name Meaning, Origin, and Popularity for a Girl | Nameberry",
  "text": "Laura English from Latin \"from Laurentum or bay laurel\" Share Copy link Laura Origin and Meaning Variation of Laureen - Laura Rank in US Top 1000 - Laura Rank in Nameberry Top 1000 - Names Similar to Laura - Famous People Named Laura - The name Laura in Pop Culture - International Variations of the name Laura - The name Laura in Nameberry Blog Posts - The name Laura in Nameberry Forums # 359 in the US Laura Rank in US Top 1000 # 151 on Nameberry Laura Rank in Nameberry Top 1000 Popularity of the name Laura - 359US2024 - 151Nameberry2026 - 161Canada2024 - 538Future2028 - 258England2024 - 175scotland2022 - 91Ireland2022 - 95France2018 - 66Germany2025 - 90Netherlands2021 - 54Spain2023 - 14Portugal2022 - 258Mexico2021 - 7Brazil2025 - 92sweden2022 - 30Denmark2024 - 57Belgium2021 - 30switzerland2024 - 9Austria2024 - 8Hungary2024 - 4Poland2024 - 27Estonia2025 - 71slovenia2024 - 34Chile2021 - 87Bosnia and Herzegovina2022 - 16Croatia2024 20 Names Similar to Laura These 20 names were selected by our users that were looking for other names like Laura. - Katherine - Sarah - Rachel - Marie - Rebecca - Maria - Catherine - Julia - Amy - Anne - Joanna - Mary - Christine - Amanda - Samantha - Rebekah - Bethany - Anna - Elisabeth - Kate Famous People Named Laura - Laura Ingalls WilderAmerican Pioneer and children's novelist - Laura Lane Welch BushU.S. First Lady as wife of President George W. Bush - Laura PreponAmerican actress - Laura Leggett LinneyAmerican actress - Laura Elizabeth DernAmerican actress - Laura KaeppelerMiss America 2012 - Laura Beatrice MarlingEnglish singer,songwriter - Laura Elizabeth CarmichaelEnglish actress - Laura MaranoAmerican actress - Laura AllenAmerican actress - Laura Sioux KirkpatrickAmerican model - Laura Ilene BenantiAmerican actress - Laura FraserScottish actress - LauraLeigh, (born Laura Leigh Moser), American actress - Laura Ann OsnesAmerican actress and singer - Laura MennellCanadian actress - Laura Anne IngrahamAmerican radio host - authorand political commentator - Laura Ewa ŁączPolish actress - Laura SamojłowiczPolish actress - Laura Colleen Gloria AllewayAustralian soccer players - Laura BassettEnglish football player - Laura Stéphanie GeorgesFrench football player - Laura Anna BenkarthGerman football player - Laura del Rio GarciaSpanish football player - Laura Willingham BaileyVoice actor and player on the dnd show Critical Role - Laura ZengAmerican rhythmic gymnast - Laura HalfordBritish rhythmic gymnast - Laura PergolizziAmerican singer,songwriter who goes by LP - Laura SalesPortuguese rhythmic gymnast - Laura PausiniItalian singer - Laura BragatoBeautiful Italian Model The name Laura in Pop Culture - Laura Holtcharacter on TV's \"Remington Steele\" - Laura Wingfieldcharacter in The Glass Menagerie by Tennessee Williams - Laura Roslincharacter on TV's \"Battlestar Galactica\" - Laura Petriecharacter on \"The Dick van Dyke Show\" - Laura Palmercharacter on TV series/film \"Twin Peaks\" - Laura Winslowcharacter on TV's \"Family Matters\" - Laura Spencercharacter on American soap \"General Hospital\" - Lauracharacter in video game Silent Hill 2 - Laura Proekcharacter on \"Fortysomething\" - Laura Hellingercharacter on TV series \"The Good Wife\" - Laura Hollischaracter on the web,series, \"Carmilla\" - Laura Chasecharacter in \"The Blind Assassin\" by Margaret Atwood - Laura \"X23\" Kinney, character in \"X,Men\" - Laura Victorianocharacter in the video game \"The Evil Within\" - Laura Moon (nee McCabe)character in book and TV series \"American Gods\" - \"Tell Laura I Love Her\" song by Ray Peterson - \"Laura\" song by Scissor Sisters - \"Laura\" song by Bat For Lashes - Lauraa character from the 3DS game \"Fantasy Life\" - Laura Bowmain protagonist of her eponymous Sierra adventure game series - Laura Hardythe mother of the Hardy Boys - Laura Vanderboomcharacter in the Cube Escape and Rusty lake series - Laura Lawrencecharacter in series \"Cobra Kai\" - Laura Lawrence-Weinbergcharacter in film \"The Karate Kid\" - Lauracharacter in series \"Friends\" International Variations of the name Laura - LauriceGerman - LorezzaSpanish - LloraSpanish - LaurensaSpanish - LauricaRussian - LaurenzaItalian - LauretteFrench - LaurentenaSpanish - LorenzaItalian - LaurindaSpanish - LavraRussian - LoraBulgarian - LaurkaPolish - LoritaGerman - LaureanaSpanish - LauritaSpanish - LaurentiaSpanish - LaurissaRussian - LaurisGerman - LaureFrench - LoreGerman The name Laura in Nameberry Blog Posts - 15 Cool Country Boy Names For Your Little Cowboy - 10 Baby Name Trends of 2024 - New Baby Name Trend: The Lu/Lou boys - Film Noir Names - The REAL Top Baby Names of All Time! - Doll Names: The History of Doll Names Through the Decades More Lists containing Laura - Names that Peaked in 1969 - Latin Names - Latin Names for Girls - 5 Letter Girl Names - Names Ending in A for Girls - Names That Mean Laurel - Names That Mean Bay - Two Syllable Names for Girls - Girl Dog Names That Start With L - Dog Names That Start With L - Names That Mean Laurentum - Names ending in a - Latin Names that Start With L Find your type. Analyze your Baby Name DNA and find the names that match your unique style. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access."
}