{
  "url": "https://en.wikipedia.org/wiki/List_of_fish_of_the_Persian_Gulf",
  "title": "List of fish of the Persian Gulf - Wikipedia",
  "text": "List of fish of the Persian Gulf Appearance This is a list of fish recorded from the Persian Gulf, a penetration of the Indian Ocean bordering Kuwait, Iran, Iraq, Qatar, Saudi Arabia, the United Arab Emirates, and an exclave of the sultanate of Oman. This list is mostly based on the IUCN Red List of Threatened Species[citation needed] and comprises locally used common names, scientific names and its relationship with humans, if needed. List ordering is phylogenetic and taxonomy complies where possible with the current usage in Fishbase, however outdated taxa as the result of splits or renames of synonymy will be updated accordingly. Cartilaginous fishes [edit]Orectolobiformes - groundsharks [edit]Lamniformes [edit]Carcharhiniformes - Requiem sharks, hammerheads, weaselsharks, and allies [edit]Torpedoniformes [edit]Rhinopristiformes - Skates, sawfish, and guitarfish [edit]Myliobatiformes - Rays [edit]Ray-finned fish [edit]Elopiformes [edit]Anguilliformes - Eels [edit]Clupeiformes - Herrings [edit]Gonorhynchiformes [edit]Siluriformes - Catfish [edit]Aulpiformes - Lizardfishes [edit]Zeiformes - Dories [edit]Scombriformes - Mackerels and relatives [edit]Mullidae - Goatfish [edit]Miscellaneous (Carangaria?) - Barracuda, threadfin, and moonfish [edit]Pleuronectoidei - Flatfish [edit]Carangiformes - Jacks, billfish, and allies [edit]Cichlidae [edit]Atheriniformes - Silversides [edit]Pupfish [edit]Beloniformes - Needlefish, Halfbeaks, and Flyingfish [edit]Mugilidae - Mullets [edit]Miscellaneous (Blenniformes?) - Damselfish [edit]Acanthuriformes - Butterflyfish, surgeonfish, angelfish and allies [edit]Tetraodontiformes - Pufferfish, filefish, sunfish and allies [edit] Centrarchiformes [edit]Miscallaneous (Eupercaria?) - Snappers, sillagines, breams, grunts, silver buddies, and drums [edit]Labriformes - Wrasses and Parrotfishes [edit] Perchlike fish [edit]Notes [edit]References [edit]- ^ Smith, David G.; Bogorodsky, Sergey V.; Dandar, James; Zajonz, Uwe (2024-07-10). \"A new species of short unpatterned moray eel (Anguilliformes: Muraenidae) from the northwestern Indian Ocean, including the Socotra Archipelago, with a redescription of Gymnothorax pseudoherrei Böhlke\". Zootaxa. 5477 (4): 465–474. doi:10.11646/zootaxa.5477.4.4. ISSN 1175-5334. PMID 39646069. - ^ a b c Jawad, L. A., Ziyadi, M. S. F., Näslund, J., Pohl, T., & Al-Mukhtar, M. A. (2018). Checklist of the fishes of the newly discovered coral reef in Iraq, north-west Persian Gulf, with 10 new records to the Persian Gulf. Aqua, Journal of Ichthyology and Aquatic Biology, 24(3), 89-138. - ^ Ghanaatian, H., Jamali, H., Pouladi, M., & Gankhaki, G. First Record of the Large-Scale Triggerfish (Canthidermis Macrolepis, Boulenger 1888) in the Persian Gulf. Available at SSRN 4966121. - ^ Ziyadi, Mustafa S. Faddagh; Al-Faisal, Abbas J.; Jawad, Laith A. (2023-04-01). \"Report of the Red-Toothed Triggerfish Odonus niger (Rüppell, 1836) from the North-East Region of the Arabian Gulf\". Thalassas: An International Journal of Marine Sciences. 39 (1): 209–213. Bibcode:2023TIJMS..39..209Z. doi:10.1007/s41208-022-00500-x. ISSN 2366-1674. - ^ a b Jawad, Laith A.; Ibrahim, Mustafa (2020-12-14). \"Two new fish with maximum size records from the Eastern coasts of Saudi Arabia\". Thalassia Salentina. 42 (2020): 83–92. doi:10.1285/i15910725v42p83. ISSN 1591-0725. - ^ \"Diplodus omanensis summary page\". - ^ Sørensen, Johan Mølgård; Torquato, Felipe; Faulkner, Lauren; Lowe, Christopher G.; Carrara, Mathieu; Godina, Alexei; Al-Jamali, Fahad; Ben-Hamadou, Radhouan; Møller, Peter Rask; Range, Pedro (2025-09-02). \"Species diversity, abundance, and biomass of fish at offshore platforms in the Persian Gulf\". Frontiers in Marine Science. 12 1589927. doi:10.3389/fmars.2025.1589927. ISSN 2296-7745. Sources [edit]- اسماك الكويت [Kuwait fish],[clarification needed] by Khalil Ibrahim Abdullah Hussein - Almojil, D. K.; Moore, A. B. M.; White, W. T. (2015). Sharks & Rays of the Persian Gulf. MGB (INT) Limited. ISBN 9780993042720. Retrieved 20 June 2025. - FishBase: Fish Species in Persian Gulf - IUCN red list[clarification needed] - Amani S.Y. Al-Zaidan (202). \"Fishes of the State of Kuwait - Common commercial species caught in coastal territorial waters\" (PDF). International Union for Conservation of Nature. Retrieved 20 June 2025. - Bolster, H.G. (1948). Fish of Persian and Oman Gulfs; Edible Fish in Persian Gulf. Washington, D.C.: U.S. Fish and Wildlife Service. Retrieved 2025-07-14. - Assadi, H. (1997). Atlas of the Persian Gulf & the Sea of Oman Fishes. Iranian Fisheries Research and Training Organization. ISBN 978-964-5513-15-1. Retrieved 2025-07-14. - Eagderi, Soheil; Fricke, Ronald; Esmaeili, Hamid Reza; Jalili, Paria (2019). \"Annotated checklist of the fishes of the Persian Gulf: Diversity and conservation status\". Iranian Journal of Ichthyology. 6 (Suppl. 1): 1–171."
}