{
  "url": "https://www.resetera.com/threads/mlb-2025-season-ot-dodgerball.1138392/page-86",
  "title": "MLB 2025 Season |OT| Dodgerball Sports - OT | Page 86 | ResetEra",
  "text": "We really got a top prospect for impending free agent Dustin May lmao. we will never stop fleecing the Red Sox We really got a top prospect for impending free agent Dustin May lmao. mlb seriously has the biggest chasm of owners in sports. they're gonna be back to the late 90s era of twins ballThey won a playoff series for the first time in decades, after the team spent money for the first time in decades, and they decided the best path was to cut payroll. Shameful stuff. They're trying to sell the team. I'm not sure that we could do worse than the Pohlads at this point, but if no one would buy the team at $1.7 billion because the payroll was too onerous I'm worried the new ownership will be some fucking broke boys as well.mlb seriously has the biggest chasm of owners in sports. they're gonna be back to the late 90s era of twins ball Braves / Reds bullpen not having a great time in the 8th inning. Game was 3-3 going into the 8th. It is now 11-11 with 1 out in the bottom of the 8th. Whoever said Bergman to the Dodgers in here should be banned 😂 😭 Jerks couldn't even give us RyanJesus Christ this roster looks barren as hell lol my buddy got me with the fake tweet. Sorry. We were texting on our group about the trades and he got us with that one for Dustin May lol 😭😭😭Whoever said Bergman to the Dodgers in here should be banned 😂 😭 Three of the acquisitions were relievers, who did you expect to see in there who isn't? Mullins? Maybe he'll come in as a defensive replacement or off the bench. I'm sure he'll get a start or two over the weekend.Pretty uninspiring lineup from the Mets after all that trade excitement. Hoping the Giants stay bad. He's at Citi Field and will probably get subbed in so more excited now!Three of the acquisitions were relievers, who did you expect to see in there who isn't? Mullins? Maybe he'll come in as a defensive replacement or off the bench. I'm sure he'll get a start or two over the weekend. As soon as a healthy dodgers pitcher returns another gets injured. View: https://bsky.app/profile/fabianardaya.bsky.social/post/3lvemsfdbys2w Wasted a Flaherty gem. I'll acknowledge him in dodger blue."
}