{
  "url": "https://chemistry.stackexchange.com/questions/140075/what-do-2s-3s-and-similar-notations-mean",
  "title": "organic chemistry - What do (2S,3S) and similar notations mean? - Chemistry Stack Exchange",
  "text": "When my textbook is discussing stereoisomers with more than one chiral centers, it's using notation like (2S,3S) being an enantiomer with (2R,3R) and so forth. I understand R and S configuration, and I'm guessing there are two items in each brackets to represent the two chiral centers (so 2S, 3S would at least mean that both chiral centers have an S configuration), but I don't understand what the numbers preceding the configuration mean. What does the 2 in 2S mean and what does the 3 in 3R mean? I was unable to find an explanation in the text and it seems that their meaning is assumed. Can I get some help? - 2$\\begingroup$ Same thing as in any formula - number of atom. I have a feeling you have a bad day ;) $\\endgroup$Mithoron– Mithoron2020-09-10 18:23:53 +00:00Commented Sep 10, 2020 at 18:23 - 1$\\begingroup$ The number refers to the carbon position in the molecule. R and S indicate the orientation around of the chiral atom. $\\endgroup$MaxW– MaxW2020-09-10 18:33:53 +00:00Commented Sep 10, 2020 at 18:33 - 1$\\begingroup$ @Mithoron No sir, just a momentary frustration. $\\endgroup$arara– arara2020-09-10 20:58:04 +00:00Commented Sep 10, 2020 at 20:58 3 Answers When naming a organic compound, S/R-notation comes if there is a chiral atom present. The S/R-notation always accompanies a numerical such as (2S,3R)- where the numerical refers to the chiral carbon position in the molecule according to the IUPAC numbering while R and S representate the orientation of the chiral atom according to the Cahn–Ingold–Prelog priority rules. For example, let's look at glyceraldehyde molecules where all this stereochemistry started from: The IUPAC name of glyceraldehyde is 2,3-dihydroxypropanal. However, it has a one chiral carbon at $\\ce{C}$2 and hence has two stereoisomers. The priority order of groups attached to chiral carbon is $\\ce{-OH \\gt -CHO \\gt -CH2OH \\gt -H}$. Hence you can look at the $1 \\rightarrow 2 \\rightarrow 3$ priority group rotation through the bond of chiral carbon and least priority group, which is $\\ce{H}$ here (though $\\ce{C-H}$ bond). Accordingly, the rotation for the first compound is clockwise as shown in the image, thus it carries (R)-notation. Since chiral carbon is 2 according to the IUPAC rules, the complete notation is (2R)-. Similarly, the mirror image is caring (2S)-notation since it has counterclockwise rotation as depicted in the image. Therefore complete names of these two isomewrs are (2R)-2,3-dihydroxypropanal and (2S)-2,3-dihydroxypropanal (Note that these isomers are called enantiomers). In addition, if a $\\ce{H}$ in $\\ce{C}$3 is replaced by another different group, say it is $\\ce{CH3}$ group, it will also become chiral and can have either (S) or (R) rotation. Suppose you replace $\\ce{H}$ in $\\ce{C}$3 of (2R)-2,3-dihydroxypropanal by a $\\ce{CH3}$ group making it has (S) rotation. By addition of $\\ce{CH3}$ group make it 2,3-dihydroxybutanal. With correct stereochemistry, its correct name is (2R,3S)-2,3-dihydroxybutanal. You appear to have an understanding of R/S nomenclature. The numbers, 2 and 3, are simply the carbons that are stereogenic. In the compounds shown below, the carbon bearing the hydroxyl group is C2 and not C3 because the hydroxyl group has priority over the bromine. Of course, carbon numbering begins at the terminus of the chain proximate to the hydroxyl group. (2S,3R)-3-Bromobutan-2-ol and (2S,3S)-3-bromobutan-2-ol are diastereomers of one another. Each one has an enantiomer, (2R,3S)-3-bromobutan-2-ol and (2R,3R)-3-bromobutan-2-ol, respectively. In your example, (2S,3S) and (2R,3R), you are dealing with enantiomers. I hope my example is of help to you. The 2 and 3 are just the second and third carbons in the longest carbon chain. For instance, take the molecule 1-chloro-1-fluoroethane. When you draw out the molecule, look for all carbons where there are four different $\\ce{R}$-groups, or side chains, attached. This means the carbon they are attached to is a chiral center. If a molecule has a chiral center, that means the molecule comes in at least two kinds of isomers called stereoisomers. Two isomers have a molecular formula that is the same, but the structures and arrangements of the two molecules are different. Stereoisomers are isomers where two molecules cannot be superimposed on one another because they are mirror images at the chiral center. In this case, one of the carbons is bonded to four different $\\ce{R}$-groups: a fluorine atom, a chlorine atom, a methyl group, and an unmarked hydrogen atom. Therefore, this is a chiral center, meaning it has two different mirror images: S and R. Since there is only one chiral center, then there are two chiral forms of this molecule: (1S)-1-chloro-1-fluoroethane and (1R)-1-chloro-1-fluoroethane. When only one chiral center exists, you can write it like this simply without parenthesis or numbers because we know which chiral center you are referring to since there is only one. For a harder example, take another molecule: 4-fluoro-3-methylheptane. You identify the longest chain, which is 8 carbons long. Then you look for all carbons with 4 different $\\ce{R}$-groups. In this case, they are the third and fourth carbons. The rest are bonded to at least 2 hydrogens, making them achiral. This means that there are four stereoisomers of this molecule: (3R,4R), (3R,4S), (3S,4R) and (3S,4S). If all chiral centers have mirror images of each other, then the two molecules are considered enantiomers, meaning the ENTIRE molecule is a mirror image of the other. There are two pairs of enantiomers: (3R,4R) and (3S,4S), as well as (3R,4S) and (3S,4R). They are enantiomers of each other because EVERY carbon center has its chirality reversed. If not all chiral centers are the same or different, then the two molecules are called diastereomers. There are 4 diastereomer combinations for this example, one of which is (3R,4R) and (3R,4S), because the chirality of carbon 2 is the same, but the chirality of carbon 3 is different. You can also determine the number of stereoisomers by calculating $2^n$, where $n$ is the number of chiral centers. For instance if a molecule has four chiral centers, then there will be ($2^4 = 16$) sixteen different stereoisomers. Finally, the last major trick with stereochemistry is meso-compounds. Two stereoisomers are meso-compounds if the molecule has a plane of symmetry or rotational symmetry. Meaning, if you can draw a line anywhere across the molecule in such a way where both sides are symmetrical, or rotate the molecule in such a way where you can get the same molecule without turning 360 degrees, there will be at least one set of meso-compounds present. Rotational symmetry is harder to notice and easier to forget to check for. When I took organic chemistry, we had a compound given to us for one of our exams that we had to draw out (at first with no stereochemistry in mind), identify the chiral centers, then draw out the stereoisomers, provide the parenthetic notation for each isomer, then identify a set of enantiomers, a set of diastereomers, and, if present, a set of meso-compounds. The compound our professor chose was 1,3-dicyclobutoxycyclopentane, which does have plane of symmetry, and therefore, has a set of meso-compounds."
}