{
  "url": "https://www.game-2048.com/es/",
  "title": "Juego 2048 - Jugar 2048 en línea",
  "text": "2048 es parte de los juegos en línea, es un juego de puzzle fácil y divertido. Aunque no te gusten los números, te encantará la dinámica del juego. Se juega en una cuadrícula de 4x4 usando las flechas direccionales o las teclas W, A, S, D del ordenador. En un teléfono móvil se juega con los dedos. Utiliza las flechas direccionales de un ordenador o los dedos de un teléfono móvil para mover baldosas de diferentes colores y valores con una animación de desplazamiento. Durante un movimiento, todos los azulejos del tablero se mueven en la misma dirección hasta que se encuentran con los bordes del tablero u otro azulejo en su camino. Cuando 2 azulejos del mismo número están uno al lado del otro, pueden fusionarse y formar un nuevo azulejo de doble valor (por ejemplo, dos azulejos de valor « 2 » dan un azulejo de valor « 4 »). Con cada movimiento, un azulejo con un 2 o un 4 aparece al azar en un cuadrado vacío. El juego de 2048 es simple al principio, pero se vuelve cada vez más complejo, debido a la falta de espacio para mover las fichas, y a los posibles errores de manipulación, que pueden llevar a un bloqueo de las fichas y, por tanto, al final del juego a más o menos largo plazo, dependiendo de la habilidad del jugador. El juego se gana cuando una ficha con el valor « 2048 » aparece en la cuadrícula, de ahí el nombre del juego « 2048 ». Sin embargo, puedes seguir jugando con fichas de valores más altos (4.096, 8.192, etc.) La máxima ficha que se puede alcanzar es teóricamente « 131.072 ». La máxima puntuación posible es de 3.932.156, y el máximo número teórico de movimientos es de 131.038. Cuando el jugador no tiene más movimientos posibles (no más espacios vacíos o fichas adyacentes con el mismo valor), el juego termina. La tecla R se usa para reiniciar un nuevo juego. Este juego es compatible con los teléfonos móviles y se puede jugar en cualquier dispositivo - iPhone, iPad o cualquier otro teléfono inteligente. El juego ha sido descrito como la cosa más adictiva de Internet y destronará a los juegos « Candy Crush y Flappy Bird ». El juego de 2048 ha sido programado por Gabriele Cirulli un desarrollador italiano independiente de 19 años, basado en el juego 1024 de Veewo Studio y el juego Threes! por Sirvo."
}