{
  "url": "https://www.google.com/finance/",
  "title": "Google Finance - Stock Market Prices, Real-time Quotes & Business News",
  "text": "format_list_bulleted Build a watchlist Sign in to track investments you care about You may be interested in info This list is generated from recent searches, followed securities, and other activity. Learn more All data and information is provided “as is” for personal informational purposes only, and is not intended to be financial advice nor is it for trading purposes or investment, tax, legal, accounting or other advice. Google is not an investment adviser nor is it a financial adviser and expresses no view, recommendation or opinion with respect to any of the companies included in this list or any securities issued by those companies. Please consult your broker or financial representative to verify pricing before executing any trades. Learn more All data and information is provided “as is” for personal informational purposes only, and is not intended to be financial advice nor is it for trading purposes or investment, tax, legal, accounting or other advice. Google is not an investment adviser nor is it a financial adviser and expresses no view, recommendation or opinion with respect to any of the companies included in this list or any securities issued by those companies. Please consult your broker or financial representative to verify pricing before executing any trades. Learn more - TSLATesla Inc$406.01-$15.953.78%add_circle_outline - BABAAlibaba Group Holding Ltd - ADR$159.14-$4.502.75%add_circle_outline - DISWalt Disney Co$107.05+$2.832.72%add_circle_outline - NXSTNexstar Media Group Inc$213.69+$5.582.68%add_circle_outline - AAPLApple Inc$276.49+$7.012.60%add_circle_outline - AMZNAmazon.com Inc$232.99-$5.632.36%add_circle_outline Today's financial news Top stories Local market World markets News is loading Market trends Earnings calendar Based on popular stocks Most followed on Google AAPL Apple Inc 3.71M following 2.60% add_circle_outline GOOGL Alphabet Inc Class A 2.16M following 1.96% add_circle_outline MSFT Microsoft Corp 1.84M following 0.72% add_circle_outline AMZN Amazon.com Inc 1.74M following 2.36% add_circle_outline META Meta Platforms Inc 1.58M following 3.28% add_circle_outline TSLA Tesla Inc 1.49M following 3.78% add_circle_outline"
}