{
  "url": "https://www.techtarget.com/whatis/definition/LinkedIn",
  "title": "What is LinkedIn and How Does it Work? | TechTarget",
  "text": "What is LinkedIn and how does it work? LinkedIn is a social networking site designed specifically for the business community. With over 1 billion members, its goal is to enable registered members to establish and document professional networks of people they know and trust. LinkedIn is also a resource for professionals to find jobs, research companies, get news about their industry, make business connections and participate in online training. LinkedIn gathers data from LinkedIn profiles to provide policymakers, employers, workers and educators with data-driven insight into patterns that help align workforce supply with demand worldwide. Such patterns include when people generally look for the next step in their career, work migration trends in specific geographical locations, skills gaps in specific industries and the \"stickiest\" cities -- or where employees are less likely to move away. Although LinkedIn is free, a subscription-based version called LinkedIn Premium provides additional features and benefits. What is the difference between LinkedIn and other forms of social media? Unlike other social networking sites, like Facebook, X (formerly Twitter) and Instagram, LinkedIn is designed specifically for business networking. LinkedIn is a more closed network, where members usually only connect with people they already know or have been introduced to by someone in their network. This makes LinkedIn ideal for building professional relationships rather than personal ones. LinkedIn offers features similar to other social networks, such as groups and discussion forums. However, its social media platform targets enterprise users, and LinkedIn is the only social media platform designed with business users in mind. Who created LinkedIn? LinkedIn was co-founded by Reid Hoffman, former executive vice president overseeing business and corporate development for PayPal, and Eric Ly, a former Sun and IBM employee. The site, which launched in May 2003, currently has 1.15 billion monthly active users worldwide, approximately 230 million of whom are from the U.S., and the remaining from over 200 countries and territories. Microsoft acquired LinkedIn in June 2016 for $26.2 billion. According to some experts, the rich troves of semi-structured data that LinkedIn's members freely give away -- job titles, geographies, industry information and skill sets -- made the deal a steal, even though the LinkedIn acquisition was one of Microsoft's more expensive purchases. What are LinkedIn's features? When a user logs in to LinkedIn, they are presented with the following features: - Home. Users can see and comment on posts made by other LinkedIn users. They can create their own posts for others to view, comment on, like and share. Network members are called connections. - My Network. Users can see their network of connections and search for and invite other LinkedIn users to join their network. - Jobs. This comprehensive career site enables users to search for jobs and receive notifications when new jobs are posted. Hiring companies can also post jobs and look for candidates. - Messaging. An instant messaging feature lets users chat with people in their network. They can also use InMail, a LinkedIn Premium feature, to send messages to people outside their network. - Notifications. Users receive notifications of posts and comments from their connections. - Me. The user's profile shows information similar to a resume, including career history, work experience, accomplishments and education. What are the benefits of LinkedIn? Linkedin offers subscribers the following benefits: Career development A full-featured job board enables users to search for and apply for jobs and build their skills through LinkedIn Learning courses. In late 2024, LinkedIn released several artificial intelligence-powered job search tools, which are available to Premium subscribers. Professional networking Users can build a professional network by connecting with colleagues, industry leaders and potential employers. Salespeople often use LinkedIn to generate leads and build relationships with potential customers. Business growth Users can enhance their professional reputation by posting in their news feeds and commenting on other people's posts. According to DemandSage, 97% of business-to-business (B2B) marketers use LinkedIn for content marketing. Job searching Recruiters use LinkedIn to find candidates for career opportunities, post jobs, research companies and connect with potential employees. Individuals can search for job titles and get information about companies of interest. Using the Open to Work feature, job seekers can enhance their visibility to recruiters, hiring managers and others in the LinkedIn community, letting them know they're looking for new job opportunities. Learning opportunities LinkedIn Learning offers more than 23,000 courses, including over 600 on career development -- from interviewing, writing a resume and job search skills to getting ahead in your career. Other course topics include technology, business, personal development and creative skills. How does membership to LinkedIn work? A LinkedIn member's profile page emphasizes skills, employment history and education. It has professional network news feeds and a limited number of customizable modules that enable the user to showcase skills, qualifications, job history, and references from colleagues and previous employers. LinkedIn's basic membership is free. What does a LinkedIn Premium subscription offer? In addition to the features available to basic members, LinkedIn Premium subscriptions offer the following features designed to help users be more productive and successful in their careers: - InMail messages can be sent to any member, even if they aren't connected to the user. This is a helpful feature for recruiters who often contact candidates they don't know personally during recruitment sessions. - Advanced search filters enable users to narrow their search results to find the right person they seek. - Profile views enable users to see who has viewed their profile and when. This is helpful when members are searching for new employment opportunities and want to know which potential employers might be reviewing their profiles. - Sales Navigator is a tool designed specifically for salespeople that provides access to leads, account details and contact information. - Free access to LinkedIn online training courses. LinkedIn Premium offers the following plans: - Premium Career. This subscription for professionals and job-seekers costs $29.99 a month or $239 annually. - Premium Business. This subscription is designed for small businesses and costs $59.99 per month or $575.88 annually. - Premium Sales Navigator. A core plan costs $99.99 monthly, and an Advanced plan costs $179.99 monthly. Pricing for an Advanced Plus plan is custom. - Premium Recruiter. Different tiers are available; contact LinkedIn for pricing. - Learning Premium. Pricing is $39.99 per month for individuals. Plans are also available for teams of less than 20 and organizations of more than 21 learners. All plans except LinkedIn Recruiter offer a free 30-day trial. How does someone sign up for a LinkedIn account? The following provides step-by-step instructions on how to sign up for a LinkedIn account: - Go to linkedin.com and click Join now. The user enters their first name, last name and email address and creates a password. They select country and region and primary language (e.g., English, Spanish, French). - Click Join LinkedIn. The user is taken to a page where they can complete their profile by adding information about work experience, education, skills and interests. - Once they've completed their profile, the user can connect with other LinkedIn members. Best practices for creating your LinkedIn profile While the process for signing up for a LinkedIn account is relatively simple, there are a few best practices to keep in mind to create a compelling LinkedIn profile: - Users should add a professional photo for their profile picture. This helps job seekers make a good first impression on potential employers or business contacts. - In the \"About\" section, include an overview of experience and skills. This is a great way for users to give potential employers or customers a snapshot of what they can do for a new job, a next job or a dream job. - In the \"Experience\" section, list all relevant work experience, including job titles, dates of employment and descriptions of previous and current responsibilities. - In the \"Education\" section, list all relevant educational degrees and coursework. - In the \"Skills\" section, list relevant skills or qualifications. These could include things like proficiency in specific software programs or languages. - Users should connect with other LinkedIn members they know and trust. This helps them build their network and expand their reach on the site. - Users should regularly update their LinkedIn profiles as their experience and skills grow. Ask colleagues to write a professional endorsement -- and provide one in return. This helps users ensure their profile is always current and eye-catching. Learn how B2B marketers use GenAI tools to connect with other businesses through LinkedIn."
}