{
  "url": "https://www.spanishdict.com/guide/how-to-pronounce-u-and-in-spanish",
  "title": "How to Pronounce \"U\" and \"Ü\" in Spanish | SpanishDictionary.com",
  "text": "Explanation The letter uin Spanish is pronounced like the letter group oo in moon or the letter u in June, but much shorter than in English and with rounded lips pushing forward. Compare the sound of oo and u in moon and June with the sound of u in their Spanish translations, lunaand junio. The letter u sometimes appears with two dots on top. That sign is called umlaut in English, or diéresisin Spanish. It means that the letter is actually pronounced as the vowel /u/ in spite of being part of the letter groups gue or gui, for example in the words cigüeña(stork) and lingüista(linguist). Written Vowels vs. Vowel Sounds In Spanish, each written vowel corresponds to a single vowel sound called a phoneme (fonema). There are five vowels in Spanish: a, e, i, o, and u. Although y is considered a consonant, it has the same sound as i in certain words and positions, such as hoy(today). Remember that the h is almost always silent in Spanish, so it does not make any sound in the word hoy above. The Sound of the Letter U How to Pronounce U in Spanish The letter u represents the Spanish vowel sound, or phoneme, /u/. Vowel sounds are made with your mouth open and not blocked by your tongue in any way. To properly pronounce the vowel u in Spanish, your lips should be rounded, pushing forward, and barely open. The back of your tongue should be close to your soft palate. Check it out in these words: uña(nail), Ucrania(Ukraine), vuelo(flight), cuna(cradle), and espíritu(spirit). Is the Spanish U Similar to the English U? Sometimes it is. It’s similar to the English u that can be heard in words like tube or flute, whose translations have the Spanish u sound too: tuboand flauta. However, remember that the Spanish u is much shorter in duration. Let’s look at some examples of words containing the letter u, whether the letter is stressed or unstressed, in different word positions and letter combinations. The Sound of the Letter Ü You might have noticed that the letter u sometimes appears with two dots on top. That sign is called umlaut in English, or diéresisin Spanish. It means that the letter is actually pronounced as the vowel /u/ in spite of being part of the letter groups gue or gui, for example in the words lingüística(linguistics) and pingüino(penguin). Let’s look at some examples of words containing the letter ü and what vowel the ü is combined with, either e or i. Now let's take a look at some sentences that contain u and ü in Spanish! Want to learn more about Spanish pronunciation? Check out the following articles! • How to Pronounce the Letter \"U\" in Spanish • SPA, IPA, and ABC Pronunciation"
}