{
  "url": "https://www.biendata.xyz/kdd2024/",
  "title": "KDD 2024",
  "text": "The objective of this workshop is to discuss the winning solutions of OAG-Challenge at KDD Cup 2024. This submission is single-blind (author names and affiliations should be listed). All participants listed in the Top-11 leaderboard will have a guaranteed opportunity for an in-person oral or poster presentation. Other submissions will be evaluated by a committee based on their novelty and insights. Important Dates: Full Paper Submission Deadline: The deadline for the submissions is July 20, 2024 (Anywhere on Earth time). Notification of Acceptance: August 1, 2024. Please note that the KDD Cup workshop will not have formal proceedings. Authors retain full rights to submit or publish their papers at other venues. Submission Website: https://openreview.net/group?id=KDD.org/2024/Workshop/OAG-Challenge_Cup Submission Requirements Format: Submissions must be in PDF format. Length: ▪ Submissions for each task: Maximum of 4 pages (including all content and references). Note: Teams winning at multiple tracks are required to submit separate reports for each track. Templates: Please use the ACM Conference templates (two-column format). One recommended setting for LaTeX files is: \\documentclass[sigconf, review]{acmart} .Template guidelines are here: https://www.acm.org/publications/proceedings-template Reproducibility Supplement: Authors may include an optional one-page supplement focused on reproducibility at the end of their submitted paper. This page must be part of the same PDF file. Author Information: After the submission deadline, the names and order of authors cannot be changed. It would be great if you could cite our dataset paper available at ArXiv. @inproceedings{zhang2024oag, title={OAG-Bench: A Human-Curated Benchmark for Academic Graph Mining}, author={Fanjin Zhang and Shijie Shi and Yifan Zhu and Bo Chen and Yukuo Cen and Jifan Yu and Yelin Chen and Lulu Wang and Qingfei Zhao and Yuqing Cheng and Tianyi Han and Yuwei An and Dan Zhang and Weng Lam Tam and Kun Cao and Yunhe Pang and Xinyu Guan and Huihui Yuan and Jian Song and Xiaoyan Li and Yuxiao Dong and Jie Tang}, booktitle={Proceedings of the 30th ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, year={2024} } Contact Information: For any questions, please contact: open-academic-graph@googlegroups.com ."
}