{
  "url": "https://play.google.com/store/apps/details?id=com.ebay.mobile&hl=en_US",
  "title": "eBay online shopping & selling - Apps on Google Play",
  "text": "With the eBay mobile app, buy and sell millions of items on the go. Discover exclusive deals every day in our online marketplace. Never miss a deal Online shopping and selling in the eBay app is simple. Get real-time alerts about Daily Deals, auctions, order updates, and so much more—all sent to your device with personalized push notifications. Give pre-loved items a new home. Whether you’re looking to sell clothing, tech, or car parts, our app is always at your fingertips. Quickly list items with AI Snap or upload a photo in the eBay app and let AI instantly generate descriptions and key details for your listing—including brand, category, and more. Search, find, and save faves ● Discover on-trend items: Buy fashion, handbags, jewelry, watches, and more. ● Shop by condition: Filter for new, pre-loved, used, or eBay Refurbished items. ● Shop by category: Browse fashion, jewelry, sneakers, tech, auto parts, and more. ● Sell and cash in: List used car parts, tech, clothing, and more. Create your own store to pass on your treasures. ● Heart your faves: Never miss the latest drops and deals when you save your most-loved finds. ● Search with pics: See something you like? Upload a photo and find matches instantly to buy it now. ● Top items for less: From car accessories to clothing, find high quality at the right price. Shop the sustainable way Discover the excitement of buying vintage and pre-loved items. With eBay, you can extend the life cycle of items, all while helping the planet. What’s not to love? Find new, pre-loved, and vintage fashion We’re on a mission to change the way people shop and sell fashion. With the eBay marketplace, you can find all your fave items in one place. Collect the easy way with PSA Vault Simply add PSA grading to eligible raw trading cards. With PSA Vault you can manage your entire portfolio and save money thanks to no sales tax and no storage or selling fees (withdrawal fee applies). Plus, you can find, price, and list gems at lightning speed. Get cars, auto parts, and accessories From new and used cars that fit your lifestyle to the parts and tools to revamp your vehicle, we’ve got you. Enter your car details in My Garage to find the right parts every time. Score eBay Live exclusives Your real-time shopping experience is here! Join the livestream for exclusive drops, live auctions, and case breaks. Connect with your community, fave sellers, and creators for more of the things you love. Authenticity Guarantee Shop with confidence. The Authenticity Guarantee checkmark means eligible trading cards, sneakers, watches, and handbags will be inspected and verified by expert authenticators. eBay Money Back Guarantee Enjoy total peace of mind thanks to the eBay Money Back Guarantee. With us, you’re covered. Get the item you ordered or your money back—it’s that simple.* *For full eligibility criteria and all terms and conditions visit: https://pages.ebay.com/ebay-money-back-guarantee/ Explore quick and easy payment options We make it easy to pay for the things you want in an instant. Simply store your preferred payments safely and securely so you can check out in a flash! Keep in touch Your feedback is important to us. Contact us with any questions by joining the discussion at www.ebay.com/android"
}