{
  "url": "https://stockanalysis.com/etf/jnug/",
  "title": "JNUG ETF Stock Price & Overview",
  "text": "Direxion Daily Junior Gold Miners Index Bull 2X Shares (JNUG) About JNUG Fund Home PageThe Direxion Daily Junior Gold Miners Index Bull 2X Shares (JNUG) is an exchange-traded fund that is based on the MVIS Global Junior Gold Miners index. The fund provides daily 2x exposure to an index of junior gold and silver mining companies from developed as well as emerging markets. JNUG was launched on Oct 3, 2013 and is issued by Direxion. Top 10 Holdings 119.16% of assetsDividend History Performance JNUG had a total return of 469.73% in the past year, including dividends. Since the fund's inception, the average annual return has been -32.89%. News Top Performing Leveraged/Inverse ETFs: 01/25/2026 Top Performing Leveraged/Inverse ETFs Last Week These were last week's top performing leveraged and inverse ETFs. Note that because of leverage, these kinds of funds can move quickly. Gold Miners Lead Direxion's 2025 Leveraged ETF Lineup Gold mining funds led Direxion's leveraged ETF lineup in 2025, outperforming the firm's semiconductor and AI-focused products, according to ETF Database. The Direxion Daily Junior Gold Miners Index Bu... Top Performing Leveraged/Inverse ETFs: 12/14/2025 Top Performing Leveraged/Inverse ETFs Last Week These were last week's top performing leveraged and inverse ETFs. Note that because of leverage, these kinds of funds can move quickly. Mining for Golden Opportunities? Try These 4 ETFs Gold has had a strong run in 2025, benefiting miners in the process. But does the rally still have legs or will it slow down to a proverbial crawl? The Prospects For The Leveraged JNUG ETF In 2026 Gold's bull market remains intact, with futures reaching $4,398 in October 2025 and prospects for further gains into 2026. Junior gold miners and leveraged ETFs like Direxion Daily Junior Gold Miners ... Wealthy investors tap ETFs for three hot assets, according to Goldman Sachs A new Goldman Sachs report reveals how family offices, a collection of the world's wealthy, are investing in hot areas including gold, cryptocurrency and artificial intelligence. JNUG: Fed Independence Debate A Trading Factor For Gold Gold's appeal strengthens in a rate cut environment as Treasuries lose yield advantage, making gold and correlated gold miners more attractive for allocators. Fed independence concerns and potential r... GDXJ And JNUG Outperform Gold During Recent Rally- GDXU Is Gold Mining On Steroids Gold remains in a strong long-term bullish trend, with junior gold miners and related ETFs delivering leveraged upside performance in 2025. GDXJ, JNUG, and GDXU have all significantly outperformed gol... JNUG: A Speculative Tool On Gold, Not A Hold JNUG is designed as a daily trading tool for leveraged exposure to junior gold miners, not as a long-term investment vehicle. The daily reset and use of derivatives cause performance decay over time, ... The Case For JNUG On A Correction In Gold Gold's long-term bull market continues, driven by economic and geopolitical factors, with the potential to surpass $3,000 per ounce, adjusted for inflation. Junior gold mining stocks, represented by G... JNUG: Turbocharging Junior Gold Miners Makes Timing Critical Gold rally since 1999 has seen significant growth, with December COMEX futures reaching $2,537.70 in July 2024. GDXJ is a junior gold mining ETF with over $5 billion in assets under management, provid... Direxion Junior Gold Miners Bull And Bear ETFs Allow Two-Way Plays For The Precious Metal Direxion Daily Junior Gold Miners Index Bull 2X Shares JNUG and Direxion Daily Junior Gold Miners Index Bear 2X Shares JDST both find themselves in the spotlight but for contrasting reasons. The forme... JNUG: Weak Performance Could Be An Opportunity Bitcoin and gold reach new record highs, leading the bullish charge in early 2024. Gold prices continue to rally, marking the 25th year of its bull market. JNUG: Only For The Most Active Investors Leveraged ETFs are not suitable for long-term investments due to their long-term decay from daily rebalancing. JNUG is designed to double the daily performance of the VanEck Junior Miners ETF. I belie..."
}