{
  "url": "https://support.microsoft.com/pt-br/windows/corrigir-problemas-de-bluetooth-no-windows-723e092f-03fa-858b-5c80-131ec3fba75c",
  "title": "Corrigir problemas de Bluetooth no Windows - Suporte da Microsoft",
  "text": "Corrigir problemas de Bluetooth no Windows Aplica-se a O Bluetooth é uma tecnologia amplamente utilizada para ligar dispositivos sem fios. No entanto, a ligação ao Bluetooth pode, por vezes, resultar em problemas. Este artigo aborda os problemas mais comuns relacionados com Bluetooth, como bluetooth não emparelhamento, problemas de áudio Bluetooth, Bluetooth em falta e muito mais, juntamente com soluções de resolução de problemas passo a passo para cada um. Executar a resolução de problemas do Windows Bluetooth Se estiver a utilizar um dispositivo Windows 11, comece por executar a resolução de problemas de Bluetooth automatizada na aplicação Obter Ajuda. Será executado automaticamente diagnóstico e tentará corrigir a maioria dos problemas de Bluetooth. Se estiver a utilizar uma versão mais antiga do Windows ou de um dispositivo móvel, avance para Problemas Comuns de Bluetooth na secção Windows 11. Execute a resolução de problemas em Obter Ajuda Se a resolução de problemas de Bluetooth na aplicação Obter Ajuda não conseguir resolve o problema, selecione o problema específico do Bluetooth na secção Common Bluetooth na secção Windows 11 abaixo e siga os passos indicados. Se o problema não estiver listado, consulte a secção Resolução geral de problemas de Bluetooth no Windows 11 e siga os passos descritos. Resolução de problemas gerais do Bluetooth no Windows 11 Experimente os seguintes passos gerais de resolução de problemas para ajudar a resolver o problema do Bluetooth. Se você estiver configurando um novo dispositivo e o Bluetooth estiver ausente, verifique as especificações do produto para garantir que o dispositivo tenha funcionalidades de Bluetooth. Alguns dispositivos não têm Bluetooth. Além disso, se você estiver usando um notebook com um comutador Bluetooth físico, verifique se ele está ligado. No Windows 11, há duas maneiras de verificar se o Bluetooth está ativado. Veja como: - Verifique as definições rápidas: Selecione os ícones Rede, Som ou Bateria ( ) no lado direito da barra de tarefas, procure a definição rápida Bluetooth e, em seguida, selecione Bluetooth para ativá-la. Verá \"Não ligado\" se o seu dispositivo Windows 11 não estiver ligado a acessórios Bluetooth. - Verifique as Definições: Selecione Iniciar > Definições > dispositivos & Bluetooth. Certifique-se de que o Bluetooth está ativado. Observações: - Ao ativar o Bluetooth em Configurações, a seguinte mensagem é exibida imediatamente: - \"Detetável como <computer_name>\" Verifique se seu dispositivo Bluetooth está ativado, carregado ou tem baterias novas, e esta dentro do alcance do seu PC. Em seguida, tente o seguinte: - Desligue o dispositivo Bluetooth, aguarde alguns segundos e ligue-o novamente. - Verifique se seu dispositivo Bluetooth está ao alcance. Se o dispositivo Bluetooth não estiver respondendo ou se estiver lento, verifique se ele não está muito próximo de qualquer outro dispositivo USB conectado a uma porta USB 3.0. Às vezes, os dispositivos USB sem blindagem podem interferir nas conexões Bluetooth. Se não vir o seu dispositivo Bluetooth apresentado na lista de dispositivos, poderá ter de definir a definição de deteção de dispositivos Bluetooth como Avançadas. - Selecione Iniciar > Configurações > Bluetooth e dispositivos > Dispositivos. - Em Definições do dispositivo > deteção de dispositivos Bluetooth, escolha uma das seguintes opções na lista pendente: - Predefinição — apresenta dispositivos Bluetooth comuns - Avançadas — apresenta todos os tipos de dispositivos Bluetooth - - Se ainda não vir o seu dispositivo Bluetooth apresentado depois de selecionar a definição Avançadas , experimente as soluções listadas abaixo. No computador que você quer renomear: - Verifique se o modo avião está desligado: Selecione os ícones Rede, Som ou Bateria () no lado direito da barra de tarefas e, em seguida, certifique-se de que a definição rápida Modo de avião está desativada. - Ativar e desativar o Bluetooth: Selecione Iniciar > Definições > dispositivos & Bluetooth. Desative o Bluetooth , aguarde alguns segundos e, em seguida, volte a ativá-lo. - Remova o dispositivo Bluetooth e o adicione novamente: Selecione Iniciar > Configurações > Bluetooth e dispositivos > Dispositivos. Em Dispositivos, selecione Mais opções para o dispositivo Bluetooth ao qual está a ter problemas de ligação e, em seguida, selecione Remover dispositivo > Sim. Para saber mais sobre como emparelhar novamente o seu dispositivo Bluetooth, consulte Emparelhar um dispositivo Bluetooth. Selecione Iniciar Definições de > > Resolução de Problemas do > do Sistema > Outras Resoluções de Problemas . Junto a Bluetooth , selecione Executar e siga as instruções. Se você fez o upgrade recentemente para o Windows 11 ou instalou atualizações do Windows 11, o driver atual pode ter sido projetado para uma versão anterior do Windows. Para verificar automaticamente se há atualizações de driver: - Selecione Procurar na barra de tarefas, escreva gestor de dispositivos e, em seguida, selecione Gerenciador de Dispositivos da lista de resultados. - No Gerenciador de Dispositivos, selecione Bluetooth e, em seguida, selecione o nome do adaptador Bluetooth, que pode incluir a palavra “rádio”. - Prima sem soltar (ou clique com o botão direito do rato) o adaptador Bluetooth e, em seguida, selecione Atualizar controlador > Procurar automaticamente software do controlador atualizado. Siga as etapas e selecione Fechar. - Depois de instalar o controlador atualizado, selecione Iniciar > Ligar /desligar> Reiniciar se lhe for pedido para reiniciar e, em seguida, marcar se isso corrige o problema de ligação. Se o Windows não encontrar um novo driver Bluetooth para o adaptador de rede, acesse o site do fabricante do computador e baixe o driver Bluetooth mais recente do adaptador de rede. Importante: Um driver incompatível ou desatualizado é uma das causas mais comuns de problemas de conexão Bluetooth. Para instalar manualmente o driver do Bluetooth: Acesse o site do fabricante do computador e baixe o driver mais recente. Em seguida, escolha um destes métodos: - Se você tiver baixado um arquivo executável (.exe), basta clicar duas vezes no arquivo para executá-lo e instalar os drivers. Isso deve ser tudo o que você precisa fazer. - Se você baixou os arquivos individuais e pelo menos um arquivo tem uma extensão de nome de arquivo .inf e outro tem uma extensão .sys, faça o seguinte: - Selecione Procurar na barra de tarefas, escreva gestor de dispositivos e, em seguida, selecione Gerenciador de Dispositivos da lista de resultados. - No Gerenciador de Dispositivos, selecione Bluetooth > o nome do adaptador Bluetooth. (Se não estiver listado lá, verifique em Outros dispositivos.) - Prima sem soltar (ou clique com o botão direito do rato) o adaptador de rede e, em seguida, selecione Atualizar controlador > Procurar controladores no computador. - Selecione Procurar, selecione o local onde os arquivos do driver estão armazenados e, em seguida, selecione OK. - Selecione Avançar e siga as etapas para instalar o driver. Quando a instalação terminar, selecione Fechar. - Depois de atualizar o controlador, selecione Iniciar > Ligar /desligar > Reiniciar se lhe for pedido para reiniciar e marcar se isso corrige o problema de ligação. - Se você não estiver vendo o ícone de Bluetooth, mas o Bluetooth aparecer no Gerenciador de dispositivos, tente desinstalar o adaptador Bluetooth e, em seguida, acione uma reinstalação automática. Veja como: - Selecione Procurar na barra de tarefas, introduza gestor de dispositivos e, em seguida, selecione Gerenciador de Dispositivos a partir dos resultados. - No Gerenciador de dispositivos, selecione Bluetooth. Prima sem soltar (ou clique com o botão direito do rato) o nome do adaptador Bluetooth (que pode incluir a palavra \"rádio\") e selecione Desinstalar dispositivo > Desinstalar. - Selecione Iniciar e, em seguida, selecione Ligar /desligar > Encerrar . - Depois que o dispositivo desligar, aguarde alguns segundos e ligue-o novamente. O Windows tentará reinstalar o driver. - Se o Windows não reinstalar o controlador automaticamente, abra Gerenciador de Dispositivos e selecione Ação > Procurar alterações de hardware. Observação: Talvez seja necessário entrar em contato com o fabricante do seu PC ou do outro hardware para obter os drivers mais recentes para seu adaptador Bluetooth. Problemas comuns de Bluetooth no Windows 11 A lista a seguir descreve os problemas bluetooth mais comuns no Windows 11. Selecione um link para exibir as etapas de solução de problemas para cada problema. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. O Bluetooth é uma tecnologia amplamente usada para conectar dispositivos sem fio. No entanto, a conexão com o Bluetooth às vezes pode resultar em problemas. Este artigo aborda os problemas mais comuns relacionados ao Bluetooth, como bluetooth não emparelhamento, problemas de áudio Bluetooth, Bluetooth ausente e muito mais, juntamente com soluções de solução de problemas passo a passo para cada um. Executar a solução de problemas do Bluetooth do Windows Se você estiver usando um dispositivo Windows 10, comece executando a solução de problemas bluetooth automatizada no aplicativo Obter Ajuda. Ele executará automaticamente diagnóstico e tentará corrigir a maioria dos problemas de Bluetooth. Se você estiver usando uma versão mais antiga do Windows ou de um dispositivo móvel, pule para problemas comuns de Bluetooth na seção Windows 10. Executar a solução de problemas em Obter ajuda Se a solução de problemas bluetooth no aplicativo Get Help não puder resolve seu problema, selecione seu problema de Bluetooth específico na seção Problemas comuns de Bluetooth na seção Windows 10 abaixo e siga as etapas fornecidas. Se o problema não estiver listado, consulte a solução geral de problemas do Bluetooth na seção Windows 10 e siga as etapas descritas lá. Solução de problemas de Bluetooth geral no Windows 10 Tente as seguintes etapas gerais de solução de problemas para ajudar a resolver o problema do Bluetooth. Antes de começar Se você estiver configurando um novo dispositivo e o Bluetooth estiver ausente, verifique as especificações do produto para garantir que o dispositivo tenha funcionalidades de Bluetooth. Alguns dispositivos não têm Bluetooth. Além disso, se você estiver usando um notebook com um comutador Bluetooth físico, verifique se ele está ligado. No Windows 10, há duas maneiras de verificar se o Bluetooth está habilitado. Veja como fazer: - Verifique na barra de tarefas. Selecione central de ações ( ou ). Se você não vir o Bluetooth, selecione Expandirpara revelar Bluetooth, em seguida, selecione Bluetooth para ativá-lo. Você verá \"Não conectado\" se o dispositivo Windows 10 não estiver emparelhado com os acessórios Bluetooth. - Verifique em Configurações. Selecione o botão Iniciar botão e selecione Configurações > Dispositivos > Bluetooth e outros dispositivos . Verifique se o Bluetooth está ativado. Observações: - Ao ativar o Bluetooth em Configurações, a seguinte mensagem é exibida imediatamente: - \"Agora detectável como <computer_name>\" Verifique se o dispositivo está ligado, se está carregado ou se tem baterias novas, e se está ao alcance do computador ao qual você deseja se conectar. Em seguida, tente o seguinte: - Desligue o dispositivo Bluetooth, aguarde alguns segundos e ligue-o novamente. - Verifique se seu dispositivo Bluetooth está ao alcance. Se o dispositivo Bluetooth não estiver respondendo ou se estiver lento, verifique se ele não está muito próximo de qualquer outro dispositivo USB conectado a uma porta USB 3.0. Às vezes, os dispositivos USB sem blindagem podem interferir nas conexões Bluetooth. Se você não vir seu dispositivo Bluetooth exibido na lista de dispositivos, talvez seja necessário definir a configuração de descoberta de dispositivos Bluetooth. - Selecione Iniciar > Configurações > Bluetooth & outros dispositivos. - Na janela Configurações de Bluetooth, clique em Mais opções de Bluetooth (à direita ou em Configuração Relacionada\"). - A caixa de diálogo Configurações do Bluetooth será aberta. - Acesse a guia Opções . - Verifique a caixa rotulada Permitir que dispositivos Bluetooth encontrem esse computador para que o computador seja detectável. No computador que você quer renomear: - Verifique se o modo avião está desligado: Selecione Iniciar e selecione Configurações > Rede e Internet > Modo avião . Verifique se o Modo avião está desligado. - Ativar ou desativar o Bluetooth: Selecione Iniciar e selecione Configurações > Dispositivos > Bluetooth e outros dispositivos . Desligue o Bluetooth, aguarde alguns segundos e ligue-o novamente. - Remova o dispositivo Bluetooth e adicione-o novamente: Selecione Iniciar e selecione Configurações > Dispositivos > Bluetooth e outros dispositivos . Em Bluetooth, selecione o dispositivo com o qual você tem problemas para se conectar e, em seguida, selecione Remover dispositivo > Sim. Para saber mais sobre como emparelhar seu dispositivo Bluetooth novamente, consulte Emparelhar um dispositivo Bluetooth. Selecione Iniciar e selecione Configurações > Atualização e Segurança > Solução de problemas . Em Localizar e corrigir outros problemas, selecione Bluetooth, e então selecione Executar a solução de problemas e siga as instruções. Se você fez upgrade recentemente para o Windows 10 ou instalou atualizações do Windows 10, o driver atual pode ter sido desenvolvido para uma versão anterior do Windows. Para verificar automaticamente se há atualizações de driver: - Na caixa de pesquisa na barra de tarefas, pesquise por Gerenciador de dispositivos e selecione Gerenciador de dispositivos na lista de resultados. - No Gerenciador de dispositivos, selecione Bluetoothe selecione o nome do adaptador do Bluetooth, que pode incluir a palavra \"rádio\". - Pressione e segure (ou clique com o botão direito do mouse) o adaptador Bluetooth e selecione Atualizar driver > Pesquisar automaticamente pelo software de driver atualizado. Siga as etapas e selecione Fechar. - Depois de instalar o driver atualizado, selecione o botão Iniciar e então selecione Ligar/Desligar > Reiniciar se a reinicialização for solicitada e confira se isso corrige o problema de conexão. Se o Windows não encontrar um novo driver Bluetooth para o adaptador de rede, acesse o site do fabricante do computador e baixe o driver Bluetooth mais recente do adaptador de rede. Importante: Um driver incompatível ou desatualizado é uma das causas mais comuns de problemas de conexão Bluetooth. Para instalar manualmente o driver do Bluetooth: Acesse o site do fabricante do computador e baixe o driver mais recente. Em seguida, escolha um destes métodos: - Se você tiver baixado um arquivo executável (.exe), basta clicar duas vezes no arquivo para executá-lo e instalar os drivers. Isso deve ser tudo o que você precisa fazer. - Se você baixou os arquivos individuais e pelo menos um arquivo tem uma extensão de nome de arquivo .inf e outro tem uma extensão .sys, faça o seguinte: - Na caixa de pesquisa na barra de tarefas, digite Gerenciador de dispositivos e selecione Gerenciador de dispositivos na lista de resultados. - No Gerenciador de dispositivos, selecione Bluetooth > o nome do adaptador do Bluetooth. (Se não estiver listado, verifique em Outros dispositivos.) - Pressione e segure (ou clique com o botão direito do mouse) o adaptador de rede e selecione Atualizar driver > Procurar software de driver no computador. - Selecione Procurare selecione o local onde os arquivos de driver são armazenados e selecione OK. - Selecione Avançare siga as etapas para instalar o driver. Quando a instalação for concluída, selecione Fechar. - Depois de atualizar o driver, selecione o botão Iniciar e então selecione Ligar/Desligar > Reiniciar se a reinicialização for solicitada e confira se isso corrige o problema de conexão. - Se você não visualizar o ícone de Bluetooth, mas se o Bluetooth aparece no Gerenciador de Dispositivos, tente desinstalar o adaptador Bluetooth e, inciar uma reinstalação automática. Veja como fazer: - Na caixa de pesquisa na barra de tarefas, digite gerenciador de dispositivose selecione Gerenciador de dispositivos nos resultados. - No Gerenciador de dispositivos, selecione Bluetooth. Pressione e segure (ou clique com botão direito) o nome do adaptador Bluetooth (que pode incluir a palavra \"rádio\") e selecione Desinstalar dispositivo. - Selecione Iniciar e escolha Ligar > Desligar . - Depois que o dispositivo desligar, aguarde alguns segundos e ligue-o novamente. O Windows tentará reinstalar o driver. - Se o Windows não reinstalar o driver automaticamente, abra o Gerenciador de dispositivos e selecione Ação > Verificar se há alterações de hardware. Observação: Talvez seja necessário entrar em contato com o fabricante do computador ou de outro hardware para obter os drivers mais recentes para o adaptador Bluetooth. Problemas comuns de Bluetooth no Windows 10 A lista a seguir descreve os problemas bluetooth mais comuns no Windows 10. Selecione um link para exibir as etapas de solução de problemas para cada problema."
}