{
  "url": "https://www.thenationalnews.com/news/mena/2025/12/12/aleppo-rises-from-ruins-but-waits-to-feel-richer-for-it/",
  "title": "Aleppo rises from ruins – but waits to feel richer for it | The National",
  "text": "Aleppo’s medieval citadel looms through the fog, with children playing on its stone fortifications and in the empty moat below. From its parapets, the view over the city – half teeming with people, half lying in ruins – tells a story of gradual change and the colossal challenges ahead in Syria’s second city. The citadel, damaged by the civil war and an earthquake in 2023, reopened to visitors in September and now welcomes up to 5,000 people a day at weekends. Heavier traffic and busier souqs hint at the return of more than half a million people to Aleppo province since fighting in the civil war ended a year ago. “This place has a soul,” Mohammed Habbaq, the citadel’s director, told The National, as he surveyed its winding streets, baths and the site of an ancient temple, still complete with sandbags put in place by the former regime. Repair work by a building conglomerate from northern Syria has added new water and lighting systems. It is busier and safer – but Aleppo is still waiting to feel richer. For all the talk of a Syrian economic rebirth, residents complain they are yet to see a cent of the higher salaries pledged by the new government, while living conditions for many remain meagre as President Ahmad Al Shara begins his second year in power. A year since the fall of the regime of president Bashar Al Assad, and since The National’s last visit to Aleppo, the ability to speak freely is still a relative novelty for the city’s residents. “Everything changed, because right now I feel really free and I can have fun with my groups. I can tell them the truth about everything, not like before,” said tour guide Tambi Abraham, 40, as he led a group of foreign visitors around the citadel. In the citadel’s stepped theatre, some of them tested the echo by singing the Spice Girls song Wannabe. Over the past year, more than 600,000 Syrians have returned to Aleppo province from elsewhere in the country and abroad, according to figures from the International Organisation for Migration. Many came back from Turkey, and bus companies promote cross-border journeys advertised in Turkish and Arabic. The number of people who burst into fluent Turkish on the city’s streets is a reminder of their time in exile. Many buildings in Aleppo, one of the world’s oldest continually inhabited cities, remain clearly abandoned or destroyed. Elsewhere, signs of those returned are clear to see. Souqs and other streets are busier and better lit. In places, chalky white new building blocks contrast with the war-damaged old stones on building facades, showing some attempts at reconstruction. Snarling traffic queues point to an influx of new cars. Mr Habbaq said the new government and Aleppo governorate worked with locals who \"told them what we knew about the citadel needs, and what were the quickest things we could do to enable visitors to return to the citadel\". Signs of progress Barista Mohammed Al Mohsen, 36, returned to Syria from 13 years of exile in Turkey and Saudi Arabia “straight after” the fall of the Assad regime, and later found work in the Bursa Cafe, named after the city in Turkey of its owners’ exile. Improvements in living conditions are “slow, but there are improvements,” he told The National from behind the coffee shop bar, which was decked out with sachets of coffee imported from Turkey and locally produced chocolate bars. “There is more electricity, more job opportunities. Previously we were lacking basic essentials.” He opposed the idea that Mr Al Shara’s government has been overly focused on foreign policy and had not paid enough attention to domestic issues. “There are other people working on those in the state,” he said. But there are still things to improve in Syria’s second largest urban centre and the capital of a province home to a fifth of the country’s population. “The electricity, rubbish collection, the state of the roads” are all things that still need work, Mr Al Mohsen added. That Aleppo’s residents now complain more about mundane things like bad traffic and rubbish collection, rather than imminent threats to their lives, is a sign of improvement in living conditions. The city, once partly besieged by Assad regime troops and bombed by their ally Russia, was the first major centre to be captured by then-rebels in their lightning strike a year ago. Their subsequent advance to Damascus led to the fall of 50 years of rule by the Assad family. Residents do expect the new government and its security forces to maintain the relative stability they have so far managed to maintain. Despite its ethnic and religious mix, Aleppo has mostly avoided the type of sectarian violence that has blighted coastal Syria and other cities such as Homs and Sweida. Residents say that is partly because most regime commanders from the area had fled abroad and few remained in the city, lessening the chances of revenge attacks. One Christian businessman acknowledged that there were extremist groups threatening minorities but said the new internal security forces were working to protect them from attack, rather than encouraging persecution of minorities. “They put security forces outside our churches for Sunday services to protect us against the fanatics,” he told The National. Abdullatif Arnab, from a family of Aleppan soap makers, compared how “Assad burnt the country” to how he believes the new government “is building the country\". He wants the security forces to maintain safety and stability. “I don’t want anything from them except that they keep the situation as it is – nice and safe,” he told The National, sitting in front of piles of the city’s renowned laurel soaps. Salaries fall short Other shopkeepers say their situation will not improve until economic conditions overall do, and allow residents more disposable income. More than 90 per cent of Syrians live below the poverty line and, despite announcements of a 200 per cent increase in civil servants and the military in June, salaries of about $120 a month fall well short of covering essentials. “There can’t be a normal state of affairs for traders until people’s economic situation improves,” said a shopkeeper selling ornate boxes, when asked what the government needed to do to improve conditions for small traders. “People see things like these mother-of-pearl boxes as luxuries, not essentials. People who buy them are those who live in Europe and want a present for someone. But the people here don’t feel like they can buy.” Unlike the one renovated section where the Arnab family shop is located, much of the old city souqs still lie in ruins. Paths have been carved through piles of rubble and half-collapsed shops, and an old man who says he lives in the ruins sells plastic trinkets there. “I sleep here, my house was bombed, and I haven’t seen my family for 10 years,” he said, clutching at his tattered grey overcoat. Mohammed Al Kar runs the Aleppo Chamber of Commerce from the first floor of Al Emir hotel, from smart, wood-panelled rooms. But the upper floors are broken and abandoned, in a peculiar contrast that indicates the scale of recovery still needed. Physical reconstruction aside, Mr Al Kar is aware that low incomes, a lack of cash flow and long idle and corruption-ridden industrial sectors are holding back further improvements to people’s living conditions. Continuing sanctions have prevented pledges for financing public sector salaries from Saudi Arabia and Qatar from becoming reality, he told The National. “Not a single cent of the salaries has entered our coffers,” he said. Salaries are currently being financed from taxes and levies at border crossings, although he expected progress on foreign support after the lifting of US sanctions under the Caesar Act, which Congress moved to repeal this week. Foreign investment is still a huge need, added Mr Al Kar, with a country that is “below zero” needing investment in the textiles, electronics, spare parts and food processing industries. “We need investment in all sectors, and I am not exaggerating at all, in all industrial sectors and in all commercial sectors,” he said. Amendments in July to Syria’s laws, including tax and customs breaks, the ability to open foreign currency bank accounts and improved property ownership rights, are helping to attract foreign investment from Turkey, Gulf countries and elsewhere. South Korean car companies Hyundai and Kia are considering opening two factories in Syria to serve the wider region, he said. “I was at the Syrian-Korean Economic Conference in Damascus recently. South Korea is now considering opening Hyundai and Kia factories in Syria to serve as a hub for the Middle East for electric cars and diesel and petrol vehicles. God willing, the plan is for them to be operational in 2027. It will supply the Gulf, Turkey, Iraq and Iran.” Russian and Iranian companies, which dominated the Syrian economy under the Assad regime, will have a harder time competing in a country that has shown its intentions to align itself with the West and Middle Eastern neighbours, Mr Al Kar believes. Investors from Moscow and Tehran want to return to Syria, he said, but face stiff competition from Syria’s new allies. “I see it that given the lure of the Gulf states, Turkey and Europe, their role will be weak because those countries have much greater investment and consumption power than them,” he said. The economy aside, Aleppans hope that Syria’s new era will enable their city to regain its place among the world’s great historical cities, not one associated with modern dictatorship and conflict. “Aleppo must return to its proper position, like it was, not like how the regime isolated it,” said the box seller in the old souq. “Unfortunately, there are many people in Europe who have not heard of Aleppo. They have heard of Athens and Rome, but not of Aleppo. And maybe Aleppo is older than them.” Additional reporting by Ahmad Mohammad"
}