{
  "url": "https://help.hbomax.com/us-en/Answer/Detail/000002578",
  "title": "HBO Max | Find out about the Disney+, Hulu, HBO Max Bundle, including how to sign up.",
  "text": "Help with the Disney+, Hulu, HBO Max Bundle With the Disney+, Hulu, HBO Max Bundle, you can subscribe to get access to all 3 apps for a discounted price. After you sign up, you need to activate your new accounts to stream on all 3 services. Bundle Q&A When you subscribe to the Disney+, Hulu, HBO Max Bundle, you can sign in to all 3 apps and stream each service on a supported device. You can choose from 2 bundle options: - With Ads: $19.99/month* Includes HBO Max Basic with Ads, Disney+ Basic, and Hulu (With Ads) - No Ads: $32.99/month* Includes HBO Max Standard, Disney+ Premium, and Hulu (No Ads)** **Ads will be served in select live and linear content *Prices don't include applicable taxes The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle. The Disney+, Hulu, HBO Max Bundle offers a broad selection of content from brands including Disney, HBO, Hulu Originals, Pixar, CNN, FX, Discovery, ABC, Searchlight, Marvel, DC, HGTV, Food Network, Star Wars, National Geographic, and many more. You can stream all content available with the subscription plan you choose. Here are the bundle options: - With Ads: HBO Max Basic with Ads, Disney+ Basic, and Hulu (With Ads) - No Ads: HBO Max Standard, Disney+ Premium, and Hulu (No Ads)* *Ads will be served in select live and linear content The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle. You can watch bundle content on different devices. Find out which devices are supported by each app: Each app has its own content offering. You can stream all content available with the subscription plan you choose. Simply sign in to the app you want to stream to find content available on that app. At this time, add-ons and other plans (namely, the HBO Max Premium plan, Hulu + Live TV, and the HBO Max Extra Member Add-On) are not available for purchase with the Disney+, Hulu, HBO Max Bundle. How you get the bundle depends on whether you've subscribed to HBO Max (or Disney+ or Hulu) before: You can sign up on the web or sign up on a Roku device. Sign up on the web You can sign up for the bundle on the web directly through HBO Max, Disney+, or Hulu. Here's how to sign up for the bundle at HBOMax.com: - Go to HBOMax.com/bundle/disney-plus-hulu and choose the With Ads or No Ads plan. (The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle.) - Enter an email address for your HBO Max account and continue. - Complete the account form and choose Create Account. Looks like you have an existing subscription message. - Add your payment method and start your subscription. - Choose Set up Hulu & Disney+ to set up your Hulu and Disney+ accounts. Now you can sign in and stream HBO Max on any supported device. Your subscription will auto-renew monthly until you cancel. Sign up on a Roku device You can sign up for the bundle using the HBO Max app on a Roku device. Here's how to sign up for the bundle on your Roku: - Open HBO Max and choose Subscribe Now. - On the Bundles tab, choose With Ads or No Ads and continue. (The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle.) - Next, you'll have two options: - Choose Continue to share your Roku account information (your name and email address). - Choose Cancel and enter your account information manually. - Review your email address and create a password, then choose Continue. - Review your name and choose Create Account. Looks like you have an existing subscription message. - Follow the on-screen instructions to subscribe. - Scan the QR code on your TV to set up your Hulu and Disney+ accounts. Now you can sign in and stream HBO Max on any supported device. Your subscription will auto-renew monthly until you cancel. Need help? Go to Troubleshooting. You can sign up on the web or sign up on a Roku device. Sign up on the web You can sign up for the bundle on the web directly through HBO Max, Disney+, or Hulu. Here's how to sign up for the bundle at HBOMax.com: - Go to HBOMax.com/bundle/disney-plus-hulu and choose the With Ads or No Ads plan. (The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle.) - Enter your HBO Max account email address and continue. - Enter your HBO Max account password and choose Sign In. Looks like you have an existing subscription message. - Review your payment method and choose Pay Now. - Choose Set up Hulu & Disney+ to set up your Hulu and Disney+ accounts. Now you can sign in to HBO Max and stream on any supported device. Your subscription will auto-renew monthly until you cancel. Sign up on a Roku device You can sign up for the bundle using the HBO Max app on a Roku device. Here's how to sign up for the bundle on your Roku: - Open HBO Max and sign in to your HBO Max account. Can't sign in? - Choose Renew Subscription. - On the Bundles tab, choose With Ads or No Ads and continue. (The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle.) - Follow the on-screen instructions to subscribe. - Scan the QR code on your TV to set up your Hulu and Disney+ accounts. Now you can sign in to HBO Max and stream on any supported device. Your subscription will auto-renew monthly until you cancel. Need help? Go to Troubleshooting. You can switch to the bundle. Go to How do I switch to the bundle? to find out how. You may need to activate your HBO Max, Disney+, or Hulu account before you can start streaming. How you activate depends on how you signed up. How did you sign up for the bundle? If you signed up for the bundle at HBOMax.com, your HBO Max account is already activated. Here's how to activate your Disney+ and Hulu accounts: - Sign in to HBO Max on your phone, tablet, or computer. Can't sign in? - Choose your profile and then Subscription. (Only Adult profiles can manage subscriptions.) - Choose Set up Hulu & Disney+ to set up your Hulu and Disney+ accounts. For help setting up your Disney+ and Hulu accounts, go to Hulu's Activating your Hulu subscription article. If you signed up for the bundle using the HBO Max app on a Roku device, your HBO Max account is already activated. Here's how to activate your Disney+ and Hulu accounts: - Sign in to HBO Max on your Roku device. Can't sign in? - Choose the Settings icon and then Subscription. (Only Adult profiles can manage subscriptions.) - Open your phone's camera app and point your camera at the QR code on your TV. - Tap the link that appears on your phone and set up your Hulu & Disney+ accounts. Note You can also set up your Hulu & Disney+ accounts by following the steps in the Signed up at HBOMax.com section above. For help setting up your Disney+ and Hulu accounts, go to Hulu's Activating your Hulu subscription article. If you signed up for the bundle through Disney+, your Disney+ and Hulu plans are already activated. Here's how to activate your HBO Max account: - On your phone or computer, sign in to your Hulu account at hulu.com/account or your Disney+ account at disneyplus.com/account. - Choose the HBO Max logo or activate link. - On the first HBO Max screen, enter an email address for your HBO Max account and choose Continue. - Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code). This email should arrive within a few minutes. - Enter the 6-character code from your email and choose Submit Code. Code not working? - Enter a password and choose Continue. - Choose Start Streaming and you're ready to watch HBO Max. If you have an existing Disney+, Hulu, or HBO Max subscription, here's how to switch to the bundle: Things to know - You can sign up for the Disney+, Hulu, and HBO Max bundle via Roku or direct-billed purchases on the web directly through HBO Max, Disney+, or Hulu. You can manage your subscription at any time. - If you don't want multiple subscriptions, make sure to manage any existing subscriptions. - The HBO Max Premium plan is not available with the Disney+, Hulu, HBO Max Bundle. How you switch your subscription depends on how you subscribe: First, find who bills you for HBO Max: Here's how to find who bills you for HBO Max: - Do one of the following: - Web: Go to HBOMax.com/subscription and sign in to your account. Can't sign in? - Phone, tablet, or computer: In HBO Max, choose your profile and then Subscription. - TV device: In HBO Max, choose the Settings icon and then Subscription. - Find who your subscription is billed through (top of screen). Choose who bills you for HBO Max and follow the instructions to change your plan: Here's how to change your HBO Max plan to bundle: - Sign in to HBO Max on your phone, tablet, or computer. Can't sign in? - Choose your profile and then Subscription. (Only Adult profiles can manage subscriptions.) - Choose Change Your Plan. - On the Bundles tab, choose With Ads or No Ads and continue. - Review your plan change and choose Confirm & Pay Now. - Choose Set up Hulu & Disney+ to set up your Hulu and Disney+ account. The plan change takes effect immediately and your next billing date will be adjusted. You'll be charged for the new plan (plus applicable taxes) and WarnerMedia will issue you a refund for the time that remains on your previous subscription plan. Multiple subscriptions If you have an active subscription to HBO Max and either Disney+ or Hulu, go to If you subscribe to HBO Max or Disney+/Hulu below to manage your subscription. If you don't want multiple subscriptions, make sure to manage any existing subscriptions. Here's how to change your HBO Max plan to bundle: - Sign in to HBO Max on your Roku device. Can't sign in? - Choose the Settings icon and then Subscription. (Only Adult profiles can manage subscriptions.) - Choose Change Your Plan. - On the Bundles tab, choose With Ads or No Ads and continue. - Follow the on-screen instructions to confirm your plan change. - Open your phone's camera app and point your camera at the QR code on your TV. - Tap the link that appears on your phone and set up your Hulu & Disney+ accounts. Your plan change happens immediately. You'll be charged the price difference between plans (plus applicable taxes) and your next billing date will be adjusted. Multiple subscriptions If you have an active subscription to HBO Max and either Disney+ or Hulu, go to If you subscribe to HBO Max or Disney+/Hulu below to manage your subscription. If you don't want multiple subscriptions, make sure to manage any existing subscriptions. You can sign up for the Disney+, Hulu, HBO Max Bundle on the web (directly through HBO Max, Disney+, or Hulu) or through the HBO Max app on a Roku device. To switch to the bundle, manage your existing app store subscription. You can manage your subscription at any time. Note If you don't want multiple subscriptions, make sure to manage any existing subscriptions. You can sign up for the Disney+, Hulu, HBO Max Bundle on the web (directly through HBO Max, Disney+, or Hulu) or through the HBO Max app on a Roku device. To switch to the bundle, manage your existing app store subscription. You can manage your subscription at any time. Note If you don't want multiple subscriptions, make sure to manage any existing subscriptions. Choose your streaming subscriptions and follow the instructions to change your plan. First, manage your HBO Max subscription or your Disney+ subscription (log in at disneyplus.com/account). You can manage your subscription at any time. Note Your new subscription will not automatically replace your existing subscription. If you don't want multiple subscriptions, you can go back and select a new plan or manage your account at the place of your original purchase. Go to hulu.com and log in to manage your active subscriptions and complete your purchase. Note Your new subscription will not automatically replace your existing subscription. If you don't want multiple subscriptions, you can go back and select a new plan or manage your account at the place of your original purchase. Go to disneyplus.com and log in to manage your active subscription. Go to hulu.com and log in to manage your active subscriptions and complete your purchase. Go to hulu.com and log in to manage your active subscriptions and complete your purchase. Note Your new subscription will not automatically replace your existing subscription. If you don't want multiple subscriptions, you can go back and select a new plan or manage your account at the place of your original purchase. Go to hulu.com and log in to manage your active subscriptions and complete your purchase. Troubleshooting If you can't sign in to HBO Max, Disney+, or Hulu after subscribing to the bundle, your account may not be activated. How you activate depends on how you signed up. How did you sign up for the bundle? If you signed up for the bundle at HBOMax.com, your HBO Max account is already activated. Here's how to activate your Disney+ and Hulu accounts: - Sign in to HBO Max on your phone, tablet, or computer. Can't sign in? - Choose your profile and then Subscription. (Only Adult profiles can manage subscriptions.) - Choose Set up Hulu & Disney+ to set up your Hulu and Disney+ accounts. For help setting up your Disney+ and Hulu accounts, go to Hulu's Activating your Hulu subscription article. If you signed up for the bundle using the HBO Max app on a Roku device, your HBO Max account is already activated. Here's how to activate your Disney+ and Hulu accounts: - Sign in to HBO Max on your Roku device. Can't sign in? - Choose the Settings icon and then Subscription. (Only Adult profiles can manage subscriptions.) - Open your phone's camera app and point your camera at the QR code on your TV. - Tap the link that appears on your phone and set up your Hulu & Disney+ accounts. Note You can also set up your Hulu & Disney+ accounts by following the steps in the Signed up at HBOMax.com section above. For help setting up your Disney+ and Hulu accounts, go to Hulu's Activating your Hulu subscription article. If you signed up for the bundle through Disney+, your Disney+ and Hulu plans are already activated. Here's how to activate your HBO Max account: - On your phone or computer, sign in to your Hulu account at hulu.com/account or your Disney+ account at disneyplus.com/account. - Choose the HBO Max logo or activate link. - On the first HBO Max screen, enter an email address for your HBO Max account and choose Continue. - Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code). This email should arrive within a few minutes. - Enter the 6-character code from your email and choose Submit Code. Code not working? - Enter a password and choose Continue. - Choose Start Streaming and you're ready to watch HBO Max. If you get this message, you can choose from 2 options: - Continue to Purchase: If you complete your bundle purchase, your new bundle subscription will not automatically replace your existing HBO Max subscription. If you don't want multiple subscriptions, you can select a new plan or manage your HBO Max subscription. - Go Back to HBO Max: This option takes you back to your active subscription. To sign up for the bundle, first manage your active HBO Max subscription. If you get this message, you can choose from 2 options: - Continue to Purchase: If you complete your bundle purchase, your new subscription will not automatically replace your existing subscription. If you don't want multiple subscriptions, you can select a new plan or manage your Disney+ subscription. - Go to Disney+: This option takes you to disneyplus.com where you can log in to manage your subscription and complete the bundle purchase. If you get this message, you can choose from 2 options: - Continue to Purchase: If you complete your bundle purchase, your new subscription will not automatically replace your existing subscription. If you don't want multiple subscriptions, you can select a new plan or manage your Disney+ subscription. - View All Plans: This option takes you to other HBO Max plan options. To compare other subscription plan options, choose Monthly or Yearly. If you get this message, you can choose from 2 options: - Go to Hulu: This option takes you to hulu.com where you can log in to manage your subscription and complete the bundle purchase. - View All Plans: This option takes you to other HBO Max plan options. To compare other subscription plan options, choose Monthly or Yearly. If your one-time code isn't working, get a new code. Here's how: - On the Enter the One-Time Code screen, choose Get New Code. - Open the most recent One-Time Code email and grab the new code. - Enter the 6-character code from your email and choose Submit Code. - Enter a password and continue. - Choose Start Streaming and you're ready to watch HBO Max. If this step doesn't work, here are a few more things to try: - Search all of your email accounts for an email from HBO Max. - Be sure to search all inbox folders (including Promotions, Junk, and Spam). Once you find the email account associated with HBO Max emails, get a new code and check this email address. If you get a 'Subscription Paused' message, it may be due to a payment error with your payment method on file with Disney+. To resume your subscription, update your payment method at disneyplus.com. To find out how, go to the Disney+ article Updating payment information."
}