{
  "url": "https://www.opovo.com.br/trends/carnaval-2026-datas-e-feriados-confirmados/",
  "title": "Carnaval 2026: datas e feriados confirmados",
  "text": "Uma das festas mais aguardadas do ano já tem data marcada. Em 2026, o Carnaval será celebrado oficialmente na terça-feira, 17 de fevereiro, mas a programação se estende por vários dias e costuma impactar o funcionamento de serviços públicos, empresas e repartições pelo país. Apesar da tradição, a folia não é considerada feriado nacional, o que gera dúvidas recorrentes entre trabalhadores e estudantes. A abertura informal do Carnaval acontece no sábado, dia 14, e segue até a Quarta-Feira de Cinzas, em 18 de fevereiro, quando parte das atividades começa a ser retomada gradualmente em muitas cidades. Datas do Carnaval 2026 O calendário da folia fica distribuído da seguinte forma: – Sábado de Carnaval: 14 de fevereiro – Domingo de Carnaval: 15 de fevereiro – Segunda-feira de Carnaval: 16 de fevereiro – Terça-feira de Carnaval: 17 de fevereiro – Quarta-Feira de Cinzas: 18 de fevereiro Embora esses dias sejam tradicionalmente associados a festas e blocos de rua, a definição de folga depende da legislação local ou de acordos firmados entre empresas e sindicatos. Como o Carnaval entra no calendário? A data do Carnaval não é fixa e varia a cada ano porque está diretamente ligada ao calendário religioso cristão. A Igreja Católica estabeleceu que a Páscoa deve ser celebrada no primeiro domingo após a primeira lua cheia que ocorre depois do equinócio de primavera no hemisfério norte. A partir dessa definição, a Terça-Feira de Carnaval é marcada 47 dias antes da Páscoa. Esse cálculo foi oficializado no Primeiro Concílio de Niceia, realizado no ano 325, e segue sendo utilizado até hoje para definir datas como a Semana Santa e o período carnavalesco. Quarta-Feira de Cinzas é feriado? Apesar da importância simbólica, a Quarta-Feira de Cinzas não é feriado nacional. Não existe legislação federal que determine a suspensão das atividades nesse dia. Ainda assim, é comum que empresas adotem ponto facultativo parcial, principalmente no período da manhã, com retomada do expediente após o meio-dia. Feriado ou ponto facultativo: o que vale em 2026 Em 2026, o Carnaval ocorre entre os dias 14 e 18 de fevereiro. Como não há reconhecimento nacional como feriado, a concessão de folga depende de leis estaduais ou municipais. No Estado do Rio de Janeiro, por exemplo, a terça-feira de Carnaval é feriado oficial, garantido pela Lei nº 5.243/2008. Em outras regiões do país, a data pode ser apenas ponto facultativo ou um dia normal de trabalho. Por isso, a recomendação é consultar a legislação local e verificar se há acordos coletivos que assegurem a folga durante o período."
}