{
  "url": "https://www.ibm.com/think/topics/storage-area-network",
  "title": "What Is a Storage Area Network (SAN)? | IBM",
  "text": "A storage area network (SAN) is a dedicated network tailored to a specific environment—combining servers, storage systems, networking switches, software and services. Computer memory and local storage resources might not provide enough storage, storage protection, multiple-user access or speed and performance for enterprise applications. So, most organizations employ some form of SAN in addition to network-attached storage (NAS) for improved efficiency and better data management. Traditionally, only a limited number of storage devices could attach to a server, limiting a network's storage capacity. However, a SAN introduces networking flexibility that enables one server, or many heterogeneous servers across multiple data centers, to share a common storage utility. The SAN eliminates the traditional dedicated connection between a network file server and storage—and the concept that the server effectively owns and manages the storage devices—eliminating bandwidth bottlenecks. A SAN eliminates single points of failure to enhance storage reliability and availability. A SAN is also optimal for disaster recovery (DR) because a network might include many storage devices, including disk, magnetic tape and optical storage. The storage utility might also be located far from the servers that it uses. Industry newsletter Stay up to date on the most important—and intriguing—industry trends on AI, automation, data and beyond with the Think newsletter. See the IBM Privacy Statement. Your subscription will be delivered in English. You will find an unsubscribe link in every newsletter. You can manage your subscriptions or unsubscribe here. Refer to our IBM Privacy Statement for more information. The SAN frees the storage device so that it isn't on a particular server bus. It attaches storage directly to the network, externalizing and functionally distributing storage across the organization. The SAN also centralizes storage devices and the clustering of servers, potentially achieving easier and less expensive centralized administration and lowering the total cost of ownership. Typically using block-level storage systems, SANs allow data-moving applications to perform better by transmitting data directly from the source to the target with little server intervention. But organizations can use any network file systems (NFS) appropriate for their infrastructures. SANs also allow multiple hosts to access multiple storage devices that are connected to the same network in new network architectures. A SAN can offer these benefits: Storage exists independently off applications and is accessible through multiple paths for increased reliability, availability and serviceability. SANs offload and move storage processing from servers onto separate networks. SANs make simpler management, scalability, flexibility and high availability possible. SANs protect data from disaster and malicious attacks with a remote copy. SANs simplify management by creating single images of storage media. Sometimes called the network behind the servers, a SAN includes a communication infrastructure that provides physical connections and allow an any-to-any device to bridge across the network through interconnected elements such as switches and directors. The SAN is also an extension of the storage bus concept. This concept enables storage devices and servers to interconnect by using similar elements, such as local area networks (LANs) and wide-area networks (WANs). A SAN also includes a management layer that organizes the connections, storage elements and computer systems, which in turn promotes robust data transfers. Today's SANs create new methods of attaching storage to servers, enabling high availability and performance improvements. They connect shared storage arrays and tape libraries to multiple servers used by clustered servers for failover. They can bypass traditional network traffic bottlenecks, facilitating direct, high-speed data transfers between servers and storage devices in three ways: This traditional interaction model's advantage is that the same storage device might be accessed serially or concurrently by multiple servers. Servers might use a SAN for facilitating high-speed, low-latency and high-volume communications. The ability to move data without server intervention frees up server processor cycles for other activities, such as application processing. Examples include a disk drive device that backs up its data to a tape device without server intervention or a remote device mirroring across the SAN. A SAN switch is at the heart of most storage area networks. Its sole purpose is to move storage data traffic between servers and shared storage pools. A switch interconnects multiple host servers made up of storage servers and devices to create a SAN. Some switches can be used as a standalone device to build a simple SAN fabric. Others can be interconnected with other switches to build a larger SAN fabric. SAN fabrics are active, intelligent and nonshared interconnections of multiple SAN switches. They increase the number of possible connections in a SAN. Fibre Channel host bus adapters (HBA) connect switches to file servers. The core components of a SAN are servers, storage and networking infrastructure. The server infrastructure is the underlying reason for all SAN solutions and this infrastructure includes a mix of server platforms. With initiatives, such as server consolidation and Internet commerce, the need for SANs increases, making the importance of network storage greater. A storage system can consist of disk systems and tape systems. The disk system can include HDDs, SSDs or flash drives. The tape system can consist of tape drives, tape autoloaders and tape libraries. SAN connectivity consists of hardware and software components that interconnect storage devices and servers, including Fibre Channel. Hardware can include hubs, switches, gateways, directors and routers. The software includes SAN management software. A storage area network protocol is a type of connection that determines how devices and switches communicate with each other within a SAN fabric. A SAN can use one protocol or many. Certain devices are multiprotocol routers and devices. Multiprotocol routers and devices provide improved scalability, security and manageability. They enable devices in separate SAN fabrics to communicate without merging fabrics into a single, large meta-SAN fabric. Depending on the manufacturer, multiprotocol routers and devices support many protocols, such as server message block (SMB), and offer their own features such as zoning. Here's a list of SAN connection types: Internet Small Computer System Interface (iSCSI) is an IP-based standard protocol for linking data storage devices over a network and transferring data by carrying SCSI commands over IP networks. Using the iSCSI protocol for IP-based SANs enables clients to use the same networking technologies for storage, storage management and data networks. Because iSCSI uses Transmission Control Protocol/Internet Protocol (TCP/IP), iSCSI is also suited to run over almost any physical network. Fibre Channel Protocol (FCP) is the serial SCSI command protocol used on Fibre Channel (FC) networks. It provides higher throughput than a local area network (LAN). It's a gigabit-speed network technology primarily used for storage networking and it's the standard protocol for open systems. First used in the supercomputer field, FCP has become the standard connection type for SANs in enterprise storage. Fibre Channel over Ethernet (FCoE) is a protocol to route FC packets over Ethernet. It can improve the flexibility and simplification of the SAN infrastructure. It replaces dedicated switching solutions for LANs and SANs with a single device that can transfer both types of data: IP packets and storage data. These deployments are called converged networks. Fibre Channel over IP (FCIP) is also known as Fibre Channel tunneling or storage tunneling. This method allows the transmission of Fibre Channel information to be tunneled through the IP network. Most organizations have an existing IP infrastructure, so they find being able to link geographically dispersed SANs at a relatively low cost attractive. Non-Volatile Memory express over Fibre Channel (FC-NVMe) is a host controller interface and storage protocol. It accelerates the transfer of data between enterprise and client systems and solid-state drives (SSD) over a computer's high-speed Peripheral Component Interconnect Express (PCIe) bus. Unlike direct-attached storage (DAS), network-based storage allows more than one computer to access it through a network, making it better for data sharing and collaboration. Its off-site storage capability also makes it better suited for backups and data protection. Two typical network-based storage setups are network-attached storage (NAS) and storage area network (SAN). NAS is often a single device made up of redundant storage containers or a redundant array of independent disks (RAID). SAN storage can be a network of multiple devices, including SSD and flash storage, hybrid storage, hybrid cloud storage, backup software and appliances and cloud storage. It's important to choose the right one that suits your use cases. Here are how NAS and SAN differ: IBM FlashSystem is a portfolio of enterprise flash storage solutions built for speed, scalability, and data protection. IBM Storage is a family of data storage hardware, software defined storage and storage management software. IBM provides proactive support for web servers and data center infrastructure to reduce downtime and improve IT availability."
}