{
  "url": "https://www.holland.com/global/tourism/getting-around/information/netherlands-vs-holland",
  "title": "What’s the difference between the Netherlands and Holland? - Holland.com",
  "text": "The difference between the Netherlands and Holland So do you say ‘Holland’ or ‘the Netherlands’? Many people outside of the country have no clue, and even for Dutch people the difference isn’t always clear. In this article, we explain where the two names come from, what they denote and why both Holland and the rest of the Netherlands are definitely worth a visit! - Find out what the difference is between Holland and the Netherlands. - Learn more about diverse Dutch landscapes and nature. - Read about Dutch icons and things that are typically Dutch. What is the difference between Holland and the Netherlands? Many people seem to think that the two names are interchangeable. But North Holland and South Holland are actually just two of the 12 provinces of the Netherlands, which is officially called the Kingdom of the Netherlands. In this article, you can find out what has caused this confusion – and what the Netherlands (yes, all of it!) has to offer. A brief history of the Netherlands and Holland From 1588 to 1795, the area that is currently the Netherlands was known as the Republic of the Seven United Netherlands. After the republic was conquered by French troops in 1795, it became the Batavian Republic, and Holland one of its departements. In 1806, Napoleon appointed his brother Louis as king, turning the country into a kingdom – the Kingdom of Holland. It remained a kingdom after Napoleon’s defeat and was then known as Kingdom of the Netherlands. Holland was now a province. And its economic and cultural dominance within the kingdom meant that ‘Holland’ became a commonly used name for the entire realm. At that time, Belgium was part of the kingdom; Holland’s dominance was one of the reasons the Belgians revolted and separated from the Kingdom of the Netherlands in 1830. In an attempt to restore balance among the remaining provinces, the province of Holland would later be divided into South and North Holland. But the usage of the name Holland for the entire country stuck, especially abroad. However, the remaining ten provinces – Zeeland, North Brabant, Limburg, Utrecht, Gelderland, Flevoland, Overijssel, Drenthe, Friesland and Groningen – are just as much part of the Netherlands as North and South Holland. In this article, we delve into what all these different parts of the Netherlands have to offer to visitors. Get inspired Discover the amazing variety and charm of Dutch cities – where there’s something for everyone. About Dutch citiesDiscover amazing Dutch cities Nature in the Netherlands From its sweeping coastline with dunes and sandy beaches to the forests and heathland of Drenthe and the Veluwe area, and from the hills of South Limburg to the Frisian lakes, the Netherlands boasts a great variety of natural features and landscapes. But one thing that’s always present is water. Explore the Biesbosch wetlands, one of the world’s few freshwater tidal areas, or go sailing on lakes such as the Loosdrechtse Plassen or the Maasplassen. Take a brisk walk along the beaches of Zeeland, or marvel at the Dutch polder landscapes, the result of this country’s centuries-old fight against the water. Even the Netherlands’ busy metropolitan areas are bursting with nature and wildlife. Whichever province you visit, you’re never far from the countryside. Typically Dutch Ideally, you’ll explore the country on a bike, in true Dutch style. The largely flat land and relatively short distances have made cycling the main mode of transport here. In the process, the bike has become a real Dutch icon. The Dutch cycle everywhere and always, come rain or shine. A variety of modified bikes for wheelchair users make cycling accessible to more and more people. Speaking of Dutch icons, of course you’ll be familiar with images of windmills, tulips and cheese. And then there are the Dutch masters: Rembrandt, Vermeer, Van Gogh and many other painters who changed art forever. That spirit of innovation defines the Netherlands in all areas of life: culturally, economically and socially. The Netherlands was the first country in the world to legalize same-sex marriage. The constant drive to experiment and innovate is woven into the fabric of Dutch society. It’s also the reason why Dutch Design is so successful. While bold ideas are one aspect of this, behind them is a mission to make life more practical, fairer and more sustainable. Sustainability and innovation are key in the Netherlands of today, too. The country is at the forefront of the transition to electric vehicles. Climate-neutral buildings, bike paths that generate electricity – it seems like there are no limits to what can be done! Holidays in the Netherlands Typically Dutch holidays and festivals include King’s Day, Sinterklaas and, in the south of the country, carnival. On King’s Day, street parties featuring music, flea markets, games for the children and drinks for the adults are organized across the country. Many dress up in orange, the color of the royals – the House of Orange-Nassau – and, of course, the national football teams. Rather handily, this means that people get to reuse their orange outfits when the Dutch are taking part in the World Cup or the European Championship. And these events are yet another reason for a celebration: whole neighborhoods are decorated in orange and people get together to watch the games. The feast of St Nicholas in early December sees the arrival of Sinterklaas and his helper Piet, who bring gifts and sweets for young children, while older kids and adults give each other little presents and write rhymes for each other. If you’re in the Netherlands in early December, make sure to taste kruidnoten and pepernoten, traditional seasonal biscuits. Carnival is mainly celebrated in the southern provinces of North Brabant and Limburg, places where Catholicism was historically more dominant. The celebration itself takes place in carnival week, six weeks before Easter, but the preparations take several months. People get together in every village and town to build floats and create costumes. If you’re in the south of the Netherlands in carnival season, don’t miss out! Put on a costume and join the party. City trip in the Netherlands The Netherlands is a great destination for a city trip. While most people choose Amsterdam, there are so many other amazing cities for visiting museums, seeing great architecture, eating out, going shopping and generally just strolling around. Utrecht, Haarlem, Rotterdam, Maastricht, Leeuwarden and Groningen are all more than worth a visit. If this is your first trip to the Netherlands, make sure to take a look at our page with practical information to help you get started. We hope you enjoy your visit to this beautiful, diverse country!"
}