{
  "url": "https://www.stonyfield.com/why-organic/",
  "title": "Why Organic? - Stonyfield",
  "text": "Organic for the people and the planet. Healthy Food What does “organic” mean anyway? For us, it means healthier food, healthier people, and a healthier planet. When you see the USDA Organic certification seal on a product, you can be confident that it’s made without artificial flavors or preservatives, toxic persistent pesticides, synthetic fertilizers, artificial hormones, antibiotics, and genetically modified organisms (GMOs). We’re proud to wear that seal on all of our Stonyfield Organic products. Healthy People There are lots of reasons to be wary of toxic persistent pesticides, which is why we make our products without their use. Here at Stonyfield, we’re proud to say that our products are made with high-quality ingredients, following organic standards that prohibit the use of over 900 pesticides and 3,000 food processing aids. Healthy Planet Eating organic isn’t just good for you and your family, it’s also good for the planet. One of the main goals of organic farming practices is to avoid contaminating our precious soil, rivers, drinking water, and air with toxic persistent chemicals. Check out our Impact Report to see what we’ve accomplished so far. We ❤ The Organic Farmers that Supply Our Milk We choose to invest in the small, organic family farms that supply our milk for many reasons. Organic farmers take a systems-based approach to farming, meaning that instead of fighting nature with toxic persistent pesticides and artificial hormones, they work with nature to allow the soil, crops, pasture, and animals to flourish and reach their full potential, organically. Yogurt On A Mission® Here at Stonyfield, we’re on a mission to promote awareness and education on organic, sustainable, and economically sound farming practices because we believe in the power of organic agriculture. In fact, our Have A Cow® program was created to help promote organic farming practices and their benefits, and how they relate to life on the family farm. As a B Corp™, we believe socially responsible business can change the world, and that organic is better for people and the planet’s health. From supporting small family farms to helping agriculture become a climate change solution with OpenTEAM to participating in the science-based target initiative, we’re always looking for a better way to make food for healthy people and a healthy planet. We’ve been working for you, your family, and our planet since 1983. We’re not just Yogurt On A Mission®; we’re people on a mission. Get organic in your inbox! Enter your email to get the latest Stonyfield happenings, promotions, recipes, and more."
}