{
  "url": "https://www.trvst.world/biodiversity/types-of-tuna/",
  "title": "15 Different Types of Tuna Species",
  "text": "15 Different Types of Tuna Species Tunas are an ecologically and economically significant group of pelagic fish (that live in the open ocean rather than close to the coast). They are famous culinary delicacies. Furthermore, the various tuna species are renowned for their streamlined bodies and powerful swimming abilities. From the massive Bluefin Tunas to the smallest Blackfin Tuna, this guide will discuss the 15 types of tuna. Related read: Ocean facts. 15 Different Types of Tuna Quick links to the different types of tuna: 1. Albacore Tuna (Thunnus alalunga) Fun Fact: Did you know that Albacore Tuna, also known as \"the chicken of the sea\" or \"white tuna.\" is the only species of tuna that can maintain its body temperature higher than the surrounding water? This unique ability allows them to swim faster and for longer distances. Albacore Tuna has a sleek metallic-blue body and long pectoral fins and is often called \"Longfin Tuna.\" It thrives in the Pacific Ocean, Atlantic, and Indian Ocean, adapting to cooler waters (15.6 to 19.4 degrees Celsius) and frequently swimming near the ocean's surface to find its ideal temperature. Albacore Tuna are migratory adventurers strategically following warm currents over vast distances2. They are skilled hunters, swiftly pursuing smaller fish, squid, and crustaceans, displaying impressive marine athleticism. 2. Yellowfin Tuna (Thunnus albacares) Fun Fact: Yellowfin Tuna is renowned for its incredible speed and agility, reaching up to 50 miles per hour in the ocean, making them among the fastest fish species. Yellowfin tuna has a dark blue body with yellow dorsal and anal fins. They live in the Atlantic Ocean and the Pacific Ocean. Yellowfin Tuna can grow 6 to 8 feet long (1.8 to 2.4 meters) and weigh between 130 to 400 pounds (59 to 181 kilograms). They are skilled hunters, enjoying a diverse fish, squid, and crustacean diet. Yellowfin Tuna are social creatures, often swimming in schools with other tuna and dolphins. 3. Bluefin Tuna (Thunnus thynnus) Fun Fact: Bluefin Tuna are super fast swimmers, reaching speeds up to 40 miles per hour. They can cover great distances in pursuit of their favorite prey. Bluefin species are massive fish, reaching 3 meters long and weighing 680 kilograms. Their warm-blooded nature enables them to thrive in various ocean environments1. They're adventurous migrators, traveling from the Arctic to the tropics, including the Mediterranean Sea and the vast Atlantic Ocean. They usually hunt solo, and their diet consists of herring, mackerel, and other tuna species. 4. Bigeye Tuna (Thunnus obesus) Fun Fact: The Bigeye Tuna (Thunnus obesus), nicknamed the \"cow of the sea,\" is one of the largest tuna species. Their name was taken from their distinctive large eyes, which are significantly larger in proportion to their body size than other tuna species. The Bigeye Tuna reaches up to 250 cm in length and 210 kg in weight. Unsurprisingly, given their name, they are known for their big eyes, ideal for nocturnal hunting. Found in tropical and subtropical waters of the Atlantic, Indian, and Pacific Oceans, it prefers open ocean depths, diving up to 500 meters. Bigeye Sashimi is popular in Japan but can set you back a bit due to demand. Their diet includes various fish, squid, and crustaceans. 5. Skipjack Tuna (Katsuwonus pelamis) Fun Fact: Did you know that Skipjack Tuna, or the \"Striped Tuna\" or \"Light Tuna,\" are highly social tunas and can form large schools of thousands of individuals? Skipjack Tunas inhabit tropical and subtropical oceans. They are the preferred canned tuna because they are abundant and tasty, and people like their light meat. Skipjack tuna mature rapidly in one to two years. Their early maturity allows them to sustain stable populations despite heavy fishing. Skipjack tuna females lay millions of eggs yearly, thriving in warm waters and adapting to fishing pressure. 6. Blackfin Tuna (Thunnus atlanticus) Fun Fact: The Blackfin Tuna, also called Atlantic Bonito, is the smallest member of the Thunnus genus. Unlike other tuna species, they prefer living on shallower waters of coastal habitats. The Blackfin Tuna is found in the warm western Atlantic Ocean. They are about 100 cm long and 21 kg, with beautiful metallic blue and silver bodies and black fins. It feeds on fish, squid, and crustaceans. Female Blackfins are prolific egg-layers, releasing up to two million eggs annually, which is crucial for survival. 7. Southern Bluefin Tuna (Thunnus maccoyii) Fun Fact: Southern Bluefin Tuna is the most expensive fish ever sold at auction. In 2019, a tuna weighing 278 kilograms was sold for a whopping $3.1 million in Tokyo, Japan! The Southern Bluefin Tuna is found in the southern hemisphere's open waters. These critically endangered tunas can grow up to 2.5 meters long and weigh 260 kilograms. With stunning blue and silver-white colors providing beauty and camouflage, it can reach 75 kilometers per hour and dive 250 meters deep. It is a remarkable marathon swimmer5, feeding on fish, squid, and crustaceans, traveling thousands of kilometers across the Indian, Atlantic, and Pacific Oceans each year for spawning. 8. Atlantic Bluefin Tuna (Thunnus thynnus) Fun Fact: Atlantic Bluefin Tuna can swim up to 40 miles per hour. Their remarkable speed helps them cover vast distances while hunting for their favorite prey. The Atlantic Bluefin Tuna (Thunnus thynnus) is a massive creature, up to ten feet long and weighing up to 1,500 pounds. With its unique warm-blooded ability, it thrives in diverse waters, from the Arctic to the Gulf of Mexico and the Mediterranean Sea6. Feeding on fish and squid annually undertakes marathon journeys from North America to Europe and back. 9. Pacific Bluefin Tuna (Thunnus orientalis) Fun Fact: Pacific Bluefin Tuna are exceptional swimmers, reaching up to 40 miles per hour, making them one of the fastest in the ocean. Their bodies and powerful tails enable them to cover vast distances during migrations. The Pacific Bluefin Tuna (Thunnus orientalis) is a formidable predator among the tuna family, growing up to three meters long and weighing 450 kilograms. It reaches incredible speeds of 75 km/h and migrates between East Asia and North America for reproduction. Thriving on fish and squid, it dominates diverse water temperatures in the Pacific Ocean. 10. Longtail Tuna (Thunnus tonggol) Fun Fact: The Longtail Tuna is named after their long, slender tails. Longtail Tuna (or Northern Bluefin Tuna) are a tropical and subtropical species, typically found in warmer waters from the Persian Gulf to northern Australia and China. It has an elongated body with a pointed snout and a narrow tail fin. Its coloration includes a dark blue back for blending into the deep ocean and a sparkling silver-white belly and sides, helping it evade predators and approach prey unnoticed. 11. Little Tunny (Euthynnus alletteratus) Fun Fact: The meat of the little tunny (or false albacore) has a more intense flavor and darker color than other larger tunas. False albacore is a rapid and agile sea creature that can reach up to 45 miles per hour. Little Tunny lays claim to the most frequently spotted tuna in the Atlantic. It has a notable preference for warmer coastal water. With up to 75 km/h speeds, it gracefully swims near the surface, showcasing a ballet-like performance. Despite its distinct appearance, including worm-like lines on its back and dark spots beneath its pectoral fins, its small size (50–70 cm) and robust flavor make it less popular in commercial fishing. 12. Mackerel Tuna (Euthynnus affinis) Fun Fact: The Mackerel Tuna, known as kawakawa, can rapidly change color to blend in with its surroundings, making it a master of disguise. When hunting, mackerel tuna can darken their backs to blend in with the deep blue ocean, making it harder for their prey to spot them. The Mackerel Tuna has many names, including Kawakawa, Eastern Little Tuna, and Thazard Oriental. They live in the Pacific and Indian Oceans. The Kawakawa Tuna has a streamlined body, a metallic blue-silver exterior, and prefers surface waters. It eats fish, cephalopods, and crustaceans. The female Mackerel Tuna reproduces prolifically, releasing millions of eggs in one spawning event to ensure the species' continuation. 13. Bullet Tuna (Auxis rochei) Fun Fact: The Bullet Tuna is named after its streamlined body, enabling it to swim up to 45 miles per hour. The Bullet Tuna is a small4, iridescent fish, measuring about 35 centimeters. It inhabits the Atlantic, Indian, and Pacific Oceans. They are expert vertical migrators. Every day, they dive deep into the ocean when the sun's up and ascend to the surface when the moon takes over. This clever tactic lets them feast on their favorite foods and dodge larger predators. Like other tunas, they feed on fish, crustaceans, and squid. 14. Frigate Tuna (Auxis thazard) Fun Fact: The Frigate Tuna is named after the frigate bird. These tuna swim alongside frigate birds to locate schools of fish from above, making hunting easier. The Frigate Tuna is a tiny, fast, and agile swimmer, reaching up to 60 km/h. Its streamlined body has a silver-white belly and dark blue back. It migrates long distances for spawning and feeding, and its diet includes small fish, crustaceans, and other small marine animals. 15. Slender Tuna (Allothunnus fallai) Fun Fact: Slender Tuna may be small, but they are super-fast swimmers. With speeds of up to 75 km/h (47 mph), their bodies and powerful tails make them formidable predators in the ocean. The Slender Tuna inhabits the Southern Hemisphere3. Its slim, sleek body is dark blue-black on top and silver-white below, and it can grow up to 1.5 meters long, weighing around 50 kilograms. Its diet includes tiny fish and squid. It showcases speed and agility at depths of 200 to 500 meters during the day and gracefully migrates to the ocean's surface at night. Glossary Terms: Chinny Verana is a degree-qualified marine biologist and researcher passionate about nature and conservation. Her expertise allows her to deeply understand the intricate relationships between marine life and their habitats. Her unwavering love for the environment fuels her mission to create valuable content for TRVST, ensuring that readers are enlightened about the importance of biodiversity, sustainability, and conservation efforts. Fact Checked By: Mike Gomez, BA."
}