{
  "url": "https://communaute.orange.fr/t5/utiliser-mon-mobile/communication-wap-web/td-p/123097",
  "title": "communication wap/web - Communauté Orange",
  "text": "- Communauté Orange - ➔ - mobile Orange - ➔ - utiliser mon mobile - ➔ - communication wap/web Vous avez une question ? Interrogez la communautécommunication wap/web - S'abonner au fil RSS - Marquer le sujet comme nouveau - Marquer le sujet comme lu - Placer ce Sujet en tête de liste pour l'utilisateur actuel - Marquer - S'abonner - Page imprimable - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler communication wap/web Bonjour voila mon probleme : ma femme vient d'acquerir un windowsphone et dernierement j'ai remarqué des communications wap/web ( hors forfait)incomprehensibles sur sa facture et en general la nuit lors que l'on utilise pas le telephone. elle se connecte a la maison en wifi sur notre box et a un forfait open zen multiligne avec appels illimité sms mms illimité et 500 Mo de data. je ne sais pas pourquoi il y a des connection wap/web sur le site orange.fr. Si quelqu'un a une petite idée?? car moi sur mon HTC one mini android je ne rencontre pas ce probleme. merci beaucoup et bonne année 2014 a tous - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication wap/web - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication wap/web Bonsoir j'ai le même problème avez vous trouver la solution ? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication wap/web Bonjour le seule solution que j'ai trouvé pour le moment a été de desactiver les datas et depuis plus de connection intempestive sur le windows phone en sachant que maintenat toutes la famille est passer en systeme android ou je n'ai pas connaissance de ce probleme . tres insatisfait de windows phone cordialement - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication wap/web J'ai le m^me souci, portabilité le 30 octobre et ce même jour, plus d'heures d'appel alors que la veille 4h de comm disponible et 41,34 euros de comm wap web vers orange. Alors que je suis en wifi chez moi et ne me suis pas encore servi de mon tel @babinol a écrit :Bonjour voila mon probleme : ma femme vient d'acquerir un windowsphone et dernierement j'ai remarqué des communications wap/web ( hors forfait)incomprehensibles sur sa facture et en general la nuit lors que l'on utilise pas le telephone. elle se connecte a la maison en wifi sur notre box et a un forfait open zen multiligne avec appels illimité sms mms illimité et 500 Mo de data. je ne sais pas pourquoi il y a des connection wap/web sur le site orange.fr. Si quelqu'un a une petite idée?? car moi sur mon HTC one mini android je ne rencontre pas ce probl - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : communication wap/web Bonjour, également ce problème de consommations de data WAP/WEB. Nous ne nous en rendons compte que maintenant car les premières consommations à notre insus n'étaient pas très élevées ( de l'ordre de 0.50 € à 1€ par mois, mais bon, ramené à l'année et multiplié par le nombre de contrats, ça doit commencer à être intéressant pour l'opérateur !!!! ) mais pour le mois de décembre c'est carrément 22€ qui nous sont demandés pour 450 Mo de consommation, uniquement pour des communications WAP/WEB en direction de Orange.fr., pour un forfait à 5€, ça fait un gros écart. Là, c'est juste inacceptable et nous espèrons qu'un téléconseiller va prendre en charge le dossier."
}