{
  "url": "https://www.san.org/",
  "title": "San Diego International Airport | SAN.org",
  "text": "Hello from San Diego International Airport Where San Diego meets the world and the world meets the best of San Diego. Where San Diego meets the world and the world meets the best of San Diego. Getting to SAN is simple, whether you’re driving, taking transit, or arriving from the cruise terminal. Looking for an easy and eco-friendly way to get to and from our airport? Discover the public transit options available to you. Our Rental Car Center offers a wide range of vehicles from top providers, all conveniently located for easy pickup and drop-off. From ride-hailing apps to taxis, find out how to catch a quick, safe, and reliable ride to and from the airport. Enjoy hassle-free shuttle services connecting terminals, parking lots, and nearby locations, making your airport experience smoother and more convenient. Whether you’re arriving or departing, we’re excited to welcome you through our airport! We want your journey to be as smooth as possible, so we’ve gathered everything you need to know—from terminal details and available amenities to parking reservation assistance—so you can travel with ease. We want your time at the airport to be as comfortable and convenient as possible. From practical essentials like Wi-Fi, ATMs, and charging stations to traveler services such as baggage claim, airline ticket counters, and security assistance, you’ll find everything you need. We also offer helpful amenities, including nursing rooms, bike lockers, and visitor information to make your journey smoother from start to finish. Free, fast Wifi with 2-hour sessions. Simply reconnect for additional time. Connect to #SANfreewifi to stream your favorite content during your stay. Contact your airline ahead of time to request special assistance to boarding gates. Enhanced TSA security measures may increase checkpoint wait times. Accessibility options, essentials, and extras. We’ve got you covered. Getting to SAN is simple, whether you’re driving, taking transit, or arriving from the cruise terminal. Let us be part of your travels! Check out these concerts, performances, and special events during your next adventure. SAN is about way more than just travel. If you’re looking to grow, partner, or innovate, there’s a place for you here. Let’s build something great under the San Diego sun!"
}