{
  "url": "https://en.wikipedia.org/wiki/Santorini",
  "title": "Santorini - Wikipedia",
  "text": "Santorini Santorini,[a] officially Thira[b] or Thera,[c] is a Greek island in the southern Aegean Sea, about 125 mi (201 km) southeast from the mainland. It is the largest island of a small, circular archipelago formed by the Santorini caldera. It is the southernmost member of the Cyclades group of islands, with an area of approximately 28 mi2 (73 km2) and a 2021 census population of 15,480. The municipality of Santorini includes the inhabited islands of Santorini and Therasia, and the uninhabited islands of Nea Kameni, Palaia Kameni, Aspronisi, Anydros, and Christiana. The total land area is 35 mi2 (91 km2).[3] Santorini is part of the Thira regional unit.[4] Santorini is the most active volcanic centre in the South Aegean Volcanic Arc. The volcanic arc is approximately 300 mi (500 km) long and 12 to 25 mi (19 to 40 km) wide. The region first became volcanically active around 3–4 million years ago,[citation needed] though volcanism on Thera began around 2 million years ago with the extrusion of dacitic lavas from vents around Akrotiri. One of the largest volcanic eruptions in recorded history struck the island about 3,600 years ago, leaving a large water-filled caldera surrounded by deep volcanic ash deposits. Names [edit]The name \"Santorini\" is a contraction of Saint Irene, after an old church in the village of Perissa.[5][6] Of Venetian influence, the island bore the name Santorini since at least the middle of the twelfth century, the first mention being made by the geographer Muhammad al-Idrisi c. 1154;[7] During antiquity it was known as \"Thēra\" and before then, according to ancient writers, as \"Kallístē\" (Καλλίστη, \"the most beautiful one\"), and — according to a modern tradition — as \"Strongýlē\" (Στρογγύλη, \"the circular one\")[8][full citation needed]. The ancient name Thera, for Theras, the leader of the Spartans who colonized and gave his name to the island,[9] was revived in the nineteenth century as the official name of the island and its main city, but the colloquial Santorini is still in popular use. History [edit]Minoan Akrotiri [edit]The island was the site of one of the largest volcanic eruptions in recorded history: the Minoan eruption, sometimes called the Thera eruption, which occurred about 3,600 years ago at the height of the Minoan civilization.[6] The eruption left a large caldera surrounded by volcanic ash deposits hundreds of metres deep. It has been suggested that the colossal Santorini volcanic eruption is the source of the legend of the lost civilisation of Atlantis.[10] The eruption lasted for weeks and caused massive tsunami waves.[11] The region first became volcanically active around 3–4 million years ago,[citation needed] though volcanism on Thera began around 2 million years ago with the extrusion of dacitic lavas from vents around Akrotiri. Excavations starting in 1967 at the Akrotiri site under Spyridon Marinatos have made Thera (not known by this name at the time) the best-known Minoan site outside Crete, homeland of the culture. Only the southern tip of a large town has been uncovered, yet it has revealed complexes of multi-level buildings, streets, and squares with remains of walls standing as high as eight metres, all entombed in the solidified ash of the famous eruption of Thera. The site was not a palace-complex as found in Crete nor was it a conglomeration of merchant warehousing. Its excellent masonry and fine wall-paintings reveal a complex community. A loom-workshop suggests organized textile weaving for export. This Bronze Age civilization thrived between 3000 and 2000 BC, reaching its peak in the period between 2000 and 1630 BC.[12] Many of the houses in Akrotiri are major structures, some of them three storeys high. Its streets, squares, and walls, sometimes as tall as eight metres, indicated that this was a major town; much is preserved in the layers of ejecta. The houses contain huge ceramic storage jars (pithoi), mills, and pottery, and many stone staircases are still intact. Noted archaeological remains found in Akrotiri are wall paintings or frescoes that have kept their original colour well, as they were preserved under many metres of volcanic ash. Judging from the fine artwork, its people were sophisticated and relatively wealthy. Among more complete frescoes found in one house are two antelopes painted with a confident calligraphic line, a man holding fish strung by their gills, a flotilla of pleasure boats that are accompanied by leaping dolphins, and a scene of women sitting in the shade of light canopies. Fragmentary wall-paintings found at one site are Minoan frescoes that depict \"saffron-gatherers\" offering crocus-stamens to a seated woman, perhaps a goddess important to the Akrotiri culture. The themes of the Akrotiri frescoes show no relationship to the typical content of the Classical Greek décor of 510 BC to 323 BC that depicts the Greek pantheon deities. The town also had a highly developed drainage system. Pipes with running water and water closets found at Akrotiri are the oldest such utilities discovered.[13] The pipes run in twin systems, indicating that Therans used both hot and cold water supplies. The origin of the hot water they circulated in the town probably was geothermal, given the volcano's proximity. The well preserved ruins of the ancient town are often compared to the spectacular ruins at Pompeii in Italy. The canopy covering the ruins collapsed in September 2005, killing one tourist and injuring seven; the site was closed until April 2012 while a new canopy was built. The oldest signs of human settlement are Late Neolithic (4th millennium BC or earlier), but c. 2000–1650 BC Akrotiri developed into one of the Aegean's major Bronze Age ports, with recovered objects that came not just from Crete, but also from Anatolia, Cyprus, Syria, and Egypt, as well as from the Dodecanese and the Greek mainland. Dating of the Bronze Age eruption [edit]The Minoan eruption provides a fixed point for the chronology of the second millennium BC in the Aegean, because evidence of the eruption occurs throughout the region and the site itself contains material culture from outside. The eruption occurred during the \"Late Minoan IA\" period of Minoan chronology at Crete and the \"Late Cycladic I\" period in the surrounding islands. Archaeological evidence, based on an established chronology of Bronze Age Mediterranean cultures, dated the eruption to around 1500 BC.[14] These dates, however, conflict with radiocarbon dating which indicated that the eruption occurred between 1645–1600 BC,[15][16] and tree ring data which yielded a date of 1628 BC.[17] For those, and other reasons, the previous culturally based chronology has generally been questioned.[18] In The Parting of the Sea: How Volcanoes, Earthquakes, and Plagues Shaped the Exodus Story, geologist Barbara J. Sivertsen theorizes a causal link between this eruption and the plagues of the Exodus.[19] Ancient period [edit]Santorini remained unoccupied throughout the rest of the Bronze Age, during which time the Greeks took over Crete. At Knossos, in a LMIIIA context (14th century BC), seven Linear B texts while calling upon \"all the deities\" make sure to grant primacy to an elsewhere-unattested entity called qe-ra-si-ja and, once, qe-ra-si-jo. If the endings -ia[s] and -ios represent an ethnic suffix, then this means \"The One From Qeras[os]\". If the initial consonant were aspirated, then *Qhera- would have become \"Thera-\" in later Greek. \"Therasia\" and its ethnikon \"Therasios\" are both attested in later Greek; and, since -sos was itself a genitive suffix in the Aegean Sprachbund, *Qeras[os] could also shrink to *Qera. If qe-ra-si-ja was an ethnikon first, then in following the entity the Cretans also feared whence it came.[20] Probably after what is called the Bronze Age collapse, Phoenicians founded a site on Thera. Herodotus reports that they called the island Callista and lived on it for eight generations.[21] In the ninth century BC, Dorians founded the main Hellenic city on Mesa Vouno, 396 m (1,299 ft) above sea level. This group later claimed that they had named the city and the island after their leader, Theras. Today, that city is referred to as Ancient Thera. In his Argonautica, written in Hellenistic Egypt in the third century BC, Apollonius Rhodius includes an origin and sovereignty myth of Thera being given by Triton in Libya to the Greek Argonaut Euphemus, son of Poseidon, in the form of a clod of dirt. After carrying the dirt next to his heart for several days, Euphemus dreamt that he nursed the dirt with milk from his breast, and that the dirt turned into a beautiful woman with whom he had sex. The woman then told him that she was a daughter of Triton named Calliste, and that when he threw the dirt into the sea it would grow into an island for his descendants to live on. The poem goes on to claim that the island was named Thera after Euphemus' descendant Theras, son of Autesion, the leader of a group of refugee settlers from Lemnos. The Dorians have left a number of inscriptions incised in stone, in the vicinity of the temple of Apollo, attesting to pederastic relations between the authors and their lovers (eromenoi). These inscriptions, found by Friedrich Hiller von Gaertringen, have been thought by some archaeologists to be of a ritual, celebratory nature, because of their large size, careful construction and – in some cases – execution by craftsmen other than the authors. According to Herodotus,[22] following a drought of seven years, Thera sent out colonists who founded a number of cities in northern Africa, including Cyrene. In the fifth century BC, Dorian Thera did not join the Delian League with Athens; and during the Peloponnesian War, Thera sided with Dorian Sparta, against Athens. The Athenians took the island during the war, but lost it again after the Battle of Aegospotami. During the Hellenistic period, the island was a major naval base for Ptolemaic Egypt. Medieval and Ottoman period [edit]As with other Greek territories, Thera then was ruled by the Romans. When the Roman Empire was divided, the island passed to the eastern side of the Empire which today is known as the Byzantine Empire.[23] According to George Cedrenus, the volcano erupted again in the summer of 727, the tenth year of the reign of Leo III the Isaurian.[24] He writes: \"In the same year, in the summer, a vapour like an oven's fire boiled up for days out of the middle of the islands of Thera and Therasia from the depths of the sea, and the whole place burned like fire, little by little thickening and turning to stone, and the air seemed to be a fiery torch.\" This terrifying explosion was interpreted as a divine omen against the worship of religious icons[25][26] and gave the emperor Leo III the Isaurian the justification he needed to begin implementing his Iconoclasm policy. The name \"Santorini\" first appears c. 1153–1154 in the work of the Muslim geographer al-Idrisi, as \"Santurin\", from the island's patron saint, Saint Irene of Thessalonica.[27] After the Fourth Crusade, it was occupied by the Duchy of Naxos which held it up to circa 1280 when it was reconquered by Licario (the claims of earlier historians that the island had been held by Jacopo I Barozzi and his son as a fief have been refuted in the second half of the twentieth century);[28][29][30] it was again reconquered from the Byzantines circa 1301 by Iacopo II Barozzi, a member of the Cretan branch of the Venetian Barozzi family, whose descendant held it until it was annexed to Venice in c. 1335 by Niccolo Sanudo after various legal and military conflicts.[31] In 1318–1331 and 1345–1360 it was raided by the Turkish principalities of Menteshe and Aydın, but did not suffer much damage.[27] Because of the Venetians the island became home to a sizable Catholic community and is still the seat of a Catholic bishopric. From the 15th century on, the suzerainty of the Republic of Venice over the island was recognized in a series of treaties by the Ottoman Empire, but this did not stop Ottoman raids, until it was captured by the Ottoman admiral Piyale Pasha in 1576, as part of a process of annexation of most remaining Latin possessions in the Aegean.[27] It became part of the semi-autonomous domain of the sultan's Jewish favourite, Joseph Nasi. Santorini retained its privileged position in the 17th century, but suffered in turn from Venetian raids during the frequent Ottoman–Venetian wars of the period, even though there were no Muslims on the island.[27] Santorini was captured briefly by the Russians under Alexey Orlov during the Russo-Turkish War of 1768–1774, but returned to Ottoman control after. 19th century [edit]In 1807, the islanders were forced by the Sublime Porte to send 50 sailors to Mykonos to serve in the Ottoman navy.[33] In 1810, Santorini with 32 ships possessed the seventh largest of the Greek fleet after Kefallinia (118), Hydra (120), Psara (60), Ithaca (38) Spetsai (60) and Skopelos (35).[34] During the last years of Ottoman rule, the majority of residents were farmers and seafarers who exported their abundant produce, while the level of education was improving on the island, with the Monastery of Profitis Ilias being one of the most important monastic centres in the Cyclades.[33] In 1821, the island was home to 13,235 inhabitants, which within a year had risen to 15,428.[35] Greek War of Independence [edit]As part of its plans to foment a revolt against the Ottoman Empire and gain Greek Independence, Alexandros Ypsilantis, the head of the Filiki Eteria in early 1821, dispatched Dimitrios Themelis from Patmos and Evangelis Matzarakis ( –1824), a sea captain from Kefalonia who had Santorini connections to establish a network of supporters in the Cyclades.[36] As his authority,[clarification needed] Matzarakis had a letter from Ypsilantis (dated 29 December 1820) addressed to the notables of Santorini and the Orthodox metropolitan bishop Zacharias Kyriakos (served 1814–1842). At the time, the population of Santorini was divided between those who supported independence, and (particularly among the Catholics and non-Orthodox) those who were ambivalent or distrustful of a revolt being directed by Hydra and Spetses or were fearful of the sultan's revenge. While the island didn't come out in direct support of the revolt, they did send 100 barrels of wine to the Greek fleet as well in April 1821,[clarify] 71 sailors, a priest and the presbyter Nikolaos Dekazas, to serve on the Spetsiote fleet.[33] Because of the lack of majority support for direct participation in the revolt, it was necessary for Matzarakis to enlist the aid of Kefalonians living in Santorini to, on 5 May 1821[33] (the feast day of the patron saint of the island), raise the flag of the revolution and then expel the Ottoman officials from the island.[36] The Provisional Administration of Greece organized the Aegean islands into six provinces, one of which was Santorini and appointed Matzarakis its governor in April 1822.[37][38] While he was able to raise a large amount of money (double that collected on Naxos), he was soon found to lack the diplomatic skills needed to convince the islanders who had enjoyed considerable autonomy to now accept direction from a central authority and contribute tax revenue to it. He claimed to his superiors that the islanders needed \"political re-education\" as they did not understand why they had to pay higher taxes than those levied under the Ottomans in order to support the struggle for independence. The hostility against the taxes caused many of the tax collectors to resign. Things were also not helped by the governor's authoritarian character, arbitrariness and arrests of prominent islanders losing him the support of Zacharias Kyriakos, who had initially supported Matzarakis. In retaliation Matzarakis accused him of being a \"Turkophile\" and had the archbishop imprisoned and then exiled him. The abbots of the monasteries, the priests and the prelates, complained to Demetrios Ypsilantis, president of the National Assembly. Matzarakis soon had to hire bodyguards as the island descended into open revolt against him.[36] Fearful for his life Matzarakis later fled the island,[36] and was dismissed from his governorship by Demetrios Ypsilantis. Mazarakis however later represented Santorini in the National Assembly and following his death was succeeded in that position in November 1824 by Pantoleon Augerino. Once they heard of massacres of the Greek population of Chios in April 1822, many islanders became fearful of Ottoman reprisals, with two villages stating they were prepared to surrender,[36] though sixteen monks from the Monastery of Profitis Ilias, led by their abbot Gerasimos Mavrommatis declared in writing their support for the revolt.[39] Four commissioners for the Aegean islands (among them, Benjamin of Lesvos and Konstantinos Metaxas) appointed by the Provisional Administration of Greece arrived in July 1822 to investigate the issues on Santorini. The commissioners were uncompromising in their support for Matzarakis. With news from Chios fresh in their minds the island's notables eventually arrested Metaxas, with the intention of handing him over to the Ottomans in order to prove their loyalty. He was rescued by his Ionian guards. Matters became so heated that Antonios Barbarigos ( –1824) who had been serving in the First National Assembly at Epidaurus since 20 January 1820 was seriously wounded in the head by a knife attack on Santorini in October 1822 during a dispute between the factions. In early 1823, the Second National Assembly at Astros, imposed a contribution of 90,000 grosis on Santorini to fund the fight for independence, while in 1836 they also had to contribute in 1826 to the obligatory loan of 190,000 grosis imposed on the Cyclades.[35] In decree 573 issued by the National Assembly 17 May 1823, Santorini was recognized as one of 15 provinces in the Greek controlled Aegean (nine in the Cyclades and six in the Sporades).[37] The island became part of the fledgling Greek state under the London Protocol of 3 February 1830, rebelled against the government of Ioannis Kapodistrias in 1831, and became definitively part of the independent Kingdom of Greece in 1832, with the Treaty of Constantinople.[27] Santorini joined an insurrection that had broken out in Nafplio on 1 February 1862 against the rule of King Otto of Greece. However, the royal authorities was able to quickly restore control and the revolt had been suppressed by 20 March of that year. However, the unrest arose again later in the year which lead to the 23 October 1862 Revolution and the overthrow of King Otto. World War II [edit]During the Second World War, Santorini was occupied in 1941 by Italian forces and then by the Germans following the Italian armistice in 1943. In 1944, the German garrison on Santorini was raided by a group of British Special Boat Service Commandos, killing most of its men. Five locals were later shot in reprisal, including the mayor.[40][41] Post-war [edit]In general, the island's economy continued to decline following World War II, with a number of factories closing as much industrial activity relocated to Athens. In an attempt to improve the local economy, the Union of Santorini Cooperatives was established 1947 to process, export and promote the islands agriculture products, in particular its wine. In 1952, they constructed near the village of Monolithos what is today the island's only remaining tomato processing factory. The island's tourism in the early 1950s generally took the form of small numbers of wealthy tourists on yacht cruises though the Aegean. The island's children would present arriving passengers with flowers and bid them happy sailing by lighting small lanterns along the steps from Fira down to the port, offering them a beautiful farewell spectacle. Once such visitor was the actress Olivia de Havilland, who visited the island in September 1955 at the invitation of Petros Nomikos.[42] In the early 1950s, the shipping magnate Evangelos P. Nomikos and his wife Loula decided to support their birthplace and so asked residents to choose whether they wanted the couple to pay for the construction of either a hotel or a hospital, to which local authorities replied that they would prefer a hotel. In 1954, Santorini had approximately 12,000 inhabitants and very few visitors. The only modes of transport on the island were a jeep, a small bus and the island's traditional donkeys and mules. 1956 earthquake [edit]At 05:11 local time (CEST, 03:11 UTC) on 9 July 1956, the 1956 Amorgos earthquake (magnitude – depending on the particular study – of 7.5,[43] 7.6,[43] 7.7[44] or 7.8[45]) struck 30 km (19 mi) south of the island of Amorgos, about 50 km (31 mi) from Santorini. It was the largest earthquake of the 20th century in Greece and also had a devastating impact on Santorini.[45][44] It was followed by aftershocks, the most significant being the first occurring at 05:24, 13 minutes after the main shock, which had a 7.2 magnitude.[45] This aftershock which originated close to the island of Anafi is believed to have been responsible for most of the damage and casualties on Santorini.[45] The earthquake was accompanied by a tsunami which, while much higher at other islands, is estimated to have reached 3 metres at Perissa and 2 metres at Vlichada on Santorini.[45] Immediately following the earthquake, the Greek Prime Minister Konstantinos Karamanlis declared Santorini a state of \"large-scale local disaster\" and visited the island to inspect the situation on 14 July.[46] Many countries had offered to send relief efforts, though Greece refused to accept the offer of the United Kingdom to send warships to help from Cyprus where they were involved in the Cyprus Emergency.[46] As there was no airport, the Greek military made air drops of food, tents and supplies and camps for homeless people were established on the outskirts of Fira.[47] On Santorini, the earthquakes killed 53 people and injured another 100.[48][46] 35% of the island's houses collapsed and 45% suffered major or minor damage.[46] In total, 529 houses were destroyed, 1,482 were severely damaged and 1,750 lightly damaged.[46] Almost all public buildings were completely destroyed. One of the largest buildings that survived unscathed was the newly built Hotel Atlantis, which allowed it to be used as a temporary hospital and to house public services. The greatest damage was experienced on the Western side along the edge of the caldera, especially at Oia, with parts of the ground collapsing into the sea. The damage from the earthquake reduced most of the population to extreme poverty and caused many to leave the island in search of better opportunities, with most settling in Athens.[46] 2025 earthquakes [edit]Santorini experienced a major earthquake swarm in February 2025.[49][50] Hundreds of tremors occurred in the Aegean Sea, to the north-east of the island, some measuring up to magnitude 5. The earthquake sequence began on about 27th January, and intensified after 1 February 2025. As the earthquakes continued, there was a precautionary evacuation of Santorini by sea and by air.[51] During the weekend of 1 and 2 February, more than 200 undersea tremors were detected. The epicenters were primarily in a growing cluster between the islands of Santorini, Anafi, Amorgos, Ios and the uninhabited islet of Anydros. Many of the earthquakes registered magnitudes above 4.5 on the Moment magnitude scale. The strongest earthquake of the swarm occurred on 10 February, and measured Mw 5.3.[52] At the time of the crisis, experts explained that they considered the earthquakes to be tectonic rather than volcanic in nature, but the pattern and frequency of seismic activity prompted significant concern among scientists and authorities.[53] Seismologist Manolis Skordylis indicated on public radio that a seismic fault line had been activated with potential to cause an earthquake exceeding magnitude 6.0.[54] Greek authorities implemented several emergency measures, which included the deployment of emergency crews and a 26-member rescue team with a rescue dog to the region.[53] Schools were closed on Santorini, Anafi, Amorgos, and Ios.[55] Access to areas near cliffs was restricted due to increased risk of landslides. In Fira, several gathering points for evacuation were established.[53] Access to shorelines and certain ports, including Santorini's old port, was restricted due to tsunami risk, with residents instructed to move inland.[54] Greece's Minister of Climate Crisis and Civil Protection Vasilis Kikilias emphasized the precautionary nature of the response. Prime Minister of Greece Kyriakos Mitsotakis, who spoke while in Brussels, called for calm while acknowledging the intensity of the earthquake swarm. Hotels were told to drain their swimming pools to minimize potential earthquake damage to structures.[53] Aegean Airlines doubled its flight frequency between Athens and Santorini for a two-day period to carry out evacuations. Ferry companies increased their service frequency in response to surging demand, resulting in long queues forming at evacuation ports.[54] Around 6,000 residents left the island by ferry beginning on 2 February, while up to 2,700 left by air from 3 to 4 February. The South Aegean Regional Fire Department was placed on general alert.[56] A state of emergency was declared in Santorini by the Greek government on 6 February.[57] In Turkey, the Disaster and Emergency Management Presidency (AFAD) and the Mineral Research and Exploration General Directorate (MTA) warned that the earthquakes could lead to volcanic activity around the Kolumbo submarine volcano off Santorini.[58] The earthquakes began to decline in intensity and number after mid-February, and the seismic crisis ended in late February. The state of emergency was lifted on 3rd March. Later analysis of the observations of earthquakes and ground deformation by scientists pointed to the potential involvement of a deep intrusion of magma in causing the events.[59][60][61] Tourism [edit]The expansion of tourism in recent years has resulted in the growth of the economy and population.[62] Santorini was ranked the world's top island by many magazines and travel sites, including the Travel+Leisure Magazine,[63] the BBC,[64] as well as the US News.[65] An estimated 2 million tourists visit annually.[66] Santorini has been emphasising sustainable development and the promotion of special forms of tourism, the organization of major events such as conferences and sport activities. The island's pumice quarries have been closed since 1986, in order to preserve the caldera. In 2007, the cruise ship MS Sea Diamond ran aground and sank inside the caldera. As of 2019, Santorini is popular with Asian couples who come to the island to have pre-wedding photos taken against the backdrop of the landscape.[67] Geography [edit]Geological setting [edit]The Cyclades are part of a metamorphic complex that is known as the Cycladic Massif. The complex formed during the Miocene and was folded and metamorphosed during the Alpine orogeny around 60 million years ago. Thera is built upon a small non-volcanic basement that represents the former non-volcanic island, which was approximately 9 by 6 km (5.6 by 3.7 mi). The basement rock is primarily composed of metamorphosed limestone and schist, which date from the Alpine Orogeny. These non-volcanic rocks are exposed at Mikros Profititis Ilias, Mesa Vouno, the Gavrillos ridge, Pyrgos, Monolithos, and the inner side of the caldera wall between Cape Plaka and Athinios. The metamorphic grade is a blueschist facies, which results from tectonic deformation by the subduction of the African Plate beneath the Eurasian Plate. Subduction occurred between the Oligocene and the Miocene, and the metamorphic grade represents the southernmost extent of the Cycladic blueschist belt. Volcanism [edit]Volcanism on Santorini is due to the Hellenic subduction zone southwest of Crete. The oceanic crust of the northern margin of the African Plate is being subducted under Greece and the Aegean Sea, which is thinned continental crust. The subduction compels the formation of the Hellenic arc, which includes Santorini and other volcanic centres, such as Methana, Milos, and Kos.[68] The island is the result of repeated sequences of shield volcano construction followed by caldera collapse.[69] The inner coast around the caldera is a sheer precipice of more than 300 m (980 ft) drop at its highest, and exhibits the various layers of solidified lava on top of each other, and the main towns perched on the crest. The ground then slopes outwards and downwards towards the outer perimeter, and the outer beaches are smooth and shallow. Beach sand colour depends on which geological layer is exposed; there are beaches with sand or pebbles made of solidified lava of various colours: such as the Red Beach, the Black Beach and the White Beach. The water at the darker coloured beaches is significantly warmer because the lava acts as a heat absorber. The area of Santorini incorporates a group of islands created by volcanoes, spanning across Thera, Thirasia, Aspronisi, Palea, and Nea Kameni. Santorini has erupted many times, with varying degrees of explosivity. There have been at least twelve large explosive eruptions, of which at least four were caldera-forming.[68] The most famous eruption is the Minoan eruption, detailed below. Eruptive products range from basalt all the way to rhyolite, and the rhyolitic products are associated with the most explosive eruptions. The earliest eruptions, many of which were submarine, were on the Akrotiri Peninsula, and active between 650,000 and 550,000 years ago.[68] These are geochemically distinct from the later volcanism, as they contain amphiboles. Over the past 360,000 years there have been two major cycles, each culminating with two caldera-forming eruptions. The cycles end when the magma evolves to a rhyolitic composition, causing the most explosive eruptions. In between the caldera-forming eruptions are a series of sub-cycles. Lava flows and small explosive eruptions build up cones, which are thought to impede the flow of magma to the surface.[68] This allows the formation of large magma chambers, in which the magma can evolve to more silicic compositions. Once this happens, a large explosive eruption destroys the cone. The Kameni islands in the centre of the lagoon are the most recent example of a cone built by this volcano, with much of them hidden beneath the water. Minoan eruption [edit]During the Bronze Age, Santorini was the site of the Minoan eruption, one of the largest volcanic eruptions in human history. It was centred on a small island just north of the existing island of Nea Kameni in the centre of the caldera; the caldera itself was formed several hundred thousand years ago by the collapse of the centre of a circular island, caused by the emptying of the magma chamber during an eruption. It has been filled several times by ignimbrite since then, and the process repeated itself, most recently 21,000 years ago. The northern part of the caldera was refilled by the volcano, then collapsed once more during the Minoan eruption. Before the Minoan eruption, the caldera formed a nearly continuous ring with the only entrance between the islet of Aspronisi and Thera; the eruption destroyed the sections of the ring between Aspronisi and Therasia, and between Therasia and Thera, creating two new channels. On Santorini, a deposit of white tephra thrown from the eruption is up to 60 m (200 ft) thick, overlying the soil marking the ground level before the eruption, and forming a layer divided into three fairly distinct bands indicating different phases of the eruption. Archaeological discoveries in 2006 by a team of international scientists revealed that the Santorini event was much more massive than previously thought; it expelled 61 km3 (15 cu mi) of magma and rock into the Earth's atmosphere, compared to previous estimates of only 39 km3 (9.4 cu mi) in 1991,[53][54] producing an estimated 100 km3 (24 cu mi) of tephra. Only the Mount Tambora volcanic eruption of 1815, the 181 AD eruption of the Taupo Volcano, and possibly Baekdu Mountain's 946 AD eruption have released more material into the atmosphere during the past 5,000 years. The Minoan eruption has been considered as possible inspiration for ancient stories including Atlantis and the Exodus. The content of the stories is not supported by current archaeological research, but remain popular in pseudohistory and pseudoarchaeology.[citation needed] Post-Minoan volcanism [edit]Post-Minoan eruptive activity is concentrated on the Kameni islands, in the centre of the lagoon. They have been formed since the Minoan eruption, and the first of them broke the surface of the sea in 197 BC.[68] Nine subaerial eruptions are recorded in the historical record since that time, with the most recent ending in 1950. In 1707, an undersea volcano breached the sea surface, forming the current centre of activity at Nea Kameni in the centre of the lagoon, and eruptions centred on it continue – the twentieth century saw three such, the last in 1950. Santorini was also struck by a devastating earthquake in 1956. Although the volcano is dormant at the present time, at the current active crater (there are several former craters on Nea Kameni), steam and carbon dioxide are emitted. Small tremors and reports of strange gaseous odours over the course of 2011 and 2012 prompted satellite radar technological analyses and these revealed the source of the symptoms; the magma chamber under the volcano was swollen by a rush of molten rock by 10 to 20 million cubic metres between January 2011 and April 2012, which also caused parts of the island's surface to rise out of the water by a reported 8 to 14 centimetres.[70] Scientists say that the injection of molten rock was equivalent to 20 years' worth of regular activity.[70] At the beginning of February 2025, there were hundreds of minor earthquakes up to magnitude 5 near Santorini, mostly in an area around the tiny islet of Anydros, north-east of Santorini. About 9,000 people left the island out of a population of 15,500 in the face of seismic activity that could last weeks. The tremors were attributed to tectonic plate movements rather than volcanic activity.[71] Climate [edit]According to the National Observatory of Athens Santorini has a hot semi-arid climate (Köppen climate classification: BSh) with Mediterranean (Csa) characteristics, such as the dry summers and the relatively wetter winters. It has an average annual precipitation of around 270 mm (11 in) and an average annual temperature of around 19 °C (66 °F).[72][73] Economy [edit]Santorini's primary industry is tourism, particularly in the summer months. Agriculture also forms part of its economy, and the island sustains a wine industry.[62] The economic life of Santorini before 1960, when the flow of foreign visitors to the island for tourist purposes gradually began, was based on crops and trade. Agriculture [edit]In the middle of the 19th century, Santorini had great commercial activity with foreign countries and especially with Russia, where it exported all of its wine production.[76][77] Because of its unique ecology and climate – and especially its volcanic ash soil – Santorini is home to unique and prized produce such as the Santorini cherry tomato. Viticulture, whose history goes back to prehistoric times, could not remain unaffected by the rapid increase in tourism, where there was a gradual decrease.[62] Viticulture is the most important sector of agricultural production in Santorini. Wine industry [edit]The island remains the home of a small wine industry, based on the indigenous Assyrtiko grape variety, with auxiliary cultivations of Aegean white varieties such as Athiri and Aidani and the red varieties such as Mavrotragano and Mandilaria. The vines are extremely old and resistant to phylloxera (attributed by local winemakers to the well-drained volcanic soil and its chemistry), so the vines needed no replacement during the great phylloxera epidemic of the late 19th century. In their adaptation to their habitat, such vines are planted far apart, as their principal source of moisture is dew, and they often are trained in the shape of low-spiralling baskets, with the grapes hanging inside to protect them from the winds.[78] The viticultural pride of the island is the sweet and strong Vinsanto (Italian: \"holy wine\"), a dessert wine made from the best sun-dried Assyrtiko, Athiri, and Aidani grapes, and undergoing long barrel aging (up to twenty or twenty-five years for the top cuvées). It matures to a sweet, dark, amber-orange unctuous dessert wine that has achieved worldwide fame, possessing the standard Assyrtiko aromas of citrus and minerals, layered with overtones of nuts, raisins, figs, honey, and tea. White wines from the island are extremely dry with a strong citrus scent and mineral and iodide salt aromas contributed by the ashy volcanic soil, whereas barrel aging gives to some of the white wines a slight frankincense aroma, much like Vinsanto. It is not easy to be a winegrower in Santorini; the hot and dry conditions give the soil a very low productivity. The yield per hectare is only 10 to 20% of the yields that are common in France or California. The island's wines are standardised and protected by the \"Vinsanto\" and \"Santorini\" OPAP designations of origin.[79] Brewing [edit]A brewery, the Santorini Brewing Company, began operating out of Santorini in 2011, based in the island's wine region.[80] Governance [edit]The present municipality of Thera (officially: \"Thira\", Greek: Δήμος Θήρας),[81][82] which covers all settlements on the islands of Santorini and Therasia, was formed at the 2011 local government reform, by the merger of the former Oia and Thera municipalities.[4] Oia is now called a Κοινότητα (community), within the municipality of Thera, and it consists of the local subdivisions (Greek: τοπικό διαμέρισμα) of Therasia and Oia. The municipality of Thera includes an additional 12 local subdivisions on Santorini island: Akrotiri, Emporio, Episkopis Gonia, Exo Gonia, Imerovigli, Karterados, Megalohori, Mesaria, Pyrgos Kallistis, Thera (the seat of the municipality), Vothon, and Vourvoulos.[83] Towns and villages [edit]Attractions [edit]Architecture [edit]The traditional architecture of Santorini is similar to that of the other Cyclades, with low-lying cubical houses, made of local stone and whitewashed or limewashed with various volcanic ashes used as colours. These colours, in recent years, tend to replace white in the colour of house façades, according to the traditional architecture of the island as it was developed until the great earthquake of 1956. The unique characteristic is the common use of the hypóskapha: extensions of houses dug sideways or downwards into the surrounding pumice. These rooms are prized because of the high insulation provided by the air-filled pumice, and are used as living quarters of unique coolness in the summer and warmth in the winter. These are premium storage space for produce, especially for wine cellaring: the Kánava wineries of Santorini. When strong earthquakes struck the island in 1956, half the buildings were completely destroyed and a large number suffered repairable damage. The underground dwellings along the ridge overlooking the caldera, where the instability of the soil was responsible for the great extent of the damage, needed to be evacuated. Most of the population of Santorini had to emigrate to Piraeus and Athens.[84] Fortifications [edit]During the 15th and 16th centuries, the Cyclades were under threat from pirates who plundered the harvests, enslaved men and women and sold them in the slave markets. The small bays of the island were als"
}