{
  "url": "https://www.timesnownews.com/world/us/us-news/who-is-ivan-raiklin-far-right-activist-clash-michael-fanone-jan-6-capitol-riots-jack-smith-hearing-article-153491056",
  "title": "Who Is Ivan Raiklin? Far-Right Activist Who Clashed With Michael Fanone During Jan 6 Capitol Riots Hearing | US News - Times Now",
  "text": "A tense altercation unfolded Thursday at a congressional hearing featuring former special counsel Jack Smith when Michael Fanone, a former D.C. Metropolitan Police officer who defended the US Capitol on January 6, 2021, confronted conservative activist Ivan Raiklin during a brief recess. Video of the incident shows Fanone and Raiklin facing off as other former law enforcement officers attempted to restrain Fanone. Former Capitol Police officer Harry Dunn intervened, pulling Fanone away as uniformed officers stepped between the two men. “See how many people are restraining you, and look at me, totally in control over my mind and body,” Raiklin said during the confrontation. Fanone, visibly angry, pointed at Raiklin and shouted: “This guy has threatened my family, threatened my children, threatened to rape my children, you sick bastard.” Following the clash, additional US Capitol Police officers were called into the hearing room to maintain order. Some officers spoke with Raiklin, who later left the room, though it remains unclear whether he was directed to leave or exited voluntarily. Who Is Ivan Raiklin? Ivan Raiklin is an American far-right political operative, conservative activist, and former US Army reservist. He is widely known as the originator of the so-called “Pence card,” a controversial and widely discredited legal theory that sought to overturn the results of the 2020 US presidential election. Raiklin tweeted the idea to President Donald Trump on December 16, 2020, and Trump later retweeted it. A longtime associate of Michael Flynn, Raiklin previously served as a Green Beret and later as a lieutenant colonel in the Army Reserve. He also worked as an employee of the Defense Intelligence Agency. Raiklin continues to appear frequently on Capitol Hill to protest the 2020 election results. On January 14, 2026, during the first public hearing of the House Judiciary Select Subcommittee investigating unresolved questions surrounding January 6, he held up a sign bearing the name of a Capitol Police officer who had been falsely accused by Blaze Media of planting pipe bombs. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World."
}