{
  "url": "https://www.prestonmotor.com/",
  "title": "Preston Automotive Group | Serving Maryland, Virginia & Delaware",
  "text": "Preston Pre-Owned Program The Preston Pre-Owned Program was developed to help customers find the perfect pre-owned vehicle to fit their needs. Our vehicles are carefully inspected and classified into three categories: Gold, Silver, and Bronze based on specific criteria each category requires. Shop our Inventory today to find the perfect pre-owned vehicle for you! Learn MoreOur At Home Services We will bring the dealership to you with Our at Home Services Program. Vehicle delivery, at home test drives, and video walk arounds can all be done from the comfort of your home. We also offer pick-up and delivery of vehicles for service-no need to step foot in the dealership! Check out all our services we offer today! Learn MorePreston Cares Community is a core value for the Preston Automotive Group. We actively support the communities we serve and encourage involvement in programs that are important to our Associates. Learn MorePreston Business Alliance For more than 40 years, Preston Automotive Group has strived to align ourselves with other local businesses because we were taught by our matriarch, Pansy Wilson, that local businesses that support local businesses create the strongest communities and one of our core values is to serve our communities daily! To further that commitment, we are excited to introduce you to Preston Business Alliance Service Locations Locate a service center near you, learn more about our mobile service, or explore our flexible payment options. Learn MoreWhy the Frog? Born in 1984, the Frog has been an integral part of the Preston Automotive Group family. Debuted on TV and seen on dashboards nationwide. Learn More Welcome to Preston Automotive Group Thank you for visiting our Preston Automotive Group website. Since 1975, Preston Automotive Group has been serving customers nationwide with vehicle delivery services. The Group offers 19 dealership locations and 10 brands located in Maryland, Delaware, and Virginia. When it comes to pre-owned, we offer a wide selection of vehicles fit for any budget. We also have a Quick Lane location and Auto Express Tire & Rental for your quick service needs. Our collision centers include Preston Autobody, Cambridge Autobody, Dover Autobody, Wilmington Autobody, and Snow Hill Autobody for your auto body repairs. In addition to our automotive locations, we also operate Preston Powersports and Preston Lawn & Equipment, representing over 10 trusted brands. These locations offer a full range of motorcycles, ATVs, outdoor power equipment, and service solutions. Whether you are looking for a new or used car, truck, SUV, powersports vehicle, or outdoor equipment, you will find it here. More About UsThe Preston Automotive Group has been proud to start from the Eastern Shore and has grown to serve customers nationwide, offering the very best in both sales and service. It all began for us with Ford and we have grown to represent Hyundai, Mazda, Chrysler, Dodge, Jeep, RAM, Nissan, Toyota, Chevrolet, and Lincoln along with our wide variety of used cars, trucks, and SUV's. We continue to look for ways to better serve our communities and began Preston Cares to assist with our outreach. In 1984, the Frog was born and continues to be our mascot. We are proud to say that Preston Automotive Group is the Destination Dealership for Maryland, Delaware, and Virginia. Starting from Preston, we have grown to serve the communities in Annapolis, Baltimore, Salisbury, Virginia Beach, and beyond. The Group has prided itself in at home deliveries since 1975 to make car buying as convenient as possible for the customer. In 2020, that elevated with the offering of mobile service. We offer two mobile service vans that can service your vehicle in your driveway or at work. Our mobile service vans service all makes and models and will get you back on the road as quickly as possible!We service all makes and models throughout Delaware, Maryland, and Virginia. Whether you're looking for an oil change, brake service, battery replacement, scheduled maintenance or repairs to your vehicle, we've got you covered. We have tire experts and inventory. We offer a low price tire guarantee to help find the biggest tire discounts. Looking for seasonal recommendations? We are your resource for winter, road trips, and more. We are committed to finding the vehicle that fits you best! We offer one of the largest inventories in the country for Ford, Hyundai, Mazda, Chrysler, Dodge, Jeep, RAM, Nissan, Toyota, Chevrolet, and Lincoln. We offer test drives at home or at our dealerships on top selling model lines such as the F-150, Ranger, Escape, Bronco, Mustang, Explorer, Equinox, Traverse, Silverado, Wrangler, Cherokee, Grand Cherokee, Palisade, CX-30, 4Runner, RAV4, Navigator and many other popular models. We recognize your time is valuable and will schedule when convenient for you. Preston is “Built For Your Business” with a wide selection of commercial vehicles to support your profession. Preston Ford’s commercial vehicle center ranks as a Top 10 commercial dealer in the nation thanks to the team’s decades of knowledge on Super Duty, Transit, Transit Connect, Dump Body, Service Body, Cutaway Vans, and more. We have relationships with top upfit companies including Knapheide and Dejana. We offer demo and lease programs that can save your business money. We offer insight on tax benefits such as Section 179 to help you learn more on the savings. The Preston Automotive Group is your devoted Dealership for Life, and we work tirelessly to foster a well-established relationship with you and your family. You can receive valuable discounts, complimentary service, and premium membership as a preferred customer with our Preston For Life Program. We have you covered from multi-point inspections and vehicle checkups to auto body shop estimates and shuttle services. Our Dealerships are ready to be your resource for auto financing. Whether you are looking to finance or lease, we can walk you through the benefits to both. Looking to explore options from home? Select finance application on any of our dealership websites and get pre-approved today! Preston Cares is a vital part to our organization that supports the local communities that each of our dealerships live in. From Little League Baseball teams to supporting the fight against breast cancer, we truly believe that together we can do more. Community is a core value to our organization and we’d love to hear from you on how we can help. Please send your opportunity to community@prestonmotor.com."
}