{
  "url": "https://en.wikipedia.org/wiki/Finn_the_Human",
  "title": "Finn the Human - Wikipedia",
  "text": "Finn the Human Finn Mertens, better known as Finn the Human, is a character and one of the two protagonists, alongside Jake the Dog, of the American animated television series Adventure Time and its franchise created by Pendleton Ward. He also appeared in the spin-off series Adventure Time: Distant Lands and Adventure Time: Fionna and Cake. He was voiced by Jeremy Shada in most appearances. The character made his debut in the original pilot, where he is named Pen and voiced by Zack Shada, Jeremy's older brother. Jonathan Frakes voices Finn as an adult in some appearances. Prior to the start of Adventure Time, Finn was adopted as an infant by two anthropomorphic dogs named Joshua and Margaret, who found him in the woods. His best friend and adoptive brother Jake the Dog (John DiMaggio) accompanies him on many of his adventures in Ooo, the fictional world that the series is set in. The mystery surrounding Finn's origins and whether he is the last human left in Ooo is a major part of the character's narrative arc. Later in the series, it is revealed that there are other humans still living in Ooo and that Finn's parents Martin and Minerva came from a community of survivors living on a chain of islands. Finn has received universal praise for his character development and coming-of-age narrative, which saw the character mature from an immature boy into a wise young man. Adam Muto, former showrunner for Adventure Time, has stated that Finn's progression from an aggressive and reckless boy into a more mature person was one of his favorite character arcs to write. A gender-swapped version of Finn called Fionna appeared in the third-season episode \"Fionna and Cake\", and is the main character of the spinoff series Adventure Time: Fionna and Cake. Design and voice acting [edit]Series creator Pendleton Ward has stated that he wrote Finn, and Adventure Time as a whole, as though he were playing a session of Dungeons & Dragons, a tabletop role-playing game. Ward commented that Finn's motivations are noble, with a desire to \"slay monsters, explore dungeons, find loot.\"[2] Ward spent much of his childhood at home, and he described his \"[indoor] adventure experience\" as inspiring Finn and Jake the Dog's adventures.[3] Early on in the development of the show, Ward had intended for Finn and Jake to be nomads who lived in tents. However, this was changed to having them live in a permanent home at Cartoon Network's request.[4] The character first appeared in the short film \"Adventure Time\", which centers around rescuing Princess Bubblegum (Hynden Walch) from the evil Ice King (John Kassir).[5][6] This short aired as part of Nickelodeon's Random! Cartoons showcase in 2008. Zack Shada voiced the character, then called Pen, in the short.[7] Zack Shada was too old for the role when the series was picked up by Cartoon Network, and his younger brother Jeremy, 12 years old at the time, auditioned.[7] According to Jeremy Shada, the showrunners did not at first realize that he was Zack's younger brother. He said that: \"they just thought they got lucky with someone that sounded like the original.\"[8] Shada's voice noticeably cracked and changed during the filming of Adventure Time as he was undergoing puberty.[9] Ward decided that Shada would not be recast when his voice changed. Instead, the character of Finn was gradually aged as Shada's voice naturally deepened, and the themes of the show matured with the character.[10] Older versions of Finn appear in several episodes of the show. Jonathan Frakes voices two alternate adult versions of Finn in the season 5 episodes \"Puhoy\" and \"Dungeon Train\".[11] Like other Adventure Time characters, Finn is drawn with rubbery \"limp noodle\" limbs and a simple but expressive face. He has several missing teeth, which Ward explained as being due to the character never having been to a dentist.[12] He typically wears a signature white bear hat,[13] and form-fitting clothing.[12] Finn's visual design resembles Bueno the Bear, another character created by Ward. Finn and Bueno share some other similarities, including an enjoyment of beatboxing.[14] Finn was always fun because he started very agro [sic] and that was fun to write for a while, but as he got older it didn't make sense to keep writing him that way. He became a mellower version of himself and more introspective and that was satisfying to follow.[15] The show depicts Finn dealing with the struggles of adolescence and coming to terms with the complexities of life.[16] Over time, the show's creators decided to further develop Finn's backstory, including his parents and whether he was truly the last human left in Ooo.[10] A major theme of the series is that Finn begins to see the world in more nuanced terms, rather than the naive outlook he demonstrated in earlier seasons. Although many of the show's conflicts were about good versus evil at the start of the series, they become more complex as it progresses.[7] Adventure Time composer Tim Kiefer said that the show had gradually became an exploration of the \"Hero's journey\", through Finn.[17] In the early seasons of the series, Finn is enthusiastic and readily resorts to violence to settle conflicts. About this aspect of Finn's personality, Ward said that he chose to \"add a little wrath\" to add depth to the character.[18] By the end of the series, Finn is much more reserved.[19] Adventure Time showrunner Adam Muto stated that this progression is part of the reason why Finn did not have a sword for much of the finale.[20] Muto said he felt that this story arc, involving Finn's progression from a violent character to a more introspective one, made him one of the most satisfying characters to write on the show.[15] Appearances [edit]Finn the Human is the main character of Adventure Time and often appears alongside his best friend and adoptive brother Jake the Dog.[21] Finn was adopted by Jake's parents Joshua and Margaret as an infant. He is originally believed to be the only human left in Ooo after the \"Great Mushroom War\", a mysterious conflict that occurred 1,000 years prior to the start of the series.[22][23] It is later shown that he was born on Hub Island, part of an isolated archipelago populated by humans.[24] Finn's biological father Martin (Stephen Root) is a conman, while his mother Minerva (Sharon Horgan) is a doctor. Martin fled Hub Island with an infant Finn after being found by disgruntled acquaintances from his past. He was separated from Finn, who was left on a raft floating towards the mainland.[25] In the first-season episode \"The Enchiridion!\", Finn and Jake complete a series of challenges to win the Enchiridion, a legendary handbook for heroes.[26] In \"His Hero\", Finn meets the legendary adventurer Billy (Lou Ferrigno), who unsuccessfully tries to convince Finn to give up violence.[27] Finn and Jake go on a quest to find the Lich (Ron Perlman), an ancient undead king, in the second-season episodes \"Mortal Folly / Mortal Recoil\".[28] The Lich returns in the fourth season finale \"The Lich\", and kills Billy. After taking control of Billy's body, the Lich attempts to trick Finn and Jake into giving him the Enchiridion.[28] Billy's death profoundly impacts Finn, as shown in the season five episode \"Billy's Bucket List\".[29] Finn experiences other alternate lives and versions of himself throughout the series, all of whom have lost their right arm. This foreshadows Finn's eventual loss of his arm in the season 6 premiere \"Wake Up / Escape from the Citadel\".[30] In \"Escape from the Citadel\", Finn discovers that his father Martin is an inmate of the Citadel, a multiversal prison reserved for those who commit a \"cosmic crime\". Finn and Jake go to the Citadel to find Martin. The Lich arrives and attempts to free its prisoners so he can use them as an army. Finn loses his arm when the Lich destroys the Citadel, and Martin escapes.[31] Finn is changed by the loss of his arm and becomes disillusioned with his father.[32] A flower blooms from the stump where Finn's arm used to be, and eventually grows into a new arm.[33] He loses his control of his regrown arm, which transforms into a grass doppelgänger called Fern in the eighth season two-part episode \"Preboot / Reboot\". The violent and reckless Fern acts as a foil to Finn, who has matured over the course of the series.[19] Finn later attempts to redeem Fern, who shares many of the shortcomings Finn had when he was younger.[34] In the following episode, \"Two Swords,\" Finn is fitted with a robotic arm by Princess Bubblegum.[35] The miniseries Islands, which aired as part of season eight, sees Finn search for the surviving humans who left the continent and moved to an archipelago centuries after the Great Mushroom War.[36] Finn meets his mother Minerva, a doctor who has uploaded her mind to a network of robots. Minerva tries to force Finn to stay on the island where she can protect him until Finn convinces her to let him go.[25] He invites the humans to return to Ooo, but they choose to remain on their islands for the time being.[37] In the series finale \"Come Along With Me,\" Finn and Jake help Princess Bubblegum fight her dictatorial uncle Gumbald.[38] Realizing that violence is not the answer to the conflict, they ally with Gumbald to defeat the evil deity GOLB, who is intent on destroying Ooo.[39] Finn's robotic arm is snapped off when he and the other protagonists are eaten by GOLB.[40] GOLB is defeated, although Fern dies in the aftermath. Finn promises to plant Fern's seedling in the ruins of the treehouse, which has been destroyed.[40] The seedling grows into a new treehouse, with a grass sword inside.[41] Finn and Jake are shown relaxing on a beach when the humans return to Ooo for the first time in centuries.[42] The Adventure Time: Distant Lands special \"Together Again\" takes place sometime after the end of the series, when Finn has died of old age.[43] He then journeys through the Dead Worlds to be reunited with Jake, who predeceased him. After reuniting with Jake in the afterlife, the two choose to reincarnate back into the living world together.[44][45] Others [edit]Since Adventure Time's inception, Finn has appeared in various comic book series, video games, and other merchandise.[46] Finn's first console game appearance was as a playable character in Adventure Time: Hey Ice King! Why'd You Steal Our Garbage?!!, which was released on Nintendo DS and 3DS in 2012.[47] He was subsequently a playable character in Adventure Time: Explore the Dungeon Because I Don't Know! (2013),[48] Adventure Time: The Secret of the Nameless Kingdom (2014),[49] and Adventure Time: Pirates of the Enchiridion (2018).[50] Finn has also made crossover appearances in other franchises and media. He appeared in the seventh season Futurama episode \"Leela and the Genestalk\".[51] The opening sequence couch gag in the 28th season The Simpsons episode \"Monty Burns' Fleeing Circus\" featured Bart Simpson as \"Bart the Boy\", a parody of Finn.[52] He also appeared in the Uncle Grandpa episodes \"Pizza Eve\" and \"Cartoon Factory\". He also appeared in the OK K.O.! Let's Be Heroes episode, \"Crossover Nexus\".[53] Finn is a playable character in toys-to-life game Lego Dimensions (2015),[54] beat 'em up game Cartoon Network: Battle Crashers (2016),[55] crossover game Bloons Tower Defense: Adventure Time (2018),[56] fighting game Brawlhalla (2019),[57] and action-adventure game Immortals Fenyx Rising (2020).[58] In November 2021, Finn was confirmed to appear as a playable character in the fighting game MultiVersus (2024).[59] He appeared in the Teen Titans Go! episode, \"Warner Bros. 100th Anniversary\". Fionna and Cake [edit]A gender-swapped version of Finn called Fionna appeared in the season 3 episode \"Fionna and Cake\", voiced by Madeleine Martin. Fionna inhabits a fictional world created by the Ice King (Tom Kenny) as a form of in-universe fanfiction.[60] The concept for Fionna and Cake came from drawings made by Adventure Time storyboard artist Natasha Allegri.[61] The tomboy-ish character of Fionna has much the same personality as Finn and has similar struggles with romantic attractions.[62] Both Fionna and Cake the Cat, the alternate version of Jake the Dog, became popular with Adventure Time fans.[63] Fionna later appeared in the fifth-season episode \"Bad Little Boy\", the sixth-season episode \"The Prince Who Wanted Everything\", the eighth-season episode \"Five Short Tables\", and the ninth season episode \"Fionna and Cake and Fionna\". Fionna stars in the spin-off series Adventure Time: Fionna and Cake.[64] Characteristics [edit]Personality and traits [edit]Finn is a teenage boy with a childlike personality, boyish enthusiasm, and a love of adventure.[4] He is 12 years old at the beginning of the series but ages throughout the show and is 17 by the series finale.[19] He is talented at beatboxing and sword fighting.[22] Finn is prone to outbursts of phrases like \"Mathematical!\" and \"Algebraic!\".[13] He is shown to have thalassophobia in the season one episode \"Ocean of Fear\" but overcomes his fear of the sea in \"Billy's Bucket List\".[65][29] In the fifth-season episode \"Red Starved\", it is implied that Finn is color blind.[66] Finn is shown to be enthusiastic and reckless, although he becomes more reserved over the course of the series.[7] He is motivated by a desire to live by a heroic code and a thirst for adventure. Having once been lost in the woods as a helpless infant, he \"vowed to help anyone in need, no matter how small their problem\".[67] Many of Finn and Jake's early adventures revolve around them exploring the land of Ooo and battling monsters.[3] Finn's life with Jake is modelled after the archetypal knight-errant, as they frequently explore dungeons, fight evil creatures, rescue various princesses, and save the world.[68] Relationships [edit]Finn has a close relationship with his adoptive older brother Jake the Dog, an anthropomorphic dog with the ability to change shape. At the time of the series, Finn and Jake live together in a treehouse. Their relationship is at times strained by the differences in their maturity and outlook on life. Jake often finds himself frustrated by Finn's childish antics and infatuations with various princesses. Finn's life revolves around adventuring and fighting monsters, while Jake likes to pursue more varied interests. After Jake ends up in a relationship with Lady Rainicorn and has five children with her, his focus shifts towards being a father. This creates distance between them, but they remain close friends and Finn enjoys being an uncle.[69][70] Finn is also friends with BMO (pronounced Beemo), a sentient handheld game console who is Finn and Jake's roommate. Finn creates the robot NEPTR (Never Ending Pie Throwing Robot) as part of a prank, but NEPTR soon becomes a friend to him.[71] Finn ends up developing a close friendship with Marceline the Vampire Queen (Olivia Olson), despite her initial role as an antagonist.[72] Finn is shown to have an unrequited love for Princess Bubblegum throughout much of the series. He and Jake frequently have to rescue Princess Bubblegum from the obsessive Ice King.[73] Finn's past life as Shoko, an orphaned thief who befriends and then betrays Princess Bubblegum, influences his present-day infatuation with Bubblegum.[74] Finn's friendship with Bubblegum becomes more platonic as the series progresses.[75] Finn begins dating Flame Princess (Jessica DiCicco) in the third-season finale \"Incendium\", after realizing that Princess Bubblegum is too old to be compatible with him. Although Flame Princess' fiery nature makes their relationship difficult, they try to make it work.[76][77] Finn and Flame Princess eventually break up. Finn's relationships with both Princess Bubblegum and Flame Princess cause him to have to deal with rejection and reconciliation, and he emotionally matures as a result.[68] Finn has a complex relationship with his biological father, Martin Mertens, who is shown to be a scoundrel. In season 6, Martin reveals to Finn that he was forced to abandon him as an infant after reaching a crossroads too dangerous for an infant and that he always meant to return for him.[78] Adam Muto said that they did not want Finn to be a \"carbon copy\" of Martin since he had an adoptive father in Joshua. Muto said they wanted to \"embrace the idea of Martin being as rogueish [sic] and dishonorable as Finn is heroic\".[79] The season six episode \"Breezy\" deals with Finn's depression after losing his arm, being disappointed by his father, and breaking up with Flame Princess. Finn makes out with various princesses in an attempt to feel something positive but is left emotionally unfulfilled.[80] During the episode, he explores a complicated relationship with a honeybee named Breezy, who falls in love with a flower sprouting from where his arm was cut off.[33] Both Finn and his mother Minerva are shown to be selfless and dedicated to helping others. However, Minerva is fearful and overprotective due to the losses she has experienced, in contrast with Finn's adventurousness.[81] Upon reuniting with Finn in the miniseries Islands, she is both alarmed by his dangerous lifestyle and proud that he devotes his life to helping others. She attempts to trap Finn on the island so that he will be out of harm's way.[25] After convincing her to release him, Finn leaves her behind and returns to Ooo, though the separation causes him grief.[37][25] Various critics have interpreted the portrayal of Finn and Minerva's opposing views as a commentary on the repression of emotions, overreliance on technology,[82] the sacrifice of freedom in exchange for safety,[83] an exploration of Nietzschean philosophy,[37] and an allegory for \"American self-absorption.\"[36] Reception [edit]Finn the Human's character arc has been highlighted by critics for its honest realistic portrayal of adolescence and universal struggles associated with coming-of-age.[84] Brandon Zachary of Comic Book Resources described Adventure Time as \"one of the most expansive fantasy series in modern history, centering around a kind but unassuming boy growing into a noble young man.\"[85] Writing for Vox, Emily VanDerWerff called the series \"this era's finest coming-of-age story\", mentioning how Finn grew \"from boy to almost-man, an adolescent who's slowly figuring out how to be both a good friend and a good person.\"[86] Oliver Sava of The A.V. Club praised the episode \"Breezy\" for its relatable depiction of Finn's developing sexuality and his search for emotional fulfillment.[33] Finn's story arc as the last remaining human — and his eventual discovery of other humans — has been praised by critics.[36][87][88] Zach Blumenfeld of Paste contrasted Finn's rootless and heroic existence to the passionless, technology-dependent lives of the other human survivors in Islands. Blumenfeld considered Finn to be an example of Friedrich Nietzsche's hypothetical Übermensch.[37] [Finn] affirms life as it happens (both the good and the bad), constantly creates a value system and exists completely unfettered by society or the past. [...] He's grown up without the weight of human history and custom, has guided his own way through a flood of adolescent emotions and has become a hero in a dangerous land of his own free will. His moral code, once crafted in the image of his idol, Billy, is now of his own making.[37] The character also became extremely popular among Adventure Time's fanbase. In 2019, Rich Goldstein of The Daily Beast commented on Finn's popularity among cosplayers, saying \"Halloween nights and comic conventions of the last few years have seen an increase in the number of children (and adults) all over the U.S. who wore Finn and Jake costumes.\"[89] John DiMaggio recalled \"walking around at conventions and seeing everybody wearing their Finn costumes and their Jake costumes and how the characters endeared themselves to people\".[8] A float in Finn's likeness was included in the 2013 Macy's Thanksgiving Day Parade.[89] Finn's narrative and impact on younger audiences has been compared to that of Harry Potter, the titular character in J. K. Rowling's book series of the same name.[19] In particular, both characters were aged up as the series progressed,[90] with Darren Franich of Entertainment Weekly saying that Finn \"[aged] with his audience like last decade's Harry Potter kids.\"[39] References [edit]- ^ Orange, B. Alan. \"SDCC 2011 Exclusive: Adventure Time Cast Interviews\". Movie Web. Archived from the original on October 14, 2013. Retrieved August 20, 2011. - ^ Carroll, Bart (August 4, 2011). \"Pendleton Ward Interview\". Wizards of the Coast. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ a b Mumford, Gwilym (2012-09-07). \"Is Adventure Time the weirdest kids' TV show ever?\". the Guardian. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ a b Strauss, Neil (2014-10-02). \"'Adventure Time': The Trippiest Show on Television\". Rolling Stone. Archived from the original on 2021-08-02. Retrieved 2021-09-09. - ^ Leichliter, Larry, Hugo Morales, & Pendleton Ward (directors); Pendleton Ward (writer) (December 7, 2008). \"Adventure Time\". Random! Cartoons. Season 1. Episode 2b. Nicktoons. - ^ \"How 'Adventure Time: Distant Lands' Evolved The Show For The Better\". Collider. 2021-09-23. Retrieved 2022-02-14. - ^ a b c d Blumenfeld, Zach (2016-03-28). \"The Animated Adolescence Of Adventure Time's Jeremy Shada\". Paste Magazine. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ a b Lloyd, Robert (2018-08-23). \"As 'Adventure Time' wraps, a look back at how the series broke barriers and changed the genre\". Los Angeles Times. Archived from the original on 2021-09-07. Retrieved 2021-09-08. - ^ Little, Morgan (July 23, 2018). \"How it feels to see Adventure Time about to end at Comic-Con 2018\". CNET. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ a b Kohn, Eric (2017-02-24). \"'Adventure Time' Is Slowly Going Off the Air, And Everyone's Moving On\". IndieWire. Archived from the original on 2018-05-03. Retrieved 2021-09-08. - ^ Erao, Matthew (2017-05-04). \"15 Actors You Didn't Know Were On Adventure Time\". ScreenRant. Archived from the original on 2021-09-12. Retrieved 2021-09-12. - ^ a b \"Learn how to draw Adventure Time with creator Pendleton Ward's detailed, and occasionally bizarre, notes\". Acclaim Magazine. 2014-01-28. Retrieved 2022-02-02. - ^ a b Feeney, Nolan (2013-03-29). \"The Weird World of 'Adventure Time' Comes Full Circle\". Time. ISSN 0040-781X. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Bradley, Bill (2014-10-27). \"8 Facts You Didn't Know About 'Adventure Time'\". HuffPost. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ a b Sedghi, Sarra (2018-08-30). \"Adam Muto on Why an 'Adventure Time' Reboot Is Inevitable\". The Dot and Line. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Adams, Gregory (2015-04-01). \"Adventure Time's Jeremy Shada grows up\". The Georgia Straight. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Garland, Emma (May 5, 2015). \"Talking to the Musical Masterminds Behind 'Adventure Time'\". Vice.com. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ Kohn, Eric (2013-10-17). \"Does the Obsessive 'Adventure Time' Fandom Overlook the Depths of Pendleton Ward's Cartoon Network Hit?\". IndieWire. Retrieved 2022-01-30. - ^ a b c d Poniewozik, James (2018-09-02). \"'Adventure Time,' TV's Surreal Masterpiece, Comes to an End\". The New York Times. ISSN 0362-4331. Archived from the original on 2021-07-02. Retrieved 2021-09-09. - ^ Frank, Allegra (2018-09-03). \"Adventure Time showrunner doesn't see the finale as a happy ending\". Polygon. Archived from the original on 2019-12-05. Retrieved 2021-09-09. - ^ Nussbaum, Emily (2014-04-14). \"Castles in the Air\". The New Yorker. Archived from the original on 2015-07-08. Retrieved 2021-09-09. - ^ a b Brown, Tracy (2018-08-23). \"Who's who in the Land of Ooo on 'Adventure Time'\". Los Angeles Times. Archived from the original on 2021-09-11. Retrieved 2021-09-10. - ^ Leichliter, Larry (director); Patrick McHale (creative director); Nick Jennings (art director); Bert Youn & Sean Jimenez (storyboard artists) (May 3, 2010). \"Memories of Boom Boom Mountain\". Adventure Time. Season 1. Episode 10. Cartoon Network. - ^ Grebey, James (February 2, 2017). \"Here's What Happened to All the Humans on 'Adventure Time'\". Inverse. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ a b c d Grebey, James (February 2, 2017). \"Finn Finally Meets His Mom, Minerva, on 'Adventure Time: Islands'\". Inverse. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Larry Leichliter, Patrick McHale and Nick Jennings (director); Patrick McHale, Adam Muto & Pendleton Ward(storyboard artists) (April 19, 2010). \"Enchiridion!\". Adventure Time. Season 1. Episode 5. Cartoon Network. - ^ Sargent, Ryan (2021-02-17). \"His Hero: My Adventure with Adventure Time Season 1, Episode 25\". Geek Stew. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ a b Pandell, Lexi (August 4, 2015). \"WIRED Binge-Watching Guide: Adventure Time\". Wired. ISSN 1059-1028. Archived from the original on 2015-04-11. Retrieved 2021-09-09. - ^ a b Sava, Oliver (March 17, 2014). \"Adventure Time: \"Billy's Bucket List\"\". The A.V. Club. Archived from the original on 2021-09-10. Retrieved 2021-09-10. - ^ Miller, Liam (2015). \"The Owl and the One-Armed Boy\". In Michaud, Nicolas (ed.). Adventure time and philosophy: the handbook for heroes. Open Court Publishing Company. pp. 89–100. ISBN 978-0-8126-9858-9. OCLC 953849201. - ^ Neal Gray, Julie (2020-05-15). \"Adventure Time: 10 Best Episodes Of The Series, Ranked According To IMDb\". ScreenRant. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ Sava, Oliver (April 21, 2014). \"Adventure Time: \"Wake Up\"/\"Escape From The Citadel\"\". The A.V. Club. Archived from the original on 2021-08-09. Retrieved 2021-09-08. - ^ a b c Sava, Oliver (June 5, 2014). \"Adventure Time: \"Breezy\"\". The A.V. Club. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Swift, Andy (2018-09-03). \"Adventure Time Finale: EP Breaks Down Multiple Endings, Talks Future of Ooo\". TVLine. Archived from the original on 2021-05-03. Retrieved 2021-09-11. - ^ Sava, Oliver (January 23, 2017). \"Finn meets his new plant doppelganger in Adventure Time's season 8 premiere\". The A.V. Club. Archived from the original on 2021-09-10. Retrieved 2021-09-10. - ^ a b c VanDerWerff, Emily (2017-02-05). \"Adventure Time's \"Islands\" miniseries tackles American self-absorption – but for kids!\". Vox. Archived from the original on 2021-09-09. Retrieved 2021-09-09. - ^ a b c d e Blumenfeld, Zach (2017-01-30). \"Adventure Time's Islands Miniseries Is a Dark Meditation on Technology and the Human Spirit\". Paste Magazine. Archived from the original on 2021-09-10. Retrieved 2021-09-10. - ^ Kohn, Eric (2018-08-27). \"'Adventure Time' Finale Review: Cartoon Network's Cultural Phenomenon Ends On a Bittersweet Note That Feels Just Right\". IndieWire. Archived from the original on 2018-09-04. Retrieved 2021-09-08. - ^ a b Franich, Darren (September 4, 2018). \"'Adventure Time' finale review: One of the greatest TV shows ever had a soulful, mind-expanding conclusion\". EW.com. Archived from the original on 2021-05-21. Retrieved 2021-09-10. - ^ a b Kulzick, Kate (August 30, 2018). \"Adventure Time Series Finale: Adam Muto Breaks Down the Show's Epic Ending\". TVGuide.com. Archived from the original on 2018-09-04. Retrieved 2021-09-11. - ^ Motes, Jax (2018-09-06). \"EP Adam Muto Reveals The Behind-The-Scenes Of The 'Adventure Time' Series Finale\". ScienceFiction.com. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Gatollari, Mustafi (November 19, 2020). \"The OG Ending of 'Adventure Time' Has a Pretty Epic Ending for Jake's Character\". Distractify. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Kohn, Eric (2021-05-20). \"'Adventure Time: Distant Lands – Together Again' Review: Finn and Jake as You've Never Seen Them Before\". IndieWire. Archived from the original on 2021-05-22. Retrieved 2021-09-08. - ^ Alejandra Bodden (2021-05-22). \"Adventure Time: DL Together Again Review: Jake & Finn Welcome Return\". Bleeding Cool News And Rumors. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Cao, Caroline (2021-05-20). \"Adventure Time: Distant Lands - Together Again Review\". Den of Geek. Archived from the original on 2021-05-20. Retrieved 2021-09-09. - ^ Cotter, Padraig (2019-04-27). \"Why The Adventure Time Season 11 Comic Series Isn't Canon\". ScreenRant. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Thomas, Lucas M. (2012-11-22). \"Adventure Time: Hey Ice King! Why'd You Steal Our Garbage? Review\". IGN. Retrieved 2022-02-04. - ^ \"Review: Adventure Time: Explore the Dungeon (3DS)\". Destructoid. Retrieved 2022-02-07. - ^ \"Review: Adventure Time: The Secret of the Nameless Kingdom (3DS)\". Nintendo Life. 2014-12-15. Retrieved 2022-02-07. - ^ Corrigan, Hope (2018-07-18). \"Adventure Time: Pirates of the Enchiridion Review\". IGN. Retrieved 2022-02-07. - ^ \"Futurama: How The Planet Express Crew Ran Into Two Key Adventure Time Characters\". CBR. 2021-05-08. Retrieved 2022-02-04. - ^ McFarland, Kevin. \"Watch the Adventure Time Couch Gag for The Simpsons\". Wired. ISSN 1059-1028. Retrieved 2022-02-04. - ^ \"\"OK K.O.!\" reunites cartoons past and present\". The Hofstra Chronicle. 22 October 2018. Archived from the original on 2022-02-14. Retrieved 2022-02-14. - ^ Carter, Chris (2016-10-04). \"LEGO Dimension's Adventure Time pack is great, other than the splitting up of Finn and Jake\". Destructoid. Retrieved 2022-02-10. - ^ Jed Whitetaker (November 13, 2016). \"Review: Cartoon Network: Battle Crashers\". Destructoid. - ^ \"'Adventure Time' Is Getting a 'Bloons Tower Defense' Game This Month\". GAMING. Retrieved 2022-02-08. - ^ Kane, Alex (2019-06-10). \"'Brawlhalla' Is Getting an 'Adventure Time' Crossover\". Variety. Retrieved 2022-02-04. - ^ Lada, Jenni (2020-12-17). \"Immortals Fenyx Rising Adventure Time Pack Brings in Finn, Jake, and Lady Rainicorn\". Siliconera. Retrieved 2022-02-04. - ^ \"Every Confirmed Character in Warner Bros. Multiversus (and Where They're From)\". CBR. 2021-11-21. Retrieved 2022-02-07. - ^ Coggan, Devan; Franich, Darren; Holub, Christian (September 3, 2018). \"The 30 best episodes of 'Adventure Time'\". EW.com. Archived from the original on 2021-01-29. Retrieved 2021-09-09. - ^ \"Allegri Gender Swaps \"Adventure Time with Fionna & Cake\"\". CBR. 2012-12-05. Retrieved 2022-02-13. - ^ Whittaker, Richard (February 23, 2013). \"DVD Watch: 'Adventure Time: Fionna and Cake'\". Austin Chronicle. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Guzman, René A. (2013-02-14). \"Another serving of Fionna and Cake\". mySA. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Hibberd, James (2021-08-17). \"'Adventure Time' Spinoff Series 'Fionna and Cake' Ordered by HBO Max\". The Hollywood Reporter. Archived from the original on 2021-08-17. Retrieved 2021-09-11. - ^ Cubillas, Sean (2019-10-03). \"10 Best Episodes Of Adventure Time (According To IMDb)\". CBR. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Sava, Oliver (October 14, 2013). \"Adventure Time: \"Red Starved\"\". The A.V. Club. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Karavintis, John V. (2015). \"The Finn-losophy of Adventure Time\". In Michaud, Nicolas (ed.). Adventure time and philosophy: the handbook for heroes. Open Court Publishing Company. pp. 9–10. ISBN 978-0-8126-9858-9. OCLC 953849201. - ^ a b Fleenor, S. E. (2019-06-17). \"The awesome (and unexpected) queering of Adventure Time\". SYFY WIRE. Archived from the original on 2020-04-29. Retrieved 2021-09-11. - ^ Goodwillie, Ian (2021-01-01). \"Adventure Time: 5 Reasons Why Finn & Jake Are Best Friends (& 5 Why They're Not)\". ScreenRant. Archived from the original on 2021-09-13. Retrieved 2021-09-13. - ^ \"Adventure Time: Distant Lands - Together Again Review: With Finn & Jake\". TV Shows. Archived from the original on 2021-05-19. Retrieved 2021-09-13. - ^ Degginger, David (2015). \"When My Gameboy Became Self-Aware\". In Michaud, Nicolas (ed.). Adventure time and philosophy: the handbook for heroes. Open Court Publishing Company. pp. 197–208. ISBN 978-0-8126-9858-9. OCLC 953849201. - ^ Fleenor, S. E. (2020-04-21). \"An Adventure Time binge guide for Marceline the Vampire Queen\". SYFY WIRE. Archived from the original on 2020-04-22. Retrieved 2021-09-11. - ^ Harper, Stephanie (2020-10-08). \"Adventure Time: Everything You Didn't Know About Princess Bubblegum\". CBR. Archived from the original on 2020-11-14. Retrieved 2021-09-11. - ^ Sava, Oliver (September 16, 2013). \"Adventure Time: \"The Vault\"\". The A.V. Club. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Henley, Kenyetta (2020-07-12). \"Adventure Time: 5 Reasons Why Princess Bubblegum & Marceline Are Perfect Together (& 5 Why They're Not)\". ScreenRant. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ LeChevallier, Mike (May 13, 2012). \"Review: Adventure Time: Season Four\". Slant Magazine. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ Leichliter, Larry (director); Adam Muto (creative director); Nick Jennings (art director); Cole Sanchez & Rebecca Sugar (storyboard artists) (July 30, 2012). \"Burning Low\". Adventure Time. Season 4. Episode 16. Cartoon Network. - ^ \"The Annotated Adventure Time - True Chaotic Neutrality in \"On the Lam\"\". Overmental. 2015-06-05. Archived from the original on 2020-08-08. Retrieved 2021-09-11. - ^ Bradley, Bill (2016-10-12). \"5 Things About 'Adventure Time' That'll Make You Say 'Ooo'\". HuffPost. Archived from the original on 2021-09-11. Retrieved 2021-09-11. - ^ \"The Annotated Adventure Time: Illusory Love Healing in \"Breezy\"\". Overmental. 2014-06-06. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ Coggan, Devan; Franich, Darren; Holub, Christian (September 3, 2018). \"The 30 best episodes of 'Adventure Time'\". EW.com. Retrieved 2022-02-08. - ^ Thurm, Eric (2018-08-31). \"'Adventure Time': Here Are the 10 Best Episodes\". The New York Times. ISSN 0362-4331. Retrieved 2022-02-08. - ^ \"Adventure Time: Islands is a poignant, topical game-changer for the series\". The A.V. Club. 30 January 2017. Retrieved 2022-02-08. - ^ Kleber, Juliet (2017-01-30). \"The Progressive, Grown-Up Appeal of Adventure Time\". The New Republic. ISSN 0028-6583. Archived from the original on 2017-01-30. Retrieved 2021-09-08. - ^ Zachary, Brandon (2019-04-17). \"Finn the Human: The Strange Life of Adventure Time's Hero, Explained\". CBR. Archived from the original on 2021-09-08. Retrieved 2021-09-08. - ^ VanDerWerff, Emily (2015-11-22). \"Adventure Time has become this era's finest coming-of-age story\". Vox. Archived from the original on 2015-11-22. Retrieved 2021-09-09. - ^ \"Adventure Time: Here's What Happened To All The Humans\". Comicbook.com. Retrieved 2022-02-01. - ^ \"Adventure Time: 10 Ways Finn Grew Up By The End Of The Series\". CBR. 2021-04-28. Retrieved 2022-02-01. - ^ a b Goldstein, Rich (2013-12-19). \"This Is How an Episode of Cartoon Network's 'Adventure Time' Is Made\". The Daily Beast. Archived from the original on 2017-05-19. Retrieved 2021-09-09. - ^ \"'Adventure Time' is One of the Best Animated Shows of the 2010s. Here's Why. - Hollywood Insider\". 2020-12-06. Retrieved 2022-02-01. Bibliography [edit]- Michaud, Nicholas, ed. (2015). Adventure Time and Philosophy: The handbook for heroes. Open Court Publishing. ISBN 978-0-8126-9858-9. Further reading [edit]- McDonnell, Chris (2014). Adventure Time: The Art of Ooo. Harry N. Abrams. ISBN 978-1-4197-0450-5. - Olson, Martin (2013). The Adventure Time Encyclopaedia (Encyclopedia): Inhabitants, Lore, Spells, and Ancient Crypt Warnings of the Land of Ooo Circa 19.56 B.G.E. - 501 A.G.E. Harry N. Abrams. ISBN 978-0-8126-9858-9. - Adventure Time characters - Animated characters introduced in 2007 - Child characters in television - Fantasy (genre) adventurers - Fictional amputees - Fictional cyborgs - Fictional heroes - Fictional hostages and kidnapped people - Fictional kings - Fictional characters with post-traumatic stress disorder - Fictional swordfighters in television - Male characters in animated television series - Adoptee characters in television - Teenage characters in television - Television characters introduced in 2007 - Fictional wrongfully convicted and accused people"
}