{
  "url": "https://www.thesprucecrafts.com/stitches-every-embroiderer-should-know-4122123",
  "title": "15 Stitches Every Embroiderer Should Know",
  "text": "15 Stitches Every Embroiderer Should Know By Mollie Johanson Mollie Johanson Mollie Johanson is a professional needlecrafter with over 10 years of hands-on embroidery, sewing, and knitting experience. She is the author of “Stitch Love: Sweet Creatures Big & Small.\" Mollie also designs and sells stitching projects, co-hosts a crafting podcast, and has taught online embroidery courses. Learn more about The Spruce Crafts' Editorial Process Updated on 07/17/24 15 Hand Embroidery Stitches. Credit: Mollie Johanson Learning hand embroidery is an easy way to create beautiful art with fabric and thread. Most embroidery patterns only require a few basic stitches, and mastering these can make it simple and fun to take on any project. These are the 15 basic embroidery stitches beginners should learn. 01 of 15 Backstitch Back Stitch Example. Credit: The Spruce / Mollie Johanson Backstitch is so easy to learn that you'll have it down within the first few stitches. This basic stitch will likely be the one you'll use the most. Backstitch is useful for any outline and it pairs well with other stitches, making it a key stitch to learn. It's also easy to embellish with weaving or wrapping and quickly transforms into the more decorative Pekinese stitch. 02 of 15 Running Stitch Running Stitch Examples. Credit: The Spruce / Mollie Johanson Running stitch is a simple embroidery stitch that's good for making dashed outlines and adding details to embroidery. It's also the basis for Japanese sashiko embroidery. Although basic, it's adaptable and can become complex for more detailed projects. For example, you can change the look by adjusting the length and spacing or adding a second row of stitches between the first. It's also another stitch that works well with weaving and wrapping. 03 of 15 Straight Stitch Straight Stitch Examples. Credit: The Spruce / Mollie Johanson The straight stitch hardly requires an explanation because its as simple as bringing the needle up through the fabric and back down. But it's worth exploring the many uses for this building block embroidery stitch. Use the straight stitch to form stars, scattered fills, textures, and more. Practice length and placement to work this versatile stitch into your projects. 04 of 15 French Knot French Knot Example. Credit: The Spruce / Mollie Johanson For many stitchers, making French knots remains a challenge. While it may take time to learn, it's worth the effort. Not only is this a common stitch to find in embroidery patterns, but it's also a good stitch to use when making a textured fill or other design elements. This stitch involves wrapping the needle to form a knot on the fabric's surface. The trick to making French knots is to hold the working thread taut but not too tight. Give it some practice. Continue to 5 of 15 below 05 of 15 Stem Stitch Stem Stitch Example. Credit: The Spruce / Mollie Johanson Stem stitch is another basic stitch that's perfect for creating smooth outlines. It works well for straight lines and curves, and despite its name, it isn't only for embroidering stems. Use a stem stitch on just about any line in your stitching. Like so many stitches, you can adjust the width of stem stitching or use it for fill stitching. Just try to keep your stitch length consistent to create a beautiful result. 06 of 15 Chain Stitch Chain Stitch Example. Credit: The Spruce / Mollie Johanson If you want a bolder line of embroidery, then chain stitch is the stitch for you. Chain stitch forms a row of linked stitches that stands out. There are several ways to work the chain stitch, and it's a good idea to at least learn how to work it forward and in reverse. Once you've mastered those, try some of the other variations. 07 of 15 Satin Stitch Satin Stitch Example. Credit: The Spruce / Mollie Johanson The basic satin stitch is one of the most classic embroidery stitches for filling an area. There are a few variations, but at its essence, satin stitch is a series of straight stitches worked next to each other. What could be simpler? The secret to making those straight stitches turn into something special is practicing the length and proximity of the stitches. The result is a filled shape that is simply stunning. 08 of 15 Feather Stitch Feather Stitch Example. Credit: The Spruce / Mollie Johanson Feather stitch is a linked stitch that creates open lines that almost look like they're moving. It's perfect for making frames and borders and works well layered or embellished with other stitches. The look of feather stitch makes it good for stitching seaweed, foliage, feathers, or scales, and the variations make it possible to embroider many natural designs. Continue to 9 of 15 below 09 of 15 Split Stitch Credit: The Spruce / Mollie Johanson Try split stitch as another option for making outlines. The process for working split stitch is similar to working backstitch but upside down. The back of your work will end up looking like the front of the backstitch. Use this stitch, made by piercing or splitting the previous stitch, to work strong and slightly textured lines of embroidery. 10 of 15 Detached Chain Stitch Single Chain Stitch Sample. Credit: The Spruce / Mollie Johanson A detached chain stitch, sometimes called a single chain, is a common stitch for making flowers, leaves, and more. You'll work this stitch as a standard chain stitch but with just one \"link.\" Lazy daisy flowers typically have five or six detached chain stitches. 11 of 15 Fly Stitch Fly Stitch Examples. Credit: The Spruce / Mollie Johanson You work a fly stitch similar to a detached chain stitch, but rather than making a petal or teardrop shape, fly stitch forms a V shape or sometimes a soft curve. Try fly stitches in a row, scattered as fill, stitched in a radius, or in plenty of other variations. 12 of 15 Woven Wheel Stitch Woven Wheel Stitch Examples. Credit: The Spruce / Mollie Johanson Woven wheel stitch looks like a more advanced embroidery stitch, but it's actually quite simple. Start with a star of straight stitches, then weave the working thread to form a flower. Soon, you have a stitch that'll fill your hoop with amazing florals. Continue to 13 of 15 below 13 of 15 Couching Stitch Couching Examples. Credit: The Spruce / Mollie Johanson Although not always included in lists of stitches for beginners, the couching stitch is an embroidery stitch that everyone should know. It uses two lengths of thread simultaneously; one remains on the fabric's surface, while the other holds it in place with tacking stitches. Use this stitch for making outlines, creating texture, or filling an area. It even works with ribbon, yarn, and other materials. 14 of 15 Blanket Stitch Blanket Stitch Example. Credit: The Spruce / Mollie Johanson Starting the blanket stitch is usually the trickiest part, but working this stitch is easy once you start. Use this stitch to make borders and decorative lines or as an edge for applique. You can also use it on surface embroidery. Add variation to blanket stitch by adjusting the spacing and height of the stitches. 15 of 15 Bullion Knot Finished Bullion Rose. Credit: The Spruce / Mollie Johanson Definitely the most advanced stitch on this list, a bullion knot is not for the faint of heart. But you should learn it. Think of a bullion knot as a really long French knot that can make gorgeous roses. Practice making small bullion knots and then start making them bigger. You'll be glad to know this beautiful stitch. Explore more: Needlecrafts Embroidery"
}