{
  "url": "https://www.aamft.org/AAMFT/Advocacy/State_Resources/New+Jersey.aspx",
  "title": "New Jersey State Resources",
  "text": "Licensure The information below is collected from state licensure boards or regulatory agencies responsible for regulating the professions of marriage and family therapy. The information is reviewed on an annual basis. Please be advised that laws, regulations, and policies may change at any time, so always check with your state for the most up-to-date information. New Jersey has two MFT licenses, Licensed Associate Marriage and Family Therapist (LAMFT), Licensed Marriage and Family Therapist (LMFT). Associate License Requirements - A minimum of a master's degree in marriage and family therapy, or a related topic with equivalent coursework, from a regionally accredited program. - Completion of an internship (12-month minimum) during the program, or as a post-degree experience. - A plan established to complete hours of work experience and supervision, with an identified Board-approved supervisor. Marriage and Family Therapist License Requirements - Completion of the requirements for associate licensure. - Passed the exam approved by the board. - Completion of two years of supervised marriage and family therapy experience. - One calendar year (1,500 hours over a 50-week period, full-time, or the part-time equivalent) of counseling experience. - Maximum of 1,150 hours of direct client contact. - 50 hours of direct supervision, at the rate of one hour per week. - A maximum of 300 hours of other work-related activities. - Must be supervised under a board-approved supervisor. - No more than 30 hours of experience shall be earned in any one week, and no more than 125 hours shall be earned in any one month. - More details on supervision requirements in the Regulations. Licensure by Endorsement (Portability) - Must provide verification of licenses held in other jurisdictions, with evidence of no disciplinary action. - The requirements of licensure in the previous state must be substantially equivalent to the requirements for New Jersey licensure, as determined by the Board. Read more details on New Jersey MFT licensure in the Statutes and Regulations New Jersey State Board of Marriage and Family Therapy Examiners Continuing Education In order to renew a license, a licensee must complete continuing education every two years. Required hours Additional Resources State Officials & Legislative Information AAMFT Resources Contact Information"
}