{
  "url": "https://en.wikipedia.org/wiki/Jermuk",
  "title": "Jermuk - Wikipedia",
  "text": "Jermuk Jermuk (Armenian: Ջերմուկ) is a mountain spa town and the centre of the Jermuk Municipality of the Vayots Dzor Province in southern Armenia, at a road distance of 53 km (33 mi) east of the provincial capital Yeghegnadzor. It was considered one of the popular destinations for medical tourism in the Soviet Union.[2] Jermuk is known for its hot springs and mineral water brands bottled in the town. It is attractive for its fresh air, waterfall, artificial lakes, walking trails, the surrounding forests and mineral water pools. The town is being redeveloped to become a modern center of tourism and health services. It is also being set up to become a major chess centre, with numerous chess international tournaments scheduled in the town.[3] As of the 2022 census, Jermuk had a population of 3,936, down from the 4,628 reported in the 2011 census.[1] Etymology [edit]The name of the town is derived from the Armenian word jermuk (ջերմուկ), meaning 'warm mineral spring', first mentioned in the 13th century by historian Stepanos Orbelian in his work History of the Sisakan Province. In later centuries, the settlement was also known as Istisu, which means 'hot water' in Azerbaijani; it was renamed back to Jermuk in 1924.[4] History [edit]Jermuk occupies an area which was historically part of the Vayots Dzor canton of the Syunik province of Greater Armenia. It was first mentioned during the 13th century by historian Stepanos Orbelian in his work History of the Province of Sisakan. The remains of an ancient cyclopean fortress and the ruins of an 8th-century basilica testify that the region around the fountains of Jermuk had been settled long before the 13th century.[5] The area of Jermuk was ruled by the Siunia dynasty between the 10th and 13th centuries, when Vayots Dzor was part of the Kingdom of Syunik. The princes of Syunik regarded the mineral springs of Jermuk as healing and built several pools filled with it, thereby making the little town their holiday destination. During the Middle Ages, the Silk Road passed through Vayots Dzor, particularly the road that currently links the town of Martuni with Yeghegnadzor to the northwest of Jermuk. At the beginning of the 16th century, Eastern Armenia fell under the Safavid Persian rule. The territory of Jermuk became part of the Erivan Province and later the Erivan Khanate. The period between the 16th and 17th centuries is considered to be the darkest period in the history of Vayots Dzor. The region was turned into a frequent battlefield between the invading troops of the Turkic and Iranian tribes. As a result, many significant monuments and prosperous villages were destroyed, and the population was displaced. As a result of the Treaty of Turkmenchay signed between the Russian Empire and Persia in 1828 following the Russo-Persian War of 1826–28, many territories of Eastern Armenia—including Vayots Dzor—became part of the Russian Empire. Under the Russian rule, Jermuk experienced significant growth and development. During the 1830s, the Russian geologist G. Voskoboynikov arrived in Armenia and began explorations on Jermuk's geographical depth as well as the contents and characteristics of Jermuk waters. His observations on Jermuk were published in the journal Gorny zhurnal in 1831, and later in 1855, in the almanac Kavkazskiy kalendar. Voskoboynikov's works were the first scientific studies on Jermuk. In the 1860s, a pool in Jermuk built by the Orbelian princes of Syunik was renovated by pristav (police chief) Gevorg Khanagyan, following a resolution by the Russian government. Today this pool is known as Pristavi gyol ('Pristav's lake') and is preserved as a historical monument. In 1870, Jermuk became part of the newly formed Sharur-Daralayaz uyezd within the Erivan Governorate. According to a Russian estimate from 1880, which produced statistics of 1873, Isti-su (i.e., Jermuk) had 114 Tatar (later known as Azerbaijanis) inhabitants.[6] Between 1918 and 1920 Jermuk was included within the short-lived Republic of Armenia. After the Sovietization of Armenia, Jermuk and the surrounding territories became one of the regions that resisted Soviet rule and formed the unrecognized Republic of Mountainous Armenia under the leadership of Garegin Nzhdeh. However, after falling to the Bolsheviks in July 1921, Jermuk became part of the Armenian Soviet Socialist Republic. The first urban development plan of Jermuk was introduced by architect P. Msryan in 1945. The second plan was composed in 1952 by architect P. Manukyan. The plan was later modified at the beginning of the 1960s. The first sanatorium was opened in 1962, followed by the 2nd one in 1963 and the mineral water spa centre in 1966, thus setting for the fertile activity of the Jermuk health resort centre, in order to turn Jermuk into a modern resort for all Soviet nationals. In 1967, Jermuk was granted the status of a town of republican subordination. With the gradual development of services, the population of Jermuk reached up to 9,000 during the 1980s. After the dissolution of the Soviet Union in 1991, and as a result of the post-independence economic crisis of Armenia, the population has drastically declined to less than 5,000 during the first decade of the 21st century. In 1995, Jermuk became part of the newly formed Vayots Dzor Province as per the 1995 administrative reforms. However, many development plans have been implemented in Jermuk in recent years, in order to further develop the town as a summer resort and a winter tourism destination, including the nearby village of Kechut and the defunct airfield of Jermuk. Many new hotels and health centers were opened, many sanatoriums were rehabilitated, and the first phase of the cableway of the ski resort was entirely renovated. In September 2022, Jermuk as well as several other Armenian towns, including Vardenis (Gegharkunik Province), Goris (Syunik Province) and Sotk (Gegharkunik), came under attack by the Azerbaijani Armed Forces. Many residential houses were damaged as a result of the shelling; people were displaced from their homes.[7][8] A fire broke out in the forests of Jermuk as a result of the shots fired by Azerbaijan.[9] At a UN Security Council meeting, Armenia's permanent representative Mher Margaryan condemned Azerbaijan's attack on Jermuk saying: \"The shelling of the resort town of Jermuk, which has absolutely no military targets is nothing short of war crime, and so are the strikes against the Kechut water reservoir, with potentially catastrophic human toll and environmental impact\".[10] Following the ceasefire, the heads of diplomatic missions and international organizations accredited in Armenia arrived in Jermuk to get acquainted with the consequences of the shelling.[11] Geography and climate [edit]The town is located at a height of 2,080 meters above sea level, within the mountains of Vayots Dzor, among thick forests, on a plateau divided into two parts by the gorge of Arpa River, 170 km (110 mi) south-east of Yerevan. The town is dominated by the Vardenis mountain range from the north and the Vayk range from the south. The height of the surrounding mountains ranges between 2500 and 3500 meters, all covered with forests and alpine meadows. The forests of Jermuk are rich with oak and hornbeam trees, as well as with dog rose, wild pear, plum and juniper plants. Animals like foxes, rabbits, badgers and bears could be found there. However, the town is mainly famous for its hot springs (geysers). The waterfall of Jermuk on Arpa River has a height of 70 meters. The town is characterized with humid continental climate (Köppen: Dsb) providing mild weather during the summers with cold and snowy climate during the long-lasting winters. The annual precipitation level is 800 mm (31.50 in). Demographics [edit]Currently, the town is almost entirely populated by ethnic Armenians who belong to the Armenian Apostolic Church. The regulating body of the church is the Diocese of Vayots Dzor, seated in Yeghegnadzor. The town's church of Surp Gayane was consecrated on November 17, 2007. It was built through the donations of businessman Ashot Arsenyan. The architect of the church is Samvel Aghajanyan. Culture [edit]Old caves dating to the Bronze Age exist in the Arpa River gorge at the north of Jermuk, along with a group of small chapels dating back to the Middle Ages. The Jermuk branch of the National Gallery of Armenia was opened in 1972. It is home to many paintings and sculptures, mainly composed by several Soviet Armenian artists such as Haroutiun Galentz, Martiros Saryan and others.[16] The town is also home to a public library. By the efforts of sculptor Hovhannes Muradyan, a group of sculptures known as the \"Alley of fedayis\" was opened in Jermuk between 1988 and 1992, depicting many famous Armenian fedayis who fought against the Ottoman Empire. In 2004, a statue of the 17th-century Armenian activist Israel Ori by sculptor Gagik Stepanyan was erected in the centre of Jermuk. Jermuk is home to the Snowman Festival regularly organized in February on a yearly basis.[17] Transportation [edit]Jermuk is connected with the M-2 Motorway through the regional H-42 Road. The town is connected with Yerevan and the nearby cities through buses and minibuses. The town has a small airstrip at its southern edge, near the Kechut Reservoir. Economy [edit]Industry [edit]The natural water bottling industry has deep roots in the town of Jermuk. The first factory known as Jermuk Main Factory (Jermuk mayr gortsaran) was founded in 1951. Nowadays, Jermuk is home to many large water bottling factories, with the largest one being the Jermuk Group operating since 1999. In 2015–16, Jermuk Main Factory was acquired by the Jermuk Group, where a new production line was launched in order to increase the capacity of the factory and boost exports.[18] The bottled mineral water branded as Jermuk is exported to several markets around the world. Tourism [edit]Another key sector in the economy of Jermuk is tourism. The town is home to several health resorts and spas and is one of the main tourist destinations in Armenia. Visitors come for the natural environment of Jermuk and the mountains of Vayots Dzor (3000 meters), the waterfalls, the curing water pools, hotels and health spas, sanatoriums, the cableway and alpine sports facilities.[citation needed] It is considered the centre of medical tourism in Armenia.[citation needed] Gndevank Monastery, dating back to the 10th century, is one of the most popular nearby destinations. It is located just 10 km (6.2 mi) west of Jermuk. Jermuk is one of the three towns of Armenia that are allowed to accommodate gambling houses and activities (along with Tsaghkadzor and Sevan).[19] Sport [edit]Jermuk is one of the major centres for winter sports in Armenia. A 900-meters long cableway serves the ski area located at the southeast of the town. The works for the second phase of the ski lift are ongoing in order to boost the winter tourism in the region.[20] Jermuk is a regular venue for international chess tournaments. Each year during the summer, the town hosts the FIDE Grand Prix Jermuk chess tournament. The town has a large—though derelict—indoor sports palace dating back to the Soviet days. Twin towns – sister cities [edit]Jermuk is twinned with: - Arkhangelsk, Russia (2018)[21] - Saint-Raphaël, France (1997)[22] Notable people [edit]- Narek Sargsyan, Armenian architect and politician[citation needed] References [edit]- ^ a b c \"The Main Results of RA Census 2022, trilingual / Armenian Statistical Service of Republic of Armenia\". www.armstat.am. Retrieved 3 March 2025. - ^ Snow art fest is one more reason to pack your bag for Armenia - ^ Jermuk economy - ^ Hakobian, T. Kh.; Melik-Bakhshian, St. T.; Barseghian, H. Kh. (1998). \"Jermuk\" Ջերմուկ. Hayastani ev harakitsʻ shrjanneri teghanunneri baṛaran Հայաստանի և հարակից շրջանների տեղանունների բառարան [Dictionary of Toponymy of Armenia and Adjacent Territories] (in Armenian). Vol. 4. Yerevan State University Publishing House. pp. 402-403. - ^ \"Jermuk Group: Jermuk city\". Archived from the original on 29 July 2013. Retrieved 7 June 2010. - ^ Сборник сведений о Кавказе (in Russian). p. 58. - ^ \"PanARMENIAN.Net - Mobile\". panarmenian.net. - ^ \"Ադրբեջանական հարձակման հետևանքով առնվազն 2570 անձ տեղահանվել է. ՄԻՊ\". www.1lurer.am. 14 September 2022. - ^ \"Fire breaks out in forests of Armenia's Jermuk as a result of Azerbaijani shooting\". - ^ At least 7 identified PoWs captured by Azerbaijan in flagrant violation of Geneva Conventions - ^ On September 16, the heads of diplomatic missions and international organizations accredited in Armenia arrived in Jermuk to get acquainted with the consequences of the Azerbaijani attacks. - ^ \"World Meteorological Organization Climate Normals for 1991-2020 – Jermuk\" (CSV). NCEI. Retrieved 6 March 2024. - ^ \"World Meteorological Organization Climate Normals for 1981-2010:Jermuk-37883\" (XLSX). NCEI. Retrieved 6 March 2024. - ^ \"World Weather Information Service – Jermuk\". World Meteorological Organization. Retrieved 24 September 2016. - ^ Հայաստանի Հանրապետության բնակավայրերի բառարան [Republic of Armenia settlements dictionary] (PDF) (in Armenian). Yerevan: Cadastre Committee of the Republic of Armenia. 2008. Archived from the original (PDF) on 11 March 2018. - ^ \"Jermuk branch of the National Gallery of Armenia\". Archived from the original on 29 March 2025. Retrieved 14 March 2017. - ^ Snowman Festival in Jermuk - ^ Jermuk Group to boost exports - ^ Սեւանի քարտեզը փոխել են, որ Ալրաղացի Լյովի խաղատունը էժանո՞վ հարկվի [Was the map of Sevan changed so that 'Gristmill' Lyova's casino would be taxed less?]. Haykakan Zhamanak (in Armenian). Archived from the original on 19 November 2022. Retrieved 5 March 2024. - ^ Նախագահ Սերժ Սարգսյանի աշխատանքային այցը Ջերմուկ - ^ \"Города-побратимы Архангельска\". m.arhcity.ru (in Russian). Arkhangelsk. Retrieved 2 July 2020. - ^ \"Saint-Raphaël, territoire de jumelages\". ville-saintraphael.fr (in French). Saint-Raphaël. Archived from the original on 1 August 2019. Retrieved 2 July 2020. External links [edit]- Destination: Jermuk Archived 2022-02-22 at the Wayback Machine - Jermuk tourist guide Archived 6 May 2017 at the Wayback Machine - Jermuk FIDE Grand Prix 2009 - Jermuk Armenia resort - Jermuk Moscow health resort"
}