{
  "url": "https://www.kikkoman.com/en/corporate/brand/brand.html",
  "title": "Corporate Brand English - Kikkoman Corporation",
  "text": "âBrandâ is an impression built up over time in the hearts of our customers, based on the way they feel during each interaction with the products and people of the Kikkoman Group. Recognizing that all of the activities we engage in daily will reach the customer in the end, we established Kikkomanâs Promise to clarify and share the ideals of the Kikkoman brand. Each of us is dedicated to giving shape to our promise. We perform our work with sincerity, care, and creativity, take on new challenges every day, and by doing so steadily enhance the quality of our products and services. The contents of Kikkomanâs Promise are encapsulated in our corporate slogan âseasoning your life.â Our hope is for this to be a message embraced by both our customers and everyone at the Kikkoman Group. - To provide high-quality products and services with integrity by continuously improving on our long tradition of techniques and know-how. - To propose a well-balanced and nutritious diet that brings out the flavor of ingredients and bring happiness to the world everyday by helping to support a healthy mind and body. - To create exciting new flavor experiences by fusing food cultures from around the world and to propose a rich and varied food-lifestyle that matches the times. In a time of constant change, some things remain the same. Tasty encounters and the enjoyment and fun that come from sitting down to a meal with family and friends all combine to create delicious memories. Our aim of filling the world with the joys of food so as to give people these delicious memories is encapsulated in our corporate slogan. The corporate slogan, âseasoning your life,â contains the core message that Kikkoman âhelps you savor the joys of life.â It suggests that, as Kikkoman seasons and enriches your food, it also brings fulfillment to life as a whole. The central concept for the corporate logo is \"heart to heart communication.\" The soft logotype expresses âthe joy of eatingâ and âappreciation for a healthy mind and body.â With the use of lowercase letters, the logo also conveys âkindness,â âwarmthâ and âapproachability.â The traditional hexagon at the top right of the logo represents Kikkoman's dedication to harnessing both âtraditionâ and âinnovation.â The corporate color, orange, represents âgood health,â âyouthfulnessâ and âvitality.â It evokes images of the sun, flames, earth and a good harvest, while at the same time providing a feeling of liberation and stimulating the appetite. Kikona is the Kikkoman mascot reminiscent of the tabletop dispenser. With the help of Kikona, we want to share our joy of food with our customers and have the next generation take interest in food and gain understanding of its importance. The logo represents the joy at a table where people talk and share delicious time together, the dot on the âiâ is Kikonaâs red hat from an overhead view. Every Kikkoman product, with its traditional hexagon logo, Delivers the following values to customers. The source of our value - Advanced fermentation technology based on centuries of tradition and expertise - Consistently high quality recognized the world over The joy of using our products - Products that bring out all the heart-warming flavors in food and provide a sense of joy and assurance in cooking - Products that are convenient and easy to use for all occasions - Products that have a consistent taste and can be used reliably in recipes What they bring to the family table - The joy of preparing a delicious meal - A room full of smiles for a delicious, home-cooked meal - The delight of a healthy meal that brings out the true flavor of seasonal ingredients."
}