{
  "url": "https://www.snackhistory.com/twix/",
  "title": "Twix (History, Marketing, Pictures & Commercials) - Snack History",
  "text": "Twix (History, Marketing, Pictures & Commercials) Twix is a cookie (or biscuit for some) that consists of a shortbread-like substance covered with ingredients like chocolate and caramel. Made using ingredients such as Enriched Wheat Flour, this candy bar is very chocolaty, crunchy, and just begs for a drink when eaten. Twix was first produced in the United Kingdom under the name Raider before its name was changed to Twix after its introduction to the United States. Twix comes in an aluminum-like wrapper and usually comes with 2 or 4 stick-like or cylindrical-shaped cookies (biscuits) per package. Please leave a review or any memories of this snack in the comments at the bottom of this page. Thank you! The classic Twix has a flat bottom and a ridged top-side, with chocolate coating the cookies and often caramel, peanut butter, and other confections inside that are surrounding the bread-like interior of the candy bar. It is not the most popular candy bar in the world but has fought hard with multiple new flavors and styles to become and remain a popular confection with many fans worldwide. History And General Information Twix is a butter cookie bar, covered with caramel and dairy milk chocolate, and was invented back in 1967 by Mars Limited. To be specific, it was first created in Mar’s Slough factory in the United Kingdom. After thriving for over a decade in the UK under Twix’s original name of ”Raider”, what would be called Twix saw the light of the American market in the year 1979. In the US, the chocolate bar used the slogan “Chocolate, Caramel, and a Surprising Cookie Crunch”. Back then, this 70s candy had a packaging of a gold wrapper with orange text. It ads always included the chocolate bar slit in two, showing the soft caramel and the chewiness of the bar. The now popular Twix bar was not always a favorite chocolate bar of customers during its history. In the 1980s, Mars noticed a stagnancy in the sales of the candy bar. Raider wasn’t fetching revenue for the company to a level that was expected. Therefore, the company started to look for alternatives or improvements in the existing product. It was not until 1983 that the company finally hit the bullseye with the peanut butter Twix. In this new Twix bar, the caramel layer over the butter cookie was replaced with a soft peanut butter blend. This change in the bar resulted in captivating the market which was earlier not as excited for the Twix bar. As the chocolate bar’s sales caught pace, the Mars Company renamed the bars from “Raider”, to “Twix” worldwide. The company released a slogan for it translating to “Raider is now Twix, nothing else changes”. This worldwide re-branding of an old bar of the company took place between the years 1991 and 2000, where it was not always welcomed with open arms. The public took it as the company’s attempt to get an old product, which had been losing sales, back into the market. This belief spread so much throughout countries like Germany that the name Twix had become synonymous with many as a cynical re-branding. The “meme” became to be used in politics and the corporate world to symbolize a mere new coat of paint to try to re-image something. After the re-branding of Raider, the market also saw launches of various varieties of the Twix chocolate bar in the 1990s. This was looked upon as the Mars Company trying to strengthen its brand image and product portfolio. The new varieties included cookie and cream, dark chocolate, white chocolate, fudge, coffee, mint slice, triple chocolate and orange flavor. Some recent launches of flavors of the Twix bar are Twix Cappuccino and Twix Java. The candy bar was also used to enter the markets that Mars Inc. traditionally did not target. Frozen Twix bars were distributed into supermarket chains and mall ice cream vendor iceboxes during the 1990s. This gave the company a way to enter the ice cream market and compete for sales. This was perhaps part of the company’s plan to stimulate its overall product development during the period. The frozen Twix Bars received a positive response from customers which resulted in rising sales for Mars, outside of their original markets. The Mars company has faced quite a lot of criticism for the ingredients used in its products as well. A recent controversy that Mars had to deal with regarding Twix was in 2007. The manufacturer started using animal rennet in place of the whey used in the candy bars which led to protests and negative publicity of the company. Mars did agree to halt the usage of animal rennet in the candy bars, starting from 2008, but it was found later that certain candy bars still had the ingredient in them. These candy bars include Twix. Besides that, the company publicly accepted that it did not plan to stop the usage of animal rennet in its products. This has also made certain products, including Twix bar, unsuitable for vegetarians. However, an executive of the company did say that some popular candy bars for the company would be made vegetarian in the “near future”. The company claims that there had not been any significant impact on the sales of its products since the issue was raised. Mars continues to release new flavors of the candy and some of the latest flavors launched by Mars for the brand include Twix Fino and Twix Coconut. Twix is one of the more popular candy bars in the United States. In 2012 it was reported that Twix had sold more than 161 million units and had nearly 194 million in dollars worth of sales. Twix was reported to be the sixth most popular candy in 2012. In the year 2015, it was reported that Twix had generated $169.9 million in revenue. In 2017 it was reported that Twix generated 63.1 million dollars in sales. Twix has been sold worldwide since 1999 and can be found in countries such as Austria, Belgium, Denmark, Finland, France, Germany, Greece, Israel, Italy, Luxembourg, the Netherlands, Norway, Poland, Portugal, Spain, Sweden, Switzerland, The United Kingdom, The United States, and Turkey. The Year Twix Was Invented Twix was invented in the year 1967 by Forrest Mars and the Mars Limited company. The candy bar was first sold in the United Kingdom and was later introduced into the United States in the year 1979. By 2019 Twix has been sold worldwide and can be found in many countries, such as Spain, Poland, Norway, Switzerland, Turkey, and Luxembourg. The Company That Owns Twix The company that owns Twix is Mars Incorporated. The company Mars Inc. is an American global manufacturer of confectionery, pet food, and various food products. Mars owns various famous candy products such as Starburst and Skittles. The Person Who Invented Twix Twix was invented by Forrest Mars Sr., son of the owner of the company Mars. Forrest Mars Sr began his company Mars Limited on May 17, 1932, in the United Kingdom, Slough. His move to create the international branch Mars Limited was due to some disagreements with his father. Forrest Mars Sr first created the now-famous Mars Bar before later going on to have his company invent the now-famous Twix, though the candy was originally called Raider. The Original Name Of Twix Twix was not always the original name of the candy bar that is now known by such said designation. The name Twix was introduced circa the 1980s after the candy bar moved from being a European sold candy that was mainly popular in the United Kingdom into the United States snack and candy market. The original name of Twix was called “Raider”. The name Raider was changed to Twix seemingly to try to promote interest and refresh sales. While the name Twix was well accepted in the United States, other countries were not such a fan of the name change from Raider. Much of the negative comments regarding the name change seemed to be linked to the negativity around the idea of trivial changes being used to fix an otherwise non-trivially perceived problem. This seemed to revolve around the culture at the time and in those locations, as it often said that Twix was used in public commentary as a political and business reference to simply renaming a potential problem rather than making real change to fix it. Over time it seems that the world has learned to accept the name Twix, and the name change was completed around the year 2000, 9 years after the worldwide transition of the name began to take place in 1991. Tips On buying Twix is a widely available candy that can be bought at stores like ShopRite, Big Y, and CVS. You can take a look below for a larger list of stores that sell or have sold Twix candy. You can also buy Twix online and have it shipped to you. This is helpful if no stores in your area sell Twix, or if you wish to buy Twix in bulk or are seeking a special variety to suit your tastes. You can check below for some offerings on buying Twix online and have it sent to you. It is fast and easy to buy Twix online, though you may have to wait longer to get it than if you went to a store nearby. Logo Stores That Sell Here is a list of stores that have sold or have sold Twix candy: - CVS - Walgreen’s - Walmart - Staples - ShopRite - Big Y - Lowes - Shop ‘n Save - Kroger - Sams food Stores - Sams Club Flavors Here is a list of the different flavors of Twix: - Peanut Butter Twix (Replaces caramel with peanut butter) (First released as flavor from 1983 to 1997 and from 2000 to 2007. Appeared as Twix PB from 2007 to 2014, with butter cookie base replaced by chocolate cookie base. Returned as Peanut Butter Twix in 2014 with emphasis on “Creamy Peanut Butter”) - Twix PB (Replaced caramel with peanut butter, replaced butter biscuit base with chocolate biscuit base) - Dark Chocolate Twix (Replaces milk chocolate coating with dark chocolate) (Permanent flavor in U.S. since 2017, first released in U.S. in 2005. Appeared in U.K. and Europe in limited distribution from 2008 to 2009) - White Chocolate Twix (Replaces milk chocolate coating with white chocolate) (Permanent flavor in U.S. since 2017, had limited distribution in U.S. and Europe in 2005, 2008, 2011, 2012, and 2016) - Cookies-n-Creme Twix (Replaces caramel with cookies-n-creme filling) (First released as flavor in early 1990s. Will reappear in U.S. in early 2020) - Chocolate Fudge Twix (Replaced caramel with chocolate fudge filling) (First released as flavor in U.K. in early 1990s, had limited distribution in U.S. in 2010) - Triple Chocolate Twix (Chocolate flavored caramel, replaces butter cookie base with chocolate biscuit base) (First released as flavor in U.K. in 1991 and had limited distribution in 2003 and 2007. Had limited distribution in U.S. in 2006 and 2010, became permanent flavor in U.S. in 2017) - Coffee Twix (Coffee flavored caramel) (First appeared as flavor in early 2000s in Asia. Had limited distribution in Poland in 2007, in U.S. in 2008, and in Belgium in 2015) (Has been distributed under names such as Twix Java, Twix Capucchino, and Twix Macchiato) - Wafer Twix (Replaced butter cookie base with wafer base) (First released in Europe in 2007, was available in Milk Cream, Macchiato, and Creamy Caramel flavors) (Has been distributed under different names including Twix Topix and Twix Fino) - Gingerbread Twix (Replaces butter cookie base with gingerbread cookie base) (First released as flavor in U.S. in 2014, has limited distribution in U.S. during seasonal holiday months) - Mint Twix (Chocolate mint-flavored caramel) (First released as flavor in 2001 in U.K. under limited distribution) - Mint Slice Billu Twix (Chocolate mint-flavored caramel, replaces butter cookie base with chocolate cookie base, replaces milk chocolate coating with dark chocolate) (Released under limited distribution from 2006-2007 in Australia) - Choc ‘N’ Orange Twix (Chocolate orange-flavored caramel) (First released in early 1990s in U.K., appeared in 1992 and 1999 under limited distribution) - Coconut Twix (Replaced butter cookie base with coconut cookie base) (Had limited distribution in U.S. in 2011) Varieties/Spin-Offs - Twix Top (Twix recipe produced and packaged as single rectangular biscuit bar. Intended to be breakfast food. First released and distributed in the U.K. from 1999 to 2005. Remains available in continental Europe) - Bisc & Twix (Twix Top reissued as Twix Bisc & Twix in 2005) - Miniatures (Single miniature-sized Twix bar. First released in the 1990s. Reissued as Twix Mini Biscuits in 2014. Returned to being distributed as Twix Miniatures in 2014) - Tea Breaks (Single bar, smaller than standard size but larger than Twix Miniatures. First released in the U.K. in the 1990s.) - 100 Calorie Bars (U.S. version of Twix Tea Breaks. First released in the early 2000s) - Twix Xtra (Larger bar than the standard size. First released in 1994 in the U.K. under the name Twix King Size, later released in continental Europe and U.S.) - Ice Cream Twix (Vanilla ice cream layered in caramel and crunchy butter cookie, coated in milk chocolate shell. Kept in the freezer, consumed as ice cream instead of a non-frozen cookie. First released in U.S. and Europe in 1995 in bar format, still distributed today. First released in tub format in 2001 in Europe) - Chocolate Ice Cream Twix (Vanilla ice cream layered in chocolate caramel and crunchy chocolate cookie, coated in a dark chocolate shell. First released in 1999 in the U.K. under limited distribution) - Twix Super Thick Shake (Caramel-flavored milkshake. Packaged with a bag of miniature chocolate-covered cookies to mix into the milkshake) (First released in U.K. and Ireland in 2007) - Twix McFlurry (Vanilla-flavored ice cream mixed with caramel packaged in McDonald’s McFlurry format. Available during promotional periods, most recently in 2019) - Twix Pods (Twix recipe packaged in miniature pod-shaped pieces. First released in 2006 in Australia) - Twix Milk (Twix-flavored chocolate milk packaged in portable plastic bottles. First released in 2019 in the U.S.) The New Twix During the year 2000, Mars changed the Twix biscuit to a crunchier less dense texture. The new Twix bars were also repackaged in a new bright gold foil type wrap. These bars replaced all old bars and wrappers (including the King Size and subsequent smaller sizes) and are the standard everywhere today including in the U.S. Ingredients And Nutritional Info The following information is for a 3.02 OZ bag (Right) - Ingredients: - Milk Chocolate (Sugar, Cocoa butter, Chocolate, Skim Milk, Lactose, Milkfat, Soy, Lecithin, PGPR, Artificial Flavors) - Enriched Wheat Flour (Wheat Flour, Niacin, Reduced Iron, Thiamine, Mononitrate, Riboflavin, Folic Acid) - Sugar - Palm Oil - Corn Syrup - Skim Milk - Dextrose - Less than 2% – Salt, Cocoa Powder, Soy Lecithin, Modified Corn Starch, Baking Soda, Artificial Flavor. Allergy Information: Contains Milk, Soy, And Wheat. May Contain Peanuts. Partially Produced With Genetic Engineering. Nutrition - % DV = Percent Daily Value. Percent Daily Values are based on a 2,000 calorie diet. (Information taken from the back of a 3.02 OZ bag of Twix (Right) and this information was added in 2019.) Twix White Ingredients And Nutritional Info The following information is for a 2.64 OZ bag of Twix White Ingredients: - White Chocolate (Sugar, Cocoa Butter, Milk, Skim Milk, Soy Lecithin, Natural Flavor) - Glucose Syrup - Sugar - Wheat Flour - Palm Oil - Less Than 2% – Skim Milk, Cocoa Powder Processed with Alkali - Salt - Baking Soda - Natural Flavors. Allergy Information: Contains Milk, Soy, And Wheat. It May contain Hazelnuts and Almonds - Nutrition Facts: Serving Size: 1 Cookie (38 Grams) - Calories per serving: 200 - Fat Calories: 80 - Total Fat: 9 Grams (14% DV) - Saturated Fat: 6 Gram (30% DV) - Trans Fat: 0 Grams (0% DV) - Cholesterol: <5mg (0% DV) - Sodium: 60mg (3% DV) - Total Carbohydrate: 24 Grams (8% DV) - Dietary Fiber: 0 Gram (0% DV) - Sugars: 18 Grams - Protein: 2 Grams - Vitamin A: (0 %DV) - Vitamin C: (0 %DV) - Calcium: (4% DV) - Iron: (0% DV) % DV = Percent Daily Value. Percent Daily Values are based on a 2,000 calorie diet. (Information taken from the back of a 2.64 OZ bag of Twix White and this information was added in 2019.) Pictures Commercials Here is a commercial advertisement: 2012 COMMERCIAL ADVERTISEMENT FAQ What is the difference between left and right Twix? Right Twix is enrobed in chocolate with drizzled caramel with a crunchy cookie inside. Thus, it’s sweet and crunchy. Left Twix is coated in chocolate with cascaded caramel with a crispy cookie inside making it sweet and crunchy as well. Who makes Twix? The company that owns Twix is Mars Incorporated. How many calories in a Mini Twix? There are 50 calories in a 10g Mini Twix. Which Twix has more caramel? Left Twix is enrobed in chocolate with drizzled caramel and a crunchy cookie inside that makes it more crunchy and sweet, whereas Right Twix is cloaked in chocolate with cascaded caramel and a crispy cookie inside that makes it more sweet and crunchy. Who owns Twix? The company that owns Twix is Mars Incorporated. Why does Twix have left and right? The difference between Left Twix and Right Twix is that Left Twix is enrobed in chocolate with drizzled caramel and a crunchy cookie inside. Whereas, Right Twix is cloaked in chocolate with cascaded caramel and a crispy cookie inside. When was Twix invented? Twix was invented in the year 1967 by Forrest Mars and the Mars Limited company. The candy bar was first sold in the United Kingdom and was later introduced into the United States in the year 1979. By 2019 Twix has been sold worldwide and can be found in many countries, such as Spain, Poland, Norway, Switzerland, Turkey, and Luxembourg. How many calories in a Twix? There are 502 calories in every 100 grams of Twix. How many calories in a fun size Twix? There are 80 calories in a fun size Twix. When did left and right Twix start? Twix become left and Right in 2012. What is Twix? Twix is a cookie (or biscuit for some) that consists of a shortbread-like substance covered with ingredients like chocolate and caramel. Made using ingredients such as Enriched Wheat Flour, this candy bar is very chocolaty, crunchy, and just begs for a drink when eaten. Twix was first produced in the United Kingdom under the name Raider before its name was changed to Twix after its introduction to the United States. Twix comes in an aluminum-like wrapper and usually comes with 2 or 4 stick-like or cylindrical-shaped cookies (biscuits) per package. Read About More Snacks, Drinks, And Candy! Almond Joy is a candy bar that replaced the Dream Bar. It consists of almonds, coconut, and milk chocolate. Learn more at Snack History. Cheez-It is a cheesy cracker that is baked into the shape of a rectangle. Learn more about Cheez-It here! Sprite is a lemon-lime flavored soda that is popular with teens and adults. Sprite is known both for its fresh, crisp, taste and branding. Fruit Roll-Ups are a flat fruit snack that is sweet, tasty, and of a novel design. Read here for everything you could want to know about Fruit Roll-Ups! My name is Brianna and I love writing on all topics. Candy history fascinates me and I am passionate about sharing my love of this topic with everyone else! Please leave a review or any memories of this snack in the comments below. Thank you! Click here for a full A-Z list of Snacks and Candy"
}