{
  "url": "https://www.capri.com/",
  "title": "Capri: All You Need To Know | Boat Tours, Ferry Tickets, Hotels",
  "text": "Capri: plan, book, go. Plan the perfect visit! Discover Capri from the sea Scenic boat tours Explore the island and its surroundings Unforgettable tours and excursions on Capri Get the best suggestions and ideas from local experts Get Inspired with our handpicked experiences, selected and vetted in person. We live and work on Capri all year long. Inspiration Our top Capri recommendations, based on your travel style and budget Find the ideal hotel Our curated selection of highly rated island accommodations boasts over 12,000 incredible stays booked Find the right restaurant Scenic, budget-friendly, or gourmet - here are all the best restaurants on Capri Top sights Capri.com: Your complete guide \"There is no spot in the world with such delightful possibilities of repose as this little isle.\" So said Charles Dickens when speaking about Capri over a century ago, and his observation still rings true today. From the Faraglioni and Tiberius' Leap to the sparkling sea in the bays of Marina Piccola and Marina Grande - everything on Capri is an invitation to relax. The island moves at a slower pace, calling you to immerse yourself in its natural beauty and bask in the warm Mediterranean sun. Where is the island of Capri? Capri is set in the blue waters of Italy's Tyrrhenian Sea in the Bay of Naples just off the Sorrentine Peninsula in the southern Italian region of Campania. The island is connected to the mainland all year round with ferries and hydrofoils that run from Naples (Napoli) and Sorrento. There are also ferries from Ischia, Salerno, and the Amalfi Coast (Positano and Amalfi) in the summer months. It takes about 30 minutes to reach Capri from Sorrento and about an hour to reach Capri from Naples by ferry, so is an easy day trip from the mainland. Where should I stay on the island? The Isle of Capri has two municipal areas: Capri town and Anacapri. Capri town is home to the famed \"Piazzetta\" and the nearby Via Camerelle, both lined with high-end boutiques, fashionable cafés, luxury hotels, and nightclubs. This is where celebrities from across the globe come to see and be seen by day and by night. The island's main church, the Cathedral of Santo Stefano with its famed bell tower, is also located here. Inside the church, you can see the silver bust of San Costanzo, the patron saint of the island. To reach the Piazzetta, you have to catch the funicular from Marina Grande, the port at sea level. Marina Grande is also home to the largest and most family-friendly beach on the island. On the opposite coast, Marina Piccola is home to the only other beach. The other island town is Anacapri, which sits on the high inland hills at the foot of Monte Solaro. There are no beaches here, but below the town there are the rocky coastlines of the Punta Carena lighthouse and Gradola, near the Blue Grotto (Grotta Azzurra), where beach clubs have been set up. Anacapri has a delightful historic center, largely pedestrian, where there are excellent restaurants for sampling Neapolitan specialties like fresh mozzarella caprese salad and local fish and seafood. You can also visit Axel Munthe's famed Villa San Michele. What should I see on Capri? The first thing you should do when arriving for a Capri day trip is take a boat tour around the island to admire iconic landmarks like the Faraglioni and grottoes by sea. You can also take the chairlift to the top of Monte Solaro, stroll the Pizzolungo trail to the natural Arch, visit the Gardens of Augustus over the scenic Via Krupp, take in the Charterhouse of San Giacomo, admire the breathtaking views from the Tragara overlook, and tour the ancient Roman ruins of Tiberius' villas. Be sure to wear comfortable shoes on Capri, because you will be doing quite a bit of walking. Either on hiking trails through the countryside, along flower-lined town lanes, or across scenic overlooks with views of the sea...Capri is an island best explored on foot."
}