{
  "url": "https://community.tp-link.com/en/home/forum/topic/188868",
  "title": "Wi-Fi 6 Fundamentals: Target Wake Time (TWT) - Home Network Community",
  "text": "Wi-Fi 6 Fundamentals: Target Wake Time (TWT) Wi-Fi 6 Fundamentals: Target Wake Time (TWT) Wi-Fi 6 certification has already begun. Therefore, it’s prudent for enterprises to adopt the new wireless standard for their products if they want to stay ahead of the curve. To meet the needs of businesses, TP-Link released its Wi-Fi 6 products with greatly improved capacity and performance. In previous articles, I broke down OFDMA and long OFDM symbols and explained how they set WiFi 6 apart from previous wireless standards. In this article, I’ll explore another major WiFi 6 feature—Target Wake Time (TWT). TP-Link has already added this function to their products. So, to ensure you get the most mileage out of your purchased Wi-Fi 6 devices, it’s important to understand what TWT is and how it works. What is Target Wake Time? In the simplest terms, Target Wake Time (TWT) is a new feature that allows an Access Point (AP) and stations to “wake up” at negotiated times. The stations and AP reach a TWT agreement that defines when a station is awake to receive and send data. Still sounds complicated? Well, to simplify things, let’s try to get rid of all the technical jargon and use an analogy. Assume a family of four live in a house, sleeping in different rooms. Every day they wake up to an alarm all at the same time. The father has to get up early to drive 30 minutes to work, but his two kids feel annoyed waking up at the same time since they can sleep in a little bit longer due to their school being only a 5-minute walk. Obviously, setting the alarm at different times would be a better idea. The kids’ sleep won't be disturbed when their dad leaves home earlier. Alarms ringing at different times resembles TWT agreements which wakes stations up periodically. Why do stations and APs need TWT to schedule their wake times? Without TWT, the AP will broadcast a beacon frame to alert some stations to possible data transmissions. This beacon frame informs some stations of the information that their data has been stored in the AP’s cache. Since the AP can only communicate with one station at a time, they have to “stay awake” to receive data packets from the AP one after another regardless of how long that process takes. When station 1 is exchanging data with AP, station 2 is in an idle state and waits until the AP finishes its communication with station 1. This causes extra power consumption and shorter battery lives for network devices. So how can TWT help devices save power and extend battery life? This mechanism allows each station to negotiate their periods with the AP to transmit and receive data packets before the beacon period. Stations only wake up at TWT sessions and remain in sleep mode for the rest of the time. TWT - An Innovation for IoT IoT has been a hot topic in recent years. We’ve witnessed how far technology has progressed using IoT. Just think of those new smart fridges that automatically remind you to buy food supplies right when you run out of something. IoT devices are constantly being developed to make our lives more convenient. However, as the number of IoT devices grows, more power consumption and shorter battery lives will become major concerns. TWT helps multiple WLANs in heavy deployment environments reach consensus on non-overlapping schedules, which ensures better battery life, saves power, and reduces network congestion. Although much work still needs to be done when it comes to TWT, we can expect it’ll definitely improve Wi-Fi 6 in the coming years and beyond."
}