{
  "url": "https://case-law.vlex.com/vid/middlebrooks-v-state-s22a1328-940815781",
  "title": "Middlebrooks v. State (Middlebrooks v. State, 315 Ga. 671, 884 S.E.2d 318 (Ga. 2023)) - vLex United States",
  "text": "Middlebrooks v. State Lucy Dodd Roth, Tiera Mary Elaine Williams, Augusta Circuit Public Defender's Office, 902 Greene Street, Augusta, Georgia 30901, Maigan Jenkins, Office of the Public Defender, 902 Greene Street, Augusta, Georgia 30901, for Appellant. Patricia B. Attaway Burton, Deputy Attorney General, Paula Khristian Smith, Senior Assistant Attorney General, Christopher M. Carr, Attorney General, Eric Christopher Peters, Assistant Attorney General, Department of Law, 40 Capitol Square, S.W., Atlanta, Georgia 30334, Joshua Bradley Smith, A.D.A., Jared Tolton Williams, District Attorney, Augusta Judicial Circuit District Attorney's Office, 735 James Brown Boulevard, Suite 2400, Augusta, Georgia 30901, for Appellee. After Marina Middlebrooks pleaded not guilty by reason of insanity to charges arising from the stabbing death of her daughter, Sky Allen, a jury found Middlebrooks guilty of murder and cruelty to children in the first degree.1 On appeal, Middlebrooks contends that the trial court erred in allowing the State's expert witness to testify as to what happens when a person is found not guilty by reason of insanity. In addition, Middlebrooks contends that \"[t]he trial court erred in restricting the testimony of [her] diagnosing psychiatrist,\" an employee of the Department of Veterans’ Affairs (\"VA\"), \"without following the correct procedure\" under federal regulations concerning the testimony of VA personnel in legal proceedings. In a related claim, Middlebrooks contends that her \"trial counsel was ineffective in failing to object to the limitation of [the witness's] testimony by the [f]ederal [g]overnment and the [p]rosecutor.\" For the reasons explained below, we affirm. After indictment in Columbia County, where Sky's dead body was discovered, the case was transferred to and re-indicted in Richmond County, based on Middlebrooks's pretrial statements that placed the alleged criminal acts outside her Richmond County home. Middlebrooks filed a notice of intent to raise the issue that she was insane at the time of the acts charged against her. Before the trial began, the State and Middlebrooks entered into a stipulation that, Because the parties stipulated that Middlebrooks killed her daughter, the primary issue the jury had to decide was Middlebrooks's mental capacity at the time she committed the crimes, with the possible verdicts being not guilty, not guilty by reason of insanity, guilty but mentally ill, or guilty.2 The jury was required to return a verdict of not guilty by reason of insanity if the jury found beyond a reasonable doubt that Middlebrooks committed the crimes charged in the indictment and also found by a preponderance of the evidence that she was legally insane at that time, that is, she did not have the mental capacity to distinguish between right and wrong in relation to the act.3 At the beginning of trial, the trial court read the parties’ stipulation to the jury and instructed the jury that, based on the stipulations that had been entered into, Middlebrooks's \"plea of not guilty by reason of insanity frame[d] the issue that [the jury was] sworn and empaneled to try in this particular case.\" The State presented the testimony of investigators and other witnesses as to the circumstances of the crimes. That uncontested evidence showed that, on May 2, 2013, a passerby saw Middlebrooks's car swerve out of its lane on Ray Owens Road in Columbia County and then crash into a tree. The witness called 911. First responders found Middlebrooks in the driver's seat. She was nude except for a sweatshirt and covered in blood. One first responder testified that Middlebrooks \"did not appear to be fully conscious.\" Middlebrooks told the first responders that \"someone had done something\" to her, but provided no details. To most of the first responders’ questions about what had happened to her, she answered, While tending to Middlebrooks, first responders found her two-year-old daughter, Sky, dead on the car's rear floor, underneath a pile of clothes. Sky was also unclothed, covered in dried blood, and had a gaping stab wound to her neck. Her body had already cooled. A bloody pair of scissors lay in the front passenger seat. A medical examiner later determined that Sky had suffered multiple stab wounds, one of which severed a jugular vein, resulting in fatal blood loss. The wounds were consistent with having been created by the sharp edges of an opened pair of scissors. Middlebrooks had multiple puncture wounds and lacerations to her neck, face, chest, arms, wrists, and knee. Her neck wounds were severe enough to require intubation for a few days. After the State presented evidence of the circumstances of the crimes, Middlebrooks called several witnesses in support of her insanity defense. After being qualified as an expert, Dr. Geoffrey McKee, a board-certified criminal forensic psychologist, testified that he evaluated Middlebrooks in October 2014, when he spent 6 hours, 25 minutes with her, and February 2016, when he spent an hour with her. In addition to administering psychological tests and interviewing Middlebrooks, Dr. McKee reviewed records of previous evaluations and treatment of Middlebrooks, including a four-week hospitalization at the VA hospital in the summer of 2011, when she was diagnosed with \"schizophreniform disorder\" and with \"post traumatic stress disorder,\" arising from her 13 months in combat zones in Iraq. Dr. McKee testified that Middlebrooks was readmitted to the VA hospital for two weeks in February 2012 and diagnosed with \"schizophrenia continuous, meaning that the symptoms were recurring on a ... near daily basis,\" and \"[s]chizophrenia paranoid type, which means that she had delusions of persecution, feelings that other people would hurt her even though there was no evidence of that.\" For example, the records showed that Middlebrooks reported believing that other people wanted her to kill herself. Dr. McKee also reviewed the records from Middlebrooks's five-day hospitalization following her arrest for Sky's death and her hospitalization at East Central Regional Hospital in Augusta that began seven weeks after Sky's death and lasted for about six weeks. In reviewing the records of the VA hospitalizations and the post-arrest hospitalizations, Dr. McKee looked for any indication in those records that Middlebrooks was \"malingering\" – faking her symptoms – and he found none. Dr. McKee testified about his own examinations of Middlebrooks and described some of the fixed delusions she reported, such as that \"she could control and slow down time by moving her hands in a particular way.\" Dr. McKee testified that Middlebrooks reported that, just before the crimes, she stripped herself and her daughter naked, even removing their earrings, \"because she believed that to get to heaven she and her daughter would have to die\" by their own hands, \"but that they had to be naked because the clothes, including any jewelry, would block the spirits from leaving\" their bodies. Dr. McKee administered several psychological tests to Middlebrooks, some of which are designed to detect malingering, and he found no evidence of malingering during the course of his own evaluation. Dr. McKee testified that \"[c]ommand auditory hallucinations are not uncommon in persons with schizophrenia, but often with people who try to malinger schizophrenia, when they are charged with a crime will tell the examiner that they had a command auditory hallucination\" ordering them to commit the particular crime. Dr. McKee found it a significant indication that Middlebrooks was not malingering that, according to the records from her hospitalization in the days after the crimes, she \"did not seize upon [a command hallucination ] as a way of explaining away all that she had done.\" Based on Middlebrooks's history and his own evaluation, Dr. McKee diagnosed her with paranoid schizophrenia. In Dr. McKee's opinion, at the time of the crimes, Middlebrooks \"suffered from schizophrenia, a serious psychiatric disorder[,]\" that \"as a result of that disorder she did not have the mental capacity to know right from wrong[,]\" and that \"the delusional component of that ... disorder overmaster[ed] her will to resist committing her offenses.\" Dr. McKee testified that, in his more than 40-year career, he had evaluated more than 40 women who had killed one or more of their own children. Out of those 40 cases, Dr. McKee had found that only 4 of those mothers, including Middlebrooks, were insane. Dr. Donna Schwartz-Watts, the chief psychiatrist for female patients at Patrick B. Harris Psychiatric Hospital in Anderson, South Carolina, also testified as an expert witness. Dr. Schwartz-Watts evaluated Middlebrooks in February 2014, when she spent \"over two hours\" with her, and \"saw her again a period of time later.\" Like Dr. McKee, Dr. Schwartz-Watts reviewed records of Middlebrooks's previous mental health treatment, including just after she killed Sky. Dr. Schwartz-Watts also reviewed statements by witnesses to the crash, Middlebrooks's emergency treatment, and her arrest; examined detention records; and interviewed Middlebrooks's mother and other witnesses. She found that Middlebrooks exhibited a common symptom of schizophrenia, a type of delusion called \"ideas of reference,\" and a very rare symptom, called \"clanging.\" She explained that, rather than expressing thoughts that were connected rationally, Middlebrooks would say words in a sequence that were related to each other only by \"the sound of the words.\" Dr. Schwartz-Watts described clanging as \"one of the most severe and regressed forms of thought process, of... Get this document and AI-powered insights with a free trial of vLex and Vincent AI Get Started for FreeStart Your Free Trial of vLex and Vincent AI, Your Precision-Engineered Legal Assistant - Access comprehensive legal content with no limitations across vLex's unparalleled global legal database - Build stronger arguments with verified citations and CERT citator that tracks case history and precedential strength - Transform your legal research from hours to minutes with Vincent AI's intelligent search and analysis capabilities - Elevate your practice by focusing your expertise where it matters most while Vincent handles the heavy lifting Start Your Free Trial of vLex and Vincent AI, Your Precision-Engineered Legal Assistant - Access comprehensive legal content with no limitations across vLex's unparalleled global legal database - Build stronger arguments with verified citations and CERT citator that tracks case history and precedential strength - Transform your legal research from hours to minutes with Vincent AI's intelligent search and analysis capabilities - Elevate your practice by focusing your expertise where it matters most while Vincent handles the heavy lifting Start Your Free Trial of vLex and Vincent AI, Your Precision-Engineered Legal Assistant - Access comprehensive legal content with no limitations across vLex's unparalleled global legal database - Build stronger arguments with verified citations and CERT citator that tracks case history and precedential strength - Transform your legal research from hours to minutes with Vincent AI's intelligent search and analysis capabilities - Elevate your practice by focusing your expertise where it matters most while Vincent handles the heavy lifting Start Your Free Trial of vLex and Vincent AI, Your Precision-Engineered Legal Assistant - Access comprehensive legal content with no limitations across vLex's unparalleled global legal database - Build stronger arguments with verified citations and CERT citator that tracks case history and precedential strength - Transform your legal research from hours to minutes with Vincent AI's intelligent search and analysis capabilities - Elevate your practice by focusing your expertise where it matters most while Vincent handles the heavy lifting Start Your Free Trial of vLex and Vincent AI, Your Precision-Engineered Legal Assistant - Access comprehensive legal content with no limitations across vLex's unparalleled global legal database - Build stronger arguments with verified citations and CERT citator that tracks case history and precedential strength - Transform your legal research from hours to minutes with Vincent AI's intelligent search and analysis capabilities - Elevate your practice by focusing your expertise where it matters most while Vincent handles the heavy lifting Start Your Free Trial - Smith v. State ...from opining on whether the defendant had the required mental state to be guilty of the charged offense); Middlebrooks v. State, 315 Ga. 671, 689-690 (2) (b), 884 S.E.2d 318 (2023) (discussing various mental health experts’ opinion testimony about the defendant’s diagnosis); Adams v. State,...... - Hassan v. State ...of objection, if the specific ground was not apparent from the context[.]\" OGGA § 24-1-103 (a) (1). See Middlebrooks v. State, 315 Ga. 671, 687 (2) (a), 884 S.E.2d 318 (2023). Without preservation of error as provided in OCGA § 24-1-103, an appellate court reviews an evidentiary ruling only...... - Waller v. State ...23 See Perez v. State , 303 Ga. 188, 191 (2), 811 S.E.2d 331 (2018). 24 (Citations and punctuation omitted.) Middlebrooks v. State , 315 Ga. 671, 684 (1), 884 S.E.2d 318 (2023). 25 See Middlebrooks , 315 Ga. at 686 (1), 884 S.E.2d 318. 26 (Citation and punctuation omitted.) Park v. State , ......"
}