{
  "url": "https://www.city-data.com/forum/relationships/2605970-do-passive-nice-guys-ever-like.html",
  "title": "Do passive, nice guys ever like strong women? (dating, wife, marriage) - Relationships -Dating, marriage, boyfriends, girlfriends, men, women, friends, attraction ... - City-Data Forum",
  "text": "06-30-2016, 08:47 PM 20 posts, read 63,458 times Reputation: 32 Do passive, nice guys ever like strong women? I'm highly intelligent and very passionate about my beliefs. It's what enabled me to become a software engineer, even though I'm a female. However, I don't mind at all if someone doesn't agree with my beliefs. That's fine. I'm not controlling. I want someone to have their own hobbies and ideas and be independent because I'm independent too. But I will talk about my beliefs/ideas very passionately since I care a lot about them. And I like hearing the ideas of others, even if they're completely opposite, because I usually can learn something new. I see this as a fun and constructive discussion, not an argument. But many people see it as arguing because they only ever want to make small talk, not discuss the deep and important stuff. 1) Because I have strong ideas, I cannot tolerate a dominate man in a dating relationship. Unless he happened to be extremely patient and respectful that I didn't agree with him, which is unlikely because dominate men are usually looking for a submissive female. They cannot handle being challenged like that by a dating partner. They might say they can, but it isn't true. 2) I like passive men because they are easy-going. That passive nature they have calms me down and provides balance. I can get very frustrated with the world in general because of all the stupid things people do to destroy themselves and the environment. But someone calm nearby can be a calming force on my passionate frustration. They know the world can't be changed, so there's no reason to get so worked up about it. It makes me relax naturally, rather than some dominate guy coming in and trying to make me submit thru force. 3) Frankly, I'm terrified to be myself around dominate men, especially if I'm attempting to date them. I'm terrified they'll rape or hurt me, try to control my every action, or just get angry with me and leave. I like the passive, nice guys, because I feel SAFE with them. I know they're too nice, they would never rape me or harm me. 4) I'm a virgin and religious, so I'd really like to wait until marriage. And when married, I take it very, very seriously. AKA marriage is forever. Divorce is not even an option in my book. That's why I would be extremely careful who I marry. In other words, I take dating seriously and would be extremely loyal. But I've seen a lot of men who prefer the girl who's slept around, just because she has a passive personality. They don't care about loyalty and honesty if her personality is too strong. I've also seen a lot of men prefer the overweight girl simply because she's passive. So even losing weight and getting in shape wasn't enough to offset my strong personality. This is how I was born. I didn't plan or choose to have a passionate, strong personality. I've been this way since the very beginning as a kid. And my mom actually suggested I pretend to be more passive while dating. But I don't think that's the answer because you can only keep up a charade for so long. I don't think that's the way to a lasting relationship. The major problem is I'm fishing in a very small pond, so there might still be hope that there's a passive guy out there that doesn't mind a strong personality. I've had several nice guys who were happy to be friends, but pretty much made it clear they couldn't date me because I was too intense for them. They know I'm a good person, but I'm too intense for their easy-going personality. Intense as in I like to discuss deep topics. I don't talk about marriage. Do passive, nice guys ever like strong women? 06-30-2016, 08:52 PM Location: NNJ 15,885 posts, read 11,807,330 times Reputation: 18422 honestly, I don't think what you describe is a passive man.... A strong man can possess those same attributes. In fact, you sound much like a female version of I... minus being the virgin (so far from it) and religious (I'm not). I\"m even a software engineer. I always went for strong independent women but neither of us were ever dominant over the other.... Both my previous GF and my wife are what I considered strong women in different ways. So I think you are doing yourself a disservice by having a strict definition of the ideal mate would be and grouping them into this or that bucket.... each individual is an individual. Opportunites could be missed. 06-30-2016, 08:56 PM 4,707 posts, read 3,832,649 times Reputation: 6306 In my experience, yes. I am a shy, studious (but attractive, or so I have been told) person and was always attracted to shy, studious types. Did they ever give me the time of day? No. I always lost out to strong, outgoing women, even in high school, even to my sister and best friend. I didn't understand it then, but I think a lot has to do with 'opposites attract'... The type of men who were attracted to me have always been the strong outgoing type. 06-30-2016, 08:57 PM Location: Middle of the valley 49,156 posts, read 39,344,168 times Reputation: 75418 Quote: Originally Posted by crystalized 3) Frankly, I'm terrified to be myself around dominate men, especially if I'm attempting to date them. I'm terrified they'll rape or hurt me, try to control my every action, or just get angry with me and leave. I like the passive, nice guys, because I feel SAFE with them. I know they're too nice, they would never rape me or harm me. What?!!!!! You are confusing a type A personality for a criminal. I'm a type A personality, one husband is also, my late husband was a type B. All combos can work out. __________________ ____________________________________________ My posts as a Mod will always be in red. Be sure to review Terms of Service: TOS And check this out: FAQ Moderator: Relationships Forum / Hawaii Forum / Dogs / Pets / Current Events 06-30-2016, 09:20 PM Location: South Bay Native 16,216 posts, read 29,157,412 times Reputation: 31499 A man's propensity to rape isn't predicated by his outwardly dominant or passive personality. Your ideas about relationship dynamics are quaint, though. If you prefer a passive man, you're in luck - this forum is brimming with guys who are just waiting for you to approach them and take the wheel. They are actually insulted that most women expect them to approach. Stick around a little, they frequently start threads complaining about how they can't take rejection and want (exceptionally attractive) women to approach them instead. 06-30-2016, 09:35 PM Location: The point of no return, er, NorCal 7,400 posts, read 6,853,976 times Reputation: 9636 Some of the OP's ideas about relationships are... interesting. How old are you, OP? 06-30-2016, 09:37 PM Location: louisville 4,754 posts, read 3,021,276 times Reputation: 1721 A lot of assumptions in that post... 06-30-2016, 10:50 PM 3,449 posts, read 3,679,569 times Reputation: 6253 Yes, but those passive, shy guys tend to get treated like doormats! You need to be assertive, maintain direct eye contact, and by all means speak your mind! Also, pay attention to your posture. Women are not dumb. Your body language tells them more than you think. 06-30-2016, 11:31 PM 31,049 posts, read 26,515,528 times Reputation: 49957 yes 07-01-2016, 01:06 AM 1,519 posts, read 1,459,085 times Reputation: 2185 Passive men adore women that take the reigns,make all the decisions,it's saves them doing it which they don't enjoy. But all you've really said its that you are passionate and opinionated men generally value this also. Please register to post and access all features of our very popular forum. It is free and quick. Over $68,000 in prizes has already been given out to active posters on our forum. Additional giveaways are planned. Detailed information about all U.S. cities, counties, and zip codes on our site: City-data.com ."
}