{
  "url": "https://www.marcos.com/customer-contact-center/",
  "title": "Order Pizza with Ease | Marco's Pizza Contact Center",
  "text": "How do I find deals and specials? When ordering online from your local store location, look under hot deals for special offers and promotions. How do I get in touch with someone about my order? We recommend contacting the Marco’s Pizza location you ordered from for assistance. You can find our menu at https://www.marcos.com/menu/ I canceled my online order, but the charge still shows on my account. When an order is placed, there is a pre-authorization hold that will appear as a pending transaction on your account. It can take 3-5 business days for the refund to process depending on the financial institution’s policy. If the refund has not been completed after this timeframe, contact the store from which you ordered or your financial institution for more information. Where can I find a list of store locations and hours? You can find our locations and store hours at: https://www.marcos.com/locations/ Give the gift of pizza Where can I purchase Marco’s gift cards? Gift Cards can be purchased in-store or at https://marcos.cashstar.com/store/recipient?locale=en-us How can I check my gift card balance? Gift Cards balance can be checked at https://www.marcos.com/giftcard/ When will my recipient receive their eGift Card? Your eGift Card will be sent via email on the delivery date you choose, with rare exceptions for processing delays. For same-day delivery, most eGift Cards are sent within an hour of the purchase transaction. For future delivery, eGift Cards are sent on the morning of the scheduled delivery date. Please visit https://www.marcos.com/giftcard/ for more about eGift Cards. When does the eGift Card expire? There is no expiration date on your Marco’s Pizza eGift Card. For further assistance on an existing gift card, please have your card number ready and call 1-833-960-0228. Sign up for Rewards Earn 1 point per dollar How do I sign up for Marco’s Rewards program? To sign up for email offers and rewards please visit https://www.marcos.com/email-club/ For every $1.00 spent you earn 1 point, based on your pre-taxed total. Points cannot be earned on purchases of alcohol or gift cards, purchase of products as part of a school challenge or other promotional/fundraiser event, or any orders placed through third-party delivery platforms (e.g. DoorDash). When you reach 100 points you will be issued a $10 certificate that can be redeemed at any Marco’s Pizza® store. Upon redemption, the certificate will not be applied toward any applicable taxes, delivery charges, or delivery minimums associated with the order. How do I see my rewards points balance? Your Marco’s Pizza account houses your Marco’s Loyalty Rewards meter, which tracks your points balance. Sign in and view your current Rewards status at www.marcos.com Loyalty rewards points never expire. Does Marco’s Pizza offer a birthday reward? Sign up for the Marco’s Pizza email list and get a birthday coupon for a free small One topping Pizza. Loyalty coupons expire 30 days from the date they were issued. Have a question you didn’t see answered in our FAQ, or need additional assistance? Click here to send us your questions, comments or feedback."
}