{
  "url": "https://en.wikipedia.org/wiki/Prostitution_in_Mexico",
  "title": "Prostitution in Mexico - Wikipedia",
  "text": "Prostitution in Mexico Prostitution in Mexico is legal under Federal Law. Each of the 31 states enacts its own prostitution laws and policies.[1] Thirteen of the states of Mexico allow and regulate prostitution.[2] Prostitution involving minors under 18 is illegal. Some Mexican cities have enacted \"tolerance zones\" (\"zonas de tolerancia\") which allow regulated prostitution and function as red-light districts. In Tuxtla Gutiérrez, capital of the state of Chiapas, there is a state-run brothel at the Zona Galáctica(Galactic Zone).[3] In most parts of the country, pimping is illegal, although pimp-worker relationships still occur, sometimes under female pimps called \"madrotas\"(\"Big Mothers\").[4] The government provides shelter for former prostitutes.[5] UNAIDS estimated the number of prostitutes in the country at 236,930 in 2016.[6] History [edit]Prostitution was known to exist during the Aztec Empire[7] although the details are relatively unknown, as much Aztec history was chronicled later by Roman Catholics[8] in a pejorative manner based on strict European values and law.[9] Following the Spanish conquest and establishment of New Spain, Spanish settlers created a demand for prostitution. Throughout the 16th and 17th centuries prostitution was tolerated provided it was kept out of sight. Although Philip IV banned the practice, this was generally unenforced.[10] Prostitution was first regulated in Mexico during the French occupation in the 1860s. These regulations which consisted of registering oneself as a prostitute and of regular health care check-ups were implemented to protect European soldiers from contracting sexually transmitted diseases, since sexually transmitted diseases particularly syphilis and gonorrhea were spreading quickly. While in power, the French influenced the perception of sex work in various ways, as they categorized women based on their views of beauty and classified places where sex work was done depending on location and services available. Though the French enforced supervision of prostitutes as a way of protecting themselves from infections, similar regulations remained when Mexico regained control of the country.[11] During the authoritarian regime of Porfirio Díaz in the late 19th century, regulations in the forms of monthly quotas, medical examinations, and photographic documentation were imposed upon prostitutes.[12] Regulatory practices were most severe on the eve of the Mexican export-mining economic collapse, and had been met with backlash from women's rights groups in Oaxaca, Yucatán, and Veracruz.[13] According to a 1908 study, economic concerns were the main reason for turning to the sex trade in the Porfiriato, at which time 15 to 30 per cent of Mexico City's young female population was employed in the sex trade.[14] During the Mexican Revolution, supplies to the cities were severely disrupted, and many women prostituted themselves for food in the period 1913–1915.[11] In the post-war period of reconstruction and consolidation during the 1920s and 1930s, many impoverished women in the cities turned to prostitution.[11] The revolutionary political and social reforms under Lázaro Cárdenas led to the end of the regulation of prostitution in 1940.[11] Although morally pressured by the United States and the prevalent changes ongoing prostitution after World War I, El Paso's location served as a convenient place for prostitution to thrive. El Paso's proximity to the United States border allowed for quick and easy access by Americans after the abolition of prostitution. The access to Mexico via the railroad from the United States and the economic success of prostitution gave way to a surge of Mexican women participating in this kind of labor. As prostitution increased, so did the regulations.[15] In translocal border cities such as Mexicali in Baja California, local brothels and vaudeville theaters became spaces for American tourists, Asian laborers, and Mexican-American sex workers to intermingle in the 1930s.[16] Additionally, American sex tourists that traveled specifically for sex weren't the only customer base for sex workers. A large portion of customers near the border were agricultural laborers. Some women would live in mobile homes, moving across fields in order to service workers. Many of these young men would want younger women, asking specifically for women between the ages of 15 and 35, paying less for anyone over that limit.[17] In the mid-2000s, American men make up a significant clientele sector for sex workers in border cities, specifically Ciudad Juárez and Tijuana—more than two-thirds of female sex workers in these two cities had had at least one male U.S. client in the prior two months.[18] Sex worker relationships didn't only occur and end in Mexican brothels, however. Many women deemed young and attractive enough by American tourists would be given the opportunity to return with the men to the United States and stay for a few years across state lines. When a few years passed and the sex tourists would lose interest, the sex worker would return to their former workplace because their youth had faded and were \"no longer required up north\".[17] It has been argued that neoliberal reforms instituted in the 1990s under the PRI administration of Carlos Salinas de Gortari—including the signing of NAFTA in 1994—incubated adverse economic conditions that caused the migration of indigenous women from southern Mexico to northern border locales to find work in the sex trade or in maquiladoras.[19] Violence against sex workers in Ciudad Juárez has been connected to similar atrocities committed against maquiladora workers.[20] Sex worker perception [edit]A big part of sex workers struggles have to do with their own perception of ones self. A common trend amongst all type of sex workers, men and women alike, is that they often suffer with negative feelings of self worth mentally and physically; oftentimes feeling dirty and unclear due to the nature of their line of work. When bringing up the topic of male sex workers in Mexico, masculinity is a big part of what can be negatively affected by social stigmas. Mexico as a country overall follows the idea of machismo, meaning many of the men have a sense of strong and aggressive masculine pride which results in them seeing themselves as above women in many aspects of society, so to see a man engage in this line of work, especially if its homosexual sex work, it can strip away their sense of masculinity and bring upon more shame to them that extends that of just being a regular sex worker.[21] Female sex workers aren't without their own fair share of criticism towards their femininity, however. Due to the strong hold that religion has on Mexico, sexual intimacy as a whole is heavenly scrutinized, especially when referring to women. If sexual intimacy isn't done in a way that is socially acceptable, then they can be looked down upon, being called sinful and wrong. When that negative view is applied to prostitution, it gets amplified and is seen as evil, and any woman who doesn't abide by these stigmas is ultimately stripped of their womanhood.[22] Child prostitution [edit]Child prostitution is a problem in the country, and Mexico continues to be a destination for pedophiles who engage in child sex tourism. Mexico has one of the highest levels of child sexual exploitation, along with Thailand, Cambodia, Colombia, India, and Brazil.[23] A study by UNICEF Mexico and the DIF/National System for Integral Family Development estimated that more than 16,000 children in Mexico were involved in prostitution in June 2000.[24] A 2004 study by researcher Elena Azaola estimated that some 17,000 children under the age of 18 are victims of the sex trade in Mexico;[25] the State System of Integral Family Development (DIF) reported that more than 20,000 minors were victims of child prostitution in Mexico in 2005, an increase since the year 2000.[26] Out of Mexico City's 13,000 street children, 95% have had at least one sexual encounter with an adult (many of them through prostitution).[23] In the impoverished southern state of Chiapas, children have been sold for $100 to $200, according to human rights groups. Chiapas is considered one of the worst places in the world in terms of child prostitution.[23] Poverty forces many rural children, with or without their families, to migrate to urban cities to seek out employment, some of them also migrate across the border to the U.S. Many children also join sex work in order to escape from abusive home lives. Getting physically abused and in some cases sexually abused in their homes could result in children running away and finding comfort and protection in places like brothels or pimps. The overall combination of inexperience, fear, and lack of support is what led many young women to be taken advantage of and used for sex work.[27] These children have little or no parental supervision and many are lured into the sex industry or abducted by child trafficking gangs.[citation needed] Child sex tourism persists in Mexico, especially in tourist areas such as Acapulco, Puerto Vallarta, and Cancún, and in northern border cities such as Tijuana[28] and Ciudad Juárez. Some NGOs alleged that some corrupt local officials allowed commercial sexual exploitation of children to occur. Many child sex tourists are from the United States, Canada, and Western Europe, though some are Mexican citizens.[29] Casa Alianza director Manuel Capellin is quoted as saying, \"More than 16,000 children are sexually exploited through networks involving foreigners and military, police, government and business officials.\"[30] Sex trafficking [edit]Mexico is a source, transit, and destination country for women and children subjected to sex trafficking. Groups considered most vulnerable to human trafficking in Mexico include women, children, indigenous persons, persons with mental and physical disabilities, migrants, and LGBTI individuals. Mexican women and children, and to a lesser extent men and transgender individuals, are exploited in sex trafficking in Mexico and the United States. Transgender Mexicans in commercial sex are vulnerable to sex trafficking. Residents at substance addiction rehabilitation centers and women's shelters have been subjected to sex trafficking.[31] Young female migrants recounted being robbed, beaten, and raped by members of criminal gangs and then forced to work in table dance bars or as prostitutes under threat of further harm to them or their families.[32] A big part of the reason that so many young women under the age of 18 are getting trafficked is largely due to the fact that there's a lack of identifiable reasons that a victim would be at risk since the population is hidden in nature.[33] However, lack of literacy and awareness, growing up in high poverty area, and traveling/migrating alone can put individuals at high risk for being trafficked. The majority of non-Mexican trafficking victims come from Central America; lesser numbers come from Brazil, Cuba, Ecuador, China, Taiwan, South Korea, India, Uruguay, and Eastern European countries. Victims are also trafficked to the United States.[32] The United States Department of State Office to Monitor and Combat Trafficking in Persons ranks Mexico as a 'Tier 2' country (\"does not fully meet the minimum standards for the elimination of trafficking; however, it is making significant efforts to do so\").[34] See also [edit]References [edit]- ^ \"Sex Work Law - Countries\". Sexuality, Poverty and Law. Archived from the original on 2018-04-25. Retrieved 22 April 2018. - ^ Weitzer, Ronald. 2013. Legalizing Prostitution: From Illicit Vice to Lawful Business. (Excerpt) - ^ Weitzer, Ronald (29 October 2013). \"Mexico's State-Run Brothel Shows Us The Benefits Of Making Prostitution Legal\". Business Insider. Retrieved 22 April 2018. - ^ Kelly 2008, p. 126. - ^ \"Elderly ex-prostitutes\". Reuters. 2007-10-26. - ^ \"Sex workers: Population size estimate - Number, 2016\". www.aidsinfoonline.org. UNAIDS. Archived from the original on 4 June 2019. Retrieved 21 July 2018. - ^ Jimenez, Ulises Chavez (2004). \"How much for your love: prostitution among the Aztecs\". www.academia.edu. Retrieved 16 December 2019. - ^ Elferink, Jan G. R. (2000). \"Aphrodisiac Use in Pre-Columbian Aztec and Inca Cultures\". Journal of the History of Sexuality. 9 (1/2): 25–36. ISSN 1043-4070. JSTOR 3704630. - ^ Bruhns, Karen Olsen; Stothert, Karen E. (1999). Women in Ancient America. University of Oklahoma Press. p. 156. ISBN 978-0-8061-3169-6. - ^ Dalla, Rochelle L.; Baker, Lynda M.; Defrain, John; Williamson, Celia (2011). Global Perspectives on Prostitution and Sex Trafficking: Europe, Latin America, North America, and Global. Lexington Books. p. 124. ISBN 978-0-7391-4387-2. - ^ a b c d Bliss, Katherine Elaine (24 February 2004). \"A Right to Live as Gente Decente : Sex Work, Family Life, and Collective Identity in Early-Twentieth-Century Mexico\". Journal of Women's History. 15 (4): 164–169. doi:10.1353/jowh.2004.0005. S2CID 145413597. - ^ Overmyer-Velazquez 2006, pp. 99, 152. - ^ Overmyer-Velazquez 2006, p. 152. - ^ Bliss 2002, p. 37. - ^ Gabbert, Ann R. (2003). \"Prostitution and Moral Reform in the Borderlands: El Paso, 1890-1920\". Journal of the History of Sexuality. 12 (4): 575–604. doi:10.1353/sex.2004.0028. ISSN 1535-3605. S2CID 162153371. - ^ Schantz 2001, p. 551. - ^ a b Izcara Palacios, Simón Pedro (November 2017). \"Prostitution and Migrant Smuggling Networks Operating between Central America, Mexico, and the United States\". Latin American Perspectives. 44 (6): 31–49. doi:10.1177/0094582X17699910. ISSN 0094-582X. S2CID 220065041. - ^ Steffanie A. Strathdee et al., \"Characteristics of Female Sex Workers with U.S. Clients in Two Mexico-U.S. Border Cities\", Sexually Transmitted Diseases 35 (2008): 3. - ^ Kelly 2008, p. 4. - ^ Campbell 2007, p. 267. - ^ Mendieta-Izquierdo, Giovane (May 2018). \"Percepción de cuerpo y corporalidad en hombres que ejercen prostitución viril en Guadalajara, México\". Ciência & Saúde Coletiva. 23 (5): 1541–1549. doi:10.1590/1413-81232018235.18652016. ISSN 1678-4561. PMID 29768608. - ^ Castillo, Debra A.; Delgado, Bonnie (January 1999). \"Border Lives: Prostitute Women in Tijuana\". Signs: Journal of Women in Culture and Society. 24 (2): 387–422. doi:10.1086/495345. hdl:1813/31945. ISSN 0097-9740. S2CID 144613670. - ^ a b c Godoy, Emilio (13 August 2007). \"RIGHTS-MEXICO: 16,000 Victims of Child Sexual Exploitation\". IPS News. Archived from the original on 14 August 2007. Retrieved 22 April 2018. - ^ \"Gateways to exploitation\". The Globe and Mail. 2009-10-20. Archived from the original on April 7, 2012. - ^ \"MEXICO: Key Video Evidence Blocked in Child Sex Ring Trial\". Inter Press Service. 2009-10-20. Archived from the original on 2011-06-11. - ^ \"Payán: Thousands abused each year\". El Universal. 2009-10-20. Archived from the original on 2012-02-27. - ^ Goldenberg, Shira M.; Silverman, Jay G.; Engstrom, David; Bojorquez-Chapela, Ietza; Usita, Paula; Rolón, María Luisa; Strathdee, Steffanie A. (April 2015). \"Exploring the Context of Trafficking and Adolescent Sex Industry Involvement in Tijuana, Mexico: Consequences for HIV Risk and Prevention\". Violence Against Women. 21 (4): 478–499. doi:10.1177/1077801215569079. ISSN 1077-8012. PMC 4703414. PMID 25648946. - ^ Davis, Kristina. \"'Brand new, recently stolen': Inside Tijuana's sex tourism trade of young children\". - ^ \"Mexico 2014 Trafficking in Persons Report\". U.S. Department of State. Retrieved 4 August 2018. This article incorporates text from this source, which is in the public domain. - ^ Gutman, W. E. (30 December 2010). \"Sex Tourism Threatens Central America's Youth\". Latin America Bureau. Retrieved 4 August 2018. - ^ \"Mexico 2017 Trafficking in Persons Report\". U.S. Department of State. Archived from the original on 3 July 2017. Retrieved 22 April 2018. - ^ a b \"2008 Human Rights Report: Mexico\". Bureau of Democracy, Human Rights, and Labor. U.S. Department of State. 2009-02-25. Archived from the original on 2009-02-26. Retrieved 20 October 2009. - ^ Boyce, Sabrina C.; Brouwer, Kimberly C.; Triplett, Daniel; Servin, Argentina E.; Magis-Rodriguez, Carlos; Silverman, Jay G. (August 2018). \"Childhood Experiences of Sexual Violence, Pregnancy, and Marriage Associated With Child Sex Trafficking Among Female Sex Workers in Two US–Mexico Border Cities\". American Journal of Public Health. 108 (8): 1049–1054. doi:10.2105/AJPH.2018.304455. ISSN 0090-0036. PMC 6050823. PMID 29927652. - ^ \"Mexico 2018 Trafficking in Persons Report\". U.S. Department of State. Archived from the original on 29 July 2018. Retrieved 26 July 2018. Further reading [edit]- Bliss, Katherine Elaine (2002), Compromised Positions: Prostitution, Public Health, and Gender Politics in Revolutionary Mexico City, Penn State Press, ISBN 978-0271041339 - Campbell, Howard (1 September 2007), \"Cultural Seduction: American Men, Mexican Women, Cross-border Attraction\", Critique of Anthropology, 27 (3): 261–283, doi:10.1177/0308275X07080356, ISSN 0308-275X, S2CID 145194004 - Kelly, Patty (2008), Lydia's Open Door: Inside Mexico's Most Modern Brothel, University of California Press, ISBN 9780520941618 - Overmyer-Velazquez, Mark (2006), Visions of the Emerald City: Modernity, Tradition, and the Formation of Porfirian Oaxaca, Mexico, Duke University Press, ISBN 9780822337775 - Schantz, Eric Michael (2001), \"All Night at the Owl: The Social and Political Relations of Mexicali's Red-Light District, 1913-1925\", Journal of the Southwest, 43 (4): 549–602, JSTOR 40170171, PMID 20039492"
}