{
  "url": "https://www.finncorp.com/",
  "title": "Finn HydroSeeders & Equipment - Finn Corporation",
  "text": "Parts FINN and your authorized FINN parts distributors work as a team to keep your equipment operating efficiently for maximum equipment uptime. You’re assured the knowledge and expertise of the manufacturer via the personalized service of your local parts professionals in the FINN dealer network. Customer support after machine purchase is what sets FINN and our dealer network apart from others. We understand its importance and have systems in place to ensure that you remain confident in your decision to partner with FINN equipment, materials, and services. What Our Customers Are Saying \"I switched to Finn from a competitor's machine. Initially I had reservations about the unit not being a gear pump but boy was I wrong!!! My T120 shoots and lays hydromulch smoother and faster than any machine we've ran before. This means more productivity, better results, and more money in my pocket!! I'm a convert - Finn for life!! PS - They make great Christmas Parade Floats too!!!\" Logan Arthur Finn T30E Electric Hydroseeder Walkaround About Finn Corporation Environmental Stewardship FINN and your authorized FINN parts distributors work as a team to keep your equipment operating efficiently for maximum equipment uptime. You’re assured the knowledge and expertise of the manufacturer via the personalized service of your local parts professionals in the FINN dealer network. Smarter Way to Work Our company is known for innovation, dependability, and industry leading product support. We pride ourselves on manufacturing products that give you the ability to work more profitably by completing more jobs for less cost than ever before. We think it’s a Smarter Way to Work. Global Dealer Network Today, FINN Corporation has a worldwide presence with more than 175 North American dealer and service locations, plus others in Australia, South America, Africa and Europe. Even as our network continues to expand, we will not forget our humble beginnings and our Midwestern roots."
}