{
  "url": "https://finance.yahoo.com/quote/CARR/",
  "title": "Carrier Global Corporation (CARR) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "Carrier Global Corporation (CARR) News headlines Carrier Global Corporation (CARR) faces challenges with declining earnings and revenue forecasts, but recent innovations in HVAC technology and positive industry trends may provide some optimism. Analysts are cautious, expecting a decline in quarterly earnings, while industry reports highlight significant market growth potential. Carrier Global Corporation (CARR) faces challenges with declining earnings and revenue forecasts, but recent innovations in HVAC technology and positive industry trends may provide some optimism. Analysts are cautious, expecting a decline in quarterly earnings, while industry reports highlight significant market growth potential. - Previous Close 60.36 - Open 60.13 - Bid 60.63 x 20000 - Ask 60.64 x 20000 - Day's Range 60.13 - 61.37 - 52 Week Range 50.24 - 81.09 - Volume 4,604,192 - Avg. Volume 7,412,322 - Market Cap (intraday) 51.487B - Beta (5Y Monthly) 1.34 - PE Ratio (TTM) 37.81 - EPS (TTM) 1.60 - Earnings Date Feb 5, 2026 - Forward Dividend & Yield 0.96 (1.59%) - Ex-Dividend Date Jan 20, 2026 - 1y Target Est 70.54 Carrier Global Corporation provides intelligent climate and energy solutions in the United States, Europe, the Asia Pacific, and internationally. It operates in two segments, Heating, Ventilating and Air Conditioning (HVAC), and Refrigeration. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, building automation systems, aftermarket components, and repair and maintenance services and rentals, as well as modernization and upgrades. The Refrigeration segment offers transport refrigeration and monitoring products, services, and digital solutions for trucks, trailers, shipping containers, and intermodal and rail applications. The company offers its products under the Carrier, Viessmann, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, Riello, Carrier Transicold, and Sensitech brands. The company was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida. www.corporate.carrier.com48,000 Full Time Employees December 31 Fiscal Year Ends Sector Industry Recent News: CARR View MorePerformance Overview: CARR Trailing total returns as of 2/3/2026, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) . YTD Return 1-Year Return 3-Year Return 5-Year Return Earnings Trends: CARR View MoreAnalyst Insights: CARR View MoreStatistics: CARR View MoreValuation Measures Market Cap 50.36B Enterprise Value 61.27B Trailing P/E 37.37 Forward P/E 19.92 PEG Ratio (5yr expected) 16.61 Price/Sales (ttm) 2.38 Price/Book (mrq) 3.47 Enterprise Value/Revenue 2.78 Enterprise Value/EBITDA 14.55 Financial Highlights Profitability and Income Statement Profit Margin 18.05% Return on Assets (ttm) 3.81% Return on Equity (ttm) 9.98% Revenue (ttm) 22.06B Net Income Avi to Common (ttm) 1.38B Diluted EPS (ttm) 1.60 Balance Sheet and Cash Flow Total Cash (mrq) 1.42B Total Debt/Equity (mrq) 83.16% Levered Free Cash Flow (ttm) 2.5B Compare To: CARR Select to analyze similar companies using key performance metrics; select up to 4 stocks. Company Insights: CARR Fair Value Dividend Score Hiring Score Insider Sentiment Score Research Reports: CARR View MoreDaily – Vickers Top Buyers & Sellers for 11/26/2025 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Carrier: Dropping Coverage Carrier Global provides HVAC and refrigeration products and services that serve the global residential, commercial, and transportation markets. The company's HVAC businesses account for approximately 85% of consolidated revenue, with residential and light commercial HVAC and commercial HVAC representing about 60% and 25% of total revenue, respectively. Carrier's refrigeration segment, which accounts for approximately 15% of consolidated revenue, consists of its transportation refrigeration and Sensitech supply chain monitoring products and services. RatingPrice TargetValue opportunity Carrier Global Corp., formerly part of United Technologies (which has now merged with Raytheon Technologies Corp.), provides HVAC, refrigeration, and building automation technologies worldwide. The company is based in Palm Beach Gardens, Florida and has 48,000 employees. The CARR shares are a component of the S&P 500. RatingPrice TargetWith each passing day, the market's engine keeps losing one cylinder after With each passing day, the market's engine keeps losing one cylinder after another -- yet somehow, the major indices keep barreling ahead. The eight-cylinder market is down to four cylinders and that configuration will be severely tested this week. On Tuesday, the S&P 500 added 0.3%, the Nasdaq 0.9%, and the Nasdaq 100 0.8% -- but the only rising sector was Information Technology (XLK), with a 1% gain. Big Tech was fueled by semiconductors (NVDA +5%, AVGO +3%, TSM +1%) and software (MSFT +2%). Different day, same story! The rest of the market didn't participate, as eight of the 11 S&P 500 sectors fell 0.5% to 2.2%. Real Estate was the biggest loser, followed by Utilities, Energy, Staples, Industrials, Financials, Healthcare, and Communication Services. NYSE decliners led advancers by 700 issues, while advancers/total issues were only 37% and up volume/total volume was a mere 39%. Once a security moves to all-time high territory, there is no chart resistance or overhead supply. So without an upside target based on prior resistance, how does a technician come up with a reasonable upside projection? The first way is to take the depth of the latest major market downtrend, which in this case was in 2022. For the S&P 500, that was 1,327 points. An initial target, and one we discussed, was adding the depth to the breakout level of 4,819, which equaled 6,146. As that has passed, we can use Fibonacci extension targets, with the first being a move of 1.27 times 1,327, which is then added to 4,819 and equals 6,504 (also passed). That scenario is then followed by 1.618-times the depth, plus 4,819, with the target becoming 6,966. And even that has almost been hit. (Mark Arbeter, CMT)"
}