{
  "url": "https://us.bic.com/en_us/design-my-bic-lighters-set-of-6-personalized-lighters.html",
  "title": "Design My BIC Lighters, Set of 6 Personalized Lighters - BIC",
  "text": "Design My BIC® Lighters, Set of 6 Personalized Lighters In stock - Buy 1 Set for $29.99 ea - Buy 2-3 Sets for $28.99 ea - Buy 4-7 Sets for $27.99 ea - Buy 8-11 Sets for $26.99 ea - Buy 12-23 Sets for $25.99 ea - Buy 24-35 Sets for $24.99 ea - Buy 36-47 Sets for $23.99 ea - Buy 48+ Sets for $22.99 ea Need more than 48 ? Click here to visit our BIC Logo Lighter site. Description Unleash your creativity with Design My BIC Custom Lighters. These personalized gifts make every moment special, whether it's a birthday gift, groomsmen gifts, or birthday gifts for her. Each lighter is crafted with precision, undergoing more than 50 separate, automatic quality checks during manufacturing to ensure they are safe and reliable. With up to 3,000 lights per lighter, you'll enjoy more memorable moments with friends and family*. Plus, these lighters offer up to 2 times the lights compared to the next full-size leading brand**. Imagine the possibilities for weddings, anniversaries, or any special occasion. With BIC, you can design your own lighters by uploading photos, choosing backgrounds, and adding text and clip art. It's a fun and unique way to express yourself. These lighters are not just practical; they're a creative outlet and a conversation starter. Buy more lighters to save more and light up your world with style. *vs. the next full-size leading brand **vs. the next full-size leading brand - WHAT'S INCLUDED: Pack of six (6) custom lighters with the design on each - PERSONALIZED GIFTS: Design your own lighters for birthdays, weddings, anniversaries, holidays, graduations, just because or any special occasion - OVER 300 CREATIVE WAYS TO CUSTOMIZE: Upload your own photos, choose fun backgrounds or templates and add text and clip art for a perfect custom creation - LONG LASTING: Offers 2 times the lights vs. the next full-size leading brand - SAFETY FIRST: Every BIC lighter is 100% quality inspected and undergoes more than 50 separate, automatic quality checks during the manufacturing process - LEAD TIME: Please allow a minimum of 2-4 weeks for processing and shipping. Personalized orders cannot be canceled. HOLIDAY DELIVERY DISCLAIMER: Orders may arrive after Christmas. - WARNING LABEL: Each lighter has a warning label cannot be removed. Please take this into consideration when designing your lighter - QR CODE: A small nonremovable QR code will be printed below the warning label. This is for internal artwork tracking purposes. Characteristics Reviews"
}