{
  "url": "https://pietrosdining.com/italian-restaurant-dinner-menu/",
  "title": "Italian Restaurant Dinner Menu - Pietro's Restaurant",
  "text": "Dinner Menu Online Ordering Available APPETIZERS TOASTED RAVIOLI | $12.50 A St. Louis Original TOASTED SPINACH BALLS | $12.50 Seasoned in breadcrumbs and fried to perfection, our original recipe combines spinach, parmesan cheese, and egg BREADED ARTICHOKE HEARTS | $12.50 BREADED ZUCCHINI | $12.50 COMBINATION PLATTER | $15.50 Four of each: Toasted Ravioli, Zucchini, Artichoke Hearts and Spinach Balls FLATBREAD FLORENTINE | $15.50 Crisp shell topped with Pomodoro sauce, cheese, spinach and caramelized onions FRIED MOZZARELLA WEDGES | $12.50 Made in house, fried golden brown GARLIC CHEESE BREAD | LG $12.50 | SM $9.50 Baked Italian bread seasoned with garlic and cheese FRENCH FRIED ONION RINGS | $12.50 Made from scratch, using our own batter, fried golden brown CHICKEN WINGS | $15.50 Tossed in hot sauce ITALIAN ANTIPASTO | $15.50 Italian Salami, cheese, peppers, olives and anchovies SOUP OF THE DAY | $7.50 SALADS DINNER SALAD | $7.50 CHEF’S SPECIAL SALAD | $15.50 Fresh greens, topped with grilled chicken, cheese, croutons and tomatoes COBB SALAD | $15.50 Ham, turkey, bacon, egg, with crumbled Blue cheese and cheddar on a bed of lettuce, with your choice of dressing COMBINATION SALAD | $14.50 Lettuce, salami, cheese, onions, olives and tomato PIETRO’S SPECIAL SALAD | $15.50 A meal in itself with lettuce, tomato, onions, salami, mushrooms, cheese, anchovy and olives SPINACH SALAD | $15.50 Garden spinach with shrimp, egg, bacon, fresh mushrooms, cheese and croutons, topped with our special dressing CHICKEN CHICKEN PIETRO | $23.95 Breast of chicken in seasoned breadcrumbs, grilled in a white wine and fresh mushroom sauce CHICKEN SALTIMBOCCA | $23.95 Lightly battered breast, baked with cheese and prosciutto, in a white wine and sage sauce CHICKEN MARIA | $23.95 Lightly battered breast, topped with Surimi crab, asparagus and mushrooms in a light wine sauce CHICKEN PARMIGIANA | $23.95 Breast of chicken in seasoned breadcrumbs, baked with meat sauce and cheese CHICKEN MARSALA | $23.95 Grilled in seasoned breadcrumbs, served in a Marsala wine sauce with green peppers, tomatoes and fresh mushrooms HALF FRIED CHICKEN | $19.95 All chicken entrees include salad, and choice of potato or pasta PASTA BAKED LASAGNA | $18.50 Noodles layered with meat, topped with cheese CANNELLONI | $18.50 Baked in meat sauce, topped with a cream sauce SPAGHETTI OR MOSTACCIOLI | $15.50 Homemade with meat sauce With meatballs add $3.00 THREE WAY PASTA COMBINATION | $18.50 Ravioli, mostaccioli and meatballs in meat sauce RAVIOLI WITH MEAT SAUCE | $16.75 Baked with cheese add $1.50 PASTA POMODORO | $17.50 Bow tie noodles in our homemade tomato, onion and mushroom sauce PASTA PERONI | $18.95 Bow tie noodles with chicken and sweet peppers, tossed in Pomodoro sauce FETTUCCINE | $19.50 Egg noodles with butter, cream and Parmesan sauce PASTA GIOVANNI | $18.95 Penne noodles tossed in Pomodoro sauce, with spinach and salsiccia PASTA PISELLI | $17.50 Bow tie noodles with snap peas tossed with olive oil and garlic PASTA PRIMAVERA | $17.95 Penne noodles tossed in olive oil and garlic with fresh vegetables PASTA FLORENTINE | $17.95 Linguine noodles with spinach and prosciutto, tossed with olive oil and garlic PASTA ROSA | $19.50 Penne noodles in cream sauce with a touch of tomato sauce, chicken, peas and mushrooms FETTUCCINE CARBONARA | $19.95 Egg noodles in cream sauce with bacon and prosciutto PASTA CON BROCCOLI | $19.50 Cavatelli noodles in a cream sauce with broccoli and mushrooms TORTELLINI | $19.95 Stuffed pasta noodles filled with meat, in a cream sauce with prosciutto, peas and mushrooms LINGUINE WITH CLAMS | $20.25 Served in a light cream or tomato sauce PASTA TUTTO MARE | $22.95 Linguine with shrimp, scallops, clams, Surimi crab and mushrooms, in a light cream or tomato sauce Add Dinner Salad to any pasta $3.95 DINNERS TENDERLOINS OF BEEF SOTTO | $28.95 Lightly breaded fillet medallions, topped with prosciutto, cheese and mushrooms, in a white wine sauce TENDERLOINS OF BEEF OSCAR | $28.95 Lightly breaded fillet medallions topped with Surimi crab, mushrooms and asparagus, in a light wine sauce TENDERLOINS OF BEEF BORDELAISE | $28.95 Lightly breaded fillet medallions, in a red wine mushroom sauce TENDERLOINS OF BEEF MARSALA | $28.95 Lightly breaded fillet medallions in a Marsala wine sauce, with peppers and mushrooms CENTER CUT PORK CHOPS | $24.95 Two chops, broiled or fried CHOPPED BEEF TENDERLOIN | $19.95 Broiled and topped with mushroom gravy All dinner entrées include salad, and choice of potato or pasta SEAFOOD GRILLED GROUPER | $22.95 Seasoned with Italian breadcrumbs GRILLED GROUPER PRIMAVERA | $23.95 Seasoned breadcrumbs, topped with sautéed vegetables SHRIMP SCAMPI | $24.50 Grilled in lightly seasoned breadcrumbs, garlic and butter JUMBO FRIED SHRIMP | $24.50 GRILLED SALMON FILLET | $24.95 GRILLED SALMON PRIMAVERA | $25.95 Topped with sautéed vegetables FILLET OF FISH DINNER | $23.95 Breaded and fries FILLET OF FISH SEBASTIAN | $25.95 Lightly battered cod in a creamy seafood sauce with mushrooms Seafood entrées include salad, and choice of potato or pasta VEAL VEAL CUTLETS PARMIGIANA | $26.95 Breaded cutlets baked with meat sauce and cheese VEAL ALA GIOVANNI | $26.95 Breaded cutlets topped with white wine and fresh mushroom sauce VEAL CUTLETS | $26.95 Choice breaded veal served with meat sauce VEAL PICATTA | $26.95 Sautéed in a white wine and lemon sauce VEAL SALTIMBOCCA | $26.95 Sautéed with prosciutto and cheese in a white wine sauce VEAL MARSALA | $26.95 Sautéed in a Marsala wine sauce with peppers and fresh mushrooms VEAL PARMIGIANA | $21.95 Chopped veal topped with meat sauce and cheese VEAL ALA PIETRO | $21.95 Chopped veal cutlet topped with white wine and fresh mushroom sauce Veal entrées include salad, and choice of potato or pasta STEAKS FILET MIGNON | $40.95 8 oz. choice tenderloin SIRLOIN STRIP | $40.95 12 oz. boneless sirloin Steak entrées include salad, and choice of potato or pasta SANDWICHES HAMBURGER | $14.50 10 oz. certified Angus beef charbroiled on bun PIETRO’S FAMOUS FISH SANDWICH | $15.50 Freshly breaded, served with our homemade tartar sauce ROAST BEEF | $15.95 Sliced sirloin served with au jus CHICKEN RANCHERO SANDWICH | 15.50 Grilled marinated breast topped with cheese, lettuce and ranch dressing on a toasted garlic bun VEAL PARMIGIANA | $15.50 Chopped cutlet topped with meat sauce and cheese CHICKEN SANDWICH | $15.50 Grilled, topped with cheese and ham on a bun REUBEN SANDWICH | $15.50 Corned beef, Swiss cheese and sauerkraut, topped with Thousand Island dressing on rye SALSICCIA SANDWICH | $15.50 Grilled Italian sausage topped with meat sauce “BURNES SPECIAL” | $15.95 Grilled sirloin seasoned with garlic, topped with cheese ITALIAN MEATBALL | $15.50 Layered with meat sauce and cheese TURKEY AND BACON CLUB | $15.50 Triple decker sandwich on toast with lettuce, tomato and mayonnaise CLASSIC OPEN FACE BEEF | $15.95 Sliced sirloin of beef on white bread, topped in a rich brown gravy DELUXE STEAK SANDWICH | $17.95 Grilled sirloin with French fries or pasta, and dinner salad DELUXE HAMBURGER PLATTER | $16.95 10 oz. charbroiled burger with French fries or pasta, and dinner salad Sandwiches include choice of one: salad, coleslaw, pasta, or French fries Add cheese to any sandwich for $1.00 PIZZA BASIC CHEESE 12″ Small 14″ Large GREEN PEPPER 12″ Small 14″ Large ONION 12″ Small 14″ Large SAUSAGE 12″ Small 14″ Large BACON 12″ Small 14″ Large MUSHROOM 12″ Small 14″ Large PEPPERONI 12″ Small 14″ Large HAMBURGER 12″ Small 14″ Large BLACK OLIVE 12″ Small 14″ Large Add additional items for $2.00 SPECIALTY PIETRO’S DELUXE Topped with sausage, onion, pepperoni, mushroom, bacon and green peppers 12″ Small 14″ Large VEGETARIAN PIZZA Topped with broccoli, asparagus, mushrooms, sweet peppers, onions and black olives 12″ Small 14″ Large PIETRO’S ALL MEAT Topped with sausage, hamburger, bacon and pepperoni 12″ Small 14″ Large All pizzas topped with St. Louis Style pizza cheese. Mozzarella cheese available upon request. PIZZA BASIC 12” Small 14” Large CHEESE GREEN PEPPER ONION SAUSAGE BACON MUSHROOM PEPPERONI HAMBURGER BLACK OLIVE $16.50 $18.50 $18.50 $18.50 $18.50 $18.50 $18.50 $18.50 $18.50 $17.95 $19.95 $19.95 $19.95 $19.95 $19.95 $19.95 $19.95 $19.95 Add additional item $2.00 SPECIALTY 12” Small 14” Large PIETRO’S DELUXE Topped with sausage, onion, pepperoni, mushroom, bacon and green peppers VEGETARIAN PIZZA Topped with broccoli, asparagus, mushrooms, sweet peppers, onions and black olives PIETRO’S ALL MEAT Topped with sausage, hamburger, bacon and pepperoni $21.95 $21.95 $21.95 $23.95 $23.95 $23.95 All pizzas topped with St. Louis Style pizza cheese. Mozzarella cheese available upon request. CHILDREN’S MENU CHICKEN TENDERS & FRIES | $8.95 SPAGHETTI & MEATBALL | $8.95 HOT DOG & FRIES | $8.95 TOASTED RAVIOLI (5) & FRIES | $8.95 For children 10 and under."
}