{
  "url": "https://word.cloud.microsoft/create/pt-br/document-editor/",
  "title": "Editor de documentos online: editor gratuito online no Microsoft Word | Microsoft Word",
  "text": "Editor de documentos online Crie e edite documentos na Web no Microsoft Word e armazene-os online para acessar em qualquer lugar. Crie documentos online com controle total e sem necessidade de downloads Acesse a gama completa de recursos de edição no Word de qualquer lugar, incluindo modelos populares de documentos, revisão ortográfica e ferramentas de reescrita com IA.Colabore com outras pessoas em tempo real para criar seu melhor trabalho. Editar documentos online com o Word Crie documentos populares com facilidade, desde currículos e cartas de apresentação até cartas comerciais e novos planos de negócios com o Word.Utilize os recursos padrão do Word para o setor, incluindo formatação profissional, tabelas, revisão, coautoria em tempo real, modelos e compatibilidade com outros aplicativos do Microsoft 365. Veja a contagem de palavras do documento rapidamente Verifique sua contagem de palavras a qualquer momento no canto inferior esquerdo da sua tela.Selecione o contador de palavras para obter estatísticas mais detalhadas, como contagem de caracteres, tempo necessário para ler ou apresentar seu conteúdo, e índices de legibilidade Flesch-Kincaid. Garanta a ortografia correta em mais de 20 idiomas Permita que o verificador ortográfico do Word corrija quaisquer erros de ortografia no seu idioma.Clique em uma palavra sublinhada em vermelho para ver várias sugestões ou sinônimos, e desconsidere nomes ou termos coloquiais que foram marcados. Aprimore sua escrita com gramática correta Apresente-se da melhor forma com o verificador gramatical do Word.Selecione as sugestões sublinhadas em azul para melhorar sua gramática enquanto escreve.Você também pode selecionar um estilo de escrita formal, profissional ou casual dentro do Editor para receber sugestões mais personalizadas.Também há opções para selecionar formal, profissional ou casual dentro do Editor para influenciar as sugestões. Aproveite as ferramentas de reescrita e resumo com IA do Copilot Use o Copilot para obter sugestões inteligentes de edição no Word, se você for assinante do Microsoft 365.O Copilot pode ajudar você a superar o bloqueio criativo ou melhorar seu documento com ferramentas rápidas como reescrita automática, tornar o texto mais curto, sugestões de orientação ou visualização do conteúdo como tabela.Se você não for assinante, pode experimentar o Copilot em https://copilot.microsoft.com/ Comece com modelos profissionais Dê um impulso ao seu documento selecionando entre uma ampla variedade de modelos de documentos do Word, incluindo cartas, brochuras, cartas de apresentação e muitos outros.Com alguns cliques, você pode escolher seu modelo favorito, modificar a paleta de cores e inserir seu conteúdo. Colabore online e compartilhe com o OneDrive Compartilhe seu documento com colaboradores pelo OneDrive quando estiver pronto.Você pode dar acesso a outras pessoas para visualizar ou editar o documento, e verá quando elas fizerem alterações ou adicionarem comentários.Várias pessoas podem editar ao mesmo tempo em qualquer navegador, e não precisam da versão desktop do Word para colaborar no seu documento. Como editar e compartilhar documentos online com o Word Visite o Microsoft Word e cadastre-se para uma conta Microsoft gratuita, se ainda não tiver uma. Comece com um documento em branco ou navegue e selecione um modelo da biblioteca para usar. Para colaborar, selecione Compartilhar e copie o link ou envie-o diretamente por email pelo Word. Nas configurações do link, decida se deseja conceder acesso de visualização ou edição. Após compartilhar, selecione Gerenciar acesso para ver colaboradores ou excluir links compartilhados. Perguntas frequentes Como editar um documento no Word online? Comece fazendo upload do seu documento no Microsoft Word em um navegador.Após carregar, clique no arquivo no seu navegador para abri-lo em uma aba do Word online.O Word pode abrir arquivos .docx online automaticamente ou converter PDFs em documentos do Word editáveis. Você pode abrir PDFs no Word online? Você pode converter PDFs baseados em texto em documentos do Word e visualizá-los ou editá-los online.Primeiro, faça upload de um PDF para o OneDrive e, em seguida, abra-o para visualizá-lo temporariamente.Selecione Abrir na Área de Trabalho e o Word converterá o PDF em um documento do Word.Selecione Editar na próxima janela para abrir o documento no Word para a web (não é necessário o aplicativo desktop). Os documentos digitalizados podem ser editados? O Word pode editar documentos digitalizados que estão no formato PDF.O Word pode editar documentos digitalizados que estejam no formato PDF.Fique atento(a) que a formatação pode ficar diferente dependendo da qualidade da digitalização. Preciso da versão para desktop do Word? Você pode carregar os documentos no OneDrive ou no Microsoft Word e editá-los totalmente online.Por exemplo, se você receber um arquivo .docx por email, pode acessar o Microsoft Word e carregar direto, sem precisar abrir no seu computador."
}