{
  "url": "https://www.dictionary.com/browse/stare",
  "title": "STARE Definition & Meaning | Dictionary.com",
  "text": "stare Americanverb (used without object) - to gaze fixedly and intently, especially with the eyes wide open. - to be boldly or obtrusively conspicuous. The bright modern painting stares out at you in the otherwise conservative gallery. - to be patently or compellingly obvious. The stark, staring fact is, you can't do something with nothing. - (of hair, feathers, etc.) to stick out or stand on end; bristle. Both male and female pheasants are rough-footed and have staring feathers around the head and neck. verb (used with object) - to stare at. to stare a person up and down. - to effect or have a certain effect on by staring. They all laughed at me and stared me into silence. noun verb phrase idioms - stare (something) in the face, to confront or be confronted by (something unpleasant). The company is staring bankruptcy in the face. - stare one in the face, - (especially of something undesirable) to be patently or compellingly obvious. Sounds like a far-fetched theory, but when the evidence is staring you in the face, you have to take notice. - to be urgent or impending; be about to happen. The income tax deadline is staring us in the face. - - staring down the barrel of, - having (a firearm) aimed at one, especially at close range. He turned his head and found himself staring down the barrel of a rifle. - facing (a threat, challenging situation, or imminent disaster). Motorists are staring down the barrel of a major hike in the price of fuel. - verb - to look or gaze fixedly, often with hostility or rudeness - (intr) (of an animal's fur, bird's feathers, etc) to stand on end because of fear, ill health, etc - (intr) to stand out as obvious; glare - to be glaringly obvious or imminent noun noun Related Words See gaze. Other Word Forms - starer noun Etymology Origin of stare First recorded before 900; Middle English staren, Old English starian; cognate with Dutch staren, German starren, Old Norse stara; akin to stark, starve Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. Sarah told the documentary: \"I sat three metres away from her. She looked at me a dozen times, staring. Every time she looked at me I'd have to look down.\" From BBC I try to silence her with a stare, like Michelle does to just about everyone, but Pua merely smiles back and I end up giving in. From Literature On the ground, people stared up and wondered at the noise, but they couldn’t see anything. From Literature Her eye contact hardly wavered during the performance, her eyes often wide as they stared directly into the camera. From Los Angeles Times Of course those activities are \"a good thing\" she says, but they won't make up for sitting all day at work staring at a screen or spending the evening slouching on the couch. From BBC Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}