{
  "url": "https://forums.dukebasketballreport.com/index.php?threads/wbb-west-virginia-57-duke-49-november-14-2025.52209/page-3",
  "title": "WBB: West Virginia 57, Duke 49 (November 14, 2025) | Page 3 | Duke Basketball Report",
  "text": "Here are the numbers from this evening's game against the West Virginia Mountaineers at The Greenbrier Resort Ballroom: OFFENSE Possessions: 72.6 (pretty fast) oRtg: 0.675 (putrid; adj. 0.788, that would be 361st (3rd-to-last) in all of DI) eFG%: 39.3% (terrible) 3pt%: 16.7% (very terrible) 2pt%: 43.2% (bad) %three: 21.4% (low, but OK) FT rate: 19.6% (very bad) OR%: 20.5% (very bad) TO%: 28.9% (terrible) a/to: 0.714 (very bad) %assisted: 71.4% (finally, something we did well) fast break pts: 12 (24.5%) (pretty good) DEFENSE dRtg: 0.785 (0.644 adj., unadjusted would still be about 12th, adjusted is #1) deFG%: 39.4% (decent) 3pt%: 20% (excellent) 2pt%: 43.8% (only OK) %threes: 31.9% (too many, as it's one thing we knew we should try to take away) FT rate: 55.3% (what's worse than putrid?) DR%: 83.3% (outstanding, almost phenomenal; would have been second-best all of last season) TO%: 24.8% (really good) a/to: 0.611 (very good) %assisted: 64.7% (bad) stl%: 11.0% (bad) blk%: 12.5% (good) fast break pts: 4 (7.0%) (great) I don't have the numbers if we didn't play the 3rd quarter, but that one quarter was clearly the downfall. Quarter-by-quarter, WVU's scoring was 11, 9, 24, 13. Basically, they scored 11 more points in that quarter than in any other quarter, and the difference in the game was only 8. Just play normal defense in that quarter, and we win, despite our offensive woes. But we were so much wrapped up in the polite crowd turning against us and in our opponent being down to 5 players that we just didn't play basketball in the 3rd quarter. We came out much more ready to go in the 4th quarter, but even there, it took us 3 or 4 minutes to really get desperate and focus completely on the game instead of on ourselves, on the opponent, on the officials, and on the crowd. We just let all the distractions get inside our heads. We really only had two players keep it together and just play, and they were Taina and Arianna. A senior and a freshman. Go figure. By the time everyone else recovered, it was too late and WVU played disciplined, possession basketball to salt away a win they did well to earn. But Jordan needs to run a bunch of laps or something. This entire thing was her fault, and it comes on the heels of her doing something similar last game, too. She can be such a good player, but she needs to bottle up that urge to retaliate. She did a pretty good job the second time it became an issue versus Norfolk State. But not tonight. That outburst literally lost the game for us. Sorry to be so blunt, but that's just a fact. I appreciate Kara's quote indicating her own self-reflection, as well. This absolutely falls on the coach, and we just can't afford to making mental lapses like this. We're just not good enough to make those kinds of mistakes. What was it Yogi said, \"90% of the game is half mental\"? Yeah, well, if we're gonna play half mental, we're gonna lose to good teams. We'll have a much easier opponent on Sunday afternoon, but we'll be in a hostile gym that will be anxious to goad us into remembering this one. Let's see if we can avoid getting chippy against Liberty and just play some basketball. An unfortunate game, and a very bad look for Duke."
}