{
  "url": "https://forum.jami.net/t/premiers-pas-ensemble/236",
  "title": "Premiers pas, ensemble - Support en français (French) - Jami Forum",
  "text": "Bonjour DodoVolant, bienvenue dans la jamisphère Première hypothèse. Vous avez peut-être installé Jami avec un paquet prévu pour autre distribution GNU/Linux que la vôtre. Sur la page des téléchargements les paquets tout-en-un et les instructions d’installation par la ligne de commande sont pour Ubuntu par défaut. Ça peut paraître évident pour la plupart d’entre nous, mais je pense qu’il est utile de rappeler qu’il faut choisir sa distribution GNU/Linux dans les onglets verticaux qui apparaît sur la gauche de l’écran sur la page des téléchargements pour GNU/Linux. Pour Linux Mint, la page doit s’afficher comme ici. Quand on veut éviter de se prendre la tête, il faut installer le paquet gdebi, puis télécharger le paquet-tout-en un en cliquant sur la première icône en face de la version de vôtre distribution (ici Linux Mint). Si je clique sur celle qui correspond à Linux Mint 20, voici la fenêtre qui s’ouvre. Personnellement, je laisse Ouvrir avec coché. Et dans le menu déroulant en face, je choisis Autre. Dans la fenêtre qui s’ouvre ensuite, je choisis Installeur de paquets GDebi. Je clique sur OK. Le navigateur web télécharge le paquet. Gdebi s’ouvre. Je clique sur Installer le paquet. J’entre mon mot de passe administrateur/root et valide pour lancer l’installation. Quand c’est fini, Gdebi indique que le paquet est déjà installé dans la même version que le fichier ouvert. Je ferme Gdebi et retrouve Jami dans le menu de mon environnement de bureau. Vous pouvez également choisir Enregistrer le fichier dans le cas où vous voulez installer Jami plus tard. Dans ce cas, il faut ouvrir votre gestionnaire de fichiers, souvent appellé Fichiers dans les menus (nautilus,nemo,pcmanfm, etc.), puis retrouver votre fichier jami-all.deb téléchargé, cliquer dessus avec le bouton gauche de la souris et choisir Ouvrir avec dans le menu déroulant qui apparaît, puis choisir Installeur de paquets GDebi comme plus haut. Deuxième hypothèse. Peu probable dans le cas présent, mais qui peut arriver à tout le monde quand on débute avec la ligne de commande. Les commandes indiquées au clic sur la seconde icône en face de la version de la distribution GNU/Linux choisie, ici Linux Mint 20, on été mal copiées et/ou collées dans le terminal avant d’être exécutées (Option 1). Je copie l’ensemble du texte pour l’option 1 et je le colle dans le terminal. Celui-ci ne s’y affiche qu’en partie alors qu’un coup d’œil dans le presse-papier m’indique que tout y est bien. Ce qui s’affiche dans le terminal après mon premier coller, je le valide en appuyant sur la touche Entrée et attends que le terminal me rende la main. Je colle de nouveau, la commande suivante à valider s’affiche dans le terminal. Je colle encore dans le terminal, et ainsi de suite, jusqu’à ce qu’il ne me reste plus que la commande sudo apt-get update && sudo apt-get install jami à valider. Et je peux lancer Jami depuis le menu de mon environnement de bureau. Troisième hypothèse. On note que si on clique pour obtenir les commandes à recopier dans le terminal pour installer Jami sur Linux Mint 20, on obtient les mêmes que celles pour installer Jami sur Ubuntu 20.04. Plusieurs distributions GNU/Linux sont desservies par les mêmes dépôts comme celles qui sont basées sur Ubuntu. Et généralement ça marche, et c’est bien pratique pour les développeurs qui n’ont pas tout à recommencer pour chaque distribution GNU/Linux. Mais si Ubuntu est elle-même basée sur Debian, Debian a des dépôts qui lui lui sont propres, car certaines caractéristiques de Debian qui permettent de faire fonctionner Jami n’ont pas été reprises par Ubuntu et ses descendantes. Linux Mint, comme la plupart des distributions basées sur Ubuntu, a quelques différences avec cette dernière. Cela pourrait peut-être expliquer les problèmes rencontrés sur Linux Mint en particulier. Mais ça peut aussi être autre chose. J’espère avoir pu aider par cette réponse. Bonne soirée."
}