{
  "url": "https://finance.yahoo.com/quote/BABA/",
  "title": "Alibaba Group Holding Limited (BABA) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "Alibaba Group Holding Limited (BABA) This price reflects trading activity during the overnight session on the Blue Ocean ATS, available 8 PM to 4 AM ET, Sunday through Thursday, when regular markets are closed. News headlines Alibaba is significantly investing in artificial intelligence, committing ¥3 billion ($431 million) to promote its Qwen AI app. The company is also enhancing its logistics capabilities through a $2 billion investment in Zelos Technology, positioning itself as a competitive player in the AI market. Alibaba is significantly investing in artificial intelligence, committing ¥3 billion ($431 million) to promote its Qwen AI app. The company is also enhancing its logistics capabilities through a $2 billion investment in Zelos Technology, positioning itself as a competitive player in the AI market. - Previous Close 169.56 - Open 167.98 - Bid 169.40 x 20000 - Ask 169.40 x 20000 - Day's Range 167.34 - 169.56 - 52 Week Range 95.73 - 192.67 - Volume 6,504,979 - Avg. Volume 12,566,920 - Market Cap (intraday) 402.002B - Beta (5Y Monthly) 0.39 - PE Ratio (TTM) 22.51 - EPS (TTM) 7.48 - Earnings Date (est.) Feb 19, 2026 - Forward Dividend & Yield 1.05 (0.62%) - Ex-Dividend Date Jun 12, 2025 - 1y Target Est 197.15 Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. It operates digital retail platforms under the Taobao and Tmall names; wholesale marketplaces through 1688.com and Alibaba.com; global e-commerce platform under the AliExpress name; e-commerce platforms under the Lazada, Trendyol, and Daraz names; and consumer-to-consumer community and marketplace under the Tmall Global, Tmall Supermarket, and Xianyu names. The company also operates Cainiao, an e-commerce logistics solution; Ele.me, an on-demand delivery and local services platform; and Amap, a provider of mobile digital map, navigation, and real-time traffic information; Youku, an online video platform; and Damai Entertainment that provides content production, promotion and distribution, performance and event ticketing management, IP-related licensing and operations, cinema ticketing management, and internet data services for the entertainment industry. In addition, it provides elastic computing, storage, network, security, database, big data, cloud native, and Alibaba cloud model studio services; and hardware, software license and installation, and application development and maintenance services, as well as sells membership packages and subscriptions. Further, the company offers Freshippo, a retail platform for groceries and goods; Alibaba Health for medical and healthcare solutions; mobile games under the Lingxi Games name; UC Browser, an information service platform; Quark, an information services platform for young users; Fliggy, an online travel platform; and DingTalk, a collaboration workplace and enterprise management platform. Alibaba Group Holding Limited was incorporated in 1999 and is based in Causeway Bay, Hong Kong. www.alibabagroup.com126,661 Full Time Employees March 31 Fiscal Year Ends Sector Industry Recent News: BABA View MorePerformance Overview: BABA Trailing total returns as of 2/3/2026, which may include dividends or other distributions. Benchmark is HANG SENG INDEX (^HSI) . YTD Return 1-Year Return 3-Year Return 5-Year Return Earnings Trends: BABA View MoreAnalyst Insights: BABA View MoreStatistics: BABA View MoreValuation Measures Market Cap 424.22B Enterprise Value 410.99B Trailing P/E 23.16 Forward P/E 19.38 PEG Ratio (5yr expected) 2.24 Price/Sales (ttm) 2.87 Price/Book (mrq) 2.80 Enterprise Value/Revenue 2.82 Enterprise Value/EBITDA 17.69 Financial Highlights Profitability and Income Statement Profit Margin 12.19% Return on Assets (ttm) 4.03% Return on Equity (ttm) 11.19% Revenue (ttm) 1.01T Net Income Avi to Common (ttm) 125.43B Diluted EPS (ttm) 7.48 Balance Sheet and Cash Flow Total Cash (mrq) 373.57B Total Debt/Equity (mrq) 27.25% Levered Free Cash Flow (ttm) -49.49B Compare To: BABA Select to analyze similar companies using key performance metrics; select up to 4 stocks. Company Insights: BABA Fair Value Dividend Score Hiring Score Insider Sentiment Score Research Reports: BABA View MoreAlibaba Earnings: Quick Commerce Loss Disappoints; Long-Term Positive Outlook Maintained Alibaba is the world’s largest online and mobile commerce company as measured by gross merchandise volume. It operates China’s online marketplaces, including Taobao (consumer-to-consumer) and Tmall (business-to-consumer). The China retail e-commerce platform is the most valuable cash flow-generating business at Alibaba. Additional revenue sources include China wholesale e-commerce, international retail and wholesale e-commerce, local consumer services, travel services, cloud computing, digital media and entertainment, Cainiao logistics services, and other businesses. RatingPrice TargetAlibaba Earnings: Quick Commerce Loss Disappoints; Long-Term Positive Outlook Maintained Alibaba is the world’s largest online and mobile commerce company as measured by gross merchandise volume. It operates China’s online marketplaces, including Taobao (consumer-to-consumer) and Tmall (business-to-consumer). The China retail e-commerce platform is the most valuable cash flow-generating business at Alibaba. Additional revenue sources include China wholesale e-commerce, international retail and wholesale e-commerce, local consumer services, travel services, cloud computing, digital media and entertainment, Cainiao logistics services, and other businesses. RatingPrice TargetLooking for more favorable entry point Alibaba provides Chinese and international e-commerce platforms, logistics, and ancillary services. The company operates in four segments (Core Commerce; Cloud Computing; Digital Media & Entertainment; and Innovation Initiatives), and has announced plans to split into six businesses. Key marketplaces include Taobao, a consumer marketplace; Tmall, a third-party platform for brands and retailers; Alibaba.com and 1688.com, online wholesale marketplaces; Alipay, for online payments; and Lazada, for Southeast Asia e-commerce. RatingPrice TargetStock prices are modestly lower. Nothing too dramatic - the VIX volatility Stock prices are modestly lower. Nothing too dramatic - the VIX volatility index is still below 18. The yield on the 10-year Treasury note is higher at 4.09%. Crude oil prices are up 1.5%, and gold prices are higher as well. Bitcoin continues its swoon."
}