{
  "url": "https://www.carelon.com/sign-in-or-register",
  "title": "Log In or Register | Carelon",
  "text": "Sign in or register Behavioral Health Care providers must obtain a user ID before using our online services. Carelon Behavioral Health Provider Portal Our provider portal provides convenient tools and resources for processing claims, obtaining claims information, verifying eligibility status, and more. ProviderConnect Our secure online portal is available 24/7, saving time and resources while reducing errors. It minimizes phone inquiries, speeds up payments through efficient processing, and integrates seamlessly with practice management software. eServices Our eServices portal offers care providers clinical and administrative tools aimed at allowing providers easier, more efficient access 24 hours a day, 7 days a week. Member Login Enter the first three letters of the name of your health plan or employer. Then select from the list that will appear. CarelonRx CarelonRx Our digital tools can help you manage your prescriptions. Log in to request a refill, price a medication, or find a pharmacy. Medical benefits management Specialty care Offered through Carelon Medical Benefits Management (Formerly AIM Specialty Health) Provider portal Submit a new case for prior authorization, or check on an existing one. Clinical guidelines and pathways Access the evidence-based criteria used in our review process. Post-Acute Care Offered through Carelon Medical Benefits Management (Formerly myNEXUS) Provider portal Submit a new case for prior authorization, or check on an existing one. Provider resources Access provider resources and forms. Carelon Palliative Care Palliative Care: MyChart Login With MyChart, palliative care patients can have all their health information in one place. EpicCare Quickly and easily refer a patient or securely access information and updates about your patients’ treatment. Payment Integrity Subrogation Solution Offered through Carelon Subrogation (Formerly Meridian Resource Company) Access your subrogation reports Access information about an existing subrogation case. Data Mining Solution Offered through Carelon Payment Integrity Access our solution suite Client login. Coordination of Benefits Solution Offered through Carelon Payment Integrity Access our solution suite Client login."
}