{
  "url": "https://hhs.iowa.gov/medicaid/plans-programs/fee-service/health-insurance-premium-payment-program",
  "title": "Health Insurance Premium Payment Program | Health & Human Services",
  "text": "On this page... The Health Insurance Premium Payment (HIPP) program is one of the services available to people who get Medicaid (Title 19). The HIPP program is a way for the State of Iowa to save money. Back to topEligibility - You or someone in your home has to have Medicaid. - You must have medical insurance or be able to get it through your employer. - The health plan must be cost-effective. Determing Cost Effective Back to topHow to Apply There are different ways to apply for HIPP. - Call to complete an application referral over the phone: - Des Moines area: 515-974-3282 - Toll-free: 1-888-346-9562 - Print a HIPP application, fill it out and email or fax it in: - Email: hipp@hhs.iowa.gov - Fax: 515-725-0725 - Print a HIPP application, fill it out and mail it in: Iowa Medicaid HIPP Unit PO Box 36476 Des Moines, IA 50315-9907 Reporting a Change You are required to report all changes to the Department within 10 days of the change. Changes can include: - Mailing address changes (state checks do not get forwarded). - The health insurance ends, or the insurance carrier, premium or deductible, or coverage changes. - The policyholder is not living with the Medicaid-eligible members. - Medicaid-eligible member moves in or out of your home, or you are no longer responsible for their Medicaid case. - The health insurance policy, paid by HIPP, is no longer primary for the HIPP eligible and enrolled members. - Employment changes How to Report a Change Changes may impact the benefit amount and who is considered HIPP eligible. The quickest way to report changes is to: - Call the HIPP program at 1-888-346-9562 or email hipp@hhs.iowa.gov - Fax: 1-515-725-0725 - Call the number on the front of a HIPP notice. You are required to report all changes that occur in your employment or health insurance, in your family and household. Back to topAIDS/HIV Health Insurance Premium Payment Program The AIDS/HIV Health Insurance Premium Payment Program's goal is to ensure that persons living with AIDS/HIV-related illness can continue their health insurance coverage even though the person's ability to maintain the coverage is reduced because of their illness. Back to top"
}