{
  "url": "https://www.clinicaladvisor.com/features/asthma-management-2022-gina-report/",
  "title": "Update on Asthma Management: the 2022 GINA Report",
  "text": "Asthma is a common airway disease in the United States with 8.4% of adults or 21 million persons affected.1 Of this population, approximately 60% have inadequately controlled disease.2 Asthma is one of the leading chronic illnesses of childhood and disproportionately affects Black people and those living below the poverty level.1 Asthma exacerbations cause missed days from school and work, hospitalizations, emergency department visits, and more than 4000 deaths annually.3 The Global Initiative for Asthma (GINA) is a campaign devised by the World Health Organization and National Heart, Lung, and Blood Institute to improve the diagnosis, management, and prevention of asthma by providing evidence-based strategies for clinicians worldwide. The latest GINA asthma recommendations, which were published in late 2022, are summarized here.4 Defining Asthma Asthma is a heterogeneous disease typically characterized by chronic airway inflammation of the lower respiratory tract resulting in hypoxia.4 GINA defines asthma as a history of respiratory symptoms including wheezing or repetitive coughing, dyspnea, and chest tightness plus variable expiratory airflow limitation all of which vary over time and in intensity.4 Other symptoms may include exercise limitation caused by episodes of bronchoconstriction and excess mucus production. Asthma is commonly associated with airway hyper-responsiveness triggered by an allergen that can be reversed using a bronchodilator. Clinicians assess the severity of asthma based on symptom frequency, night waking and activity limitation, and frequency of short-acting β2-agonist (SABA) use (for patients using SABA relievers). Asthma episodes range in severity from mild to severe. Many episodes resolve spontaneously or with minimal treatment whereas others can lead to emergency room visits, hospitalizations, or death. Etiology and Pathophysiology Asthma is thought to be caused by genetic predisposition, immune and inflammatory pathologic changes in the airways, and environmental factors. Airborne environmental exposures and allergies increase the risk for asthma. Asthma typically is considered type 2 inflammation because of the predominance of T helper 2 (TH2) lymphocytes involved in the pathologic process. Immune responses can involve either type 1 or type 2 inflammatory reaction depending on which subpopulation of CD4+ cells (TH1 or TH2) are involved.5 T helper 1 cells secrete interleukin 2 (IL-2), interferon γ (IFN-γ), and lymphotoxin α (LTα), and stimulate type 1 immunity, which is characterized by prominent phagocytic activity. By contrast, TH2 cells mainly secrete the cytokines IL-4, IL-5, and IL-13 and stimulate type 2 immunity, which is characterized by high immunoglobulin E (IgE) antibody titers and eosinophilia.5,6 Type 2 inflammation is most commonly induced by an allergy.7 An important characteristic of TH2 asthma is that it is responsive to treatment with inhaled corticosteroids (ICS) whereas other types of asthma are not. Some patients with asthma who lack evidence of type 2 inflammation are considered to have TH2-low inflammation or non-type 2 inflammation.7 The mechanisms of asthma other than type 2 inflammation are not well understood but may include intrinsic abnormalities in airway smooth muscle or effects of oxidative stress, IL-17, or neutrophil products on structural elements of the airway causing airway hyper-responsiveness and airway obstruction. With each asthma attack, tissue remodeling occurs in the lower airways, which is thought to predispose individuals to further exacerbations of asthma or asthma attacks.6,7 The changes include goblet cell hyperplasia that produces mucus, smooth muscle hypertrophy, and collagen deposition leading to narrowed airways.7 Thus, control of asthma is of paramount importance in the treatment of this disease to prevent these pathophysiologic changes. Episodes of bronchospasm in asthma can be triggered by upper or lower respiratory tract viral infections, tobacco smoke, allergens, particulate pollution, ozone, cold ambient temperature, exercise, stress, and nonsteroidal anti-inflammatory medicines, which include aspirin.4 Upper respiratory viral infection, especially rhinovirus, is the most common asthma trigger.7,8 Asthma Phenotypes The advent of new therapies directed at specific inflammatory mediators has increased the importance of phenotyping asthma.1 Common asthma phenotypes included in the GINA report are listed in Table 1.4 Table 1. Phenotypes of Asthma4 T helper 2-high asthma constitutes 50% of cases of mild to moderate asthma and probably a larger proportion of patients with severe asthma. The subgroups of patients with the TH2-high endotype who are not optimally controlled on low or medium doses of ICS are large enough to warrant additional treatment strategies.9 In addition, subgroups of patients with TH2-high asthma who require high doses of steroids to maintain asthma control may need a steroid-sparing strategy to reduce their risk for dose-dependent side effects of corticosteroids.10 Together, these reasons constitute the rationale for pursuing novel treatments for type 2 inflammation in asthma. Diagnostic Workup in Asthma There is no gold standard test to diagnose asthma. A diagnosis of asthma should be based on symptoms, detailed medical history, and physical examination, as well as objective measures as discussed below.4 Asthma Assessment Tools Several assessment tools have been developed that survey patients about their asthma control, identify patients at risk, and evaluate the effect of asthma management.11 Questionnaires include the Patient Needs in Asthma Treatment (NEAT) questionnaire, Asthma Control Test (ACT), and the Asthma Control Questionnaire (ACQ). Evaluations of these different questionnaires show that they are less accurate in assessing patients with poorly controlled asthma.12 Studies have found that patients with poorly controlled asthma tend to overestimate their level of asthma control on assessment tools. Despite experiencing severe symptoms, many patients tend to rate their control as satisfactory, which can misguide their treatment.13,14 Olaguibel et al found poor correlation between the ACQ cutoff points and the GINA guidelines’ classification of asthma control.15 Schreitmuller et al and Loerbroks et al found that the NEAT questionnaire needs additional validation before it can be routinely used in clinical practice globally.16,17 Many investigators consider the ACT to be a valid, reliable questionnaire for use in clinical practice.18 According to the American Thoracic Society, the ACT does not include an objective measure of airway caliber but is validated for use in the office setting as well as by mail, online, or by telephone.19 The ACT has also been designated as a core measure for National Institutes of Health (NIH)-initiated clinical research in adults.18 An ACT score of 20 or higher indicates well-controlled asthma and a score of less than 20 indicates asthma that is not well-controlled.4,18 Spirometry Spirometry is a pulmonary function test used to diagnose asthma and assesses for expiratory airway obstruction by measuring the volume of air the individual is able to expel from the lungs after a maximal inspiration. The patient is asked to use all their effort to exhale into the spirometry device to measure forced expiratory volume (FEV) and forced vital capacity (FVC). Spirometric parameters that are reviewed by the clinician include the forced expiratory volume in the first second of expiration (FEV1), FVC, and FEV1/FVC ratio. The forced expiratory flow between 25% and 75% of FVC (FEF25%-75%), also referred to as the maximal mid-expiratory flow (MMEF), is used to assess small airway limitation in certain patient groups and can signify obstruction when reduced.20 A reduction of FEV1/FVC ratio is used to document obstruction: in children, a reduced FEV1/FVC ratio is below 0.90. Although the cutoff for documented expiratory airflow limitation in adults varies between professional societies, GINA recommends using an FEV1/FVC ratio of less than 0.80 or below the lower limit of normal.4 Spirometry Prebronchodilator and Postbronchodilator Spirometry performed before and 10 to 15 minutes after administration of a bronchodilator (usually 200 to 400 μg of albuterol) can be used to confirm variable airway obstruction. The likelihood of a false negative result is increased if a SABA was administered within 4 hours of the test or if a twice daily long-acting β2 agonist (LABA) was administered within 24 hours of the test. An increase in FEV1 of greater than 12% and greater than 200 mL in adults, or greater than 12% predicted in children, is indicative of bronchodilator reversibility and is consistent with a diagnosis of asthma.4 A normal spirometry test does not exclude asthma, however, as airflow obstruction can be transient and manifest only at certain times of the day or in response to allergy triggers. In addition, abnormal results alone should not be used to diagnose asthma as airflow obstruction may be observed in patients with other diseases such as chronic obstructive pulmonary disease.21 Bronchial Provocation Testing If a patient’s results fail to confirm variation in airway obstruction or responsiveness to medications, bronchial provocation may be of value. There are 2 types of bronchial challenge tests: nonpharmacologic exercise provocation and pharmacologic provocation test. Nonpharmacologic Bronchial Provocation Spirometry is measured before and after exercise with a positive result signified by a decrease in FEV1 of at least 10% and 200 mL from baseline in adults or a decrease in FEV1 of at least 12% predicted or peak expiratory flow (PEF) of at least 15% in children.4 Although there is general agreement on the cutoff drop in FEV1 in adults, some guidelines suggest a higher cutoff in children, ranging between 12% and 15%.22-24 Eucapnic hyperventilation (also called eucapnic voluntary hyperpnea [EVH]), has also been used to demonstrate bronchial hyper-reactivity in a similar manner, with spirometry or PEF tested before and after the maneuver.25 The EVH test requires an athlete to complete a period of voluntary hyperpnea with a dry gas inhalant, which desiccates the airways, mimicking the osmotic priming stimulus to exercise-induced bronchospasm.26 Pharmacologic Bronchial Provocation This test is usually performed only in adults because of the risk for significant bronchoconstriction. Individuals are given increasing doses of methacholine or histamine, and a positive result is signified by a 20% or greater reduction in FEV1.4 Hypertonic saline or mannitol can also be used, with a positive result signified by a 15% or greater drop in FEV1.4,25 The bronchial provocation test should not be performed in patients with the following27: - Very low lung function on baseline spirometry test - Myocardial infarction or stroke in the last 3 months - Uncontrolled hypertension - Aortic or cerebral aneurysm - Pregnancy or nursing Medications to treat severe bronchoconstriction must be present in the testing area. They include epinephrine for subcutaneous injection and albuterol (salbutamol) in metered-dose inhalers with an appropriate valved holding chamber, dry powder inhalers, or premixed solutions for inhalation in a small-volume nebulizer. Oxygen must be available. A stethoscope, sphygmomanometer, and pulse oximeter should be available.25 A physician or health care provider who is appropriately trained to treat acute bronchoconstriction, including appropriate use of resuscitation equipment, must be close by to respond quickly to an emergency. Patients should not be left unattended once a bronchial provocation test has begun and should not be sent home unless their lung function at post-testing has recovered to within 10% of baseline values. A spontaneous recovery post-methacholine testing usually occurs within 45 to 60 minutes; however, patients are usually given a bronchodilator to relieve challenge-induced bronchoconstriction.28 Peak Flow Meter A peak flow meter is a relatively inexpensive method of assessment for variation in airway obstruction. The patient is instructed on proper use of the peak flow meter while in the clinician’s office, and then completes measurements at home in the morning and the evening for 1 to 2 weeks with the same meter. These values are recorded by the patient and brought in for review by the clinician. The metric used to determine variability is the “average daily diurnal variability,” calculated as the day’s highest PEF minus the day’s lowest PEF, divided by the mean PEF for the day and then averaged over the course of a week. A variation of more than 10% in adults or more than 13% in children is indicative of variable expiratory airway obstruction.4 Fractional Exhaled Nitric Oxide Testing Nitric oxide (NO) released by inflammatory cytokines in central and peripheral airways can be monitored in exhaled air. Fractional concentration of exhaled nitric oxide (FeNO) is a widely accepted biomarker for type 2-driven airway inflammation. This measure is also associated with increased risk for asthma exacerbations and a beneficial effect of ICS.29 The patient is asked to exhale into a nitric oxide measuring device to evaluate FeNO. A value of 40 parts per billion or higher in a patient with suspected asthma is considered a positive result and is strongly supportive of asthma. Increased FeNO reflects eosinophilic-mediated inflammatory pathways and likely steroid responsiveness.30 Eosinophil Count Sputum eosinophilia is a useful biomarker in asthma and is associated with steroid responsiveness. Although no standardized cutoff exists, a blood eosinophil count of 300 cells/μL or greater and increased level of sputum eosinophils (≥ 3%) have commonly been used as a threshold to indicate eosinophilic asthma.31 Higher blood or sputum eosinophil count has been assessed to be a sensitive and practical predictive biomarker for biologic therapies targeting allergic and/or eosinophilic pathways in patients with severe asthma. When interpreting blood eosinophils for asthma diagnosis, very high counts (>500 cells/μL) have a high certainty of associated airway eosinophilia. For values less than 410 cells/μL, the relationship between blood and airway eosinophils becomes less clear and it is important to consider the overall clinical picture. However, absence of peripheral eosinophilia does not exclude asthma. The need to consider symptom pattern and lung function to help support a diagnosis remains important.30 Immunoglobulin E as a Biomarker Immunoglobulin E binds to mast cells, basophils, dendritic cells, T and B cells, and other cells in allergic inflammation. Total serum IgE and allergen-specific IgE are strongly associated with asthma.27 Omalizumab, an add-on treatment in those with moderate to severe asthma, is a recombinant humanized monoclonal antibody (mAb) that binds to the Fc region of IgE.32 Therefore, an immunoassay for allergen-specific IgE is recommended in the diagnostic workup of patients with asthma and allergies. Allergy Testing In patients with allergies, skin prick allergy testing is also recommended. Allergen-specific immunotherapy (AIT) is recommended for those patients with allergen-driven asthma. Allergen immunotherapy can reduce the incidence of asthma attacks, decrease asthma medication usage, and also slow down progression of asthma. Immunotherapy can play a role in preventing progression from mild to more severe asthma.33 Asthma Medications for Adults Several classes of medications are listed in the GINA report for use in the treatment of asthma in adults (Table 2).4,32,34,35 Table 2. Classes of Asthma Medications for Adults4,32,34,35 2022 GINA Report Treatment Guidelines The 3 main categories of asthma medications that should be used in a step-wise manner, according to the GINA report. 1. Controller Medications Long-acting β2-agonists and ICS are used to reduce airway inflammation, control symptoms, and reduce future risks such as exacerbations and related decline in lung function. In patients with mild asthma, the recommended controller treatment is as-needed low-dose ICS plus formoterol taken when symptoms occur and before exercise. These were previously referred to as maintenance medications.4 2. Reliever Medications These agents are provided to all patients for as-needed relief of breakthrough symptoms during asthma attacks or exacerbations. The preferred reliever is low-dose ICS-formoterol. Reliever medications were previously termed rescue medications.4 For safety, GINA no longer recommends treatment with a SABA alone. Strong evidence suggests that such use of SABA, although providing short-term relief of asthma symptoms, does not protect patients from severe exacerbations and that regular or frequent use of SABAs increases the risk for exacerbations and death.4 GINA now recommends that all adults and adolescents with asthma should receive either as needed (in mild asthma) or daily ICS-containing controller treatment to reduce their risk for serious exacerbations. Large trials show that combination ICS-formoterol used as needed reduces severe exacerbations by 60% or greater in mild asthma compared with as-needed SABA alone.4 3. Add-On Therapies for Patients With Severe Asthma These medications may be considered when patients have persistent symptoms and/or exacerbations despite optimized treatment with high-dose controller medications, which are usually a high dose of ICS plus LABA. Low-dose ICS-formoterol (either budesonide-formoterol or beclometasone-formoterol) is recommended for use as both maintenance treatment and for symptom relief.4 Conclusion The GINA 2022 report detailed important changes in asthma management including that SABA is no longer indicated in mild asthma. The report also reviews the different asthma diagnostic modalities, including spirometry, bronchial provocation testing, FeNO testing, blood eosinophil count, and allergy testing. The use of FeNO is a new addition to the assessment of asthma. Use of controller medications, which were previously called maintenance medications, is key to avoiding permanent airway changes that can perpetuate asthma exacerbations. Formoterol is recommended as a key LABA to use in patients. Inhaled corticosteroids are particularly useful in patients with allergic eosinophilia. Additionally, given that allergy triggers asthma in many patients, allergy testing and allergy immunotherapy are recommended as part of the regimen in these patients. Primary care clinicians need to understand the GINA report classification of asthma and treatment recommendations. Also, teaching proper use of inhalers and reviewing an action plan for exacerbations with the patient is essential to care. Theresa Capriotti, DO, MSN, CRNP, RN, is a clinical professor at Villanova University M. Louise Fitzpatrick College of Nursing in Villanova, Pennsylvania. Natalie Dawn and Tabitha Ciocco are BSN Honor Students at Villanova University M. Louise Fitzpatrick College of Nursing. References 1. Most recent national asthma data. Centers for Disease Control and Prevention. Updated December 13, 2022. https://www.cdc.gov/asthma/most_recent_national_asthma_data.htm 2. Uncontrolled asthma among adults, 2016. Centers for Disease Control and Prevention. July 8, 2019. Accessed January 13, 2023. https://www.cdc.gov/asthma/asthma_stats/uncontrolled-asthma-adults.htm 3. FastStats: asthma. Centers for Disease Control and Prevention. Updated December 30, 2022. Accessed January 13, 2023. https://www.cdc.gov/nchs/fastats/asthma.htm 4. Global Initiative for Asthma (GINA) Main Report. 2022 GINA Report, Global Strategy for Asthma Management and Prevention. https://ginasthma.org/gina-reports 5. Mims JW. Asthma: definitions and pathophysiology. Int Forum Allergy Rhinol. 2015;5 Suppl 1:S2-6. doi:10.1002/alr.21609. 6. Voehringer D, Reese TA, Huang X, Shinkai K, Locksley RM. Type 2 immunity is controlled by IL-4/IL-13 expression in hematopoietic non-eosinophil cells of the innate immune system. J Exp Med. 2006;203(6):1435-2446. doi:10.1084/jem.20052448. 7. Fahy JV. Type 2 inflammation in asthma—present in most, absent in many. Nat Rev Immunol. 2015;15(1):57-65. doi:10.1038/nri3786 8. Dougherty RH, Fahy JV. Acute exacerbations of asthma: epidemiology, biology and the exacerbation-prone phenotype. Clin Exp Allergy. 2009;39(2):193-202. doi:10.1111/j.1365-2222.2008.03157.x 9. Woodruff PG, Modrek B, Choy DF, et al. T-helper type 2-driven inflammation defines major subphenotypes of asthma. Am J Respir Crit Care Med. 2009;180(5):388-95. doi:10.1164/rccm.200903-0392OC. 10. Randhawa I, Klaustermeyer WB. Oral corticosteroid-dependent asthma: a 30-year review. Ann Allergy Asthma Immunol. 2007;99(4):291-302. doi:10.1016/S1081-1206(10)60543-1 11. Alzahrani YA, Becker EA. Asthma control assessment tools. Respir Care. 2016;61(1):106-116. doi:10.4187/respcare.04341 12. Jia CE, Zhang HP, Lv Y, et al. The Asthma Control Test and Asthma Control Questionnaire for assessing asthma control: systematic review and meta-analysis. J Allergy Clin Immunol. 2013;131(3):695-703. doi:10.1016/j.jaci.2012.08.023 13. Menzies-Gow A, Chiu G. Perceptions of asthma control in the United Kingdom: a cross-sectional study comparing patient and healthcare professionals’ perceptions of asthma control with validated ACT scores. NPJ Prim Care Respir Med. 2017;27(1):48. doi:10.1038/s41533-017-0050-x 14. Bereznicki BJ, Chapman MP, Bereznicki LRE. Factors associated with overestimation of asthma control: A cross-sectional study in Australia. J Asthma. 2017;54(4):439-446. doi:10.1080/02770903.2016.1226899 15. Olaguibel JM, Quirce S, Juliá B, et al; MAGIC Study Group. Measurement of asthma control according to Global Initiative for Asthma guidelines: a comparison with the Asthma Control Questionnaire. Respir Res. 2012;13(1):50. doi:10.1186/1465-9921-13-50 16. Schreitmüller J, Apfelbacher C, Sheikh A, Loerbroks A. The Patient Needs in Asthma Treatment (NEAT) questionnaire: further evidence on its psychometric properties. Allergy. 2019;74(8):1511-1521. doi:10.1111/all.13782 17. Loerbroks A, Leucht V, Keuneke S, Apfelbacher CJ, Sheikh A, Angerer P. Patients’ needs in asthma treatment: development and initial validation of the NEAT questionnaire. J Asthma. 2016;53(4):427-437. doi:10.3109/02770903.2015.1099664 18. van Dijk BCP, Svedsater H, Heddini A, Nelsen L, Balradj JS, Alleman C. Relationship between the Asthma Control Test (ACT) and other outcomes: a targeted literature review. BMC Pulm Med. 2020;20(1):79. doi:10.1186/s12890-020-1090-5. 19. Asthma Control Test. American Thoracic Society; 2022. Accessed January 14, 2023. https://www.thoracic.org/members/assemblies/assemblies/srn/questionaires/act.php. 20. Knox-Brown B, Mulhern O, Feary J, Amaral AFS. Spirometry parameters used to define small airways obstruction in population-based studies: systematic review. Respir Res. 2022;23(1):67. doi:10.1186/s12931-022-01990-2 21. Langan RC, Goodbred AJ. Office spirometry: indications and interpretation. Am Fam Physician. 2020;101(6):362-368. 22. James DR, Lyttle MD. British guideline on the management of asthma: SIGN Clinical Guideline 141, 2014. Arch Dis Child Educ Pract Ed. 2016;101(6):319-322. doi:10.1136/archdischild-2015-310145 23. Papadopoulos NG, Arakawa H, Carlsen KH, et al. International consensus on (ICON) pediatric asthma. Allergy. 2012;67(8):976-997. doi:10.1111/j.1398-9995.2012.02865.x 24. National Asthma Education and Prevention Program. Expert Panel Report 3 (EPR-3): Guidelines for the Diagnosis and Management of Asthma-Summary Report 2007. J Allergy Clin Immunol. 2007;120(5 Suppl):S94-138. doi:10.1016/j.jaci.2007.09.043 25. Brigham EP, West NE. Diagnosis of asthma: diagnostic testing. Int Forum Allergy Rhinol. 2015;5 Suppl 1:S27-30. doi:10.1002/alr.21597 26. Anderson SD, Argyros GJ, Magnussen H, Holzer K. Provocation by eucapnic voluntary hyperpnoea to identify exercise induced bronchoconstriction. Br J Sports Med. 2001;35(5):344-347. doi:10.1136/bjsm.35.5.344 27. Lee MK, Yoon HK, Kim SW, Kim TH, Park SJ, Lee YM. Nonspecific bronchoprovocation test. Tuberc Respir Dis (Seoul). 2017;80(4):344-350. doi:10.4046/trd.2017.0051 28. Coates AL, Wanger J, Cockcroft DW, et al. ERS technical standard on bronchial challenge testing: general considerations and performance of methacholine challenge tests. Eur Respir J. 2017;49(5):1601526. doi:10.1183/13993003.01526-2016 29. Pavord ID, Holliday M, Reddel HK, et al; Novel START Study Team. Predictive value of blood eosinophils and exhaled nitric oxide in adults with mild asthma: a prespecified subgroup analysis of an open-label, parallel-group, randomised controlled trial. Lancet Respir Med. 2020;8(7):671-680. doi:10.1016/S2213-2600(20)30053-9 30. Saglani S, Menzie-Gow AN. Approaches to asthma diagnosis in children and adults. Front Pediatr. 2019;7:148. doi:10.3389/fped.2019.00148. 31. Diamant Z, Vijverberg S, Alving K, et al. Toward clinically applicable biomarkers for asthma: An EAACI position paper. Allergy. 2019;74(10):1835-1851. doi:10.1111/all.13806 32. Grainge CL, Maltby S, Gibson PG, Wark PA, McDonald VM. Targeted therapeutics for severe refractory asthma: monoclonal antibodies. Expert Rev Clin Pharmacol. 2016;9(7):927-941. doi:10.1586/17512433.2016.1172208 33. Schmitt J, Wüstenberg E, Küster D, Mücke V, Serup-Hansen N, Tesch F. The moderating role of allergy immunotherapy in asthma progression: results of a population-based cohort study. Allergy. 2020;75(3):596-602. doi:10.1111/all.14020 34. Marone G, Spadaro G, Braile M, et al. Tezepelumab: a novel biological therapy for the treatment of severe uncontrolled asthma. Expert Opin Investig Drugs. 2019;28(11):931-940. doi:10.1080/13543784.2019.1672657 35. Ortega HG, Liu MC, Pavord ID, et al. Mepolizumab treatment in patients with severe eosinophilic asthma. N Engl J Med. 2014;371(13):1198-207. doi:10.1056/NEJMoa1403290"
}