{
  "url": "https://www.samsung.com/us/mobile/phones/all-other-phones/samsung-galaxy-j7-16gb-unlocked-black-sm-j727uzkaxaa/",
  "title": "Samsung Galaxy J7 16GB Unlocked Black Phones - SM-J727UZKAXAA | Samsung US",
  "text": "Samsung Galaxy J7 16GB Unlocked Black Galaxy J7 16GB (Unlocked) - Images must be in BMP, PNG, GIF or JPEG format. - File size must be 5 MB or less. - Image must be at least 100 pixels tall. - Image must be at least 100 pixels wide. - It contains copyrighted media (and you don't hold the copyright) - It contains media not related to the product We may not publish your review if: - It contains copyrighted media (an you don't hold the copyright) - It contains media not related to the product Enjoy photos, video and your favorite games on a 5.5” HD Super AMOLED screen. 16GB of memory comes standard with the option to add an additional 256GB. Get Stock Alerts May we send you an alert when this product is available? Let's keep in touch! Tick the box to receive promotional email and texts (which may be autodailed) from Samsung Electronics America to the number provided above.The Samsung Privacy Policy explains how we use your information. You do not have to consent to receive text messages to receive any product or services from us. Messaging and data rates may apply. Log in now to earn up to 1% back in Samsung Rewards Points Global Download Center SAMSUNG assumes no responsibility, and shall not be liable, in connection with whether any such products or services will be appropriate, functional or supported for the SAMSUNG products or services available in your location. Related Products Unlocked Main Display Size HD Display Expandable Memory Unlock the Galaxy. With the Galaxy J7, you have the freedom to choose the carrier and plan that work best for you.1 Take it anywhere you go, from Mexico to Canada, and still stay connected. Plus you can rest easy with Samsung’s standard U.S.limited warranty. It’s your smartphone. Own it on your terms. Screen Experience everything on a full, vibrant 5.5\" HD Super AMOLED display. TV shows look bright. Words read clearly. And gaming is easier and more fun thanks to the large 5.5\" touch screen. Camera Capture moments more clearly with the 8 MP main camera. Plus, take selfies that look great in any light with a 5 MP front-facing camera with flash. Battery A long-lasting 3,300mAh removable battery keeps you powered up to browse, read and listen wherever your phone takes you. Get up to 40 hours of talk time.¹ - Carrier Type Unlocked - Audio and Video Video Playing Format MP4,M4V,3GP,3G2,WMV,ASF,AVI,FLV,MKV,WEBM Video Playing Resolution FHD (1920 x 1080) @60fps Audio Playing Format MP3,M4A,3GA,AAC,OGG,OGA,WAV,WMA,AMR,AWB,FLAC,MID,MIDI,XMF,MXMF,IMY,RTTTL,RTX,OTA - Color Color Black - Display Resolution (Main Display) 1280 x 720 (HD) Main Display Size 5.5 \" Technology (Main Display) TFT Color Depth (Main Display) 16M - Camera Video Recording Resolution FHD (1920 x 1080) @30fps Camera resolution (Front) CMOS 5 MP Camera resolution (Rear) 8 MP Digital Optical Zoom X4 (Digital) Features Auto,Continuous Shot,Panorama,Pro,Selfie,Sports,Sound & Shot Main Camera - Flash Yes Main Camera - Auto Focus Yes - Storage Internal Storage 16 Available Storage (GB) microSD up to 256GB (sold separately) - Network Frequencies and Data Type \"GSM: 850,900,1800,1900 UMTS: B1(2100),B2(1900),B4(AWS),B5(850) 4G LTE: B1(2100),B2(1900),B3(1800),B4(AWS),B5(850),B7(2600),B12(700),B66(AWS-3)\" - Connectivity Wi-Fi Connectivity 802.11 a/b/g/n/ac (2.4 GHz + 5 GHz) USB Micro USB (USB 2.0) Bluetooth® Bluetooth 4.1 ANT+ Yes Bluetooth Profiles A2DP,AVRCP,DI,HFP,HID,HOGP,HSP,MAP,OPP,PAN,PBAP Location Technology GPS,Glonass Earjack 3.5mm Stereo Wi-Fi Direct Yes PC Sync. Smart Switch (PC version) - OS OS Android - General Information General Information Touch Bar - Size Weight 5.99 oz Product Dimensions (inches) 5.97\" x 3.00\" x 0.34\" - Battery Battery, Standby Up to 20 days Removable Yes Battery, Talk Time Up to 40 hours - Services and Applications Gear Manager Gear Circle (Manager Support),Gear Fit,Gear Fit2,Gear1,Gear2,Gear2 Neo,Gear S,Gear S2,Gear S3,Gear IconX Additional Features Dual-Camera, Geo-Tagging, HD Playback, HD Recording, LED Flash, Online Image Uploading, Photo Editing - Key Features GPS Navigation Yes Premium Camera Yes Noise Cancellation Yes Enabled for 4G LTE Yes HD Display Yes Expandable Storage Yes - Category General Feature Galaxy J7 - Business & Office Features KNOX 2.8 1Wireless voice, data and messaging services compatible with GSM networks such as AT&T and T-Mobile. Not compatible with CDMA networks such as Verizon, Sprint and US Cellular®. Support for certain features and services such as VoWiFi and hotspot, vary by wireless service provider. See provider for details. You Are About To Be Redirected To Investor Relations Information for U.S. Thank you for visiting Samsung U.S. Investor Relations. You will be redirected via a new browser window to the Samsung Global website for U.S. investor relations information.Redirect Notification As of Nov. 1, 2017, the Samsung Electronics Co., Ltd. printer business and its related affiliates were transferred to HP Inc.For more information, please visit HP's website: http://www.hp.com/go/samsung - * For Samsung Supplies information go to: www.hp.com/go/samsungsupplies - * For S.T.A.R. Program cartridge return & recycling go to: www.hp.com/go/suppliesrecycling - * For Samsung printer support or service go to: www.hp.com/support/samsung Select CONTINUE to visit HP's website."
}