{
  "url": "https://oldnavy.gap.com/browse/info.do?cid=1095422",
  "title": "Navyist Rewards - Earn Points Every Time You Shop Any Way You Pay | Old Navy",
  "text": "Here's why you're going to looooove it... DONATE REWARDS to a good cause* EARN POINTS, GET REWARDS any way you pay* and there's even more! Earn Points Every Time You ShopMembers You're perfect for this And you don't need a credit card to... Earn 1 point for every $1 spent at our family of brands* 100 Points = $1 Reward Core Brand Spend Enthusiast Start Here OR $500-$999 Annual Brand Spend Icon as a Cardmember OR $1000+ Annual Brand Spend New Cardmember Offer Earn And Redeem Special Perks Bonuses Brand Exclusives Let's Make It Official Become a Navyist Rewards Member or Cardmember & start earning points today. *Details: $0 Annual Fee: Offer subject to credit approval. This offer is available through this advertisement and may not be accessible elsewhere. Other offers may be available. For complete pricing and other details, please see the Terms and Conditions. *First Purchase Discount: Subject to credit approval. Terms Apply. Your new credit card must be used as the sole payment type. Discount code expires at 11:59 pm PT fourteen (14) days from date of Account opening. Open a new Navyist Rewards Credit Card or Navyist Rewards Mastercard® Account to receive a 30% discount on your first purchase. Valid only in the U.S. (including Puerto Rico). Only one Account opening discount per Account. The First Purchase and Family of Brands Discounts cannot be combined. Discounts cannot be combined with Gap Inc. employee discount, but can be combined with other eligible offers in a single transaction. Excludes gift cards, shipping, taxes, and all merchandise sold and shipped by 3rd party sellers. Not valid at other Gap Inc. brands or in our Clearance Center. No adjustments to previous purchases. Offer subject to change. Family of Brands Discount: 20% discount code will be provided in the welcome kit provided at time of account-opening in store or in your temporary shopping pass email for accounts opened online, and is valid 1 (one) time in-store or online at each of our family of brands. Code must be presented in-store or applied at checkout online. Earn Points: Purchases paid with gift cards or store credit do not earn points. Additional restrictions apply. See complete details, including how to earn points and redeem rewards at Program Terms. CARDMEMBERS: A Gap Inc. Credit Card must be used as sole payment type. Subject to credit approval. How To Level Up: Upgrades will be processed within 60 days after qualifying, and the Status Level is valid for both the remainder of the calendar year (January 1 - December 31) in which it is earned and for the next calendar year. At the start of each new calendar year, Qualifying Purchases amount (Members) or Base Points Earned (Cardmembers) will reset to zero. Members and Cardmembers must re-quality for Status Levels as outlined above during each calendar year. Free to Join: See Program Terms for Details. Birthday Gift: For eligible program members only. Gift selected in Gap Inc.’s discretion and may be subject to additional terms and conditions. See Program Terms for additional details and program restrictions, including eligibility requirements. Free Shipping on purchases of $50 or more: Must be signed into your online account to receive offer. Valid for online orders totaling at least $50 after discounts and before taxes shipped anywhere in the U.S. (including Puerto Rico). If you choose another shipping option, additional charges may apply. Orders must be shipped to a single address. Core and Enthusiast program members receive free Standard shipping on orders of $50 or greater. Icon members receive free Express shipping on orders of $50 or greater. We will endeavor to deliver your shipment within the stated delivery window; however, some products may not be available for shipment in that window, and during peak periods, such as during the holidays, shipment may fall outside the delivery window. Shipping speed for items shipped and sold by third party sellers may vary. See program terms for additional terms and details, including any eligibility restrictions. Early Access: We will send additional details about early access opportunities to eligible program members when they are available. May be subject to additional terms and conditions. Create Your Own Sale Day: Icon level members can choose their own sale day (15% off) once per year. May be used one time at each of our Family of Brands on the sale day, either online or in-store. Subject to additional terms and conditions, which will be included in the offer. Donate Pts to Select Charities: Eligible program members can convert rewards to dollars to donate to select organizations. 100 points= $1 donation dollar. Subject to maximum program cap. Organizations chosen in Gap lnc.'s discretion. See complete program terms. Convert GapCash/Style Cash/Super Cash to Rewards: Eligible program members can convert unused Gap Cash, Super Cash, or Style Cash (“Cash Coupons\") to Rewards points. You must convert your unused Cash Coupon(s) to points within 30 days of the last day to redeem your Cash Coupon. Each Cash Coupon dollar equals one program point when converted. Cash coupons are subject to the terms and conditions of each Cash Coupon program. See program terms for details, including eligibility requirements and converting Cash Coupons to rewards points. Free Alterations on BR Merch: Exclusions apply. See program terms for details. The Gap Inc. Mastercard is issued by Barclays Bank Delaware (Barclays) pursuant to a license from Mastercard International Incorporated. Mastercard and World Elite Mastercard are registered trademarks, and the circles design is a trademark of Mastercard International Incorporated."
}