{
  "url": "https://en.wikipedia.org/wiki/Hillandale,_Maryland",
  "title": "Hillandale, Maryland - Wikipedia",
  "text": "Hillandale, Maryland Hillandale is an unincorporated area and census-designated place located in Montgomery and Prince George's counties, Maryland, United States. As of the 2020 census, it had a population of 5,774.[3][4] Hillandale is contained between the Prince George's / Montgomery County line to the east, the Anacostia River to the west, McCeney Avenue to the north, and D.C.'s Capital Beltway to the south. It borders the communities of Adelphi, Avenel, White Oak and Beltsville. Geography [edit]Hillandale is part of the very large postal designation of Silver Spring. According to the United States Census Bureau, the place has a total area of 2.0 square miles (5.3 km2), all land.[5] In Montgomery County, Hillandale is bordered by the Silver Spring CDP to the south (across the Capital Beltway), the Four Corners CDP to the west (across the Northwest Branch Anacostia River), and the White Oak CDP to the north. In Prince George's County, Hillandale is bordered by the Beltsville CDP to the east (across the Paint Branch) and the Adelphi CDP to the south (across the Capital Beltway).[6] Demographics [edit]2020 census [edit]2000 Census [edit]As of the census[10] of 2000, there were 3,054 people, 1,087 households, and 846 families residing in the area. The population density was 2,465.6 inhabitants per square mile (952.0/km2). There were 1,110 housing units at an average density of 896.2 per square mile (346.0/km2). The racial makeup of the area was 55.40% White, 25.57% African American, 0.46% Native American, 9.66% Asian, 0.03% Pacific Islander, 5.86% from other races, and 3.01% from two or more races. Hispanic or Latino of any race were 11.39% of the population. There were 1,087 households, out of which 27.3% had children under the age of 18 living with them, 66.1% were married couples living together, 7.7% had a female householder with no husband present, and 22.1% were non-families. 16.9% of all households were made up of individuals, and 7.9% had someone living alone who was 65 years of age or older. The average household size was 2.80 and the average family size was 3.13. In the area, the population was spread out, with 20.0% under the age of 18, 7.1% from 18 to 24, 25.1% from 25 to 44, 29.1% from 45 to 64, and 18.6% who were 65 years of age or older. The median age was 44 years. For every 100 females, there were 99.6 males. For every 100 females age 18 and over, there were 95.1 males. The median income for a household in the area was $75,650, and the median income for a family was $88,802. Males had a median income of $46,107 versus $36,724 for females. The per capita income for the area was $27,861. About 1.1% of families and 3.3% of the population were below the poverty line, including none of those under age 18 and 5.0% of those age 65 or over. Education [edit]Hillandale residents in Montgomery County are zoned to MCPSMontgomery County Public Schools while those in Prince George's County are zoned to Prince George's County Public Schools.[11] Prince George's residents are zoned to Cherokee Lane Elementary School,[12] Buck Lodge Middle School,[13] and High Point High School.[14] See also [edit]- Avenel-Hillandale, name of a census-designated place in 1970. References [edit]- ^ \"2020 U.S. Gazetteer Files\". United States Census Bureau. Retrieved April 26, 2022. - ^ a b U.S. Geological Survey Geographic Names Information System: Hillandale, Maryland - ^ \"QuickFacts: Hillandale CDP, Maryland\". United States Census Bureau. Retrieved August 17, 2021. - ^ \"Hillandale CDP, Maryland\". United States Census Bureau. Retrieved April 15, 2022. - ^ \"Geographic Identifiers: 2010 Demographic Profile Data (G001): Hillandale CDP, Maryland\". United States Census Bureau. Retrieved December 20, 2011. - ^ \"P.L. 94-171 County Block Maps (2010 Census) - Prince George's County, Maryland\". U.S. Census Bureau. Retrieved December 20, 2011. - ^ \"Decennial Census of Population and Housing by Decades\". US Census Bureau. - ^ a b \"P2 Hispanic or Latino, and Not Hispanic or Latino by Race – 2010: DEC Redistricting Data (PL 94-171) – Hillandale CDP, Maryland\". United States Census Bureau. - ^ a b \"P2 Hispanic or Latino, and Not Hispanic or Latino by Race – 2020: DEC Redistricting Data (PL 94-171) – Hillandale CDP, Maryland\". United States Census Bureau. - ^ \"U.S. Census website\". United States Census Bureau. Retrieved January 31, 2008. - ^ \"2010 CENSUS - CENSUS BLOCK MAP: Hillandale CDP, MD.\" U.S. Census Bureau. Retrieved on September 2, 2018. - ^ \"NEIGHBORHOOD ELEMENTARY SCHOOLS AND BOUNDARIES SCHOOL YEAR 2018-2019.\" Prince George's County Public Schools. Retrieved on September 2, 2018. - ^ \"NEIGHBORHOOD MIDDLE SCHOOLS AND BOUNDARIES SCHOOL YEAR 2018-2019.\" Prince George's County Public Schools. Retrieved on September 1, 2018. - ^ \"NEIGHBORHOOD HIGH SCHOOLS AND BOUNDARIES SCHOOL YEAR 2018-2019.\" Prince George's County Public Schools. Retrieved on September 1, 2018."
}