{
  "url": "https://www.prnewswire.com/news-releases/norwest-announces-3-billion-global-fund-to-partner-with-the-next-generation-of-enduring-companies-302126935.html",
  "title": "Norwest Announces $3 Billion Global Fund to Partner with the Next Generation of Enduring Companies",
  "text": "Norwest Announces $3 Billion Global Fund to Partner with the Next Generation of Enduring Companies NVP 17 to Support Multi-Stage Investments Across Enterprise, Consumer and Healthcare Sectors MENLO PARK, Calif., April 25, 2024 /PRNewswire/ -- Norwest Venture Partners, a global venture capital and growth equity investment firm, today announced it has closed a $3 billion fund, NVP XVII, LP (NVP 17). The new fund enables the Norwest team to continue partnering with visionary entrepreneurs and teams building the next generation of enduring companies. Following NVP 16, also a $3 billion fund, NVP 17 now brings the firm's total capital under management to $15.5 billion. \"For more than six decades, we have been fortunate to partner with an incredible set of companies,\" said Jeff Crowe, senior managing partner at Norwest. \"Our diversified investment strategy, long-term commitment and collaborative approach allows us to adapt to a wide range of market conditions and support founders and CEOs at every stage of their journey.\" A Global and Diversified Approach Founded in 1961, Norwest has developed a proven diversified investment strategy and works closely with entrepreneurs and CEOs across a broad range of stages, sectors and geographies. Norwest expanded beyond the North American market in 2005 when it started investing in Israel and India. In 2009, the firm launched its growth equity practice and a year later added healthcare as a core investment sector, alongside enterprise and consumer. Norwest's current venture and growth equity portfolio includes over 230 companies, such as industry leaders Vuori, Gong, Monogram Health and Five Star Finance. With NVP 17, Norwest will continue to employ a multi-stage, multi-sector approach to investing in enterprise, consumer and healthcare businesses. With headquarters in Menlo Park, Calif., and offices in San Francisco; Mumbai, India; and Tel Aviv, Israel; the firm invests globally with a primary focus on the North America, India and Israel markets. Recent Momentum Since raising NVP 16 in December 2021, Norwest has made 69 new investments and worked closely with 36 portfolio companies to help them achieve liquidity events. Notable exits included Blue Cloud (PE acquisition), Ermetic (acquired by Tenable), Five Star Finance (IPO), Infutor (acquired by Verisk), Junk King (acquired by Neighborly), SmartSign (acquired by Sentinel), Spiff (acquired by Salesforce) and YipitData (PE recapitalization). Norwest expanded the focus of its healthcare practice over the last two years by adding biotech to existing areas of medical devices and diagnostics, healthcare services, healthcare software and tech-enabled services, thereby doubling the size of its healthcare venture team. The most recent healthcare investments across both venture and growth equity include Cytovale, Diana Health, Engrail Therapeutics, HighFive Healthcare, Nectero Medical, Ray Therapeutics, SetPoint Medical and Vertos Medical. A World-Class Team Jeff Crowe and Jon Kossow will continue to lead the firm as managing general partners. As part of succession planning, Promod Haque will transition from managing partner to the role of general partner. Norwest also recently announced several key hires and promotions across its Investment and Portfolio Services teams. New Hires: - Healthcare Investment Team: Zack Scott, MD, general partner; Irem Rami, principal; Brian Matesic, MD, principal; and Philip Fleischman, vice president. - Growth Equity Team: Chris Scullin, principal, will be joining Norwest in June; Mary Miller, head of business development for growth equity. - Portfolio Services and Other Team Members: David Rudnitsky, CRO operating executive, principal; Renée Cohen, marketing operating executive, vice president; and Eyal Manor, entrepreneur in residence. Promotions: - Recent promotions include Ran Ding to general partner and co-head of the growth equity team; Matthew De Dominicis to administrative partner and CFO; Nikhil Kookada and Ankit Prasad to principal; and Krish Kapadia and Jordan Leites to vice president. \"Our experienced team helps portfolio companies navigate hyper-growth phases and challenging economic environments,\" said Jon Kossow, managing partner at Norwest. \"The team we've built represents our commitment to finding the next category-defining companies and supporting them with value-creation services and resources as they scale their businesses.\" About Norwest Venture Partners Norwest Venture Partners is a global venture and growth equity investment firm managing more than $15.5 billion in capital. Since its inception, Norwest has invested in more than 700 companies and currently partners with more than 230 companies in its venture and growth equity portfolio. The firm invests in early- to late-stage businesses across key sectors with a focus on enterprise, consumer and healthcare. The Norwest team offers a deep network of connections, extensive operating experience, and a wide range of impactful services to help CEOs and founders scale their businesses. Norwest has offices in Menlo Park and San Francisco, Calif.; Mumbai, India; and Tel Aviv, Israel. For more information, please visit www.nvp.com. SOURCE Norwest Venture Partners"
}