{
  "url": "https://support.google.com/maps/answer/144339?hl=nl&co=GENIE.Platform=Desktop",
  "title": "Routebeschrijvingen opvragen en routes tonen in Google Maps - Computer - Google Maps Help",
  "text": "Belangrijk: Houd de omgeving in de gaten als je een route op Google Maps gebruikt om jezelf en anderen te beschermen. Volg bij twijfel de werkelijke verkeersregels en bewegwijzering voor de weg of het pad waarop je je bevindt. Met Google Maps kun je routes opvragen voor de auto, het openbaar vervoer, lopen, ritdiensten, de fiets, het vliegtuig en de motor. - Als er meerdere routes zijn, is de beste route naar je bestemming blauw en zijn alle andere routes grijs. - Bepaalde routes in Google Maps zijn nog in ontwikkeling en kunnen daarom beperkt beschikbaar zijn. Routebeschrijving in Google Maps - Open Google Maps op je computer. - Klik op Route . - Voer het vertrekpunt en de bestemming in. - Klik op een punt op de kaart, typ een adres of voeg een plaatsnaam toe. - Kies je vervoermiddel. - Klik op Rijden voor een autoroute. - Klik op Openbaar vervoer voor een ov-route. - Klik op Lopen voor een looproute. - Klik op Fietsen voor een fietsroute. - Klik op Vliegtuig voor vluchtopties. Tip: Als je een andere route wilt kiezen voor een vervoermiddel, selecteer je deze op de kaart. Voor elke route zie je de geschatte reistijd op de kaart. Je kunt routes voor verschillende vervoermiddelen krijgen in Google Maps. Lees meer informatie over de functies en beschikbaarheid voor elk vervoermiddel: Auto: - Autoroutes kunnen wegen bevatten die alleen voor auto's zijn. Als je een elektrische fiets of een lichte motor (minder dan 125 cc) gebruikt, zet je Tolwegen vermijden en Snelwegen vermijden aan. - Als je een autoroute wilt wijzigen, klik je op een stuk van de route, houd je dat vast en sleep je de route naar een nieuwe plek op de kaart. Openbaar vervoer: - Google Maps beschikt niet voor alle steden over ov-routes. Je kunt pas een ov-route opvragen als het lokale openbaar vervoersbedrijf routegegevens heeft toegevoegd aan Google Maps. Lopen: - Als je loopt, kun je een stapsgewijze looproute naar je bestemming krijgen. Fietsen: - Als je fietst, kun je fietsroutes gebruiken als deze beschikbaar zijn in je land of regio. Vliegtuig: - Routebeschrijvingen naar meerdere bestemmingen of routepunten zijn niet beschikbaar voor reizen per openbaar vervoer of vliegtuig. - Meer informatie over hoe je vluchten zoekt. Meerdere bestemmingen toevoegen in Google Maps Je kunt routes naar meerdere bestemmingen voor alle vervoermiddelen opvragen, behalve voor het openbaar vervoer of het vliegtuig. - Open Google Maps op je computer. - Klik op Route . - Voeg een vertrekpunt en een bestemming toe. - Als je je vertrekpunt wilt bewerken, klik je bovenaan op Mijn locatie. - Klik onder de ingevoerde bestemmingen op Bestemming toevoegen . - Kies een andere bestemming om een tussenstop toe te voegen. - Je kunt maximaal 9 tussenstops toevoegen, inclusief de eindbestemming. - Klik op een route om een beschrijving van de route te krijgen. Tip: Je kunt zoeken naar plaatsen langs je route. De volgorde van je tussenstops wijzigen in Google Maps - Zoek de bestemming die je wilt verplaatsen. - Sleep de bestemming. Een voorbeeld van een route tonen in Street View in Google Maps Belangrijk: Klik op Route voor een route in Street View. Voer daarna het vertrekpunt en de bestemming in. - Klik op je computer op Details onder de gewenste route. - Klik op Uitvouwen voor een gedetailleerdere route. - Plaats de cursor op een stap van de route. - Als Street View beschikbaar is, krijg je een voorbeeldfoto. - Klik op de foto om de gewenste stap in Street View weer te geven. - Als je Street View wilt gebruiken voor andere stappen van de route, klik je in het vak linksonder op Vorige stap of Volgende stap. - Als je het voorbeeld wilt sluiten, klik je rechtsboven op Sluiten . Je route aanpassen in Google Maps Tolwegen en snelwegen vermijden- Open Google Maps op je computer. - Klik op Route . - Voer het vertrekpunt en de bestemming in. - Klik op een punt op de kaart, typ een adres of voeg een plaatsnaam toe. - Kies Opties. - Vink het selectievakje aan naast Tolwegen of Snelwegen. Wijzig de reisdatum of -tijd om de beste route te vinden op basis van geschatte verkeers- en ov-schema's. Dit werkt alleen voor routes met één bestemming. - Open Google Maps op je computer. - Vraag een route op. - Als je je route hebt gekregen, klik je op Nu vertrekken. - Als je de reisdatum en/of -tijd wilt wijzigen, selecteer je Vertrek of Aankomst. Als je in Google Maps een bestemming invoert, tonen we hoe je er komt met verschillende vervoermiddelen, zoals met de auto, op de fiets of lopend. De vervoeropties die we weergeven, zijn gerangschikt op basis van een combinatie van objectieve factoren die je relevante en nuttige informatie laten vinden. Deze factoren zijn bijvoorbeeld de reistijd, de afstand, de prijs, je voorkeur voor een vervoermiddel en de relevantie van een vervoermiddel voor je zoekopdracht. De belangrijkste factoren zijn meestal je voorkeur, de reistijd en soms de prijs. Voor zover beschikbaar laten we je ook andere mobiliteitsservices zien, zoals openbaar vervoer, scooter- of fietsverhuur en rittenservices. Deze mobiliteitsservices worden aangeboden door derden die hun reisinformatie openbaar beschikbaar stellen of die een partnerovereenkomst met ons hebben. Onze partnerschappen of zakelijke relaties met andere vervoersbedrijven hebben geen invloed op de positie van deze services."
}