{
  "url": "https://westseattleblog.com/category/ws-breaking-news/",
  "title": "West Seattle Blog… | WS breaking news",
  "text": "West Seattle, Washington 04 Wednesday 12:38 AM: Police are in the 9200 block of 16th SW [vicinity map] investigating what’s reported to have been a hit-run crash that left a motorcyclist seriously injured. They’re looking for what they say witnesses described as a brown, older Ford F-150, likely to be damaged and leaking fluid. (Added: Officers tell dispatch witnesses say it was last seen heading eastbound on either Barton or Henderson.) If you have any information, the case # to refer to is 26-032194. 9:17 AM: SFD tells us the motorcyclist is a 51-year-old man who was in stable condition when taken to a hospital. We’re checking on whether police found the suspected hit-run vehicle/driver. 9:13 AM: Seattle Fire has sent a “rope rescue” response to the 3200 block of SW Spokane [map], upslope from the west side of the Admiral Way hill. According to radio exchanges, they need to lift an injured person off a roof. 9:16 AM: SFD says this is happening at a construction site. Crews are planning to rescue the person via a ladder instead of lifting them out in a basket. 9:32 AM: Firefighters just told dispatch that “the patient is off the roof.” … Reader photo added above, sent by SeanO. The rescued person’s injuries are not described as life-threatening. No camera in the area so we don’t have a visual, but a driver is reported to have gone off the road toward the southwest end of the West Seattle Bridge a short time ago and hit the “Welcome to West Seattle” sign. We’re mostly just noting this one for the record, as SFD upon arrival noted that no one was hurt and the crashed vehicle – reported to be a pickup truck – was out of the flow of traffic. 12:46 PM: SPD and SFD are responding to a reported two-car crash, with one “flipped,” in the 4700 block of 38th SW [vicinity map]. No serious injuries reported so far. 12:49 PM: The flipped car’s driver is reported to have run from the scene. Description from police radio: Black male teen, long curly hair, black hoodie and black pants. 1 PM: Added photo (thanks to Sharonn). Police are checking out damage to parked cars the driver may have hit. 11:50 AM: Thanks for the photos and tips. Two Seattle Fire crews are at the Ross store in Westwood Village. According to the dispatch, staff and customers evacuated the store because of a “natural gas odor.” 11:56 AM: Firefighters have just told dispatch “this appears to be an HVAC issue, no smoke or fire” so they’ll be leaving, 11:11 AM: Seattle Fire boats are arriving off Duwamish Head, to check out a ~30-foot sailboat reported to be adrift, with someone aboard. 11:16 AM: Meantime, SPD just reported to dispatch, “The Coast Guard has made contact with our boater in distress and is assisting them.” 11:07 PM: Police are at the 41st/Admiral gas station/minimart with a driver who is reported to have crashed her car into it. No, not a crash-grab; they’re investigating the possibility of impairment. No injuries reported. All we have so far is the screengrab above from the 41st/Admiral traffic cam, which has long been in black and white, but we’re on our way for a closer look. 11:27 PM: The car, described over police radio as a red Honda, is not in view, nor is the driver, nor are police, who are in their patrol cars. But our photo above is what the damage looks like, with a water machine knocked over into the east end of the mini-mart storefront. TUESDAY UPDATE: Police tell us the 31-year-old woman who was driving was arrested on suspicion of DUI. 3:28 PM: A few people have asked about the sizable police/fire response at Delridge/Andover. Radio communication indicated police were dealing with a combative person in crisis, and they called for SFD help so he could be taken to Harborview Medical Center for emergency behavioral-health care. 4:27 PM: We went back to re-listen to incident audio, and what happened, according to police and dispatch, is that an officer who was transporting someone in custody wound up in contact with the person in crisis, who was trying to get into his patrol car, so first the officer called for SPD backup, and then medical help. 9:18 AM: Thanks for the tip. Just after a reader called to tell us about this, after passing the scene while going the other way, SFD is just arriving at what they describe as a “rolled-over box truck” on the westbound West Seattle Bridge. One person is reported trapped, another got out. Updates to come. 9:22 AM: The person is reported to be safely out. SFD is dismissing most of its responders. We haven’t seen a photo, and there’s still no working traffic camera in the area, but from what the reader told us, sounds like this is at or near the curve. 11:59 AM: Thanks to Mike for sending a photo: 10:18 PM: Police and fire are arriving at the scene of what’s reported to be a car that went off the West Seattle Bridge down to East Marginal Way. Four people are reported hurt, three seriously. Updates to come. 10:25 PM: They’ve gotten everyone out of the crashed car, which is reported to be a Chevy Cruze that landed upside down. They haven’t said where they believe the car went off the bridge, but this is the address given to the response. 10:30 PM: So far they’re investigating the theory that the car went off the bridge on the offramp to 99. (Of note for those who don’t read this in real time, it’s raining fairly heavily right now.) 10:41 PM: Medics told dispatch all four patients are on the way to Harborview. Two of the four have been described as possibly 17 and 20 years old; the driver has been described as female. 10:50 PM: Added a photo. The ramp to 99 will be closed for the investigation, police just told dispatch. 10:57 PM: Now they’re saying via radio that this is actually the Harbor Island offramp from 99. 5:20 AM: SPD says one crash victim, a teenage boy who was ejected, has died, and the other three, including the 16-year-old girl who was driving, are in the hospital with “serious or critical injuries.” ADDED MONDAY: The King County Medical Examiner’s Office identifies the crash victim who died as 18-year-old Jayden T. Campbell. ADDED TUESDAY: He and at least some of the victims were from the Olympic Peninsula, according to this Peninsula Daily News report (thanks to Barbara for sending the link). 11:50 PM: SFD and SPD are headed to Beach Drive SW and SW Canada [map] after a report of a crash involving a car that’s reportedly on its side after its driver hit a house and parked vehicles. Updates to come. 11:57 PM: Officers just told dispatch they’re going to have Beach Drive closed both ways “for quite a while.” Meantime, SFD reports one person is trapped inside the vehicle that’s on its side, a “small SUV.” 12:14 AM: Added a photo just received via text. Also, SFD told dispatch they’re taking the driver to the hospital. 12:24 AM: Police just told dispatch they’ve reopened southbound Beach Drive. 1:25 AM: Another texter reports the vehicles are being towed and scene is being cleaned up, sending these photos: 9:39 AM: Seattle Fire medics are responding to Seacrest right now after a report of a diver who had been unconscious in the water. Via emergency radio, he is described as a man in his early 20s, brought to shore aboard a Water Taxi, and several SFD units have responded to treat him. 9:53 AM: No further radio updates so far. We’ll be following up with SFD. 1:55 PM: We just heard back from SFD spokesperson David Cuerpo, who says the diver is a 57-year-old woman and that she was in stable condition when transported to Virgina Mason. 9:04 PM: Police are on their way to what’s reported as a flipped-car crash in the 2100 block of 46th SW. The vehicle is described as a Toyota RAV-4 and dispatchers say callers reported the driver got out safely and does not want medical attention, so SFD is not going. The driver may have hit parked cars. We’re en route to look. 9:13 PM: SPD has called for SFD, saying the crashed vehicle “is a hybrid and it’s still running.” 9:28 PM: Added our crew’s photo atop the story. They report a tow truck arriving. … And below, a texted photo (thanks!): 9:35 PM: Police tell our crew the driver was arrested. He’s under investigation for possible DUI. 9:54 PM: Here’s reader video of the flipped car being righted by a tow crew: 5:01 PM: If you’re seeing emergency responders heading toward Don Armeni Boat Ramp – it’s another “boat sinking” call and SFD/SPD are trying to determine if it’s the same boat that’s drawn responses the past two days, and was supposed to be getting attention from the US Coast Guard and Department of Ecology too. 5:04 PM: They’ve verified it’s the same boat, which would make this the fourth response in three days for it. But one radio exchange suggested someone at the USCG told SFD the boat had been removed, so they’re trying to get that all straightened out. 6 PM: Postscript – the USCG was definitely there with the boat earlier this afternoon, reports Stewart L., who sent these photos: We’ll check on its status before dark. 9:22 PM: It was dark by the time we got there, but an effort appeared to be under way to get the boat onto a trailer. Here’s what we saw a little over an hour ago: ADDED 10:57 AM SATURDAY: Police have now been dispatched to Don Armeni for something related to this boat and report to dispatch that it’s still there, still on a trailer with a pickup hitched to it. 12:12 PM: Thanks for the tip about the Seattle Fire crews headed toward Don Armeni Boat Ramp. There’s a water-rescue response for a reported vessel in distress. They’re not sure, according to first units on scene, whether there’s anyone aboard the boat, but they’re planning a quick search to find out. (Added: Reader photo from Steve) 12:17 PM: SFD describes the boat as 18′, “partially submerged.” They’re sending in divers and rescue swimmers to be sure no one’s in the water. But as we suspected, it’s just been confirmed, this is the same boat that was towed to Don Armeni yesterday after taking on water off Beach Drive. 12:24 PM: “No one on boat, no one in danger” responders have just told dispatch. They’re trying to reach the boat owner with whom they made contact yesterday. 12:45 PM: Many of the responding units have been dismissed. Adding photo above, posted in a comment by Steve, and photo below, emailed by Stewart L. (Added: Reader photo from Stewart L.) 10;42 PM: As of about 8 pm, the boat was still alongside one of Don Armeni’s docks, half-submerged. 3:59 PM: Seattle Fire is responding by land and sea to a boat off Beach Drive (near Shore Place) with a man and dog on board, now reporting that they are taking on water, according to the dispatch. Responders got a call about this boat earlier today, but at the time, the boater was reported to have said he didn’t need help, just had a dead battery, so that response was canceled fairly quickly. 4:05 PM: Crews just told dispatch that the boater reports 2 1/2 feet of water in his engine compartment, so they’re trying to get some equipment to help with that. 4:43 PM: Thanks to the reader who texted that photo. The fireboat crew has just told dispatch that they’ll be towing the boat to Don Armeni Boat Ramp. (Added: Screenshot from SDOT traffic cam at 35th/Holden, showing responders outside Station 37) 3:01 PM: A “hazardous materials response” is happening right now at Seattle Fire Station 37 (35th/Holden). So far, according to radio exchanges, they’re reportedly dealing with a leaky 55-gallon drum of an “unknown substance,” in the alley behind the station. Police are being brought in for traffic control, so avoid the area for now. Updates as we hear them. 3:05 PM: Officers just told dispatch they’ll be blocking the east side of 35th/Holden, which is right in front of the fire station. 4:18 PM: No updates but it’s still an active incident. 4:31 PM: SFD just announced that they’ve determined the drum did NOT contain a hazardous substance, so the response is ending. 7:49 PM: We followed up on two questions with SFD spokesperson David Cuerpo. His replies: “The 55-gallon drum likely contained unfiltered water. How it ended up there is under investigation.” 3:27 PM: Emergency responders are headed for the 2600 block of Alki Avenue SW, where a person is reported in possible distress with a flipped canoe about 100 feet out. Updates to come. 3:29 PM UPDATE: Police/fire just told dispatch that the person in the canoe was assisted by paddleboarders and is no longer in trouble, so they’re canceling the response. 8:22 PM FRIDAY: Thanks for the tips. No serious injuries reported, but a harrowing close call according to witnesses, in a crash that ended in the carport under that building on Harbor Avenue. Police at the scene weren’t commenting, but witnesses say a mechanical problem might have factored into the driver of that Jeep first speeding through the Seacrest parking lot and then crossing Harbor Avenue, ending up crashed into at least one car in the carport. ADDED: Thanks to Jesse for the next two photos: ADDED MONDAY: A summary released today by SPD affirms evidence of mechanical trouble: At 1910 hours, a male was driving a rental at the 1600 BLK of Harbor Ave SW. The vehicle had mechanical issues and sped up. The driver pulled up the emergency brake when it sped up, but there were issues with that too. The driver struck a vehicle, METRO pole, and another vehicle. The vehicle pushed a vehicle up against an apartment building. SFST tests were conducted and the PBT was used, and the driver didn’t show signs of impairment. A collision report was completed, and there was evidence of mechanical issues on the vehicle. 2:16 PM: Fire and police personnel are rushing by sea and land to search for a diver who’s been reported missing, reported to have last been seen between Salty’s (1936 Harbor SW) and Marination (1660 Harbor SW). 2:21 PM: Emergency personnel report they’ve made contact with the diver who was feared missing, and the response is being canceled. 10:08 PM: Every Fourth of July, right about now, we start live-chronicling what police/fire responders are handling. And as usual, it’s busy. For one, police have just implemented a traffic plan and are blocking Harbor/Alki to traffic beyond what’s already there. If you’re headed that way – don’t, until the Lake Union fireworks are over and things start clearing out 11-ish. More to come … 10:18 PM: The traffic-blocking was related to a felony incident they’re just wrapping up, also requiring a tow truck to impound a vehicle. The vast majority of Southwest Precinct activity these past few hours has been in the Alki area. And now there’s a foot pursuit near Duwamish Head involving possibly armed suspects, 1300 block Alki SW, “possibly a strong-arm robbery, six juveniles.” 10:33 PM: Now police have a reported juvenile suspect “barricaded in a bathroom” toward the north end of California SW (they’re trying to straighten out the location)…. Meantime, if you’re wandering, there’s been virtually no mention of fireworks, trouble or otherwise, over the air, for quite some time, though plenty are being set off here in Fauntleroy and certainly elsewhere. … The aforementioned California SW standoffresponse is described as inside an apartment building. 11:40 PM: Thanks to commenters who solved the standoff situation – 7100 California, not 1700. Not a juvenile. And lots of fireworks calls now. … “Car fire” SFD response at California/Oregon. 12:45 AM: Stabbing in 7700 block 17th SW, The victim is a 17-year-old girl. 5:00 AM: Here’s the SPD summary of last night’s major arrest on Alki: At 2000 hours, Officers were flagged down on Alki Av SW by a victim. The victim stated that an unknown suspect brandished a firearm at the victim, and he felt fearful for his life. Officers quickly checked the area and located the suspect that the victim positively identified on Alki Av Sw. Officers placed the suspect into custody and recovered a firearm on the suspect. The suspect was transported to KCJ and booked for Felony Harassment. We don’t have further info about the stabbing yet but will add it when we do. 5:13 AM: Just off the Harbor exit of the westbound bridge, police are trying to contact suspect(s) in a car after stopping it via PIT following a 90 mph-pursuit from somewhere east of West Seattle. Haven’t heard what they pursued for, but they’re calling for reinforcements. … Update: That’s the Harbor ISLAND exit, officers are telling dispatch, and they have one person in custody. 5:42 AM: The Harbor Island exits from the bridge and 99 will be blocked while this investigation – with a revised location, Spokane/Klickitat beneath the bridge – continues. One snippet of info, it involved a gun. 6:25 AM: The exits have reopened. And we’ve also heard it noted that this incident – which, again, started outside West Seattle – involved a burglary. 11:14 AM: SFD says the stabbing victim was in stable condition when transported. We don’t have police info on the case yet. 1:03 PM: Here’s what police just posted to SPD Blotter: Seattle police detectives are investigating the violent stabbing of a 17-year-old girl in the Delridge neighborhood in West Seattle this morning. At about 12:20 a.m., patrol officers responded to reports of a burglary and assault in the 7100 block of 17th Avenue Southwest. When police arrived, they found blood on the door and made immediate entry into the house believing the suspects were still inside. Inside, they found the victim with multiple stab wounds all over her body and she had significant blood loss. Officers pulled her to safety, and the Seattle Fire Department (SFD) provided her with medical treatment. SFD transported her to Harborview Medical Center in serious, but stable condition. Patrol officers set up a security perimeter around the house until the Hostage Negotiation Team and the SWAT team arrived on scene. Officers applied for a search warrant, and it was signed by a judge. Ultimately, SWAT searched the house, but they did not find the suspects. While investigating, officers learned the teen suspects, a boy and girl, ran from the house before officers arrived. The circumstances leading up to the violent assault are under investigation. If anyone has information, they are asked to the SPD Violent Crimes Tip Line at 206-233-5000. Anonymous tips are accepted. Detectives in the Homicide and Assault Unit are assigned to this case. Incident Number: 2025-187428 7:44 PM SATURDAY: Another SPD Blotter post tonightreveals an arrest for one of last night’s other incidents in the wider Alki area; most “suspected shots fired” calls last night were fireworks, but not this one: On July 4, at about 9:00 p.m., patrol officers responded to reports of someone shooting out of the sunroof of a car in the 2400 block of Harbor Avenue Southwest. There, police located a shell casing and interviewed witnesses. There were no reported injuries or property damage. While investigating, officers found the suspect driving nearby on Harbor Avenue Southwest and performed a high-risk traffic stop. Police detained all the occupants while they further investigated. Officers could see a bullet shell casing on the rear floorboard of the car. Ultimately, police determined the driver to be the shooter, and they arrested him. The two passengers were investigated and released. Officers impounded the car to the Vehicle Processing Room for further evidence search. Police booked the suspect (23 years old) into the King County Jail for Investigation of Drive-By Shooting. 6:21 PM: If you’re heading toward the 1st Avenue South Bridge, you might want to wait a while. There’s an emergency response at the onramp on the south end of the northbound bridge, after a driver reportedly went into the retention pond alongside the ramp. The water is reported to be only about two feet deep so they’ve downsized this from the originally dispatched rescue response. 6:25 PM: According to SFD, “Crews were not able to find any occupants inside or around the vehicle.” … This is the closest traffic camera, but it’s WSDOT, not SDOT, and doesn’t enlarge clearly. 12:55 AM: In case you wondered about thr sirens, SFD had a “fire in building” response for 30th/Henderson, but it turned out to be minor, and everyone’s been dismissed. … (Update) Turned out to be a “small propane stove, turned on.”"
}