{
  "url": "https://www.yanceybros.com/about/yancey-divisions/",
  "title": "Yancey's Family of Brands | Built in Georgia",
  "text": "Our oldest division sells and supports the large population of Caterpillar earthmoving, mining, quarry, paving, forestry, road building, and construction equipment across the state of Georgia. In addition to the complete line-up of Caterpillar equipment, we also provide customers across Georgia with Weiler Forestry and Paving Equipment, and Gomaco Paving Equipment. We have fifteen Machine Service Centers located across Georgia that support sales, parts and service operations and serve our customers’ needs. Yancey Rents offers a huge assortment of late model, low hour construction equipment rental units from boom and scissor lifts to concrete saws, to Caterpillar skid steers, dozers and wheel loaders. We also have top quality new and used general and heavy construction equipment for sale. We are available 24/7 to support any equipment rental needs our customers have through 15 locations across Georgia. Yancey Power Systems supplies critical emergency, backup and conditioning power systems to a wide range of industries including healthcare, data centers and manufacturing facilities. In addition to turnkey project management for standby power installations, we provide complete support to ensure your power equipment operates when you need it. We also provide rental power and HVAC across the state of Georgia. Our Rig360 Truck shops offer parts and service for all makes and models of on-highway trucks. And we also sell and service marine engines for both commercial and pleasure craft. Yancey Engineered Solutions provides customers across the world with quality packaging, containerization and acoustic services and is a leader in rotating equipment packaging and engineering. Our Griffin, GA facility specializes in fabrication, testing and reconditioning services for sound-attenuated and weather-resistive enclosures. In 2009 YES earned the distinction of being the first power generation packaging and testing organization in the U.S. to achieve the ISO 9001:2000 level of quality. Yancey Bus Sales & Service is Georgia’s full-service provider for Blue Bird Bus sales, parts and service. We also can provide parts and service solutions for other makes and models. We specialize in equipping new and used busses with Fire Suppression Systems, Air Conditioning and Digital Video Recorders. With locations conveniently located across Georgia, Yancey Bus is ready to assist you with any bus transportation need. Pathfinder Power Solutions is the appointed Perkins® distributor for the Southeast region of the United States. We offer complete sales, engineering, support, parts, and service for customers in Alabama, Arkansas, Florida, Georgia, Louisiana, Mississippi, North Carolina, South Carolina, and Tennessee. Perkins engines are found at the heart of machines across thousands of applications. Pathfinder is headquartered in Smyrna, GA, and offers completely customizable engines between 0.5 and 18 liters to power any job."
}