{
  "url": "https://en.m.wikipedia.org/wiki/Planet",
  "title": "Planet - Wikipedia",
  "text": "Planet A planet is a large, rounded astronomical body that is generally required to be in orbit around a star, stellar remnant, or brown dwarf, and is not one itself.[1] The Solar System has eight planets by the most restrictive definition of the term: the terrestrial planets Mercury, Venus, Earth, and Mars, and the giant planets Jupiter, Saturn, Uranus, and Neptune. The best available theory of planet formation is the nebular hypothesis, which posits that an interstellar cloud collapses out of a nebula to create a young protostar orbited by a protoplanetary disk. Planets grow in this disk by the gradual accumulation of material driven by gravity, a process called accretion. The word planet comes from the Greek πλανήται (planḗtai) 'wanderers'. In antiquity, this word referred to the Sun, Moon, and five points of light visible to the naked eye that moved across the background of the stars—namely, Mercury, Venus, Mars, Jupiter, and Saturn. Planets have historically had religious associations: multiple cultures identified celestial bodies with gods, and these connections with mythology and folklore persist in the schemes for naming newly discovered Solar System bodies. Earth itself was recognized as a planet when heliocentrism supplanted geocentrism during the 16th and 17th centuries. With the development of the telescope, the meaning of planet broadened to include objects only visible with assistance: the moons of the planets beyond Earth; the ice giants Uranus and Neptune; Ceres and other bodies later recognized to be part of the asteroid belt; and Pluto, later found to be the largest member of the collection of icy bodies known as the Kuiper belt. The discovery of other large objects in the Kuiper belt, particularly Eris, spurred debate about how exactly to define a planet. In 2006, the International Astronomical Union (IAU) adopted a definition of a planet in the Solar System, placing the four terrestrial planets and the four giant planets in the planet category; Ceres, Pluto, and Eris are in the category of dwarf planet.[2][3][4] Many planetary scientists have nonetheless continued to apply the term planet more broadly, including dwarf planets as well as rounded satellites like the Moon.[5] Further advances in astronomy led to the discovery of over 5,900 planets outside the Solar System, termed exoplanets. These often show unusual features that the Solar System planets do not show, such as hot Jupiters—giant planets that orbit close to their parent stars, like 51 Pegasi b—and extremely eccentric orbits, such as HD 20782 b. The discovery of brown dwarfs and planets larger than Jupiter also spurred debate on the definition, regarding where exactly to draw the line between a planet and a star. Multiple exoplanets have been found to orbit in the habitable zones of their stars (where liquid water can potentially exist on a planetary surface), but Earth remains the only planet known to support life. Such a habitable zone is complicated by many factors, such as the atmospheric composition (if there is an atmosphere) of the planet; Mars, for example, has the temperature during the day to form liquid water on its surface on the equator, if only the pressure were higher. Formation It is not known with certainty how planets are formed. The prevailing theory is that they coalesce during the collapse of a nebula into a thin disk of gas and dust. A protostar forms at the core, surrounded by a rotating protoplanetary disk. Through accretion (a process of sticky collision) dust particles in the disk steadily accumulate mass to form ever-larger bodies. Local concentrations of mass known as planetesimals form, and these accelerate the accretion process by drawing in additional material by their gravitational attraction. These concentrations become increasingly dense until they collapse inward under gravity to form protoplanets.[6] After a planet reaches a mass somewhat larger than Mars's mass, it begins to accumulate an extended atmosphere,[7] greatly increasing the capture rate of the planetesimals by means of atmospheric drag.[8][9] Depending on the accretion history of solids and gas, a giant planet, an ice giant, or a terrestrial planet may result.[10][11][12] It is thought that the regular satellites of Jupiter, Saturn, and Uranus formed in a similar way;[13][14] however, Triton was likely captured by Neptune,[15] and Earth's Moon[16] and Pluto's Charon might have formed in collisions.[17] When the protostar has grown such that it ignites to form a star, the surviving disk is removed from the inside outward by photoevaporation, the solar wind, Poynting–Robertson drag and other effects.[18][19] Thereafter there still may be many protoplanets orbiting the star or each other, but over time many will collide, either to form a larger, combined protoplanet or release material for other protoplanets to absorb.[20] Those objects that have become massive enough will capture most matter in their orbital neighbourhoods to become planets. Protoplanets that have avoided collisions may become natural satellites of planets through a process of gravitational capture, or remain in belts of other objects to become either dwarf planets or small bodies.[21][22] The energetic impacts of the smaller planetesimals (as well as radioactive decay) will heat up the growing planet, causing it to at least partially melt. The interior of the planet begins to differentiate by density, with higher density materials sinking toward the core.[23] Smaller terrestrial planets lose most of their atmospheres because of this accretion, but the lost gases can be replaced by outgassing from the mantle and from the subsequent impact of comets[24] (smaller planets will lose any atmosphere they gain through various escape mechanisms[25]). With the discovery and observation of planetary systems around stars other than the Sun, it is becoming possible to elaborate, revise or even replace this account. The level of metallicity—an astronomical term describing the abundance of chemical elements with an atomic number greater than 2 (helium)—appears to determine the likelihood that a star will have planets.[26][27] Hence, a metal-rich population I star is more likely to have a substantial planetary system than a metal-poor, population II star.[28] Planets in the Solar System According to the IAU definition, there are eight planets in the Solar System, which are (in increasing distance from the Sun):[2] Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. Jupiter is the largest, at 318 Earth masses, whereas Mercury is the smallest, at 0.055 Earth masses.[29] The planets of the Solar System can be divided into categories based on their composition. Terrestrials are similar to Earth, with bodies largely composed of rock and metal: Mercury, Venus, Earth, and Mars. Earth is the largest terrestrial planet.[30] Giant planets are significantly more massive than the terrestrials: Jupiter, Saturn, Uranus, and Neptune.[30] They differ from the terrestrial planets in composition. The gas giants, Jupiter and Saturn, are primarily composed of hydrogen and helium and are the most massive planets in the Solar System. Saturn is one third as massive as Jupiter, at 95 Earth masses.[31] The ice giants, Uranus and Neptune, are primarily composed of low-boiling-point materials such as water, methane, and ammonia, with thick atmospheres of hydrogen and helium. They have a significantly lower mass than the gas giants (only 14 and 17 Earth masses).[31] Dwarf planets are gravitationally rounded, but have not cleared their orbits of other bodies. In increasing order of average distance from the Sun, the ones generally agreed among astronomers are Ceres, Orcus, Pluto, Haumea, Quaoar, Makemake, Gonggong, Eris, and Sedna.[32][33] Ceres is the largest object in the asteroid belt, located between the orbits of Mars and Jupiter. The other eight all orbit beyond Neptune. Orcus, Pluto, Haumea, Quaoar, and Makemake orbit in the Kuiper belt, which is a second belt of small Solar System bodies beyond the orbit of Neptune. Gonggong and Eris orbit in the scattered disc, which is somewhat further out and, unlike the Kuiper belt, is unstable towards interactions with Neptune. Sedna is the largest known detached object, a population that never comes close enough to the Sun to interact with any of the classical planets; the origins of their orbits are still being debated. All nine are similar to terrestrial planets in having a solid surface, but they are made of ice and rock rather than rock and metal. Moreover, all of them are smaller than Mercury, with Pluto being the largest known dwarf planet and Eris being the most massive.[34][35] There are at least nineteen planetary-mass moons or satellite planets—moons large enough to take on ellipsoidal shapes:[4] - One satellite of Earth: the Moon - Four satellites of Jupiter: Io, Europa, Ganymede, and Callisto - Seven satellites of Saturn: Mimas, Enceladus, Tethys, Dione, Rhea, Titan, and Iapetus - Five satellites of Uranus: Miranda, Ariel, Umbriel, Titania, and Oberon - One satellite of Neptune: Triton - One satellite of Pluto: Charon The Moon, Io, and Europa have compositions similar to the terrestrial planets; the others are made of ice and rock like the dwarf planets, with Tethys being made of almost pure ice. Europa is often considered an icy planet, though, because its surface ice layer makes it difficult to study its interior.[4][36] Ganymede and Titan are larger than Mercury by radius, and Callisto almost equals it, but all three are much less massive. Mimas is the smallest object generally agreed to be a geophysical planet, at about six millionths of Earth's mass, though there are many larger bodies that may not be geophysical planets (e.g. Salacia).[32] Exoplanets An exoplanet is a planet outside the Solar System. As of 30 October 2025, there are 6,128 confirmed exoplanets in 4,584 planetary systems, with 1,017 systems having more than one planet.[38] Known exoplanets range in size from gas giants about twice as large as Jupiter down to just over the size of the Moon. Analysis of gravitational microlensing data suggests a minimum average of 1.6 bound planets for every star in the Milky Way.[39] In early 1992, radio astronomers Aleksander Wolszczan and Dale Frail announced the discovery of two planets orbiting the pulsar PSR 1257+12.[40] This discovery was confirmed and is generally considered to be the first definitive detection of exoplanets. Researchers suspect they formed from a disk remnant left over from the supernova that produced the pulsar.[41] The first confirmed discovery of an exoplanet orbiting an ordinary main-sequence star occurred on 6 October 1995, when Michel Mayor and Didier Queloz of the University of Geneva announced the detection of 51 Pegasi b, an exoplanet around 51 Pegasi.[42] From then until the Kepler space telescope mission, most of the known exoplanets were gas giants comparable in mass to Jupiter or larger as they were more easily detected. The catalog of Kepler candidate planets consists mostly of planets the size of Neptune and smaller, down to smaller than Mercury.[43][44] In 2011, the Kepler space telescope team reported the discovery of the first Earth-sized exoplanets orbiting a Sun-like star, Kepler-20e and Kepler-20f.[45][46][47] Since that time, more than 100 planets have been identified that are approximately the same size as Earth, 20 of which orbit in the habitable zone of their star—the range of orbits where a terrestrial planet could sustain liquid water on its surface, given enough atmospheric pressure.[48][49][50] One in five Sun-like stars is thought to have an Earth-sized planet in its habitable zone, which suggests that the nearest would be expected to be within 12 light-years distance from Earth.[a] The frequency of occurrence of such terrestrial planets is one of the variables in the Drake equation, which estimates the number of intelligent, communicating civilizations that exist in the Milky Way.[53] There are types of planets that do not exist in the Solar System: super-Earths and mini-Neptunes, which have masses between that of Earth and Neptune. Objects less than about twice the mass of Earth are expected to be rocky like Earth; beyond that, they become a mixture of volatiles and gas like Neptune.[54] The planet Gliese 581c, with a mass 5.5–10.4 times the mass of Earth,[55] attracted attention upon its discovery for potentially being in the habitable zone,[56] though later studies concluded that it is actually too close to its star to be habitable.[57] Planets more massive than Jupiter are also known, extending seamlessly into the realm of brown dwarfs.[58] Exoplanets have been found that are much closer to their parent star than any planet in the Solar System is to the Sun. Mercury, the closest planet to the Sun at 0.4 AU, takes 88 days for an orbit, but ultra-short period planets can orbit in less than a day. The Kepler-11 system has five of its planets in shorter orbits than Mercury's, all of them much more massive than Mercury. There are hot Jupiters, such as 51 Pegasi b,[42] that orbit very close to their star and may evaporate to become chthonian planets, which are the leftover cores. There are also exoplanets that are much farther from their star. Neptune is 30 AU from the Sun and takes 165 years to orbit, but there are exoplanets that are thousands of AU from their star and take more than a million years to orbit (e.g. COCONUTS-2b).[59] Attributes Although each planet has unique physical characteristics, a number of broad commonalities do exist among them. Some of these characteristics, such as rings or natural satellites, have only as yet been observed in planets in the Solar System, whereas others are commonly observed in exoplanets.[60] Dynamic characteristics Orbit In the Solar System, all the planets orbit the Sun in the same direction as the Sun rotates: counter-clockwise as seen from above the Sun's north pole. At least one exoplanet, WASP-17b, has been found to orbit in the opposite direction to its star's rotation.[61] The period of one revolution of a planet's orbit is known as its sidereal period or year.[62] A planet's year depends on its distance from its star; the farther a planet is from its star, the longer the distance it must travel and the slower its speed, since it is less affected by its star's gravity.[citation needed] No planet's orbit is perfectly circular, and hence the distance of each from the host star varies over the course of its year. The closest approach to its star is called its periastron, or perihelion in the Solar System, whereas its farthest separation from the star is called its apastron (aphelion). As a planet approaches periastron, its speed increases as it trades gravitational potential energy for kinetic energy, just as a falling object on Earth accelerates as it falls. As the planet nears apastron, its speed decreases, just as an object thrown upwards on Earth slows down as it reaches the apex of its trajectory.[63] Each planet's orbit is delineated by a set of elements: - The eccentricity of an orbit describes the elongation of a planet's elliptical (oval) orbit. Planets with low eccentricities have more circular orbits, whereas planets with high eccentricities have more elliptical orbits. The planets and large moons in the Solar System have relatively low eccentricities, and thus nearly circular orbits.[62] The comets and many Kuiper belt objects, as well as several exoplanets, have very high eccentricities, and thus exceedingly elliptical orbits.[64][65] - The semi-major axis gives the size of the orbit. It is the distance from the midpoint to the longest diameter of its elliptical orbit. This distance is not the same as its apastron, because no planet's orbit has its star at its exact centre.[62] - The inclination of a planet tells how far above or below an established reference plane its orbit is tilted. In the Solar System, the reference plane is the plane of Earth's orbit, called the ecliptic. For exoplanets, the plane, known as the sky plane or plane of the sky, is the plane perpendicular to the observer's line of sight from Earth.[66] The orbits of the eight major planets of the Solar System all lie very close to the ecliptic; however, some smaller objects like Pallas, Pluto, and Eris orbit at far more extreme angles to it, as do comets.[67] The large moons are generally not very inclined to their parent planets' equators, but Earth's Moon, Saturn's Iapetus, and Neptune's Triton are exceptions. Triton is unique among the large moons in that it orbits retrograde, i.e. in the direction opposite to its parent planet's rotation.[68] - The points at which a planet crosses above and below its reference plane are called its ascending and descending nodes.[62] The longitude of the ascending node is the angle between the reference plane's 0 longitude and the planet's ascending node. The argument of periapsis (or perihelion in the Solar System) is the angle between a planet's ascending node and its closest approach to its star.[62] Axial tilt Planets have varying degrees of axial tilt; they spin at an angle to the plane of their stars' equators. This causes the amount of light received by each hemisphere to vary over the course of its year; when the Northern Hemisphere points away from its star, the Southern Hemisphere points towards it, and vice versa. Each planet therefore has seasons, resulting in changes to the climate over the course of its year. The time at which each hemisphere points farthest or nearest from its star is known as its solstice. Each planet has two in the course of its orbit; when one hemisphere has its summer solstice with its day being the longest, the other has its winter solstice when its day is shortest. The varying amount of light and heat received by each hemisphere creates annual changes in weather patterns for each half of the planet. Jupiter's axial tilt is very small, so its seasonal variation is minimal; Uranus, on the other hand, has an axial tilt so extreme it is virtually on its side, which means that its hemispheres are either continually in sunlight or continually in darkness around the time of its solstices.[69] In the Solar System, Mercury, Venus, Ceres, and Jupiter have very small tilts; Pallas, Uranus, and Pluto have extreme ones; and Earth, Mars, Vesta, Saturn, and Neptune have moderate ones.[70][71][72][73] Among exoplanets, axial tilts are not known for certain, though most hot Jupiters are believed to have a negligible axial tilt as a result of their proximity to their stars.[74] Similarly, the axial tilts of the planetary-mass moons are near zero,[75] with Earth's Moon at 6.687° as the biggest exception;[76] additionally, Callisto's axial tilt varies between 0 and about 2 degrees on timescales of thousands of years.[77] Rotation The planets rotate around invisible axes through their centres. A planet's rotation period is known as a stellar day. Most of the planets in the Solar System rotate in the same direction as they orbit the Sun, which is counter-clockwise as seen from above the Sun's north pole. The exceptions are Venus[78] and Uranus,[79] which rotate clockwise, though Uranus's extreme axial tilt means there are differing conventions on which of its poles is \"north\", and therefore whether it is rotating clockwise or anti-clockwise.[80] Regardless of which convention is used, Uranus has a retrograde rotation relative to its orbit.[79] The rotation of a planet can be induced by several factors during formation. A net angular momentum can be induced by the individual angular momentum contributions of accreted objects. The accretion of gas by the giant planets contributes to the angular momentum. Finally, during the last stages of planet building, a stochastic process of protoplanetary accretion can randomly alter the spin axis of the planet.[81] There is great variation in the length of day between the planets, with Venus taking 243 days to rotate, and the giant planets only a few hours.[82] The rotational periods of exoplanets are not known, but for hot Jupiters, their proximity to their stars means that they are tidally locked (that is, their orbits are in sync with their rotations). This means, they always show one face to their stars, with one side in perpetual day, the other in perpetual night.[83] Mercury and Venus, the closest planets to the Sun, similarly exhibit very slow rotation: Mercury is tidally locked into a 3:2 spin–orbit resonance (rotating three times for every two revolutions around the Sun),[84] and Venus's rotation may be in equilibrium between tidal forces slowing it down and atmospheric tides created by solar heating speeding it up.[85][86] All the large moons are tidally locked to their parent planets;[87] Pluto and Charon are tidally locked to each other,[88] as are Eris and Dysnomia,[89] and probably Orcus and its moon Vanth.[90] The other dwarf planets with known rotation periods rotate faster than Earth; Haumea rotates so fast that it has been distorted into a triaxial ellipsoid.[91] The exoplanet Tau Boötis b and its parent star Tau Boötis appear to be mutually tidally locked.[92][93] Orbital clearing The defining dynamic characteristic of a planet, according to the IAU definition, is that it has cleared its neighborhood. A planet that has cleared its neighborhood has accumulated enough mass to gather up or sweep away all the planetesimals in its orbit. In effect, it orbits its star in isolation, as opposed to sharing its orbit with a multitude of similar-sized objects. As described above, this characteristic was mandated as part of the IAU's official definition of a planet in August 2006.[2] Although to date this criterion only applies to the Solar System, a number of young extrasolar systems have been found in which evidence suggests orbital clearing is taking place within their circumstellar discs.[94] Physical characteristics Size and shape Gravity causes planets to be pulled into a roughly spherical shape, so a planet's size can be expressed roughly by an average radius (for example, Earth radius or Jupiter radius). However, planets are not perfectly spherical; for example, the Earth's rotation causes it to be slightly flattened at the poles with a bulge around the equator.[95] Therefore, a better approximation of Earth's shape is an oblate spheroid, whose equatorial diameter is 43 kilometers (27 mi) larger than the pole-to-pole diameter.[96] Generally, a planet's shape may be described by giving polar and equatorial radii of a spheroid or specifying a reference ellipsoid. From such a specification, the planet's flattening, surface area, and volume can be calculated; its normal gravity can be computed knowing its size, shape, rotation rate, and mass.[97] Mass A planet's defining physical characteristic is that it is massive enough for the force of its own gravity to dominate over the electromagnetic forces binding its physical structure, leading to a state of hydrostatic equilibrium. This effectively means that all planets are spherical or spheroidal. Up to a certain mass, an object can be irregular in shape, but beyond that point, which varies depending on the chemical makeup of the object, gravity begins to pull an object towards its own centre of mass until the object collapses into a sphere.[98] Mass is the prime attribute by which planets are distinguished from stars. No objects between the masses of the Sun and Jupiter exist in the Solar System, but there are exoplanets of this size. The lower stellar mass limit is estimated to be around 75 to 80 times that of Jupiter (MJ). Some authors advocate that this be used as the upper limit for planethood, on the grounds that the internal physics of objects does not change between approximately one Saturn mass (beginning of significant self-compression) and the onset of hydrogen burning and becoming a red dwarf star.[54] Beyond roughly 13 MJ (at least for objects with solar-type isotopic abundance), an object achieves conditions suitable for nuclear fusion of deuterium: this has sometimes been advocated as a boundary,[99] even though deuterium burning does not last very long and most brown dwarfs have long since finished burning their deuterium.[58] This is not universally agreed upon: the exoplanets Encyclopaedia includes objects up to 60 MJ,[100] and the Exoplanet Data Explorer up to 24 MJ.[101] The smallest known exoplanet with an accurately known mass is PSR B1257+12A, one of the first exoplanets discovered, which was found in 1992 in orbit around a pulsar. Its mass is roughly half that of the planet Mercury.[102] Even smaller is WD 1145+017 b, orbiting a white dwarf; its mass is roughly that of the dwarf planet Haumea, and it is typically termed a minor planet.[103] The smallest known planet orbiting a main-sequence star other than the Sun is Kepler-37b, with a mass (and radius) that is probably slightly higher than that of the Moon.[44] The smallest object in the Solar System generally agreed to be a geophysical planet is Saturn's moon Mimas, with a radius about 3.1% of Earth's and a mass about 0.00063% of Earth's.[104] Saturn's smaller moon Phoebe, currently an irregular body of 1.7% Earth's radius[105] and 0.00014% Earth's mass,[104] is thought to have attained hydrostatic equilibrium and differentiation early in its history before being battered out of shape by impacts.[106] Some asteroids may be fragments of protoplanets that began to accrete and differentiate, but suffered catastrophic collisions, leaving only a metallic or rocky core today,[107][108][109] or a reaccumulation of the resulting debris.[110] Internal differentiation Every planet began its existence in an entirely fluid state; in early formation, the denser, heavier materials sank to the centre, leaving the lighter materials near the surface. Each therefore has a differentiated interior consisting of a dense planetary core surrounded by a mantle that either is or was a fluid. The terrestrial planets' mantles are sealed within hard crusts,[111] but in the giant planets the mantle simply blends into the upper cloud layers. The terrestrial planets have cores of elements such as iron and nickel and mantles of silicates. Jupiter and Saturn are believed to have cores of rock and metal surrounded by mantles of metallic hydrogen.[112] Uranus and Neptune, which are smaller, have rocky cores surrounded by mantles of water, ammonia, methane, and other ices.[113] The fluid action within these planets' cores creates a geodynamo that generates a magnetic field.[111] Similar differentiation processes are believed to have occurred on some of the large moons and dwarf planets,[32] though the process may not always have been completed: Ceres, Callisto, and Titan appear to be incompletely differentiated.[114][115] The asteroid Vesta, though not a dwarf planet because it was battered by impacts out of roundness, has a differentiated interior[116] similar to that of Venus, Earth, and Mars.[109] Atmosphere All of the Solar System planets except Mercury[117] have substantial atmospheres because their gravity is strong enough to keep gases close to the surface. Saturn's largest moon Titan also has a substantial atmosphere thicker than that of Earth;[118] Neptune's largest moon Triton[119] and the dwarf planet Pluto have more tenuous atmospheres.[120] The larger giant planets are massive enough to keep large amounts of the light gases hydrogen and helium, whereas the smaller planets lose these gases into space.[121] Analysis of exoplanets suggests that the threshold for being able to hold on to these light gases occurs at about 2.0+0.7 −0.6 M🜨, so that Earth and Venus are near the maximum size for rocky planets.[54] The composition of Earth's atmosphere is different from the other planets because the various life processes that have transpired on the planet have introduced free molecular oxygen.[122] The atmospheres of Mars and Venus are both dominated by carbon dioxide, but differ drastically in density: the average surface pressure of Mars's atmosphere is less than 1% that of Earth's (too low to allow liquid water to exist),[123] while the average surface pressure of Venus's atmosphere is about 92 times that of Earth's.[124] It is likely that Venus's atmosphere was the result of a runaway greenhouse effect in its history, which today makes it the hottest planet by surface temperature, hotter even than Mercury.[125] Despite hostile surface conditions, temperature, and pressure at about 50–55 km altitude in Venus's atmosphere are close to Earthlike conditions (the only place in the Solar System beyond Earth where this is so), and this region has been suggested as a plausible base for future human exploration.[126] Titan has the only dense nitrogen-rich planetary atmosphere in the Solar System other than Earth's. Just as Earth's conditions are close to the triple point of water, allowing it to exist in all three states on the planet's surface, so Titan's are to the triple point of methane.[127] Planetary atmospheres are affected by the varying insolation or internal energy, leading to the formation of dynamic weather systems such as hurricanes (on Earth), planet-wide dust storms (on Mars), a greater-than-Earth-sized anticyclone on Jupiter (called the Great Red Spot), and holes in the atmosphere (on Neptune).[69] Weather patterns detected on exoplanets include a hot region on HD 189733 b twice the size of the Great Red Spot,[128] as well as clouds on the hot Jupiter Kepler-7b,[129] the super-Earth Gliese 1214 b, and others.[130][131] Hot Jupiters, due to their extreme proximities to their host stars, have been shown to be losing their atmospheres into space due to stellar radiation, much like the tails of comets.[132][133] These planets may have vast differences in temperature between their day and night sides that produce supersonic winds,[134] although multiple factors are involved and the details of the atmospheric dynamics that affect the day-night temperature difference are complex.[135][136] Magnetosphere One important characteristic of the planets is their intrinsic magnetic moments, which in turn give rise to magnetospheres. The presence of a magnetic field indicates that the planet is still geologically alive. In other words, magnetized planets have flows of electrically conducting material in their interiors, which generate their magnetic fields. These fields significantly change the interaction of the planet and solar wind. A magnetized planet creates a cavity in the solar wind around itself called the magnetosphere, which the wind cannot penetrate. The magnetosphere can be much larger than the planet itself. In contrast, non-magnetized planets have only small magnetospheres induced by interaction of the ionosphere with the solar wind, which cannot effectively protect the planet.[137] Of the eight planets in the Solar System, only Venus and Mars lack such a magnetic field.[137] Of the magnetized planets, the magnetic field of Mercury is the weakest and is barely able to deflect the solar wind. Jupiter's moon Ganymede has a magnetic field several times stronger, and Jupiter's is the strongest in the Solar System (so intense in fact that it poses a serious health risk to future crewed missions to all its moons inward of Callisto[138]). The magnetic fields of the other giant planets, measured at their surfaces, are roughly similar in strength to that of Earth, but their magnetic moments are significantly larger. The magnetic fields of Uranus and Neptune are strongly tilted relative to the planets' rotational axes and displaced from the planets' centres.[137] In 2003, a team of astronomers in Hawaii observing the star HD 179949 detected a bright spot on its surface, apparently created by the magnetosphere of an orbiting hot Jupiter.[139][140] Secondary characteristics Several planets or dwarf planets in the Solar System (such as Neptune and Pluto) have orbital periods that are in resonance with each other or with smaller bodies. This is common in satellite systems (e.g. the resonance between Io, Europa, and Ganymede around Jupiter, or between Enceladus and Dione around Saturn). All except Mercury and Venus have natural satellites, often called \"moons\". Earth has one, Mars has two, and the giant planets have numerous moons in complex planetary-type systems. Except for Ceres and Sedna, all the consensus dwarf planets are known to have at least one moon as well. Many moons of the giant planets have features similar to those on the terrestrial planets and dwarf planets, and some have been studied as possible abodes of life (especially Europa and Enceladus).[141][142][143][144][145] The four giant planets are orbited by planetary rings of varying size and complexity. The rings are composed primarily of dust or particulate matter, but can host tiny 'moonlets' whose gravity shapes and maintains their structure. Although the origins of planetary rings are not precisely known, they are believed to be the result of natural satellites that fell below their parent planets' Roche limits and were torn apart by tidal forces.[146][147] The dwarf planets Haumea[148] and Quaoar also have rings.[149] No secondary characteristics have been observed around exoplanets. The sub-brown dwarf Cha 110913−773444, which has been described as a rogue planet, is believed to be orbited by a tiny protoplanetary disc,[150] and the sub-brown dwarf OTS 44 was shown to be surrounded by a substantial protoplanetary disk of at least 10 Earth masses.[151] History and etymology The idea of planets has evolved over the history of astronomy, from the divine lights of antiquity to the earthly objects of the scientific age. The concept has expanded to include worlds not only in the Solar System, but in multitudes of other extrasolar systems. The consensus as to what counts as a planet, as opposed to other objects, has changed several times. It previously encompassed asteroids, moons, and dwarf planets like Pluto,[152][153][154] and there continues to be some disagreement today.[154] Ancient civilizations and classical planets The five classical planets of the Solar System, being visible to the naked eye, have been known since ancient times and have had a significant impact on mythology, religious cosmology, and ancient astronomy. In ancient times, astronomers noted how certain lights moved across the sky, as opposed to the \"fixed stars\", which maintained a constant relative position in the sky.[155] Ancient Greeks called these lights πλάνητες ἀστέρες (planētes asteres) 'wandering stars' or simply πλανῆται (planētai) 'wanderers'[156] from which today's word \"planet\" was derived.[157][158][159] In ancient Greece, China, Babylon, and indeed all pre-modern civilizations,[160][161] it was almost universally believed that Earth was the center of the Universe and that all the \"planets\" circled Earth. The reasons for this perception were that stars and planets appeared to revolve around Earth each day[162] and the apparently common-sense perceptions that Earth was solid and stable and that it was not moving but at rest.[163] Babylon The first civilization known to have a functional theory of the planets were the Babylonians, who lived in Mesopotamia in the first and second millennia BC. The oldest surviving planetary astronomical text is the Babylonian Venus tablet of Ammisaduqa, a 7th-century BC copy of a list of observations of the motions of the planet Venus, that probably dates as early as the second millennium BC.[164] The MUL.APIN is a pair of cuneiform tablets dating from the 7th century BC that lays out the motions of the Sun, Moon, and planets over the course of the year.[165] Late Babylonian astronomy is the origin of Western astronomy and indeed all Western efforts in the exact sciences.[166] The Enuma anu enlil, written during the Neo-Assyrian period in the 7th century BC,[167] comprises a list of omens and their relationships with various celestial phenomena including the motions of the planets.[168][169] The inferior planets Venus and Mercury and the superior planets Mars, Jupiter, and Saturn were all identified by Babylonian astronomers. These would remain the only known planets until the invention of the telescope in early modern times.[170] Greco-Roman astronomy The ancient Greeks initially did not attach as much significance to the planets as the Babylonians. In the 6th and 5th centuries BC, the Pythagoreans appear to have developed their own independent planetary theory, which consisted of the Earth, Sun, Moon, and planets revolving around a \"Central Fire\" at the center of the Universe. Pythagoras or Parmenides is said to have been the first to identify the evening star (Hesperos) and morning star (Phosphoros) as one and the same (Aphrodite, Greek corresponding to Latin Venus),[171] though this had long been known in Mesopotamia.[172][173] In the 3rd century BC, Aristarchus of Samos proposed a heliocentric system, according to which Earth and the planets revolved around the Sun. The geocentric system remained dominant until the Scientific Revolution.[163] By the 1st century BC, during the Hellenistic period, the Greeks had begun to develop their own mathematical schemes for predicting the positions of the planets. These schemes, which were based on geometry rather than the arithmetic of the Babylonians, would eventually eclipse the Babylonians' theories in complexity and comprehensiveness and account for most of the astronomical movements observed from Earth with the naked eye. These theories would reach their fullest expression in the Almagest written by Ptolemy in the 2nd century CE. So complete was the domination of Ptolemy's model that it superseded all previous works on astronomy and remained the definitive astronomical text in the Western world for 13 centuries.[164][174] To the Greeks and Romans, there were seven known planets, each presumed to be circling Earth according to the complex laws laid out by Ptolemy. They were, in increasing order from Earth (in Ptolemy's order and using modern names): the Moon, Mercury, Venus, the Sun, Mars, Jupiter, and Saturn.[159][174][175] Medieval astronomy After the fall of the Western Roman Empire, astronomy developed further in India and the medieval Islamic world. In 499 CE, the Indian astronomer Aryabhata propounded a planetary model that explicitly incorporated Earth's rotation about its axis, which he explains as the cause of what appears to be an apparent westward motion of the stars. He also theorized that the orbits of planets were elliptical.[176] Aryabhata's followers were particularly strong in South India, where his principles of the diurnal rotation of Earth, among others, were followed and a number of secondary works were based on them.[177] The astronomy of the Islamic Golden Age mostly took place in the Middle East, Central Asia, Al-Andalus, and North Africa, and later in the Far East and India. These astronomers, like the polymath Ibn al-Haytham, generally accepted geocentrism, although they did dispute Ptolemy's system of epicycles and sought alternatives. The 10th-century astronomer Abu Sa'id al-Sijzi accepted that the Earth rotates around its axis.[178] In the 11th century, the transit of Venus was observed by Avicenna.[179] His contemporary Al-Biruni devised a method of determining the Earth's radius using trigonometry that, unlike the older method of Eratosthenes, only required observations at a single mountain.[180] Scientific Revolution and discovery of outer planets With the advent of the Scientific Revolution and the heliocentric model of Copernicus, Galileo, and Kepler, use of the term \"planet\" changed from something that moved around the sky relative to the fixed star to a body that orbited the Sun, directly (a primary planet) or indirectly (a secondary or satellite planet). Thus the Earth was added to the roster of planets,[181] an"
}