{
  "url": "https://www.travelmasta.com/article/best-hotels-in-kelantan",
  "title": "34 Best Hotels in Kelantan - TravelMasta",
  "text": "Kelantan, or Kelate as most Kelantanese would say — is a province that is known to be one of the most beautiful areas of Malaysia. If you are looking to visit this region, there are several hotels you can choose from. However, you need to be aware that not all of these hotels are top-notch. To avoid disappointment, you should do your research beforehand. Perdana Kota Bharu Perdana Kota Bharu is the first premier hotel in Kota Bharu and has undergone a major transformation into a 5-star luxury hotel. Located in the heart of the city centre, it is a preferred choice of accommodation for businesses and holidaymakers alike. Conveniently situated within a 10-minute drive from Pasar Siti Khadijah, this luxurious property features 5 dining options, an outdoor pool and a fitness centre. It also provides complimentary parking and free Wi-Fi access in all areas. Offering a modern luxury touch in a classic decor, each of the 272 well-appointed guest rooms and suites are equipped with a personal safe, flat-screen satellite TV, comfortable seating area and ironing facilities. The en suite bathroom comes with a bathtub, bidet, hot shower and free toiletries. Suitable for all types of travelers, the rooms are spread over 2 wings namely Classic Wing and Executive Wing. The 272 air-conditioned rooms feature minibars and flat-screen televisions. In-room electronic safes are also available. Other amenities include a coffee machine, daily newspaper and bottled drinking water. Bed linen and bathrobes are also provided. A designated prayer area is available for Muslim guests and rooms are marked with prayer directions. Guests can also make use of the 24-hour front desk for assistance with their needs. There are several restaurants at the hotel. The Jade restaurant serves Chinese and Thai food. Another option is the Cerana Coffee House, which serves Western and local cuisine that is Halal-certified. Restoran Eleven is a rooftop restaurant featuring an exquisite view of the city. Guests can enjoy an outdoor dining option at the Anjung terrace, which is adjacent to the pool. Renai Hotel Kota Bharu Renai Hotel Kota Bharu is a luxurious hotel that offers excellent services and facilities. It is situated in the center of Kota Bharu. It is a 5-star hotel that offers an in-house restaurant. Formerly known as The Grand Renai Hotel, this hotel has 298 air-conditioned rooms. Each room includes a TV with cable and satellite programming, a refrigerator, and wireless Internet access. Some suites include a balcony or a terrace. Guests can also access the hotel's gym and hot tub. The Grand Renai is a popular hotel that hosts many weddings. It is equipped with a full-service function room. A well-stocked buffet is available for the guests' convenience. They can also enjoy the swimming pool and tennis courts. The hotel has a 24-hour front desk. Their staff will be happy to help with any questions or concerns. Guests can also pay for their accommodations with Mastercard or American Express. The hotel offers a shuttle service to and from the airport. The hotel has free parking. You can also enjoy a variety of restaurants and other facilities. There are four dining options to choose from at the hotel. Grand Riverview Hotel If you're in the market for a high-end hotel with a decent price tag, the Grand Riverview Hotel in Kota Bharu is a must. It's located near the famous Kelantan River and is a short stroll to some of the city's best shops and restaurants. A complimentary shuttle service to the Sultan Ismail Petra airport is also available. The hotel is also home to a handful of other impressive feats of engineering, including an outdoor pool and a fitness center. In addition, the onsite Siti Khadijah Market offers some of the city's most interesting culinary creations. Other amenities include a free airport transfer and a parking lot. For the discerning traveler, the Grand Riverview Hotel boasts the most spacious and comfortable rooms in town, as well as the latest in modern conveniences and amenities. Aside from the usual suspects, the hotel is also home to a state-of-the-art gym, a business center and a myriad of other services and amenities. As part of your stay, the hotel also provides a buffet breakfast and free high-speed Internet access. Troika Kota Bharu As Kelantan's tallest building, Troika Kota Bharu is an architectural marvel that seamlessly blends Islamic design with modern luxury. The serviced apartments by Salaam Suites offer stunning panoramic city views from the 36-story tower, complete with fully furnished units featuring Netflix, kitchen facilities, and excellent housekeeping. The infinity pool on Level 6 is absolutely breathtaking, offering unparalleled views of the city skyline. The location in the Golden Triangle is perfect — walking distance to KB Mall and minutes from major attractions. The Islamic architectural elements, particularly the crown design inspired by prayer hands, create a unique and spiritually uplifting atmosphere. Tune Hotel Kota Bahru City Centre The Tune Hotel Kota Bahru City Centre is one of the top 30 hotels in Kelantan, Malaysia. Located in Kota Bharu city centre, it offers affordable accommodations and various amenities. The hotel has 172 guestrooms. Each room is equipped with air conditioning, cable television, and electronic key-card access. It also features an en-suite shower-bathroom. In addition, guests have free Wi-Fi, a safe, and a telephone. There is a laundry facility, luggage storage, and a 24-hour front desk. Other facilities include a restaurant and meeting rooms. With its convenient location, the hotel offers easy access to several tourist attractions. You can reach the Sultan Mohammad IV Stadium, Gelanggang Seni, and the KB Mall within a short distance. This is a great accommodation option for those who want to enjoy the convenience of staying near the city's bustling business district. The Kota Bahru Hotel has a variety of on-site facilities, which include laundry services, an ironing service, and a barber shop. Guests can also enjoy free Wi-Fi in public areas and a restaurant. Crystal Lodge If you are looking for a good hotel in Kota Bharu, Crystal Lodge is a great choice. You will find that this hotel is centrally located and features a variety of facilities. The hotel is also close to local attractions. This property is not an upscale hotel, but it does have a lot of conveniences. It offers free Wi-Fi and a fitness center. Also, it is close to public transportation, which makes it easy for you to visit the city's many sites. Other amenities include an on-site restaurant, a coffee shop, and an airport shuttle. There are also shops nearby, including the Old Spaghetti Factory and Starbucks. The guest rooms at the Crystal Lodge have free Wi-Fi, a minibar, and a television. In addition, each room comes with a hairdryer and a tea/coffee maker. One of the best things about this hotel is that it provides a buffet breakfast. Guests can choose from several options, including Western, Asian, and Malay choices. The hotel offers free parking. There are two on-site restaurants, including the Root Garden Cafe. A rooftop cafe is also available for private parties. Ibis Styles Kota Bharu If you are looking for accommodation in Kota Bharu, you may want to check out the Ibis Styles Kota Bharu. This hotel offers a wide range of amenities and services. It also has an excellent location. You can easily access a number of tourist attractions from this hotel. The Ibis Styles Kota Bharu is located in the heart of the city. It is a 3-star property that is close to KB Mall and the Street Market. It offers comfortable accommodation, a restaurant and an indoor pool. In addition to this, guests can also enjoy a fitness center, a children's playground, a business center and an outdoor pool. Guests can also avail of free parking and 24-hour vending machines. While staying at this hotel, you can also enjoy the local and international cuisine at Streats Cafe. The cafe is open from 7:30 to 22:00, and serves a variety of dishes. Some of the rooms at this hotel come with cable TV, climate control, a laptop-size safe, a hair dryer and a minibar. W Hotel Cemerlang W Hotel Cemerlang is a surprisingly large hotel with a plethora of amenities and activities to keep you occupied on your Kota Bharu holiday. It also happens to be the best location in the city for a number of reasons. You are close to the action while you are not too far from the heart of old town. Whether you are in the market for an extended stay or short trip, you will be hard pressed to find a more accommodating hotel in the area. Fortunately, it is not all that hard to get to and from. For starters, a ridesharing service such as Uber or Grab can make the trip cheaper and a whole lot more convenient. Of course, if you are in the mood to get a bit more personal, you can always hire a chauffeur for the night. If you are looking for an uncomplicated place to call home, the W Hotel Cemerlang is a shoo-in. The rooms are slick and the hotel itself offers free Wi-Fi and parking. While you are at it, check out the nearby Kelantan Golf and Country Club, if you are into golfing. Tok Aman Bali Beach Resort There are numerous accommodations to choose from in Kelantan. One of these is Tok Aman Bali Beach Resort, which is located near Bisikan Bayu Beach in Pasir Puteh. It is a beautiful resort with luxurious rooms and amenities. With its luxurious comfort and renowned Kelantan hospitality, the resort is an oasis of serenity. The building structures follow the traditional Kelantan architectural style. You can find a number of facilities and activities here, such as kayaking, cycling, fishing, and a full-service spa. Other facilities include a library, games room, and fitness center. The hotel also offers free Wi-Fi, a swimming pool, and a private beach. Also, you can find 24-hour front desk assistance. Some of the room types can accommodate extra beds for family or friends. The Tok Aman Bali Hotel also has a sports facility, including an eight-element obstacle course, a water ball, and a tennis court. For those who wish to unwind, there is a sauna and a steam room. For more adventure, you can try paintball, kayaking, and pedal boat rides. The Tok Aman Bali Hotel also has an outdoor pool and an arcade/game room. And for relaxation, there are sun loungers. Studio Exclusive (Kota Bharu City Point) If you're looking for a hotel in Kota Bharu, then you should check out Studio Exclusive. It's located within the Kota Bharu City Point, which is about a 10-minute walk from the Handicraft Village and AEON Mall Kota Bahru. The hotel features an outdoor swimming pool and free private parking. Other amenities include a mini market, seating area, kitchenette, air conditioning, and a garden. There's also free Wi-Fi, airport transfer, and self-service laundryergarten. Guests of Studio Exclusive can stay in a room with a double bed, or upgrade to a suite with two double beds. Children under six years are allowed in the room. The hotel's location is also perfect for business travelers. The Sultan Ismail Petra Airport is only 7 km away. It's also within close proximity to Cahaya Bulan Beach and Kraftangan Village. A 15-minute drive will take you to Kampung Pasir Pekan and the Perhentian Island. The restaurant, Kopitiam Kita, offers all-time favorite dishes, from roti titab to Nasi Berlauk Gulai Ikan. They even serve kaya toast and eggs. Min House Camp If you are looking for an eco-friendly property with a great location, then Min House Camp in Kota Bharu is the perfect option. The camp is located on the edge of the town and is surrounded by tropical greenery. With a variety of activities available, it is ideal for people who enjoy nature. The accommodation at the camp includes air-conditioned rooms and bungalows. These rooms come with refrigerators and free toiletries. There are also multi-person dorms and private chalets. Another highlight of the property is the firefly-watching boat ride. This activity is available from 8pm to 11pm. Guests at the camp can also try a number of water sports. Some of the activities include fishing, canoeing and kayaking. You can also check out the mini petting zoo and bee farm. In addition, the hotel offers massage services. Other facilities include a 24-hour front desk, car park and free Wi-Fi. Located in Kampung Pulau, the camp offers visitors a chance to learn about traditional Kelantanese culture. You can also watch cultural performances. SPOT ON 89796 D'Noor Budget Inn The SPOT ON 89796 D'Noor Budget Inn in Kota Bharu is a nifty little budget hotel that offers two-star accommodation. With its impressive a la carte menu and well-stocked bar, this is a great choice for a weekend trip to the city. Also, you'll find it's within easy reach of the Sultan Ismail Petra Airport, which is only a ten-minute drive away. A short walk from the hotel's central bus station, you'll be able to catch a ride on one of the many buses that run between the area's various districts. It's also only a short walk from the Taman Perbandaran Tengku Anis, which hosts a few worthwhile sights including the Museum of Kelantan. And if you're feeling peckish, CT Satay specializes in Asian fare. As for other amenities, you'll be impressed to learn that the hotel offers an air-conditioned lobby, 24-hour front desk, and free Wi-Fi. If you're looking for a bit more comfort, you can choose from a selection of rooms with cable TV, or opt for the more expensive accommodations. Hotel O G Home Hotel, Kota Bharu, Kelantan Hotel O G Home Hotel, Kota Bharu, Kelantan, offers a number of great features and amenities for a budget price. Some of the more impressive features include the room amenities, onsite facilities, and overall service. It is the perfect place to stay for travelers on a budget. The hotel is also near many popular attractions and food hotspots in the area. For business travelers, it is a great choice for a convenient stay in Kota Bharu. Several dining options are available at the property, while free Wi-Fi is provided in public areas. Other amenities include daily housekeeping and linen service. In addition, G Home Hotel provides a variety of entertainment activities to keep you busy on your trip. This includes the handicraft village and craft museum. Also, the Sultan Mohammad IV Stadium is within walking distance. You can also take a quick drive to the popular Kelantan Golf & Country Club. OYO 90099 G Home Hotel is a nice hotel to spend your vacation at. The on-site facilities, including air conditioning and Wi-Fi, will make you feel right at home. There is also a restaurant, which serves up delicious Asian cuisine. Jewels Hotel If you are searching for a hotel in Kota Bharu, then you should definitely consider staying at Jewels Hotel. This hotel is perfect for travelers on a budget, and offers excellent service. It is located in the heart of the commercial district, making it easy to access local attractions. The Jewels Hotel provides a wide variety of services, including a free Wi-Fi network in all rooms. Additionally, this hotel has a 24-hour front desk. Guests are also offered complimentary breakfast. In addition, this property is close to the Handicraft Village and Craft Museum. The Jewels Hotel is part of the HABIB Group, a family of hotels that offer a variety of accommodations. During your stay, you can choose from a range of dining options, from local cuisine to international dishes. Among the facilities that are available at the Jewels Hotel are an elevator and dry cleaning services. Moreover, guests can enjoy an in-house shared kitchen. There is also a fitness center for your convenience. And, the hotel also provides car rental and taxi services. KB Street Boutique Hotel If you're looking to stay in Kota Bharu, then the KB Street Boutique Hotel is a good bet. Previously known as OYO 90008 KB Street Boutique Hotel, the hotel is a mere 15 minutes from the Sultan Ismail Petra airport, making it a convenient location for travelers. It also has some impressive room facilities including free Wi-Fi and a swimming pool. Moreover, it offers some of the cheapest prices in town. Although it's not as flashy as some of its more expensive counterparts, the KB Street Boutique Hotel is still worth checking out. In addition to its modern amenities, the hotel boasts a location that's close to major attractions. You can take a tour of the city centre, visit the zoo or check out some of the more than 150 mosques scattered around the city. A few minutes' walk will get you to the Handicraft Village and Craft Museum. And you're only a hop, skip and a jump away from Min Fireflies Garden, Komplek Mara and Pantai Cahaya Bulan. Arwana Inn Tok Bali If you're looking for a hotel in Tok Bali with a little bit of character, look no further than Arwana Inn Tok Bali. This hotel is a great choice for travelers and visitors. It's located in the heart of Pasir Puteh and is only 47 minutes' drive from Sultan Ismail Petra airport. The hotel's location is perfect for your family holiday. You can easily visit local attractions such as the Tok Bali Beach and Bisikan Bayu Beach. Moreover, Arwana Inn Tok Bali is a budget-friendly option that offers a range of facilities. From Wi-Fi in public areas to a restaurant, you'll have no problem finding something to keep you occupied. Furthermore, the hotel's free parking is a bonus. While Arwana Inn Tok Bali doesn't offer any major attractions, it does provide a solid value proposition. Compared to hotels in the same price range, you'll be hard-pressed to find a better deal. With flexible check-in and check-out times, you can check in and check out at your leisure. For those who want to enjoy some local fare, the hotel's Kopitiam Tok Bali has some of the city's finest dishes. Additionally, the hotel features an outdoor swimming pool, making it a good bet for those with water on the mind. Holiday Villa Hotel & Suites If you're looking for a place to stay in Kota Bharu, Holiday Villa Hotel & Suites is a good choice. It offers a convenient location, a swimming pool, and a fitness center. Plus, it's a great value, with a nightly rate that's a little less than 89% of comparable four-star hotels in the city. Rooms at Holiday Villa Hotel & Suites feature Italian-style design and amenities. They include a private bathroom with shower and hair dryer, along with a coffee maker, a mini bar, and a separate living area. Some rooms also have free Wi-Fi access. The property's location is perfect for exploring Kota Bharu, and it's close to some of the city's top attractions. This includes the renowned Telipot Mosque and the Siti Khadijah Market. Also, it's just a short drive to the Sultan Ismail Petra Airport, which is the main airport serving the country. For those who prefer to travel in a car, Holiday Villa Hotel & Suites offers free parking. Plus, guests can take advantage of its in-house restaurant, which serves both local and Western dishes. There's also a sauna and an indoor swimming pool. Hotel O Destiny Riverside Hotel Hotel O Destiny Riverside Hotel offers 2-star accommodation in a convenient location. This small hotel is within walking distance of several local attractions, including KB Town, Wakaf Bharu, and Farrer Islet. There are several options for dining and shopping, as well. It is also near the Sultan Ismail Petra Airport. Also known as OYO 89588 Destiny Riverside Hotel, this is a great place to stay if you're looking to save money, but don't sacrifice quality. This Kota Bharu hotel offers a range of features, from free Wi-Fi and bottled water to daily housekeeping. Those interested in a little more pampering can try their luck at the on-site spa. The hotel is also a short drive from the best in beach culture. Kelantan Beach is home to numerous waterfront restaurants and is known for its scenic views. The hotel has a number of interesting features, including a swimming pool, a fitness centre, and even a free self parking lot. It is also a few minutes from KB town, the main hub of Kota Bharu. Crown Garden Hotel Crown Garden Hotel is located in the Kota Bharu City Centre and offers many facilities to travelers. The hotel features free Wi-Fi in all rooms, as well as a restaurant, a bar, and a fitness center. It also provides free parking and shuttle service. The hotel has 81 modern air-conditioned rooms with a minibar, flat-screen TV, safety deposit box, and hot/cold shower. Some of the rooms offer electronic key cards for security. The hotel offers 24-hour reception, a business center, and laundry services. A round-trip airport shuttle is available at an extra cost. In addition, the hotel allows pets. There are also free newspapers in the lobby. Crown Garden Hotel is within walking distance of the city's busiest areas and local attractions. The newly-completed Kota Bharu Trade Centre is within walking distance. Istana Jahar is a popular tourist spot, just 620 m away. Other places of interest nearby include the Handicraft Village and Craft Museum, which is a 15-minute walk from the hotel. Pantai Timur Shopping Center is 0.3 miles away. GR studio APARTMENT kompleks MUTIARA gua MUSANG GR Studio Apartment at Kompleks Mutiara Gua Musang offers clean, comfortable stays with modern facilities for families and couples. Each air-conditioned apartment includes a private bathroom, kitchenette, refrigerator, and streaming services for convenience. Guests enjoy free Wi-Fi, a rooftop swimming pool, and private parking on-site. The property also provides essentials like towels, slippers, and a hairdryer for added comfort. Located just 1.2 miles from Mountain Chamah and 26 miles from the National Park East Kelantan Entrance, it’s ideal for travelers exploring Gua Musang. Guests especially appreciate its cleanliness and convenient location, rating it 8.9 for a two-person trip. The Room @ Zishi The Room @ Zishi is a stylish boutique hotel located in the heart of Kota Bharu. With free Wi-Fi, a gym and a cool looking pool, this is a great option for a business or holiday stay. Its location on the main road makes it a convenient gateway to other cities and attractions in the area. The Handicraft Village and Craft Museum train station is 850 feet away. The hotel boasts a full service restaurant that serves up a mean grilled tiger. There is also a minimarket with a cleverly concealed liquor dispenser on hand to keep the party going. As for the room itself, it was impressively large and comfortable. You'll also find a nice sized garden. Some rooms feature a flat screen TV with cable and a modern bathroom with a swanky shower. The Room @ Zishi is a good option for those on a tight budget and you'll be rewarded with a pleasant roomy experience. A free airport shuttle is available on demand, and the property is close to all major attractions. While the hotel isn't the most centrally located, you're a short drive from the city centre, Kelantan Golf & Country Club, and the Istana Batu Royal Museum. Rose Garden Inn The best way to describe this hotel is to say that it is a well designed, well run and well managed facility with a plethora of perks. A complimentary shuttle to the mall is also an impressive feature. And if you're feeling brave, you can even try your hand at Muay Thai boxing. Guests can also take advantage of the complimentary Wi-Fi and parking. If you want to splurge on some gastronomical delights, the restaurant at the Rose Garden Inn should not be missed. On the other hand, you can probably get just about anything you desire at one of the local eateries. For the budget conscious, the cheapest room rates start at about US$24. To top it off, there is free wi-fi, a gym, and a free shuttle to the nearby mall. Not to mention, it is in close proximity to the most famous of Kota Bharu's landmarks, the Balu Kubu bazaar. So, why not make a pit stop here and check out all that Kota Bharu has to offer? AAM Hotel The AAM Hotel in Kota Bharu is one of the best hotels in Kelantan. It provides superior facilities, great service and great location. This hotel is ideal for travelers seeking a short or long term stay in the city. The AAM Hotel has free Wi-Fi and parking on site. Guests can also enjoy a buffet breakfast each morning. During their stay, they can visit the Handicraft Village and Craft Museum. There are also a few restaurants in the area. The hotel offers rooms with free Wi-Fi, television, and coffee making facilities. They are also air conditioned. You can relax by the outdoor pool or on the rooftop terrace. Located in the heart of Kota Bharu, this hotel is near the city's main attractions. It features spacious, modern rooms and suites. In addition, guests can enjoy 24-hour room service, an outdoor swimming pool, and spa services. Kota Bharu is home to many markets. Visitors can buy local food, traditional Malay handicrafts, and silk garments. These are all unique carvings of the city's Malay heritage. Ridel Boutique Hotel Ridel Boutique Hotel is a 3-star hotel located in Kota Bharu. It offers free Wi-Fi and is close to the Siti Khadijah market and the street market. The hotel also comes with a car park. Guests can expect the standard amenities like air conditioning and free breakfast. Moreover, the hotel is in the heart of Kota Bharu, making it a good base for exploration of the city. There are many things to see and do in and around the capital of the Kelantan state. The Kelantan State Museum and the Handicrafts Village are both within easy reach. Also, the Sultan Mohammad IV Stadium is a popular tourist attraction. If you want to spend a night or two in the Kelantan capital, the Ridel Boutique Hotel is an excellent choice. One of the best features of the Ridel Boutique Hotel is its location. The hotel is located in the Wakaf Che Yeh part of Kota Bharu. Its proximity to the airport, Balu Kubu bazaar, and the official Kelantan museum is another plus. M Quality Hotel Whether you're a first-timer or a seasoned traveler, M Quality Hotel is a convenient choice. Located in Gua Musang, the hotel offers a range of facilities and amenities. The hotel features free parking and Wi-Fi. Rooms at the hotel are spacious and clean. They come with a mini-bar and air-conditioning. Also, rooms offer bottled water, toiletries, and towels. Other amenities at the hotel include an elevator, a clothes rack, and a car parking lot. In addition, the property has a restaurant. As for dining, guests rated the dining options better than 90% of other hotels in the area. The hotel is close to Kota Bharu and offers a variety of activities. It also provides access to Universiti Malaysia Kelantan and is located near the State Museum. The hotel is a popular option among travelers, because it's easy to book, it's reasonably priced, and it's convenient. However, there are some issues to consider when booking. For instance, the hotel requires a damage deposit of MYR 50 upon arrival. This deposit is refunded after the property inspection. Additionally, the hotel does not allow smoking in its premises. Rayyan Soffea Hotel Rayyan Soffea Hotel is a 2-star property that offers a range of amenities and freebies. The hotel is located near the city's main attractions and has a good deal to offer travelers looking for a night out on the town. Previously known as OYO 558 Rayyan Soffea Hotel, guests at this hotel have the option of renting a car to explore the city. Some rooms are stocked with modern conveniences including wardrobes and air conditioning. It has a business center and accepts Visa, MasterCard, and American Express. Guests will also find a number of dining options nearby. While there is no shortage of hotels in the city, the Rayyan Soffea is a good choice. With a number of reputable establishments within a few miles, the hotel is easily accessible from the airport and city center. You can reach the Sultan Ismail Petra airport in just under 10 minutes. KB Mall and the Kelantan Golf & Country Club are both less than a mile away. There are a number of things to do in the area, such as shopping at the Siti Khadijah Central Market. Other notable sights include the Sultan Mohammad IV Stadium and Istana Jahar. OYO 89651 Harmoni Hotel OYO 89651 Harmoni Hotel is located in the city center of Kota Bharu. The hotel is close to several major attractions and public facilities, and the rooms come with air conditioning, towels, and linen service. It is an ideal place to stay for those who are looking for affordable accommodation in the heart of the city. Guests of the hotel can take advantage of the 24-hour front desk and multilingual staff. The property is also equipped with free Wi-Fi. A dry cleaning service is available and bottled water is offered. Guests are allowed to bring pets into the hotel. However, there may be restrictions on weight and breed of animals. Located near the Kota Bharu train station, the hotel is within a 10-minute walk of the Kelantan Museum. Guests can also enjoy a short stroll to the Sultan Mohammad IV Stadium. Other nearby attractions include the Siti Khadijah Central Market and the Handicraft Village. Located a bit farther from the downtown area, guests can opt to enjoy a golfing session at the Kelantan Golf and Country Club. OYO 717 Mr J Hotel Wakaf Che Yeh 2 OYO 717 Mr J Hotel Wakaf Che Yeh 2 is located in Kota Bharu. This hotel is near the Cultural Centre and Handicraft Village. The Sultan Mohammad IV Stadium is 2.3 mi away. It is also 6.4 miles from the Kota Bharu Pengkalan Chepa Airport. In addition to free Wi-Fi in all rooms, the property offers a 24-hour front desk. There is a complimentary breakfast and daily maid service. Additionally, there is a safe box in each room. Guests can find nearby restaurants and other attractions via the hotel's interactive map. One child 5 years old or younger is allowed to stay free in a parent's room. Guests who provide proof of full COVID-19 vaccinations will receive a free breakfast and a free Wi-Fi connection. Guests must present valid vaccinations at check-in. Vaccines must be received at least 14 days before the check-in date. Rooms at OYO 717 Mr J Hotel Wakafche Yeh 2 feature air conditioning, a safety deposit box, and a coffee maker. A mini-bar is also available. Some of the other amenities include a refrigerator and a dining area. H Elite Design Hotel H Elite Design Hotel is located in the Wakaf Che Yeh area. This hotel offers easy access to the main attractions in the city. It also boasts of an outdoor swimming pool and a gym. This hotel is also suitable for travellers on a budget. The hotel's rooms are air-conditioned and offer free Wi-Fi. They also feature a hairdryer and a toilet with bidet. The hotel also features a restaurant and a shared lounge. Rooms here come with a hairdryer, a TV, a desk, ironing facilities and a private bathroom with shower. If you are looking for an affordable, yet luxurious place to stay in Kota Bharu, then H Elite Design Hotel is a great option. Guests at this luxury hotel are sure to be impressed with its convenient location and excellent service. This property is perfect for a romantic getaway or a long-term stay. Located only 6 km from the popular Billion Shopping Centre and G-Orange Mall, this hotel is also close to the Sultan Ismail Petra Airport. Among the best things about this hotel is its 24-hour front desk. Aside from that, it also has a business centre, a gym, a kids' club, a restaurant, and an outdoor swimming pool. Hotel Sudara Beach Resort If you're looking for a nice hotel with a swanky pool, Hotel Sudara Beach Resort is the place to go. It also happens to be located right on Tok Bali beach, making it the perfect spot to tan, play a round of golf, or merely enjoy the best of tropical weather. For the pampered traveler, you'll be pleased to know that the small resort has a full-service spa, in-house massage services, and free Wi-Fi in the public areas. Aside from the spa, the resort has a restaurant and bar, both of which boast a stellar array of local and international dishes. Formerly named OYO 89399 Sudara Beach Resort, the name-brand resort also boasts a handful of other perks, including a free-to-use fitness centre and on-site public parking. Aside from the usual suspects, the hotel also offers a private beach and a sand volleyball court. BBP Hotel BBP Hotel is a quaint little hotel located in Kota Bharu, Kelantan. The hotel features free Wi-Fi in all rooms and a 24-hour front desk. Guests are also spoiled for choice with various recreational opportunities on hand at the hotel. In addition, the Hotel BBP is a short drive from some of the city's most notable attractions such as Kota Bharu's Central Market, Billion Shopping Centre, and Kota Bharu's iconic equestrian statue. For the budget conscious traveler, the hotel's cheapest room rates start at about $80. Guests can choose from a range of standard rooms, family rooms, or suites. Ample parking is available at the hotel, with a free shuttle service to the nearby airport, Kota Bharu's biggest drawcard. Cyber Studio Apartment Cyber Studio Apartment is a comfortable, family-friendly accommodation that offers free Wi-Fi and parking. It is located in Kota Bharu, a 20-minute walk from the city center. There are several attractions near the property, including Handicraft Village and Craft Museum. The Muhammadi Mosque is 10 minutes away by foot. Rooms at Cyber Studio feature air conditioning, flat-screen TV with satellite channels, and a desk. Other amenities include a refrigerator, electric key card for guest security, and a seating area. A safety deposit box is also provided. The room comes with a private bathroom and a toilet, and free toiletries are available. There are many dining options in the area, such as Hover Restaurant, which serves Asian cuisine. The hotel has a 24-hour front desk, a car rental service, and a laundromat. Some rooms are non-smoking. Children under the age of 12 are permitted at the property. Guests can book an airport shuttle service. Sultan Ismail Petra Airport is eight kilometers away. To avoid any hassles, advance booking is advised. For those wishing to stay in a more expensive accommodation, there are other options in the vicinity. Hotel Bintang Indah is 2.5 out of 10, while OYO 89588 Destiny Riverside Hotel is 2.6 out of 10. Alternatively, travelers can consider the 113-room Sabrina Court Hotel. Prestige Sky Riverfront Among the plethora of hotels in Kota Bharu, Prestige Sky Riverfront is one of the best and most impressive. Its amenities include a fitness centre, spa, indoor and outdoor swimming pools, and a rooftop garden with a spectacular view of the Kelantan river. The hotel also features a business center with computers and printers, free Wi-Fi, a tour desk and a concierge service. During your stay, you may choose to try your luck in the casino, explore the many craft shops and boutiques in the area, or take a stroll down Pantai Cahaya Bulan, also known as Moonlight Beach. This coastal area offers a variety of activities to keep you busy, including fishing, surfing, and a myriad of water sports. For those seeking a more laid back experience, you can hire a scooter, go karting, or even go jogging along the beach. You may wish to pay a visit to the city's most famous landmarks, such as the museum of Istana Batu, the city's former royal palace. Other notable sights include the Karnival Kebudayaan Kelantan, a lively cultural event featuring a number of performances. Wan's Studio Kota Bharu, the state capital of Kelantan, is the cradle of Malay culture in Malaysia. It is also known for its scenic natural landmarks, local markets and traditional handicrafts. Aside from its historical sites, there are many modern hotels in Kota Bharu to choose from. The Kota Bharu City Point, also known as Wan's Studio, is located within walking distance to the Handicraft Village and Craft Museum. It features free Wi-Fi, a kitchen, air conditioning and city views. Located just 600 metres from Kelantan Golf & Country Club, the hotel also offers a shuttle service to nearby attractions. There are a number of 4.5-star luxury hotels in Kota Bharu. Oyo 89352 Golden Terminal Lodge is just a short walk from the Sultan Ismail Petra airport. The property is also close to Pantai Timur Shopping Centre, and the Royal Mausoleum of Kelantan. C Chantique Villa Apartment is an elegant apartment in the center of Kelantan's town center. Offering spacious layouts, it features modern rooms, free Wi-Fi in public areas, and free parking. As an added bonus, guests can enjoy a pool and shuttle services."
}