{
  "url": "https://m.imdb.com/title/tt4354880",
  "title": "Mr. Mercedes (TV Series 2017–2019) - IMDb",
  "text": "A demented killer taunts a retired police detective with a series of lurid letters and emails, forcing the ex-cop to undertake a private, and potentially felonious, crusade to bring the kill... Read allA demented killer taunts a retired police detective with a series of lurid letters and emails, forcing the ex-cop to undertake a private, and potentially felonious, crusade to bring the killer to justice before he can strike again.A demented killer taunts a retired police detective with a series of lurid letters and emails, forcing the ex-cop to undertake a private, and potentially felonious, crusade to bring the killer to justice before he can strike again. - Awards - 1 win & 11 nominations total Browse episodes Featured reviews This show is very hard to review because it genuinely becomes an entirely different show after the first season. Season's two and three move into a more traditional Stephen King style, while season 1 is the classic retires gruff detective no kind of a PI being haunted by that one case. And the killer communicating with him isn't anything revolutionary, but the two leads are awesome and the supporting cast is really charming and perfect. Season 2 and 3 are really enjoyable but they are two screen seasons, meaning it's best to watch while doing a puzzle or exercising while the first season is so captivating you don't want to miss anything. Hope this helps. Season 2 and 3 are really enjoyable but they are two screen seasons, meaning it's best to watch while doing a puzzle or exercising while the first season is so captivating you don't want to miss anything. Hope this helps. Season 1 is so gripping as we gradually got to know all the good and bad characters that Mrs. Shullivan and I just had to binge watch the subsequent two (2) seasons over the weekend. It is a captivating mystery/thriller/sci-fi series which stars the always impressive Brendan Gleeson as a retired homicide detective named Bill Hodges who after losing his wife through an amicable divorce, believes he has nothing else to live for but to drink both day and night and the only one who relies on him nowadays is his fully grown twenty year old tortoise (please do not call him a turtle says Bill) named Fred. Bill Hodges (Brendan Gleeson) has lost his wife through an amicable divorce and is estranged for a few years now from his only daughter who has suffered from drug and alcohol abuse. Bill finds his solace and a revitalized need to once again feel worthy of his crime solving ability when he gets involved in the investigation of the unidentified serial killer named Mr. Mercedes whose crime was to run down a huge crowd of people standing in line at an early morning job fair in a stolen Mercedes Benz vehicle and then he just drove away and abandoned the stolen Mercedes Benz car after killing a dozen or so people and injuring and traumatizing hundreds of other people. By season two (2) the serial killer is identified and by season three (3) there is a new story line which is indirectly tied to the first two seasons as some of the surviving victims of Mr. Mercedes who were at the job fair try to get on with their lives. Season three (3) is probably more violent than any of the three (3) seasons but not in a true gratuitous violent manner, but more in a comedic way if murder can be considered comical, Mr. Mercedes pulls it off perfectly. There is a great supporting cast and an even better Stephen King storyline in which Stephen King supplants himself in one cameo scene as one of the many imaginary murder victims in a restaurant. Mrs. Shullivan and I really enjoyed all three (3) seasons but were glad when the series ended because we were beginning to enjoy all of Stephen King's murder and bloodshed so much so that we quickly next turned to a Walt Disney animated classic to come back to reality and calm. I give this excellent series a highly rated 8 out of 10 IMDB rating Bill Hodges (Brendan Gleeson) has lost his wife through an amicable divorce and is estranged for a few years now from his only daughter who has suffered from drug and alcohol abuse. Bill finds his solace and a revitalized need to once again feel worthy of his crime solving ability when he gets involved in the investigation of the unidentified serial killer named Mr. Mercedes whose crime was to run down a huge crowd of people standing in line at an early morning job fair in a stolen Mercedes Benz vehicle and then he just drove away and abandoned the stolen Mercedes Benz car after killing a dozen or so people and injuring and traumatizing hundreds of other people. By season two (2) the serial killer is identified and by season three (3) there is a new story line which is indirectly tied to the first two seasons as some of the surviving victims of Mr. Mercedes who were at the job fair try to get on with their lives. Season three (3) is probably more violent than any of the three (3) seasons but not in a true gratuitous violent manner, but more in a comedic way if murder can be considered comical, Mr. Mercedes pulls it off perfectly. There is a great supporting cast and an even better Stephen King storyline in which Stephen King supplants himself in one cameo scene as one of the many imaginary murder victims in a restaurant. Mrs. Shullivan and I really enjoyed all three (3) seasons but were glad when the series ended because we were beginning to enjoy all of Stephen King's murder and bloodshed so much so that we quickly next turned to a Walt Disney animated classic to come back to reality and calm. I give this excellent series a highly rated 8 out of 10 IMDB rating As a fan of Mr. King for many years --and NOT a fan of most of the TV and movie adaptations of his works-- I have to say I was impressed with the pilot episode. The casting of Brendan Gleeson got me in to watch it and thank God nobody asked him to try an American accent (witness what happened when they asked Michael Caine to try that in 'Mr Morgan's Last Love'). Also, it was nice to see Harry Treadaway pop up again after 'Penny Dreadful'. The whole show spoke of quality and good storytelling. I agree that the opening scene was a little gratuitous but it is faithful to the novel and I would rather see this sort of violence represented honestly than stylistically. No illusions that blood and guts aren't spilled when you drive a car through human bodies. I am looking forward to the next episode and have already added it to my weekly TV viewing list. Despite the staggering number of morons who ruined this show's Amazon rating by giving it one-star reviews due to a missing episode, rather than it being a bad show, it still managed to pop-up on my radar; a small miracle for which I am very grateful, as it is an outstanding piece of television. As serial-killer procedurals go, this is one of the finest I've seen, with strong writing, a talented cast, confident director, and master storyteller Stephen King pulling the strings. It is not perfect. Far from it. But in an overcrowded genre replete with potential potholes, this show managed to avoid most of the common hazards, while remaining generally unpredictable, well-paced, and intriguing. On a few occasions it began to feel a little like the similarly excellent \"Dexter\", and somewhere around the middle I began to experience unexpected sympathies with the killer, which made me wonder if I should be rooting for him, rather than the retired cop expertly portrayed by the ever likable Brendan Gleeson. But in the nick of time, my own personal leanings toward serial-killer-dom were jogged back to the correct moral course, and the season concluded with a deeply satisfying finale. On a personal note, and with absolutely no exaggeration, this show also achieved something rather remarkable: Literally every single song featured in the entire series, without exception, was one that I absolutely hate. This has never happened before in 43 years of watching films and TV. I wasn't even aware that I hated so many songs, but apparently I do. And since the soundtrack of any film or TV show is at least fifty percent responsible for the viewer's emotional responses to what they're watching, it is even more impressive that I enjoyed the show so much, despite its appalling soundtrack! I'm assuming that this is a one-off series, but if not I can't wait for the next one. As serial-killer procedurals go, this is one of the finest I've seen, with strong writing, a talented cast, confident director, and master storyteller Stephen King pulling the strings. It is not perfect. Far from it. But in an overcrowded genre replete with potential potholes, this show managed to avoid most of the common hazards, while remaining generally unpredictable, well-paced, and intriguing. On a few occasions it began to feel a little like the similarly excellent \"Dexter\", and somewhere around the middle I began to experience unexpected sympathies with the killer, which made me wonder if I should be rooting for him, rather than the retired cop expertly portrayed by the ever likable Brendan Gleeson. But in the nick of time, my own personal leanings toward serial-killer-dom were jogged back to the correct moral course, and the season concluded with a deeply satisfying finale. On a personal note, and with absolutely no exaggeration, this show also achieved something rather remarkable: Literally every single song featured in the entire series, without exception, was one that I absolutely hate. This has never happened before in 43 years of watching films and TV. I wasn't even aware that I hated so many songs, but apparently I do. And since the soundtrack of any film or TV show is at least fifty percent responsible for the viewer's emotional responses to what they're watching, it is even more impressive that I enjoyed the show so much, despite its appalling soundtrack! I'm assuming that this is a one-off series, but if not I can't wait for the next one. I'm giving this show a 7. It could have been a 9 or possibly a 10 if they quit after the first season. Please watch the first season. Its amazing. The second season makes you want to kick people in the nuts Did you know - TriviaStephen King said in an interview that he had Brendan Gleeson in mind when writing the character of Bill Hodges. - GoofsThe series is set in 2014, but several of the technical devices--Bill's smartphone, his laptop, and the GoPro-style digital camera that Jerome gives him--appear to be 2017 models. - How many seasons does Mr. Mercedes have?Powered by Alexa Details - Release date - Country of origin - Official site - Language - Also known as - Містер Мерседес - Filming locations - Production companies - See more company credits at IMDbPro Contribute to this page Suggest an edit or add missing content"
}