{
  "url": "https://columbus.craigslist.org/trp/d/delaware-truck-driver-class-hazmat/7912902503.html",
  "title": "Truck Driver - Class A Hazmat- Penske Logistics - transportation - job employment - craigslist",
  "text": "job title:Truck Driver - Class A Hazmat- Penske Logistics QR Code Link to This Post Immediate Opportunities: Full-time Local Class A CDL Truck Drivers • Average $84000 annually • $5000 Retention Bonus • Home daily • Hazmat endorsement required You will drive: • Late model, Penske Truck Leasing trucks • Best-in-class specs designed for comfort • Equipped with inward and outward-facing in-cab cameras helping to ensure safety for all What you will do: • Deliver palletized product to customers locally • Average 22 to 30 stops per week • Maintain professional and courteous demeanor when interacting with customers Schedule: • 5-day work week • AM dispatch Comprehensive benefits package includes: • Paid vacation and holidays day one • Generous retirement benefits • Excellent health care coverage-medical, dental, and vision • Short and long-term disability; life and AD&D insurance • Company-provided uniforms • Employee discount benefit program • Driver referral bonus program up to $5000 per referral • Safety incentive program • Premier Driver Recognition Program Our excellent benefits plan keeps associates and their families happy, healthy, and secure. To learn more, visit https://penske.jobs/benefits/. Why Penske? Ready to put your truck-driving career in high gear? Make the shift and fuel your career as a CDL Class A Truck Driver for Penske. When you join Penske, you join a team of professional truck drivers committed to delivering products safely and on time. And we’re proud to haul freight for some of the world’s leading brands. (Yes, we’re more than just the yellow trucks.) But it’s more than that. It’s about incredible customer service and building relationships with your accounts. When you drive for Penske, you’re representing Penske, but you’re also representing your clients. In fact, you’ll probably be driving their branded trucks and wearing their uniform. You’ll be on the move with Penske and so will your career. We have tons of training opportunities for you. And with locations across the nation, you can also move to a new city. Best of all, you’ll be with a stable, nationwide company that is known for having the best equipment, great management, clear communication and a fantastic safety record. We pay every Friday, and for most of our driving positions, you’re home daily. Yes, daily. Are you ready to take it to the next level? Come drive for Penske. Qualifications Qualifications: • Valid Class A CDL required. Applicants must be domiciled in the U.S. and licensed in their state of residence • Currently hold, or ability to obtain, a non-excepted interstate DOT medical card required • 1 year of documented tractor-trailer experience in the last 3 years required, or 2 years of documented tractor-trailer experience in the last 5 years • 3 years DMV/MVR record with two or fewer moving violations or accidents • Follow all federal and/or state laws, regulations, and/or agency rules, standards and guidelines • Regular, predictable, full attendance is an essential function of the job • In order to be compliant with federal law (49 C.F.R. 391.11(b)(2)), this role requires English language proficiency. • Work the required schedule, work at the specific location required, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening required • This position is regulated by the Department of Transportation or designated as safety sensitive by the company, and the ability to work in a constant state of alertness and in a safe manner is required. Associates must have the ability to accept responsibility for their own safety, as well as the safety of others. Physical Requirements: The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. • The associate must be able to see and hear. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus. • While performing the duties of this job, the associate will be required to move frequently, stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to regularly lift and/or move up to 50lbs/23kg and occasionally lift and/or move up to 100lbs/45kg. • The associate must be able to legally operate a motor vehicle and safely and frequently enter/exit the vehicle as well as the rear cargo area. Penske is an Equal Opportunity Employer. About Us About Penske Logistics Penske Logistics engineers state-of-the-art transportation, warehousing and supply chain management solutions that deliver powerful business results for market-leading companies. With operations in North America, South America, Europe and Asia, Penske and its associates help businesses move forward by increasing visibility and driving down supply-chain costs. Visit Penske Logistics to learn more. Apply Now Job Info Job Identification 2601148 Job Category Drivers Posting Date 02/02/2026, 10:15 AM Locations 1675 US 42 South, Delaware, OH, 43015, US Job Schedule Full time"
}