{
  "url": "https://karnishummus.com/about/",
  "title": "About – Karnis",
  "text": "About Us Try our brand. Taste the difference. Follow us and like our page, to stay updated. It's the best place for you to communicate with our brand. Ask anything! When you follow us, you will receive updates on what's hot and new, straight from our factory's kitchen. Subscribe It's never too late to watch all of our eye candy videos. We spice them with the best ingredient to make them viral. My story The Chronicles of Bringing Authentic Hummus to Food Platters The Early Beginning I am Neal Karni and my alliance with hummus dates back to the lovely childhood days. The mind-blowing Mediterranean salads dressed with traditional hummus and all those appetizing dips and salads allowed my taste buds to develop the extraordinary likings. Little that I knew back then that the fellow Americans fed on hummus containing artificial additives and preservatives, gluten and poor-quality ingredients. The awakening came in the years that followed. Acknowledging the Truths After spending two complete decades in the restaurant industry, the picture was clear. Backed by the 50 years of family tradition and 20 years of professional experience, I was enlightened to come up with something uncompromising in terms of taste, health and overall quality. Hence, Karnis Hummus & More was born with the idea of adding authentic Mediterranean flavors to the American platters through complete balance between tradition and innovation. Covering the Milestones The efforts paid out and the company’s products started gaining recognition. We adhered to the HACCP principles, obtained green business certification, abided by the practices set by GMP, SSOP, USDA and FDA and proved our mettle with the attainment of ‘zero quality compromises’. Another achievement came as our products acquired the highest Kosher seals and expanded their reach to the Jewish community. Welcome the First Hummus Factory in Florida Karnis Hummus Factory is the first of its kind in Florida, promising the superlative quality hummus and a rich line of associated products. Inside the factory, the latest tools, technologies and practices are being continually adopted to harness the well-kept secrets of Mediterranean recipes. The team Karnis comprises of talented brains, experts and supervisors who ensure that only the 100% natural, fresh and delicious products are delivered to every platter. Karnis Hummus & More Highlights We serve one and all through vegan gluten-free Kosher products that continue to experience huge demand and acceptance across the country. Only the fresh and uncompromised natural and healthy ingredients are handpicked to deliver the best of taste and health. The third generation of the celebrated chefs at Karnis takes the ideas to a new high by constantly adding value to the products Get ready to fall in love with our amazing line of products that consist of hummus, Turkish salad, vegetarian chopped liver, tahini and baba ganoush. Our products are a part and parcel of the daily business routines at specialty stores, restaurants, hotels and delis, hospitals and retirement communities as well as in airlines and cruise lines. More than 500 retailers (and counting) are already extracting huge business profits with Karnis hummus, dips, salads and spreads. Trust Karnis for products with extended shelf life with natural preservatives and packed using the most fruitful technologies to keep the products fresh for long. Pick up directly from the factory or order for delivery to your doorstep in any part of Florida. Karnis now ships across the United States and constantly stretching its wings to reach more of the prospective consumers. Now that you know the story, we invite you to be a part of it. Be a proud Karnis beneficiary and help the happiness spread. Karnis Business Opportunities Karnis Hummus is already providing private label production for various businesses across the country! We are always open for more opportunities and new relationships! please feel free to contact us for any more information!"
}