{
  "url": "https://www.brunson.us/metrology-optical-measurement-products-alignment-about-brunson",
  "title": "Brunson history",
  "text": "Who We Are How do we help the world measure? We at Brunson Instrument live in a specialized world of industrial measurement. We deal with the measurement problems faced by people who build, inspect, or maintain fairly large machines – machines like aircraft, paper mills, satellites, ships, machine tools, particle accelerators, and automobiles, to name a very few. They have very unique measurement problems. For example, aircraft makers must be able to tell if the curvature of their wing is made to blueprint and whether it will fit on the fuselage being built elsewhere; and paper mill operators need to know if their rolls are all parallel – all the way down a machine which may be a thousand feet long. And they need to know these things within thousandths of an inch. Obviously, the problem is the size of the items combined with the tiny measurement tolerances required. There are any number of high-precision benchtop measuring devices out there, but airplane wings and paper mills cannot be brought into a measurement laboratory to be put on a bench top. Welcome to the world of portable, high-precision, large-scale, 3-dimensional measurement and alignment products. A Proven Past Our history gives us the unique ability to serve this market using both our manufacturing and engineering service capabilities. We have been in the measurement industry since 1927, and over the years we have become very familiar with the discipline of industrial metrology. We have come to know most of the players in the business, and what their products can do. And, we’ve developed a factory and staff capable of doing some high-precision manufacturing. We offer: - A standard product line of stands, targets, and calibration products to support the myriad of 3-D metrology instruments available today - Private-label manufacturing for other metrology companies - Custom products (as requested) for the metrology market - Training on metrology products and techniques - On-site measurement services - A standard product line of Optical Tooling (alignment) products and accessories As you can tell, we’ve learned to wear many hats over the years. That’s because we serve a very specialized market. All of our “hats” are related to large scale metrology and the pursuit of that elusive one thousandth of an inch – from our design talents to our precision manufacturing capabilities and our on-site measurement services. Our advantage is that we combine the knowledge and experience that comes from all of these things – designing, making, and applying metrology products in the field, and teaching others how to use them as well. That’s why we can truly say that we are… Not only has our company been around since 1927, but we are housed in a building which is about 300 million years old. At least that’s what the geologists tell us. Our headquarters and manufacturing facility are buried 80 feet below the surface of Kansas City, Missouri. In 1955, our founder began mining operations with the specific intent to create a stable and secure environment for his factory. That’s where we remain today. Temperature and humidity control is easy, security is no problem, and it goes without saying that building sway or traffic vibrations are non-existent. In other words, the perfect place for a world-class precision manufacturing facility. Just like our products and services – rock solid. We invite you to come visit our humble cave. Just come to Kansas City, and look down! (More about our history.)"
}