{
  "url": "https://www.flyertalk.com/forum/british-airways-british-airways-club/2187915-british-airways-ranks-bottom-survey-2025-a.html",
  "title": "British Airways ranks bottom of Which? survey 2025 - FlyerTalk Forums",
  "text": "British Airways ranks bottom of Which? survey 2025 #1 Original Poster Join Date: Jun 2013 Location: UK, TX, UAE Programs: BA GGL, FB Ult, BA Amex Prem, Amex Plat, Hilton Diamond, Mucci Posts: 6,237 British Airways ranks bottom of Which? survey 2025 Unfortunately BA has ranked bottom of the Which? airline survey for 2025 for LH and 12/16 for SH. The review is based on economy travel. The British flag carrier, which says it’s invested billions in improvements over the past few years, has failed to keep up with rivals such as Virgin Atlantic and Emirates and has the joint-lowest long-haul customer score, along with Air Canada. Which? goes on to provide some explanation: British Airways’ customer score of 62% for long-haul and 57% for short-haul is very similar to the scores it’s had in previous years. It’s better than the 50% (long-haul) and 52% (short-haul) that it got in 2018. The problem is that other airlines are now rated more highly than BA. The best airlines in our survey get scores of 80%. BA is rated not just below the best carriers such as Jet2, Norwegian and SAS for short-haul, and Singapore, Etihad and Emirates for long-haul, it’s also below easyJet, Tui and US airlines such as American and United. For short-haul, boarding, seat comfort and food and drink are all rated just two stars. BA told us that passengers are ‘seeing the benefit of our £7bn investment programme, with operational performance improving by 18% over the last 12 months’. But it’s yet to match the performance of most of its rivals in our survey. Which? is generally considered to be a trusted consumer rights organisation which publishes various reviews throughout the year. The British flag carrier, which says it’s invested billions in improvements over the past few years, has failed to keep up with rivals such as Virgin Atlantic and Emirates and has the joint-lowest long-haul customer score, along with Air Canada. Which? goes on to provide some explanation: British Airways’ customer score of 62% for long-haul and 57% for short-haul is very similar to the scores it’s had in previous years. It’s better than the 50% (long-haul) and 52% (short-haul) that it got in 2018. The problem is that other airlines are now rated more highly than BA. The best airlines in our survey get scores of 80%. BA is rated not just below the best carriers such as Jet2, Norwegian and SAS for short-haul, and Singapore, Etihad and Emirates for long-haul, it’s also below easyJet, Tui and US airlines such as American and United. For short-haul, boarding, seat comfort and food and drink are all rated just two stars. BA told us that passengers are ‘seeing the benefit of our £7bn investment programme, with operational performance improving by 18% over the last 12 months’. But it’s yet to match the performance of most of its rivals in our survey. Which? is generally considered to be a trusted consumer rights organisation which publishes various reviews throughout the year. #2 Join Date: Mar 2009 Location: UK Programs: BA silver /AY Basic / IHG Diamond Ambassador / Hilton Gold/ Marriot Bonvoy Gold Posts: 2,923 Given the general sentiment toward BA at present this cant be a surprise. The s/h result is particularly skewed towards the bucket and spade travellers but given BAs focus on them, should nonetheless be concerning. Nor does it help that outside of London they operate few if any flights to anywhere other than London. Bottom of the pile for long haul after spending billions is just embarrassing - except they havent spent billions Bottom of the pile for long haul after spending billions is just embarrassing - except they havent spent billions #3 Join Date: Oct 2015 Location: Vale of Glamorgan Programs: OW Emerald ǀ Star Alliance Gold Posts: 3,544 #4 Join Date: Aug 2006 Location: In the sticks Programs: VS FC Gold, BA EC Gold, Amex Centurion, EK Gold, ex-G-ATVK driver Posts: 2,194 I just heard this reported on the radio. BA's response: \"The survey differs from customer feedback\" Oh dear. Have BA, suffering from denial, been \"enhancing\" customer feedback? BA's response: \"The survey differs from customer feedback\" Oh dear. Have BA, suffering from denial, been \"enhancing\" customer feedback? #6 Original Poster Join Date: Jun 2013 Location: UK, TX, UAE Programs: BA GGL, FB Ult, BA Amex Prem, Amex Plat, Hilton Diamond, Mucci Posts: 6,237 #9 Join Date: Feb 2024 Posts: 150 #10 Join Date: Jun 2010 Location: London Programs: BA Gold Guest List, HH Lifetime Diamond, Posts: 206 Just got off the delayed as usual Manchester to LHR 7-50 flight. Very poor coordination of boarding passengers, gate 143 has a corridor for passengers to line up and pass through. No BA staff member coordinates passengers, when they call boarding group 1 we frequently have to pass by other passengers who seem annoyed that we are jumping the queue and again BA staff do not explain well. The lounge in Manchester is over crowded and had very few chargers, seems like it came from the 1990s. No wonder BA is getting such poor ratings and they do not seem to want to recognise their failings and gloss over with we have invested billions. The changes to the BAEC and their lack of loyalty to frequent flyers will result in BA becoming a mediocre airline and reputations are hard to build. Please BA listen, I dont want you to fall further behind. Last edited by LondSE1; Feb 26, 2025 at 4:01 am #11 Join Date: Nov 2019 Location: Newcastle, UK Programs: BAC GGL, FB Plat, *A Sen, IHG Plat, ITAExec, Hilton Diamond, Radisson VIP, Mucci des repas d'enfant Posts: 7,407 #13 Join Date: Jun 2010 Location: London Programs: BA Gold Guest List, HH Lifetime Diamond, Posts: 206 Just checked which, on SH even Vueling and Aer Lingus scored higher than BA!!!! KLM/AF who are wooing us to switch loyalty did much better, BA you need to listen and Flyertalk members know what they are talking about. KLM/AF who are wooing us to switch loyalty did much better, BA you need to listen and Flyertalk members know what they are talking about. Last edited by LondSE1; Feb 26, 2025 at 3:59 am #15 Join Date: Apr 2015 Programs: Some Posts: 6,523 I often think BA/IAG (and posters here by extension who stick to oneworld) have a somewhat warped sense of what the US market is because AA is their main benchmark. There's an increasingly large gap to me between i) DL and UA on one side which offer extensive international networks and not bad premium business class products and ii) AA on the other which is basically a domestic and LatAm airline that happens to offer a smattering of TATL routes on top. Look at the absolutely massive gap in operational performance and share price that has opened up between UA and AA over the last few years, AA is a bit lost as an airline, so I'm not surprised to see them in the bottom five alongside BA."
}