{
  "url": "https://english.pravda.ru/news/recipes/164406-homemade-korovka-cow-candies-recipe/",
  "title": "Homemade Korovka: Step-by-Step Guide to Classic Russian Caramel Candies",
  "text": "Legendary Korovka (an affectionate for 'korova', meaning 'cow') candies bring childhood memories for many Russians. With four simple ingredients, a candy thermometer, and patient timing you can make tender, melt-in-your-mouth caramels at home. Why Korovka? The magic of these sweets lies in their simplicity. Milk, sweetened condensed milk, sugar, and butter transform under heat into a caramel mass that tastes of browned milk — a warm, buttery sweetness with just a hint of caramel bitterness. That delicate balance gives Korovka its signature, nostalgic flavor. Ingredients (makes 12 pieces) - Milk 3.2% — 150 ml - Sweetened condensed milk — 150 g - Sugar — 400 g - Unsalted butter — 75 g Nutritional value (per piece): 170 kcal / 0.96 g protein / 4.96 g fat / 30.65 g carbohydrates. How to make — step by step Equipment: heavy-bottomed saucepan, candy/oven thermometer, whisk or electric mixer, small (≈20×30 cm) glass or silicone pan, plastic wrap or parchment, sharp knife. Step 1 — Prepare the pan. Line a small glass or silicone pan (about 20×30 cm) with plastic wrap so it covers the bottom and sides. This makes removing the set caramel easy. Step 2 — Cook the base. In a heavy saucepan combine the milk, sweetened condensed milk, sugar, and butter. Heat over medium, stirring constantly until the sugar dissolves and the mixture comes to a boil. After boiling, reduce the heat and simmer while stirring until the mass turns an amber color and reaches 130 °C (266 °F) on a candy thermometer. If you don’t have a thermometer, perform the soft-ball test: drop a little syrup into cold water and shape it with your fingers — if it forms a soft but springy ball, it’s ready. Step 3 — Whip and cool. Remove the pan from the heat, set it in a cold water bath, and immediately beat the mixture at high speed for about 5 minutes. The mass will lighten in color and thicken. Pour it into the prepared pan, smooth the surface, and let it cool. Step 4 — Set. Chill the pan in the refrigerator for 30–40 minutes for faster setting, or leave at room temperature for 3–4 hours. When firm, lift the block from the pan by the edges of the wrap and peel it off. Step 5 — Cut and wrap. Use a sharp knife to cut the block into small squares or rectangles. Wrap each candy in a square of parchment or foil for authentic presentation and easy storage. Tips & Common Mistakes - Use a heavy pan. Thin bottoms heat unevenly and burn sugar. A heavy pot gives you control and even cooking. - Don’t rush. Cook over moderate heat; high heat will burn the sugars and ruin texture. - For softer candies remove from heat at 125 °C (257 °F). - Salted twist: add a pinch of flaky sea salt for a salted-caramel note. - Avoid crystallization: stir continuously and gently; interrupted stirring can let sugar crystallize and give a grainy texture. - Line the pan: always use plastic wrap or parchment; otherwise the candy will stick. Error, Consequence, Alternative - Error: cooking too long. Consequence: candies turn hard as toffee. Alternative: stop at the correct temperature or use the soft-ball test. - Error: poor stirring. Consequence: sugar crystallization and gritty texture. Alternative: stir continuously and evenly. - Error: pouring into an unlined pan. Consequence: candies stick. Alternative: line with wrap or parchment."
}