{
  "url": "https://norecipes.com/how-to-make-ikura/",
  "title": "How to Make Ikura - Curing Salmon Roe",
  "text": "Autumn is spawning season for salmon and trout, when they return to their home rivers with bellies full of eggs. If you fish for salmon or live near a spawning area, you've probably seen those vibrant orange skeins of roe at your local fish market. But have you ever wondered how to make ikura at home? One of the first places I lived in Japan was on the northern island of Hokkaido, where salmon is everywhere in the fall. I've been curing ikura every year since my time up north, and over the years, I've picked up a few techniques that make the process a lot easier. The biggest game-changer was a method I learned from an elderly fishmonger in Sapporo for gently separating the roe from the skein-it's simple, efficient, and gives great results. In this ikura recipe, I'll walk you through everything you need to know to turn those dull orange sacs of roe into the glistening pearls of ikura you get at sushi bars. Why My Recipe Works - Using a grill grate or cooling rack to separate the salmon roe from the skein physically is easier than using the hot water method and results in fewer popped eggs. - Curing the ikura in liquid brine seasons the salmon roe more evenly while giving the opportunity to infuse your ikura with other flavors. - I like making ikura brine with sake because it contains a high concentration of amino acids, such as glutamic acid and aspartic acid, which produce the taste of umami. Ingredients - Salmon Roe Skein - Until they are laid, salmon eggs are bundled up in a matrix of connective tissue called a skein. This is called sujiko in Japan. The name changes to ikura when the eggs are separated from the skein and cured. When choosing a skein of roe, look for one with plump, large pearls that are shiny. This is usually a good sign that they are mature(fully grown) and fresh. Immature roe or previously frozen roe tends to pop when separated from the skein, so I don't recommend it. - Sake - You can read more about the superpowers of sake here, but the TLDR is that it contains amino acids that trigger the taste of umami in your mouth. The alcohol is burned off by boiling it, leaving you with an umami-rich liquid that makes the perfect base for the brine. If you can't find sake, another option is to use water with MSG, which will give you the umami but not the flavor. Another option is to use dashi stock as the base for the brine, as you can see in my dashi brine ikura recipe. It's a tasty alternative, but I prefer using sake these days because it has a much milder flavor that allows the flavor of the salmon roe to shine while still infusing it with loads of savory flavor. - Salt - Salt is crucial for curing the salmon roe because it seasons and helps preserve it while making the orbs or roe crystal clear. I use standard table salt for this. Like caviar, high quality ikura has a lower sodium content. It tastes better but won't last as long, so my cured salmon roe is much less salty than the kind you buy in stores, but if you like yours more salty, just add more salt. - Dashi Soy Sauce - One of the things that sets Japanese ikura apart from the salmon roe in other countries is that it's often cured with some soy sauce. This imparts extra umami while adding depth and character to the brine. To take this to the next level, I like using soy sauce infused with konbu and katsuobushi, and you can check out my dashi soy sauce recipe for details on how to make it. - Sugar - A touch of sugar balances the salinity of the other seasonings and adds a mild sweetness that compliments the flavor of the sake. How to Make Ikura Ikura preparation begins with making the brine. Combine the sake, sugar, salt, and dashi soy sauce in a pot and bring it to a rolling boil. Boiling serves two purposes: it dissolves the sugar and salt and evaporates the alcohol in the sake. Any remaining alcohol will make your ikura boozy and give it a bitter taste, so make sure you boil it until the smell of alcohol has dissipated (about 2 minutes). Then, you want to cool the brine to room temperature. I speed this up by placing the pot in a bowl of cold water and changing the water a few times. It's probably easiest to watch the video below for my technique to separate the salmon eggs from the skein, but I like to use a physical process that involves rubbing it on a wire mesh. First, you want to split the skein open lengthwise gently with your fingers. Once it's opened, position a mesh grill or cooling rack with ⅓-inch holes over a glass bowl and then use your fingers to gently but firmly rub the split side of the salmon roe skein over the holes to separate the individual eggs. Ideally, you want to use a mesh made of non-reactive metal (such as stainless steel) here, as the roe will cause aluminum to oxidize. That being said, the salmon roe gets washed in the next step, so it's not a big deal at this stage. To make sure you get every last glorious gem from the egg sack, sandwich the skein between two disposable chopsticks and roll it up while pressing on the bulge with your fingers. This should press out any remaining eggs. Now, you want to pick out any bits of skein in your bowl of ikura. I usually do this by combing my fingers through the pearls of roe, looking for any that are stuck together. The last step is to wash the salmon roe in several changes of cold water until it runs clear. This is also a good chance to look for popped eggs or any remaining bits of skein. From this point on, you need to be careful not to let the salmon roe come into contact with any reactive metals, such as silver, steel, or aluminum, as there is something in the roe that will cause most metals to oxidize, giving the roe a metallic taste. Drain the washed roe in a non-reactive strainer and transfer the salmon roe to a glass or plastic container. Pour the chilled brine over the roe, stirring gently to combine. Cover the container and let the ikura cure in your refrigerator overnight. This curing step is vital as the liquid brine absorbs into the roe through osmosis, which seasons the ikura while plumping each egg up into a vermillion gem. After 12 to 24 hours, drain the ikura in a non-reactive strainer and enjoy it within three days. You can also freeze the ikura in single-serving batches to enjoy it over the next few months. How to Eat Ikura One of the most famous ways of eating fresh ikura is atop a petite mound of sushi rice wrapped in a short strip of nori to make a cup that can be used to hold the ikura. This is called ikura gunkan sushi (sometimes mislabeled as ikura nigiri). Some other ways ikura sushi can be made is by rolling it into a hosomoki-style roll or a temaki hand roll. The vibrant orange gems of ikura also make for a beautiful topping on Seafood Chirashi Sushi, which is a bowl of sushi rice topped with various cuts of sashimi. Salmon Oyako Donburi pairs marinated raw salmon with ikura (salmon roe), served over a bowl of hot rice for a rich, umami-packed \"parent and child\" meal. At home, most people opt to make ikura don by topping a bowl of piping hot rice with a few generous scoops of ikura and garnishing with shredded nori or green shiso leaves. I also like using ikura as a beautiful briny garnish for dishes like my Japanese Salmon Rice or my Chawanmushi. 📖 Recipe Units Ingredients - ¾ cup sake - 1 tablespoon dashi soy sauce - 1 ½ teaspoons salt - 2 teaspoons sugar - 350 grams salmon roe (whole skein) Instructions - Add ¾ cup sake, 2 teaspoons sugar, 1 ½ teaspoons salt, and 1 tablespoon dashi soy sauce to a pot and bring the mixture to a rolling boil. Boil the brine until it no longer smells like alcohol (around 2 minutes). - Place the pot in a bowl of cold water to chill the brine (you may need to change the water a few times). - To separate 350 grams salmon roe from the skein, split it open lengthwise down the middle with your fingers. - Set a mesh grill or cooling rack with ⅓-inch (1-centimeter) holes over a bowl and then rub the split side of the salmon roe skein over the holes to separate the individual eggs. Continue until you've separated most of the eggs. - To get the last bit of salmon roe out of the roe sack, you can sandwich the skein between two disposable chopsticks and roll it up using your fingers to press out the salmon eggs. - I recommend picking through the roe and removing any bits of skein still stuck to it. - Wash the roe in several changes of cold water until the water runs clear, and pick any popped eggs or bits of skein out. - Drain the salmon eggs well in a non-reactive strainer (plastic or stainless steel), then put them in a non-reactive container (preferably glass). Cover with the chilled brine and stir to combine. Cover and refrigerate overnight. - After 12 hours (or up to 24 hours), drain the ikura in a non-reactive strainer. Eat or freeze the ikura within three days. Nutrition Facts FAQ Ikura (いくら) is the Japanese term for salmon roe that's been separated from its skein and cured in a soy-sauce-based brine. Originating from the Russian word \"ikra,\" which means \"fish roe,\" these small, orange jewels are celebrated for their vibrant color, briny flavor, and unique, pop-in-your-mouth texture. In Japanese cuisine, it's commonly used in dishes such as ikura sushi and ikura don, as well as a garnish for various dishes. Although ikura is sometimes called \"salmon caviar\" or \"red caviar,\" ikura and caviar are made with different types of fish eggs. \"Caviar\" traditionally refers to the salt-cured roe of sturgeon. Ikura, on the other hand, refers explicitly to cured salmon roe. Ikura sushi is a specific type of sushi that features ikura, or salmon roe, as its main topping, such as ikura gunkan maki. It can also be used as a filling for sushi rolls wrapped in nori seaweed such as temaki sushi or hosomaki. Yes, once the salmon roe has been separated from its skein and cured, the ikura can be frozen in individual portions to keep it up for several months. How long it will keep will depend on the contain you use and your freezer. I recommend putting it in a sealed heavy-duty container to minimize freezer burn. To eat it, just defrost the ikura in the fridge. Ikura is a 3-syllable name pronounced as follows (read the italicized parts). i like even ku like cool ra like the \"ra\" sound does not exist in the English language, and the best way to make it is to say the word \"romp\" with the tip of your tongue at the front of your mouth."
}