{
  "url": "https://www.calendarr.com/peru/semana-santa/",
  "title": "Semana Santa: los días más importantes y qué se hace - Calendarr",
  "text": "La Semana Santa también conocida como la Semana Mayor, es una conmemoración de la religión cristiana que se celebra anualmente entre los meses de marzo y principios del mes de abril de cada año. En 2026 la Semana Santa inicia el domingo 29 de marzo y finaliza el domingo 5 de abril. La conmemoración recuerda la Pasión de Cristo, narrada en los evangelios bíblicos. Allí se cuentan los sucesos protagonizados por Jesús, desde su entrada a Jerusalén, la última cena, su viacrucis, muerte y la posterior resurrección. La Semana Santa se recuerda por medio de diversas actividades, misas, procesiones, viacrucis vivientes, entre otros ritos cristianos. Miles de fieles religiosos se reúnen para rememorar los sucesos por los que Jesucristo se reconoce como el salvador de la humanidad e hijo de Dios. Semana Santa en 2026 Este año la Semana Santa coincide con los siguientes días de abril: - 29 de marzo, Domingo de Ramos - 30 de marzo, Lunes Santo - 31 de marzo, Martes Santo - 1 de abril, Miércoles Santo - 2 de abril, Jueves Santo - 3 de abril, Viernes Santo - 4 de abril, Sábado de Gloria - 5 de abril, Domingo de Resurrección Acontecimientos de la Semana Santa La Semana Santa está precedida por la Cuaresma. En muchos países se considera al Viernes de Dolores también conocido como Viernes de Concilio, como el día inicial de este ciclo santo, que sucede antes del Domingo de Ramos y que recuerda el sufrimiento de María, Madre de Cristo, durante la Semana Santa. Domingo de Ramos El Domingo de Ramos se considera algunos países de Europa y regiones de América, como el inicio de la Semana Santa. Durante este día se conmemora la entrada de Jesucristo a Jerusalén, en medio de una gran multitud de personas que le recibieron cantándole: “Bendito el que viene en el nombre de Jehová; Desde la casa de Jehová os bendecimos.” Libro de los Salmos 118: 25-26 Durante este día además se realizan misas donde se bendicen los ramos y las palmas, que son colocadas en los portales de las casas para que bendigan a los hogares y las familias de los fieles devotos. Vea También Domingo de Ramos Jueves Santo Durante el Jueves Santo se celebra La última Cena o la Santa Cena, el lavatorio de pies y la institución de la Eucaristía. Se considera como el día en que se abre el Triduo Pascual. Narra el episodio bíblico en el que Jesús se encontró por última vez con sus discípulos para cenar la Pascua, siguiendo la tradición judía de cenar un cordero puro y del año. Vea también Jueves Santo Viernes Santo Se considera el segundo día del Triduo Pascual y uno de los días centrales de la Semana Santa. En ese día ocurre la crucifixión de Jesucristo quien es entregado por Judas Iscariote y llevado ante Poncio Pilato, quien era en ese momento el prefecto de Judea. Luego de ser juzgado, Jesús es entregado para su crucifixión la cual ocurre en Gólgota a las afueras de Jerusalén. horas después de pasada su muerte, José de Arimatea reclamó el cuerpo de Jesús ante Pilato y lo trasladó a una cueva, donde fue cuidadosamente embalsamado, perfumado y envuelto en un gran manto. Vea también Viernes Santo Sábado Santo El Sábado Santo, también llamado Sábado de Gloria se conmemora a Jesús en su sepulcro considerándose además, la víspera de la resurrección de Jesús. En el Sábado Santo es tradicional conservar silencio y no realizar la eucaristía, se conmemora la Soledad de María, madre de jesús. En algunos lugares durante la vigilia pascual se bendice el fuego, las aguas y se encienden velas como símbolo de iluminación por el regreso del Mesías. Domingo de Resurrección El Domingo de Pascua, también conocido como el Domingo de Resurrección se narra respectivamente en los evangelios de San Juan, San Mateo y San Marcos. Este ocurre el domingo posterior a la crucifixión de Jesús, cuando el Mesías aparece a varios de sus discípulos para luego reunirse con ellos, dándoles el Espíritu Santo. En el Evangelio de Lucas 24:39, se narra lo que Jesús les dice a sus seguidores : ¡Miren mis manos y mis pies! ¡Soy yo! ¡Tóquenme! ¡Mírenme! ¡Soy yo! Los fantasmas no tienen carne ni huesos, pero yo sí. Durante el domingo de Pascua o Resurrección, la Iglesia católica también celebra la fiesta de la Ascensión, conmemorando la presencia de Jesucristo en el cielo reunido con Dios padre. Con este día se cierra del Triduo Pascual y se considera la culminación de las actividades de la Semana Santa que se realizan en varias partes del mundo, donde el catolicismo es dominante. Vea también Domingo de Resurrección ¿Cómo se celebra la Semana Santa en Perú? En Perú la Semana Santa se conmemora grandemente entre todos los fieles creyentes de la religión cristiana. La fiesta religiosa se celebra en todo el país con gran devoción dese hace varios siglos. En Lima la procesión más popular ocurre el Viernes de Dolores y su recorrido está organizado para salir desde la Basílica de la Merced. Esta procesión pasea la imagen de Jesús Nazareno, el Santo Cristo del Auxilio y la Virgen de la Piedad. En Ayacucho, la Semana Santa es una de las festividades más importantes de la región, durante esta época del año se mezclan costumbres religiosas y andinas. En la región es tradicional la salida del Nazareno y la celebración del Cristo Resucitado. En Áncash, también se celebran procesiones con muchos años de tradición y presencia entre sus pobladores. Un ejemplo es la popular procesión del Nazareno móvil, que realiza las tres caídas lo que le da realismo a los sucesos que se teatralizan durante el desfile religioso. En Cusco, por ejemplo, ocurre la procesión del Señor de los Temblores que hace su recorrido por la Plaza de Armas, uno de los lugares más centrales y transitados de la región. En Arequipa se lleva a cabo la Quema de Judas, la cual se realiza durante la madrugada del Domingo de Resurrección. La tradición tiene larga data en este lugar y consiste en quemar un muñeco de trapos con fuegos pirotécnicos dentro de él. Es la representación de la traición de Judas y como una crítica a los discursos políticos, autoridades y personajes nefastos para la ciudad y el país."
}