{
  "url": "https://en.wikipedia.org/wiki/Chupa_(film)",
  "title": "Chupa (film) - Wikipedia",
  "text": "Chupa (film) Chupa is a 2023 American fantasy adventure film directed by Jonás Cuarón, written by Sean Kennedy Moore, Joe Barnathan, and Marcus Rinehart from a story by Sean Kennedy Moore, Joe Barnathan, Marcus Rinehart, Brendan Bellomo, and Michael Dougherty, and starring Demián Bichir and Christian Slater with supporting roles done by Evan Whitten, Ashley Ciarra, and Nickolas Verdugo. It tells the story of a boy who visits his grandfather and cousins in Mexico where he comes across a baby chupacabra that is being hunted by a government scientist. Produced by 26th Street Pictures, it was released on April 7, 2023, on Netflix and received mixed to positive reviews from critics. Plot [edit]In 1996, scientist Richard Quinn is hunting down the chupacabra, a supposedly mythical creature, in San Javier. A government doctor, he believes that its healing powers will help revolutionize medicine. Locating one with a cub in an old mine, he chases it. Injured by a passing vehicle, she leaves her cub hidden to lure the pursuing scientists away. Meanwhile, following the death of his father Beto from cancer, 12/13-year-old Alex flies from Kansas City to Mexico where he met his extended family for the first time, a trip his father had planned for them both. Alex meets his grandfather Chava, a former lucha libre champion, energetic wrestling-obsessed younger male cousin Memo, and fearless hip 14-year-old older female cousin Luna. Just as Alex begins to get his bearings, on his first night he discovers a young chupacabra cub. He wakes to find it licking a cut on his hand. As Alex realizes they are not positively regarded, he says nothing. A short time later, Luna drives Memo and Alex into town to search for Chava. She explains that he often wanders off (he may have Alzheimer's disease). In the market, Alex sees a miniature colorful figure, which the seller tells him is a chupacabra, which he says is not such a bad creature. Back on the road, the kids find Chava walking with a billy goat. He bought it, but cannot explain why. On their return to the ranch, they come across some men carefully searching an area where Quinn finds evidence of what he believes is the chupacabra. At the ranch house, they watch yet another news report on the feared full-grown Chupacabra, fabled to feed on livestock. Chava turns off the TV, saying it is nonsense and lies. Once he goes out, Alex tells Luna that their grandfather is hiding something. He shows her a small music box he found him playing in the barn. She chalks it up to more evidence of his suspected Alzheimer's. Alex plays the music box in the doorway of the barn later. Hearing a mix of cooing and other sounds, he turns to see a strange creature: a small cat-like animal with bird-like wings and small but sharp fangs. Alex gets it a plate of sausages from the house to see if it is hungry. When a thunder storm rolls through, he promises to protect it. Alex wakes to Memo looking for him. He tries to usher him out of the barn, but the young Chupacabra presents himself as Alex befriended him. He has just gotten Memo calmed down when Luna shows up. Also initially screaming, they show her that he is friendly. Luna thinks they should put him out, but Alex insists they must protect it as it is a cub. Chava comes in, agreeing with Alex. Chupa, as Alex has named it, approaches him. Chava explains that he had accidentally hit its parent with his car some nights ago and had found it hiding nearby. He keeps it a secret as he knows people are looking to exploit it. Returning to the house, Quinn introduces himself, explaining he is from an American government agency that seeks rare species for medical purposes. Finding a license plate from the crash site, he has traced it to him. Despite Quinn's seemingly generous agenda, Chava refuses to let him snoop around, offering to demonstrate a lucha libre move if he does not leave. After Alex promises Chupa he will find his family, Memo comes to teach it to fly. Taking it to the barn roof, Memo fearlessly 'flies' into a haystack below. Encouraging it to follow, Chupa gets the wings to work a bit before also falling into the hay. In the house, Chava shows Alex a video of El Perico Verde doing his signature move suplex, which he had taught him himself. He reveals that Beto was the fighter, but never became professional because he met Alex's mother and moved to the States. Once Chava talks about Beto enough to sadden Alex, he pulls out his Game Boy. He recognizes it is his way of avoiding his feelings. Taking the video console, Chava tells Alex he must fight him for it. Donning his Relampago Azul mask, and Alex his father's, he gets him to express himself. Having learned that his new friend, Chupa, has a secret history with his family and is being hunted by the determined Quinn to try to harness his powers, Alex and his family set off on the adventure of a lifetime to protect Chupa from impending danger. Cast [edit]- Demián Bichir as Chava,[1] a former lucha libra wrestler - Christian Slater as Richard Quinn, a government scientist who is hunting the chupacabra - Evan Whitten as Alex, the grandson of Chava who comes to Mexico to see him - Ashley Ciarra as Luna, the grandniece of Chava and cousin of Alex who speaks English and enjoys different music - Nickolas Verdugo as Memo, the grandnephew of Chava and cousin of Alex who doesn't speak English and does lucha libre stuff - Adriana Paz as Julia, the mother of Alex - Alex Knight as Jumpsuit - Julio Cesar Cedillo as Dr. Juan Carlos Ortega, a doctor who tends to Chava - Gerardo Taracena as a police officer - Michael Kostroff as Taylor, a government worker that Quinn answers to Production [edit]In August 2020, Jonás Cuarón was set to direct a Chupacabra film he co-wrote with Marcus Rinehart, Sean Kennedy Moore and Joe Barnathan. Chris Columbus, Michael Barnathan and Mark Radcliffe produced the film under their 26th Street Pictures banner for Netflix.[2] In June 2021, the film was titled Chupa, with Demián Bichir, Evan Whitten, Ashley Ciarra and Nickolas Verdugo joining the cast.[1] Filming took place in multiple locations throughout New Mexico starting in August[3] and running through October 2021.[4] The film was scored by Carlos Rafael Rivera.[5] The screenplay is credited to Sean Kennedy Moore, Joe Barnathan, Marcus Rinehart, and Brendan Bellomo, with Michael Dougherty, Timothy J. Sexton, and Zach Shields receiving \"additional literary material\" credit.[6] Release [edit]Netflix revealed that the film was set to release in early 2023.[7] In March 2023, a release date of April 7 was announced.[8] The announcement of the name was met with some criticism due to the word \"chupa\" being a slang term for fellatio in Spanish.[9][10] Reception [edit]On the review aggregator website Rotten Tomatoes, 68% of 25 critics' reviews are positive, with an average rating of 5.7/10. The website's consensus reads: \"Uneven yet ultimately endearing, Chupa channels classic family-friendly adventures with evident enthusiasm and a whole bunch of heart.\"[11] On Metacritic, the film has a score of 48 out of 100, based on 6 critics, indicating \"mixed or average\" reviews.[12] References [edit]- ^ a b Vlessing, Etan (June 17, 2021). \"Demián Bichir & More Board Jonás Cuarón's 'Chupa' Feature At Netflix\". The Hollywood Reporter. Retrieved July 16, 2021. - ^ Kroll, Justin (August 7, 2020). \"Jonas Cuarón To Direct Untitled Chupacabra Film For Netflix; Chris Columbus Producing\". Deadline Hollywood. Retrieved January 26, 2022. - ^ Gomez, Adrian (August 24, 2021). \"Demían Bichir to star in Netflix film Chupa - Albuquerque Journal\". Albuquerque Journal. Journal Publishing Company. - ^ \"Netflix film Chupa filming in New Mexico, including Mesilla\". Las Cruces Sun-News. August 25, 2021. - ^ \"Carlos Rafael Rivera Scoring Jonas Cuaron's 'Chupa'\". Retrieved April 7, 2023. - ^ https://directories.wga.org/project/1213311/chupa - ^ Grobar, Matt (January 18, 2023). \"Netflix 2023 Film Slate Unveiled: Luther: The Fallen Sun, The Mother, Extraction 2, Heart Of Stone, The Killer, Rebel Moon & Others Get Premiere Dates\". Deadline Hollywood. Penske Media Corporation. - ^ \"'Chupa' Images Show Christian Slater in a New Supernatural Adventure\". Collider. March 1, 2023. Retrieved March 1, 2023. - ^ Muir, Ellie (March 15, 2023). \"Spanish-speaking viewers point out glaring issue with Netflix's 'Chupa'\". The Independent. Retrieved March 15, 2023. - ^ Klein, Brennan (March 15, 2023). \"Netflix's Chupacabra Movie Roasted Online For Filthy Translation Error\". ScreenRant. Retrieved March 15, 2023. - ^ \"Chupa\". Rotten Tomatoes. Fandango Media. Retrieved April 10, 2022. - ^ \"Chupa\". Metacritic. Fandom, Inc. Retrieved April 8, 2023. External links [edit]- 2023 films - 2023 adventure films - 2023 fantasy films - 2023 American films - 2020s English-language films - 2020s fantasy adventure films - American fantasy adventure films - English-language fantasy adventure films - Netflix original films - Films about chupacabras - Films directed by Jonás Cuarón - Films produced by Chris Columbus (filmmaker) - Films produced by Michael Barnathan - Films scored by Carlos Rafael Rivera - Films set in 1996 - Films set in Mexico - Films shot in New Mexico"
}