{
  "url": "https://www.cnn.com/health",
  "title": "Health | CNN",
  "text": "- • For Subscribers For SubscribersFor Subscribers Why does the same cold virus hit some people harder than others? The nose knows - What to know about the Nipah virus - How do you live longer? Your genes may help - US life expectancy reached a record high in 2024 as deaths from drug overdose and Covid-19 dropped - Doctors are ignoring new federal vaccine recommendations - Tissue boxes, binge-watching and DoorDash: How you’re making it through a record-breaking flu season - The flu isn’t done yet, as new data suggests infections are rebounding - Plastic surgeons group calls for delaying gender-affirming surgery until age 19 - Dry eyes? These expert-approved heated eye masks can help - MAHA has reshaped health policy. Now it’s working on environmental rules - The best meal delivery services to try in 2026, according to dietitians and editors - The 5 best Brooks running shoes, from a running coach who tests shoes for a living - What do you want to know about playing sports on turf or grass? - Tracking measles cases in the United States Ad Feedback Space and science - Company that ‘resurrected’ dire wolf announces frozen biovault for endangered species - Skeletons found in mysterious pit died violent deaths in Anglo-Saxon-era England - NASA delays launch of historic moon mission - This is Countdown, CNN’s newsletter covering NASA’s first time sending humans to deep space in over 50 years Ad Feedback More Life, But Better - Staying up late is linked to poorer heart health. Here’s what night owls need to know - The key to a fulfilling life? Feeling like you matter to others - Why ‘admin nights’ are the new book club for busy adults - How to stay safe in cold weather, according to a doctor - One cookbook author ate chocolate cake daily for 6 years. Now she shares her recipe - What cardiologists want you to know about MAHA’s push to eat more fat - It’s not too late to try Dry January. Start now, with a doctor’s advice Ad Feedback In case you missed it - One engineer’s quest to reconstruct hope for breast cancer survivors everywhere - Why we crave intimacy - Here’s how brands leverage your motivation to market their products around the new year - • For Subscribers For SubscribersFor Subscribers I went to a longevity conference, but we may already know the key to living longer"
}