{
  "url": "https://www.metric-conversions.org/temperature/fahrenheit-to-celsius.htm",
  "title": "Fahrenheit to Celsius conversion: °F to °C calculator",
  "text": "Simple, quick °F to °C conversion Fahrenheit to Celsius conversion is difficult to do in your head but a rough °F to °C conversion is actually quite easy – just take 30 from the Fahrenheit value and then half it. This should be reasonably accurate for weather temperatures. Fahrenheit and Celsius definition Fahrenheit and Celsius are the two most common temperature scales worldwide. Developed by the German physicist Daniel Gabriel Fahrenheit in the early 1700s, Fahrenheit is widely used in the United States and, to a lesser extent, some other countries such as United Kingdom and Ireland. The freezing point of water is set at 32 degrees and the boiling point of water is set at 212 degrees. Celsius, also known as Centigrade in some settings, is used in the majority of the world for temperature measurement. Created by Anders Celsius, a Swedish astronomer in the mid-1700s, the freezing point of water is denoted as 0 degrees C while the boiling point of water is 100 degrees C. The Celsius scale is generally more globally accepted than the Fahrenheit scale. Despite this the Fahrenheit scale is still commonly used for weather forecasts, cooking, and everyday references in the United States of America. Why is converting Fahrenheit to Celsius so difficult? Conversion between Fahrenheit to Celsius can be difficult because each of the temperature scales have different starting points and different increments between each degree. On the Fahrenheit scale, the freezing point of water is at 32 degrees F and the boiling point of water at 212 degrees F. This means that there are 180 degrees between these two points. Celsius has the freezing point of water at 0 degrees C and the boiling point at 100 degrees C making the interval between the points 100 degrees. The combination of these differences makes conversion between Fahrenheit to Celsius more complicated. To convert Fahrenheit to Celsius, you must first subtract 32 from the Fahrenheit value and then divide the result by 1.8 (or 5/9). This conversion can make it difficult to mentally perform in you head without the use of a calculator or conversion chart such as the one provided on this page. Common conversions from Fahrenheit to Celsius Absolute zero: -459.67°F = -273.15°C Parity: -40°F = -40°C Freezing point of water: 32°F = 0°C (at 1 atmosphere of pressure) Average human body temperature: 98.6°F = 37°C Boiling point of water: 212°F = 100°C (at 1 atmosphere of pressure)"
}