{
  "url": "https://www.flyertalk.com/forum/british-airways-british-airways-club/2181900-ba-american-express-companion-voucher-master-thread.html",
  "title": "BA American Express Companion Voucher | Master Thread - FlyerTalk Forums",
  "text": "Last edit by: golfmad British Airways American Express Companion Voucher (2-4-1) Discussion and Wiki Thread Summary The British Airways American Express Companion Voucher entitles you to receive a second seat for a companion on the same flight as you and in the same cabin when you make a reward booking on a British Airways mainline flight with a BA prefixed flight number (but not on flights operated by franchisee, codeshare or alliance airlines). All youll have to pay is the taxes, fees and charges for you and your companions tickets. From July 2022 (for vouchers earned after 1 September 2021) a solo traveller can use a voucher to save 50% of the Avios required for a redemption. The voucher is easy and straightforward to use. You as the cardholder may book a redemption ticket, paid for entirely in Avios, and you take a travel companion with you at no additional Avios cost. The usual taxes, fees and surcharges apply to both passengers, which must be paid for by the card holder. New terms apply to vouchers earned after 1 September 2021. The notes below are marked \"Legacy\" and \"Revised\" to indicate where they differ. Some significant changes: Standard Voucher Terms and Conditions (see https://www.britishairways.com/en-gb...amex-companion) Frequently Asked Questions Q: What is the British Airways American Express Companion Voucher? A: The British Airways American Express Companion Voucher entitles you to receive a second seat for a companion on the same flight as you and in the same cabin when you make a reward booking on a British Airways mainline flight with a BA prefixed flight number (but not on flights operated by franchisee, codeshare or alliance airlines). All youll have to pay is the taxes, fees and charges for you and your companions tickets. A solo traveller can also use a Revised voucher to reduce the Avios component of a redemption by 50%. Q: How do I qualify for the British Airways American Express Companion Voucher? A: To qualify for your British Airways American Express Companion Voucher, you must reach the required spend threshold for your card, as shown below, within a 12-month period ending on the anniversary of the date of issue of your BA/AMEX Card. Please note that required spend does not include cash withdrawals, interest, balance transfers and fees. The increased spend requirement of £15,000 will come into effect on 1 November 2024 even if this is part-way through a membership year. Q: Ive hit my spend. When will the voucher show up? A: Once you hit the target, you will receive an email congratulating you on the award of your voucher. It will show up quite prominently on your BAEC account home page after logging in. American Express directly states once a Card Member qualifies, we compile a list of eligible Card Members (monthly) and send it to British Airways (can take 3-5 days). British Airways advises the Card Member of their e-voucher / Companion Ticket via mail within 10-15 days. The e-voucher / Companion Ticket shows online for a period of time to redeem, when the Card Member logs onto their Executive Club (Avios) account at ba.com. Q: Where can I see my voucher? A: Go to the BAEC website. At the top of the welcome page, it will appear under the heading \"My eVouchers\", looking like the image above. In addition, you can go to the eVouchers page, where you can see used and unused vouchers. Q: How long is the voucher valid for? A: When the voucher is earned on the BA Premium Plus American Express card, the voucher is valid for 24 months. When the voucher is earned the free BA American Express card, it is valid for 12 months. You must have booked and completed the whole of your outbound travel by the date the vouchers validity expires, and it cannot be extended under any circumstances. The longer validity of the Premium Plus voucher is often cited as a very good reason to pay the card fee (£250 as of July 2022). Q: How do I get the most value from my voucher? A: There is potential for you to save a substantial amount of Avios using the voucher, but its value to you is something only you can define. But in short, using the voucher for redemptions in First or Club World will maximise its value, as these naturally incur the highest redemption spend and will therefore save you the most Avios. Note that Revised vouchers earned using a free card only allow bookings in economy cabins. Q: Can I use the voucher and part-pay with Avios? A: The ticket itself must be paid for entirely with Avios. Taxes, surcharges and fees (the \"cash component\" of the ticket composed of these fees, which are charged on standard redemptions in any event) must be paid for using an American Express card, although not necessarily a British Airways one (this is stated in the Terms and Conditions, but any Amex works) Q: How do I pay the taxes, surcharges and fees? A: An American Express card must be used to settle the taxes, surcharges and fees for both passengers. The Terms and Conditions state you must use the same American Express card that the voucher was earned on to settle this payment, but in practice any American Express card can be used. You may not use a Visa, MasterCard or other payment form to settle these fees. Q: Can I book an open-jaw trip using the voucher? A: You can, but you will need to call BA. For the trip to be valid, the length of the surface sector must be shorter than either of the flown journeys. If you want to fly from LHR to AAA and from BBB back to LHR, then the LHR-AAA and BBB-LHR distances must both be greater than the distance between AAA and BBB. Q: Can I book my outbound flight at 355 days and call back to add the return booking? A: Yes, but you will need to call BA. Once availability shows, you can call to add the return leg the BA policy is to waive the £35 change fee per passenger if the return was beyond the booking window when you booked the outbound, i.e. that you booked your outbound leg when seats became available at T-355. For example: If you booked your outbound at T-355 and called later to add the return leg the change fee would be waived. If you booked your outbound at T-50 and then booked the return for T-60 a few days later, the fee will not be waived. Important update, posted by cbagent on 12 Feb 2018: If adding the return sector to an existing one-way Amex 241 where the inbound dates were out of range at time of booking, it is now possible to book the flights online as a new one way Avios booking then call BA UK office when open. Half of the Avios on this new booking will then be refunded to reflect Amex voucher use. The benefit of this is that there is no need to try calling open BA office in the early hours of the morning and the downside is the itinerary will be ticketed as two one way bookings. In addition the Avios balance must be high enough to take a debit of double the required Avios albeit for a relatively short time. May be of use for some people. Note: you are strongly advised not to use this new method of booking two separate one ways if going to the US/Canada. When booking as two separate bookings and having the 2-4-1 applied across both is that taxes/charges/fees are not recalculated when the voucher is applied across to the second booking. Sometimes this will work out well for you (bookings exHKG for example), but for exUS or exCA bookings it is not recommended at all since exUS/CA taxes/fees/charges are very high. As an example, using the two separate bookings method on a LHR-JFK booking in J or F for two people would cost you about £480 more that the old method of calling and adding the inbound to an existing booking. Please see post 965 here for more information. Important update, posted by DeathSlam on 8 Feb 2024: From 7th December 2022 it is now possible to use Amex 241 vouchers on Aer Lingus and Iberian flights. https://mediacentre.britishairways.c.../details/14362 Q: As redemption seats are released at midnight GMT, what is the best way to secure them? There is no guarantee they will be available when the BA office opens in the morning! A: Call a BA office that is open at midnight GMT. You will then be able to make the booking without waiting for your local office to open. Depending on timezone, Japan, Hong Kong and even the USA are frequently contacted for this purpose. Q: I made a one-way booking using a voucher and have already completed the travel on that booking. Can I now add an inbound flight to the booking to make use of the voucher? A: No. Q: Does cancelling my BA American Express card mean I will lose the voucher? Does downgrading my BA American Express Premium Plus card to the free card mean I will lose my voucher? A: No. Contrary to what American Express will tell you, you will keep the voucher if you cancel the card entirely, and similarly your voucher will retain its two year validity if you downgrade from the Premium Plus card to the free card. Remember though that you will need to pay the taxes and fees on an American Express card, so it may be worth asking to downgrade the Premium Plus to the free card for this purpose if you dont hold another Amex. Q: If I cancel my 2-4-1 booking, will I get the voucher back? A: Yes, the voucher will appear in your BAEC some time after cancellation along with your Avios. The voucher will retain the same expiry date. Q: If I cancel my BA Amex after making a 2-4-1 booking, and later cancel the booking, will I get the voucher back? A: Collective forum experience would lend us to believe that in this situation you would receive the voucher back, as the voucher is credited to your BAEC account and there would be no way for it to know that you had subsequently cancelled your card. The expiry date of the voucher will remain the same. Q: If I have already used a 2-4-1 voucher, can I still find out what its expiry date is? A: Yes. Log in to your BAEC account, and then go to the eVouchers page. This will list the details of all relevant vouchers. The details include the expiry date of each voucher, and for vouchers that have been used, the reference of the booking on which it has been used, so that you can see which voucher was used on which booking. Q: There is one redemption seat available on the route I want. If I use the voucher, will it book a second seat for me automatically? A: No. The voucher makes use of existing availability, so to book travel for two passengers there must be a minimum of two redemption seats available on the flight. Q: Availability on BA is really poor. Can I book a codeshare flight? A: No. The terms of the voucher state that the booking is restricted to BA metal. You should be able to secure availability at T-355 days, as BA release two Club World seats for all flights at this point. Q: Can I use a Gold Upgrade for Two voucher in conjunction with my voucher? A: Yes. You will need to call BA to make the booking. Q: Can I use a Joker in conjunction with my voucher? A: Yes. You will need to call BA to make the booking. Q: Can I fly mixed class bookings using the voucher? A: Yes, however all companions on the booking must fly the same cabin. This means you could fly First outbound and Club World inbound together using the voucher, but you cannot have one passenger in Club World and another in World Traveller Plus on the same leg of the booking. Q: Can I book myself on one flight and my companion on the next flight? A: No. You must fly on the same flights, in the same cabin. This also applies to all four passengers if the booking has been made by a Premium Plus Cardmember using two vouchers in the same booking. Q: Ive booked in Club World and seats in First have opened up. Can I rebook in First? A: Yes. You will need to call BA to do this, and the standard BA change fee of £35 will apply along with the Avios difference between cabins. Q: I booked two regular redemption seats in Club World. Can I retrospectively apply the voucher to my booking and get half the Avios back? A: No. You will need to cancel and rebook, as you need to apply the voucher at the time of booking. As per standard redemption procedures, there is no guarantee the seats will be re-released for you to book, so cancellation is at your own risk. Q: Ive read lots of stories that those travelling on 2-4-1 vouchers are prioritised for downgrades. Should I be worried? A: Downgrades are very infrequent and while there are stories of this happening, you shouldnt worry that this will happen to you. BA have a number of strategies for overbooking situations and the likelihood of your flight being overbooked, let alone you receiving a downgrade or being denied boarding, is very low. Q: Can I use a Lloyds Upgrade Voucher in conjunction with my 2-4-1? A: No. The two vouchers are mutually exclusive. Q: What is the best strategy to use the voucher and get the flights I want? A: Flexibility. Being open to arrival airport, dates, and booking as far in advance as possible will all help your chances of booking the trip you want. Travelling midweek and during school term time will also lend itself to more availability. Q: Can I make a 2-4-1 booking before the voucher expires, but actually fly after the voucher's expiry date? A: Sort of. In short, you must book and fly the outbound leg before the expiry date. Your return leg(s) can take place after the voucher's expiry date passes. Q: Do I have to return during the lifetime of the voucher? A: Although your outbound journey must be completed before the voucher expires, you are free to return any time afterwards (within the limit of the validity of the ticket, which is normally one year from the date of outbound travel). Q: I have a joint card with someone else, but the voucher has been issued in their name instead of mine, even though I did most of the spending on the card. A: The voucher is issued in the name of the main Cardmember, regardless of who spends the most on the card. Q: My Companion can no longer travel with me. Can I amend the name of my Companion on my 2-4-1 booking? A: No. You will need to cancel the booking in its entirety, wait for the voucher and Avios to re-appear in your account, and create a new booking using the new Companion's details. There is no guarantee that the previous redemption seats you were booked into will reappear in the inventory, so this is at your own risk. Q: I am a member of a Household Account. What are the rules around my companion travelling with me when this is the case? A: The voucher terms state that, where you (as the Cardmember who earned the 2-4-1 voucher) are already part of a BA Household Account, the cardmember who travels with you must also be a member of the same Household Account. This is because Members of a Household Account cannot redeem their Avios for anyone outside the Household Account (members of the Family and Friends List are within the Household Account for these purposes). If this is problematic, there are a few ways to resolve this issue: A: Your spend will count towards the Premium Plus target of £10,000. Q: If I upgrade my Amex from the free to the Premium Plus card after earning a \"Basic\" voucher, is my voucher upgraded? A: No. You can only earn one voucher per card year. If you have had a basic voucher issued already, it won't be swapped for anything and you'll have to wait until your next card year. Q: I've earned my voucher on the Premium Plus card. If I subsequently downgrade the card, does it retain its two-year validity? A: Yes. At the point the voucher appears in your BAEC account, the validity and expiry date will not change. Q: I've upgraded / downgraded my card. How do I know what terms apply to my vouchers? A: The voucher name in the Executive Club account can be used to understand this: A: Yes. If you are holding multiple Legacy vouchers earned using a Premium Plus card or multiple Revised vouchers (earned using any card), you can use two vouchers to book for four people travelling together (including yourself), paying the Avios for two people and the taxes, fees and charges for four. If you want to book this on ba.com, you must check for availability for four passengers. Q: I have my premium voucher, can I downgrade to the free card and still keep it? A. Yes. But the agents on the phone or chat will often say you can't downgrade until your card year end. If they do, use this link to downgrade instead. https://www.americanexpress.com/en-g...rds/ba-classic As of 23/OCT/2024 a pro-rata refund of fees is also applied. Questions? This Wiki answers most commonly asked questions about the Voucher, but is not by any means an exhaustive list. Do post in the thread if you have any other questions or queries. Related topics Community experiences using companion vouchers ENDS Summary The British Airways American Express Companion Voucher entitles you to receive a second seat for a companion on the same flight as you and in the same cabin when you make a reward booking on a British Airways mainline flight with a BA prefixed flight number (but not on flights operated by franchisee, codeshare or alliance airlines). All youll have to pay is the taxes, fees and charges for you and your companions tickets. From July 2022 (for vouchers earned after 1 September 2021) a solo traveller can use a voucher to save 50% of the Avios required for a redemption. The voucher is easy and straightforward to use. You as the cardholder may book a redemption ticket, paid for entirely in Avios, and you take a travel companion with you at no additional Avios cost. The usual taxes, fees and surcharges apply to both passengers, which must be paid for by the card holder. New terms apply to vouchers earned after 1 September 2021. The notes below are marked \"Legacy\" and \"Revised\" to indicate where they differ. Some significant changes: - The term \"Classic\" is no longer applied to the free AmEx card, so the phrase \"free\" is used below to differentiate from the Premium Plus card. - Vouchers earned using a free card can only be used for redemptions in Economy. - The spend trigger to earn a voucher changed for the free card from £20k to £12k (£15,000 from November 1st 2024) Standard Voucher Terms and Conditions (see https://www.britishairways.com/en-gb...amex-companion) - The voucher is valid for travel on BA operated flights with BA prefix only - [Legacy Vouchers Only] Valid towards return flights only, with the journey originating from and returning to your country of membership (with the exception of vouchers issued in the UK which may also be used for one-way travel) - Taxes, fees and surcharges apply to both the companion and the travelling Cardmember. The card holder will pay the cash supplement assessed for themselves and all others in the booking, using the credit card associated with the voucher - For Cardmembers who have multiple Legacy Premium Plus vouchers or multiple Revised (free or Premium Plus) vouchers in their account, combining two of the same type (Legacy or Revised) of voucher within a single booking is permitted, subject to redemption availability. This allows the travelling Cardmember to take three travel companions, paying the Avios price for two passengers. Taxes, fees and charges must be paid for all four passengers. A maximum of two vouchers can be used towards any single booking - The Cardmember can travel without the companion, however the companion cannot travel without the Cardmember - The Cardmember cannot cancel the companions ticket to get the companion voucher back and still fly. In order to get the voucher back, the whole booking must be cancelled and re-booked for yourself, provided there is redemption availability - Cancelling a redemption booking does not guarantee the seat(s) will be released back into the award inventory - If the booking is cancelled at least 24 hours before the first flight, the Avios, taxes and fees will be refunded, plus the companion voucher. Generally the voucher and Avios will be refunded quite quickly, with the monetary components taking a few days longer. A cancellation fee will apply unless you are a BAEC GGL card holder - Tickets booked by phone need to be booked at least 48 hours in advance - Cardmembers must have accrued the Target within a 12-month period ending each year on the anniversary of their Promotion Commencement Date. Spend from the previous anniversary year will not be carried over - Spend towards the Voucher must be charged to the account before the anniversary date. Any spend on the Card made before the anniversary date but not charged to the account until after the anniversary date will not be counted - Companion Vouchers cannot be used in conjunction with any other promotion (This is the formal line, but in reality it can be used with GUF2 and Jokers) - If you (as the Cardmember who earned the Companion Voucher) are part of a BA Household Account, then both you and your companion must be members of the Household Account, or be on the 'Friends and Family' list that is attached to it - One Companion Voucher per main Cardmember per year Frequently Asked Questions Q: What is the British Airways American Express Companion Voucher? A: The British Airways American Express Companion Voucher entitles you to receive a second seat for a companion on the same flight as you and in the same cabin when you make a reward booking on a British Airways mainline flight with a BA prefixed flight number (but not on flights operated by franchisee, codeshare or alliance airlines). All youll have to pay is the taxes, fees and charges for you and your companions tickets. A solo traveller can also use a Revised voucher to reduce the Avios component of a redemption by 50%. Q: How do I qualify for the British Airways American Express Companion Voucher? A: To qualify for your British Airways American Express Companion Voucher, you must reach the required spend threshold for your card, as shown below, within a 12-month period ending on the anniversary of the date of issue of your BA/AMEX Card. Please note that required spend does not include cash withdrawals, interest, balance transfers and fees. - Free: £12,000 (£15,000 from 1 November 2024) - Premium Plus: £10,000 (£15,000 from 1 November 2024) The increased spend requirement of £15,000 will come into effect on 1 November 2024 even if this is part-way through a membership year. Q: Ive hit my spend. When will the voucher show up? A: Once you hit the target, you will receive an email congratulating you on the award of your voucher. It will show up quite prominently on your BAEC account home page after logging in. American Express directly states once a Card Member qualifies, we compile a list of eligible Card Members (monthly) and send it to British Airways (can take 3-5 days). British Airways advises the Card Member of their e-voucher / Companion Ticket via mail within 10-15 days. The e-voucher / Companion Ticket shows online for a period of time to redeem, when the Card Member logs onto their Executive Club (Avios) account at ba.com. Q: Where can I see my voucher? A: Go to the BAEC website. At the top of the welcome page, it will appear under the heading \"My eVouchers\", looking like the image above. In addition, you can go to the eVouchers page, where you can see used and unused vouchers. Q: How long is the voucher valid for? A: When the voucher is earned on the BA Premium Plus American Express card, the voucher is valid for 24 months. When the voucher is earned the free BA American Express card, it is valid for 12 months. You must have booked and completed the whole of your outbound travel by the date the vouchers validity expires, and it cannot be extended under any circumstances. The longer validity of the Premium Plus voucher is often cited as a very good reason to pay the card fee (£250 as of July 2022). Q: How do I get the most value from my voucher? A: There is potential for you to save a substantial amount of Avios using the voucher, but its value to you is something only you can define. But in short, using the voucher for redemptions in First or Club World will maximise its value, as these naturally incur the highest redemption spend and will therefore save you the most Avios. Note that Revised vouchers earned using a free card only allow bookings in economy cabins. Q: Can I use the voucher and part-pay with Avios? A: The ticket itself must be paid for entirely with Avios. Taxes, surcharges and fees (the \"cash component\" of the ticket composed of these fees, which are charged on standard redemptions in any event) must be paid for using an American Express card, although not necessarily a British Airways one (this is stated in the Terms and Conditions, but any Amex works) Q: How do I pay the taxes, surcharges and fees? A: An American Express card must be used to settle the taxes, surcharges and fees for both passengers. The Terms and Conditions state you must use the same American Express card that the voucher was earned on to settle this payment, but in practice any American Express card can be used. You may not use a Visa, MasterCard or other payment form to settle these fees. Q: Can I book an open-jaw trip using the voucher? A: You can, but you will need to call BA. For the trip to be valid, the length of the surface sector must be shorter than either of the flown journeys. If you want to fly from LHR to AAA and from BBB back to LHR, then the LHR-AAA and BBB-LHR distances must both be greater than the distance between AAA and BBB. Q: Can I book my outbound flight at 355 days and call back to add the return booking? A: Yes, but you will need to call BA. Once availability shows, you can call to add the return leg the BA policy is to waive the £35 change fee per passenger if the return was beyond the booking window when you booked the outbound, i.e. that you booked your outbound leg when seats became available at T-355. For example: If you booked your outbound at T-355 and called later to add the return leg the change fee would be waived. If you booked your outbound at T-50 and then booked the return for T-60 a few days later, the fee will not be waived. Important update, posted by cbagent on 12 Feb 2018: If adding the return sector to an existing one-way Amex 241 where the inbound dates were out of range at time of booking, it is now possible to book the flights online as a new one way Avios booking then call BA UK office when open. Half of the Avios on this new booking will then be refunded to reflect Amex voucher use. The benefit of this is that there is no need to try calling open BA office in the early hours of the morning and the downside is the itinerary will be ticketed as two one way bookings. In addition the Avios balance must be high enough to take a debit of double the required Avios albeit for a relatively short time. May be of use for some people. Note: you are strongly advised not to use this new method of booking two separate one ways if going to the US/Canada. When booking as two separate bookings and having the 2-4-1 applied across both is that taxes/charges/fees are not recalculated when the voucher is applied across to the second booking. Sometimes this will work out well for you (bookings exHKG for example), but for exUS or exCA bookings it is not recommended at all since exUS/CA taxes/fees/charges are very high. As an example, using the two separate bookings method on a LHR-JFK booking in J or F for two people would cost you about £480 more that the old method of calling and adding the inbound to an existing booking. Please see post 965 here for more information. Important update, posted by DeathSlam on 8 Feb 2024: From 7th December 2022 it is now possible to use Amex 241 vouchers on Aer Lingus and Iberian flights. https://mediacentre.britishairways.c.../details/14362 Q: As redemption seats are released at midnight GMT, what is the best way to secure them? There is no guarantee they will be available when the BA office opens in the morning! A: Call a BA office that is open at midnight GMT. You will then be able to make the booking without waiting for your local office to open. Depending on timezone, Japan, Hong Kong and even the USA are frequently contacted for this purpose. Q: I made a one-way booking using a voucher and have already completed the travel on that booking. Can I now add an inbound flight to the booking to make use of the voucher? A: No. Q: Does cancelling my BA American Express card mean I will lose the voucher? Does downgrading my BA American Express Premium Plus card to the free card mean I will lose my voucher? A: No. Contrary to what American Express will tell you, you will keep the voucher if you cancel the card entirely, and similarly your voucher will retain its two year validity if you downgrade from the Premium Plus card to the free card. Remember though that you will need to pay the taxes and fees on an American Express card, so it may be worth asking to downgrade the Premium Plus to the free card for this purpose if you dont hold another Amex. Q: If I cancel my 2-4-1 booking, will I get the voucher back? A: Yes, the voucher will appear in your BAEC some time after cancellation along with your Avios. The voucher will retain the same expiry date. Q: If I cancel my BA Amex after making a 2-4-1 booking, and later cancel the booking, will I get the voucher back? A: Collective forum experience would lend us to believe that in this situation you would receive the voucher back, as the voucher is credited to your BAEC account and there would be no way for it to know that you had subsequently cancelled your card. The expiry date of the voucher will remain the same. Q: If I have already used a 2-4-1 voucher, can I still find out what its expiry date is? A: Yes. Log in to your BAEC account, and then go to the eVouchers page. This will list the details of all relevant vouchers. The details include the expiry date of each voucher, and for vouchers that have been used, the reference of the booking on which it has been used, so that you can see which voucher was used on which booking. Q: There is one redemption seat available on the route I want. If I use the voucher, will it book a second seat for me automatically? A: No. The voucher makes use of existing availability, so to book travel for two passengers there must be a minimum of two redemption seats available on the flight. Q: Availability on BA is really poor. Can I book a codeshare flight? A: No. The terms of the voucher state that the booking is restricted to BA metal. You should be able to secure availability at T-355 days, as BA release two Club World seats for all flights at this point. Q: Can I use a Gold Upgrade for Two voucher in conjunction with my voucher? A: Yes. You will need to call BA to make the booking. Q: Can I use a Joker in conjunction with my voucher? A: Yes. You will need to call BA to make the booking. Q: Can I fly mixed class bookings using the voucher? A: Yes, however all companions on the booking must fly the same cabin. This means you could fly First outbound and Club World inbound together using the voucher, but you cannot have one passenger in Club World and another in World Traveller Plus on the same leg of the booking. Q: Can I book myself on one flight and my companion on the next flight? A: No. You must fly on the same flights, in the same cabin. This also applies to all four passengers if the booking has been made by a Premium Plus Cardmember using two vouchers in the same booking. Q: Ive booked in Club World and seats in First have opened up. Can I rebook in First? A: Yes. You will need to call BA to do this, and the standard BA change fee of £35 will apply along with the Avios difference between cabins. Q: I booked two regular redemption seats in Club World. Can I retrospectively apply the voucher to my booking and get half the Avios back? A: No. You will need to cancel and rebook, as you need to apply the voucher at the time of booking. As per standard redemption procedures, there is no guarantee the seats will be re-released for you to book, so cancellation is at your own risk. Q: Ive read lots of stories that those travelling on 2-4-1 vouchers are prioritised for downgrades. Should I be worried? A: Downgrades are very infrequent and while there are stories of this happening, you shouldnt worry that this will happen to you. BA have a number of strategies for overbooking situations and the likelihood of your flight being overbooked, let alone you receiving a downgrade or being denied boarding, is very low. Q: Can I use a Lloyds Upgrade Voucher in conjunction with my 2-4-1? A: No. The two vouchers are mutually exclusive. Q: What is the best strategy to use the voucher and get the flights I want? A: Flexibility. Being open to arrival airport, dates, and booking as far in advance as possible will all help your chances of booking the trip you want. Travelling midweek and during school term time will also lend itself to more availability. Q: Can I make a 2-4-1 booking before the voucher expires, but actually fly after the voucher's expiry date? A: Sort of. In short, you must book and fly the outbound leg before the expiry date. Your return leg(s) can take place after the voucher's expiry date passes. Q: Do I have to return during the lifetime of the voucher? A: Although your outbound journey must be completed before the voucher expires, you are free to return any time afterwards (within the limit of the validity of the ticket, which is normally one year from the date of outbound travel). Q: I have a joint card with someone else, but the voucher has been issued in their name instead of mine, even though I did most of the spending on the card. A: The voucher is issued in the name of the main Cardmember, regardless of who spends the most on the card. Q: My Companion can no longer travel with me. Can I amend the name of my Companion on my 2-4-1 booking? A: No. You will need to cancel the booking in its entirety, wait for the voucher and Avios to re-appear in your account, and create a new booking using the new Companion's details. There is no guarantee that the previous redemption seats you were booked into will reappear in the inventory, so this is at your own risk. Q: I am a member of a Household Account. What are the rules around my companion travelling with me when this is the case? A: The voucher terms state that, where you (as the Cardmember who earned the 2-4-1 voucher) are already part of a BA Household Account, the cardmember who travels with you must also be a member of the same Household Account. This is because Members of a Household Account cannot redeem their Avios for anyone outside the Household Account (members of the Family and Friends List are within the Household Account for these purposes). If this is problematic, there are a few ways to resolve this issue: - Add your companion to your Household Account. It should be noted that Household Accounts can have a maximum of seven members at any one time, and can only be changed every six months. Your companion must also live at the same address as you for this to be an option. - Add your companion to your Household Account's Family and Friends List. Once you have a Household Account, you can create a list of family and friends, so you can spend your Avios on people outside the group and, most importantly, on people who do not share the same address as you. You can nominate up to five people on your Family and Friends List, and you can access your Family and Friends list after you have logged into your online Executive Club account at ba.com. From here you can easily add individuals to your list simply follow the on-screen instructions. - You withdraw from your Household Account. You may wish to note that Household Accounts can only be changed every six months. A: Your spend will count towards the Premium Plus target of £10,000. Q: If I upgrade my Amex from the free to the Premium Plus card after earning a \"Basic\" voucher, is my voucher upgraded? A: No. You can only earn one voucher per card year. If you have had a basic voucher issued already, it won't be swapped for anything and you'll have to wait until your next card year. Q: I've earned my voucher on the Premium Plus card. If I subsequently downgrade the card, does it retain its two-year validity? A: Yes. At the point the voucher appears in your BAEC account, the validity and expiry date will not change. Q: I've upgraded / downgraded my card. How do I know what terms apply to my vouchers? A: The voucher name in the Executive Club account can be used to understand this: - BA American Express Companion Voucher: Issued before 1 September 2021 (termed Legacy in this Wiki) - BA American Express Credit Card Companion Voucher: Issued after 1 September 2021 (termed Revised in this Wiki) for spend on a Classic / free card. Can only be used for economy cabins. - BA American Express Premium Plus Companion Voucher: Issued after 1 September 2021 (termed Revised in this Wiki) for spend on a Premium Plus card. Can be used for all cabins. A: Yes. If you are holding multiple Legacy vouchers earned using a Premium Plus card or multiple Revised vouchers (earned using any card), you can use two vouchers to book for four people travelling together (including yourself), paying the Avios for two people and the taxes, fees and charges for four. If you want to book this on ba.com, you must check for availability for four passengers. Q: I have my premium voucher, can I downgrade to the free card and still keep it? A. Yes. But the agents on the phone or chat will often say you can't downgrade until your card year end. If they do, use this link to downgrade instead. https://www.americanexpress.com/en-g...rds/ba-classic As of 23/OCT/2024 a pro-rata refund of fees is also applied. Questions? This Wiki answers most commonly asked questions about the Voucher, but is not by any means an exhaustive list. Do post in the thread if you have any other questions or queries. Related topics Community experiences using companion vouchers ENDS BA American Express Companion Voucher | Master Thread #1 Original Poster Moderator: The British Airways Club Join Date: Nov 2010 Location: TPA/ABZ Programs: British Airways Gold Guest List for Life Posts: 14,216 BA American Express Companion Voucher | Master Thread This is the 2025 edition covering everying related to the British Airways Companion Voucher (2-4-1). For reference, the previous thread covering this topic for the period 2015-2024 can be found here: https://www.flyertalk.com/forum/brit...er-thread.html For reference, the previous thread covering this topic for the period 2015-2024 can be found here: https://www.flyertalk.com/forum/brit...er-thread.html #2 Join Date: Aug 2015 Posts: 1,537 Happy New Year all. I'll get us started off. I read somewhere that BA are now extending voucher validity in some very specific cases, e.g. medical inability to travel. Does anyone know what the policy is/where it has been published? I read somewhere that BA are now extending voucher validity in some very specific cases, e.g. medical inability to travel. Does anyone know what the policy is/where it has been published? Last edited by Virazuno; Jan 1, 2025 at 1:12 am #3 Join Date: Jan 2005 Location: UK Programs: Mucci. And BA Silver previous awards - Gold 13, Silver 7, Bronze 4. Posts: 7,531 PS Just seen GGLwannabee’s post #5 below. So there clearly is a policy and (again IIRC) there have been the odd cases over my 20+ years on FT, where some discretion has been applied to cases slightly outside this policy. Last edited by BA or bust; Jan 2, 2025 at 9:54 am #5 Join Date: May 2014 Programs: BA GGL, Gold for Life Posts: 692 \"27. Companion Vouchers may be extended subject to the terms of this clause 27.Extension requests for Companion Vouchers will be evaluated on a case by case basis and will be subject to relevant documentation having been provided by the Cardmember. Each case will be decided at British Airways sole discretion and British Airways decision will be final. Extensions for the use of Companion Vouchers for up to three mo"
}