{
  "url": "https://de.m.wikipedia.org/wiki/Republik_China_(Taiwan)",
  "title": "Republik China (Taiwan) – Wikipedia",
  "text": "Republik China (Taiwan) Die Republik China (chinesisch 中華民國, Pinyin Zhōnghuá Mínguó, IPA (hochchinesisch) ), weithin bekannt als Taiwan (臺灣 oder 台灣, Táiwān), in der Schweiz und in Österreich amtlich Taiwan (Chinesisches Taipei)[5][6][7][8][9] bzw. Republik China auf Taiwan[8] genannt, ist ein im Zuge der Ein-China-Politik nur von wenigen Staaten diplomatisch anerkannter Inselstaat in Ostasien. Sein Territorium besteht aus der Hauptinsel Taiwan (99 %) und anderen, kleineren Inseln.[8] Der technisch hochentwickelte Industriestaat, aus dem deutlich mehr als die Hälfte aller weltweit hergestellten Halbleiter-Bauteile kommen, hat eine Bevölkerung von rund 23,5 Millionen Menschen.[10][11] Die Republik China wurde nach der Xinhai-Revolution auf dem chinesischen Festland am 1. Januar 1912 in Nanking ausgerufen. Die Insel Taiwan, von 1683 bis 1895 unter chinesischer Herrschaft und von 1895 bis 1945 unter Herrschaft des japanischen Kaiserreichs, fiel erst mit Ende des Zweiten Weltkriegs an die Republik China. 1949 – nach der Niederlage im Bürgerkrieg gegen die Kommunistische Partei und der Gründung der Volksrepublik China auf dem Festland – zogen sich die Regierung, Eliten und Streitkräfte der Republik China auf die Insel Taiwan zurück. Dort etablierte die von Chiang Kai-shek geführte Staatspartei Kuomintang unter Beibehaltung des Ausnahmezustands eine mehrere Jahrzehnte andauernde Einparteienherrschaft. Die zweite Hälfte des 20. Jahrhunderts war von hohem Wirtschaftswachstum gekennzeichnet, gegen Ende der 1980er Jahre initiierte die Kuomintang eine schrittweise Demokratisierung. In mehreren Skalen der Demokratiemessung ist die Republik China (Taiwan) heute neben Japan und Südkorea einer der demokratischsten Staaten Asiens, vergleichbar mit Deutschland und der Schweiz.[12] Auch nach der Ausrufung der Volksrepublik China 1949 vertrat die Regierung der Republik China den chinesischen Staat zunächst bei den Vereinten Nationen und war ständiges Mitglied des UN-Sicherheitsrats. Als Folge der Ein-China-Politik der Volksrepublik brachen aber immer mehr Staaten ihre diplomatischen Beziehungen zur Republik China ab, die 1971 mit der UN-Resolution 2758 auch ihre UN-Mitgliedschaft an die Volksrepublik abgeben musste. 1979 brachen schließlich auch die USA die diplomatischen Kontakte ab, nachdem sie offizielle Beziehungen zur Volksrepublik aufgenommen hatten (Taiwan Relations Act). Nur eine Minderheit der Staatengemeinschaft unterhält heute formal diplomatische Beziehungen mit der Regierung in Taipeh. Die völkerrechtliche Stellung der Republik China ist umstritten und Gegenstand des Taiwan-Konflikts. Landesbezeichnung [Bearbeiten | Quelltext bearbeiten]Die amtliche Eigenbezeichnung lautet nach 1949 weiterhin Republik China, dennoch ist sowohl innerhalb als auch außerhalb des Landes die Bezeichnung Taiwan üblich, wobei dies mit zunehmender Betonung der taiwanischen Eigenständigkeit einhergeht.[13][14] Staatliche Stellen verwenden in an internationales Publikum gerichteten Texten inzwischen ebenfalls den Namen Taiwan und Hilfskonstruktionen wie Republik China auf Taiwan oder Republik China (Taiwan), um dieser Entwicklung gerecht zu werden.[9] Auch tragen hergestellte Artikel Bezeichnungen wie „Made in Taiwan, R.O.C.“ (R.O.C. = Republic of China) oder „Made in Taiwan“. Der ungelöste Taiwan-Konflikt erschwert der Republik China den Beitritt zu internationalen Organisationen und die Teilnahme an internationalen Veranstaltungen, unabhängig davon, ob Republik China oder Taiwan als Landesbezeichnung benutzt wird. In den letzten Jahrzehnten sind daher weitere Bezeichnungen entstanden, um diese Probleme zu umgehen. Verbreitung erlangte insbesondere Chinesisch-Taipeh, unter der die Republik China 1979 dem Internationalen Olympischen Komitee beitrat und an Olympischen Spielen teilnimmt. Weitere internationale Organisationen, vor allem – aber nicht nur – im Bereich Sport, haben diese Regelung übernommen. Bürger Taiwans sind Taiwaner. Ähnlich geläufig ist die Bezeichnung Taiwanesen. Entsprechend werden Angelegenheiten, die Taiwan betreffen, als taiwanisch oder taiwanesisch bezeichnet.[15] Geographie [Bearbeiten | Quelltext bearbeiten]Staatsgebiet [Bearbeiten | Quelltext bearbeiten]Das Verwaltungsgebiet der Republik China umfasst seit 1949 eine Gesamtfläche von 36.179 km², was etwa der Größe Baden-Württembergs entspricht. Den Hauptteil stellt die Insel Taiwan im westlichen Pazifik mit einer Fläche von 35.801 km². Weitere Gebiete sind: - die Inselgruppe der Pescadoren (Penghu), - die Matsu-Inseln, - die Insel Quemoy (Kinmen) mit den Inseln Großqiu und Kleinqiu sowie - einige weitere kleine Inseln. Angrenzende bzw. berührte Hoheitsgebiete sind im Norden und Osten Japan (Ryūkyū-Inseln), im Westen die Volksrepublik China, im Süden die Philippinen. Die Insel Taiwan [Bearbeiten | Quelltext bearbeiten]Die Insel Taiwan gliedert sich in zwei Großlandschaften: - Der westliche Teil entlang der Küste (etwa ein Viertel des Landes) ist Tiefland. Diese Küstenebene ist zwischen 8 und 40 km breit. - Drei Viertel der Landesfläche nehmen im Zentrum und im Osten des Landes drei annähernd parallel verlaufende bewaldete Hochgebirgszüge vulkanischen Ursprungs mit bis zu fast 4.000 m Höhe ein (62 Gipfel sind über 3.000 m hoch); im Südwesten reichen Gebirgsausläufer bis an das Südchinesische Meer heran. Bevölkerung [Bearbeiten | Quelltext bearbeiten]Demografie [Bearbeiten | Quelltext bearbeiten]Taiwans Bevölkerung wuchs von 1950 bis 2015 rasant von 7 auf 23 Millionen an und damit prozentual gesehen deutlich stärker als in der Volksrepublik China. Inzwischen liegt die Einwohnerwachstumsrate aber nur noch bei 0,2 % jährlich. Das mediane Alter der Bevölkerung Taiwans betrug 2016 40,2 Jahre. 13 % der Bevölkerung waren unter 15 Jahre alt und 13 % der Bevölkerung über 65 Jahre alt. Die Geburtenrate war 2016 mit 1,12 Kindern pro Frau eine der niedrigsten der Welt (Vergleichszahlen für andere asiatische Länder im Jahr 2015: Hongkong 1,20, Südkorea 1,24, Singapur 1,24, Japan 1,46).[16] Taiwan hatte damit eine niedrigere Geburtenrate als die Volksrepublik China, obwohl es nie eine Ein-Kind-Politik eingeführt hatte. Taiwan ist deshalb eine der am schnellsten alternden Gesellschaften der Welt. Bis 2050 könnte das Durchschnittsalter auf 56 Jahre steigen, was eine große Herausforderung für Renten- und Gesundheitssysteme darstellen dürfte.[17] Zukünftige Entwicklung der Bevölkerung, demografischer Wandel [Bearbeiten | Quelltext bearbeiten]Das nationale statistische Amt Taiwans prognostizierte 2016, dass die Sterberate die Geburtenrate ab 2021 bis 2025 übertreffen würde, so dass danach die Bevölkerung abnehmen werde, sofern keine größere Netto-Einwanderung erfolgt. Um diese Zeit werde die Bevölkerung Taiwans mit 23,7 bis 23,8 Millionen ein Maximum erreichen. Die Bevölkerungsprognosen für das Jahr 2060 bewegen sich zwischen 17,3 und 19,7 Millionen, also etwa so viele Einwohner, wie Taiwan Anfang der 1980er Jahre hatte. Die Bevölkerung im Erwerbsalter (15–64 Jahre) wird nach diesen Prognosen zwischen 2022 und 2060 von 17,2 Millionen auf 9,6 Millionen sinken und die Zahl der Rentner (> 64 Jahre) von 3,2 Millionen auf 7,2 Millionen steigen.[16] Quelle: UN, Zahlen für 2030 und 2050 sind Prognosen[18] Einwanderung nach Taiwan [Bearbeiten | Quelltext bearbeiten]Obwohl Taiwan historisch betrachtet ein ausgesprochenes Einwanderungsland ist – etwa 98 Prozent der heute dort lebenden Bevölkerung sind Nachkommen von Einwanderern, die in den letzten 350 Jahren auf die Insel gekommen sind –, verfolgte die Republik China seit 1949 lange Zeit eine relativ restriktive Einwanderungspolitik. Es gab kaum eine nennenswerte Einwanderung aus anderen asiatischen Ländern nach Taiwan. Nach der Demokratisierung Anfang der 1990er Jahre nahm die Immigration nach Taiwan allmählich zu. Im Zeitraum zwischen 1992 und 2015 stieg die Zahl der in Taiwan lebenden Personen mit nicht-taiwanischer Staatsbürgerschaft von etwa 44.400 (ca. 0,2 % der Gesamtbevölkerung) auf 637.800 (ca. 2,8 %).[19] Angesichts der absehbaren demografischen Veränderungen wird in Regierungskreisen seit einigen Jahren laut über eine direkte Förderung qualifizierter Einwanderung nachgedacht.[20] Die Regierung der 2016 neu ins Amt gewählten Präsidentin Tsai Ing-wen legte den Plan der „Neuen Politik der Südausrichtung“ (New Southbound Policy) vor, der die Beziehungen zu 18 südostasiatischen Staaten, darunter die ASEAN-Staaten, Australien, Neuseeland und Indien, intensivieren soll. Dieser Plan sieht auch einen verstärkten Austausch von Personen, konkret eine erleichterte Immigration nach Taiwan aus diesen Staaten vor. Weitere Regierungsprogramme sehen die erleichterte Erteilung von Daueraufenthaltsgenehmigungen für ausländische Fachkräfte, die erleichterte Einbürgerung von ausländischen Ehefrauen, die Beibehaltung der bisherigen Staatsbürgerschaft bei der Einbürgerung von Hochqualifizierten und andere Maßnahmen vor.[21][22][23] Kommentatoren wiesen allerdings darauf hin, dass die gesamte taiwanische Gesellschaft bei einer Einwanderung in größerem Stil mit umfassenden Änderungen und bisher nicht gekannten Phänomenen konfrontiert würde.[24] Tierkreiszeichen und Geburtenrate [Bearbeiten | Quelltext bearbeiten]Die Tierkreiszeichen (Erdzweige) des chinesischen Kalenders, die sich in einem 12-Jahres-Zyklus wiederholen, haben traditionell einen Einfluss auf die Geburtenrate. In den Jahren des Drachens (u. a. 1976, 1988, 2000, 2012), eines verheißungsvollen Tierkreiszeichens, war die Geburtenrate immer besonders hoch, da Personen, die in einem Drachenjahr geboren wurden, traditionell erstrebenswerte Charaktereigenschaften und Fortüne zugeschrieben wurden (Glück, Macht, Intelligenz, Lebenskraft). Im Jahr 2012 wurden 229.481 Geburten in Taiwan gezählt – so viele wie seit 2003 nicht mehr, wobei allerdings auch Anreize der Regierung zur Steigerung der Geburtenrate eine Rolle gespielt haben können. In den Jahren des Tigers (u. a. 1986, 1998, 2010) war die Geburtenzahl dagegen tendenziell niedriger, da Personen, die in diesen Jahren geboren werden, zwar Mut und Tatkraft zugeschrieben wird, aber auch ein schwieriger Charakter. Die Geburtenzahl im Jahr 2010 lag in Taiwan mit 166.886 bei einem Allzeittief und war auch weltweit mit die niedrigste Rate.[25] Ethnien [Bearbeiten | Quelltext bearbeiten]In der heutigen Republik China leben ungefähr 23 Millionen Menschen, die sich mehrheitlich als Taiwaner bezeichnen und auch im Ausland so genannt werden. Die größte Bevölkerungsgruppe stellen mit 98 Prozent Menschen vorwiegend han-chinesischer Abstammung, die im Einzelnen in die Untergruppen der Hoklo (70 %), Hakka (14 %) und Waishengren (im Deutschen oft „Festlandchinesen“ genannt, 14 %) untergliedert werden. Bei den erstgenannten Gruppen handelt es sich um Nachkommen von Einwanderern, die vorwiegend zwischen dem 17. und dem 19. Jahrhundert vom chinesischen Festland nach Taiwan kamen und sich mit der Urbevölkerung teilweise vermischten. Bei den Waishengren handelt es sich um Menschen, die vorwiegend zwischen 1945 und 1949, vor allem jedoch 1949 im Gefolge der im Chinesischen Bürgerkrieg unterlegenen Kuomintang aus allen Teilen Chinas nach Taiwan übersiedelten, bzw. ihre Nachkommen. Neben diesen Gruppen mit Wurzeln auf dem chinesischen Festland leben vor allem in abgelegenen Regionen noch Angehörige der indigenen Völker Taiwans, sie machen heute etwa 2 % der Gesamtbevölkerung aus. Seit dem 17. Jahrhundert sind sie zwar in hohem Maß von der chinesischstämmigen Bevölkerungsmehrheit assimiliert worden, doch gibt es seit Mitte der 1990er Jahre Bestrebungen, die Kultur und die Sprachen der Ureinwohner zu bewahren. Als ethnische Minderheiten offiziell anerkannt sind die 16 Völker der Amis, Atayal, Bunun, Kavalan, Paiwan, Puyuma, Rukai, Saisiyat, Sakizaya, Tau, Thao, Tsou, Truku, die Sediq (seit 2008) sowie die Hla’alua und Kanakanavu (seit 2014).[26] Die Republik China weist mit etwa 651 Einwohnern pro Quadratkilometer (2022) nach Bangladesch die zweithöchste Einwohnerdichte aller Flächenstaaten der Welt auf. Auch infolge des hohen Gebirgsanteils Taiwans konzentriert sich die Bevölkerung in den westlichen Ebenen sowie im Norden der Insel um die Hauptstadt Taipeh. Entsprechend hoch ist dort die Verstädterungsrate mit einer zunehmenden Konzentration auf die Agglomeration von Taipeh. Weitere Siedlungsschwerpunkte finden sich um Taichung und Tainan entlang der Westküste bis zur südlichen Hafenstadt und zweitgrößten Metropole Kaohsiung. In Städten leben um die 75 Prozent der Bevölkerung. Sprachen und Schrift [Bearbeiten | Quelltext bearbeiten]Sprachen [Bearbeiten | Quelltext bearbeiten]Nach der Übernahme der Insel Taiwan durch die Republik China im Jahr 1945 wurde Hochchinesisch (die Standardvarietät des Mandarin) alleinige Amtssprache. Zuvor, unter japanischer Herrschaft, war dies das Japanische gewesen. Die Mehrheit der alteingesessenen Bevölkerung sprach allerdings Taiwanisch, eine Variante des südlichen Min (Min Nan). Daneben gab es Minderheiten von Hakka-Sprechern und die austronesischen Ureinwohner-Sprachen (Formosa-Sprachen). Durch die Unterdrückung der taiwanesischen Sprachen zugunsten des Mandarins von Seiten der Kuomintang[27] und den Zustrom von Millionen Zuwanderern vom chinesischen Festland am Ende des chinesischen Bürgerkriegs wurde das Hochchinesische rasch zur Sprache sämtlicher Amtsgeschäfte und zur lingua franca Taiwans. Dieser Trend hin zum Hochchinesischen hat sich bis in die Gegenwart fortgesetzt. Andere chinesische Sprachen wie Kantonesisch, die mit festlandchinesischen Flüchtlingen nach Taiwan kamen, sind nahezu verschwunden. Die anderen genannten Sprachen wurden zunächst staatlicherseits nicht gefördert und aus dem Bildungssystem ausgegrenzt. Dies änderte sich erst allmählich nach der Demokratisierung und im Zuge einer Lokalisierungsbewegung, die Ende der 1980er einsetzten. Die Regionalsprachen erhielten zunehmend Möglichkeiten, sich im öffentlichen Raum zu entfalten. Die Anerkennung und Förderung der Vielsprachigkeit Taiwans war insbesondere ein Anliegen der seit 2016 amtierenden DPP-Regierung unter Präsidentin Tsai Ing-wen. Das am 14. Juni 2017 in Kraft getretene Gesetz zur Entwicklung der indigenen Sprachen garantiert den Sprachen der 16 offiziell anerkannten indigenen Völker Taiwans eine besondere staatliche Förderung.[28] Auch Hakka ist eine besonders geförderte Sprache der Republik.[29] Premierminister Lai Ching-te erklärte am 27. August 2018, dass 2019 Englisch eine Amtssprache Taiwans werden solle. Begründet wurde dies mit der dann besseren internationalen Vernetzung Taiwans.[30][31] Obwohl Meinungsumfragen zeigten, dass ein großer Teil der Bevölkerung in allen politischen Lagern diesen Plan prinzipiell unterstützte, kam es nicht dazu. Dafür waren wesentlich auch Kostengesichtspunkte verantwortlich (sämtliche staatlichen Dokumente müssten übersetzt werden). Stattdessen formulierte die Regierung das Ziel, Taiwan bis zum Jahr 2030 nach dem Vorbild Singapurs in eine vollständig bilinguale Gesellschaft (Mandarin/Englisch) zu transformieren. Zu diesem Zweck sollte vor allem der Englischunterricht ausgebaut werden.[32] In der Eisenbahn, den Hochgeschwindigkeitszügen sowie in den U-Bahnen Metro Taipei und MRT Kaohsiung werden die Stationen auf Hochchinesisch, Taiwanisch, Hakka und Englisch angesagt. Exakte Aussagen zur Frage, wie viele Personen eine bestimmte Sprache als Muttersprache sprechen, sind nicht möglich, da die taiwanische Statistikbehörde bei ihren Erhebungen danach fragt, welche Sprachen zu Hause gesprochen werden. Als Antwort können mehrere Sprachen angegeben werden, was die große Mehrheit der Befragten auch nutzt. Die Muttersprache wird bei dieser Befragung nicht explizit gekennzeichnet. Die Erhebung aus dem Jahr 2010 ergab folgende Zahlen: Hochchinesisch 83,5 %, Taiwanisch 81,9 %, Hakka 6,6 %, indigene Sprachen 1,1 %, andere 2,0 %.[33] Hochchinesisch wird von der großen Mehrheit zumindest als Zweitsprache gesprochen. Schriftsysteme [Bearbeiten | Quelltext bearbeiten]Anders als in der Volksrepublik China werden in Taiwan weiterhin die traditionellen chinesischen Schriftzeichen, die Langzeichen, verwendet. Für die lateinische Umschrift der chinesischen Zeichen sind verschiedene Systeme in Gebrauch. Seit 2009 wird Hanyu Pinyin, die offizielle Umschrift in der Volksrepublik China, auch in der Republik China zur Umschrift von Ortsnamen verwendet, mit Ausnahme der Namen der regierungsunmittelbaren Städte, Landkreise und kreisfreien Städte, für die weiterhin die international gebräuchlichen Umschriften (meist Wade-Giles) verwendet werden. Daneben wird noch Tongyong Pinyin, die bis 2008 offizielle Umschrift, benutzt. Da auch noch Umschriften nach Wade-Giles in Gebrauch sind, erscheinen viele Ortsnamen auf Karten und Wegweisern in verschiedenen zum Teil deutlich voneinander abweichenden lateinischen Schreibweisen. Die Sprachen der Ureinwohner Taiwans gehören der austronesischen Sprachfamilie an. Sie wurden zum Teil von Missionaren mit dem lateinischen Alphabet verschriftet. - Hochchinesisch - Minnan - Hakka - Austronesische Sprachen Religion [Bearbeiten | Quelltext bearbeiten]Die verbreitetste Religion Taiwans ist der chinesische Volksglaube mit einem Anteil von etwa 43,8 % (Stand 2020) an der Gesamtbevölkerung Taiwans. Mit einberechnet ist hier eine kleine Minderheit der Anhänger des Konfuzianismus. Insgesamt gilt die Religions- und Glaubensfreiheit in Taiwan als außerordentlich hoch. Im Freedom of Thoughts Report der IHEU von 2018 z. B. teilte sich Taiwan gemeinsam mit den Niederlanden und Belgien Platz 1 aller untersuchten Länder weltweit. Buddhismus und Daoismus [Bearbeiten | Quelltext bearbeiten]Die „klassischen“ Religionen mit den meisten Anhängern sind Buddhismus (21,2 %) und Daoismus (< 15,5 %), die jeweils Elemente der anderen Religion übernehmen, sodass die Trennlinie zwischen ihnen fließend ist. Christentum [Bearbeiten | Quelltext bearbeiten]Der Anteil der Christen an der Gesamtbevölkerung Taiwans betrug laut einer Volkszählung im Jahr 2005 3,9 %.[34] Neuere Schätzungen geben Anteile von mehr als 4 %[35] bzw. mehr als 5 % an.[36] Die größte Gruppe innerhalb der Christen stellen die Presbyterianer mit einem Drittel dar, gefolgt von 15 % Katholiken und der juhuisuo (聚會所).[37] Die Ureinwohner haben in den vergangenen Jahrzehnten größtenteils den christlichen Glauben angenommen, der Katholiken, Protestanten, neuapostolische Christen und Mormonen einschließt. Erste Missionierungen erfolgten im 17. Jahrhundert durch Niederländer und Spanier. Islam [Bearbeiten | Quelltext bearbeiten]Seit dem 17. Jahrhundert existieren auch Muslime auf Taiwan. Momentan leben über 210.000 Muslime in der Republik China. Das entspricht etwa 0,3 % der Einwohner. Zu ihnen zählen etwa 60.000 einheimische Muslime (etwa 90 % von ihnen Hui) sowie über 150.000 eingewanderte Muslime, vor allem aus Indonesien (ca. 110.000) und anderen südostasiatischen Ländern, darunter Malaysia, Thailand und die Philippinen.[38][39] Judentum [Bearbeiten | Quelltext bearbeiten]Seit der Mitte des 20. Jahrhunderts gibt es auf Taiwan auch eine jüdische Gemeinde. Im Jahr 2021 lebten etwa 1000 Juden auf Taiwan.[40] Religionen der Ureinwohner [Bearbeiten | Quelltext bearbeiten]Die Ureinwohner sind seit etwa 1960 überwiegend christianisiert. Innerhalb vieler katholischer Gemeinden gibt es jedoch nach wie vor männliche und weibliche Schamanen, die ihre traditionellen Praktiken ausführen. Insbesondere bei unheilbaren Krankheiten, Schuldgefühlen gegenüber Verstorbenen, schweren Familienkrisen oder Verlusten werden sie konsultiert. Einige der Schamanen bezeichnen sich durchaus als Katholiken; sie verbinden die Vorstellungen in synkretistischer Weise.[41] Geschichte [Bearbeiten | Quelltext bearbeiten]Nach dem Ende des Pazifikkrieges 1945 kapitulierte Japan auf Generalbefehl Nr. 1 des Oberkommandierenden der Alliierten Mächte, Douglas MacArthur, vor dem Generalissimus Chiang Kai-shek. Dabei wurde die Insel Taiwan (damals: Formosa) nach fünfzig Jahren japanischer Kolonialherrschaft an die Republik China übergeben. Kurz darauf brach auf dem chinesischen Festland der Bürgerkrieg zwischen der Kuomintang und den Kommunisten erneut aus. Nach der Niederlage Chiang Kai-sheks zogen sich die Regierung und die Armee der Republik China auf die Insel Taiwan zurück, wodurch Taiwan und einige kleinere Inseln anderer Provinzen zum alleinigen Herrschaftsgebiet der Republik China wurden. Die Kommunisten gründeten auf dem Festland die Volksrepublik China. Die Republik China wurde, in Abgrenzung zur Volksrepublik, auch Nationalchina oder National-China genannt. Nach den traumatischen Ereignissen mit der Niederlage gegen die Kommunisten auf dem chinesischen Festland herrschte bei der nationalchinesischen Regierung eine fast paranoide Furcht vor kommunistischen Umsturzversuchen auf der als einzigem Territorium verbliebenen Insel Taiwan. Jegliche oppositionelle Regungen wurden rigoros unterdrückt. Ab dem 20. Mai 1949 bestand ein landesweiter Ausnahmezustand.[42] Die Kuomintang sah sich als einzig legitimierte Regierung ganz Chinas und wollte nur Wahlen der Bürger ganz Chinas akzeptieren. Daher wurden die Neuwahlen des Parlaments unbefristet ausgesetzt. Die bei der letzten gesamtchinesischen Wahl 1948 gewählten Abgeordneten sollten ihre Mandate bis zur Vereinigung Chinas unter der Verfassung der Republik China behalten. Da die Abgeordneten dieses 1948 gewählten Parlaments (der Nationalversammlung) ganz überwiegend der Kuomintang angehörten oder diese unterstützten, bedeutete dies die quasi-Einparteienherrschaft der KMT. Das Frauenwahlrecht wurde 1953 eingeführt.[43] Ab 1971 wurden sogenannte Ergänzungswahlen zugelassen, durch die die mittlerweile verstorbenen Mitglieder des Parlaments nachbesetzt wurden. Gegen Ende der 1980er Jahre begann in Taiwan unter der Kuomintang-Regierung eine Demokratisierung. Die seit 1948 geltenden Notstandsklauseln wurden aus der Verfassung entfernt und neue Parteien neben der Kuomintang zugelassen. Am 14. Juli 1987 wurde auch der seit 1949 ununterbrochen geltende Ausnahmezustand offiziell beendet.[42][44] 1992 wurde die Verfassung nach einer freien Parlamentswahl geändert und die Direktwahl statt der bisherigen indirekten Wahl des Präsidenten eingeführt. 1996 fand die erste direkte Präsidentschaftswahl statt, die der seit 1988 amtierende Präsident Lee Teng-hui von der Kuomintang gewann. Bis Oktober 1971 gehörte die Republik China (auf Taiwan) als einziger Nachfolgestaat der ehemaligen, zwischen 1911 und 1949 bestehenden Republik China den Vereinten Nationen an. Mit der Resolution 2758 der UN-Generalversammlung vom 25. Oktober 1971 verlor sie diese Stellung an die Volksrepublik China. Seitdem wird die Republik China international nur noch von wenigen Staaten anerkannt. Viele Taiwaner wünschen sich eine stabile internationale Stellung. Die Regierung der Volksrepublik China jedoch betrachtet Taiwan als eine „abtrünnige Provinz“[45] und droht eine militärische „Rückgewinnung“ der Insel an, falls Taiwan sich für unabhängig erklären sollte (siehe Anti-Abspaltungsgesetz), obwohl Taiwan noch nie unter der Herrschaft der Volksrepublik China stand. Die meisten westlichen Regierungen halten einerseits an der Ein-China-Politik fest und ächten andererseits jede militärische Drohung. Die USA erließen 1979 ein Gesetz (Taiwan Relations Act), durch das sie einerseits die diplomatischen Kontakte zu Taiwan abbrachen, sich aber zugleich verpflichten, Taiwan Hilfe gegen jede militärische Bedrohung zu leisten. Das schließt nicht notwendigerweise eine militärische Intervention der USA ein – gemeint ist vor allem der Verkauf von Waffen mit Defensivcharakter an Taiwan. Des Weiteren existieren die Sechs Zusicherungen der USA an Taiwan von 1982. Im März 2018 unterzeichnete US-Präsident Donald Trump eine vom Kongress verabschiedete Vorlage, die Reisen hochrangiger US-Vertreter nach Taiwan und Besuche aus Taiwan auf allen Ebenen ausdrücklich unterstützt.[46] US-Präsident Joe Biden bezeichnete es im Oktober 2021 als Verpflichtung der USA, Taiwan bei einem Angriff durch die Volksrepublik China militärisch zu verteidigen; das Weiße Haus stellte daraufhin klar, dass diese Aussage keine Abkehr von der bisherigen, auf dem Taiwan Relations Act basierenden Position bedeute.[47] Eine ähnliche Klarstellung des Weißen Hauses war bereits im August auf eine ähnliche Äußerung Bidens hin erfolgt, die neben Taiwan auch Japan und Südkorea betraf.[48] Die Präsidentschaftswahlen 2000 und 2004 gewann die Demokratische Fortschrittspartei (DPP). Die Regierung unter dem von 2000 bis 2008 amtierenden Präsidenten Chen Shui-bian hatte in Wahlprogrammen die Ausarbeitung einer neuen Verfassung versprochen, was die Abschaffung der alten republikanischen Verfassung bedeuten würde, in der zum Beispiel der Name „Republik China“ sowie die Staatsgrenze festgeschrieben waren. Unter internationalem, vor allem US-amerikanischem Druck verzichtete die Regierung darauf, diese Passage anzutasten, und Chen Shui-bian proklamierte die Politik der fünf Neins. Trotzdem wurde der Wiedervereinigungsrat aufgelöst, was zu heftigen Drohungen seitens der Volksrepublik China führte. Die Parlamentswahlen in den Jahren 2008 und 2012 wurden durch die Kuomintang gewonnen, deren Kandidat Ma Ying-jeou auch die Präsidentschaftswahl im Jahr 2008 und im Jahr 2012 gewann, wodurch dieser Konflikt zunächst entschärft wurde. Am 7. November 2015 trafen sich der Präsident Ma Ying-jeou und der Präsident der Volksrepublik Xi Jinping in Singapur. Bei diesem symbolischen Treffen wurden weder Verträge noch gemeinsame Erklärungen unterzeichnet.[49][50] Bei der taiwanischen Präsidentenwahl sowie der Parlamentswahl im Januar 2016 siegte die Oppositionspartei DPP. Neben der gewählten Präsidentin Tsai Ing-wen stellte sie zum ersten Mal in der Geschichte auch die Mehrheit im Parlament. Bei der Wahl des Legislativ-Yuans 2020 und der Präsidentenwahl konnte die DPP ihren Erfolg von 2016 wiederholen und Präsidentin Tsai wurde wiedergewählt. 2024 siegte der DPP-Kandidat Lai bei der Präsidentenwahl, jedoch verlor die DPP ihre Parlamentsmehrheit. Politik [Bearbeiten | Quelltext bearbeiten]Überblick [Bearbeiten | Quelltext bearbeiten]Die Republik China ist seit der Überwindung der Einparteienherrschaft in den 1990ern eine Demokratie, und der Präsident sowie die Abgeordneten des Einkammer-Parlaments werden seit den 1990er-Jahren in freien, gleichen und geheimen Wahlen gewählt. Die taiwanische Demokratie hat aus Sicht einiger westlicher Beobachter über die Grenzen Taiwans hinausreichende Bedeutung insofern, als Taiwan als Modell für eine zukünftige Demokratisierung der Volksrepublik China gesehen wird, da in unmittelbarer Nähe zur autoritär regierten Volksrepublik das Modell einer pluralistisch-demokratischen chinesischen Gesellschaft exerziert werde.[51][52][53] Im Demokratieindex 2022 belegt Taiwan Platz 10 von 167 Ländern und Territorien,[54] womit es in diesem Ranking der mit Abstand bestplatzierte Staat Asiens ist und unter anderem vor Deutschland und Österreich liegt. Auch in den Freiheitsindex-Länderlisten 2017 und 2018 der US-amerikanischen Nichtregierungsorganisation Freedom House erhielt Taiwan Punktwerte von 91 bzw. 93 und damit bessere Werte als traditionell demokratisch verfasste Staaten wie die USA, Frankreich oder Italien. Vor der Demokratisierung war die 1947 noch gesamtchinesisch gebildete Nationalversammlung im Amt. Mit der Begründung, dass gesamtchinesische Neuwahlen nicht möglich waren, und um den gesamtchinesischen Vertretungsanspruch nicht aufzugeben, wurde ihre ursprünglich auf sieben Jahre angelegte Amtszeit auf unbestimmte Zeit verlängert, was ihr auch die Bezeichnung „Langes Parlament“ einbrachte. Bis 1992 regierte die Kuomintang, die die Nationalversammlung kontrollierte, praktisch als alleinige Partei. Im Zuge der Demokratisierung gab die Nationalversammlung ihre Kompetenzen schrittweise an den 1992 erstmals frei gewählten Legislativ-Yuan ab, bis sie sich 2005 endgültig auflöste. Die heutige Parteienlandschaft der Republik China ist hauptsächlich von zwei politischen Blöcken geprägt: der pan-grünen Koalition (chinesisch 泛綠聯盟 / 泛绿联盟, Pinyin Fànlǜ liánméng), bestehend aus der Demokratischen Fortschrittspartei (DPP), der Taiwanischen Solidaritätsunion (TSU) und der kleineren Taiwan-Unabhängigkeitspartei (TAIP), und der pan-blauen Koalition (chinesisch 泛藍聯盟 / 泛蓝联盟, Pinyin Fànlán Liánméng), bestehend aus der Kuomintang (KMT), der Qinmindang („Volksnahen Partei“, PFP) und der kleineren Xindang („Neue Partei“, CNP). Dabei stammen die farblichen Bezeichnungen von den Parteiflaggen der beiden großen Volksparteien DPP und KMT. Im Verhältnis zur Volksrepublik China strebt das grüne Lager derzeit (2024) mehrheitlich die Bewahrung der faktischen Unabhängigkeit Taiwans als Republik China an,[55] während das blaue Lager zwar ebenfalls die Beibehaltung des Status quo befürwortet, langfristig jedoch eine Wiedervereinigung Chinas unter demokratischen Voraussetzungen anstrebt. Eine formelle Unabhängigkeit Taiwans durch Änderung der Verfassung und des Staatsnamens wird von der Taiwanischen Unabhängigkeitsbewegung, einer Minderheit im grünen Lager, gefordert.[56] Bis zum Jahr 1992 wählte die Nationalversammlung den Staatspräsidenten. Im Jahr 1994 erfolgte eine Verfassungsänderung, die die Direktwahl des Präsidenten einführte, was erstmals im Jahr 1996 erfolgte. Von 2000 bis 2008 regierte mit Chen Shui-bian (DPP) der erste Präsident, der nicht der Kuomintang angehörte. Die Wahl zum Legislativ-Yuan 2008 und die Präsidentschaftswahl am 22. März 2008 brachten die Kuomintang zurück an die Macht. Präsident war seit dem 20. Mai 2008 Ma Ying-jeou. Die Kuomintang konnte die politische Macht bei den Wahlen zum Legislativ-Yuan 2012 und bei der Präsidentschaftswahl am 14. Januar 2012 behaupten. Mas zweite Amtsperiode war von zunehmender Unzufriedenheit der Bevölkerung gekennzeichnet, die sich unter anderem in der Besetzung des Parlaments während der Sonnenblumen-Bewegung im Frühjahr 2014 und Niederlagen der KMT bei den Kommunalwahlen am 29. November desselben Jahres äußerte. Nach dem deutlichen Sieg der Oppositionspartei DPP und ihrer Spitzenkandidatin Tsai Ing-wen bei der Parlamentswahl und bei der Präsidentschaftswahl am 14. Januar 2016 erfolgte ein erneuter Machtwechsel. Bei der darauffolgenden Präsidentschaftswahl am 11. Januar 2020 wurde Präsidentin Tsai im Amt bestätigt. Ihre Partei, die DPP verlor bei der zeitgleich abgehaltenen Parlamentswahl an Stimmen, konnte aber die absolute Mandatsmehrheit behaupten. Regierungssystem [Bearbeiten | Quelltext bearbeiten]Verfassung [Bearbeiten | Quelltext bearbeiten]Die Verfassung der Republik China basiert auf den politischen Lehren Sun Yat-sens („Drei Prinzipien des Volkes“) und wurde noch 1946 auf dem Festland entwickelt. Sie trat am 25. Dezember 1947 in Kraft und verlangt eine Teilung in fünf Gewalten, die von je einem Yuan (Staatsrat) ausgeübt werden: Legislative, Exekutive, Judikative, Prüfung und Kontrolle. Bis zu ihrer Auflösung 2005 hatte die Nationalversammlung das alleinige Recht, Verfassungsänderungen vorzunehmen. Seitdem müssen vom Parlament gebilligte Verfassungsänderungen in Referenden mit über 50 Prozent der wahlberechtigten Stimmen bestätigt werden. Staatsoberhaupt ist der auf vier Jahre direkt gewählte Staatspräsident, der ebenfalls Oberbefehlshaber der Streitkräfte ist und nur einmal wiedergewählt werden darf. Yuans (Staatsräte) [Bearbeiten | Quelltext bearbeiten]Die Verfassung von 1947 sieht – abweichend von der Dreiteilung nach westlichem Muster (Exekutive, Legislative, Judikative) – eine fünffache Gewaltenteilung vor: Der Exekutiv-Yuan ist die Regierung beziehungsweise das Kabinett der Republik China, dessen Vorsitz der Premierminister ausübt. Er wird vom Staatspräsidenten im Einvernehmen mit dem Legislativ-Yuan ernannt. Der Legislativ-Yuan besteht seit 2008 aus 113 Abgeordneten und ist das Parlament Taiwans, das mit der Gesetzgebungskompetenz ausgestattet ist und die Arbeit des Exekutiv-Yuans überwacht. Der Justiz-Yuan besteht aus 15 Richtern und ist die höchste gerichtliche Instanz des Staates. Er bildet außerdem das Verfassungsgericht des Landes. Der Prüfungs-Yuan ist für die Beamtenauswahl verantwortlich. Der Kontroll-Yuan nimmt die Funktion vergleichbar einem Rechnungshof wahr und kann Disziplinarverfahren gegen Beamte durchführen. Außenpolitik [Bearbeiten | Quelltext bearbeiten]Verhältnis zur Volksrepublik China [Bearbeiten | Quelltext bearbeiten]Zur Zeit der Kuomintang-Diktatur galt nach dem Chinesischen Bürgerkrieg die Sichtweise, dass sich Festlandchina durch die Gründung der Volksrepublik China 1949 „abgespalten“ habe. Der Alleinvertretungsanspruch für China wird von der Regierung der Republik China jedoch seit der Demokratisierung des Landes nicht mehr verfolgt. Aus Sicht der Volksrepublik ist Taiwan eine abtrünnige Provinz. Am 14. März 2005 verabschiedete der Nationale Volkskongress der Volksrepublik China fast einstimmig das Anti-Abspaltungsgesetz, das militärische Schritte gegen Taiwan vorsieht, sollte dieses sich formell unabhängig erklären. Die pan-grüne Koalition, darunter die Demokratische Fortschrittspartei (DPP), die zwischen 2000 und 2008 den Präsidenten und die Regierung stellte, strebt die Anerkennung Taiwans als Staat an. Eine formelle Unabhängigkeitserklärung ist hingegen aus Sicht der DPP nicht nötig, da es sich bei Taiwan bereits um einen souveränen Staat unter dem Namen „Republik China“ handele.[58] Als Versprechen den USA gegenüber und zur Beruhigung der Volksrepublik China definierte der von 2000 bis 2008 amtierende Präsident Chen Shui-bian die Politik der fünf Neins (chinesisch 四不一沒有, Pinyin sì bù yī méi yǒu, englisch four nos and one without – „vier Nein und ein Ohne“). Solange Taiwan nicht akut militärisch von China bedroht werde, werde die Republik China: - nicht die Unabhängigkeit erklären, - nicht den Namen des Staates ändern, - keinen Artikel in die Verfassung aufnehmen, der die Beziehungen zur Volksrepublik als „zwischenstaatliche Beziehungen“ bezeichnet, - kein Referendum über die Änderung des Status quo in der Frage Unabhängigkeit oder Wiedervereinigung abhalten, - die bestehenden taiwanischen Richtlinien für die „Nationale Wiedervereinigung“ nicht ändern (sprich: Wiedervereinigung nur durch Verhandlungen mit der Volksrepublik China und unter demokratischen Voraussetzungen auf dem chinesischen Festland). Diese Erklärung gab im Wesentlichen auch die taiwanische Haltung seit Beginn der Amtszeit Präsident Ma Ying-jeous (Kuomintang) wieder, ohne jedoch gesetzlich verankert zu sein. Ungeachtet aller Streitfragen ist die Republik China de facto völlig unabhängig und verfügt über die volle Souveränität über Taiwan. Verhältnis zu Japan [Bearbeiten | Quelltext bearbeiten]Taiwan befand sich zwischen 1895 und 1945 unter japanischer Kolonialherrschaft. Kulturelle Einflüsse der japanischen Zeit haben sich bis ins 21. Jahrhundert erhalten.[59] Nach der Niederlage der Kuomintang im Chinesischen Bürgerkrieg 1949 erkannte Japan die Republik China auf Taiwan bis 1972 als einzige legitime Regierung Gesamtchinas an. Nach der Anerkennung der Volksrepublik China durch Japan wurden die Beziehungen zu Taiwan auf der inoffiziellen Ebene weitergeführt und de facto ist Japan heute neben den Vereinigten Staaten der zweitwichtigste Verbündete Taiwans. Aufgrund der Nähe Taiwans zum japanischen Staatsgebiet ist der politische Status Taiwans von großer Bedeutung für die Sicherheit Japans. In der Vergangenheit hat Japan oft eine ambivalente Haltung hinsichtlich der Frage gezeigt, ob es die Insel bei einem vom chinesischen Festland kommenden militärischen Angriff verteidigen würde, ähnlich der Haltung der USA.[60] Mit den steigenden Spannungen in der Taiwanstraße hat Japan seine Verteidigungsbereitschaft erhöht und sich zunehmend klarer zugunsten Taiwans positioniert.[61][62] Internationale Anerkennung [Bearbeiten | Quelltext bearbeiten]Geschichte [Bearbeiten | Quelltext bearbeiten]Bis 1971 stellte die Republik China, einst Gründungsmitglied der UNO, die alleinige chinesische Vertretung bei den Vereinten Nationen und hatte einen ständigen Sitz im Sicherheitsrat inne. 1971 verlor sie durch die Resolution 2758 der UN-Generalversammlung die Mitgliedschaft in den Vereinten Nationen an die Volksrepublik China. In der Folge nahmen die meisten Mitgliedsstaaten der UNO diplomatische Beziehungen zur Volksrepublik China auf und brachen im Gegenzug die Beziehungen zur Republik China ab. Das liegt hauptsächlich daran, dass jeder Staat, der bilaterale Beziehungen mit der VRC unterhalten will, deren Ein-China-Politik offiziell anerkennen muss. Sogar die Schutzmacht USA erkennt die Republik seit dem Taiwan Relations Act offiziell nicht mehr an[63] und handelt moderat in Angelegenheiten, die direkte Streitpunkte zwischen den beiden Kontrahenten sind, wie zum Beispiel Taiwans Beitritt als Beobachter in die Weltgesundheitsorganisation. Staaten, die die Republik China anerkennen [Bearbeiten | Quelltext bearbeiten]2024 pflegen folgende elf Staaten sowie der Heilige Stuhl[64] offizielle diplomatische Beziehungen mit der Republik China:[65] Heiliger Stuhl (1942) Haiti (1956) Paraguay (1957) Guatemala (1960) Eswatini (1968) Tuvalu (1979) St. Vincent und die Grenadinen (1981) St. Kitts und Nevis (1983) Belize (1989) Marshallinseln (1998) Palau (1999) St. Lucia (1984–1997, 2007)[65] Viele dieser Staaten liegen in Mittelamerika.[66] Trotz der Bemühungen der Republik China brachen im Laufe der Zeit immer mehr Staaten ihre Beziehungen zu Taipeh ab, wie in den letzten Jahren etwa Gambia (2013), São Tomé und Príncipe (2016), Panama (2017), die Dominikanische Republik (2018), Burkina Faso (2018), El Salvador (2018),[67] die Salomonen (2019),[68] Kiribati (2019), Nicaragua (2021)[69] oder Honduras (2023)[70][71] (siehe auch „Taiwan 2020er Jahre“). Am 15. Januar 2024 brach die Regierung Taiwans die diplomatischen Beziehungen zu Nauru ab, nachdem dieses angekündigt hatte diplomatische Beziehungen zur Volksrepublik China aufzunehmen.[72][73] Andere Formen des Kontakts mit der Republik China [Bearbeiten | Quelltext bearbeiten]Andere Staaten unterhalten keine diplomatischen Beziehungen, trotzdem wird der Kontakt durch inoffizielle Vertretungen, sogenannte Taipei Wirtschafts- und Kulturbüros, aufrechterhalten, ohne diesen Einrichtungen den Status einer Botschaft zuzuordnen. Im Jahr 2023 bestanden solche Vertretungen in 61 Staaten,[74] darunter den USA, Kanada, Russland, den meisten Staaten der Europäischen Union und in der Schweiz.[75] Seit 2025 ist Gu Ruey-sheng Repräsentant der taiwanischen Vertretung in der Bundesrepublik Deutschland. Im November 2021 eröffnete in der litauischen Hauptstadt Vilnius ein „Vertretungsbüro Taiwan“, was erheblichen diplomatischen und wirtschaftlichen Druck Chinas auf Litauen und die EU zur Folge hatte, unter anderem, dass der litauische Botschafter Peking verlassen musste, in China tätige in- und ausländische Firmen nicht mehr für Litauen tätig werden durften und für Litauen bestimmte und bereits bezahlte Waren nicht mehr aus China herausgelassen wurden.[76] Außerdem reisen vermehrt auch hochrangige Politiker oder gar Regierungsmitglieder westlicher Staaten nach Taiwan. So reiste Nancy Pelosi als Sprecherin des US-Repräsentantenhauses am 2. August 2022 als höchstrangige Vertreterin der Vereinigten Staaten von Amerika seit 25 Jahren nach Taiwan.[77] China betrachtete Pelosis Reise als Einmischung in den Taiwan-Konflikt, was vom Staatsrat der Volksrepublik China bereits im Vorfeld verurteilt worden war und eine große chinesische Militärübung zur Abriegelung der Republik China nach sich zog.[78] Mit Bundesbildungs- und Forschungsministerin Bettina Stark-Watzinger reiste am 21. März 2023 auch erstmals seit 26 Jahren wieder ein deutsches Regierungsmitglied nach Taiwan.[79] Das chinesische Außenministerium verurteilte den zweitägigen Besuch, bei dem unter anderem auch ein Technologie"
}