{
  "url": "https://www.polet.network/publications",
  "title": "Publications — POLET",
  "text": "Search for a keyword, phrase or title Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe Marta Vetier, Vadim Vinichenko, Jessica Jewell, Anastasia Pavlenko and Aleh Cherp (pre-print). Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe. POLET Working Paper series 2025-1 Marta Vetier, Vadim Vinichenko, Jessica Jewell, Anastasia Pavlenko, and Aleh Cherp (pre-print) Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe. POLET Working Paper series 2025-1 ABSTRACT Accelerating mature low-carbon technologies is vital for sustainability transitions, yet little is known about how to measure, explain, or anticipate such acceleration. The S-curve theory assumes continuous acceleration up to an inflection point, followed by a steady slowdown. Using three decades of onshore wind data from 18 European countries, we challenge this idealised view. We identify turning points in deployment and propose metrics suited to both linear and non-linear growth. Acceleration typically stops once wind has reached about 2% (median, IQR 1-4%) of its capacity potential or 4% (2-6%) of electricity supply, much earlier than standard S-curve expectations. Thereafter, deployment enters a steady-growth phase – quasi-linear expansion of roughly 0.8 percentage points (p.p.) (0.6-1.0 p.p.) of electricity per year – punctuated by policy-driven growth pulses. These cruising speeds remain remarkably consistent across countries and over time, reflecting a stable balance between technical, economic, political, and socio-technical constraints. Responding to the 2022 energy crisis and rising climate concerns, recent policies aim to double the median cruising speed but without exceeding maximum historical speeds. Policy-driven acceleration of mature technologies is possible and should be interpreted in terms of sustaining fast growth for longer periods rather than continuously increasing the speed. Download the working paper: Vetier et al. 2025. Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe Major step up in carbon capture and storage needed to keep warming below 2 °C J. Jewell & T. Kazlou. (2024). Major step up in carbon capture and storage needed to keep warming below 2 °C. Nature Climate Change. DOI: https://doi.org/10.1038/s41558-024-02112-0 J. Jewell & T. Kazlou. (2024). Major step up in carbon capture and storage needed to keep warming below 2 °C. Nature Climate Change 1–2. DOI: https://doi.org/10.1038/s41558-024-02112-0 A feasibility analysis reveals that carbon capture and storage capacity might be able to expand fast enough to meet the requirements of 2 °C climate pathways but will unlikely meet those for 1.5 °C. Moreover, carbon capture and storage is unlikely to capture and store more than 600 Gt of CO2 over the twenty-first century, which has implications for the global carbon budget. Feasible deployment of carbon capture and storage and the requirements of climate targets T. Kazlou, A. Cherp & J. Jewell. (2024). Feasible deployment of carbon capture and storage and the requirements of climate targets. Nature Climate Change. Open Access. DOI: https://doi.org/10.1038/s41558-024-02104-0 T. Kazlou, A. Cherp & J. Jewell. (2024). Feasible deployment of carbon capture and storage and the requirements of climate targets. Nature Climate Change 1–9. Open Access. DOI: https://doi.org/10.1038/s41558-024-02104-0 Climate change mitigation requires the large-scale deployment of carbon capture and storage (CCS). Recent plans indicate an eight-fold increase in CCS capacity by 2030, yet the feasibility of CCS expansion is debated. Using historical growth of CCS and other policy-driven technologies, we show that if plans double between 2023 and 2025 and their failure rates decrease by half, CCS could reach 0.37 GtCO2 yr−1 by 2030—lower than most 1.5 °C pathways but higher than most 2 °C pathways. Staying on-track to 2 °C would require that in 2030–2040 CCS accelerates at least as fast as wind power did in the 2000s, and that after 2040, it grows faster than nuclear power did in the 1970s to 1980s. Only 10% of mitigation pathways meet these feasibility constraints, and virtually all of them depict <600 GtCO2 captured and stored by 2100. Relaxing the constraints by assuming no failures of CCS plans and growth as fast as flue-gas desulfurization would approximately double this amount. Carbon capture and storage is a key component of mitigation scenarios, yet its feasibility is debated. An analysis based on historical trends in policy-driven technologies, current plans and their failure rates shows that a number of 2 °C pathways are feasible, but most 1.5 °C pathways are not. Technology and policy co-evolution: the case of solar power in India 2010-2024 S. Bhowmik, A. Cherp, V. Vinichenko (pre-print). Technology and policy co-evolution: the case of solar power in India. POLET Working Paper series 2024-4 S.Bhowmik, A. Cherp, V.Vinichenko (pre-print). Technology and policy co-evolution: the case of solar power in India. POLET Working Paper series 2024-4 ABSTRACT India has consistently set ambitious renewable energy targets to meet rising electricity demand and reinforce its commitment to climate action. Achieving these targets relies heavily on the rapid and sustained adoption of solar technology, particularly utility-scale solar, which has historically driven most of the country’s solar growth. However, recent regional stagnation in expansion highlights the challenges of sustaining momentum and scaling adoption. We examine the role policies have played in driving solar technology growth in India. Drawing on literature on technology growth and policy mix, we examine what policies have evolved along the S-curve, both national and sub-nationally. We systematically identify the types of barriers that emerged as solar technology grew, and the policy mix that were used to address these challenges. We find that policy responses have become increasingly diverse, dynamically adapting over time to address new and shifting priorities at different phases of technology growth. These evolving priorities are also addressed with distinct sets of policy instruments. Furthermore, even as solar technology costs have declined, we observe that the number of policies has continued to grow, suggesting that cost reductions alone are insufficient to sustain growth. We also show how solar technology, policies, and politics have co-evolved in the case of utility-scale solar in India. We find that while changes in the policy mix can drive growth, they also reflect the challenge policymakers face in balancing multiple and at times conflicting priorities. Changes in the policy mix that revolves out of the need to navigate these competeing interests can introduce hidden costs that slow technology adoption, despite positive cost developments earlier. This analysis provides an overview of the co-evolution of technology and policy, underscoring the importance of integrating policy and political considerations when projecting technological growth. Our findings highlight that relying solely on cost-based assumptions can prove inadequate. Finally, we offer a perspective from a developing country context, where similar research has been limited, and where policymakers balance the complex task of meeting rising electricity demand, advancing electricity market liberalization, and renewable energy integration. Compensating affected parties necessary for rapid coal phase-out but expensive if extended to major emitters L. Nacke, V. Vinichenko, A. Cherp, A. Jakhmola & J. Jewell. (2024). Compensating affected parties necessary for rapid coal phase-out but expensive if extended to major emitters. Nature Communications. Open Access. DOI: https://doi.org/10.1038/s41467-024-47667-w L. Nacke, V. Vinichenko, A. Cherp, A. Jakhmola & J. Jewell. (2024). Compensating affected parties necessary for rapid coal phase-out but expensive if extended to major emitters. Nature Communications 15, 3742. Open Access. DOI: https://doi.org/10.1038/s41467-024-47667-w Coal power phase-out is critical for climate mitigation, yet it harms workers, companies, and coal-dependent regions. We ﬁnd that more than half of countries that pledge coal phase-out have “just transition” policies which compensate these actors. Compensation is larger in countries with more ambitious coal phase-out pledges and most commonly directed to national and regional governments or companies, with a small share going directly to workers. Globally, compensation amounts to over $200 billion (uncertainty 163-258), about half of which is funded through international schemes, mostly through Just Energy Transition Partnerships and the European Union Just Transition Fund. If similar transfers are extended to China and India to phase out coal in line with the Paris temperature targets, compensation ﬂows could become larger than current international climate financing. Our findings highlight that the socio-political acceptance of coal phase-out has a tangible economic component which should be factored into assessing the feasibility of achieving climate targets. Have climate policies accelerated energy transitions? Historical evolution of electricity mix in the G7 and the EU compared to net-zero targets M. Suzuki, J. Jewell & A. Cherp. (2023). Have climate policies accelerated energy transitions? Historical evolution of electricity mix in the G7 and the EU compared to net-zero targets. Energy Research & Social Science. Open Access. DOI: https://doi.org/10.1016/j.erss.2023.103281 M. Suzuki, J. Jewell & A. Cherp. (2023). Have climate policies accelerated energy transitions? Historical evolution of electricity mix in the G7 and the EU compared to net-zero targets. Energy Research & Social Science 106, 103281. Open Access. DOI: https://doi.org/10.1016/j.erss.2023.103281 Climate policies are often assumed to have significant impacts on the nature and speed of energy transitions. To investigate this hypothesis, we develop an approach to categorise, trace, and compare energy transitions across countries and time periods. We apply this approach to analyse electricity transitions in the G7 and the EU between 1960 and 2022, specifically examining whether and how climate policies altered the transitions beyond historical trends. Additionally, we conduct a feasibility analysis of the required transition in these countries by 2035 to keep the global temperature increase below 1.5°C. We find that climate policies have so far had limited impacts: while they may have influenced the choice of deployed technologies and the type of transitions, they have not accelerated the growth of low-carbon technologies or hastened the decline of fossil fuels. Instead, electricity transitions in the G7 and the EU have strongly correlated with the changes in electricity demand throughout the last six decades. In contrast, meeting the 1.5°C target requires unprecedented supply-centred transitions by 2035 where all G7 countries and the EU must expand low-carbon electricity five times faster and reduce fossil fuels two times faster on average compared to the rates in 2015–2020. This highlights the insufficiency of incremental changes and the need for a radically stronger effort to meet the climate target. Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe M. Vetier, A. Pavlenko, J. Jewell, A. Cherp, & V. Vinichenko (pre-print). Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe. POLET Working Paper series 2024-3 Vetier, M., Pavlenko, A., Jewell, J., Cherp, A. and V. Vinichenko (pre-print). Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe. POLET Working Paper series 2024-3 ABSTRACT Conflicts surrounding the expansion of wind power in Europe are increasing (Diógenes et al. 2020; Lundheim et al. 2022) which has hindered its growth in recent years (Pavlenko and Cherp 2023). However, in the near future, wind power needs to expand much more rapidly to meet the EU's climate and energy security goals (Vinichenko et al. 2023; Pavlenko and Cherp 2023). In fact, meeting the goals for renewable power of the Fit for 55 Package (EC 2021), REPowerEU (EC 2022d) and updated Renewable Energy Directive (EC 2023e) would require faster growth of onshore wind power across the EU compared to what has been observed not only in the EU but even in most individual countries (Vinichenko et al. 2023). In this paper, we seek to understand whether and how European countries plan to re-accelerate the recently stalling onshore wind power deployment considering the increasing conflicts surrounding this technology. We start with analyzing the current and historical growth patterns and maximum growth rates of onshore wind power in European countries and compare these to a similar analysis completed in 2021 (Cherp et al. 2021). We show that in most European countries (except Finland, Greece, the Netherlands, and Sweden), the growth of wind power is no longer accelerating or is even slowing down. Subsequently, we look into 17 countries’ recently updated National Energy and Climate Plans to identify their national targets for onshore wind power deployment and analyze whether and how these targets would change the historical growth trajectories. We find that eleven countries have set national targets to accelerate the historical growth of wind power, and five countries aim for growth that is faster than ever observed globally. This demonstrates the challenges for policies to overcome the inertia of socio-technical systems surrounding the deployment of wind power. To investigate whether and how such challenges were addressed historically, the paper reviews cases of re-acceleration of onshore wind power growth in the past. We identify five notable cases of past re-acceleration (Austria, Denmark, Poland, Portugal, and Spain) and show that these have mostly been due to major changes in the national policy environment. We find that historically stalling was induced by halting or significantly reducing subsidies, regulatory uncertainties, and the enaction of policies unfavorable to wind power growth, and re-acceleration was in most cases linked to the increasing of regulatory certainty, re-establishment or increasing of subsidies, and withdrawal of unfavorable policies. This is unlikely to guide the current situation. We then investigate policies proposed by the European Commission and find that these aim to address administrative, technical, and financial problems rather than social conflicts over land and other issues. Finally, we provide a detailed analysis of Sweden’s case of attempting but failing to overcome a recurring onshore wind siting deadlock. We conclude by pointing out that to meet the onshore wind targets, European countries will likely need to implement different policy measures than what they have applied in the past. Accelerating technology growth through policy interventions: the case of onshore wind in Germany L. Nacke, J. Jewell, A. Cherp, V. Vinichenko, S. Bhowmik, A. Jakhmola (pre-print) Accelerating technology growth through policy interventions. The case of onshore wind in Germany. POLET Working Paper 2024-2. L.Nacke, A.Cherp, J.Jewell (pre-print). Accelerating technology growth through policy interventions: the case of onshore wind in Germany. POLET Working Paper Series 24-3 ABSTRACT Climate change mitigation requires sustained and rapid growth of renewables such as wind and solar PV to decarbonise electricity systems. This is mirrored in recent policy commitments, such as the goal to triple global renewabels deployment, or national targets such as Germany’s ambition to triple the speed of renewables deployment. A natural question following from such targets is: How difficult (or easy) is it to achieve and sustain such rapid renewables growth – what type and strength of policy interventions are required? Through a combined analysis of technology growth models and policy interventions we show that the number and diversity of policy interventions increases with increased deployment of wind power in Germany. We also show that the financial compensation for new wind power has not been declining as fast as costs of wind power technology. This indicates that prolonged growth of mature low-carbon technologies may require increasing rather than decreasing policy effort in spite of technological innovation and cost decline. Accelerating energy transitions under security crises A. Pavlenko, A. Cherp (pre-print). Accelerating energy transitions under security crises. POLET Working paper series 2024-1 A. Pavlenko, A. Cherp (pre-print). Accelerating energy transitions under security crises. POLET Working paper series 24-1 ABSTRACT To mitigate climate change, transition to clean energy should proceed faster than in the last three decades. Can policies overcome economic, technological and social inertia to achieve the required acceleration, and if so, under what conditions? The 2022 REPowerEU plan is an excellent case to investigate these questions because it responds to a profound energy security threat (Russia’s invasion of Ukraine) in advanced economies that are already the global leaders in decarbonisation. Here we analyse to which extent REPowerEU and related policies aim to accelerate energy transitions, what has enabled the ambitious targets, and whether these are feasible. Considering policy-technology co-evolution involving multiple feedbacks and non-linear growth, we define policy-driven acceleration as a significant deviation of feasible policy goals from the S-curve of technology diffusion reflecting empirical trends, near-term projections and analogies. We show that REPowerEU sets unprecedented targets implying acceleration of all renewables and a radical deviation from the onshore wind growth trajectory. At the same time, REPowerEU is not an isolated crisis response, but a continuation of a policy shift that started around 2018 and included the European Green Deal (2019), the ‘Fit for 55’ package (2021), and related plans. Before 2018, policy targets extended historical trends and did not become more ambitious over time. Although motivated by climate concerns, they were only weakly linked to long-term climate goals but strongly shaped by technological uncertainties and economic costs. Energy security was seen as protection from short-term shocks through resilient infrastructure and did not directly shape the goals for renewables. In contrast, post-2018 policies decisively link the net-zero vision for 2050 and the 2030 renewable targets. In 2022, these climate-derived targets were securitised through directly linking them to energy independence from Russian oil and gas, now viewed as a long-term security concern. Both net-zero and energy independence goals were inspired by the declining costs of renewables and by the emerging technological opportunities of substituting fossil fuels in transport, industry and heating through low-carbon electrification. We analyse whether the new targets are feasible using the ‘inside’ and the ‘outside’ view of feasibility by Jewell and Cherp (2023). We argue that the main barriers for onshore wind are conflicting land uses, for offshore wind - uncertainties around the infrastructure and complementary technologies, and for solar power - grid integration. We show that the required growth of each renewable technology is similar to the growth of nuclear in Western Europe in the 1960s-1980s. The similarities between the two contexts, including the presence of an energy security crisis, give hope that the planned growth is feasible. However, the combined growth of solar and wind is entirely unprecedented, although on a smaller scale, a similarly fast growth of nuclear occurred in France and Sweden. Our findings indicate that policy-driven acceleration of energy transitions might be possible but requires a unique constellation of motivations and capacities. Historical analogies provide useful benchmarks for the attainable speed of transition, but more research is needed on the applicability of policy lessons across different low-carbon technologies. Historical diffusion of nuclear, wind and solar power in different national contexts: implications for climate mitigation pathways V. Vinichenko, J. Jewell, J. Jacobsson, A. Cherp. (2023). Historical diffusion of nuclear, wind and solar power in different national contexts: implications for climate mitigation pathways. Environmental Research Letters. Open Access. DOI: https://doi.org/10.1088/1748-9326/acf47a V. Vinichenko, J. Jewell, J. Jacobsson, A. Cherp. (2023). Historical diffusion of nuclear, wind and solar power in different national contexts: implications for climate mitigation pathways. Environmental Research Letters 18, 094066. Open Access. DOI: https://doi.org/10.1088/1748-9326/acf47a Climate change mitigation requires rapid expansion of low-carbon electricity but there is a disagreement on whether available technologies such as renewables and nuclear power can be scaled up sufficiently fast. Here we analyze the diffusion of nuclear (from the 1960s), as well as wind and solar (from the 1980–90s) power. We show that all these technologies have been adopted in most large economies except major energy exporters, but solar and wind have diffused across countries faster and wider than nuclear. After the initial adoption, the maximum annual growth for nuclear power has been 2.6% of national electricity supply (IQR 1.3%–6%), for wind − 1.1% (0.6%–1.7%), and for solar − 0.8% (0.5%–1.3%). The fastest growth of nuclear power occurred in Western Europe in the 1980s, a response by industrialized democracies to the energy supply crises of the 1970s. The European Union (EU), currently experiencing a similar energy supply shock, is planning to expand wind and solar at similarly fast rates. This illustrates that national contexts can impact the speed of technology diffusion at least as much as technology characteristics like cost, granularity, and complexity. In the Intergovernmental Panel on Climate Change mitigation pathways, renewables grow much faster than nuclear due to their lower projected costs, though empirical evidence does not show that the cost is the sole factor determining the speed of diffusion. We demonstrate that expanding low-carbon electricity in Asia in line with the 1.5 °C target requires growth of nuclear power even if renewables increase as fast as in the most ambitious EU's plans. 2 °C-consistent pathways in Asia are compatible with replicating China's nuclear power plans in the whole region, while simultaneously expanding renewables as fast as in the near-term projections for the EU. Our analysis demonstrates the usefulness of empirically-benchmarked feasibility spaces for future technology projections. Coal phase-out pledges follow peak coal: evidence from 60 years of growth and decline in coal power capacity worldwide O. M. Lægreid, A. Cherp, J. Jewell. (2023). Coal phase-out pledges follow peak coal: evidence from 60 years of growth and decline in coal power capacity worldwide. Oxford Open Energy. Open Access. DOI: https://doi.org/10.1093/ooenergy/oiad009 O. M. Lægreid, A. Cherp, J. Jewell. (2023). Coal phase-out pledges follow peak coal: evidence from 60 years of growth and decline in coal power capacity worldwide. Oxford Open Energy 2. Open Access. DOI: https://doi.org/10.1093/ooenergy/oiad009 Transitioning to net-zero carbon emissions requires phasing-out unabated coal power; however, recently it has only been declining in some countries, while it stagnated or even increased in others. Where and under what circumstances, has coal capacity reached its peak and begun to decline? We address this question with an empirical analysis of coal capacity in 56 countries, accounting for 99% of coal generation in the world. The peaks in national coal power have been equally spread per decade since 1970. The peaks are more likely to occur in country-years with high levels of electoral democracy, higher GDP per capita, slower electricity demand growth, and with low levels of political corruption. Normally, peaking coal power preceded rather than followed political coal phase-out pledges, often with long time lags. We conclude that though the cost of coal alternatives are declining and concerns over climate change increasing, coal power does not automatically peak even in situations with low demand growth, aging power plants and high import dependence. A quick and decisive destabilization of coal regimes requires, in addition, having sufficient economic capacities and strong democratic governance. The feasibility of climate action: Bridging the inside and the outside view through feasibility spaces J. Jewell & A. Cherp. (2023). The feasibility of climate action: Bridging the inside and the outside view through feasibility spaces. WIREs Climate Change. DOI: https://doi.org/https://doi.org/10.1002/wcc.838 J. Jewell & A. Cherp. (2023). The feasibility of climate action: Bridging the inside and the outside view through feasibility spaces. WIREs Climate Change. DOI: https://doi.org/https://doi.org/10.1002/wcc.838 The feasibility of different options to reduce the risks of climate change has engaged scholars for decades. Yet there is no agreement on how to define and assess feasibility. We define feasible as “do-able under realistic assumptions.” A sound feasibility assessment is based on causal reasoning; enables comparison of feasibility across climate options, contexts, and implementation levels; and reflexively considers the agency of its audience. Global climate scenarios are a good starting point for assessing the feasibility of climate options since they represent causal pathways, quantify implementation levels, and consider policy choices. Yet, scenario developers face difficulties to represent all relevant causalities, assess the realism of assumptions, assign likelihood to potential outcomes, and evaluate the agency of their users, which calls for external feasibility assessments. Existing approaches to feasibility assessment mirror the “inside” and the “outside” view coined by Kahneman and co-authors. The inside view considers climate change as a unique challenge and seeks to identify barriers that should be overcome by political choice, commitment, and skill. The outside view assesses feasibility through examining historical analogies (reference cases) to the given climate option. Recent studies seek to bridge the inside and the outside views through “feasibility spaces,” by identifying reference cases for a climate option, measuring their outcomes and relevant characteristics, and mapping them together with the expected outcomes and characteristics of the climate option. Feasibility spaces are a promising method to prioritize climate options, realistically assess the achievability of climate goals, and construct scenarios with empirically-grounded assumptions. Coal-exit alliance must confront freeriding sectors to propel Paris-aligned momentum S.L. Bi, N. Bauer & J. Jewell. (2023). Coal-exit alliance must confront freeriding sectors to propel Paris-aligned momentum. Nature Climate Change. DOI: https://doi.org/10.1038/s41558-022-01570-8 S.L. Bi, N. Bauer & J. Jewell. (2023). Coal-exit alliance must confront freeriding sectors to propel Paris-aligned momentum. Nature Climate Change 1-10. DOI: https://doi.org/10.1038/s41558-022-01570-8 The global phase-out of coal by mid-century is considered vital to the Paris Agreement to limit warming well-below 2 °C above pre-industrial levels. Since the inception of the Powering Past Coal Alliance (PPCA) at COP23, political ambitions to accelerate the decline of coal have mounted to become the foremost priority at COP26. However, mitigation research lacks the tools to assess whether this bottom-up momentum can self-propagate toward Paris alignment. Here, we introduce dynamic policy evaluation (DPE), an evidence-based approach for emulating real-world policy-making. Given empirical relationships established between energy-economic developments and policy adoption, we endogenize national political decision-making into the integrated assessment model REMIND via multistage feedback loops with a probabilistic coalition accession model. DPE finds global PPCA participation <5% likely against a current policies backdrop and, counterintuitively, foresees that intracoalition leakage risks may severely compromise sector-specific, demand-side action. DPE further enables policies to interact endogenously, demonstrated here by the PPCA’s path-dependence to COVID-19 recovery investments. Feasibility trade-offs in decarbonisation of power sector with high coal dependence: A case of Korea M. Hyun, A. Cherp, J. Jewell, Y. J. Kim & J. Eom. (2023). Feasibility trade-offs in decarbonisation of power sector with high coal dependence: A case of Korea. Renewable and Sustainable Energy Transition. Open Access. DOI: https://doi.org/10.1016/j.rset.2023.100050 M. Hyun, A. Cherp, J. Jewell, Y. J. Kim & J. Eom. (2023). Feasibility trade-offs in decarbonisation of power sector with high coal dependence: A case of Korea. Renewable and Sustainable Energy Transition, 3, 100050. Open Access. DOI: https://doi.org/10.1016/j.rset.2023.100050 Decarbonising the power sector requires feasible strategies for the rapid phase-out of fossil fuels and the expansion of low-carbon sources. This study assesses the feasibility of plausible decarbonisation scenarios for the power sector in the Republic of Korea through 2050 and 2060. Our power plant stock accounting model results show that achieving zero emissions from the power sector by the mid-century requires either an ambitious expansion of renewables backed by gas-fired generation equipped with carbon capture and storage or a significant increase of nuclear power. The first strategy implies replicating and maintaining for decades the maximum growth rates of solar power achieved in leading countries and becoming an early and ambitious adopter of the carbon capture and storage technology. The alternative expansion of nuclear power has historical precedents in Korea and other countries but may not be acceptable in the current political and regulatory environment. Hence, our analysis shows that the potential hurdles for decarbonisation in the power sector in Korea are formidable but manageable and should be overcome over the coming years, which gives hope to other similar countries. Phasing out coal for 2 °C target requires worldwide replication of most ambitious national plans despite security and fairness concerns V. Vinichenko, M. Vetier, J. Jewell, L. Nacke & A. Cherp. (2023). Phasing out coal for 2 °C target requires worldwide replication of most ambitious national plans despite security and fairness concerns. Environmental Research Letters. Open Access. DOI: https://doi.org/10.1088/1748-9326/acadf6 V. Vinichenko, M. Vetier, J. Jewell, L. Nacke & A. Cherp. (2023). Phasing out coal for 2 °C target requires worldwide replication of most ambitious national plans despite security and fairness concerns. Environmental Research Letters 18, 014031. Open Access. DOI: https://doi.org/10.1088/1748-9326/acadf6 Ending the use of unabated coal power is a key climate change mitigation measure. However, we do not know how fast it is feasible to phase-out coal on the global scale. Historical experience of individual countries indicates feasible coal phase-out rates, but can these be upscaled to the global level and accelerated by deliberate action? To answer this question, we analyse 72 national coal power phase-out pledges and show that these pledges have diffused to more challenging socio-economic contexts and now cover 17% of the global coal power fleet, but their impact on emissions (up to 4.8 Gt CO2 avoided by 2050) remains small compared to what is needed for achieving Paris climate targets. We also show that the ambition of pledges is similar across countries and broadly in line with historical precedents of coal power decline. While some pledges strengthen over time, up to 10% have been weakened by the energy crisis caused by the Russo-Ukrainian war. We construct scenarios of coal power decline based on empirically-grounded assumptions about future diffusion and ambition of coal phase-out policies. We show that under these assumptions unabated coal power generation in 2022–2050 would be between the median generation in 2 °C-consistent IPCC AR6 pathways and the third quartile in 2.5 °C-consistent pathways. More ambitious coal phase-out scenarios require much stronger effort in Asia than in OECD countries, which raises fairness and equity concerns. The majority of the 1.5 °C- and 2 °C-consistent IPCC pathways envision even more unequal distribution of effort and faster coal power decline in India and China than has ever been historically observed in individual countries or pledged by climate leaders. Pathway to a land-neutral expansion of Brazilian renewable fuel production L. R. Camargo, G. Castro, K. Gruber, J. Jewell & M. Klingler. (2022). Pathway to a land-neutral expansion of Brazilian renewable fuel production. Nature Communications. Open Access. DOI: https://doi.org/10.1038/s41467-022-30850-2 L. R. Camargo, G. Castro, K. Gruber, J. Jewell & M. Klingler. (2022). Pathway to a land-neutral expansion of Brazilian renewable fuel production. Nature Communications 13, 3157. Open Access. DOI: https://doi.org/10.1038/s41467-022-30850-2 Biofuels are currently the only available bulk renewable fuel. They have, however, limited expansion potential due to high land requirements and associated risks for biodiversity, food security, and land conflicts. We therefore propose to increase output from ethanol refineries in a land-neutral methanol pathway: surplus CO2-streams from fermentation are combined with H2 from renewably powered electrolysis to synthesize methanol. We illustrate this pathway with the Brazilian sugarcane ethanol industry using a spatio-temporal model. The fuel output of existing ethanol generation facilities can be increased by 43%–49% or ~100 TWh without using additional land. This amount is sufficient to cover projected growth in Brazilian biofuel demand in 2030. We identify a trade-off between renewable energy generation technologies: wind power requires the least amount of land whereas a mix of wind and solar costs the least. In the cheapest scenario, green methanol is competitive to fossil methanol at an average carbon price of 95 €/tCO2. Quitting fossil fuels: how fast can the world do it? J. Jewell, M. Vetier, V. Vinichenko, O.M. Lægreid, S. Pai, A. Cherp, H. Brauers, I. Braunger, L. Nacke, H. Zerriffi. (2022). Quitting fossil fuels: how fast can the world do it? Policy brief. J. Jewell, M. Vetier, V. Vinichenko, O.M. Lægreid, S. Pai, A. Cherp, H. Brauers, I. Braunger, L. Nacke, H. Zerriffi. (2022). Quitting fossil fuels: how fast can the world do it? Policy brief. To meet climate targets, fossil fuel use needs to rapidly decline. Has anything similar happened in the past? Do current coal phase-out efforts put us on the path to save the climate? And how would such radical fossil fuel decline affect fossil fuel workers? To answer these questions, we analyzed historical precedents of fossil fuel decline, current efforts to phase-out coal and future pathways to reach climate targets. We find surprising precedents of decline in the 1970s and 80s when industrialized wealthy economies responded to the oil crises. At the same time, the current pledges of coal phase-out are insufficient to deliver on the 1.5°C targets and are limited to countries with low costs and high enough capacity to overcome those costs. Nevertheless, in spite of the opposition from fossil fuel workers to transitions, we identify opportunities for low-carbon jobs to replace fossil fuel jobs. Phases of fossil fuel decline: Diagnostic framework for policy sequencing and feasible transition pathways in resource dependent regions L. Nacke, A. Cherp, J. Jewell. (2022). Phases of fossil fuel decline: Diagnostic framework for policy sequencing and feasible transition pathways in resource dependent regions. Oxford Open Energy. Open Access. DOI: https://doi.org/10.1093/ooenergy/oiac002 L. Nacke, A. Cherp, J. Jewell. (2022). Phases of fossil fuel decline: Diagnostic framework for policy sequencing and feasible transition pathways in resource dependent regions. Oxford Open Energy 1. Open Access. DOI: https://doi.org/10.1093/ooenergy/oiac002 Phasing out fossil fuels requires destabilizing incumbent regimes while protecting vulnerable groups negatively affected by fossil fuel decline. We argue that sequencing destabilization and just transition policies addresses three policy problems: phasing out fossil fuels, transforming affected industries, and ensuring socio-economic recovery in fossil resource-dependent regions. We identify the key mechanisms shaping the evolution of the three systems associated with these policy problems: (i) transformations of technological systems addressed by the socio-technical transitions literature, (ii) responses of firms and industries addressed by the management and business literature and (iii) regional strategies for socio-economic recovery addressed by the regional geography and economics literatures. We then draw on Elinor Ostrom’s approach to synthesize these different bodies of knowledge into a diagnostic tool that enables scholars to identify the phase of decline for each system, within which the nature and importance of different risks to sustained fossil fuel decline varies. The main risk in the first phase is lock-in or persistence of status quo. In the second phase, the main risk is backlash from affected companies and workers. In the third phase, the main risk is regional despondence. We illustrate our diagnostic tool with three empirical cases of phases of coal decline: South Africa (Phase 1), the USA (Phase 2) and the Netherlands (Phase 3). Our review contributes to developing effective policy sequencing for phasing out fossil fuels. Dynamic Evaluation of Policy Feasibility, Feedbacks and the Ambitions of COALitions S. Bi, N. Bauer, J. Jewell. (2021). Dynamic Evaluation of Policy Feasibility, Feedbacks and the Ambitions of COALitions. In Review. Research Square. PrePrint. S. Bi, N. Bauer, J. Jewell. (2021). Dynamic Evaluation of Policy Feasibility, Feedbacks and the Ambitions of COALitions. In Review. Research Square. PrePrint. The Paris Agreement prioritised international bottom-up climate negotiations. Meanwhile, research has asserted the coal exit as a prerequisite for Paris-consistent pathways. The Powering Past Coal Alliance (PPCA), an opt-in initiative toward phasing-out coal-fired electricity by mid-century, embodies both paradigms but currently encompasses just 5% of global coal demand. To assess its long-term prospects against Paris-consistent pathways, we couple the energy-economy model REMIND to an empirical coalition accession model and demonstrate a novel scenario analysis technique, Dynamic Policy Evaluation (DPE). Capturing co-evolutionary feedbacks between policy uptake and global energy markets, we simulate nationally-and-temporally-fragmented PPCA accession and analyse its sensitivity to coalition growth, sectoral ambition, and Covid-19-related uncertainty. Surprisingly, we find that virtually global PPCA participation achieves <3% of 1.5oC-consistent coal declines, as non-electric consumption remains unregulated. In contrast, our median-estimate scenario (82% accession) assuming economy wide coverage achieves ~53% eff"
}