{
  "url": "https://support.microsoft.com/en-us/surface/surface-pro-7-specs-and-features-8254894d-bb80-77ef-daae-612ea713e310",
  "title": "Surface Pro 7 specs and features - Microsoft Support",
  "text": "Surface Pro 7 specs and features Applies To Discover the latest Surface Pro Get tablet-to-laptop flexibility in one powerful PC. With AI-accelerated Copilot+ PC experiences and all-day battery life, Surface Pro is built to keep you on the go. Get to know Surface Pro 7 Surface Pro 7 is more powerful than ever and adapts to the way you work. Not sure where to plug something in or how to turn up the volume? We've got you covered. Here are a few diagrams to help you. - Volume - Power button - Headset and microphone jack - Windows Hello facial-recognition camera - Front-facing camera - Studio Mics (dual microphones) - USB-C port - USB-A port - Surface Connect port - microSDXC™ card reader Surface Pro 7 and Windows 10 Surface Pro 7 comes with: - Windows 10 Home edition (consumer customers) - Windows 10 Pro edition (commercial customers) If you have Windows 10 Home on your device, you can upgrade to Windows 10 Pro for an additional cost. For more info, see Upgrade Windows 10 Home to Windows 10 Pro. Not sure which version of Windows you have? See Which Windows operating system am I running? If you're not sure which Surface model you're using, see Which Surface model do I have? Note: You can upgrade your Surface Pro 7 to Windows 11. For more info, see Windows 11 System Requirements. Charging your Surface You can charge your Surface using USB-C or Surface Connect. For more information, see How to charge Surface. Surface Pro 7 features Work your way Transform Surface Pro 7 from a tablet to a laptop with the Kickstand and Surface Signature Type Cover. Use the USB-C and USB-A ports to connect to displays, docking stations, and your accessories. Next-gen power for your ideas Surface Pro 7 uses the 10th-generation Intel® Core™ processor with configuration options up to 16GB of RAM and 1TB of SSD. With Fast Charging, all-day battery, and Instant On, you can get back to work wherever you go. Express yourself Surface Pro 7 is available in Platinum and Matte Black, and you can get a Surface Pro Signature Type Cover in new colors. Music sounds crisp and clear with the Dolby Audio Premium sound. When you're on your next call or using voice dictation, take advantage of the dual-far-field Studio Mics. Do more with the Windows you know Enjoy familiar features like Windows Hello sign-in and Microsoft Edge. Get Microsoft 365 to create your best work and store it safely in OneDrive. Make it your own Learn more about the optional accessories that work with your Surface Pro 7. Get the most out of your Surface Learn more about your Surface and customize it with the Surface app. To open it, select Start , enter Surface, and select it to open the app. If the app doesn't open, get it from the Microsoft Store. Surface Pro 7 Tech specs * Some software and accessories sold separately. [1] Battery life Surface Pro 7: Up to 10.5 hours of battery life based on typical Surface device usage. Testing conducted by Microsoft in September 2019 using preproduction software and preproduction Intel® Core™ i5, 256GB, 8 GB RAM device. Testing consisted of full battery discharge with a mixture of active use and modern standby. The active use portion consists of (1) a web browsing test accessing 8 popular websites over multiple open tabs, (2) a productivity test utilizing Microsoft Word, PowerPoint, Excel and Outlook, and (3) a portion of time with the device in use with idle applications. All settings were default except screen brightness was set to 150nits with Auto-Brightness disabled. Wi-Fi was connected to a network. Battery life varies significantly with settings, usage and other factors.[2] Weight not including Type Cover. [3] System software uses significant storage space. Available storage is subject to change based on system software updates and apps usage. 1 GB = 1 billion bytes. 1 TB = 1,000 GB. See Surface.com/Storage for more details. [4] Available colors for accessories, Type Cover (sold separately), and Surface Pro 7 may vary by market and configuration. [5] Requires Microsoft 365 subscription. [6] Microsoft’s Limited Warranty is in addition to your consumer law rights."
}