{
  "url": "https://www.jurassicworld.com/synopsis/",
  "title": "Jurassic World Rebirth | Cast & Synopsis | Own it on Digital, 4K UDH and Blu-ray",
  "text": "Jurassic World Rebirth | Synopsis A new era is born. A new era is born. This summer, three years after the Jurassic World trilogy concluded with each film surpassing $1 billion at the global box office, the enduring Jurassic series evolves in an ingenious new direction with Jurassic World Rebirth. Anchored by iconic action superstar Scarlett Johansson, Emmy and SAG nominee Jonathan Bailey and two-time Oscar® winner Mahershala Ali, this action-packed new chapter sees an extraction team race to the most dangerous place on Earth, an island research facility for the original Jurassic Park, inhabited by the worst of the worst that were left behind. Also starring acclaimed international stars Rupert Friend and Manuel Garcia-Rulfo, the film is directed by dynamic visualist Gareth Edwards (Rogue One: A Star Wars Story) from a script by original Jurassic Park screenwriter David Koepp. Five years after the events of Jurassic World Dominion, the planet’s ecology has proven largely inhospitable to dinosaurs. Those remaining exist in isolated equatorial environments with climates resembling the one in which they once thrived. The three most colossal creatures across land, sea and air within that tropical biosphere hold, in their DNA, the key to a drug that will bring miraculous life-saving benefits to humankind. Academy Award® nominee Johansson plays skilled covert operations expert Zora Bennett, contracted to lead a skilled team on a top-secret mission to secure the genetic material. When Zora’s operation intersects with a civilian family whose boating expedition was capsized by marauding aquatic dinos, they all find themselves stranded on a forbidden island that had once housed an undisclosed research facility for Jurassic Park. There, in a terrain populated by dinosaurs of vastly different species, they come face-to-face with a sinister, shocking discovery that has been hidden from the world for decades. Ali is Duncan Kincaid, Zora’s most trusted team member; Critics Choice and Olivier Award winner Jonathan Bailey (Wicked, Bridgerton) plays paleontologist Dr. Henry Loomis; Emmy nominee Rupert Friend (Homeland, Obi-Wan Kenobi) appears as Big Pharma representative Martin Krebs and Manuel Garcia-Rulfo (The Lincoln Lawyer, Murder on the Orient Express) plays Reuben Delgado, the father of the shipwrecked civilian family. The cast includes Luna Blaise (Manifest), David Iacono (The Summer I Turned Pretty) and Audrina Miranda (Lopez vs. Lopez) as Reuben’s family. The film also features, as members of Zora and Krebs’ crews, Philippine Velge (Station Eleven), Bechir Sylvain (BMF) and Ed Skrein (Deadpool). Jurassic World Rebirth is directed by BAFTA winner Edwards from a script by Koepp (War of the Worlds), based on characters created by Michael Crichton. The film is produced by Oscar® nominee Frank Marshall and Patrick Crowley, both longtime Jurassic franchise producers and of last summer’s blockbuster, Twisters. The film is executive produced by Steven Spielberg, Denis L. Stewart and Jim Spencer. Cast Scarlett Johansson Mahershala Ali Jonathan Bailey Rupert Friend Manuel Garcia-Rulfo Luna Blaise David Iacono Audrina Miranda Philippine Velge Bechir Sylvain Ed Skrein Director Gareth Edwards Screenplay by David Koepp based on characters created by Michael Crichton Producers Frank Marshall Patrick Crowley Executive Producers Steven Spielberg Denis L. Stewart Jim Spencer"
}