{
  "url": "https://www.xbox.com/en-us/games/store/roblox-windows/9pmf91n3lz3m",
  "title": "Get Roblox - Windows | Xbox",
  "text": "Roblox - Windows Publishers of games you launch receive access to your Xbox profile information and associated data while you play. Learn more +Offers in-app purchases. Parental control information. Learn more Description Roblox is the ultimate virtual universe that lets you create, share experiences with friends, and be anything you can imagine. Join millions of people and discover an infinite variety of immersive experiences created by a global community! Already have an account? Log in with your existing Roblox account and explore the infinite metaverse of Roblox. MILLIONS OF EXPERIENCES In the mood for an epic adventure? Want to compete against rivals worldwide? Or do you just want to hang out and chat with your friends online? A growing library of experiences created by the community means there’s always something new and exciting for you every day. EXPLORE TOGETHER ANYTIME, ANYWHERE Take the fun on the go. Roblox features full cross-platform support, meaning you can join your friends and millions of other people on their computers, mobile devices, Xbox One, or VR headsets. BE ANYTHING YOU CAN IMAGINE Be creative and show off your unique style! Customize your avatar with tons of hats, shirts, faces, gear, and more. With an ever-expanding catalog of items, there’s no limit to the looks you can create. CHAT WITH FRIENDS Hang out with friends around the world using chat features, private messages, and groups! CREATE YOUR OWN EXPERIENCES: https://www.roblox.com/develop SUPPORT: https://en.help.roblox.com/hc/en-us CONTACT: https://corp.roblox.com/contact/ PRIVACY POLICY: https://www.roblox.com/info/privacy PARENT’S GUIDE: https://corp.roblox.com/parents/ TERMS OF USE: https://en.help.roblox.com/hc/en-us/articles/115004647846 PLEASE NOTE: A network connection is required to join. Roblox works best over Wi-Fi. Published by Release date Play with - PC - Handheld Capabilities - Online co-op (2-100) - Online multiplayer (2-100) - Xbox cross-platform multiplayer - Xbox cross-platform co-op"
}