{
  "url": "https://en.wikipedia.org/wiki/Belmont_University",
  "title": "Belmont University - Wikipedia",
  "text": "Belmont University Belmont University is a private Christian university in Nashville, Tennessee, United States. Descended from Belmont Women's College, founded in 1890 by schoolteachers Ida Hood and Susan Heron, the institution was incorporated in 1951 as Belmont College.[1] It became Belmont University in 1991. As of 2025, Belmont reports its enrollment as \"nearly 9,000 students from every state and more than 30 countries.\" The university cut official ties with the Tennessee Baptist Convention in 2007, but still calls itself a \"Christ-centered, student-focused community\".[11] History [edit]The university originated with the founding of the Belmont Women's College in 1890 by Susan Ledley Heron and Ida Emily Hood,[12] on the site of the Belmont Mansion, built by Joseph Acklen and Adelicia (Hayes) Acklen. Upon the retirement of Heron and Hood, Belmont Women's College merged with Ward Seminary in 1913 and was known as Ward—Belmont College, which included both a junior college and college-prep (or high) school for women.[13][14] The Belmont Mansion is owned by Belmont University but maintained by the Belmont Mansion Association, a non-profit group. The mansion is open for tours. It features Victorian art and furnishings. The water tower, gardens, with surviving gazebos and outdoor statuary from the Acklen era, are part of the college campus.[15] In 1991, the school became Belmont University.[16] The university was awarded the Japanese Foreign Minister's Commendation for their contributions to the promotion of mutual understanding between Japan and the US on December 1, 2020.[17][18] Nashville's first radio station [edit]The first radio station in Nashville went on air in May 1922 when John \"Jack\" DeWitt Jr., a high school student, installed a transmitter at Belmont. The station, WDAA, was born when Dr. C. E. Crosland, Associate President, realized the potential advertising value to the college of a radio station. The WDAA program on April 18, 1922, marked the first time a music program was broadcast in Nashville. The broadcast could be heard 150 to 200 miles (320 km) from the school.[19] Ties to the Tennessee Baptist Convention [edit]In 1951, the Tennessee Baptist Convention bought Ward–Belmont College, the finishing school operated in Nashville by Ward–Belmont, Inc., which was facing severe financial difficulties.[citation needed] The convention established the co-educational Belmont College in March 1951, selecting R. Kelly White as president.[citation needed] In 1959, Herbert Gabhart succeeded White and Belmont was accredited by the Southern Association of Colleges and Schools.[citation needed] Enrollment rose from 365 students to 2,000, and the college launched a music business program.[citation needed] He was succeeded by Bill Troutt in 1982, who, at 32, was the youngest college president in the nation.[citation needed] In 1991, it changed its name to Belmont University.[citation needed] In 2005 Belmont's board of trustees sought to remove Belmont University from the control of the Tennessee Baptist Convention while remaining in a \"fraternal relationship\" with it.[20] Advocates of this plan presented a blueprint for change in which all board members would be Christians, but only 60 percent would be Baptists to affirm a Christian affinity while acknowledging the diversity of both the faculty and the student body.[citation needed] The head of the TBC would continue to be an ex officio board member.[citation needed] The TBC rejected this plan. In November 2005, TBC said it wanted to shift its financial support to two other institutions, Union University and Carson-Newman College. Belmont would replace the three percent of its budget that was funded by the TBC.[citation needed] However, on April 7, 2006, TBC sought to oust the existing board and replace it with one consisting entirely of Southern Baptists and amenable to ongoing TBC control.[21] After settlement talks failed, the Tennessee Baptist Convention Executive Board filed a lawsuit on September 29, 2006, against Belmont seeking the return of approximately $58 million.[22] Belmont severed its ties with the Tennessee Baptist Convention in 2007, with the announcement that it would be a Christian university without any denominational affiliations. Under its terms, the TBC and Belmont would disaffiliate amicably, with Belmont agreeing to pay $1 million to the convention immediately and $250,000 annually for the next forty years, for a total cost of $11 million.[23] The university has stated its intent to maintain a Christian identity but no longer a specifically Baptist one.[24] 21st century [edit]Belmont University became a catalyst for anti-discrimination protests in December 2010, when women's soccer coach Lisa Howe allegedly lost her job at the university on December 2 after announcing that she was having three children with her same-sex partner.[25] Howe's dismissal sparked protests from students and local and national gay-rights advocates. These events led to a citywide anti-discrimination ordinance being passed by the Nashville City Council in January 2011.[26] On January 26, 2011, President Bob Fisher announced that Belmont has added sexual orientation to the university's non-discrimination policies.[27] Belmont is a Christian university that was widely regarded for its progressive ideals until the controversy broke out over Howe's departure.[28] The college was criticized for not allowing a group with a mission to support gay students and explore the intersection of Christianity and homosexuality called Bridge Builders to officially form as a student group. At a news conference, Fisher stated that they had resubmitted the application.[28] On February 27, 2011, Belmont University officially recognized the gay student organization for the first time. Belmont Provost Thomas Burns and Bridge Builders President Robbie Maris announced the decision to recognize the student group in a joint statement.[29] In February 2018, Belmont University took ownership of the O'More College of Design.[30] On March 6, 2019, Belmont University announced that its current College of Visual and Performing Arts will be separated into two distinct colleges with defined areas of focus: the College of Music and Performing Arts will include all music, theatre and dance programs while the O'More College of Architecture, Art and Design will house architecture, art, fashion, interior design and design communications.[31] Two years later, Belmont University announced that they would merge with Watkins College of Art, Design & Film, located in Nashville.[32] Belmont and Watkins planned to evaluate employment needs based on the number of students transferring, existing capacities, and related considerations. As a long-standing Christian institution, Belmont's policy intention was to hire faculty and staff who support the Christian institution's mission, vision, and values; however, due to the nature of merging institutions, the university announced special consideration will be given to current Watkins employees regardless of their position of faith.[32][33] In May 2021, Belmont sold the former Watkins College campus for $22.5 million, funds which the university states will underwrite scholarships for students of the visual arts.[34] In July 2020, a group of Belmont University students and alumni began to draw attention to the university's longstanding relationship with CoreCivic (formerly the Corrections Corporation of America), asking the school to divest from any financial ties to CoreCivic and for-profit prisons.[35] The relationship between CoreCivic and the university extends to the early 1980s. In 1983, notable Tennessee businessman Jack C. Massey, provided a portion of the initial funding to begin Corrections Corporation of America, along with Thomas Beasley.[36] Discussed as early as 1966, Belmont's Massey Graduate School of Business was founded shortly after in 1986.[37][38] Beasley has also funded major programs at the school, including a free enterprise institute at the Massey Business School.[39] In 2018, Damon Hininger, CEO of CoreCivic, joined the Belmont University Board of Trustees.[40] Shortly after students and alumni began a petition asking for his removal.[41] Hininger is not the first board member with ties to CoreCivic. The current board includes Andrea Overby (donor to CoreCivic PAC in 2018 and wife of Charles Overby, former CCA board member)[42][43] as well as John Ferguson (former CCA president).[44] As of April 2021, Damon Hininger was no longer a member of the board, having completed his allowed number of terms.[45] Presidents [edit]- L. Gregory Jones (2021–present)[46] - Robert Fisher (2000–2021)[47] - Bill Troutt (1982–2000)[1] - Herbert Gabhart (1959–1982)[1] - R. Kelly White (1951–1959) Academics [edit]Belmont University offers bachelor's degrees in over 130 academic majors in twelve colleges with 29 master's and eight doctoral programs.[48] Belmont and HCA created a health sciences consortium with local universities to alleviate the shortage of nurses and health care professionals in the local community,[49] and provides students with shared office space and mentoring from faculty, local entrepreneurs, and attorneys.[50] Journalism students have gained work experience at The Oprah Winfrey Show, The Daily Show, CBS Evening News, and the British Broadcasting Corp.[51] Rankings [edit]In the 2025 U.S. News & World Report college rankings, Belmont was tied for 220 out of 394 in the category of National Universities.[55] Music and music business programs [edit]Belmont's Mike Curb College of Entertainment & Music Business (CEMB) consists of current/former authors, performers, expert witnesses (for industry lawsuits), artist managers, lawyers, record label executives, songwriters, and others. Mike Curb is the CEO of Curb Records. He was a producer, songwriter, and company executive and one of the most successful record men of the sixties and seventies. He is the department's namesake. The former dean of the CEMB, Jim Van Hook, is a legendary Nashville label head, especially as part of the Christian music industry. One of the hallmarks of the program is its internship program, which sends hundreds of students annually out into the Nashville, New York, and Los Angeles music industries to intern for record labels, management companies, publishing companies, booking agencies, publicists, recording studios, law firms, and other businesses. Besides having three professional-quality recording studios on campus, Belmont owns the Belmont Studios (including Ocean Way Nashville), part of which is operated for-profit (used by such artists as Dave Matthews, Sheryl Crow, and Bob Seger), and part of which is used by students. Ocean Way Nashville, purchased by Belmont in 2001, has recorded thousands of tracks including the score for The Last of Us, a top-selling game that won Best Audio in the global GANG (Game Audio Network Guild) Awards.[56] Schools and colleges [edit]- College of Education - College of Law - College of Liberal Arts & Social Sciences - College of Pharmacy & Health Sciences - College of Sciences & Mathematics - College of Music & Performing Arts - Gordon E. Inman College of Nursing - Interdisciplinary Studies & Global Education - Jack C. Massey College of Business - Mike Curb College of Entertainment & Music Business (CEMB) - O'More College of Architecture & Design - Thomas F. Frist Jr., College of Medicine - Watkins College of Art Campuses [edit]Main campus (Nashville) [edit]Belmont is located in an urban setting near Nashville's Midtown district, with the campus sandwiched by the Hillsboro-West End, Music Row, Edgehill, and Belmont-Hillsboro neighborhoods. Within a reasonable walk of the university are commercial areas 12South and Hillsboro Village. In June 2006, Belmont opened the $18 million Gordon E. Inman Center that houses the Gordon E. Inman College of Health Sciences and Nursing.[57] The building has three stories of classroom space that contain learning labs equipped with Sim Man mannequins that respond to the actions of the nursing students. There are classrooms for adult and pediatric occupational therapy, maternity and neonatal care complete with Sim Man babies and a birthing Sim Woman, an orthopedics lab, and many classrooms of various sizes. Belmont houses the Curb Event Center, a 5000-seat multi-purpose arena, which is used for basketball games, concerts, and other events like the 2006, 2007[58] and 2008 CMT Awards,[59] and the 2008 Presidential Debate.[60] The facility is connected to the Beaman Student Life Center and Maddox Grand Atrium—collectively, a $52 million development. In 2015, the university opened its R. Milton and Denice Johnson Center, home to Belmont's Curb College, Department of Media Studies, Motion Pictures and Harrington Place Dining.[61] Regional campus [edit]\"Williamson Center\" in suburban Franklin, Tennessee, opened in January 2015. This center for professional education and corporate meetings includes classrooms for Belmont's adult degree, professional, and continuing education programs. It also provides space for area businesses to lease for events and meetings. This facility replaced the university's first center in Cool Springs, which had opened in 2002 on Seaboard Lane. National campuses [edit]- Los Angeles (Belmont West) - New York City (Belmont East) Student life [edit]Belmont has over 190 student organizations. These include the Student Government Association (SGA), The Student Activities Programming Board (SAPB), Greek organizations, as well as other special interest organizations.[62] The largest student organization on campus is Service Corps, which focuses on volunteer work inside the music industry and is open only to students enrolled in the Mike Curb College of Entertainment and Music Business.[63] Belmont's Greek community consists of five sororities and four fraternities.[64][65] In the spring of 2025, approximately 13% of full-time undergraduate students at Belmont were members of fraternities and sororities.[66] Belmont has a large music program, and a variety of musical ensembles exist on the campus. There are currently 15 vocal ensembles and 23 instrumental ensembles.[67] In addition, there are three student-run a cappella groups: The Beltones (mixed ensemble), Prismatics (mixed), and Pitchmen (TTBB). All three a cappella groups compete in the International Championship of Collegiate A Cappella (ICCA) regularly. The Beltones have advanced to ICCA finals three times and placed 4th at the event in 2014. The Pitchmen qualified for ICCA finals in 2020 but the event was cancelled due to the COVID-19 pandemic. In April 2023, The Pitchmen won 1st place at the ICCA Finals, taking home their first championship. In 2025, The Pitchmen won their second ICCA Finals, joining a short list of groups to ever win multiple times. In 2020, The A Cappella Archive ranked The Beltones at #8 amongst all ICCA-competing groups since 1996.[68] Belmont operates one student newspaper called The Belmont Vision.[69] Points of interest [edit]Main campus attractions [edit]- Belmont Mansion - The Bell Tower – The first carillon in Tennessee and among the first 25 installed in North America.[70] - Curb Event Center Off-campus facilities [edit]- E.S. Rose Park – Metro Nashville Parks owned property in partnership with Belmont University – hosts NCAA Div.I baseball, soccer, softball, and track.[71] Athletics [edit]Belmont is a member of the NCAA Division I and is a member of the Missouri Valley Conference in all of Belmont's sports. On September 28, 2021, Belmont announced that it would become a member of the Missouri Valley Conference, beginning in the Fall of 2022.[72] Until July 1, 2012, Belmont had been a member of the Atlantic Sun Conference, a non-football conference.[73] In the mid-1990s, Belmont changed its nickname to the \"Bruins\", replacing the earlier mascot of Rebels due to its association with the Confederacy. Bruin is Middle English for bear from the Dutch fable \"History of Reynard the Fox\", translated by William Caxton. In 2011 Belmont student-athletes won the Atlantic Sun Conference Academic Trophy for the eighth time in ten years with 76.32 percent of the student-athletes achieving at least a 3.0 grade-point average.[74] In 2012 Belmont student-athletes won the Ohio Valley Conference Institutional Academic Achievement Award for the first time after joining the conference the previous year.[75] In 2015, Belmont received the OVC's Institutional Academic Achievement Award, presented each year to the member institution with the greatest percentage of its eligible student-athletes that earn a 3.25 GPA or higher. This award marked the 4th straight year for Belmont, who joined the OVC only 4 years prior.[76] Presidential debates [edit]On November 19, 2007, The Commission on Presidential Debates chose Belmont University from sixteen finalists to host one of three Presidential election debates on October 7, 2008.[77] In 2019, the Commission on Presidential Debates selected Belmont to host the final presidential debate[78] in the 2020 election between Donald Trump and Joe Biden.[79] Notable alumni [edit]Notable faculty [edit]- Alberto Gonzales, former United States Attorney General, is the Doyle Rogers Distinguished Chair of Law.[80] - Alan Shacklock, music producer, is a professor of audio engineering technology. References [edit]- ^ a b c d \"Belmont History\". belmont.edu. - ^ Accredited Candidate sacscoc.org [dead link] - ^ \"Accredited Institutions Search\". - ^ \"NAICU - member-detail\". Naicu.edu. Retrieved August 27, 2022. - ^ As of June 30, 2021. Belmont University (Report). NACUBO. September 6, 2022. Archived from the original on February 9, 2022. Retrieved September 29, 2022. - ^ \"L. Gregory Jones | Belmont Presidential Inauguration\". - ^ a b c d \"College Navigator - Belmont University\". - ^ \"Vision 2024 Southeast Journalism Conference | Belmont University\". belmont.edu. Retrieved March 17, 2024. - ^ University Brand Colors. August 23, 2024. Retrieved August 23, 2024. - ^ \"Belmont Begins New Era in Missouri Valley Conference\". Belmont University. July 1, 2022. - ^ \"About Belmont University\". - ^ George Thomas Kurian, World Encyclopedia of Cities, ABC-CLIO, 1994, p. 625 - ^ Ward-Belmont Alumnae Gather for Reunion. forum.belmont.edu - ^ Margaret Binnicker. \"Harpeth Hall School and Ward-Belmont\". Encyclopedia of History and Culture. Tennessee Historical Society. Archived from the original on December 11, 2013. - ^ \"About Us\". Belmont Mansion. Archived from the original on September 25, 2010. Retrieved May 9, 2012. - ^ American Universities and Colleges. Walter de Gruyter and American Council on Education. 2014. p. 1597. ISBN 9783110850482. - ^ \"Foreign Minister's Commendations for FY 2020\". mofa.go.jp (Press release). Ministry of Foreign Affairs of Japan. - ^ \"Foreign Minister's Commendations for FY 2020 (Groups)\" (PDF). mofa.go.jp. Ministry of Foreign Affairs of Japan. Retrieved August 25, 2023. - ^ Frost, S. E. (1971). Education's own stations – Google Books. Arno Press. ISBN 9780405035739. Retrieved March 23, 2010. - ^ \"Belmont University plans to end formal ties with Tennessee Baptists\". baptistnews.com. November 8, 2005. - ^ \"Tennessee Baptists file suit against Belmont University\". baptistpress.com. October 3, 2006. - ^ Jane R. Porter, Tennessee Baptist Group Sues Belmont U. for Return of Contributions, chronicle.com, USA, October 4, 2006 - ^ Tom Bartlett, Belmont U. Agrees to Pay $11-Million to Tennessee Baptist Convention, Settling Lawsuit and Severing Ties, chronicle.com, USA, November 14, 2007 - ^ Belmont, Tennessee Baptists, Settle Lawsuit, End Relationship. Ethicsdaily.com. Retrieved on May 9, 2012. - ^ \"Belmont changes policy after gay coach protest\". The Associated Press State & Local Wire. January 27, 2011. - ^ \"Coach's Lost Job Could Spark Anti-Discrimination Policy\". WSMV.com. Nashville. Archived from the original on February 1, 2011. - ^ \"Belmont adds 'sexual orientation' to nondiscrimination policies\". BelmontVision.com. January 26, 2011. Archived from the original on February 5, 2011. Retrieved May 9, 2012. - ^ a b \"Belmont University adds œsexual orientation in non-discrimination policy\". International Business Times News. January 27, 2012. - ^ \"Belmont officially recognizes gay student group\". The Associated Press State & Local Wire. February 27, 2011. - ^ Seltzer, Rick (February 14, 2018). \"Belmont Acquires Neighboring Design College\". Inside Higher Ed. Retrieved February 14, 2018. - ^ Hefner, April (March 6, 2019). \"Belmont Forms Two Colleges to Increase Focus on Architecture/Design and Music/Performing Arts\". belmont.edu. Nashville: Belmont University. Retrieved April 24, 2019. - ^ a b Custodio, Jonathan (February 7, 2020). \"A College Merger Got Off to a Rocky Start. Here Are Some of the Lessons\". Chronicle of Higher Education. Retrieved February 10, 2020. - ^ Levenson, Michael (February 2, 2020). \"Art School's Merger With Christian University Stokes Uproar\". The New York Times. ISSN 0362-4331. Retrieved February 25, 2020. - ^ \"Belmont's sale of Watkins campus to create scholarship endowment\". WSMV.com. - ^ Mangrum, Meghan. \"Belmont students, alumni want school to cut ties with private prison operator CoreCivic\". The Tennessean. Retrieved August 5, 2020. - ^ \"Corrections Corporation of America\". c-span.org. Retrieved August 5, 2020. - ^ \"Jack C. Massey Graduate School of Business\". belmont.edu. Retrieved August 5, 2020. - ^ \"Belmont History\". belmont.edu. Nashville: Belmont University. Retrieved August 10, 2020. - ^ Buckner, Hope (June 14, 2018). \"Belmont University Establishes Thomas W. Beasley Institute for Free Enterprise\". belmont.edu. Belmont University. Retrieved August 5, 2020. - ^ \"Head of Private Prison Giant CoreCivic Joins Education Nonprofit Board\". Nashville Scene. January 19, 2018. Retrieved August 5, 2020. - ^ \"Board of Trust member Lee Beaman accused of abuse, cruelty in divorce documents\". belmontvision.com. Archived from the original on February 28, 2021. Retrieved August 5, 2020. - ^ \"Freedom Forum CEO Charles Overby's Dark History with Corrections Corporation of America\". Prison Legal News. Retrieved August 5, 2020. - ^ \"CoreCivic Inc Contributors, 2018 cycle\". OpenSecrets. Retrieved August 5, 2020. - ^ \"CCA announces Hininger to succeed Ferguson as CEO, John Ferguson to remain as Chairman of Board of Directors\". cutbankpioneerpress.com. Golden Triangle News. August 19, 2009. Retrieved August 5, 2020. - ^ \"CoreCivic CEO departs Belmont University board\". The Tennessean. - ^ \"President\". president.belmont.edu. Nashville: Belmont University. - ^ \"President Emeritus\". belmont.edu. Nashville: Belmont University. - ^ \"Academic Majors & Programs\". belmont.edu. Retrieved August 23, 2024. - ^ Blake Farmer Belmont nurses will get HCA training. Nashville City Paper, June 12, 2006 - ^ Spors, Kelly K. (March 19, 2007). \"Entrepreneurship 101\". The Wall Street Journal. Retrieved March 23, 2010. - ^ \"Living: Woolley heads to CBS New York\". Out & About Newspaper. September 1, 2006. Archived from the original on February 18, 2009. Retrieved March 23, 2010. - ^ \"2025-2026 Best National Universities Rankings\". U.S. News & World Report. September 23, 2025. Retrieved November 12, 2025. - ^ \"2025 Best Colleges for Your Tuition (and Tax) Dollars\". Washington Monthly. August 25, 2025. Retrieved November 12, 2025. - ^ \"2026 Best Colleges in the U.S.\" The Wall Street Journal/College Pulse. September 29, 2025. Retrieved November 12, 2025. - ^ \"Belmont University\". U.S. News & World Report. - ^ Kovats, Phillip \"Phil\"; Lanier, Jonathan (September 6, 2014). \"The Mix in The Last of Us\". Game Audio Network Guild (Interview). Interviewed by Kenny Young. Retrieved February 20, 2018. - ^ \"The Gordon E. Inman Center\". belmont.edu. Archived from the original on October 26, 2016. Retrieved October 25, 2016. - ^ Greg Pillon (April 17, 2007). \"Belmont University Hosts CMT Music Awards Second Year In a Row\". Belmont University. Archived from the original on June 12, 2010. Retrieved July 1, 2011. - ^ \"Sugarland to take the stage at CMT Awards\". Universal Music Nashville. February 19, 2008. Retrieved July 1, 2011. - ^ \"Belmont University Prepares for Presidential Debate\". NewsChannel5 Nashville. August 20, 2008. Archived from the original on April 6, 2012. Retrieved July 1, 2011. - ^ \"Belmont University's R. Milton and Denice Johnson Center\". The Tennessean. Retrieved February 20, 2018. - ^ \"Student Organizations and Activities - Division of Student Affairs\". belmont.edu. Retrieved March 9, 2018. - ^ \"Student Organizations – Belmont University\". Belmont.edu. Archived from the original on April 20, 2010. Retrieved March 23, 2010. - ^ \"Office of Student Engagement & Leadership Development - Sororities\". belmont.edu. Retrieved March 9, 2018. - ^ \"Office of Student Engagement & Leadership Development - Fraternities\". belmont.edu. Retrieved March 9, 2018. - ^ \"Office of Student Engagement & Leadership Development - Frequently Asked Questions\". belmont.edu. Retrieved March 9, 2018. - ^ \"Ensembles in the School of Music\". Belmont University. Archived from the original on December 14, 2010. Retrieved December 15, 2010. - ^ \"The A Cappella Archive - Rankings & Records\". sites.google.com. Retrieved October 7, 2020. - ^ \"About 'The Belmont Vision'\". Belmont Vision. Archived from the original on September 26, 2010. Retrieved November 2, 2010. - ^ \"Belmont Carillon\". Belmont.edu. September 5, 1986. Archived from the original on May 28, 2010. Retrieved March 23, 2010. - ^ \"E.S. Rose Complex\". nashville.gov. Retrieved March 9, 2018. - ^ \"Belmont athletics announces move from Ohio Valley Conference to Missouri Valley Conference\". The Tennessean. - ^ Bruins' new conference Archived September 18, 2011, at the Wayback Machine. Belmontvision.com (May 13, 2011). Retrieved on 2012-05-09. - ^ Bruins Win Trophy Archived September 28, 2011, at the Wayback Machine. Atlanticsun.org. Retrieved on May 9, 2012. - ^ Belmont University Claims OVC Academic Award Archived August 14, 2014, at the Wayback Machine. belmontbruins.com. Retrieved on July 26, 2013. - ^ \"Belmont Claims 2015-16 OVC Institutional Academic Achievement Award; Winners of 16 Team Academic Achievement Awards Announced\". Retrieved March 9, 2018. - ^ Belmont University Prepares for Presidential Debate Archived June 29, 2011, at the Wayback Machine. Newschannel5.com. Retrieved on May 9, 2012. - ^ \"CPD: Commission on Presidential Debates Announces Sites and Dates for 2020 General Election Debates and 2020 Nonpartisan Candidate Selection Criteria\". www.debates.org. - ^ \"How did presidential debate moderator Kristen Welker do? See instant analysis, reaction\". The Tennessean. - ^ \"Alberto Gonzales\". American Academy of Achievement. Archived from the original on May 12, 2013. Retrieved May 2, 2013. External links [edit]- Belmont University - Universities and colleges in Nashville, Tennessee - Private universities and colleges in Tennessee - Universities and colleges accredited by the Southern Association of Colleges and Schools - University and college buildings on the National Register of Historic Places in Tennessee - Universities and colleges established in 1890 - 1890 establishments in Tennessee - National Register of Historic Places in Nashville, Tennessee - Former women's universities and colleges in the United States - Affirming Christian universities and colleges in the United States"
}