{
  "url": "https://en.wikipedia.org/wiki/Santería",
  "title": "Santería - Wikipedia",
  "text": "Santería Santería (Spanish pronunciation: [san.te.ˈɾi.a]), also known as Regla de Ocha, Regla Lucumí, or Lucumí, is an African diaspora religion that developed in Cuba during the late 19th century. It arose amid a process of syncretism between the traditional Yoruba religion of West Africa, Catholicism, and Spiritism. There is no central authority in control of Santería and much diversity exists among practitioners, who are known as creyentes ('believers'). Santería teaches the existence of a transcendent creator divinity, Olodumare, under whom are spirits known as oricha. Typically deriving their names and attributes from traditional Yoruba deities, these oricha are equated with Roman Catholic saints and associated with various myths. Each human is deemed to have a personal link to a particular oricha who influences their personality. Olodumare is believed to be the ultimate source of aché, a supernatural force permeating the universe that can be manipulated through ritual actions. Practitioners venerate the oricha at altars, either in the home or in the ilé (house-temple), which is run by a santero (priest) or santera (priestess). Membership of the ilé requires initiation. Offerings to the oricha include fruit, liquor, flowers and sacrificed animals. A central ritual is the toque de santo, in which practitioners drum, sing, and dance to encourage an oricha to possess one of their members and thus communicate with them. Several forms of divination are used, including Ifá, to decipher messages from the oricha. Offerings are also given to the spirits of the dead, with some practitioners identifying as spirit mediums. Healing rituals and the preparation of herbal remedies and talismans also play a prominent role. Santería developed among Afro-Cuban communities following the Atlantic slave trade of the 16th to 19th centuries. It formed through the blending of the traditional religions brought to Cuba by enslaved West Africans, the majority of them Yoruba, and Roman Catholicism, the only religion legally permitted on the island by the Spanish colonial government. In urban areas of West Cuba, these traditions merged with Spiritist ideas to form the earliest ilés during the late 19th century. After the Cuban War of Independence resulted in an independent republic in 1898, its new constitution enshrined freedom of religion. Santería nevertheless remained marginalized by Cuba's Roman Catholic, Euro-Cuban establishment, which typically viewed it as brujería (witchcraft). In the 1960s, growing emigration following the Cuban Revolution spread Santería abroad. The late 20th century saw growing links between Santería and related traditions in West Africa and the Americas, such as Haitian Vodou and Brazilian Candomblé. Since the late 20th century, some practitioners have emphasized a \"Yorubization\" process to remove Roman Catholic influences and created forms of Santería closer to traditional Yoruba religion. Practitioners of Santería are primarily found in Cuba's La Habana and Matanzas provinces, although communities exist across the island and abroad, especially among the Cuban diasporas of Mexico and the United States. The religion remains most common among working-class Afro-Cuban communities although is also practiced by individuals of other class and ethnic backgrounds. The number of initiates is estimated to be in the high hundreds of thousands. These initiates serve as diviners and healers for a much larger range of adherents of varying levels of fidelity, making the precise numbers of those involved in Santería difficult to determine. Many of those involved also identify as practitioners of another religion, typically Roman Catholicism. Definitions [edit]The term Santería translates into English as the 'way of the saints'.[1] This term was first used by scholarly commentators in the 1930s and later spread among the religion's practitioners themselves.[2] It has become the most popular name for the religion, although some practitioners find it offensive.[3] A common alternative is Regla de Ocha, meaning 'the rule of ocha',[4] ocha being a term for the religion's deities.[5] Some adherents regard this as the religion's \"official\" name.[3] The tradition has also been called Lucumí, in reference to the colonial Spanish term for the Yoruba people,[6] or alternatively La Religión Lucumí ('the Lucumí religion')[7] or Regla Lucumí (\"the rule of Lucumí\").[8] Santería is an Afro-Caribbean religion,[9] and more specifically an Afro-Cuban religion.[10] In Cuba it is sometimes described as \"the national religion\",[11] although it has also spread abroad.[12] Santería's roots are in the traditional religions brought to Cuba by enslaved West Africans, the majority of them Yoruba, between the 16th and 19th centuries. In Cuba, these religions mixed with the Roman Catholicism introduced by Spanish colonialists.[13] Roman Catholic saints were conflated with West African deities,[14] while enslaved Africans adopted Roman Catholic rituals and sacramentals.[15] In the 19th century, elements from Spiritism—a French variant of Spiritualism—were drawn into the mix,[16] with Santería emerging as a distinct religion in western Cuba during the late 19th century.[17] Although Santería is the best known of the Afro-Cuban religions,[18] and the most popular,[19] it is not the only one.[8] Others include Palo, which derives from practices originating in the Congo Basin, and Abakuá, which has its origins among the secret male societies practiced among the Efik-Ibibio.[20] Many practitioners of Palo and Abakuá also follow Santería.[21] Another Afro-Cuban religion is Arará, which derives from practices among the Ewe and Fon; although its origins are not Yoruba, it is sometimes considered a branch of Santería rather than a separate system.[22] Santería also has commonalities with other West African and West African-derived traditions in the Americas which collectively form the \"Orisha religion\",[23] \"Orisha Tradition\",[24] or \"Orisha worship.\"[25][a] These include Haitian Vodou and Brazilian Candomblé, sometimes characterized as \"sister religions\" of Santería due to their shared origins in Yoruba traditional religion.[26] [Santería] in Cuba was not just a continuation of Yoruba religious and cultural practices but something new, born from the encounter of the diverse Yoruba tribes with one another, with non-Yoruba Africans, and with the Europeans in a new environment and a new social order governed by [a] set of institutions different from those of Africa. Santería is a flexible and eclectic tradition,[28] with considerable variation in how it is practiced.[29] There is no strict orthodoxy,[30] no key sacred text,[31] and no central authority in control of the entire religion.[32] It has absorbed elements from many cultures that it has encountered,[33] such as that of the Chinese migrants who came to Cuba in the 19th century,[34] while in continental North America, Santería has also incorporated influences from Central American and Mexican religions as well as from New Age and modern Pagan practices.[35] As well as it being common for Cubans to idiosyncratically blend ideas from different religions,[36] many of Santería's practitioners claim multiple religious allegiances.[37] Santería's adherents often consider themselves to be Roman Catholics[38]—some priests and priestesses of Santería refuse to initiate anyone who is not a baptised Roman Catholic[39]—and others consider themselves to be Spiritists,[40] Hindus,[41] Vodouists,[42] or Jews.[43] Terms for practitioners [edit]Different vocabulary indicates the level of a practitioner's involvement,[44] with the various terms sometimes reflecting different political and social agendas.[45] Practitioners of both Santería and other Afro-Cuban religions are called creyentes (\"believers\").[46] Some people external to the religion have referred to its practitioners as \"santerians\" although this is not used by adherents themselves.[45] A non-initiate, including those who may attend public Santería ceremonies, is an aleyo (\"stranger\");[47] these non-initiates make up the majority of people involved in the religion.[48] Initiates are known as santero if male,[49] and santera if female,[50] although these two terms have sometimes been used for anyone, initiate or not, who participates in the religion.[45] Alternative terms for an initiate are babalocha or babaloricha (\"father-deity\") if male and an iyalocha or iyaloricha (\"mother-deity\") if female.[51] Those who have a sustained engagement with the religion are also referred to as omoricha (\"children of the oricha\"),[52] aboricha (\"one who worships the oricha\"),[44] and an oloricha (\"one who belongs to the oricha\").[44] Beliefs [edit]Olodumare and the oricha [edit]Santería teaches the existence of an overarching divinity, known as Olodumare, Olofi, or Olorun.[53] Practitioners believe that this divinity created the universe but takes little interest in human affairs.[54] As this creator deity is inaccessible to humanity,[55] no major offerings are dedicated to it.[56] The three facets of this divinity are understood slightly differently; Olodumare represents the divine essence of all that exists, Olorun is regarded as the creator of all beings, while Olofi dwells in all creation.[57] In taking a triplicate form, this deity displays similarities with the Christian Trinity.[57] The oricha [edit]Santeria is polytheistic,[58] revolving around deities called oricha,[59] ocha,[60] or santos (\"saints\").[61] The term oricha can be both singular and plural, because Lucumí, the ritual language of Santería, lacks plural markers for nouns.[62] Practitioners believe that some oricha were created before humanity, while others were originally humans who became oricha through some remarkable quality.[63] Some practitioners perceive the oricha as facets of Olodumare,[64] and thus think that by venerating them they are ultimately worshipping the creator god.[65] Certain oricha are female, others male.[66] They are not regarded as wholly benevolent,[67] being capable of both harming and helping humans,[68] and displaying a mix of emotions, virtues, and vices.[69] Origin myths and other stories about the oricha are called patakís.[70] Each oricha is understood to \"rule over\" a particular aspect of the universe,[60] being identified with a different facet of the natural world or human existence.[71] They live in a realm called orún, which is contrasted with ayé, the realm of humanity.[72] Oricha each have their own caminos (\"roads\"),[73] or manifestations,[74] a concept akin to the Hindu concept of avatars.[75] The number of caminos an oricha has varies, with some having several hundred.[76] Practitioners believe that oricha can physically inhabit certain objects, among them stones and cowrie shells, which are deemed sacred.[77] Each oricha is also associated with specific songs, rhythms, colors, numbers, animals, and foodstuffs.[78] Among the oricha are the four \"warrior deities\", or guerrors: Eleguá, Ogun, Ochosi, and Ochún.[80] Eleguá is viewed as the guardian of the crossroads and thresholds;[81] he is the messenger between humanity and the oricha, and most ceremonies start by requesting his permission to continue.[82] He is depicted as being black on one side and red on the other,[83] and practitioners will frequently place a cement head decorated with cowrie shells that represents Eleguá behind their front door, guarding the threshold to the street.[84] The second guerro is Ogun, viewed as the oricha of weapons and war,[85] and also of iron and blacksmiths.[86] The third, Ochosi, is associated with woods and hunting,[87] while the fourth, Ochún, is a protector who warns practitioners when they are in danger.[88] Perhaps the most popular oricha,[89] Changó or Shango is associated with lightning and fire.[90] Another prominent oricha is Yemaja, the deity associated with maternity, fertility, and the sea.[91] Ochún is the oricha of rivers and of romantic love,[92] while Oyá is a warrior associated with wind, lightning, and death, and is viewed as the guardian of the cemetery.[93] Obatalá is the oricha of truth and justice and is deemed responsible for helping to mould humanity.[94] Babalú Ayé is the oricha associated with disease and its curing,[95] while Osain is linked to herbs and healing.[96] Orula is the oricha of divination, who in Santería's mythology was present at the creation of humanity and thus is aware of everyone's destiny.[97] Ibeyi takes the form of twins who protect children.[96] Olokún is the patron oricha of markets, while his wife Olosá is associated with lagoons.[96] Agagyú is the oricha of volcanoes and the wasteland.[96] Some oricha are deemed antagonistic to others; Changó and Ogun are for instance enemies.[98] Although in Santería the term santo is regarded as a synonym of oricha and is not a literal reference to Christian saints,[99] the oricha are often conflated with one or more Roman Catholic saints based on similar attributes.[100] For instance, the Holy Infant of Atocha, a depiction of Christ as a child, is conflated with Eleguá, who is seen as having a childlike nature.[101] Babalú Ayé, who is associated with disease, is often identified with the Catholic Saint Lazarus, who rose from the dead,[79] while Changó is conflated with Santa Barbara because they both wear red.[102] Cuba's patron saint, Our Lady of Charity, is equated with Ochún.[103] It has been argued that Yoruba slaves initially linked their traditional deities with Christian saints as a means of concealing their continued worship of the former from the Spanish authorities,[104] or as a means of facilitating social mobility by assimilating into Roman Catholic social norms.[105] Relationships with the oricha [edit]Santería's focus is on cultivating a reciprocal relationship with the oricha,[60] with adherents believing that these deities can intercede in human affairs and help people if they are appeased.[63] Practitioners argue that each person is \"born to\" a particular oricha, whether or not they devote themselves to that deity.[106] This is a connection that, adherents believe, has been set before birth.[107] Practitioners refer to this oricha as one that \"rules the head\" of an individual;[60] it is their \"owner of the head\".[108] If the oricha is male then it is described as the individual's \"father\"; if the oricha is female then it is the person's \"mother\".[109] This oricha is deemed to influence the individual's personality, and can be recognised through examining the person's personality traits,[110] or through divination.[111] To gain the protection of a particular oricha, practitioners are encouraged to make offerings to them, sponsor ceremonies in their honor, and live in accordance with their wishes, as determined through divination.[112] Practitioners are concerned at the prospect of offending the oricha.[113] Creyentes believe that the oricha can communicate with humans through divination, prayers, dreams, music, and dance.[114] Many practitioners also describe how they \"read\" messages from the oricha in everyday interactions and events.[115] For instance, a practitioner who meets a child at a traffic intersection may interpret this as a message from Eleguá, who is often depicted as a child and who is perceived as the \"guardian\" of the crossroads. At that point the practitioner may turn to divination to determine the precise meaning of the encounter. The information obtained from these messages may then help practitioners make decisions about their life.[116] Birth and the dead [edit]Santería teaches that the human head contains a person's essence, their eledá[117] or orí.[118] It maintains that before birth, the eledá goes before Olodumare, where it is given its essential character,[118] and forms a link with the oricha who becomes \"the owner of the head\".[119] The concept of the eledá derives from Yoruba traditional religion, where it is seen as a person's \"spiritual double\". In Santería, this concept idea has syncretised with Roman Catholic beliefs about guardian angels and Spiritist notions of the protecciones or protector spirits. There is no strict orthodoxy on this issue and thus interpretations differ.[120] Practitioners often believe that everyone has a specific destiny,[121] their destino (destiny) or camino (road),[122] although their fate is not completely predetermined.[122] Ancestor veneration is important in Santería.[123] The religion entails propitiating the spirits of the dead, known as egun,[124] espíritus,[125] or muertos.[126] Practitioners believe that the dead must be treated with respect, awe, and kindness; they are consulted at all ceremonies.[127] Although the dead are not deemed as powerful as the oricha, they are still thought capable of assisting the living,[127] with whom they can communicate through dreams, intuition, and spirit possession.[122] Santería teaches that a person can learn to both see and communicate with the dead.[127] Practitioners will often provide offerings, typically seven glasses of water, to the egun to placate and please them.[127] Especially propitiated are those egun regarded as ancestors;[60] these ancestors can include both hereditary forebears or past members of one's congregation,[128] with practitioners believing that a creyente becomes an ancestor when they die.[129] Adherents believe that everyone has a cuadro espiritual (\"spiritual portrait\" or \"spiritual picture\") of egun who protect them.[130] Individuals can have as many as 25 protectores, or protective spirits.[107] The religion maintains that all people have multiple egun accompanying them at all times, and that these can be benevolent, malevolent, or a mix of both.[127] Practitioners also believe that the number and identities of these spirits can be determined through divination.[127] It draws a distinction between evolved spirits, who can help those they are attached to, and unevolved spirits, who lack the wisdom and skill to be useful and instead cause havoc.[131] Santería teaches that through offerings and prayers, individuals can help some of their unevolved spirits to become evolved.[131] Santería also divides the spirits into categories that each exhibit different traits, reflecting stereotypes about different social groups,[122] with such spirits often portrayed as African, Haitian, Gypsy, Arab, or Plains Indian.[132] The gitano (gypsy) spirits for instance are believed capable of foreseeing impending troubles and diagnosing illnesses while the congo spirits of Africa are perceived as strong-willed, powerful, and adept at guiding people through hostile circumstances.[122] Aché [edit]Aché is a major cosmological concept in Yoruba traditional religion and has been transferred to Santería.[133] Aché is regarded as the organizing power of the cosmos;[134] the Hispanic studies scholars Margarite Fernández Olmos and Lizabeth Paravisini-Gebert referred to it as \"a spiritual-mystical energy or power found in varying degrees and in many forms throughout the universe\".[63] The medical anthropologist Johan Wedel described it as \"life force\"[135] or \"divine force\",[136] while the folklorist Michael Atwood Mason called aché the \"ritual generative power\".[65] The ethnomusicologist Katherine Hagedorn described aché as \"the realized and inherent divine potential in all aspects of life, even in apparently inert objects.\"[133] She added that \"Aché is neither good nor bad; rather, aché is motion\".[129] While deeming Olodumare the ultimate embodiment of aché,[137] practitioners believe that aché permeates all life,[63] and is present in both the visible and invisible world.[138] It is nevertheless deemed to sometimes congregate more densely, for instance in the forces of nature, specific locales, and in certain human individuals;[138] initiates are believed to attract more of it than other humans.[133] Santería holds that aché can emanate from the human body via speech, song, dance, and drumming,[139] and can be transmitted through such acts as singing praise songs for the oricha or sacrificing an animal.[140] Among practitioners, aché is sometimes described as conveying notions of luck, health, and prosperity,[136] and has the power to fortify a person's health.[141] Morality, ethics, and gender roles [edit]Santería has standards for behavior expected of practitioners,[142] encouraging behaviors influenced by the mythological stories about the oricha.[143] The religion presents strict rules regarding how to interact with other people and with the supernatural,[144] for instance placing emphasis on respect for elders and superiors.[145] A general attitude in Santería is that if an individual maintains good character, the oricha will aid them.[146] Practitioners generally take socially conservative stances, having high regard for traditional family structures, marriage, fidelity, and child-rearing;[147] adherents in the United States often adopt more progressive stances on issues surrounding gender and sexuality than their counterparts in Cuba.[148] The religion is non-dualistic and does not view the universe as being divided between good and evil; rather, all things are perceived as being complementary and relative.[149] Several academics have described Santería as having a \"here-and-now\" ethos distinct from that of Christianity,[150] and the social scientist Mercedes C. Sandoval suggested that many Cubans chose Santería over Roman Catholicism or Spiritism because it emphasizes techniques for dealing with pragmatic problems in life.[151] In the U.S., some African American adherents have contrasted what they regard as the African-derived ethos of Santería with the non-African origins of Christianity,[152] thus adopting it as a religion readily combined with black nationalism.[153] The scholar of religion Mary Ann Clark labelled Santería a \"female oriented and female normative\" religion,[154] arguing that all of its practitioners are expected to take on \"female gender roles\" during its rituals.[155] Women can hold the highest leadership positions,[156] although restrictions are placed on them while menstruating.[157] Similar restrictions are also placed on homosexual males, traditionally prohibiting them from taking part in certain forms of divination and ritual drumming.[158] Many gay men and lesbians are nevertheless santeros or santeras,[159] with Yemaja being seen as the patron of gay and bisexual men.[160] A stereotype exists that all male Santería priests are homosexual,[41] and members of other Afro-Cuban traditions with a more masculinist orientation, such as Palo, have often denigrated it for being dominated by women and men they consider to be \"womanly\".[161] Practices [edit]Santería is a practice-oriented religion; ritual correctness is considered more important than belief.[162] It has an elaborate system of ritual,[163] with its rites termed ceremonias (ceremonies).[164] Most of its activities revolve around the oricha,[138] focusing on solving the problems of everyday life.[146] Practitioners usually use the term trabajo (work) in reference to ritual activity;[165] thus \"working ocha\" describes its rites.[166] Santería is an initiatory religion,[167] one which is organized around a structured hierarchy.[168] An ethos of secrecy pervades many of its practices,[169] with initiates often refusing to discuss certain topics with non-initiates.[170] For this reason, Mason described Santería as a secret society.[171] For ritual purposes, the Lucumí language is often used.[172] Sometimes referred to as la lengua de los orichas (\"the language of the oricha\"),[173] it is regarded as a divine language through which practitioners can contact the deities.[174] Although some practitioners are uncomfortable using it,[175] most initiates know tens or hundreds of Lucumí words and phrases.[173] Most Cubans do not understand the Lucumí language, barring a few words that have filtered into Cuban Spanish.[176] Lucumí derives from the Yoruba language, although it has become \"increasingly fragmented and unintelligible\" since the 19th century.[177] As Yoruba transitioned into Lucumí, the Yoruba pronunciations of many words were forgotten,[175] and in the early 21st century some practitioners have studied the Yoruba language to better understand the original meaning of Lucumí words.[178] Houses of worship [edit]Rituals take place in the ilé (\"house\"),[179] sometimes called the ilé-oricha (\"house of the oricha\"),[180] casa templo (\"house of worship\"),[181] casa de santos (\"house of saints\"),[182] or casa de religión (\"house of religion\").[183] The ethnomusicologist María Teresa Vélez called this the \"house-temple\",[180] with the ilé usually being the personal home of a santero or santera.[166] It will typically have an inner room, the igbodu (\"sacred grove of the festival\"), where the most important rituals take place.[184] There will also be an eyá aránla or sala, often a living room, where semi-private rites can be conducted.[184] Another space, the iban balo, or patio, will be used for public occasions, as well as for the cultivation of plants and the housing of animals due to be sacrificed.[184] The ilé will typically include a place to store ritual paraphernalia, kitchen facilities, and space for visitors to sleep.[166] The ilé refers not only to the building where ceremonies take place, but also the community of practitioners who meet there.[166] In this sense, many ilés trace a lineage back to the 19th century, with some santeros and santeras capable of listing the practitioners who have been initiated into it.[166] In some ceremonies, the names of these individuals, who are regarded as the ancestors of the house, are recited in chronological order.[185] Although members of different houses often interact, each ilé is largely autonomous, allowing for variation in their practices.[186] In Cuba, it is common for Santería practitioners to meet with each other regularly,[187] and to regard each other as being akin to a family:[188] the familia de santo.[189] Conversely, in an area like Veracruz in Mexico, many practitioners attend group rituals and then leave, sometimes never seeing their co-practitioners again.[187] Most ilés are established by a santero or santera who has attracted a following.[190] An apprentice is known as their ahijado (godson) or ahijada (goddaughter).[191] They refer to their santero/santera as padrino (godfather) or madrina (godmother).[192] The relationship between santeros/santeras and their \"godchildren\" is central to the religion's social organization,[190] and practitioners believe that the more \"godchildren\" a santera or santero has, the greater their aché.[136] The \"godchildren\" are expected to contribute both their labor and finances to events held at the ilé and in return the santero/santera provides assistance for their needs.[190] Within the religion, offending one's godparent is regarded as also offending the oricha that \"rules the head\".[115] Practitioners express respect both to their godparent and the oricha via a ritual prostration, the moforibale, in which they bow their head to the floor.[193] The precise form of the moforibale differs depending on whether the individual's personal oricha is male or female.[194] Shrines [edit]Altars or shrines to the oricha are typically found both within the igbodu[196] and in practitioners' homes.[197] Central to these altars are sacred objects, termed fundamentos (\"fundamentals\"),[198] which are contained within porcelain vessels, often tureens, called sopera.[199] The most important of the fundamentos are stones termed otanes (sing. otán),[199] which are regarded as the literal and symbolic representation of the oricha,[200] and thus living entities.[201] They are deemed to be sources of aché,[202] with older otanes having more aché than younger ones.[203] Practitioners will collect stones from the landscape and then use divination to determine which ones contain an oricha and, if so, which oricha it is.[204] Specific otanes sometimes display traits linking them to particular oricha; for example ocean stones are linked with Yemaya, river pebbles with Ochún, and meteorite fragments with Changó.[57] Each oricha is deemed to prefer a particular color and number of otanes in sopera devoted to them; Changó has six or ten black stones, Obatala has eight white stones, while Ochún favors five yellow stones.[205] New otanes undergo a bautismo (\"baptism\") rite,[202] entailing them being washed in osain, a mixture of herbs and water, and then \"fed\" with animal blood.[203] When an initiate receives their stones, they take an oath to protect them and feed them at least annually.[202] Other material placed inside the sopera includes cowrie shells; usually 18 are added although the precise number differs depending on which oricha the sopera is devoted to.[203] The sopera will often be covered by a cloth known as a pañuelo that is colored in accordance with the oricha in question.[206] Often laid over the sopera are necklaces known as collares, again representing a particular oricha.[207] On the altar, the sopera will be arranged in a descending hierarchy depending on which oricha each is dedicated to, with that of Obatala at the top.[208] Many altars contain few or no anthropomorphic depictions of the oricha,[209] although will often include objects associated with them;[197] a wooden axe for Changó or a fan for Ochún, for instance.[206] Creating these altars is deemed expensive and time-consuming.[206] Material may be selected based on the tastes of the adherent; anthropologists have observed practitioners who have included Taoist figurines[210] or statues of wizards,[211] on their altars. Food and flowers are often placed on the altar as offerings.[212] Although rarely included on their altars, practitioners will often have statues of Roman Catholic saints elsewhere in their homes.[211] In addition to their altar to the oricha, many practitioners have altars set aside for the spirits of the dead.[213] These typically consist of a white-covered table known as a bóveda,[214] something derived from the White Table of Spiritism.[215] Bóveda often feature photographs of deceased relatives, to whom offerings are given;[216] popular offerings for the spirits of the dead include seven glasses of water,[127] a cafecito coffee,[217] and the aguardiente liquor.[218] Alternatively, many practitioners of Santería—like those who follow Palo—will have a rinconcito (\"little corner\"), a small area in which they collect together assorted objects, often those typically found in a household, as a material manifestation of the dead. Offerings to the dead may be placed here.[219] Many practitioners will also enshrine their family ancestors under the bathroom sink. This location is chosen so that the ancestors can travel between the realms of the living and the dead via the water in the pipes.[215] Offerings and animal sacrifice [edit]Offerings are called ebbó[220] (or ebó),[221] and are given to the oricha, ancestral spirits, to a person's own ori, and sometimes to the earth.[222] These offerings can consist of fruit and other foodstuffs, liquor, flowers, candles, money, or slaughtered animals.[223] Divination is often used to determine the exact nature of the offering;[224] initiates are supposed to provide offerings on a regular basis, and at least once a year.[225] Given to strengthen the supernatural forces, to thank them, or as a supplication,[226] they help form a reciprocal relationship with these entities in the hope of receiving something in return.[227] If this fails to materialise, practitioners may resort to several explanations: that the details of the ritual were incorrect, that the priest or priestess carrying out the rite lacked sufficient aché, or that the wrong ebbó was provided for the situation.[228] Animal sacrifice is called matanza,[229] or sometimes ebó eyé,[230] with the person carrying it out termed the matador.[231] This is usually a man,[232] with menstruating women prohibited from involvement.[136] Birds—including guinea fowl, chickens, and doves—are commonly sacrificed, usually by having their throats slit or their heads twisted and ripped off.[233] For rituals of greater importance, sacrifices are often of four-legged animals.[76] Some practitioners describe the killing of animals as an acceptable substitute to human sacrifice,[234] and in Cuba there have been persistent rumours of children being sacrificed in Santería rites.[235] The oricha and egun are believed to \"eat\" the blood of the victim;[236] the latter's lifeforce is deemed to transfer to the oricha, thus strengthening its aché.[237] An animal that struggles to avoid being killed is sometimes understood as having particular strength which will then pass to the oricha.[237] Once killed, the animals' severed heads may be placed on top of the sopera belonging to the oricha to which the sacrifice has been directed.[238] After the carcass has been butchered, some of the organs—known as acheses—may be cooked and offered to the oricha;[239] other parts will be eaten by practitioners.[240] Some of the blood may be collected and added to omiero, an infusion of herbs and water.[231] Believed to contain much aché,[241] this liquid is used for removing malevolent influences and in ceremonies for baptising ritual tools.[231] Santería's animal sacrifice has been a cause of concern for many non-practitioners.[242] It has sometimes brought adherents into confrontation with the law,[243] as with the 1993 case of Church of the Lukumi Babalu Aye v. City of Hialeah, in which the U.S. Supreme Court ruled that animal cruelty laws targeted specifically at Santería were unconstitutional.[244] Initiation [edit]Initiation is known as kariocha,[246] \"making ocha\",[247] or \"making santo\".[248] A charge is levied for initiation;[249] this varies depending on the client, but is often equivalent to a year's wage.[250] Each initiation varies in its details, which are often concealed from non-initiates.[251] The initiate is known as an iyabó[252] or iyawó,[253] a term meaning both \"slave of the oricha\" and \"bride of the oricha\".[254] As well as the santero or santera overseeing the initiation ceremony, the event may be attended by an oyubona or oyugbona (\"one who witnesses\"), who acts as a secondary godparent to the new initiate.[255] The initiation process takes seven days,[256] plus two days of preparatory rituals.[257] During this preparation, a misa espiritual (\"spiritual mass\") will typically take place to gain the blessings of the ancestral egun, and an ebó de entrada (\"opening sacrifice\") will be made to the oricha or the egun.[258] Next comes the ceremonia del río (\"ceremony of the initiate\"), in which offerings are given to Ochún,[259] and the rompimiento (\"breaking\"), in which the oyubona takes the initiate to purify themselves in a river.[260] The rest of the initiation takes place in the igbodu,[261] where the initiate sleeps upon a mat on the floor for the seven days.[262] No one uninvolved in the initiation is permitted entry.[263] The initiate is given their own otanes,[264] as well as objects representing the warrior oricha.[265] They are also given beaded necklaces, known as collares[266] or elekes[267] (ilekes).[268] Each necklace is a different color associated with a specific deity.[269] During the prendición (\"pinning\") ritual, a heavy necklace known as the collar de mazo is placed on the initiate.[270] During the lavatorio (\"washing\"),[271] the initiate's head is bathed in omiero,[272] designed to rid them of any malevolent spirits attached to them.[76] Often, their hair will be shaved off.[273] On the día del itá (\"day of history\"),[274] usually the third day, the initiate will undergo the itá, a session with a diviner.[275] The diviner will reveal the initiate's Lucumí ritual name,[276] a praise name of the oricha that rules their head.[264] This name often incorporates elements indicating the initiate's tutelary oricha; devotees of Yemajá for instance usually include omí (\"water\"), while those of Changó often have obá (\"king\").[277] Next comes the asiento (\"seating\"),[48] or coronación (\"coronation\"),[278] which marks the point when the aché of the tutelary oricha is believed to literally enter the initiate's cranium.[107] The otanes of several oricha are placed to the initiate's head, culminating in those of their tutelary oricha.[279] An animal sacrifice usually follows, involving at least five four-legged animals and 25 birds.[280] The following day is el Día del Medio (\"the middle day\"), when guests—including the initiate's family and friends—pay homage to them.[281] It includes drumming and a feast.[281] On the seventh day of the initiation, the new initiate leaves the ilé and visits the marketplace, where they make offerings to Eleguá and steal something small, also as an offering to Eleguá.[282] The initiate can finally take their otanes home.[283] They may then undergo a year-long period, the iyaworaje (\"journey of the iyawo\"), during which they must observe certain restrictions, the nature of which depends on their tutelary oricha.[284] This may for instance include abstaining from sexual intercourse, wearing only white, or not cutting their hair.[285] The iyaworaje ends with the ebó del año ceremony.[286] Once this is done, they may lead rituals and help initiate others.[287] Thenceforth, they will celebrate the annual anniversary of their initiation, their cumpleaños de santo (\"birthday in the saint\").[288] Although a largely orally-transmitted tradition,[289] santeros and santeras often emphasise teaching in a non-verbal manner, encouraging their initiates to learn through taking part in the ritual activities.[290] Since at least the 20th century, some initiates have kept libretas, notebooks in which they have written down material relevant to the practice of Santería.[291] These may be shared with their own initiates or kept private.[292] Toque de santo [edit]Santería's main public ritual is a drumming ceremony called the toque de santo,[293] or tambor.[294] Lasting for up to several hours,[295] this is usually seen as an offering to the oricha, performed to gain their favor.[114] The goal of the rhythms and songs is to summon the oricha to earth,[296] at which point they can possess one of the participants.[297] It is believed that the collective energy built up by the group is necessary in achieving this.[298] In turn, the oricha are believed capable of soothing the grieving, healing the sick, blessing the deserving, and rebuking those who have behaved badly.[114] The toque de santo uses double-headed drums called batá;[299] these are deemed sacred,[300] and are sometimes regarded as the central symbol of Santería.[301] There are multiple types of batá: the iyá is the largest, the itótele is smaller, and the okónkolo is the smallest.[302] For ceremonial purposes, these drums must be wooden; adding metal elements could offend Changó, who is associated with wooden artefacts, because of their links with his enemy, Ogun.[303] They may however have brass bells associated with Ochún, known as chaworo, affixed to their rim.[304] Each ceremonial drum has to be \"born\" from an existing example, the latter constituting its \"godfather,\" and in this way they form lineages.[305] Before being used in ceremonies, these drums are baptized, after which they are referred to as a tambor de fundamento.[306] This baptism entails washing the drums in omiero, making sacrifices to Osain, and affixing an afoubo, a small leather bag containing items including a parrot feather and glass beads, to the interior of the drum.[307] Practitioners believe that the consecrated batá contain a substance called añá,[308] itself an avatar of Ochún,[304] and a manifestation of aché.[309] Many drummers avoid mentioning the añá in public and may not refer to it by name.[304] Drums which have"
}