{
  "url": "https://dictionary.cambridge.org/dictionary/english/good",
  "title": "GOOD | English meaning - Cambridge Dictionary",
  "text": "good adjective (PLEASANT/SATISFACTORY) - goodIt's a good film overall. - enjoyableWe had an enjoyable time with Bob and Helen. - pleasant The weather is pleasant but not too hot. - interestingThe history of the place was really interesting. - niceHave a nice day! - You'll like Rosie - she's good company. - Such a noisy environment was not conducive to a good night's sleep. - The empty roads make this area good cycling country. - The good thing about the bike is that it dismantles if you want to put it in the back of the car. - I was having such a good time I was reluctant to leave. - (as) good as gold idiom - all is well idiom - at the best of times idiom - be off the hook idiom - be the last word in something idiom - better - cut - gold standard - heteronormative - high-quality - knock something into a cocked hat idiom - leave someone/something in the dust idiom - miles idiom - second - sound - super good - topper - unexcelled - unsurpassed - up your game idiom good adjective (HIGH QUALITY) - goodBuy a really good foundation and cultivate a healthy glow. - good/high qualityWe have a real commitment to high-quality ingredients. - qualityWe are working hard to produce a quality product. - fineThey have a well-stocked cellar full of fine wines. - superiorThe food and service here are superior to any other restaurant in the city. - Her work is sometimes good, but the problem is she's not consistent. - We need someone who can write good copy for our publicity department. - With a good telescope, you can see craters on the moon. - It's important for children to get a good education. - The design is so good it's sure to set the pattern for many others. - (as) good as gold idiom - all is well idiom - at the best of times idiom - be off the hook idiom - be the last word in something idiom - better - cut - gold standard - heteronormative - high-quality - knock something into a cocked hat idiom - leave someone/something in the dust idiom - miles idiom - second - sound - super good - topper - unexcelled - unsurpassed - up your game idiom You can also find related words, phrases, and synonyms in the topics: good adjective (SUCCESSFUL) - a head of steam idiom - achiever - alive - alpha female - alpha male - arrive - ascendant - crest - good with someone/something - greatest hits - have (got) it made idiom - have something in your pocket idiom - have the world at your feet idiom - rail - smash - storming - successful - successfully - superachiever - superhit good adjective (KIND) - goodShe is a good woman who goes out of her way to help others. - virtuousI believe that humans are, despite their flaws, capable of virtuous conduct. - righteousHe refused to stray from the righteous path. - honestHe was a hardworking, honest family man who was only trying to do his duty. - upstandingI’m sure most of them are honest, upstanding members of society. - kindYou'll never meet a kinder person. - niceHe's such a nice guy. - sweetShe's the sweetest little girl in the whole class. - good toJay's mother has been very good to us. - good-heartedHe's a good-hearted kid who loves to help out. good adjective (MORALLY RIGHT) - altruism - angel - angelic - angelically - be as pure as the driven snow idiom - justifiable - justifiably - justified - justified in something/doing something - loftiness - rightfully - rightly - rightness - saintly - the road to hell is paved with good intentions idiom - uprightly - uprightness - upstanding - virtuous - virtuously You can also find related words, phrases, and synonyms in the topics: good adjective (POSITIVE) - (as) good as gold idiom - advantageous - advantageously - all-singing - amiss - fecundity - fodder - fodder for someone/something - foil - fruitfully - non-expendable - non-frivolous - non-productive - not to be sniffed at idiom - pay dirt - versatile - versatility - viability - viable - wholesome You can also find related words, phrases, and synonyms in the topics: good adjective (BEHAVIOUR) - well behavedOur kids are normally well behaved. - goodBe a good girl and sit quietly. - as good as goldThe babysitter said Arlo had been as good as gold. - angelTeddy is a little angel. - obedientHe always tried his best to be an obedient son. - I'll just have to take you home if you can't be good, children. - Settle down now, that's a good dog. - You've been such a good girl this morning - I'm very proud of you. - You are Year 5 now - surely you can be good for just a few minutes while your teacher is called away! - He was always a good child and never any trouble. - (as) good as gold idiom - angelically - be on your best behaviour idiom - behave - breeding - child - demure - demurely - demureness - do a good deed - example - gracious - non-disruptive - polite - rail - set an example idiom - stay on the rails idiom - super good - well mannered - well spoken You can also find related words, phrases, and synonyms in the topics: good adjective (SUITABLE) good adjective (LARGE) - bigThey live in a big house in the country. - largeA large number of people were crowded into the room. - greatThe party was a great success. - enormousThey bought an enormous house in the suburbs. good adjective (SATISFACTION) - accha - achha - amen - amen to that idiom - beggar - couldn't agree more/less idiom - fair - hear - I don't mind if I do idiom - indeed - point taken idiom - should - size - very - why - why not...? idiom - wilco - will do idiom - yass - you can say that again! idiom You can also find related words, phrases, and synonyms in the topics: Idioms good noun (THINGS) good noun (HELP) good noun (HEALTH) - (as) good as gold idiom - advantageous - advantageously - all-singing - amiss - fecundity - fodder - fodder for someone/something - foil - fruitfully - non-expendable - non-frivolous - non-productive - not to be sniffed at idiom - pay dirt - versatile - versatility - viability - viable - wholesome You can also find related words, phrases, and synonyms in the topics: good noun (MORALLY RIGHT) - altruism - angel - angelic - angelically - be as pure as the driven snow idiom - justifiable - justifiably - justified - justified in something/doing something - loftiness - rightfully - rightly - rightness - saintly - the road to hell is paved with good intentions idiom - uprightly - uprightness - upstanding - virtuous - virtuously You can also find related words, phrases, and synonyms in the topics:"
}