{
  "url": "https://www.catholichousing.com/housing/st-andrew-towers/",
  "title": "St. Andrew Towers I - Catholic Housing Management",
  "text": "St. Andrew Towers I Located in Coral Springs, this community has 219 apartments ranging from studio and one-bedroom. Located next to St. Andrews Catholic Church. Within walking distance to shopping, parks and a performing arts center. This community is located in a residential neighborhood tucked along palm-tree-lined streets. Step 1 See if you are eligible Step 2 See if community is accepting pre-applications Step 3 If eligible, submit the pre-application Eligibility Requirements 62 years or older. Mobility/hearing/vision impaired available based on availability. Section 8 NO Minimum Income Limit. Maximum Income Limit 1 person: $48,420 2 Persons: $55,320 Non-Section 8 only Minimum Income Limit $23,463 (Studio) $25,608 (1 Bedroom) per unit Tax Credit Set Aside 1 30% Income Limit Maximum Income Limit $24,210 (1 person) $27,660(2 persons) Tax Credit Set Aside 2 60% Income Limit Maximum Income Limit $48,420 (1 person) $55,320 (2 persons) Tax Credit Set Aside 3 80% Income Limit Maximum Income Limit $64,560 (1 person) $73,760 (2 persons) Application Details The waitlist is not open at this time. Please check back at a later date. Amenities FAQs Following the U.S. Department of Housing & Urban Development (HUD) guidelines, the Tax Credit and other program requirements for eligibility includes: being 62 years of age or older, meeting income guidelines. However, some properties accept mobility, hearing and visually impaired individuals that are below 62 years of age as well. Rents for some of the apartments are 30% of a person’s adjusted gross income, while others are flat rents for low income families, Check your eligibility now. Most HUD subsidized communities listings do not have published rates. They are based on 30% of the renter’s adjustable gross income. Other rents are published in the Florida Housing website on an annual basis by program type. You will need to contact the community to determine if you qualify for income based rent. Your Preliminary Application confirms preliminary eligibility for the program and that you meet all qualifications before you join our waiting list. The demand for rent-adjusted, lower-income housing greatly exceeds the limited supply. By pre-qualifying each applicant, we make sure everyone on our waiting list is legally able to apply under the federal Housing and Urban Development (HUD) rules and other program requirements. This makes your final application and all other paperwork much smoother and faster for you if/when an open unit becomes available. Your final application gathers more required information for eligibility verification purposes. Yes. You will receive a letter from our community(ies) that shares your pre-application status either way (approved or denied). The letter will also request that you contact us if there have been any changes since you submitted your Pre-Application information, and will give you an opportunity to appeal the decision if anything changed. Someone from the community team will contact you within 14-30 days after receipt of your completed Pre-Application. To avoid delays or mistaken denials, please check your information very carefully before you submit it to make sure all areas are completely filled out and there are no errors. Once your pre-application is approved you will either be added to a lotto drawing and advised weather or not your pre-application is randomly selected to be added to our waiting list or you will be added based on the date and time of the pre-application if the lotto drawing has already been conducted and pre-applications are still being taken. Contact Information Address: 2700 NW 99th Avenue Coral Springs Fl, 33065 Phone: 954-752-3960 TTY: 800-955-8771 Email: housing@chsfla.com"
}