{
  "url": "https://icriforum.org/4gbe-2025/",
  "title": "84% of the world’s coral reefs impacted in the most intense global coral bleaching event ever | ICRI",
  "text": "The most intense global coral bleaching event on record is still ongoing, according to scientists. One year on from the official declaration of the fourth global coral bleaching event by the International Coral Reef Initiative (ICRI), bleaching alerts continue to develop across the world. From 1 January 2023 to 30 March 2025, bleaching-level heat stress impacted 84% of the world’s reefs, with 82 countries, territories and economies suffering damage. During the first global coral bleaching event in 1998, 21% of reefs experienced bleaching-level heat stress, rising to 37% in the second event in 2010 and 68% during the third event (2014-2017)1. Scientists called the fourth global coral bleaching event “unprecedented” as early as May 2024, and a widely-used bleaching prediction platform had to add three new levels (Levels 3-5) to their Bleaching Alert Scale to indicate the heightened risk of mass coral mortality. The previous highest level, Level 2, indicates risk of mortality to heat sensitive corals; Level 5 indicates the risk of over 80% of all corals on a reef dying due to prolonged bleaching. “We know coral bleaching is accelerating as our oceans warm, driven by the world’s continued reliance on fossil fuels. As an atoll nation, we see our reefs damaged and livelihoods threatened. We must urgently end the fossil fuel era and transition to a just, sustainable future powered by clean energy. Our oceans and the communities that depend on them cannot wait”. President Surangel Whipps Jr., President of Palau Corals bleach when environmental stressors such as heat cause them to expel the colourful, energy-producing algae that live inside them, leaving them white. If conditions return to normal quickly enough, corals can regain their algae and return to health. However, if the water stays too hot for too long, corals die. The main cause of large-scale coral bleaching events is higher ocean temperatures. Last year was the hottest on record and the first to reach over 1.5°C warmer than pre-industrial times, due to human-induced climate change. This contributed to record-breaking ocean temperatures, and triple the previous record number of marine heatwaves around the world. “There are many reasons for the demise of coral reefs; but let’s not beat around the bush. Corals are bleaching and dying primarily because the Ocean is warming at an alarming rate, as evidenced by the sheer scale of this Fourth Global Bleaching Event. The Ocean is warming primarily because of accumulating greenhouse gases emitted by humankind’s ongoing burning of fossil fuels. In short, if we want coral reefs to survive, we must drastically reduce our emissions and keep global warming to below 1.5 degrees Celsius.” Ambassador Peter Thomson, United Nations Secretary-General’s Special Envoy for the Ocean Coral reefs are not just beautiful. About a third of all known marine life relies on reefs, and one billion people benefit from them directly or indirectly. Coral health has far-reaching impacts on the global economy, as reefs provide $10 trillion in benefits like food, jobs, and coastal protection. Unfortunately, live coral cover is estimated to have halved since the 1950s, with the Global Coral Reef Monitoring Network (GCRMN), an operational network of ICRI, evidencing a 14% decline from 2009 – 2018, due to a combination of local environmental damage and global climate change. Ensuring the health of the entire oceans, not just corals, would cost less than 2% of this sum. Losing coral reefs undermines efforts to achieve sustainable development, alleviate poverty, and ensure food security; climate-change induced coral loss could cost $500 billion annually by 2100. “The fact that this most recent, global-scale coral bleaching event is still ongoing, takes the world’s reefs into unchartered waters. In the past, many coral reefs around the world were able to recover from severe events like bleaching or storms. We need to continue to observe and measure if and how reefs will recover and change, to help inform the combination of conservation measures most suited for a particular reef.” Dr. Britta Schaffelke, Australian Institute of Marine Science, Australia; Coordinator of the Global Coral Reef Monitoring Network (GCRMN) Although corals are in danger, through a combination of rapidly addressing local and regional drivers of loss, and implementing local conservation measures can still help them to survive the 21st century. Local solutions including well-planned coral restoration, reducing pollution, stopping overfishing, and selective breeding of corals can increase reef health and improve the resilience of reefs to hotter ocean temperatures. The ICRI has developed eight key policy asks to guide the urgent action needed, and experts estimate that spending on corals needs to increase sevenfold. Additionally, limiting global warming to as little above 1.5°C as possible is necessary to give these coral conservation measures a chance to work. Current climate plans put the world on track for approximately 2.7°C of warming. In the face of these challenges, we still have a window in which to stop the “rainforests of the sea” from disappearing altogether. By conserving, protecting, and restoring coral reefs, we can ensure that future generations inherit a world with thriving oceans. “Coral reefs are humanity’s canary in the coal mine for much more than just climate change. What we choose to do to save them, from both climate change and from overconsumption in our economies, will determine their future and affect all life on earth, and everybody’s quality of life to the end of this century and beyond. ” Dr. David Obura, Founding Director of CORDIO East Africa"
}