{
  "url": "https://wearecasa.org/",
  "title": "We Are Casa – WE HELP BUILDING POWER AND IMPROVING THE QUALITY OF LIFE IN LOW-INCOME IMMIGRANT COMMUNITIES",
  "text": "After 40 years of growth, CASA is entering a bold new chapter. We are embracing a renewed identity rooted in reinvestment, reinvention, and collective power — We Are CASA. Kilmar Abrego Garcia, a father, husband, union member, and beloved member of our community, has returned to his family after a nationwide fight for justice. We are grateful to YOU who showed up, prayed, rallied, and refused to stay silent. UPDATE: On June 27, the Supreme Court issued a new decision on the birthright citizenship case. For the next 30 days, June 27- July 27, 2025, babies born to immigrant parents will continue to be recognized as U.S. citizens. After 30 days, lower courts will have to decide whether the Birthright Citizenship Executive Order can go into effect for some babies. CASA is immediately taking action to continue to defend the citizenship of all children born in the U.S. after 30 days – including by filing a class action lawsuit. Here are the most important things to know: The Birthright Citizenship Executive Order continues to be blocked for 30 days, beginning on June 27. The Supreme Court said that the Executive Order would not take effect for 30 days. So children born in the United States for the next 30 days, until July 27, 2025, will continue to be recognized as U.S. citizens. In the cold, early morning hours a year ago, Baltimore’s Key Bridge came tumbling down, taking with it the lives of six remarkable immigrant men. We honor them and embrace their families. CASA builds grassroots community defender networks, amplifies immigrant voices, and takes bold action to protect our rights, our democracy, and our future. En tant que président des États-Unis, Donald Trump s’est engagé à mettre en œuvre des politiques d’immigration dures et injustes, y compris des expulsions massives. Apprenez à vous protéger et à protéger votre famille. Aprenda a protegerse a sí mismo y a su familia en frente del plan de inmigración dura e injusta del presidente Trump. We are a people who have faced incredible challenges and we are still here. We have confronted unspeakable circumstances to bring our families to a place where we can thrive. Fear has not broken us before – and it will not now."
}