{
  "url": "https://www.reddit.com/r/PhasmophobiaGame/comments/o97w2m/phasmophobia_massive_guide_tips_tricks_clearing/",
  "title": "Reddit - The heart of the internet",
  "text": "Phasmophobia - MASSIVE Guide - Tips & Tricks + Clearing Up Misconceptions for New and Intermediate Players Phasmophobia - MASSIVE Guide - Tips & Tricks + Clearing Up Misconceptions for Newer and Intermediate Players If you want the Steam version of my guide so you can have it favorited/saved and open while playing, here's the link to it. If you'd like to play with me, come join my Discord community server! NOTE: This guide does come with many spoilers for the game's mechanics, so if you prefer to learn the game's quirks by yourself through experimentation, feel free to skip over this guide. As you may know, Phasmophobia is a game in which you can learn something new every day. It has lots of quirks and equipment that all have varying traits and abilities. Today, I want to share some of the knowledge I have about the game and the equipment as well as some general tips and tricks so you can better prepare yourself for future ghost hunts. I will add anything else I remember or learn as time goes on. If you believe or know any of the following information is wrong, please leave a comment and I'll edit it if I think it needs correcting. I encourage the community to add onto the findings in this guide. Equipment Tips & Tricks Candles - Candles burn out on their own after a while. This doesn't necessarily mean the ghost blew them out. If you see a candle has been extinguished, don't immediately assume you got the \"ghost blowing out candle\" objective. Double-check the objective board. - Candles can halt sanity loss when actively held and lit. For proof, light a candle, bring the lighter, and bring a flashlight. Stand inside for a few minutes while keeping the candle lit at all times. When you go back to the truck, your sanity should be the same as it was a few minutes ago. Crucifixes - The crucifix is an invaluable tool for preventing hunts in a 3-meter radius around it. Some wonder how much \"3 meters\" actually is since there's no UI that tells you. Here's a video that should help you with that. As you can see, the crucifix has a considerable range (much bigger than you thought). Visualize this range in your mind when placing a crucifix in rooms. Ideally, you want to try and place it in the center of a room if you're in a small room and near the spots of highest ghost activity in a large room. - The 2nd crucifix should be placed at a distance away from the 1st one. This is to ensure you get maximum coverage. Just remember that if you place the other crucifix exactly 3 meters away, the range \"circles\" will overlap between them. Again, the best thing to do is visualize the distance from the video linked above and place it accordingly. Be sensible with your crucifix placement. - If the ghost room is small, usually what I do is place a crucifix in the center of the room and a crucifix in the hallway leading to it. - Unless the ghost is chain-hunting and barely wanders outside of its room, try not to place both crucifixes in the room if it's a small room. Again, space them out. - When the ghost you're dealing with is a banshee, the range of a crucifix increases from 3 meters to 5 meters. Watch the video again. Visualize two-thirds of the crucifix's radius being added onto the end of the current radius. That's the new radius of effect for a crucifix should you be facing off against a banshee. Adjust your crucifix placement accordingly. EMF Readers - EMF readers are location-based, not direction-based. You can stand in one spot with an EMF reader and do spins and it won't take the reading away. - EMF 2 means the ghost opened a door, knocked on a window, flipped a light switch, etc. There's a few other interactions you can read about here. - EMF 3 means the ghost threw an object. - EMF 4 means the ghost manifested itself. - An EMF Reader has a 1 in 4 chance of giving an EMF 5 reading when it detects EMF 2 or EMF 3 activity. EMF 5 can only be given by ghosts that have EMF 5 as an evidence piece. - EMF 5 does not mean danger, so don't panic as soon as you see it. It just means that an EMF 2 or EMF 3 reading had a 25% chance of being replaced with EMF 5 and it succeeded. - You can also use an ouija board's interactions to possibly get EMF 5 since an ouija board interaction counts as EMF 2. Ghost Writing Books - You don't need to ask the ghost if it can write in the book for it to write in the book. The ghost writing in the book can happen entirely at random, even when no one's in the house. - Here's a very useful trick that not many players seem to know about (and probably one of the most useful in this guide): If you're holding a ghost writing book and look directly down and drop it (NOT place it), you will make the book stand up vertically with the pages facing away from you (assuming the surface below you is flat). How is this useful? If you place both books next to each other in this manner and place a video camera facing the books, you can now observe both books from the safety and comfort of your van. No, the book standing up does not prevent the ghost from writing in it. Yes, this trick is very useful and should be done more often, in my opinion (even more so than simply placing the book down in a room). - Following the above technique, I also recommend putting an EMF reader between the books and the camera so you can get an EMF reading when the ghost interacts with the books. You can also pile household items (not equipment) near the EMF reader (while keeping it in front of the camera) and if it interacts with something, you will immediately get an EMF reading that you can see from the van. Head-Mounted Cameras - Head-mounted cameras can detect ghost orbs much like regular video cameras. - When holding an item in your hand, the camera tends to be pointed a bit to the right of where you're looking, so when on observation duty for someone in the truck, look a little bit to the left of where you want to look so the camera lines up correctly in the truck. Optionally, drop whatever item you're holding for the time being and you will look straight ahead. Lighters - If you have the lighter lit up, you can use it to light a candle in another person's hand by clicking F on it while looking at it. Photo Cameras - You have 15 total possible photos (3 cameras, 5 photos each) but only 10 slots in your journal. These 10 slots' photographs and their evidence type (ghost, interaction, ouija board, fingerprints, etc.) and quality (★, ★★, or ★★★) determine your monetary reward at the end of the mission. However, why are there 5 extra photos available, then? It's mainly because of the \"capture a photo of the ghost\" objective. If you've filled up all 10 slots but still have 5 photos left, you still have 5 chances to take a photo of the ghost and it will count towards the objective (but not the monetary reward at the end). - Taking a photo through a window or door will not count towards photo evidence UNLESS the camera specifically clips through the door or window. If you're outside and you're a PC player, you most likely won't be able to get a photo of the ghost through the window unless you can stick your hand through somehow. - If you're in chain-hunting territory and you just need a ghost photo for an objective, you can take a simple 1-star ghost photo at a safe distance and run away or hide afterward. It's better to live and keep all your earned cash than die for a close-up 3-star photo and lose most of it. - (From u/Fantismal) Photos don't give you set $ amounts. They give you points. Once you hit a certain threshold of points, you get another $5 in photo money. $40 is the max amount. At 3-stars: Ghost photo = 100 points (1 only), Bone = 70 points (1 only), Ouija = 60 points (1 only), Fingerprints = 50 points (unlimited), Interaction/footprint = 40 points (unlimited), Dirty water/dead body = 30 points (unlimited), 0 points = $0, <50 = $10, <100 = $15, <200 = $20, <300 = $25, <400 = $30, <500 = $35, 500+ = $40. Salt - Place salt in and/or near the ghost room and also in chokepoints (like doorways). Ideally, spread the salt around so you can better detect the ghost's roaming pattern. If it steps in certain salt piles but not others, that means the ghost is roaming through those specific areas and generally not going to the others. - Ghosts do not walk in salt while hunting, only while roaming. Sanity Pills - If you haven't figured out what the ghost is yet and/or need time to \"witness a ghost event\" as an objective but one of your objectives is the \"25% average team sanity\" objective, you can still take sanity pills and come back to that task later. Getting to 25% first and then trying to witness a ghost event exposes you to more hunting. The better idea is to witness the ghost event first and then go down to 25% sanity. - If you're waiting to drop your average team sanity to 25% but want to do it safely, you have a few options. If it's a small map, you can simply wait at the entrance doorstep and walk out when the door begins to close and the hunt starts. If it's a big map, you can simply wait at the entrance doorstep as I mentioned above OR on the other side of the building, away from the ghost. - In reference to the above tip, you only count as \"inside\" if you can hear the building's ambient air noise. Your sanity will not drop if you're outside. - Sanity pills restore 40% sanity to your character, so maximize its usage by only taking it when you have 60% (or less) sanity at most. Sensors - Place all motion sensors at head level or below. Don't place them above head level or it may not catch the ghost's movement. - The sound sensor has a large square detection radius (unlike the motion sensor). For this reason, it's best to place it such that it covers a large area of the map. You can see the area it covers on the map in the truck. Place them around at equal distances and you can monitor a very large area of the map with ease. Smudge Sticks - To repel the ghost with a smudge stick, you must be within \"heartbeat\" range of the ghost for it to work (think within the range of a crucifix such as in the above-linked video). Also, once lit, throw it directly at its feet or in its walking path. Try not to throw it while it's on stairs as it tends to be finicky and not work sometimes. - Be careful not to touch smudge sticks with a lit candle as it can accidentally light them, thus using them up. I've witnessed this being done a couple of times on accident. - Careful not to confuse the smudge stick's smoke with ghost orbs on the video cameras. They look very similar. Remember that ghost orbs are usually singular orbs that slowly float around. Smudge stick smoke appears in big clusters and disappears quickly. - The smudge stick's effect has a reach of 6 meters around you. For reference, the crucifix is 3 (as shown in the video linked above). According to the wiki page, it will only check if the ghost is within 6 meters when it's first lit and when it goes out. This means you have to be within 6 meters of the ghost either when you first light the smudge stick or when it becomes extinguished. - There is currently a bug where when you light a smudge stick during a hunt only, its effect is applied in the standard radius around every player in the game regardless of position. This means if you're in the van and you see a person getting tailed by the ghost via camera, you can light a smudge stick in the truck and it will smudge the ghost if it's close enough. The same person who made the crucifix video made a video on it. Spirit Box - You must be either within 3 meters of the ghost or in the same room as the ghost to get a response. - If the ghost is an \"everyone\" ghost, it doesn't matter if you're in the room alone or with others to get a response. If it's an \"alone\" ghost, you must be alone in the room for it to respond. Thermometers - A thermometer is arguably the best tool for finding the ghost room in the initial sweep. Whereas an EMF reader requires a ghost interaction that's nearby, a thermometer gives you a temperature reading of a general area, and once you know the general temperature range for a ghost room, you'll be finding the ghost rooms in no time. - The coldest a NON-FREEZING TEMPERATURE ghost can make the ghost room is 5° Celsius with a ∓ 2° C error range on the thermometer, meaning that on the thermometer, the coldest reading you would get for a non-freezing ghost room is 3° C. This means that if you EVER get a reading of 2.9° C or lower, you can immediately assume it's a ghost with freezing temperatures (which is an evidence piece). If you ever see frozen breath, this will confirm it for you. Sometimes, frozen breath doesn't appear, though. However, the thermometer is still plenty reliable. - Speaking of temperatures, I highly recommend setting your thermometer's unit of measurement to celsius in the game settings. Not only do most players use celsius anyway, but the number range is much tighter and easier to interpret than fahrenheit's. You can very clearly tell when a ghost is a freezing or non-freezing ghost when using celsius. Tripods - The tripod physically doesn't tip over (a built-in mechanic for the tripod only), so you can sometimes place it on elevated surfaces to get a unique angle on a room. PC players may not be able to do it as often because it depends on where you stand when placing and you can only do it with certain surfaces, but VR players can do so with ease. UV Lights & Glowsticks - If you want to leave your UV light shining up onto a specific door, you can look straight up in the air and press G to drop it. It will land light-side up (hah) and you can keep track of whether a door has fingerprints or not in this manner without needing to grab the light. - With that said, leave the door slightly ajar such that the ghost would have to touch the door to move through. This ensures that the ghost actually touches the door and you can immediately check for fingerprints should it do that. - In general, make sure you close doors so the ghost is forced to touch doors and open them in order to pass through. A lot of people search rooms during the initial sweep phase and then leave the door wide open. This is a mistake. - Check BOTH SIDES of the door a ghost has touched for fingerprints. - Nearby windows and light switches can also have fingerprints, so make sure to check those using a UV light as well. - Both thumbprints and handprints (which both counts as fingerprints) yield the same reward when photographed. - You do NOT need to shine the UV light on fingerprints to take a photo of them. If you know exactly where fingerprints are, you can simply take a photo of the spot with the photo camera and it will count. - While a glowstick's main use is to mark certain locations on the map for utility purposes, it can also be used as a short-range UV light. You can use it to detect fingerprints on doors and windows as well as put them near salt piles to detect footprints. Video Cameras - If a ghost happens to be in a hallway, set up tripods for the hallway and all surrounding rooms. You might not catch ghost orbs in the hallway, but you may catch them in a nearby room. There have been times where, for example, a ghost was wandering around a lot in the left hallway in downstairs Ridgeview but it was actually haunting the bathroom. If the ghost is a wanderer, it may fool you on its actual ghost room location. BONUS: Ouija Boards - The ouija board questions, \"Where are you?\" and, \"What's your favorite room?\" yield the same results and are location dependent. This means that asking either question will actually give you the same result and give you the current location of the ghost, NOT the location of the ghost room. Yes, this includes the latter question. You can test this yourself by asking what the ghost's favorite room is a handful of moments after hunting begins and if it's away from the ghost room, it will definitely give you its current location in the house. Insym actually did a video on this showcasing exactly that scenario. - The reason why the question works in your favor the majority of the time is because the ghost typically hangs around in its ghost room, anyway. - If you're going to take photos of the ouija board and your interactions with it, bring it to the main entrance door and leave it right next to the door's archway. This way, you can ask questions and take photos and if a hunt starts and the door begins to close, you can simply walk backwards and out if you're quick enough. - When taking photos of the ouija board using the photo camera, the first photo you take will be marked as \"ouija board\" in the journal. From there, every time you ask a question and it successfully responds and the planchette is moving, you can take a photo of the ouija board again for an interaction photo. One currently-being-answered ouija board question counts as an interaction photo. - For taking back-to-back interaction photos of the ouija board, the best questions to ask are \"How old are you?\" and \"How many people did you kill?\". The reason for this is that both will yield number results only, thus speeding up the process. If you ask where it is, it'll take really long to fully answer. - You may be wondering: Why not just ask \"How old are you?\" or \"How many people did you kill?\" over and over instead of alternating? The reason is that sometimes, the ghost will give you single-digit answers. For example, if you ask how old it is and it responds with \"9\" and you successfully ask again, you won't know if the game simply didn't pick up your question or if it actually answered because it'll stay on 9. That makes taking an interaction photo difficult. For that reason, it's best to alternate between the questions. Ghost Tips & Tricks General - Typically around 50% sanity is when most ghosts start hunting, with 60% for mares when the lights in the ghost room are off, 70% for demons, and anything for a banshee should it use its ghost ability. - A wraith, phantom, and banshee can all travel to a random player's location even if they're not near the ghost room. This can fool players into thinking the ghost room is nearby. - Ghosts drain sanity by 0.2% a second when looking directly at them. Phantoms and Yureis drains sanity twice as fast (0.4% a second) when looking directly at them. - Lay down salt for footprints when you hear the ghost making footsteps and wandering or when you see it physically manifesting and standing still. Spirit - Is smudged for 180 seconds [3 minutes] as opposed to 90 seconds [1.5 minutes] like other ghosts. - If you hear a ghost make a singular footstep sound and then another footstep sound 2 to 15 seconds later, it's a spirit. All other ghosts make footstep sounds 15 to 45 seconds later. This is a tested speedrunner technique for which I can confirm its authenticity. Wraith - Has an implementation to go through walls outside of hunts but not during hunts. - Ghost power allows it to teleport to a random player's location. - A wraith can disturb a salt pile but will not leave footprints (which are detected by UV lights). - Stepping in salt will increase its activity level for approximately 10 seconds. Phantom - Can wander to a random player's location anywhere. - Sanity drops twice as fast when looking at it. - If you take a photo of a Phantom, the ghost itself will not appear in the photo. This is a major clue that what you're dealing with is a phantom as it's the only ghost that can do that. - During a hunt, a Phantom will flash visible every 1 to 2 seconds as opposed to every 0.3 to 1 second for other ghosts, making it harder to take a photo of. Poltergeist - If you're within line of sight of items being thrown, you will lose sanity (the number of items thrown x 2 = % sanity lost). Banshee - If the target is in the building, the ghost will aggressively hunt the target. If the target isn't in the building, it will hunt other players as a ghost normally would. - Can wander to the target and will initiate a hunt if the target enters line of sight within 20 seconds. This is a rare ability. - Ignores typical ghost hunting and sanity rules. Can theoretically initiate a hunt as soon as the players enter the building assuming the target is inside. Jinn - When you find out it's a Jinn, turn off the breaker to disable its ghost power (the extra speed; unsure if it disables the 25% sanity loss ability). - Has a 25% chance to drop a player's sanity if they are within 3 meters. - Slows down when it gets within 4 meters of you. Mare - Can only hunt when sanity is below 40% if the lights in the current room are turned on and 60% if the lights are turned off. Ideally, turn on lights in and near the ghost room to lower the hunting threshold. - As of July 21st, 2021, Mares can no longer turn on lights, only turn them off. Revenant - You can use a video camera to observe the ghost's speed to see if it's a Revenant. You can also have a willing sacrificial participant during a hunt to test its speed which will confirm that it's a Revenant since only it can move as fast as it does. Shade - Shades still have a VERY LOW chance of hunting when multiple people are nearby. It's not outright impossible for a shade to hunt when more people are present. They still prefer to be active around alone people, though. Demon - Asking a successful question on the ouija board will not lower your sanity if what you're dealing with is a Demon. Yurei - As well as being able to drain sanity twice as fast, the Yurei can drain sanity during hunts if you are within 10 meters (debated whether it's only if it's within line of sight or not). - As of July 21st, 2021, Yureis now have a special ability to lower sanity similar to other ghosts. Oni - Activity will be greatly increased if there's more than one person in the room. Yokai - During hunts, it's presumed that the average hearing distance for a Yokai is approximately 2 meters, which is 2/3rds the range of a crucifix (use crucifix range video for reference). Hantu - Keep the breaker on at all costs. It will slow the Hantu down as much as possible. General Tips & Tricks - If something very abnormal happens in this game, always assume it's a hacker. If there's a hacker in the lobby, leave immediately to save your equipment if you put any in. The hacker may be able to kill you using their cheats and this will cost you your equipment. - Saying just the ghost's first name is sufficient in catching its attention. You don't need to say its full name. - On professional difficulty, the breaker will start turned off. This means that the entire building will be generally colder to begin with. After turning it on, wait about 30 seconds for the rest of the building to heat up so you can better tell where the ghost room is temperature-wise. Don't get excited with temperature readings as soon as you walk in unless the breaker has been on for some time. - When entering the house for the first time, stop and listen for a few seconds. You might hear doors opening or footsteps which can clue you in immediately to the ghost's location. - When the door is first unlocked, the ghost will start in its ghost room and then begin to wander from there. That is why the first few seconds of listening can be very crucial, especially if you're on a smaller map. - You don't have to turn off your flashlight during a hunt as the ghost cannot see your flashlight's light. - In multiplayer matches, the ghost cannot hear you if you have push-to-talk and you aren't holding down your mic button. A great way to test this is to wait for a hunt and sing Bohemian Rhapsody really off-key while not holding down the mic button. Unfortunately, the ghost will not immediately rush to your location to silence you. In fact, it'll keep going about its business. As long as you don't hold your mic button down and talk in-game, you're fine and can talk as much as you want in real life. - If you play solo, however, the ghost will be able to hear you no matter what, even if you don't hold down the push-to-talk key. - Equipment sounds such as the EMF reader and spirit box do not attract the ghost during the hunt, but players talking in the mic will. This includes whispering. - When the ghost is in a hunting phase, your goal should be to hide its line of sight with your head because it's actively shooting out rays to see if it can get a direct line with your player's head/upper body. This is why crouching behind furniture and ducking down low works for hiding a lot of the time. (The exact mechanics are debatable and might have been changed, but this is why hiding behind certain furniture works in theory.) - Certain maps such as prison and high school have big rooms that have glitched ghost orbs, most notably the cell blocks in prison and the library in high school. Sometimes, you may have trouble identifying any ghost orbs in these areas. Just be aware of that. - You can find fingerprints on the computer keyboards in the cell blocks in prison. - Don't ever turn the sinks on unless your first name is Harry or Marv. If the ghost is going to give dirty water, it'll do it on its own. You don't have to turn sinks on for that. Turning on sinks will simply mask other important sounds and serve as a distraction to players who thought the ghost turned on the sink. - Average team sanity is what determines the frequency of events and hunts, not individual sanity or whether they're in the building or not. A player with 100% sanity walking into a building when the rest of the players have 0% sanity and the average is 25% will experience just as much hunting frequency as if a 0% sanity player walked in. - Picking up the voodoo doll does not negatively affect you in any way besides simply taking away an inventory slot. You can gather all the voodoo dolls in one area for your photographer if you prefer. - Taking a picture of a disturbed salt pile will not count as evidence. Rather, the ghost must leave footprints (which can only be detected by a UV light and only lasts a few seconds). Footprints are not ghost evidence like fingerprints are. - The ghost can sometimes appear and interact with things outside of the ghost room. If you found a general area of ghost activity, that means it's where the ghost is generally roaming around. Just because it manifested in whatever spot you saw it in doesn't necessarily mean it's the ghost room. Remember: A ghost usually hangs out in and near its ghost room, but won't go beyond that unless it's hunting. As an extreme example, you won't find the ghost manifesting on the opposite side of a building if the ghost room is on the other side (unless it's a wraith, phantom, or banshee). - You may have heard people mentioning the \"bone\" whenever you enter a map. The bone is simply a small chicken bone that spawns in a random location on every map that you can optionally take a photo of and eat. It should be noted that eating the bone will give you extra cash and experience (as well as a case of indigestion). The bone isn't a top priority but can greatly reward you if found. - During the hunting phase, avoid spam-clicking or holding the radio (global chat) button. It masks the ghost's footsteps and makes it harder to hear where it currently is or where it's coming from, thus making it harder for players to relocate or capture a ghost photo safely. Conclusion These are many things I've learned in my time of playing this game and I still have much to learn. However, most of these are 100% factual and I guarantee learning these tips will help you out a lot in your future ghost hunts. With that said, if you have any information you would like to further elaborate on or correct, please leave a comment below. Happy ghost hunting! <3"
}