{
  "url": "https://www.the-sun.com/money/15856597/arbys-shuts-down-restaurants/",
  "title": "It's bye bye to Arby's restaurants after iconic American diner quietly confirms shutdowns - and doors are already closed",
  "text": "AN ICONIC fast food store has shut up shop for good. The announcement, which was made via a handwritten note in the window, is the latest in a long line of closures for the chain of stores in recent months. The closure comes as the fast food industry faces several struggles, including higher food prices and reduced footfall, which previously caused the chain to close several other stores in 2025. Arby’s, the fast food chain known for its roast beef sandwiches, has now closed its store in Loudoun County, Virginia. Other closures have taken place across California, New Jersey, Florida, Delaware, Maryland, South Carolina, Tennessee, and Washington in recent months. The store quietly closed this week is based in Dulles Market Square shopping center, which is still home to a McDonald’s, a laser tag venue, and other retailers. Read more in restaurants According to county property records, the Arby’s was built at that location in 2008 but will no longer trade after a staff member wrote a note in the window which simply read: “This store is now permanently closed.” No reason was given for the closure from the chain’s bosses. FLAGSHIP EXIT The Arby’s flagship location on Sunset Boulevard in California shut up shop for its main store back in June 2024, ending its 55-year reign. And others have also vanished from the map without any warning in recent weeks and months. Most read in Money The store has recently struggled with footfall as well, despite launching alongside a new McAlister’s Deli. Another Arby’s, this time in Kerrville, Texas, also suddenly vanished from the map at the end of last year. Word of the closure spread after a picture of a note in the window appeared in a local Facebook group. “Sorry for the inconvenience,” the sign said. “We would like to thank everyone who patronized our location throughout the years.” “Unfortunately, we have closed this unit permanently.” Locals were stunned when they discovered the doors had been locked for good in Virginia “If I had known that was my last Arby’s in town, I would have ordered more,” one user said in the comments section of the announcement of closure on local news site, The Burn. Another Arby’s has also closed in East Norriton, Pennsylvania as the brand continues its exit from a large part of its American market. The iconic signs out front have been covered or removed, and there are also notes on the doors here. “Due to the stores closure, this location will be permanently closing Sunday, January 11 at 7 pm,” it reads. “We are sorry for any inconvenience caused, please do be sure to visit us at other locations.”"
}