{
  "url": "https://www.newworldencyclopedia.org/entry/Aleppo",
  "title": "Aleppo - New World Encyclopedia",
  "text": "Aleppo Aleppo (Arabic Halab) is a city in northern Syria, the second largest city in Syria after Damascus, and one of the oldest inhabited cities in history. Originating in the early second millennium B.C.E., Aleppo competes with Damascus as being the oldest inhabited city in the world. Aleppo was the capital of the Amorite kingdom of Yamkhad during the Middle Bronze Age (c. 1800-1600 B.C.E.) and was the focus of the Hittites in their overthrow of the Amorite Dynasty in 1595 B.C.E. Aleppo occupies a strategic trading point midway between the sea and the Euphrates river. It was known in antiquity as Khalpe, Khalibon, and Beroea (Veroea). To the Turks it was known as Halep, and during the French Mandate it came to be called Alep. The main role of the city was as a trading place, as it sat at the crossroads of two trade routes and mediated the trade from India, the Tigris-Euphrates regions, and the route from Damascus in the South. In the third century C.E., Aleppo was the greatest center of trade between Europe and lands farther east. Although trade was often directed away from the city for political reasons, it continued to thrive until the Europeans began to use the Cape route to India, and later to utilize the route through Egypt and the Suez Canal to the Red Sea. Since then, the city has declined as a trading center. Its chief exports are the agricultural products of the surrounding region, mainly wheat, cotton, pistachios, olives, and sheep. Aleppo was selected as a UNESCO World Heritage Site in 1986, based upon two criteria: It bears an exceptional testimony to a cultural tradition or to Islamic civilization, and it is an outstanding example of architecture, illustrating a significant stage in human history. The UNESCO selection committee specifically cites Aleppo's collection of architecture from diverse cultures and civilizations, which \"all form part of the city's cohesive, unique urban fabric, now threatened by overpopulation.\" History The name Halab (Arabic for Aleppo) is of obscure origins. Some suggest that the word is related to the metals of iron or copper in Amorite languages, since it was a major source of these metals in antiquity. However, Halaba in Aramaic means \"white,\" possibly referring to the deposits of marble and whitish soil abundant in the area. Another frequently proposed etymology is that the word halab means \"gave out milk,\" relating to an ancient tradition that the Hebrew patriarch Abraham gave milk to travelers as they moved throughout the region. The color of Abraham's cows was reportedly ashen (Arab. shaheb), and therefore the city is also called Halab ash-Shahba. Because the modern city occupies its ancient site, Aleppo has been touched little by archaeologists. Occupied from early in the second millennium B.C.E., the city grew as the capital of the kingdom of Yamkhad under the ruling Amorite dynasty, until it was overthrown by the Hittites. This event appears in the Hittite archives in central Anatolia and in the archives of Mari on the Euphrates. The city remained under Hittite control until perhaps 800 B.C.E., when it was conquered by the Assyrians and later fell to the Persian Empire. It was captured by the Greeks in 333 B.C.E., when Seleucus Nicator renamed it Beroea. The city remained in Greek, or Seleucid, hands until 64 B.C.E., when Syria was conquered by the Romans. Aleppo was part of the Eastern Roman or Byzantine Empire before falling to Arabs under Khalid ibn al-Walid in 637 C.E. In the tenth century a resurgent Byzantine Empire briefly regained control from 974 to 987. When it was again under Muslim control, the city was twice besieged by Crusaders—in 1098 and in 1124—but was not conquered. On August 9, 1138, a deadly earthquake ravaged Aleppo and the surrounding area. An estimated 230,000 people died, making it the fourth deadliest earthquake in recorded history, if these figures are accurate. It came under the control of Saladin, and then the Ayyubid Dynasty from 1183, until taken by the Mongols in 1260. Returning to native control in 1317, it became part of the Ottoman Empire in 1517. At this point it was estimated to have a population of 50,000. Aleppo remained Ottoman until the empire's collapse, but was occasionally riven with internal feuds as well as attacks of the plague and later, from 1823, by cholera. By 1901 its population was around 125,000. The city revived when it came under French colonial rule but slumped again following the decision to give Antioch to Turkey in 1938-1939. With its twelfth-century Great Mosque, thirteenth-century citadel, and various seventeenth-century madrasas, palaces, caravanserais, and baths, Aleppo stands as a major historical monument, recalling the Hittites, Assyrians, Arabs, Mongols, Mamelukes, and Ottomans alike. It was named by the Islamic Educational Scientific and Cultural Organization (ISESCO) in 2006 as the \"capital of Islamic culture,\" in recognition of its \"historical, civilizational, and cultural status\" and \"in celebration of its historical and civilizational monuments which stand witness to an age-old past of which the roots spread to pre-historical times and stretch through Arab and Islamic eras.\" The old city There is a relatively clear division between old and new Aleppo. The former is enclosed within a wall, three miles around with seven gates, dating from medieval times. The medieval castle in the city—known as the Citadel of Aleppo—is built atop a huge, partially artificial mound rising 164 feet above the city. Considered to be one of the oldest, and largest castles in the world, the Citadel was originally a Neo-Hittite acropolis. The fortress was first built by the Sultan Seif al-Dawla al-Hamadani, the first Hamdanid ruler of Aleppo, as a military center of power over his region. It became a citadel under the Seleucids. Saladin's son, Ghazi, used it as both residence and fortress and it suffered from the Mongol invasions in 1269 and 1400. The present structure and designs of the Aleppo citadel is Ghazi's work from the thirteenth century. The sole entrance to the Citadel is through the outer tower in the south, which defended the stone-arched bridge that covered the 72.2-foot-wide moat. The magnificent gateway is almost a castle in itself with the door placed on a sidewall, with a close wall facing it, to limit the space needed to ram the door down. Further in, there is a bent entrance that turns several times, which was meant to slow down attackers. Further inside, there are three gates with carved figures at each. In the court, there is a Byzantine cistern and several brick vaults, probably dungeons. The pitch dark of the inside of the gateway strengthened the contrast between light and dark so attackers could not see. The current structure has been extensively damaged by earthquakes, notably in 1822. As an ancient trading center, Aleppo also has impressive souqs (bazaars) and khan (commercial courtyards). The city was significantly redesigned after World War II; in 1952 the French architect Andre Gutton had a number of wide new roads cut through the city to allow easier passage for modern traffic. In the 1970s, large parts of the older city were demolished to allow for the construction of modern apartment buildings. Culture and religion While more than 70 percent of Aleppo's inhabitants are Sunni Muslims (mainly Arabs, but also Kurds, and other diverse ethnicities relocated there during the Ottoman period), Aleppo is home to one of the richest and most diversified Christian communities of the Orient. Christians belonging to a dozen different congregations, with prevalence of the Armenian and Syriac Orthodox Church, represent between 15 percent and 20 percent of its population, making it the city with the second largest Christian community in the Middle East after Beirut, Lebanon. The city had a large Jewish population in ancient times. The great synagogue housed the famous Aleppo codex, dating back to the ninth century and now housed in Jerusalem. The vast majority of Aleppo's 10,000 Jewish residents moved abroad after the creation of the state of Israel due to various social and political pressures. Today, few Jewish families still live in Aleppo today, and the synagogue remains virtually empty. Religious sites The city has many mosques, the most notable being the \"Great Mosque\" (Jami al-Kabir), also known as the the Zakariyah Mosque. A pagan temple that once stood on this site was rebuilt as Aleppo's great Byzantine cathedral founded by Saint Helena, mother of Constantine the Great, which contains a tomb associated with Zechariah, father of John the Baptist. During the Crusades, when the invaders pillaged the surrounding countryside, the city's chief judge converted St. Helena's cathedral into a mosque, and in the middle of the twelfth century the famous Islamic leader Nur al-Din founded the madrasa (or religious school) that now encompasses the former cathedral. The present edifice dates from Nur al-Din's complete reconstruction in 1158, itself then partly rebuilt after the Mongol invasion of 1260. Twenty miles northwest of Aleppo are the ruins of the vast edifice erected in honor of St. Simeon Stylites or Symeon the Stylite (c. 390– September 2, 459), an ascetic Christian saint who achieved fame for a life of increasingly strict devotions. The \"Mansion of Simeon\" consists of four basilicas built out from an octagonal court in the four cardinal directions. In the center of the court stands an ancient, weather-beaten stone, which is thought to be the remains of Simeon's column. For 37 years, Saint Simeon Stylites remained on a small platform on top of a column. Though such piety seems utterly unintelligible today, Simeon's renunciation fit into a pattern of worship that was relatively common in Syriac and Egyptian Christianity at the time. Likewise, his particular lifestyle spawned numerous imitators, leading to a brief profusion of stylitism in the centuries following his death. Also scattered about the bleak hills nearby Aleppo are the remains of approximately 750 settlements from Byzantine times—the famous dead cities of northern Syria. Aleppo today The city is now an agricultural trading center and has factories producing carpets; silk, cotton, and wool textiles, silverware and goldware, leather goods, and embroidery. Chief exports are the agricultural products of the surrounding region, mainly wheat and cotton, pistachios, olives, and sheep. Aleppo has a number of European schools and Christian churches and missions. The University of Halab was founded in 1960. The city is connected by rail with Damascus, and with Beirut, Lebanon, and by caravan route with Iraq and parts of Kurdistan. Aleppo today has a population of 1.9 million. The province (or governorate) extends around the city for over 6,178 square miles and has around 3.7 million inhabitants. ReferencesISBN links support NWE through referral fees - Borneman, John. Syranian Episodes: Sons, Fathers, and an Anthropologist in Aleppo. Princeton University Press, 2007. ISBN 978-0691128870 - Marcus, Abraham. The Middle East on the Eve of Modernity: Aleppo in the 18th Century. Columbia University Press, 1992. ISBN 978-0231065955 - Rabbo, Annika. A Shop of One's Own: Independence and Reputation Among Traders in Aleppo. I.B. Tauris, 2005. ISBN 978-1850436836 - Sabato, Haim. Aleppo Tales. Toby Press, 2005. ISBN 978-1592641260 - Sutton, David. Aleppo: City of Scholars. Mesorah Publications, 2005. ISBN 978-1578190560 External links All links retrieved June 17, 2023. - Ancient City of Aleppo World Heritage List, UNESCO. Credits New World Encyclopedia writers and editors rewrote and completed the Wikipedia article in accordance with New World Encyclopedia standards. This article abides by terms of the Creative Commons CC-by-sa 3.0 License (CC-by-sa), which may be used and disseminated with proper attribution. Credit is due under the terms of this license that can reference both the New World Encyclopedia contributors and the selfless volunteer contributors of the Wikimedia Foundation. To cite this article click here for a list of acceptable citing formats.The history of earlier contributions by wikipedians is accessible to researchers here: The history of this article since it was imported to New World Encyclopedia: Note: Some restrictions may apply to use of individual images which are separately licensed."
}