{
  "url": "https://en.wikipedia.org/wiki/New_York_City",
  "title": "New York City - Wikipedia",
  "text": "New York City New York, often called New York City (NYC),[b] is the most populous city in the United States. It is located at the southern tip of New York State on New York Harbor, one of the world's largest natural harbors. The city comprises five boroughs, each coextensive with its respective county. It is the geographical and demographic center of both the Northeast megalopolis and the New York metropolitan area, the largest metropolitan area in the United States by both population and urban area. New York is a global center of finance[13] and commerce, culture, technology,[14] entertainment and media, academics and scientific output,[15] the arts and fashion, and, as home to the headquarters of the United Nations, international diplomacy.[c] With an estimated population in July 2024 of 8,478,072, distributed over 300.46 square miles (778.2 km2),[6] the city is the most densely populated major city in the United States.[7][8] New York City has more than double the population of Los Angeles, the country's second-most populous city.[21] Over 20.1 million people live in New York City's metropolitan statistical area[22] and 23.5 million in its combined statistical area as of 2020, both the largest in the U.S. New York City is one of the world's most populous megacities.[23] The city and its metropolitan area serve as the premier gateway for legal immigration to the United States. An estimated 800 languages are spoken in New York City,[24][25][26] making it the most linguistically diverse city in the world.[27][28] The New York City metropolitan region is home to the largest foreign-born population of any metropolitan region in the world, approximately 5.9 million as of 2023. New York City traces its origins to Fort Amsterdam and a trading post founded on Manhattan Island by Dutch colonists around 1624. The settlement was named New Amsterdam in 1626 and was chartered as a city in 1653. The city came under English control in 1664 and was temporarily renamed New York after King Charles II granted the lands to his brother, the Duke of York,[29] before this name was permanently adopted in 1674. Following independence from Great Britain, the city was the national capital of the United States from 1785 until 1790.[30] The modern city was formed by the 1898 consolidation of its five boroughs: Manhattan, Brooklyn, Queens, the Bronx, and Staten Island. Anchored by Wall Street in the Financial District, Manhattan, New York City has been called both the world's premier financial and fintech center[31][32] and the most economically powerful city in the world.[33] As of 2022[update], the New York metropolitan area is the largest metropolitan economy in the world, with a gross metropolitan product of over US$2.16 trillion.[12] The New York metropolitan area's economy is larger than all but nine countries. Despite having a 24/7 rapid transit system, New York also leads the world in urban automobile traffic congestion.[34] The city is home to the world's two largest stock exchanges by market capitalization of their listed companies: the New York Stock Exchange and Nasdaq. New York City is an established haven for global investors.[35] As of 2025[update], New York City is the most expensive city in the world for expatriates[36] and has by a wide margin the highest residential rents of any American city.[37] Fifth Avenue is the most expensive shopping street in the world.[38] New York City is home to the highest number of billionaires,[39] individuals of ultra-high net worth (greater than US$30 million),[40] and millionaires of any city in the world by a significant margin.[41] Etymology In 1664, New York was named in honor of the Duke of York (later King James II of England).[42] James's elder brother, King Charles II, appointed him proprietor of the former territory of New Netherland, including the city of New Amsterdam, when England seized it from Dutch control.[43] New Netherland was renamed the Province of New York (now New York State).[44] History Early history In the pre-Columbian era, the area of present-day New York City was inhabited by Algonquians, including the Lenape. Their homeland, known as Lenapehoking, included the present-day areas of Staten Island, Manhattan, the Bronx, the western portion of Long Island (including Brooklyn and Queens), and the Lower Hudson Valley.[45] The first documented visit to New York Harbor by a European was in 1524 by explorer Giovanni da Verrazzano.[46] He claimed the area for France and named it Nouvelle Angoulême (New Angoulême).[47] A Spanish expedition, led by the Portuguese captain Estêvão Gomes sailing for Emperor Charles V, arrived in New York Harbor in January 1525 and charted the mouth of the Hudson River, which he named Río de San Antonio ('Saint Anthony's River').[48] In 1609, the English explorer Henry Hudson rediscovered New York Harbor while searching for the Northwest Passage to the Orient for the Dutch East India Company.[49] He sailed up what the Dutch called North River (now the Hudson River), named first by Hudson as the Mauritius after Maurice, Prince of Orange.[50] Hudson claimed the region for the Dutch East India Company. In 1614, the area between Cape Cod and Delaware Bay was claimed by the Netherlands and named Nieuw-Nederland (\"New Netherland\"). The first non–Native American inhabitant of what became New York City was Juan Rodriguez, a merchant from Santo Domingo who arrived in Manhattan during the winter of 1613–14, trapping for pelts and trading with the local population as a representative of the Dutch.[51][52] Dutch rule A permanent European presence near New York Harbor was established in 1624, making New York the 12th-oldest continuously occupied European-established settlement in the continental United States, with the founding of a Dutch fur trading settlement on Governors Island. In 1625, construction was started on a citadel and Fort Amsterdam, later called Nieuw Amsterdam (New Amsterdam), on present-day Manhattan Island.[53][54] The colony of New Amsterdam extended from the southern tip of Manhattan to modern-day Wall Street, where a 12-foot (3.7 m) wooden stockade was built in 1653 to protect against Native American and English raids.[55] In 1626 Peter Minuit, the director of New Netherland, as charged by the Dutch West India Company, purchased the island of Manhattan from the Canarsie, a small Lenape band,[56] for \"the value of 60 guilders\"[57] (about $900 in 2018).[58] A frequently told but disproved legend claims that Manhattan was purchased for $24 worth of glass beads.[59][60] Following the purchase, New Amsterdam grew slowly.[29] To attract settlers, the Dutch instituted the patroon system in 1628, whereby wealthy Dutchmen (patroons, or patrons) who brought 50 colonists to New Netherland would be awarded land, local political autonomy, and rights to participate in the lucrative fur trade. This program had little success.[61] Since 1621, the Dutch West India Company had operated as a monopoly in New Netherland, on authority granted by the Dutch States General. In 1639–1640, to bolster economic growth, the Dutch West India Company relinquished its monopoly over the fur trade, leading to growth in the production and trade of food, timber, tobacco, and slaves (particularly with the Dutch West Indies).[29][62] In 1647, Peter Stuyvesant began his tenure as the last director-general of New Netherland. During his tenure, the population of New Netherland grew from 2,000 to 8,000.[63][64] Stuyvesant has been credited with improving law and order; however, he earned a reputation as a despotic leader. He instituted regulations on liquor sales, attempted to assert control over the Dutch Reformed Church, and blocked other religious groups from establishing houses of worship.[65] English rule In 1664, unable to summon any significant resistance, Stuyvesant surrendered New Amsterdam to English troops, led by Colonel Richard Nicolls, without bloodshed.[65][66] The terms of the surrender permitted Dutch residents to remain in the colony and allowed for religious freedom.[67] In 1667, during negotiations leading to the Treaty of Breda after the Second Anglo-Dutch War, the victorious Dutch decided to keep the nascent plantation colony of what is now Suriname, which they had gained from the English,[68] and in return the English kept New Amsterdam. The settlement was promptly renamed \"New York\" after the Duke of York (the future King James II and VII).[2] The duke gave part of the colony to proprietors George Carteret and John Berkeley.[69] On August 24, 1673, during the Third Anglo-Dutch War, Anthony Colve of the Dutch navy seized New York at the behest of Cornelis Evertsen the Youngest and rechristened it \"New Orange\" after William III, the Prince of Orange.[70] The Dutch soon returned the island to England under the Treaty of Westminster of November 1674.[71][72] Several intertribal wars among the Native Americans and epidemics brought on by contact with the Europeans caused sizeable population losses for the Lenape between 1660 and 1670.[73] By 1700, the Lenape population had diminished to 200.[74] New York experienced several yellow fever epidemics in the 18th century, losing ten percent of its population in 1702 alone.[75][76] In the early 18th century, New York grew in importance as a trading port as a part of the colony of New York.[77] It became a center of slavery, with 42% of households enslaving Africans by 1730.[78] Most were domestic slaves; others were hired out as labor. Slavery became integrally tied to New York's economy through the labor of slaves throughout the port, and the banking and shipping industries trading with the American South. During construction in Foley Square in the 1990s, the African Burying Ground was discovered; the cemetery included 10,000 to 20,000 graves of colonial-era Africans, some enslaved and some free.[79] The 1735 trial and acquittal in Manhattan of John Peter Zenger, who had been accused of seditious libel after criticizing colonial governor William Cosby, helped to establish freedom of the press in North America.[80] In 1754, Columbia University was founded.[81] American Revolution The Stamp Act Congress met in New York in October 1765, as the Sons of Liberty organization emerged in the city and skirmished over the next ten years with British troops stationed there.[82] The Battle of Long Island, the largest battle of the American Revolutionary War, was fought in August 1776 within modern-day Brooklyn.[83] A British rout of the Continental Army at the Battle of Fort Washington in November 1776 eliminated the last American stronghold in Manhattan, causing George Washington and his forces to retreat across the Hudson River to New Jersey, pursued by British forces.[84][85] After the battle, in which the Americans were defeated, the British made New York their military and political base of operations in North America.[86] The city was a haven for Loyalist refugees and escaped slaves who joined the British lines for freedom promised by the Crown, with as many as 10,000 escaped slaves crowded into the city during the British occupation, the largest such community on the continent.[87][88] When the British forces evacuated New York at the close of the war in 1783, they transported thousands of freedmen for resettlement in Nova Scotia, England, and the Caribbean.[89] The attempt at a peaceful solution to the war took place at the Conference House on Staten Island between American delegates, including Benjamin Franklin, and British general Lord Howe on September 11, 1776.[90] Shortly after the British occupation began, the Great Fire of New York destroyed nearly 500 buildings, about a quarter of the structures in the city, including Trinity Church.[91][92] Post-revolutionary period and early 19th century In January 1785, the assembly of the Congress of the Confederation made New York City the national capital.[93] New York was the last capital of the United States under the Articles of Confederation and the first under the Constitution.[94] As the capital, New York City hosted the inauguration of the first President, George Washington, and the first Congress, at Federal Hall on Wall Street. Congress drafted the Bill of Rights there.[94] The Supreme Court held its first organizational sessions in New York in 1790. In 1790, for the first time, New York City surpassed Philadelphia as the nation's largest city. At the end of 1790, the national capital was moved to Philadelphia, where it remained while the new capital in Washington, D.C. was being constructed.[95][30] During the 19th century New York City's population grew from 60,000 to 3.43 million.[96] Under New York State's gradual emancipation act of 1799, children of slave mothers were to be eventually liberated but to be held in indentured servitude until their mid-to-late twenties.[97][98] A significant free Black population gradually developed in Manhattan, made up of former slaves who had been freed by their masters after the American Revolutionary War, as well as escaped slaves. The New York Manumission Society worked for abolition and established the African Free School to educate Black children.[99] It was not until 1827 that slavery was completely abolished in the state.[100] Free Blacks struggled with discrimination, and interracial abolitionist activism continued. New York City's population jumped from 123,706 in 1820 (10,886 of whom were Black and of whom 518 were enslaved) to 312,710 by 1840 (16,358 of whom were Black).[101] Also in the 19th century, the city was transformed by both commercial and residential development relating to its status as a national and international trading center, as well as by European immigration, respectively.[103]: 55 The city adopted the Commissioners' Plan of 1811, which expanded the city street grid to encompass almost all of Manhattan. The 1825 completion of the Erie Canal through central New York connected the Atlantic port to the agricultural markets and commodities of the North American interior via the Hudson River and the Great Lakes.[104] Local politics became dominated by Tammany Hall, a political machine supported by Irish and German immigrants.[105] In 1831, New York University was founded.[106] Several prominent American literary figures lived in New York during the 1830s and 1840s, including William Cullen Bryant, Washington Irving, Herman Melville, Rufus Wilmot Griswold, John Keese, Nathaniel Parker Willis, and Edgar Allan Poe. Members of the business elite lobbied for the establishment of Central Park, which in 1857 became the first landscaped park in an American city.[107] The Great Irish Famine brought a large influx of Irish immigrants, of whom more than 200,000 were living in New York by 1860, representing over a quarter of the city's population.[108] Extensive immigration from the German provinces meant that Germans comprised another 25% of New York's population by 1860.[109][110] American Civil War Democratic Party candidates were consistently elected to local office, increasing the city's ties to the South and its dominant party. In 1861, Mayor Fernando Wood called on the aldermen to declare independence from Albany and the United States after the South seceded, but his proposal was not acted on.[99] Anger at new military conscription laws during the American Civil War (1861–1865), which spared wealthier men who could afford to hire a substitute, led to the Draft Riots of 1863, whose most visible participants were ethnic Irish working class.[99] The draft riots deteriorated into attacks on New York's elite, followed by attacks on Black New Yorkers after fierce competition for a decade between Irish immigrants and Black people for work. Rioters burned the Colored Orphan Asylum to the ground.[109] At least 120 people were killed.[111] Eleven Black men were lynched over five days, and the riots forced hundreds of Blacks to flee. The Black population in Manhattan fell below 10,000 by 1865. The White working class had established dominance.[109][111] It was one of the worst incidents of civil unrest in American history.[112] Late 19th and early 20th century In 1886, the Statue of Liberty, a gift from France, was dedicated in New York Harbor. The statue welcomed 14 million immigrants as they arrived via Ellis Island by ship in the late 19th and early 20th centuries, and is a symbol of the United States and American ideals of liberty and peace.[113][114] In 1898, the City of New York was formed with the consolidation of Brooklyn (until then a separate city), the County of New York (which then included parts of the Bronx), the County of Richmond, and the western portion of the County of Queens.[115] The opening of the New York City Subway in 1904, first built as separate private systems, helped bind the new city together.[116] Throughout the first half of the 20th century, the city became a world center for industry, commerce, and communication.[117] In 1904, the steamship General Slocum caught fire in the East River, killing 1,021 people.[118] In 1911, the Triangle Shirtwaist Factory fire, the city's worst industrial disaster, killed 146 garment workers and spurred the growth of the International Ladies' Garment Workers' Union and major improvements in building safety standards.[119] New York's non-White population was 36,620 in 1890.[103]: Table 30 New York City was a prime destination in the early 20th century for Blacks during the Great Migration from the American South, and by 1916, New York City had the largest urban African diaspora in North America.[120] The Harlem Renaissance of literary and cultural life flourished during the era of Prohibition.[121] The larger economic boom generated the construction of skyscrapers competing in height.[122] New York City became the most populous urbanized area in the world in the early 1920s, overtaking London. The metropolitan area surpassed 10 million in the early 1930s, becoming the first megacity.[123] The Great Depression saw the election of reformer Fiorello La Guardia as mayor and the fall of Tammany Hall after eighty years of political dominance.[124] Returning World War II veterans created a post-war economic boom and the development of large housing tracts in eastern Queens and Nassau County, with Wall Street leading America's place as the world's dominant economic power. The United Nations headquarters was completed in 1952, solidifying New York's global geopolitical influence, and the rise of abstract expressionism in the city precipitated New York's displacement of Paris as the center of the art world.[125] Late 20th and early 21st centuries In 1969, the Stonewall riots were a series of violent protests by members of the gay community against a police raid that took place in the early morning of June 28, 1969, at the Stonewall Inn in Greenwich Village.[129] They are widely considered to be the single most important event leading to the gay liberation movement[126][130][131][132] and the modern fight for LGBT rights.[133][134] Wayne R. Dynes, author of the Encyclopedia of Homosexuality, wrote that drag queens were the only \"transgender folks around\" during the Stonewall riots. The transgender community in New York City played a significant role in fighting for LGBT equality.[135] In the 1970s, job losses due to industrial restructuring caused New York City to suffer from economic problems and rising crime rates.[136] Growing fiscal deficits in 1975 led the city to appeal to the federal government for financial aid, which President Gerald Ford denied in a speech paraphrased by New York Daily News as \"FORD TO CITY: DROP DEAD\".[137] The Municipal Assistance Corporation was formed and granted oversight authority over the city's finances.[138] While a resurgence in the financial industry greatly improved the city's economic health in the 1980s, New York's crime rate continued to increase through that decade and into the beginning of the 1990s.[139] New York City's population passed 8 million for the first time in the 2000 census;[140] further records were set in the 2010 and 2020 censuses.[141] Important new economic sectors, such as Silicon Alley, emerged.[142] The year 2000 was celebrated with fanfare in Times Square.[143] New York City suffered the bulk of the economic damage and the largest loss of human life in the aftermath of the September 11 attacks in 2001.[144] Two of the four hijacked airliners were flown into the Twin Towers of the World Trade Center, resulting in the collapse of both buildings and the deaths of 2,753 people, including 343 first responders from the New York City Fire Department and 71 law enforcement officers.[145] The area was rebuilt with a new World Trade Center, the National September 11 Memorial and Museum, and other new buildings and infrastructure,[146] including the World Trade Center Transportation Hub, the city's third-largest hub.[147] The new One World Trade Center is the tallest skyscraper in the Western Hemisphere[148] and the world's seventh-tallest building by pinnacle height, with its spire reaching a symbolic 1,776 feet (541.3 m), a reference to the year of American independence.[149][150][151] The Occupy Wall Street protests in Zuccotti Park in the Financial District of Lower Manhattan began on September 17, 2011, receiving global attention and popularizing the Occupy movement against social and economic inequality worldwide.[152] New York City was heavily impacted by Hurricane Sandy in October 2012. At least 43 people died in New York City as a result of Sandy, and the economic losses in New York City were estimated to be roughly $19 billion.[153] Flooding led to a days-long shutdown of the subway system,[154] and the first weather-related closure of the New York Stock Exchange since the Great Blizzard of 1888.[155] The resulting long-term damage to multiple subway and road tunnels[156] spawned long-term efforts towards infrastructural projects to counter climate change and rising seas, including $15 billion in federal funding received through 2022 towards those resiliency efforts.[157][158] In March 2020, the first case of COVID-19 in the city was confirmed.[159] With its population density and extensive exposure to global travelers, the city rapidly replaced Wuhan, China as the global epicenter of the pandemic during the early phase, straining the city's healthcare infrastructure.[160][161] Through March 2023, New York City recorded more than 80,000 deaths from COVID-19-related complications.[162] Geography New York City lies in the northeastern United States, in southeastern New York State, approximately halfway between Washington, D.C. and Boston. Its location at the mouth of the Hudson River, which feeds into a naturally sheltered harbor and then into the Atlantic Ocean, has helped the city become a significant trading port. Most of the city is built on the three islands of Long Island, Manhattan, and Staten Island. During the Wisconsin glaciation, 75,000 to 11,000 years ago, the New York City area was situated at the edge of a large ice sheet.[163] The erosive forward movement of the ice (and its subsequent retreat) contributed to the separation of what is now Long Island and Staten Island. That action left bedrock at a relatively shallow depth, providing a solid foundation for most of Manhattan's skyscrapers.[164] The Hudson River flows through the Hudson Valley into New York Bay. Between New York City and Troy, New York, the river is an estuary.[165] The Hudson River separates the city from New Jersey. The East River—a tidal strait—flows from Long Island Sound and separates the Bronx and Manhattan from Long Island. The Harlem River, another tidal strait between the East and Hudson rivers, separates most of Manhattan from the Bronx. The Bronx River, which flows through the Bronx and Westchester County, is the only entirely freshwater river in the city.[166][importance?] The city's land has been altered substantially by human intervention, with considerable land reclamation along the waterfronts since Dutch colonial times; reclamation is most prominent in Lower Manhattan, with developments such as Battery Park City in the 1970s and 1980s.[167] Some of the natural relief in topography has been evened out, especially in Manhattan.[168] The city's total area is 468.484 square miles (1,213.37 km2). 302.643 sq mi (783.84 km2) of the city is land and 165.841 sq mi (429.53 km2) of it is water.[169][170] The highest point in the city is Todt Hill on Staten Island, which, at 409.8 feet (124.9 m) above sea level, is the highest point on the eastern seaboard south of Maine.[171] The summit of the ridge is mostly covered in woodlands as part of the Staten Island Greenbelt.[172] Boroughs New York City is sometimes referred to collectively as the Five Boroughs.[173] Each borough is coextensive with a respective county of New York State, making New York City one of the U.S. municipalities in multiple counties. Manhattan (New York County) is the geographically smallest and most densely populated borough. It is home to Central Park and most of the city's skyscrapers, and is sometimes locally known as The City.[174] Manhattan's population density of 70,450.8 inhabitants per square mile (27,201.2/km2) in 2022 makes it the highest of any county in the United States and higher than the density of any individual American city.[175] Manhattan is the cultural, administrative, and financial center of New York City and contains the headquarters of many major multinational corporations, the United Nations headquarters, Wall Street, and many important universities. The borough is often described as the financial and cultural center of the world.[176][177] Brooklyn (Kings County), on the western tip of Long Island, is the city's most populous borough. Brooklyn is known for its cultural, social, and ethnic diversity, an independent art scene, distinct neighborhoods, and a distinctive architectural heritage. Downtown Brooklyn is the largest central core neighborhood in the Outer Boroughs. The borough has a long beachfront shoreline including Coney Island, established in the 1870s as one of the earliest amusement grounds in the United States[178] Marine Park and Prospect Park are the two largest parks in Brooklyn.[179] Since 2010, Brooklyn has evolved into a thriving hub of entrepreneurship and high technology startup firms,[180][181] and of postmodern art and design.[181][182] Brooklyn is also home to Fort Hamilton, the U.S. military's only active duty installation within New York City,[183] aside from Coast Guard operations. The facility was established in 1825 on the site of a battery used during the American Revolution, and it is one of America's longest-serving military forts.[184] Queens (Queens County), on Long Island north and east of Brooklyn, is geographically the largest borough, the most ethnically diverse county in the United States,[185] and the most ethnically diverse urban area in the world.[186][187] Queens is the site of the Citi Field, home of the New York Mets, and hosts the annual US Open tennis tournament at the USTA Billie Jean King National Tennis Center in Flushing Meadows–Corona Park, with plans to build Etihad Park, a soccer-specific stadium for New York City FC.[188] Additionally, two of the three busiest airports serving the New York metropolitan area, John F. Kennedy International Airport and LaGuardia Airport, are in Queens.[189] The Bronx (Bronx County) is both New York City's northernmost borough and the only one that is mostly on the U.S. mainland. It is the location of Yankee Stadium, the baseball park of the New York Yankees, and home to the largest cooperatively-owned housing complex in the United States, Co-op City.[190] It is home to the Bronx Zoo, the world's largest metropolitan zoo,[191] which spans 265 acres (1.07 km2) and houses more than 6,000 animals.[192] The Bronx is the birthplace of hip hop music and its associated culture.[193] Pelham Bay Park is the largest park in New York City, at 2,772 acres (1,122 ha).[194] Staten Island (Richmond County) is the most suburban in character of the five boroughs. It is connected to Brooklyn by the Verrazzano–Narrows Bridge, and to Manhattan by way of the free Staten Island Ferry. Staten Island is known as the \"Borough of Parks\"[195] and \"The Greenest Borough\" due to its 12,300 acres of protected parkland and over 170 parks[196]. In central Staten Island, the Staten Island Greenbelt spans approximately 2,500 acres (10 km2), including 28 miles (45 km) of walking trails and one of the last undisturbed forests in the city.[197] Designated in 1984 to protect the island's natural lands, the Greenbelt comprises seven city parks. It also contains environmental centers for educational and recreational purposes[196]. Climate Under the Köppen climate classification, New York City has a humid subtropical climate (Cfa) and is the northernmost major city on the North American continent with this categorization. The suburbs to the immediate north and west are in the transitional zone between humid subtropical and humid continental climates (Dfa).[198][199] The city receives an average of 49.5 inches (1,260 mm) of precipitation annually, which is relatively evenly spread throughout the year. New York averages over 2,500 hours of sunshine annually.[200] Winters are chilly and damp, and prevailing wind patterns that blow sea breezes offshore temper the moderating effects of the Atlantic Ocean. The Atlantic and the partial shielding from colder air by the Appalachian Mountains keep the city warmer in the winter than inland North American cities at similar or lesser latitudes.[201] The daily mean temperature in January, the area's coldest month, is 33.3 °F (0.7 °C).[202] Temperatures usually drop to 10 °F (−12 °C) several times per winter,[203] and can reach 60 °F (16 °C) for several days even in the coldest winter month. Spring and autumn are unpredictable and can range from cool to warm, although they are usually mild with low humidity. Summers are typically hot and humid, with a daily mean temperature of 77.5 °F (25.3 °C) in July.[202] Nighttime temperatures are 9.5 °F (5.3 °C) degrees higher for the average city resident due to the urban heat island effect, caused by paved streets and tall buildings.[204] Daytime temperatures exceed 90 °F (32 °C) on average of 17 days each summer and in some years exceed 100 °F (38 °C), although this is a rare occurrence, last noted on July 18, 2012.[205][206][207][208] Readings of 0 °F (−18 °C) are extremely rare, last occurring on February 14, 2016.[209] Extreme temperatures have ranged from 106 °F (41 °C), recorded on July 9, 1936, down to −15 °F (−26 °C) on February 9, 1934.[202] The coldest recorded wind chill was −37 °F (−38 °C) on the same day as the all-time record low.[210] The average winter snowfall between 1991 and 2020 was 29.8 inches (76 cm). This varies considerably between years. The record cold daily maximum was 2 °F (−17 °C) on December 30, 1917. The record warm daily minimum was 87 °F (31 °C), on July 2, 1903.[205] The average water temperature of the nearby Atlantic Ocean ranges from 39.7 °F (4.3 °C) in February, to 74.1 °F (23.4 °C) in August.[211] Hurricanes and tropical storms are rare in the New York area.[212] Hurricane Sandy brought a destructive storm surge to New York City on the evening of October 29, 2012, flooding numerous streets, tunnels, and subway lines in Lower Manhattan and other areas of the city and cutting off electricity in many parts of the city and its suburbs.[213] The storm and its profound impacts have prompted the discussion of constructing seawalls and other coastal barriers around the shorelines of the city and the metropolitan area to minimize the risk of destructive consequences from another such event in the future.[157] Parks The city of New York has a complex park system, with various lands operated by the National Park Service, the New York State Office of Parks, Recreation and Historic Preservation, and the New York City Department of Parks and Recreation. In its 2023 ParkScore ranking, the Trust for Public Land reported that the park system in New York City was the tenth-best park system among the most populous U.S. cities, citing the city's park acreage, investment in parks, and that 99% of residents are within 1⁄2 mile (0.80 km) of a park.[215] Gateway National Recreation Area contains over 26,000 acres (110 km2), most of it in New York City.[216] In Brooklyn and Queens, the park contains over 9,000 acres (36 km2) of salt marsh, wetlands, islands, and water, including most of Jamaica Bay and the Jamaica Bay Wildlife Refuge. Also in Queens, the park includes a significant portion of the western Rockaway Peninsula, most notably Jacob Riis Park and Fort Tilden.[217] In Staten Island, it includes Fort Wadsworth, with historic pre-Civil War era Battery Weed and Fort Tompkins, and Great Kills Park.[218] The Statue of Liberty National Monument and Ellis Island Immigration Museum are managed by the National Park Service and are in both New York and New Jersey. They are joined in the harbor by Governors Island National Monument. Historic sites under federal management on Manhattan Island include Stonewall National Monument; Castle Clinton National Monument; Federal Hall National Memorial; Theodore Roosevelt Birthplace National Historic Site; General Grant National Memorial (Grant's Tomb); African Burial Ground National Monument; and Hamilton Grange National Memorial. Hundreds of properties are listed on the National Register of Historic Places or as a National Historic Landmark. There are seven state parks within the confines of New York City. They include: the Clay Pit Ponds State Park Preserve, a natural area that includes extensive riding trails; the Riverbank State Park, a 28-acre (11 ha) facility;[219] and the Marsha P. Johnson State Park, a state park in Brooklyn and Manhattan that borders the East River renamed in honor of Marsha P. Johnson.[220] New York City has over 28,000 acres (110 km2) of municipal parkland and 14 miles (23 km) of public beaches.[221] The largest municipal park in the city is Pelham Bay Park in the Bronx, with 2,772 acres (1,122 ha),[194][222] and the most visited urban park is the Central Park, and one of the most filmed and visited locations in the world, with 42 million visitors in 2023.[223] Environment Environmental issues in New York City are affected by the city's size, density, abundant public transportation infrastructure, and its location at the mouth of the Hudson River. For example, it is one of the country's biggest sources of pollution and has the lowest per-capita greenhouse gas emissions rate and electricity usage. Governors Island is planned to host a US$1 billion research and education center to make New York City the global leader in addressing the climate crisis.[226] As an oceanic port city, New York City is vulnerable to long-term manifestations of global warming like sea level rise exacerbated by land subsidence.[227] Climate change has spawned the development of a significant climate resiliency and environmental sustainability economy in the city. New York City has focused on reducing its environmental impact and carbon footprint.[228] Mass transit use is the highest in the country. New York's high rate of public transit use, more than 610,000 daily cycling trips as of 2022[update],[229] and many pedestrian commuters make it the most energy-efficient major city in the United States.[230] Walk and bicycle modes of travel account for 21% of all modes for trips in the city; nationally, the rate for metro regions is about 8%.[231] In both 2011 and 2015, Walk Score named New York City the most walkable large city in the United States,[232][233][234] and in 2018, Stacker ranked New York the most walkable American city.[235] Citibank sponsored public bicycles for the city's bike-share project, which became known as Citi Bike, in 2013.[236] New York City's numerical \"in-season cycling indicator\" of bicycling in the city had hit an all-time high of 437 when measured in 2014.[237] The New York City drinking water supply is extracted from the protected Catskill Mountains watershed.[238] As a result of the watershed's integrity and undisturbed natural water filtration system, New York is one of only four major cities in the United States the majority of whose drinking water is pure enough not to require water treatment.[239] The city's municipal water system is the nation's largest, moving more than 1 billion U.S. gallons (3.8 billion liters) of water daily from a watershed covering 1,900 square miles (4,900 km2)[240][241] According to the 2016 World Health Organization Global Urban Ambient Air Pollution Database,[242] the annual average concentration in New York City's air of particulate matter measuring 2.5 micrometers or less (PM2.5) was 7.0 micrograms per cubic meter, or 3.0 micrograms within the recommended limit of the WHO Air Quality Guidelines for the annual mean PM2.5.[243] The New York City Department of Health and Mental Hygiene, in partnership with Queens College, conducts the New York Community Air Survey to measure pollutants at about 150 locations.[244] Demographics New York City is the most populous city in the United States, with 8,804,190 residents as of the 2020 census, its highest decennial count ever, incorporating more immigration into the city than outmigration since the 2010 census.[6][247][248] More than twice as many people live in New York City as in Los Angeles, the second largest American city.[249] The city's population in 2020 was 35.9% White, 22.7% Black, 14.6% Asian, 10.5% Mixed, 0.7% Native American and 0.1% Pacific Islander; 28.4% identified themselves as Hispanic or Latino.[6] Between 2010 and 2020, New York City's population grew by 629,000 residents, more than the total growth of the next four largest American cities (Los Angeles, Chicago, Houston, and Phoenix) combined.[250][251] The city's population density of 27,744.1 inhabitants per square mile (10,712.1/km2) makes it the densest of any American municipality with a population above 100,000.[175] Manhattan's population density is 70,450.8 inhabitants per square mile (27,201.2/km2), the highest of any county in the United States.[175] Based on data from the 2020 census, New York City comprised about 43.6% of the state's population of 20,202,320,[6] and about 39% of the population of the New York metropolitan area.[252] The majority of New York City residents in 2020 (5,141,539 or 58.4%) were living in Brooklyn or Queens, the two boroughs on Long Island.[253] An estimated 800 languages are spoken in New York,[24][26][254][255] and the New York City metropolitan statistical area has the largest foreign-born population of any metropolitan region in the world. The New York region continues to be by far the leading metropolitan gateway for legal immigrants admitted into the United States, substantially exceeding the combined totals of Los Angeles and Miami.[256] Nearly seven times as many young professionals applied for jobs in New York City in 2023 as compared to 2019, making New York the most popular destination for recent college graduates.[257] Ethnicity and nationality According to 2022 estimates from the American Community Survey, the largest self-reported ancestries in New York City were Dominican (8.7%), Chinese (7.5%), Puerto Rican (6.9%), Italian (5.5%), Mexican (4.4%), Irish (4.4%), Asian Indian (3.1%), German (2.9%), Jamaican (2.4%), Ecuadorian (2.3%), English (2.1%), Polish (1.9%), Russian (1.7%), Arab (1.4%), Haitian (1.4%), Guyanese (1.3%), Filipino (1.1%), and Korean (1.1%).[258][16][17] Based on American Community Survey data from 2018 to 2022, approximately 36.3% of the city's population is foreign-born (compared to 13.7% nationwide),[6] and 40% of all children are born to mothers who are immigrants.[261] Throughout its history, New York has been a major"
}