{
  "url": "https://flutrackers.com/forum/forum/local-regional-communities-and-organizations/cidrap/1024848-cidrap-news-briefs-december-3-2025",
  "title": "CIDRAP- NEWS BRIEFS December 3, 2025 - FluTrackers News and Information",
  "text": "https://www.cidrap.umn.edu/all-news Medical societies jointly launch infection prevention initiative News brief Today at 2:42 p.m. Chris Dall, MA Topics Antimicrobial Stewardship Healthcare-Associated Infections Two medical societies are teaming up on an initiative to provide guidance on infection prevention and antimicrobial stewardship in US health care settings. Launched yesterday by the Association for Professionals in Infection Control and Epidemiology (APIC) and the Society for Healthcare Epidemiology of America (SHEA), the Healthcare Infection Prevention Advisory Group (HIPAG) aims to fill the gap left by the Trump administration’s dissolution of a federal advisory group on infection prevention in May. APIC and SHEA say the group will offer evidence-backed advisory expertise and help maintain a unified approach to infection prevention, filling a role previously occupied by the Healthcare Infection Control Practices Advisory Committee (HICPAC), which was established by the US government in 1991 and was responsible for crafting and reviewing guidance on infection prevention and control protocols. Like HICPAC, HIPAG will include invited experts from medical societies, health care organizations, and public health and patient advocacy groups. HICPAC is one of several federal advisory groups that have been terminated by the Trump administration. Although HICPAC guidelines weren’t legally binding, they were routinely adopted by the Centers for Disease Control and Prevention (CDC) and set the standards that have been widely followed in US hospitals, doctors and dentist offices, ambulatory surgery centers, nursing homes, and other health care settings. Shared commitment to infection prevention APIC and SHEA say the elimination of HICPAC has raised concerns about potential variation and inconsistencies in infection prevention and control policies across US health care practices. According to the most recent CDC data, an estimated one in 31US hospital patients has a healthcare-associated infection on any given day. “HIPAG reflects our shared commitment to ensuring that infection prevention remains science-driven, practical, and grounded in real-world expertise,” APIC president Carol McLay, DrPH, MPH, RN, said in a news release. “This collaboration is not only critical to the safety of healthcare delivery—it is key to restoring trust and confidence among patients, families, and the professionals who care for them.” CARB-X funds microbiome therapeutic for ICU patients News brief Today at 2:27 p.m. Chris Dall, MA Topics Antimicrobial Stewardship CARB-X announced yesterday that it will support expanded development of Seres Therapeutics’ novel live biotherapeutic to prevent gut-seeded, antibiotic-resistant infections in intensive care unit (ICU) patients. Seres will receive up to $3.6 million in funding from CARB-X (Combating Antibiotic-Resistant Bacteria Biopharmaceutical Accelerator) to advance development of a liquid oral formulation of SER-155, an investigational microbiome therapeutic designed to decolonize gastrointestinal pathogens, improve epithelial barrier integrity, and induce immune tolerance to prevent the translocation of resistant bacteria into the bloodstream. CARB-X provided backing for SER-155 in 2017. Company officials say SER-155-LF will broaden the potential use of the drug in medically compromised patients who can’t swallow a capsule and are at high risk of bloodstream infections caused by resistant gastrointestinal pathogens such as Escherichia coli. The funding aims to support development of the drug through a phase 1b clinical trial in ICU patients. “Preventing infections without contributing to antimicrobial resistance represents an important goal, and this project should help expand our understanding of how microbiome-based approaches may play a role in achieving that,” Richard Alm, PhD, CARB-X’s interim chief of research and development (R&D), said in a news release. SER-155-LF is the latest product to receive support from CARB-X’s 2024 funding round, and the 119th R&D project supported by CARB-X since 2016. Tennessee officials announce first CWD detection in Decatur County News brief Today at 2:00 p.m. Mary Van Beusekom, MS Topics Chronic Wasting Disease The Tennessee Wildlife Resources Agency (TWRA) yesterday announced the identification of a chronic wasting disease (CWD)–positive hunter-harvested deer in Decatur County, its first. Decatur County, located in the southwestern part of the state, abuts other CWD-positive counties. Because Decatur was already within the state’s CWD management zone, wildlife feeding and carcass transportation restrictions are in place, and deer-hunting season dates and regulations won’t be changed. But hunters in the county are now eligible for Tennessee’s Earn-a-Buck Program, in which they can harvest antlerless deer by submitting samples for testing. 19 counties now affected CWD has been found in free-ranging white-tailed deer in 18 Tennessee counties in addition to Decatur: Carroll, Chester, Crockett, Dyer, Fayette, Gibson, Hardeman, Hardin, Haywood, Henderson, Henry, Lauderdale, Lewis, Madison, McNairy, Shelby, Tipton, and Weakley. Hunters can access CWD testing through participating taxidermists and meat processors or by using drop-off freezers. “Hunter's [sic] participation in CWD testing is critical for the continued surveillance and monitoring of CWD throughout the state,” TWRA said, adding that it has already submitted roughly 4,400 samples for testing this hunting season. “Hunters can access CWD testing through participating taxidermists and meat processors or by using drop-off freezers.” CWD is a fatal disease of cervids such as deer, elk, and moose caused by infectious misfolded proteins called prions. \\ Quick takes: Marburg cases reach 13, avian flu detections in Alaska News brief Today at 1:12 p.m. Stephanie Soucheray, MA Topics Marburg Avian Influenza (Bird Flu) Viral Hemorrhagic Fever ALL BRIEFS Medical societies jointly launch infection prevention initiative News brief Today at 2:42 p.m. Chris Dall, MA Topics Antimicrobial Stewardship Healthcare-Associated Infections Two medical societies are teaming up on an initiative to provide guidance on infection prevention and antimicrobial stewardship in US health care settings. Launched yesterday by the Association for Professionals in Infection Control and Epidemiology (APIC) and the Society for Healthcare Epidemiology of America (SHEA), the Healthcare Infection Prevention Advisory Group (HIPAG) aims to fill the gap left by the Trump administration’s dissolution of a federal advisory group on infection prevention in May. APIC and SHEA say the group will offer evidence-backed advisory expertise and help maintain a unified approach to infection prevention, filling a role previously occupied by the Healthcare Infection Control Practices Advisory Committee (HICPAC), which was established by the US government in 1991 and was responsible for crafting and reviewing guidance on infection prevention and control protocols. Like HICPAC, HIPAG will include invited experts from medical societies, health care organizations, and public health and patient advocacy groups. HICPAC is one of several federal advisory groups that have been terminated by the Trump administration. Although HICPAC guidelines weren’t legally binding, they were routinely adopted by the Centers for Disease Control and Prevention (CDC) and set the standards that have been widely followed in US hospitals, doctors and dentist offices, ambulatory surgery centers, nursing homes, and other health care settings. Shared commitment to infection prevention APIC and SHEA say the elimination of HICPAC has raised concerns about potential variation and inconsistencies in infection prevention and control policies across US health care practices. According to the most recent CDC data, an estimated one in 31US hospital patients has a healthcare-associated infection on any given day. “HIPAG reflects our shared commitment to ensuring that infection prevention remains science-driven, practical, and grounded in real-world expertise,” APIC president Carol McLay, DrPH, MPH, RN, said in a news release. “This collaboration is not only critical to the safety of healthcare delivery—it is key to restoring trust and confidence among patients, families, and the professionals who care for them.” CARB-X funds microbiome therapeutic for ICU patients News brief Today at 2:27 p.m. Chris Dall, MA Topics Antimicrobial Stewardship CARB-X announced yesterday that it will support expanded development of Seres Therapeutics’ novel live biotherapeutic to prevent gut-seeded, antibiotic-resistant infections in intensive care unit (ICU) patients. Seres will receive up to $3.6 million in funding from CARB-X (Combating Antibiotic-Resistant Bacteria Biopharmaceutical Accelerator) to advance development of a liquid oral formulation of SER-155, an investigational microbiome therapeutic designed to decolonize gastrointestinal pathogens, improve epithelial barrier integrity, and induce immune tolerance to prevent the translocation of resistant bacteria into the bloodstream. CARB-X provided backing for SER-155 in 2017. Company officials say SER-155-LF will broaden the potential use of the drug in medically compromised patients who can’t swallow a capsule and are at high risk of bloodstream infections caused by resistant gastrointestinal pathogens such as Escherichia coli. The funding aims to support development of the drug through a phase 1b clinical trial in ICU patients. “Preventing infections without contributing to antimicrobial resistance represents an important goal, and this project should help expand our understanding of how microbiome-based approaches may play a role in achieving that,” Richard Alm, PhD, CARB-X’s interim chief of research and development (R&D), said in a news release. SER-155-LF is the latest product to receive support from CARB-X’s 2024 funding round, and the 119th R&D project supported by CARB-X since 2016. Tennessee officials announce first CWD detection in Decatur County News brief Today at 2:00 p.m. Mary Van Beusekom, MS Topics Chronic Wasting Disease The Tennessee Wildlife Resources Agency (TWRA) yesterday announced the identification of a chronic wasting disease (CWD)–positive hunter-harvested deer in Decatur County, its first. Decatur County, located in the southwestern part of the state, abuts other CWD-positive counties. Because Decatur was already within the state’s CWD management zone, wildlife feeding and carcass transportation restrictions are in place, and deer-hunting season dates and regulations won’t be changed. But hunters in the county are now eligible for Tennessee’s Earn-a-Buck Program, in which they can harvest antlerless deer by submitting samples for testing. 19 counties now affected CWD has been found in free-ranging white-tailed deer in 18 Tennessee counties in addition to Decatur: Carroll, Chester, Crockett, Dyer, Fayette, Gibson, Hardeman, Hardin, Haywood, Henderson, Henry, Lauderdale, Lewis, Madison, McNairy, Shelby, Tipton, and Weakley. Hunters can access CWD testing through participating taxidermists and meat processors or by using drop-off freezers. “Hunter's [sic] participation in CWD testing is critical for the continued surveillance and monitoring of CWD throughout the state,” TWRA said, adding that it has already submitted roughly 4,400 samples for testing this hunting season. “Hunters can access CWD testing through participating taxidermists and meat processors or by using drop-off freezers.” CWD is a fatal disease of cervids such as deer, elk, and moose caused by infectious misfolded proteins called prions. \\ Quick takes: Marburg cases reach 13, avian flu detections in Alaska News brief Today at 1:12 p.m. Stephanie Soucheray, MA Topics Marburg Avian Influenza (Bird Flu) Viral Hemorrhagic Fever - There are now 13 Marburg cases confirmed in Ethiopia’s outbreak of the viral hemorrhagic fever. The death toll remains at eight. During remarks given earlier this week, World Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus, PhD said, “The government of Ethiopia is leading the response, and WHO is supporting as requested. We’re providing testing supplies and protective equipment for health workers, and deploying experts to support local authorities.” - The US Department of Agriculture’s Animal and Plant Health Inspection Service (APHIS) published several new wild bird avian flu detections, with several detections among wild predators and water fowl in Alaska, Oregon, and Washington. Of note are more than 30 detections in Matanuska-Susitna Borough, Alaska, almost all of which were mallards. Additionally, APHIS yesterday said there was a new detection of avian influenza in a dairy milking cow in California. This is the first avian flu livestock detection in weeks. ALL BRIEFS"
}