{
  "url": "https://community.pandora.com/t5/My-Collection/How-To-Get-Started-Listening/td-p/65059",
  "title": "Solved: How To Get Started Listening - Pandora Community",
  "text": "I’m Uneducated, How do I search the song listen to it mod edit: changed title for clarity Hi there, @AngelMamma24. Nice to see you around the community space. Getting Started on Pandora: Pandora offers three ways to listen: free ad-supported Pandora, Pandora Plus, and Pandora Premium. Each option offers access to our industry-leading radio and podcast service. As an ad-supported or Pandora Plus listener, you can access stations designed to introduce you to new music through the artists and songs that you know and love. You can type in your favorite artist or song and Pandora will do the rest. Music that is similar to your musical tastes will play in your station. When listening to stations, you are able to rate music by giving it a Thumbs Up (meaning you like it and want more music like that on your station) or Thumbs Down (meaning you don't like it, or don't want music like that on this particular station). When you give a song a Thumbs Down, that song will never play again on that station. We use a similar, personalized approach to help you discover podcasts and recommend new ones to you. Thumb up podcast episodes you love, and we’ll recommend more podcasts like it! Thumb down episodes you don’t like, and we’ll tune our recommendations accordingly. Pandora Premium subscribers can enjoy the same service along with the ability to listen to music on-demand and create custom playlists. ++ Complimentary Premium Sessions: If you'd like to search for a song and play it immediately, you can do so by enabling a complimentary session of Premium. To start a new session, simply search our library from your computer or mobile device for a song or album, and click play. If you are eligible for a free session of Pandora Premium, clicking play will trigger a short advertisement, after which you can enjoy your on-demand content. Hope this helps! Feel free to let me know if you have any additional questions. Hi there, @AngelMamma24. Nice to see you around the community space. Getting Started on Pandora: Pandora offers three ways to listen: free ad-supported Pandora, Pandora Plus, and Pandora Premium. Each option offers access to our industry-leading radio and podcast service. As an ad-supported or Pandora Plus listener, you can access stations designed to introduce you to new music through the artists and songs that you know and love. You can type in your favorite artist or song and Pandora will do the rest. Music that is similar to your musical tastes will play in your station. When listening to stations, you are able to rate music by giving it a Thumbs Up (meaning you like it and want more music like that on your station) or Thumbs Down (meaning you don't like it, or don't want music like that on this particular station). When you give a song a Thumbs Down, that song will never play again on that station. We use a similar, personalized approach to help you discover podcasts and recommend new ones to you. Thumb up podcast episodes you love, and we’ll recommend more podcasts like it! Thumb down episodes you don’t like, and we’ll tune our recommendations accordingly. Pandora Premium subscribers can enjoy the same service along with the ability to listen to music on-demand and create custom playlists. ++ Complimentary Premium Sessions: If you'd like to search for a song and play it immediately, you can do so by enabling a complimentary session of Premium. To start a new session, simply search our library from your computer or mobile device for a song or album, and click play. If you are eligible for a free session of Pandora Premium, clicking play will trigger a short advertisement, after which you can enjoy your on-demand content. Hope this helps! Feel free to let me know if you have any additional questions."
}