{
  "url": "https://www.stuttgarter-zeitung.de/stuttgart",
  "title": "Stuttgart - Aktuelle Nachrichten, Bilder",
  "text": "Digitale Zeitung News-App Newsletter Podcasts Rätsel Games Sonderthemen Stellenmarkt Mein Abo Abo Abmelden Anmelden Menü Meine StZ Schlagzeilen StZ Extra Stuttgart Stadtbezirke Region Baden-Württemberg Politik Wirtschaft Sport Panorama Kultur Wissen Reise Genuss & Leben Mediathek Bei uns daheim Sie sind angemeldet. Mein Abo Mein Abo Abo-Vorteile Profil verwalten Abo Mein Abo Abmelden Anmelden Startseite Meine Nachrichten (Meine StZ) Merkliste (Meine StZ) Newsletter Stellenmarkt Startseite Meine StZ Schlagzeilen StZ Extra Geld und Karriere Gesundheit Liebes Leben Genuss-Sache Die Story Auszeit Architektur und Wohnen Stuttgart Polizeibericht Stadtkind Stuttgart Hilfe für den Nachbarn Der Antrag Die Aktion Satzung Die Empfänger Kontakt Verein Online spenden Stuttgart im Zweiten Weltkrieg RAF-Podcast Familienleben Familienzeit Familienpolitik Familienalltag Familiengeschichten Hochzeitsguide Brautpaar Trauung Hochzeitplanung Hochzeitsgäste Medizin Stadtbezirke Stuttgart-Mitte Stuttgart-Nord Stuttgart-Ost Stuttgart-Süd Stuttgart-West Bad Cannstatt Birkach Botnang Degerloch Feuerbach Hedelfingen Möhringen Mühlhausen Münster Obertürkheim Plieningen Sillenbuch Stammheim Untertürkheim Vaihingen Wangen Weilimdorf Zuffenhausen Region Landkreis Böblingen Landkreis Esslingen Landkreis Göppingen Landkreis Ludwigsburg Rems-Murr-Kreis Polizeibericht Leonberger Kreiszeitung Marbacher Zeitung Kornwestheimer Zeitung Fellbacher Zeitung Baden-Württemberg Landtagswahl 2026 Politik Wirtschaft Autoindustrie Innovation & Hightech Partner Jobs und Firmen Firmen im Fokus Sport VfB Stuttgart Fußball-Bundesliga Stuttgarter Kickers Lokalsport Stuttgart/Filder Lokalsport Region Esslingen Lokalsport Region Böblingen Lokalsport Region Leonberg Lokalsport Fellbach Lokalsport Marbach/Kornwestheim Sportmeldungen 1. FC Heidenheim 1. Göppinger SV Olympische Winterspiele 2026 Panorama Kultur Wissen Gesund in Stuttgart Moderne Medizin Sport und Prävention Arbeiten im Krankenhaus Showroom - Das Lifestyle Magazin Gartenideen Camperwelt Partner Reise Leserreisen Genuss & Leben Essen & Trinken Mediathek Unsere Videos News Panorama Gesundheit und Fitness MeinVfB PodCannstatt Bei uns daheim Kreis Ludwigsburg Affalterbach Beilstein Benningen Erdmannhausen Großbottwar Kirchberg an der Murr Kornwestheim Marbach Marbach und Bottwartal Mundelsheim Murr Oberstenfeld Pleidelsheim Steinheim Marbach Kornwestheim Kreis Böblingen Fellbach und Kernen Fellbach Schmiden Oeffingen Rommelshausen Stetten Leonberg und Strohgäu mit Umgebung Leonberg Ditzingen Korntal-Münchingen Gerlingen Weil der Stadt Renningen Rutesheim Hemmingen Weissach Heimsheim Friolzheim Wimsheim Mönsheim Unser Bestes Unsere Autorinnen und Autoren StZ News-App StZ News-App StZ News-App Digitale Zeitung im Web Digitale Zeitung als App Digitale Zeitung als App Digitale Zeitung als App Rätsel Games Vorteile im Abonnement Shop Zeitung erleben Aus der Redaktion Hilfe für Nachbarn Zeitung in der Schule Kinderzeitung Instagram Youtube WhatsApp Facebook Immomarkt Trauerportal Sonderthemen Magazine Bekanntschaften Reisemarkt Anzeigen aufgeben StZ Onlineservice Impressum & Kontakt Mediadaten Datenschutzerklärung Ethikrichtlinie Stuttgart Polizeibericht Stadtkind Stuttgart Hilfe für den Nachbarn Stuttgart im Zweiten Weltkrieg RAF-Podcast Familienleben Hochzeitsguide Medizin z Drei Kinder mit Autismus Burnout mit 11 Jahren – Levi geht nicht mehr in die Schule Die drei Kinder von Susanne und ihrem Mann sind im Autismus-Spektrum mit einem besonderen Verhaltensprofil. Der älteste Sohn ist lange krank geschrieben. Wie kann es weiter gehen? Von Viola Volland Flughafen Stuttgart Eurowings baut London-Angebot ab Stuttgart aus Nach dem Rückzug von British Airways gibt es einen Lichtblick für den Flughafen Stuttgart. Eurowings stockt die London-Flüge deutlich auf und nimmt zusätzlich Gatwick ins Programm. Von Christian Milankovic Wetter in Stuttgart und Region Droht Glatteis am Morgen? Das sagt der Wetterdienst In den kommenden Nächten fallen die Temperaturen wieder unter den Gefrierpunkt. Droht deshalb am Morgen Glatteis in Stuttgart und der Region? Das sagt der Wetterdienst. Von Philip Kearney Getöteter DB-Mitarbeiter Schweigeminute für Serkan C. auch am Stuttgarter Hauptbahnhof Die Deutsche Bahn gedenkt am Mittwoch bundesweit des getöteten Mitarbeiters Serkan C. Am Stuttgarter Hauptbahnhof fällt die Schweigeminute allerdings nur aufmerksamen Fahrgästen auf. Von Sascha Maier Wieder Unfall in der Gerokstraße Gefährliche Unfallkurve – wieder Bus-Kollision mit Stadtbahn Linienbus und Stadtbahn stoßen zusammen – erneut ist die Kurve in der Gerokstraße den Stuttgarter Straßenbahnen (SSB) zum Verhängnis geworden. Was steckt dahinter? Von Wolf-Dieter Obst „Wonderful Days“ im Perkins Park „Als wären wir wieder 25“ – eine Zeitmaschine für Stuttgarts Raver Wer hat an der Uhr gedreht? Der Perkins Park wird zur Zeitmaschine: Die Rave-Party „Wonderful Days“ bringt Fans in eine andere Ära zurück – für die Veranstalter ist’s „Herzensliebe“. Von Uwe Bogen Stuttgarter Start-up Digitale Park-Sheriffs schon an mehr als 400 Standorten Die Zeiten von Parkscheiben sind vorbei. Per Videoüberwachung werden Parksünder an Supermärkten entlarvt. Zudem werden die Stellflächen nachts vermietet. Ruft bald eine KI den Abschleppwagen? [Archiv] Von Alexander Müller SSB-Vorhaben in Stuttgart „Bereitet Existenzängste“ – Bauer muss Fläche wegen neuer Stadtbahn abtreten Bis 2034 soll die Stadtbahn U13 bis nach Ditzingen fahren, ein neuer Betriebshof entstehen. Insgesamt 44 Hektar Ackerfläche werden benötigt – alleine vier von Bauer Thomas Ludmann. Von Alexander Müller Nach dem Fasching in den Club? In diesen Stuttgarter Kneipen und Clubs sind Kostüme (nicht) willkommen Wir haben uns umgehört, in welche Stuttgarter Bars, Kneipen und Clubs ihr im Faschingskostüm reinkommt – und wo nicht. Von Katrin Maier-Sohn Ausbildungs-Studie Trotz Sparzwang – Stadt Stuttgart bekommt Bestnoten für Ausbildung Für junge Menschen bleibt die Stadt Stuttgart ein vergleichsweise sicherer Arbeitgeber. Eine bundesweite Studie bescheinigt der Stadtverwaltung Bestnoten bei der Ausbildung. Von Jonas Schöll Sonderthemen und Magazine Studie zu Psychosozialen Zentren Viele traumatisierte Flüchtlinge erhalten im Land keine Psychotherapie 30 Prozent der Geflüchteten benötigen psychologische Hilfe, aber stehen vor Hürden: lange Wartezeiten, Sprachbarrieren, fehlende Finanzierung. Laut Experten fallen viele durchs Raster. Von Nina Ayerle Stadtbahn Stuttgart „Habe allerhöchsten Respekt“ - so schwer ist der Job im SSB-Führerstand Die Stadtbahnen der SSB stehen im Ruf, pünktlich und zuverlässig unterwegs zu sein - wenn nicht gerade gestreikt wird. Was muss man tun, um die gelben Fahrzeuge durch den Verkehr zu manövrieren? Ein Selbstversuch. [Archiv] Von Christian Milankovic Stuttgarter Fernsehturm Wahrzeichen und Besuchermagnet – Der Fernsehturm wird 70 70 Jahre hat der Fernsehturm auf dem Buckel. Folgerichtig wird 70 Stunden Geburtstag gefeiert. Als Geschenk bekommt der Turm eine Schönheits-OP. Von Frank Rothfuß Stuttgarter Wahrzeichen Kaviar, Superstars, eine Pleite – die kulinarische Geschichte des Fernsehturms Acht Pächter haben in 70 Jahren das Restaurant im Fernsehturm geführt – jeder mit anderem Ansatz. Heute lässt sich das Panoramacafé nur mit Events lukrativ betreiben. Von Kathrin Haasis Altersresidenz im Zoo Karlsruhe Elefantenflüsterin Claudia Vollhardt: „In Deutschland einzigartige Haltungsform“ Im Zoo Karlsruhe ist die 47-jährige Claudia Vollhardt für die Elefanten zuständig. Die Biologin schafft es dort, unterschiedliche Tiere zu integrieren. Wie gelingt das? Von Iris Frey Zoo in Stuttgart Fast 1000 Euro im Monat für Podcast – was sich die Wilhelma davon erhofft Die Wilhelma startete kürzlich einen eigenen Podcast. Der Stuttgarter Zoo lässt sich das 900 Euro im Monat kosten, wie das Finanzministerium mitteilt. Wie wird das Format genutzt? Von Iris Frey Real-Madrid-Fanclub in Stuttgart Ist das KI oder kann das weg? Was Stuttgarter Kreative daraus machen Eine Ausstellung in der spanischen Sportsbar Peña Real Madrid zeigt, wie Stuttgarter Kunstschaffende mit KI umgehen – kritisch, überraschend und mit Blick auf bedrohte Jobs. Von Uwe Bogen Stuttgarter kämpfen für Demokratie Aus der Schockstarre heraus auf die Straße – für Europa Trump, Putin, Populismus – Europa steht mächtig unter Druck. Einige Stuttgarter wollen für Demokratie, Freiheit und Grönland auf die Straße gehen – und das regelmäßig. Von Jürgen Bock Kinderbetreuung in Stuttgart Kita-Platz gesucht? – Das sollten Eltern über das neue Vergabeverfahren wissen Familien in Stuttgart sollen leichter den passenden Kita-Platz finden. Das Kita-Portal soll dabei helfen. So funktioniert es. Von Alexandra Kratz Elizabeth II. auf dem Fernsehturm Wer darf mit der Queen in den Aufzug? Tragen die Damen Hut? Wie viele Menschen quetschen sich mit der Queen in einen Aufzug? Und was bietet man als Erfrischung an? Der Besuch von Elizabeth II. und Prinz Philip in Stuttgart brachte vor über 60 Jahren die Mitarbeiter im Rathaus ins Schwitzen. Von Theresa Schäfer Millionen-Projekt in Sillenbuch Umbau des Geschwister-Scholl-Gymnasiums für 187 Millionen Euro startet Lernlandschaften ohne Türen, Laubengänge und eine Dachterrasse – das Geschwister-Scholl-Gymnasium in Sillenbuch wird erneuert. Doch zunächst kommen Baulärm und Provisorien. Von Caroline Holowiecki Mensa-Löffel in der WG-Küche? Geschirrschwund an Unis – in Stuttgart werden jährlich tausende Löffel ersetzt Habt ihr auch schon mal Besteck aus der Mensa mitgehen lassen? Tassen, Löffel und Gabeln kommen in der Uni-Mensa besonders schnell abhanden. Ist es Diebstahl oder nur Unachtsamkeit? Von Alexandra Kratz Vor 100 Jahren geboren Elisabeth Guttenberger – die einzige ihrer Familie, die den Holocaust überlebte Ihre „schönsten Jahre“ verbrachte sie als Heranwachsende in Stuttgart. Danach begann das Grauen. Erinnerung an die Auschwitz-Überlebende und Mahnerin Elisabeth Guttenberger. Von Jan Sellner Streit um Behindertenhilfe Stadt erklärt: „Müssen Bedarfe von 5367 Personen prüfen – Leute sind überlastet“ Warum ist die Stadt mit Zahlungen an Träger der Eingliederungshilfe in Verzug? Wie erklären sich die Außenstände in Millionenhöhe? Die Sozialbürgermeisterin nimmt im Interview Stellung. Von Lisa Welzhofer und Jan Sellner S-Bahn Stuttgart Trotz Chaos wachsen die Fahrgastzahlen Probleme prägten das Jahr 2025. Trotzdem legten die Zahlen der S-Bahn Stuttgart leicht zu – bleiben aber 20 Prozent unter dem Vorkrisenniveau. Eine Linie gilt als Fahrgastmagnet. Von Christian Milankovic Eberhardstraße Stuttgart Abriss des Schwabenzentrums – so ist der neueste Stand Das Ende einer Ära in der Stuttgarter Innenstadt: Teile des Schwabenzentrums weichen einem modernen Gebäudekomplex, dem Central One. Das ist der aktuelle Stand der Abrissarbeiten. Von Torsten Ströbele Femizid im Wohnheim Frauen erinnern an Maha D. und protestieren gegen Gewalt „Stoppt Femizide“ ist das Thema einer Kundgebung, mit der das Frauenkollektiv Stuttgart an die getötete Pflegehelferin Maha D. erinnert. Von Christine Bilger Stuttgart-Album zum Wahrzeichen 70 Jahre Fernsehturm: Eine Liebeserklärung an Stuttgarts „Schnapsidee“ Zur Eröffnung des Fernsehturms vor 70 Jahren gratulierte OB Arnulf Klett dem SDR zur „Schnapsidee“ mit Schnaps in Turmform. Wir blicken auf die Historie zurück. Eine Liebeserklärung. Von Uwe Bogen Fünfte Jahreszeit in Stuttgart „Lassen alles andere stehen und liegen“ – Stuttgarter Familie lebt den Fasching Die Narren sind los! Bei den Rössleins aus Stuttgart ist die fünfte Jahreszeit eine Familientradition. Wie die Familie den Fasching erlebt und was generationsübergreifend begeistert. Von Nina Scheffel Schlägerei im Waranga Bewährungsstrafe und Geldstrafe für Mutter und Tochter Die Vorgeschichte eines Handgemenges in der Bar am Kleinen Schlossplatz lässt sich nicht mehr aufklären. Dennoch fällt ein klares Urteil. Von Christine Bilger Pilotprojekt in Weilimdorf OB Nopper gegen flächendeckendes Tempo 30 in Stuttgart Die Umsetzung einer StVO-Novelle sorgt im Rathaus für Debatten: Tempo 30 soll generell vor Einrichtungen wie Schulen und Kitas gelten. Wie wirkt sich das auf Stuttgarts Straßen aus? Von Sebastian Steegmüller Was bedeutet das für Reisende? Schnee-Chaos am Frankfurter Airport – Flieger landen in Stuttgart Schnee-Chaos am Frankfurter Flughafen: Mehrere Maschinen weichen nach Stuttgart aus. Was das für Reisende bedeutet – und wie es für sie weitergeht. Digitale Parküberwachung Stuttgart hat mit dem Scannen von Parksündern keine Eile Erst Ende 2027 wird in Stuttgart ein erstes Testfahrzeug Falschparker im Vorbeifahren identifizieren. Wo die Stadtverwaltung die Hürden sieht. Von Andreas Geldner Insolvenz Stuttgarter Modehändler: Wie hoch ist die Chance auf Rettung von Felix W.? Erst aus unserer Zeitung erfuhren die Beschäftigen von Felix W., dass der Modehändler insolvent ist. Am Dienstag war eine Mitarbeiterversammlung. Wie geht es weiter? Von Uwe Bogen A8 bei Stuttgart Lkw-Unfall sorgt für kilometerlangen Stau und Folgeunfälle Ein Lkw-Unfall in der Nacht auf Dienstag sorgt auf der A8 bei Stuttgart für stundenlange Sperrungen, lange Staus und zwei weitere Kollisionen im morgendlichen Berufsverkehr. Von Julia Hawener Linken-Spitzenkandidatin Plakate von Mersedeh Ghazaei mit Hakenkreuzen beschmiert Kaum hängen die ersten Plakate im Wahlkampf, werden manche beschädigt. Die Linke wird in Stuttgart bereits zum zweiten Mal Ziel von mutmaßlich politisch Angriffen. Von Sascha Maier Fasching in Stuttgart Vereine unter Druck – „Ohne Zuschüsse sind die Fasnetsumzüge gestorben“ Die Faschingsumzüge in den Stuttgarter Stadtteilen Hofen und Mühlhausen sind ein organisatorischer Kraftakt. Besonders die steigenden Kosten setzen die Vereine unter Druck. Von Iris Frey Studie zu Aquathermie in Stuttgart Neckar als Riesenquelle fürs Heizen in Stuttgart – Experte erklärt Entdeckung Theoretisch könnte ein Großteil von Stuttgart mit Neckarwärme heizen. Praktisch gibt es Einschränkungen. Damit mehr klappt, hat ein Forscher aus Braunschweig einen Rat für Stuttgart. Von Judith A. Sägesser Anlaufstelle im Alten Waisenhaus Carlos Santana hilft neuer Stiftung für krebskranke Kinder in Stuttgart Wenn ein Kind an Krebs erkrankt, gerät die Welt ins Wanken. Eine neue Stiftung startet in Stuttgart, um Familien unbürokratisch zu helfen – eng verbunden mit anderen Initiativen. Von Uwe Bogen Mehrere Feuer in Stuttgart gelegt Polizei sucht nach mutmaßlichen Brandstiftern Unbekannte sollen am Montagabend insgesamt drei Brände in der Innenstadt von Stuttgart gelegt haben. Die Kriminalpolizei sucht Zeugen. Von jbr Januar-Wetter in Stuttgart Der Winter klopft mal wieder an Der Januar war ein Wintermonat, wie man ihn von früher kennt. Es gabt tatsächlich Kälte und Schnee. Und dazu noch reichlich Sonne. Von Jürgen Löhle Stuttgarter Wahrzeichen wird 70 Happy Birthday, lieber Fernsehturm! Festwoche beginnt mit Zauberei Thorsten Strotmann eröffnet die Festwoche zum 70. Geburtstag des Stuttgarter Fernsehturms mit Tricks, Witz und Charme. Der Stolz der Stadt wird bis Samstag ganz groß gefeiert. Von Uwe Bogen Unfall in Stuttgart-Ost E-Scooter-Fahrer wird bei Sturz schwer verletzt Ein 37-Jähriger will in Stuttgart-Ost mit seinem E-Scooter vom Bordstein auf die Straße wechseln und stürzt. Dabei wird er schwer verletzt und muss in einer Klinik behandelt werden. Von Jörg Breithut Innenstadt Stuttgart Leerstand im Königsbau: Darum will das Land die Eppli-Flächen umbauen Die prominenten früheren Flächen des Auktionshauses Eppli im Stuttgarter Königsbau stehen leer. Wir haben bei der BW-Stiftung nachgefragt, wie es dort weitergehen soll. Von Torsten Ströbele Neues Projekt für Zahngesundheit Einzigartige Zusammenarbeit zum Wohle der Patienten Wer zurück ins Leben will, braucht Hilfe – und gute Zähne. Der Verein „Hilfe für den Nachbarn“ der StZ und die Zahnmedizinische Patientenberatungsstelle des Landes helfen. Von Carola Stadtmüller Stadtbibliothek Stuttgart Neustart mit Ende 50 – „Für mich hat sich ein Traum erfüllt“ Marcus Gundlach war viele Jahre in den Neckartalwerkstätten. Nun ist er Fachangestellter in der Kinderbibliothek. Gelungen ist ihm das über einen inklusiven Arbeitsplatz. Von Viola Volland Oldtimer-Rennen in Region Stuttgart Solitude Revival fällt 2026 aus – so geht es mit dem Motorsport-Event weiter Auf der alten Solitude-Rennstrecke werden seit 2008 alle zwei Jahre Oldtimer-Rennen ausgetragen. Die Veranstaltung zieht Tausende von Motorsport-Fans an. In diesem Jahr fällt sie aus. Von Andreas Schröder Zuschüsse der Stadt Stuttgart Für diese drei Förderprogramme kann man noch Anträge stellen Zuschüsse fürs Heizen und Dämmen oder für eine Solaranlage werden in Stuttgart deutlich gekürzt. Doch wer schnell entschlossen ist: die alten Sätze gelten für manche Programme noch. Von Thomas Faltin Nahverkehr in Stuttgart Buslinie 42 soll alle fünf Minuten durch die Innenstadt fahren Der Stuttgarter Gemeinderat beschließt den Nahverkehrsplan für die kommenden fünf Jahre. Auch beim „Flughafenbus“ vom Neckartal auf die Fildern soll der Takt erhöht werden. Von Alexander Müller Reparatur im Haushalt Erst spät geht ihm ein Licht auf Wir alle haben davon mal gehört: Ein Gerät tut nicht, der Elektriker kommt und stellt fest, dass der Stecker nicht steckt. Es geht noch besser. Von KNITZ Meistgelesen in Stuttgart Galeria in Stuttgart Insolvenz-Gerüchte zum Trotz – In Stuttgart laufen die Geschäfte Unfall am Pragsattel 23-Jähriger kracht mit Lamborghini gegen Mauer – immenser Schaden Dramatischer Rettungseinsatz Klinikum Stuttgart rettete sein Leben – Patient spendet gewaltige Summe aus Dank ANZEIGE Prospekte und Angebote von"
}