{
  "url": "https://www.thefreedictionary.com/old",
  "title": "Old - definition of old by The Free Dictionary",
  "text": "old Also found in: Thesaurus, Medical, Legal, Acronyms, Idioms, Encyclopedia, Wikipedia. old (ōld)These adjectives describe what belongs to or dates from an earlier time or period. Old is the most general term: old lace; an old saying. Ancient pertains to the distant past: \"the hills, / Rock-ribbed, and ancient as the sun\" (William Cullen Bryant). Archaic implies a very remote, often primitive period: an archaic Greek bronze of the seventh century bc. Antediluvian applies to what is extremely outdated: \"I ... went out to reconnoiter a fresh typewriter ribbon for Professor Mitwisser's antediluvian machine\" (Cynthia Ozick). Antique is applied to what is especially appreciated or valued because of its age: antique furniture; an antique vase. Antiquated describes what is out of date, no longer fashionable, or discredited: \"No idea is so antiquated that it was not once modern. No idea is so modern that it will not someday be antiquated\" (Ellen Glasgow). old (əʊld)old (oʊld)adj. old•er, old•est eld•er, eld•est, adj. old Old is most commonly used for describing the age of a person or thing. For example, you say that someone 'is forty years old'. You can also describe someone as, for example, 'a forty-year-old man'. Don't say 'a forty-years-old man'. You can also say that someone is 'a man of forty'. However, don't say 'a man of forty years old'. You use old after how when you are asking about the age of a person or thing. You can also use old to describe someone who has lived a very long time. This use of old can sometimes sound rude. Elderly is a more polite word. You can talk about old people as the elderly. An old friend is someone who has been your friend for a long time. He or she is not necessarily an old person. An old building or other object was built or made a long time ago. Old can sometimes mean 'former'. For example, your 'old teacher' is someone that used to be your teacher. He or she is not necessarily an old person. old aged young, juvenile, youthful, immature out of date new, the new, recent, current, modern, novel, fashionable, up-to-date, modish, du jour (French), culty \"No man is ever so old but he thinks he can live another year\" [Cicero De Senectute] \"There's many a good tune played on an old fiddle\" \"You can't teach an old dog new tricks\" old adjectiveold [əʊld]an old man → un viejo, un anciano an old woman → una vieja, una anciana he's a bit of an old woman → es un poco Doña Remilgos an old lady → una señora mayor or anciana a little old lady → una viejecita, una ancianita old people; old folks → los viejos; (more respectful) → los ancianos, las personas mayores to live to be old → llegar a una edad avanzada if I live to be that old → si llego a esa edad to be old before one's time → hacerse mayor antes de tiempo to be old beyond one's years → ser maduro para la edad que se tiene he's old for his age or for his years [child] → es muy maduro para su edad that dress is too old for you → ese vestido es para alguien mayor que tú, ese vestido no es apropiado para tu edad to get or grow old → envejecer he's afraid of getting or growing old → tiene miedo a envejecer he's getting old → se está haciendo viejo to get older → envejecer as we get older → según envejecemos ... to look old → parecer viejo → estar avejentado she's not as old as she looks → no es tan vieja como parece as old as Methuselah → más viejo que Matusalén he/she has an old head on young shoulders → es maduro/a para su edad see also dirty A4 see also fogey, fool A1 see also teach A2 Laura is six weeks/months/years old → Laura tiene seis semanas/meses/años she's three years old today → hoy cumple tres años he'll be six weeks old tomorrow → cumplirá seis semanas mañana a six-week-old baby → un niño de seis semanas a five-year-old (child) → un niño de cinco años the building is 300 years old → el edificio tiene 300 años the company is a century old → la compañía existe desde hace un siglo at ten months old she was already walking → cuando tenía diez meses ya andaba she is two years older than you → tiene dos años más que tú you'll understand when you are older → cuando seas mayor lo entenderás when you are older it's harder to change jobs → cuando eres mayor es más difícil cambiar de trabajo their oldest child → su hijo mayor she is the oldest → es la mayor she is the oldest teacher in the school → es la profesora de más edad del colegio to be old enough for sth/to do sth → tener edad para algo/para hacer algo she's old enough to go alone → ya tiene edad para ir sola he's old enough to know better (to have more sense) → a su edad debería tener más sentido común, ya es mayorcito para saber lo que está bien y lo que está mal; (to behave better) → a su edad debería portarse mejor she's old enough to be your mother → con la edad que tiene, podría ser tu madre you're as old as you feel → eres tan viejo como te sientes see also generation he's an old friend of mine → es un viejo amigo mío that's an old problem → eso no es nada nuevo, eso ya viene de atrás it's a very old tradition/custom → es una vieja tradición/costumbre, es una tradición/costumbre antigua the old ways survived in some country areas → las viejas costumbres perduraron en algunas partes del campo an old family → una familia de abolengo see also score A4 my old flat was very small → mi antiguo piso era muy pequeño the old country → la madre patria, la patria in the old days → antaño, en los viejos tiempos the good old days → los viejos tiempos it's not as good as our old one → no es tan bueno como el anterior my old school → mi antiguo or viejo colegio of the old school (fig) → de la vieja escuela for old times' sake → por los viejos tiempos good old Mike! → ¡este Mike! come on, old man! > (o.f.) → ¡venga hombre! she's a funny old thing → es rarita my or the old lady or woman (= mother) → mi or la vieja; (= wife) → la parienta my or the old man (= father) → mi or el viejo; (= husband) → mi marido any old any old thing will do → cualquier cosa sirve it's not just any old painting, it's a Rembrandt → no es un cuadro cualquiera, es un Rembrandt just put it any old where → ponlo en cualquier parte he leaves his things any old how → deja sus cosas de cualquier manera I parked the car any old how → aparqué el coche de cualquier manera we had a high old time → hacía tiempo que no nos divertíamos tanto it's the same old story → es la misma historia de siempre their music appeals to old and young alike → su música gusta tanto a jóvenes como a viejos the circus appeals to old and young alike → el circo gusta igualmente a grandes y pequeños of old: to know sb of old → conocer a algn desde hace tiempo knights/legends of old → los caballeros/las leyendas de antaño (liter) in days of old → antaño (liter), en los tiempos antiguos in one's old age → en la vejez perhaps I'm going soft in my old age → quizá me estoy ablandando al hacerme viejo or en la vejez he is unable to travel much because of old age → no puede viajar mucho debido a su edad see also ripe old age pension N → subsidio m de la tercera edad, pensión f old age pensioner N → pensionista mf, jubilado/a m/f the Old Bailey N (Brit) el tribunal de lo penal de más alto rango de Inglaterra the Old Bill N (Brit) → la poli, la pasma (Sp) old boy N (= former pupil) → ex-alumno m, antiguo alumno m (o.f.) (= old chap) → amigo m mío the old-boy network (esp pej) → el amiguismo the old brigade N → los veteranos old campaigner N → veterano m old chestnut N (= joke) → broma f muy pasada; (= story) → historia f muy pasada Old Dominion N (US) el estado de Virginia Old English N → inglés m antiguo ANGLO-SAXON Old English Sheepdog N → perro m pastor ovejero inglés old flame N → antiguo amor m old folks' home N → residencia f de ancianos old girl N (= former pupil) → ex-alumna f, antigua alumna f; (= elderly woman) → señora f, abuelita f Old Glory N (US) bandera de los Estados Unidos old gold N → oro m viejo the old guard N → la vieja guardia old hand N → veterano/a m/f he's an old hand at photography → es un veterano de la fotografía old lag N (= old prisoner) → (preso/a m/f) veterano/a m/f; (= ex-prisoner) → ex-presidiario/a m/f old maid N (pej) → solterona f she'll end up an old maid → se quedará para vestir santos Old Man River N (US) el río Mississippi old master N (= work) → obra f maestra de la pintura clásica; (= painter) → gran maestro m de la pintura clásica old money N → dinero m de familia Old Nick N (hum) → Pedro Botero (hum) old people's home N → residencia f de ancianos old salt N (Naut) → viejo lobo m de mar old school tie N (Brit) (lit) corbata con los colores representativos de la escuela a la que alguien ha asistido the old school tie (fig) → el amiguismo old soldier N → veterano m, excombatiente m the Old South N (US) → el viejo sur old stager N → veterano/a m/f Old Testament N → Antiguo Testamento m old wives' tale N → cuento m de viejas, patraña f the Old World N → el Viejo Mundo, el Viejo Continente see also old-world Position of \"viejo\" and \"antiguo\" Viejo and antiguo can go either before or after the noun, depending on their meaning. Viejo Antiguo old [ˈəʊld] adjan old tree → un vieil arbre an old dog → un vieux chien an old house → une vieille maison how old is it? → quel âge ça a? How old do you think these tombs are? → Quel âge pensez-vous qu'elles aient, ces tombes? It's 10,000 years old → Ça a 10 000 ans. an old man → un vieil homme old people → les personnes âgées how old are you? → quel âge as-tu or avez-vous? He's ten years old → Il a dix ans. She's two years older than me → Elle a deux ans de plus que moi. I'm the oldest in the family BUT Je suis l'aîné de la famille. He wasn't old enough to understand BUT Il n'était pas assez âgé pour comprendre. You'll understand when you're older BUT Tu comprendras quand tu seras plus âgé. → Tu comprendras quand tu seras plus vieux. to be older than sb → être plus âgé que qn, être plus vieux que qn He's older than me → Il est plus âgé que moi., Il est plus vieux que moi. my older brother → mon frère aîné my older sister → ma sœur aînée an old friend of sb's Pete's an old friend of mine → Pete est un vieil ami à moi., Pete est un de mes vieux amis. my old English teacher → mon ancien professeur d'anglais his old job at the town hall → son ancien travail à la mairie Any old paper will do → N'importe quel papier fera l'affaire. any old thing will do → n'importe quoi fera l'affaire old daysold age n → vieillesse f in their old age → pendant leurs vieux joursold age pension old-age pension n (British) (= state pension) → retraite fold age pensioner old-age pensioner n (British) → retraité(e) m/f She's an old age pensioner → Elle est retraitée.Old Bailey [ˌəʊldˈbeɪlɪ] n (British) the Old Bailey cour d'assises de Londresold bat n → vieille chouette fOld Bill n (British) the Old Bill → la rousse old boy n [school] → ancien élève mold days npl in the old days → au temps jadis in the good old days → au bon vieux temps old old :old :old :old :old :old [əʊld]an old man → un vecchio old people or folk(s) → i vecchi, gli anziani to grow or get old(er) → invecchiare he's old for his years → è maturo per la sua età the old country → la madrepatria as old as the hills → vecchio/a come Matusalemme or come il cucco the old part of Glasgow → la zona vecchia di Glasgow an old friend of mine → un mio vecchio amico here's old Peter coming! (fam) → ecco che arriva il vecchio Peter! she's a funny old thing (fam) → è un tipetto buffo we had a high old time (fam) → ci siamo divertiti un sacco any old thing will do (fam) → va bene qualsiasi cosa I say, old man or old boy! (old) → vecchio mio! my old man (fam) (father) → il (mio) vecchio she is 8 years old → ha 8 anni an 8-year-old boy → un bambino di 8 anni she is 2 years older than you → ha 2 anni più di te older brother/sister → fratello/sorella maggiore my older brother → mio fratello maggiore the older generation → i vecchi he's old enough to look after himself → è grande abbastanza per sbrigarsela da solo to be old enough to vote → avere l'età per votare you're old enough to know better! → alla tua età dovresti avere più senno! when you're older (to child) → quando sarai grande if I were 20 years older → se avessi 20 anni di più my old school → la mia vecchia scuola in the old days → una volta, ai vecchi tempi it's not as good as our old one → non è buono come quello vecchio old (əuld) adjectiveold → عَجُوزٌ, قَدِيـم starý gammel alt παλιός antiguo, viejo vanha ancien, vieux star vecchio 古い, 年取った 나이든, 오래된 oud gammel stary antigo, velho старый gammal เก่า, แก่ eski, yaşlı cũ, già 老的old - How old are you? - I'm fifty years old - He's ten years old (US) He is ten years old (UK) - She's twelve years old (US) She is twelve years old (UK)"
}