{
  "url": "https://www.reddit.com/r/meth/comments/13yb57u/how_to_smoke_a_written_guide/",
  "title": "Reddit - The heart of the internet",
  "text": "How to Smoke: A Written Guide This is my own guide I've written. I'm not an expert, so feel free to add any notes, comments or criticisms, or anything you'd add to it. Thanks. There is a little more to smoking than meets the eye. Many people struggle to get decent hits or to get hits without burning their product. Allow me to give a bit of a guide to getting the best hits, while preserving the integrity of your product (not burning it). First there are a couple key fundamentals you should know: - Being able to see into your bowl and monitor your vapor production as you hit it, and adjusting accordingly is probably the most important thing to do. - Have fun and do your best. Equally as important. As long as you know these things, you should be able to get a proper hit whether it's with a lighter, a torch, a heat gun, or a lens and series of mirrors that take a concentrated beam from the sun and redirect it beneath your bowl. Why are they important? Because you don't want to burn your shit as well as you want to make sure you're going to get a good hit. Monitoring your vapor production throughout yout hit will provide you with insight into whether or not you need to adjust any of your controlled variables and do so accordingly. Also, friendly, good-natured encouragement can be just what you need to perservere and help you overcome your adversities and succeed, if smoking properly has been a challenge for you. Let's walk through it step by step, beginning to end. - Make sure you can see into that bowl. You wanna be able to see at least the top half above the stem area, while you hit it, so if you're lazy and only want to clean that quadrant of your residue-ridden bowl, then at least you did that much, but ideally, a quick torching of at least the stemmed half of your bowl to clear away any fog or residue, will be your best bet for success. - Put product in your bowl. You don't want to put too much. Too much will cause you to need to hit it up too many times to get it gone, which will result in nastiness. You also may have to heat it up more than it would be necessary otherwise, as you are trying to melt stuff through already melted stuff and getting that stuff hotter than it needed to be. I'd say the sweet spot is around 100-150 mg. - There is one thing you want to have determined before this next step. Are you going to be taking a hit or just melting it down? It should be noted that often people will choose to not hit it on the first melt. Some say that they are burning off the cut with that first melt which I have my doubts about. Others do it just so they can get a nice crackback to start with. Another thing I will quickly note is in regards to cooling it down. Regardless of whether or not you are taking a hit off the first melt, some people prefer to cool down their bowl as quickly as possible after every melt. I usually just let mine cool to room temperature on its own, but some people choose to quickly rub it on a pant leg for a couple seconds to transfer some of the heat, or even better using a very lightly dampened rag or towel. It's very important that your rag not be dripping wet or soaking wet. Too much water will be too radical of a temperature change too quickly and you will be likely to break your glass. The idea behind letting it cool faster is that it is less time spent at hotter temps where your product may be experiencing temperature induced destruction of the good stuff. In other words, the time it takes to cool down is time spent \"burning\" your product. Another benefit of cooling it down quicker, is I find that I always get way better clouds if I let it cool right back down to room temperature before I try hitting it. This also applies to between each successive hit as well. By cooling it down quick, it will be ready to take another hit that much quicker. In my experience, it is better to have your stuff cracked back beforehand when trying to get a decent hit. The idea with cracking it back, is that you want to have your product spread out uniformly throughout the bowl. This allows you melt and vaporize it more efficiently and uniformly with less chance of burning any of it. This is one area where I personally stray from standard practices, as I have a better time starting with more of a condensed puddle that I've allowed to sort of crackback out each way a bit, but not so spread. Feel free to experiment and see what works best for you. 4. Heat your bowl. You want to concentrate your heat on the very bottom of the bowl only, so it's not necessary to start rolling your bowl right away. Be mindful you don't get your heat too close or apply it for too long. Using a Bic, the tip of your flame to the bottom of the bowl should be about a ¾\" gap. If you're using a torch, it'll be different depending on your torch, as there are many varieties and some are more intense than others. But for a single jet torch that has a flame around ¾\" long, somehwere around like 1.5\" - 2\" away or so. Remember, patience is your friend. You don't need to melt it as fast as possible, just melt it in general. If you go nice and slow, keeping your heat at a distance without applying it for too long, you can smoke your entire bowl without burning any of it. It's recommended that you get good with a Bic before you try getting good with a torch, as it's good to understand the fundamentals of what you're doing exactly first, and Bics are far more forgiving when it comes to making mistakes. 5. Anyways, regardless of whether or not you melted down your product beforehand, let's assume you're about to take your first hit. I usually melt my shit down about 80% of the way, or until you can see vapor starting to swirl around in there a fair bit. This when you can start inhaling. Sometimes if you heated your shit up for a bit too long, that first bit may have a slight taste, so I usually just blow out through the pipe just the tiniest bit before I start inhaling. 6. You want to make sure that you have a decent seal around the stem of your pipe. It doesn't need to be 100%, but ideally you want almost all of your air intake to be coming in through the pipe alone. Sometimes you may notice the vapor you're breathing in can be quite warm and almost be uncomfortable on the lip, so I like to have the end of the stem placed just inside my lip to avoid that. 7. Slowly roll the bowl from 10 o'clock to 2 o'clock while keeping your heat applied. You should be able to see into your pipe as you do this and see that you are creating lots of vapor that you are slowly inhaling. You don't want to go so slow that you begin to burn your shit, but also not so fast that the airflow cools your stuff so much that it prevents vapor from forming. You are just monitoring your vapor production as you hit and adjusting any of your control variables accordingly to maximize that vapor production. This part all just comes down to practice. Try and take a nice, big inhale. Fill those lungs right up. There Is an old myth that it recrystallizes in your lungs, but because your lungs are very moist, and meth is water soluble, that is definitely not the case. There is some debate for how long it should be held for, but I'm not gonna speak on that beyond saying to try some experimenting for yourself. That's basically all there is to it. Remember, it's all about having fun and doing your best!"
}