{
  "url": "https://www.webmd.com/hepatitis/what-is-apri-score",
  "title": "What Is the APRI Score?",
  "text": "APRI is short for aspartate aminotransferase to platelet ratio index. Itâs a way for doctors to measure how healthy your liver is when you have a liver disease. Some health problems, including hepatitis, drinking too much alcohol, or a buildup of fat, can lead to inflammation in the liver and, after several years, liver disease. Scars can form on the organ. Doctors call this scarring fibrosis. When thereâs too much fibrosis in the liver, scar tissue replaces healthy tissue. This leads to cirrhosis, a life-threatening condition that makes it hard for the liver to work well. The APRI score measures the amount of fibrosis in the liver. How Does It Work? The APRI score is based on the amount of aspartate aminotransferase (AST) and platelets in your body. AST is an enzyme your liver creates. Platelets are a type of blood cell that help heal wounds and stop heavy bleeding. Your doctor can check your AST and platelet levels with a blood test. It will show if your results are normal, low, or high. AST. Normally, your blood has low levels of AST. But a damaged liver releases more of the enzyme, which causes levels to rise. High levels of AST in your blood usually mean cirrhosis. Platelets. The ideal platelet range is 150,000 to 400,000 per microliter (mcL) of blood. Doctors consider platelet counts above 400,000 high. When this happens, your body is making too many platelets, which raises your risk of blood clots. A low count is anything below 150,000, but results less than 50,000 mean you have a greater risk of heavy bleeding. People who have cirrhosis often have low platelet counts. These two results help doctors calculate your APRI score. How Is It Calculated? The formula for the APRI score is [(AST/upper limit of the normal AST range) X 100]/Platelet Count. Itâs a little tricky, but if you break it down into steps, itâs easier to understand. - Divide your AST count by the upper limit of the normal AST range. Most experts say that 40 is a good value to use here. - Multiply that answer by 100. - Divide that answer by your platelet count. The answer is your APRI score. APRI Score and Your Health There are two numbers to keep in mind to understand your APRI score: 0.5 and 1.5. If your score is less than or equal to 0.5, your liver is either completely free of fibrosis or has a tiny bit of scarring. If you have an APRI score of 1.5 or greater, your liver has scarring and likely some cirrhosis. The APRI score is a less expensive, less invasive way to check for scarring than a liver biopsy. Thatâs when doctors remove a piece of your liver to check it for damage. If youâre living with a health problem that can damage your liver, ask your doctor about your APRI score. It can help you monitor the health of one of your most vital organs."
}