{
  "url": "https://www.worldatlas.com/cities/dnipro-ukraine.html",
  "title": "Dnipro, Ukraine",
  "text": "Dnipro, Ukraine Formerly referred to as Dnipropetrovsk, Dnipro is a city of regional significance, situated along the Dnieper River close to its meeting point with the Samara River, in the Dnipropetrovsk Oblast, in the eastern portion of Ukraine. Named after the Dnieper River, Dnipro serves as the administrative center of the Dnipropetrovsk Oblast as well as the administrative seat of the Dnipro urban hromada. Dnipro is considered the fourth largest city in Ukraine after the cities of Kyiv, Kharkiv, and Odesa. It is also one of the country’s largest metallurgical and machine-building centers. Geography Of Dnipro The city of Dnipro covers an area of 409,718 sq. km and is situated along both the banks of the Dnieper River, close to its meeting point with the Samara River. The city center stands on the right bank, which forms a part of the Dnieper Upland, while the left bank forms a part of the Dnieper Lowland. The 50-80m wide Dmytro Yavornytsky Prospect forms the central axis of the city center. The city’s principal administrative and public buildings are located on the Dmytro Yavornytsky Prospect. The city of Dnipro is administratively divided into eight “city districts” and is governed by the Dnipro City Council. The eight “city districts” are Amur-Nyzhnodniprovskyi, Shevchenkivskyi, Sobornyi, Industrialnyi, Tsentralnyi, Chechelivskyi, Novokodatskyi, and Samarskyi. Climate According to the Köppen climate classification, the city of Dnipro experiences a humid continental climate with warm summers and freezing, snowy winters. The warm season lasts from May to September, with July being the hottest month, having an average high temperature of 28.3°C and a low temperature of 16.6°C. The cold season lasts from November to March, with January being the coldest month, having an average low temperature of -6.1°C and a high temperature of -0.5°C. The city receives an average precipitation of 569mm and an average extreme snow depth of 10cm. The city gets a mix of snow and rain during December. Therefore, the best time to visit the city is during late spring in April and May and early autumn in September and October. The Population And Economy Of Dnipro As of 2021, the city of Dnipro had a population of 980,948 inhabitants. The city has a population density of 2,411 inhabitants per sq. km. The metro area population of Dnipro in 2021 was 993,220 inhabitants. Dnipro is considered one of the principal industrial centers of Ukraine. The city hosts several facilities devoted to heavy industries producing various products, including launch vehicles, rolled metal, cast iron, machinery, agricultural equipment, different chemicals, etc. In addition to this, the city also contains many food processing, light industry, sewing, and dress-making factories. Several metallurgical enterprises are based in the city, accounting for more than 47% of the city’s industrial output. The city also serves as the principal import hub for foreign goods and accounts for over 58% of the Dnipropetrovsk Oblast’s imports. An American private aerospace firm named Firefly Aerospace has recently opened a Research and Development center in the city to produce small and medium-sized launch vehicles for commercial launches. Tourist Attractions In Dnipro Dmytro Yavornytsky National Historical Museum Established in 1849 by the local Governor Andriy Fabr, the Dmytro Yavornytsky National Historical Museum located in Dnipro is one of the oldest museums in Ukraine. The museum houses about 283 thousand objects dating from the ancient Paleolithic Age to the Second World War. Some of the notable objects in the museum include the Kernosovskiy idol, the Kurgan stelae, and a massive collection of cossack’s antiquities. Taras Shevchenko Park The Taras Shevchenko Park is a large park located on the right bank of the Dnieper River. It is one of the most popular parks in the city of Dnipro. The park has been named in honor of the Ukrainian poet Taras Hryhorovych Shevchenko. Transfiguration Cathedral The Saviour’s Transfiguration Cathedral serves as the principal Orthodox Church in the city of Dnipro. The Austrian Emperor Joseph II and Empress Catherine II of Russia laid the church's foundation stone on May 20, 1787. The church was designed by the Russian Imperial architect Andreyan Zakharov. However, the church remained closed for worshippers during 1930, and from 1975 to 1988, it housed a museum of atheism. Bombs damaged the church building during the Second World War. Brief History Archaeological findings have revealed that the first fortified town existed around the mid-16th century in the area of the present city of Dnipro. Prince Grigori Potemkin founded the city in 1776 at the site of the Cossack village of Polovtsia. The city was initially named “Yekaterinoslav” in honor of the Russian Empress Catherine II. However, in 1786, the settlement was moved to its current site on the south bank of the Dnieper River. From 1796 onwards, the community was renamed as “Novorossiysk” by the Russian Emperor Paul I of Russia. Despite building bridges on the Dnieper River in 1796 and the growth of trade and commerce at the beginning of the 19th century, Yekaterinoslav remained a small town until industrialization in the 1880s. Yekaterinoslav became a city within the autonomy of the Ukrainian People’s Republic after the 1917 Russian Revolution. In 1926, the city was renamed “Dnipropetrovsk” in honor of Ukraine’s Communist Leader Grigory Petrovsky. From August 26, 1941, to October 25, 1943, the city was occupied by the Nazis. The city then became one of the major industrial centers of Soviet Ukraine and one of the critical manufacturing centers of nuclear, arms, and space industries of the Soviet Union. Due to its military industries, the city of Dnipropetrovsk was considered a closed city till the 1990s. The Ukrainian Parliament changed the city’s official name from “Dnipropetrovsk” to “Dnipro” on May 19, 2016. Current Situation In Dnipro In the early hours of February 24, 2022, Russian President Vladimir Putin ordered a full-scale military invasion of Ukraine. The Russian forces launched heavy assaults on Ukraine from all sides by land, air, and sea. Ukrainian President Volodymyr Zelensky has declared a state of national emergency in Ukraine due to this Russian invasion. As per local news, several explosions have been reported in the city of Dnipro. All 400 beds in the city’s military hospital are fully occupied, but the hospital has been receiving hundreds of casualties every day. The hospital authorities have set up several camp beds in the corridors to cope with this massive number of casualties."
}