{
  "url": "https://kahoot.com/home/mobile-app/",
  "title": "Kahoot! app | Free Kahoot! learning app for iOS and Android",
  "text": "Create It only takes minutes to create a learning game or trivia quiz on any topic, in any language. Create, play and share learning games with the Kahoot! app for iOS, macOS & Android wherever you are! Make your lessons, presentations or gatherings more engaging with the Kahoot! app. Use Kahoot! to spark interaction with quizzes, polls, brainstorms, puzzles and slides. Unlock premium features to play with more people and get more question types! See plans At School Make learning awesome! Millions of teachers and students unleash the magic of learning with Kahoot! Introduce new topics, review, thrill, and collect data for formative assessment. See plans At Work Create interactive presentations Create a kahoot in minutes and deliver training sessions, presentations, business meetings and events that energize groups of any size! See plans At Home Be the host of your own game show Birthdays, weddings, holidays, game nights, family dinners, trivia… Kahoot! is the secret ingredient that will make any party or gathering even more awesome. Sign Up For Free Turn the chore of memorizing the times tables into an awesome and captivating game experience! Recommended for ages 8 and up. Available on Android and iOS. Introduce your kids to math with fun activities that explain what numbers are and how they work. Help your kids understand long additions and subtractions through play and exploration. This game helps children aged 3-8 learn to read through their own exploration. Give young learners a head start in math and algebra. This intuitive game teaches processes needed to solve basic linear equations. Help children gain confidence in algebra and math and improve their grades with this engaging game. Learn geometry on an exciting learning adventure in the world of shapes. Recommended for ages 9+.Kahoot! Learn to play chess or improve your skills and become the grandmaster in your family! Recommended for ages 5+. Access millions of ready-to-play learning games, master topics with study modes and compare with friends in leagues. Update your language, region and currency."
}