{
  "url": "https://www.cnbc.com/2025/09/03/quantum-computing-startup-iqm-raises-320-million.html",
  "title": "Quantum computing startup IQM raises $320 million",
  "text": "Quantum computing firm IQM says it's raised $320 million of fresh funding to ramp up investments in technology and commercial growth. The startup, which is headquartered in Espoo, Finland, was founded in 2018 by a team of scientists with the aim of building powerful quantum computers in Europe like the machines companies such as Google and IBM are building in the U.S. Quantum computers are machines that use the laws of quantum mechanics to solve problems too complex for classical computers, which store information in bits (ones and zeroes). Quantum computers use quantum bits, or \"qubits,\" which can be zero, one or something in between — the aim being to process much larger volumes of data to facilitate breakthroughs in areas like medicine, science and finance. IQM's funding round was led by Ten Eleven Ventures, a U.S. cybersecurity-focused investment firm, while Finnish venture capital firm Tesi also invested. It gives the seven-year-old company \"unicorn\" status, meaning it's valued at $1 billion or more, according to co-CEO and co-founder Jan Goetz. The investment underscores heightened investor buzz around the quantum computing space. Shares of publicly-listed quantum firms like IonQ and D-Wave Quantum have seen huge rallies in the past year. IonQ stock is up nearly 480% in the last 12 months, while D-Wave Quantum's shares have spiked over 1,400%. \"If you compare us directly to the companies which are Nasdaq-listed and take KPIs like people, revenue, patents, things like this, actually we are not behind. We can actually compete on this level,\" Goetz told CNBC in an interview. Goetz said that IQM has come a long way since the early days of building the company. The company has 350 employees globally and has built out finance and sales operations as well as a factory in Espoo where it builds its machines. Europe vs. the U.S. There are now a number of European companies working on quantum computers, including IQM, Pasqual and Quandela. However, they are yet to achieve the scale of their U.S. counterparts. In a speech earlier this year, the European Commission's tech chief Henna Virkkunen said that European quantum computing startups often struggle to scale due to a lack of private capital, noting that the European Union receives only 5% of global private funding compared to 50% for the U.S. \"If you just look at what is happening in Europe in these deep tech fields which come out of universities, naturally we have quite a lot of startups because we have so many good universities in Europe. But then it's really hard to make them grow,\" IQM's Goetz said. \"Now I think there is a risk of, if you have very high valuations in companies in the U.S., that they just drive M&A consolidation using their high share price.\" Indeed, IonQ in June announced it would buy U.K. quantum computing startup Oxford Ionics for nearly $1.1 billion in a deal consisting primarily of stock. IQM has now sold a total of 15 quantum computers to date. The company sells two main products: its flagship machine, Radiance, and a more affordable quantum computer called Spark, which the company sells to universities. Going forward, IQM is planning to move beyond just hardware. Goetz said the firm will use part of the cash it's raised to develop a software platform aimed at making quantum computing accessible to developers who aren't experts in the field. The other main goal for IQM is global expansion, with plans to scale up commercial and sales operations in the U.S. and Asia. Goetz said IQM has sold two systems in Asia so far — one in Taiwan and the other in South Korea — and recently sold its first machine in the U.S. While an initial public offering may be an option for IQM further down the line, Goetz insisted the company has no IPO plans for the moment, adding there are still \"attractive routes\" in the private markets for raising capital. The ultimate goal, he said, is to \"build a sustainable, profitable business and really make it a kind of company that's there to stay and to shape the future of compute over a long time.\" \"We will do whatever is necessary to make that happen,\" Goetz added."
}