{
  "url": "https://www.lavazza.com/en",
  "title": "Lavazza - The Italian Espresso since 1895 | Official Website",
  "text": "*Lavazza is not affiliated with, endorsed or sponsored by Nespresso **Nescafè®, Dolce Gusto® and Melody I are third party trademarks with no connection with Luigi Lavazza S.p.A. *Lavazza is not affiliated with, endorsed or sponsored by Nespresso **Nescafè®, Dolce Gusto® and Melody I are third party trademarks with no connection with Luigi Lavazza S.p.A. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock. Intensity 9/13 This product is not available at the moment. Register your email to be notified when back in stock. This product is not available at the moment. Register your email to be notified when back in stock."
}