{
  "url": "https://texags.com/forums/34/topics/3266312",
  "title": "Rio Grande Turkey Poults For Sale | TexAgs",
  "text": "WaldoWings said: I like the way you think! They are great free rangers, actually, and about the easiest animal you will find to herd, as stupid as that sounds. I let mine out every day and put them up at night. normaleagle05 said: I'd really like to have chickens but my HOA prohibits them although the city allows up to four hens. Wild game birds roaming on my property don't seem like something the HOA could regulate. Any lawyers here know their bid law? Wodanaz said: Dang it, now I want a yard Turkey! I've been thinking about a peacock to roam my neighborhood just so I could have fun reading the Facebook posts.normaleagle05 said: I'd really like to have chickens but my HOA prohibits them although the city allows up to four hens. Wild game birds roaming on my property don't seem like something the HOA could regulate. Any lawyers here know their bid law? Wodanaz said: When I was in middle school, my dad picked up a side gig skinning emus, back when emu oil was all the rage. Well, one day I went with him and he and this old man owner told me to go get us 2 birds. My first time here and there are hundreds of birds in these 100'x20' pens, so I didn't even know where to start. I saw shotgun shells all over, so I went back to them and asked for the shotgun. The old man said he was the only one he trusted to shoot a gun around all those other birds, then proceeds to toss me an old dented up aluminum bat. He told me \"you gotta get em right in the skull cuz if you get em in the neck, they'll funk you up\". I got in that pen as nervous as a virgin on prom night with these giant birds staring me down, making that drumming throat sound. I didn't want these men to think I was a punk, so I proceeded toward these birds and they split to the edges of the pen at full stride with about 6 coming right toward me. I cock back like Julio Franco and BAMMM, I clocked the first one right in the throat. She hit the ground, flopped around and I thought it was over. Well, she jumped up with her head kind of flopping around and started coming after me. I jumped sideways and cracked the back of her skull this time and it was all over. I turned around and picked out another and cracked her skull with one lick. I drug those birds over to the rack when my dad & the old man came over laughing. Turns out they'd never killed an emu with a bat & it was only there to bust ice in the water troughs. They thought it was hilarious that I'd Griffey'd these emu in the head but that's the way I did it from then on. All that to say, me & that cur have a lot in common when it comes to dealing with unruly fowl. BCO07 said: Not to derail entirely, but after going through the linked thread above it seems like you'd basically have to treat these like giant yard hens, no? If you wanted something a bit more wild it seems like you'd have to release full grown wild caught birds. Is that something easy to get ahold of? DargelSkout said: Do you need a pen for these, or would they just hang around the house close to food and water? I have 22 acres for them to roam. Mine tend to roam around quite a bit. They'll stay at the house for several days and then they may disappear for two days before they come back. I think they know where all of my neighbors deer feeders are and visit them. These deer feeders are not for hunting. Just neighbors that have 5-10 acres for watching the deer. I think you would be fine with 22 acres but they still probably are going to wander off of your property from time to time. And you will lose some to coyotes and dogs probably also.DargelSkout said: Do you need a pen for these, or would they just hang around the house close to food and water? I have 22 acres for them to roam. rdosteen01 said: Will you be hatching and selling in 2024? tp120 said: I'm interested in buying some Rio Grande turkey poults. I live just southeast of Hamilton. Do you have any now? Courtesy Flush said: I looked into releasing some turkeys on my place. We are between Houston and Victoria in Wharton County. I was told that our area was known to have both Rio Grande and Eastern turkeys but that if I were to release any, I could only legally release Rio Grande turkeys. At the time, I could buy Eastern Turkeys from Ideal hatchery for around $2/ea. but a Rio Grande turkey was $20 or more. I ended up not doing it and it's unfortunate because I would have established more turkeys in our area. I have seen a few in the spring but I don't see them every year. Now, I couldn't buy the Eastern Turkeys if I wanted to because Ideal no longer carries them and the Rio Grande Turkeys are too expensive for me to feed the bobcats. I see that Waldo's comment about survivability, but I am of the opinion that any pen-raised bird is going to struggle with predators immediately after being released into the wild."
}