{
  "url": "https://www.life.com/?p=0",
  "title": "LIFE",
  "text": "Times Square has long been known for its advertising displays. The Manhattan crossroads was termed an “illuminated theater of American commerce” in one history. And in 1948 one Times Square billboard ventured for theatricality in a way that caught the attention of the editors of LIFE magazine—whose offices were only a few blocks away. The billboard promoted Bond Clothing, which was a major men’s retailer of that era and operated a store in Times Square from 1940 to 1977. LIFE magazine’s story about it was headlined “New Spectacular.” (Back then the term “spectacular” referred to billboards that had an extra level of showmanship. The most famous example might be the cigar billboard that blew smoke rings.) Here’s how the magazine described the arrival of the new Bond Clothing spectacular: Last week the Square got its biggest and strangest sign—a hugely anatomical atrocity mounted on the roof of a block-long Bond clothing store. The sign’s most notable features: a waterfall 132 feet wide and figures of a man and a woman, each five stories high. The statues were draped only in 175 yards of neon tubing. While claiming to be aghast at the “atrocity,” LIFE nonetheless ran seven photos of it in the magazine, tracking the giant figures from their construction to their installation in Times Square. Looking at the photos taken by Martha Holmes, it’s hard not to appreciate the curiosity value. Whether it’s the image of a craftsman nonchalantly smoothing the surface of the giant breasts, or passers by in Times Square gawking at these massive pieces of shaped cement, the effect is an eye-catching mix of the surreal and the juvenile. It all brings to mind Julia Roberts’ musings about men’s anatomical fixations in the movie Notting Hill. The photo which best captures the spirit of the moment is the shot of two women in overcoats posing next to the breasts, giddy smiles on their faces. Back then it was Martha Holmes taking the photos. Were pieces of statuary like this set out in Times Square today, the number of selfies taken would be incalculable. The heads of the figures that were going to be part of a Times Square display weighed about 600 pounds each, 1948. A man examined a sculpted pair of breasts, which sat next to an enormous head on a flatbed trailer in Times Square, New York, May 1948. The pieces were part of a building-mounted advertising campaign for Bond Clothing. A 1960 LIFE story carried the headline “Lovely Land Too Far Away.” The story was about the country of New Zealand, which is distant to everyone living in America, but must have seemed especially so to LIFE staff photographer George Silk when he was missing the country where he was born and raised. The story was about Silk returning home and photographing his country of origin. Here’s the words LIFE used to introduce readers to New Zealand: His homeland is a country roughly the size of Colorado, divided into two big islands, some little ones, and separated by a 1,000 miles of South Pacific from the nearest land mass. It is a land which, for its size, packs in more natural wonders than any on earth. They range from the beautiful, mile-deep waters of Milford Sound locked serenely within their mile-high mountains to caves, unmatched anywhere, which shimmer with a mystic blue illumination cast by the taillights of millions of glow worms. This story was actually the second time that Silk had photographed his home country for LIFE. He also did so in 1946, about three years after he started with the magazine. Pictures from both photo essays are presented here. New Zealand is known for its physical beauty—the popular Lord of the Rings movie trilogy, which was shot there and has inspired film-related tours, certainly helped get the word out. Many of Silk’s photos capture his homeland’s natural wonders. The 1946 set includes a stunning shot of tourists traversing the Fox Glacier. In 1960 Silk took another photograph of tourists in an ice cave at the Franz Josef Glacier that is every bit as breathtaking. But Silk’s photos make clear that his affection for his homeland goes far beyond its natural wonders. The 1946 set highlights the lives of ordinary New Zealanders. His pride shines through in images of young White and Maori schoolgirls together at school, or of a former serviceman working to construct public housing, or of children receiving free dental care en masse at a government facility. (Back then New Zealand was on the forefront of socialized medicine, though the country’s approach to healthcare has actually evolved in a more capitalist direction in recent decades). But no matter the subject, the photographs are suffused with the spirit of a photographer who wants to show the world how wonderful his homeland is. The most personal shot in either set was taken in 1960. In that photo Silk’s niece stands on the shore and eats an oyster she has just plucked from the ocean, in violation of local fishing laws. The story said that when Silk was a boy his mother would send him to that beach to harvest oysters and bring them to her—she didn’t want to go herself for fear of getting caught. It’s an of image of the joy of youth that people from anywhere can relate to. A motorist was stuck on the highway amid a mob of sheep on their way to market, New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock A White and Maori child at a New Zealand school, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock In New Zealand, children received free dental care inside government-owned dental clinic, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock heep grazed in a pasture around a lake at the foot of the mountains, New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock A black sand beach in New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock A young woman fed trout by hand in New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock Dust rose up from the bed of the Waimakariri River in New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock A former serviceman worked on a government housing project in New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock A guide led tourists through the pinnacles and crevices on the Fox Glacier in New Zealand, 1946. George Silk/Life Picture Collection/Shutterstock In New Zealand a tour guide led a vacationing farmgirl through a cave at the South Island’s Franz Josef Glacier, 1959. George Silk/LIfe Picture Collection/Shutterstock Photo essay on New Zealand, 1959. George Silk/LIfe Picture Collection/Shutterstock Hikers in New Zealand, 1959. George Silk/LIfe Picture Collection/Shutterstock Hikers in New Zealand, 1959. George Silk/Life Picture Collection/Shutterstock Photo essay on New Zealand, 1959. George Silk/LIfe Picture Collection/Shutterstock Mitre Peak (center( reflected in Milford Sound on the Southwest coast of New Zealand, 1959. George Silk/Life Picture Collection/Shutterstock Children rode a tricycle with their school bags, New Zealand, 1959. George Silk/Life Picture Collection/Shutterstock A sailboat race in New Zealand, 1959. George Silk/Life Picture Collection/Shutterstock Volunteer lifeguards at a beach near Auckland, New Zealand, 1959. George Silk/LIfe Picture Collection/Shutterstock Jeanette Morgan, niece of LIFE photographer George Silk, swallowed a sweet rock oyster she had just caught, 1959. Wonder Woman gets more hype—and not without reason—but the first female character with her own comic book title was actually Sheena, Queen of the Jungle. But Sheena did get come to life on the screen first, in a 1950s television show starring actress and model Irish McCalla. The strapping Nebraska native and Vargas girl was modest about her qualifications for the role. She later said “I couldn’t act, but I could swing through trees.” And in fact McCalla did swing through trees for a photo session with LIFE photographer Loomis Dean. The shoot took place at the World Jungle Compound in Southern California, which was both a theme park and a training ground for movie animals. And while that first Sheena, Queen of the Jungle wasn’t a big hit—it lasted 26 episodes—McCalla made impression. One young fan named Carol Hatfield, who went on to become a writer, reminisced that McCalla presented a vision of femininty that was ahead of its time. “She was the only female portrayed on the tube who didn’t conform to the fifties stereotype,” Hatfield wrote. “Sheena was a real rugged individualist.” In later life Hatfield would interview McCalla for a “Where are they now”-type television show, and she reported that during the filming of Sheena, McCalla did not get along with her chimpanzee co-star. That’s surprising because, in the photos that Loomis Dean took, McCalla and the chimp seemed to have the kind of chemistry that most human actors can only dream of. The silhouetted photos of the two primates hanging from branches exude a flair that is rare to find in publicity shots. One fun note about the character of Sheena is that her most lasting contribution to pop culture is likely a song from the Ramones, “Sheena is a Punk Rocker.” Nothing in these photos would do anything to dispel the notion that Sheena could rock. Irish McCalla starred in ‘Sheena, Queen Of The Jungle,” 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with an elephant at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla, star of the television series ‘Sheena, Queen of the Jungle,’ posed with a chimpanzee named Neal at the World Jungle Compound, Thousand Oaks, California, 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla starred in ‘Sheena, Queen Of The Jungle,” 1955. Loomis Dean/Life Picture Collection/Shutterstock Irish McCalla starred in ‘Sheena, Queen Of The Jungle,” 1955. In this brief interview the gallery’s director, George Kocis, explains how the show came together. LIFE: How did you select which photos would appear in this show? GEORGE KOCIS: We made print-outs of every single photograph available from the LIFE archive – over 600 images! We also considered images by photographers Harry Benson, Abe Frajndlich, and William Helburn, who we work with directly and whose work appeared in the magazine. From this, we chose 75 or so of our favorites, and pretty quickly discovered thematic groups and stories that we could tell and which would inform the physical design of the exhibition. It was our privilege to have access to such a vast body of work, but painful to not include everything that we wanted due to space constraints! LIFE: What would you describe as the distinctive appeal of the LIFE brand of photography? LIFE: The show has been up since December. What kind of reactions have you had from visitors? GK: Many visitors to the exhibition have said that they remember waiting for LIFE magazine to arrive in the mail each week! We’ve also had a few editors that worked for the magazine and people currently and formerly in the publishing industry come to see the exhibition and that’s been very interesting to hear their perspective and experience. Younger visitors don’t share that nostalgia, of course . . . they’re as familiar with the brand of “LIFE” as they are with McDonald’s and Nike, but they have rarely seen the magazine or these images before. LIFE: Are there particular images in the show that stand out to you as remarkable, or that exemplify LIFE’s appeal? There’s hardly a more iconic image than the “VJ-Day Kiss” by Alfred Eisenstaedt, which has been a well-known symbol of patriotism and joy since it was taken in 1945 but which has also more recently been parodied by the Simpsons and inspired contemporary painter Amy Sherald. LIFE’s photographers also had the opportunity to highlight an outsider’s perspective of the familiar, which is why Leonard McCombe’s picture of men enjoying some ice cream in Iowa is unexpectedly poignant – as a Brit who recently obtained his US citizenship, McCombe noted that “I began to notice the difference in my own countrymen. I’d never even seen men eating ice cream (that was only a children’s treat in England). But by now . . . I feel I am a citizen of the place where I belong”. My personal favorite in the exhibition might be John Dominis’ photograph of a priest ice skating – another great union of a familiar subject in an unexpected context. LIFE: What has your gallery done to display these photos in a way that gives their historical context? GK: In addition to the photographs themselves, the exhibition includes scans from the actual pages of LIFE magazine with corresponding anecdotes about some of the photographers and the images – most of which are included on our website, too. This collection of work is informative and educational – and also entertaining and simply fun to see! We hope that visitors will enjoy each of these photographer’s contributions to LIFE magazine and recognize these images’ historical and cultural significance. Staley-Wise Gallery has always celebrated photography that has appeared primarily in magazines, and this exhibition continues that tradition. Below are a selection of images from the show. “Eyes right” is executed with near-military precision by men aboard a New York-bound 20th Century Limited train as movie star Kim Novak eases into her seat in the dining car. Originally published in the March 5, 1956, issue of LIFE. Leonard McCombe/Life Picture Collecltion/Shutterstock Brooklyn went wild after the Dodgers’ win in 1955. Photo by Martha Holmes/The LIFE Picture Collection/Shuttetrstock Steve McQueen is seen driving a sleek and stylish sports car on the streets of Los Angeles, California in June 1963. John Dominis / LIFE Picture Collection /Shutterstock Jackson Pollock worked in his Long Island studio, 1949. Martha Holmes/Life Pictures/Shutterstock Natalie Wood and Warren Beatty, Cannes, 1962. Paul Schutzer The LIFE Picture Collection/Shutterstock Models posed a race track betting window at Roosevelt Raceway., New York. Nina Leen/The LIFE Picture Collection/Shutterstock Little League 1954 Yale Joel/Life Pictures/Shutterstock Eisenstaedt’s iconic photo: A jubilant American sailor clutched a dental assistant in a back-bending kiss at a moment of spontaneous joy about the long awaited WWII victory over Japan. Taken on V-J Day, 1945, as thousands jammed Times Square. In recent decades this iconic photograph has engendered condemnation, after Greta Zimmer Friedman, the woman being kissed by the sailor (believed to have been George Mendonsa) said that the kiss was nonconsensual. In 2019, shortly after Mendonsa died at age 95, a statue of the kiss in Florida was tagged with #metoo graffiti. Alfred Eisenstaedt The LIFE Picture Collection/Shutterstock While his father chatted with a customer at the hardware store, a uniformed Jimmy Stewart set up a date to go fishing, 1945. Peter Stackpole/Life Pictures/Shutterstock Watching Bwana Devil in 3-D at the Paramount Theater, 1952 J.R. Eyerman The LIFE Picture Collection/Shutterstock When the play The Green Pastures debuted on the stage on February 26,1930, it was more than a groundbreaker. Not only was it the first Broadway show with an all-Black cast, but it won the Pulitzer Prize for Drama and was so successful that the show ran for a year and a half, until August 29, 1931. After that the show toured the country, playing in all but eight U.S. states before coming back to Broadway in 1935. LIFE, which published its first issue in 1936, wasn’t around for that original performance. But it was able to shine a spotlight on The Green Pastures during a 1951 revival, with staff photographer W. Eugene Smith documenting the action. The play, adapted from a 1928 book Ol’ Man Adam an’ his Chillun by Roark Bradford, features stories of the Hebrew bible as told by a young Black child in the South. The central character of the play is De Lawd, who in the 1951 production was played by William Marshall, a deep-voiced 6’5″ actor whose long career on stage and screen would include many productions of Shakespeare’s Othello—and also the title role in the 1973 blaxploitation film Blacula. Once again on Broadway the curtain went up on a heavenly fish fry, and Gabriel shouted, “Gangway for De Lawd…” De Lawd walked among his angels, and tasted a spoonful of custard. “I kin taste de eggs and de creme and de sugar,” he said, and then added, “It needs a little more firmament.” There was no firmament left in the jug so De Lawd passed a miracle to create some. And before you knew it, he had also created the Earth, complete with Adam and Eve. And while the show’s original run was a business success, the 1951 revival that LIFE covered was not. While the magazine termed The Green Pastures “a lovable piece of American folklore,” it also noted that ticket sales were weak and the show would close ahead of schedule. Since that 1951 revival The Green Pastureshas not been staged again on Broadway, making the show both a milestone and a relic all at once. LIFE’s headline “Last Glimpse of De Lawd” proved more prescient than the magazine’s editors might have expected. A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock In the play The Green Pastures, De Lawd (played by William Marshall) talks to a child about the evils of playing dice, 1951. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock In a scene from the 1951 performance of The Green Pastures, built around stories from the Old Testament, Hebrews march out of Egypt. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock A scene from a 1951 performance of The Green Pastures, which when it debuted in 1930 was the first Broadway show to feature an all-Black cast. W. Eugene Smith/Life Picture Collection/Shutterstock In 1968 figure skater Peggy Fleming graced the cover of the Feb, 23, 1968 issue of LIFE after winning a gold medal at the Winter Olympics at the age of 19. One of Fleming’s competitors gushed to LIFE that “Everything Peggy does is pure ballerina.” The phrase “pure ballerina” is not just a tribute to Fleming but also to ice skating itself. It is the rare sport that demands of both athleticism and artistry. Images of Fleming are included in this gallery of LIFE’s favorite ice skating images, appearing alongside other skaters of great accomplishment. Barbara Ann Scott, a champion skater from Canada, was a particular fave of the magazine in the 1940s Two-time Olympic champion Dick Button, who would later become a television commentator, is shown making great leaps during his competitive years. Also included are pictures of some anonymous skaters whose movements across the ice made for pretty pictures. if you look at the credits you’ll see the names of some of LIFE’s star photographers—Alfred Eisenstaedt, Ralph Morse, Peter Stackpole and many others. The talent attracted to these assignments underlines the visual appeal of a sport that was also an art form. Five-time world champion skater Carol Heiss performed at Wollman Memorial Rink in Central Park, New York City, 1955.. Ralph Morse/Life Picture Collection/Shutterstock Five-time world champion skater Carol Heiss performed at Wollman Memorial Rink in Central Park, New York City, 1955.. Ralph Morse/Life Picture Collection/Shutterstock Ice skaters in Switzerland, 1948. Walter Sanders/Life Picture Collection/Shutterstock British figure skater Graham Sharp at the Winter Olympics in St. Moritz, 1948. Mark Kauffman/Life Picture Collection/Shutterstock Tenley Albright, an Olympic gold medalist, performed a frog jump, 1956. Peter Stackpole/Life Picture Collection/Shutterstock Dick Button at a figure skating competition in Stockholm, 1947. Tony Linck/Life Picture Collection/Shutterstock Dick Button, 1947. Tony Linck/Life Picture Collection/Shutterstuch Dick Button at a figure skating competition, 1947. Tony Linck/Life Picture Collection/Shutterstock Dick Button competed at the 1948 Winter Olympics in St. Moritz, Switzerland. Mark Kauffman/Life Picture Collection/Shutterstock Barbara Ann Scott at the world figure skating championship in Stockholm, 1947. Tony Linck The LIFE Picture Collection/Shutterstock Barbara Ann Scott at the world figure skating championships in Stockholm, 1947 Tony Linck The LIFE Picture Collection/Shutterstock The husband-and-wife team of Narena Greer and Richard Norris skated with The Ice Follies, 1947. Gjon Mili/Life Picture Collection/Shutterstock Figure skater Johnny Lettengarver, a member of the U.S. Olympic team, 1948. Mark Kauffman/Life Picture Collection/Shutterstock Skaters performed at an ice show at Madison Square Garden, 1948. Gjon Mili/Life Picture Collection/Shutterstock Austrian ice skating champion Melitta Brunner practiced in St. Moritz, 1934. Alfred Eisenstadt/Life Picture Collection/Shutterstock A skating waiter delivered drinks at the Grand Hotel, St. Moritz, 1932. Alfred Eisenstaedt—The LIFE Picture Collection/Shutterstock U.S. skater Peggy Fleming won a gold medal at the 1968 Winter Olympics in Grenoble, France. Art Rickerby/Life Picture Collection/Shutterstock U.S. skater Peggy Fleming won a gold medal at the 1968 Winter Olympics in Grenoble, France. Art Rickerby/Life Picture Collection/Shutterstock A figure skater made a leap that mimicked the statue of Prometheus at Rockefeller Center in New York, 1942."
}