{
  "url": "https://www.esimplesauditoria.com/como-emitir-nfse-no-portal-passo-a-passo",
  "title": "Como emitir NFS-e no portal nacional: passo a passo completo",
  "text": "Como emitir NFS-e no portal nacional: passo a passo completo Como emitir NFSe no portal - Passo a passo é uma das dúvidas mais comuns entre contadores e empresas do Simples Nacional após a padronização da Nota Fiscal de Serviço Eletrônica (NFS-e) no Emissor Nacional. Para realizar a emissão, é necessário acessar o portal oficial com conta gov.br (nível prata ou ouro) ou certificado digital, escolher a opção “Nova NFS-e” e preencher corretamente dados como data de competência, informações do tomador (cliente), descrição do serviço prestado e valores da operação. O processo pode ser feito tanto pelo portal web quanto pelo aplicativo NFS-e Mobile, o que traz mais praticidade para prestadores de serviços. Após a conferência das informações, basta emitir a nota e realizar o download do PDF e do XML. Atenção a pontos importantes: para MEI, a emissão é obrigatória pelo portal nacional; para empresas do Simples Nacional, é fundamental selecionar corretamente o regime de apuração; e, caso a emissão não seja concluída, a nota permanece salva como rascunho no sistema. Quem é obrigado a emitir NFS-e no padrão nacional Como emitir NFSe no portal - Passo a passo é obrigatório, principalmente, para os Microempreendedores Individuais (MEI). Com a implementação do modelo nacional, o MEI passou a utilizar exclusivamente o Emissor Nacional de NFS-e, deixando de emitir notas fiscais pelos sistemas das prefeituras. Essa obrigatoriedade busca padronizar a emissão de NFS-e em todo o país, facilitar o controle fiscal e simplificar o cumprimento das obrigações acessórias, garantindo maior uniformidade no processo de emissão. Início da obrigatoriedade em 1º de setembro de 2023 Como emitir NFSe no portal - Passo a passo tornou-se obrigatório para o MEI a partir de 1º de setembro de 2023, data em que entrou em vigor a exigência do uso do Emissor Nacional de NFS-e. Desde então, sempre que houver prestação de serviços, a nota fiscal deve ser emitida exclusivamente pelo portal nacional ou pelo aplicativo oficial. Essa mudança eliminou a utilização dos emissores municipais para o MEI, tornando a emissão mais padronizada. O não cumprimento da obrigatoriedade pode gerar irregularidades fiscais, o que reforça a importância de seguir corretamente o passo a passo de emissão da NFS-e no sistema nacional. Base legal da obrigatoriedade da NFS-e nacional Como emitir NFSe no portal - Passo a passo está fundamentado na Resolução CGSN nº 169/2022, editada pela Receita Federal do Brasil. Essa norma determinou a adoção do Emissor Nacional de NFS-e pelos Microempreendedores Individuais, substituindo definitivamente os sistemas de emissão das prefeituras. A base legal estabelece regras claras sobre a padronização da emissão e reforça a necessidade de observância do modelo nacional. Para contadores, conhecer essa fundamentação é essencial para orientar corretamente seus clientes e evitar erros no cumprimento das obrigações fiscais. O que é NBS e por que ele é obrigatório na NFS-e Como emitir NFSe no portal - Passo a passo envolve o correto uso da NBS – Nomenclatura Brasileira de Serviços, código obrigatório para identificar e classificar os serviços prestados na emissão da NFS-e nacional. Com a padronização do emissor, os códigos municipais deixaram de ser utilizados. A NBS funciona como um padrão único em todo o território nacional, permitindo maior uniformidade fiscal, melhor controle tributário e integração entre os sistemas. Informar corretamente esse código é fundamental para evitar inconsistências na nota fiscal e problemas futuros com o Fisco. Como fazer o cadastro no Emissor Nacional de NFS-e Como emitir NFSe no portal - Passo a passo começa pelo cadastro no Emissor Nacional de NFS-e, etapa necessária para acessar o sistema e realizar a emissão das notas fiscais. O acesso pode ser feito por certificado digital ou por login e senha, conforme a realidade do contribuinte. Em muitos casos, quando o certificado digital está válido e corretamente instalado, o sistema reconhece automaticamente os dados do prestador, dispensando cadastro manual. Já para quem não utiliza certificado, é necessário seguir as etapas de cadastro no próprio portal. Acesso com certificado digital Como emitir NFSe no portal - Passo a passo é simplificado quando o contribuinte possui certificado digital válido. Nesse caso, basta selecionar a opção de acesso com certificado, escolher o certificado correspondente e realizar o login direto no sistema. O Emissor Nacional identifica automaticamente os dados do prestador, permitindo o acesso imediato à plataforma e a emissão das notas fiscais de serviços eletrônicas sem necessidade de preenchimento prévio de cadastro. Primeiro acesso sem certificado digital Como emitir NFSe no portal - Passo a passo também é possível para quem não possui certificado digital. Nesse caso, o primeiro acesso ao Emissor Nacional de NFS-e deve ser feito por meio do cadastro no sistema, utilizando login e senha. O contribuinte deve selecionar a opção de primeiro acesso, informar corretamente os dados solicitados e seguir as etapas indicadas pelo portal. Esse processo garante a identificação do prestador e libera o uso do emissor nacional para a emissão das notas fiscais de serviços. Cadastro no Emissor Web Como emitir NFSe no portal - Passo a passo inclui o cadastro no Emissor Web, etapa em que o usuário informa os dados pessoais ou da empresa, conforme o perfil de acesso. Essas informações são utilizadas para vincular o prestador ao sistema nacional. O preenchimento correto dos dados é essencial para evitar problemas futuros na emissão da NFS-e, garantindo que as informações do prestador apareçam corretamente nas notas fiscais emitidas. Validação de e-mail e criação de senha Como emitir NFSe no portal - Passo a passo exige a validação do e-mail informado durante o cadastro. Após o envio dos dados, o sistema encaminha um código de segurança para o endereço eletrônico cadastrado. Com a validação concluída, o usuário deve criar a senha de acesso, finalizando o cadastro. A partir desse momento, o contribuinte já está apto a acessar o Emissor Nacional de NFS-e e emitir notas fiscais normalmente. Configuração inicial do sistema antes da emissão Como emitir NFSe no portal - Passo a passo não termina no cadastro. Após o primeiro acesso, é fundamental realizar a configuração inicial do sistema antes de emitir a NFS-e. Essa etapa garante que os dados do prestador estejam corretos e alinhados ao padrão nacional. A configuração adequada evita erros durante a emissão da nota fiscal, reduz retrabalho e assegura maior conformidade fiscal, principalmente para empresas do Simples Nacional e MEI. Acesso ao menu configurações Como emitir NFSe no portal - Passo a passo inclui acessar o menu de configurações do sistema para revisar informações básicas, como e-mail e telefone de contato. Esses dados são importantes para o funcionamento correto do emissor e para o recebimento de comunicações relacionadas à emissão da NFS-e, validações e eventuais notificações do sistema. Opção de não informar valor estimado de tributos Como emitir NFSe no portal - Passo a passo inclui a configuração relacionada ao valor estimado de tributos. Durante a configuração inicial do sistema, o Emissor Nacional permite que o prestador opte por não informar esses valores na nota fiscal. Essa opção é permitida pelo padrão nacional e facilita a emissão da NFS-e, especialmente para contribuintes do Simples Nacional, que não precisam detalhar tributos federais individualmente. Ao manter esse campo desabilitado, o contribuinte evita erros e inconsistências na emissão. Como emitir NFS-e no portal passo a passo (Simples Nacional) Como emitir NFSe no portal - Passo a passo para empresas do Simples Nacional segue um fluxo padronizado dentro do Emissor Nacional. O processo envolve o acesso ao sistema, o preenchimento correto dos dados do prestador e do tomador, a escolha do serviço prestado e a conferência final das informações. Seguir corretamente cada etapa garante a emissão da Nota Fiscal de Serviço eletrônica em conformidade com o regime do Simples Nacional, evitando retrabalho, substituições ou cancelamentos futuros. Acesso ao sistema e início da emissão Como emitir NFSe no portal - Passo a passo começa com o acesso ao Emissor Nacional de NFS-e, utilizando login e senha ou certificado digital. Após entrar no sistema, o contribuinte deve selecionar a opção Emitir NFS-e para iniciar o preenchimento da nota fiscal. Essa ação direciona o usuário para a tela principal de emissão, onde todas as informações da nota serão inseridas de forma sequencial e guiada pelo sistema. Dados do prestador e regime de apuração Como emitir NFSe no portal - Passo a passo exige atenção aos dados do prestador e ao regime de apuração. O sistema carrega automaticamente informações como CNPJ, razão social e enquadramento tributário. Antes de avançar, é fundamental conferir se os dados estão corretos e se o regime selecionado é realmente o Simples Nacional, garantindo que a tributação da nota fiscal seja aplicada de forma adequada. Dados do tomador do serviço Como emitir NFSe no portal - Passo a passo também envolve o correto preenchimento dos dados do tomador do serviço. Nessa etapa, o prestador deve indicar se o cliente está localizado no Brasil ou no exterior. Ao informar o CPF ou CNPJ, o sistema realiza a busca automática das informações. Caso o tomador não possa ser identificado, existe a opção de marcar como tomador não informado, conforme permitido pelo padrão nacional. Informações do serviço prestado Como emitir NFSe no portal - Passo a passo exige atenção às informações do serviço prestado, pois é nessa etapa que o contribuinte define a natureza da operação. O prestador deve indicar o local da prestação do serviço e selecionar a atividade correspondente, conforme as opções disponibilizadas pelo Emissor Nacional. A escolha correta do serviço é essencial para garantir a classificação fiscal adequada, evitar erros na tributação e manter a NFS-e em conformidade com as regras do Simples Nacional. Discriminação dos serviços e código NBS Como emitir NFSe no portal - Passo a passo inclui a discriminação detalhada do serviço e a seleção obrigatória do código NBS (Nomenclatura Brasileira de Serviços). Nesse campo, o prestador deve descrever claramente o serviço realizado, podendo informar período, contrato ou forma de execução. O código NBS substitui os antigos códigos municipais e padroniza a identificação dos serviços em todo o país, sendo fundamental para o correto controle fiscal e para evitar questionamentos futuros. Valor do serviço e retenção de ISS Como emitir NFSe no portal - Passo a passo orienta que o prestador informe o valor total do serviço conforme acordado com o cliente. Em seguida, o sistema solicita a indicação sobre a retenção de ISS, que pode ocorrer quando o tomador ou intermediário é responsável pelo recolhimento. Essa definição varia conforme a atividade exercida, o tipo de cliente e a legislação municipal, sendo indispensável verificar se há retenção para evitar inconsistências na emissão da NFS-e. Tributação federal no Simples Nacional Como emitir NFSe no portal - Passo a passo no Simples Nacional dispensa o preenchimento detalhado da tributação federal, pois os tributos como IRPJ, CSLL, PIS e Cofins já estão incluídos no DAS. Diferentemente do Lucro Presumido, o contribuinte do Simples deve apenas confirmar o enquadramento correto, evitando o preenchimento indevido de campos de retenção que não se aplicam a esse regime. Valor aproximado dos tributos Como emitir NFSe no portal - Passo a passo também contempla o campo de valor aproximado dos tributos, que pode ser configurado conforme a carga tributária da atividade. Esse valor tem caráter informativo e visa dar transparência ao tomador do serviço. O prestador pode definir manualmente os percentuais ou manter a configuração padrão, sempre observando as orientações do Emissor Nacional e as regras aplicáveis ao Simples Nacional. Revisão e conclusão da emissão da NFS-e Como emitir NFSe no portal - Passo a passo termina com a revisão final de todas as informações preenchidas. Antes de concluir, é fundamental conferir dados do prestador, tomador, serviço, código NBS, valores e eventuais retenções. Com tudo correto, o contribuinte deve clicar em Emitir NFS-e para finalizar o processo. Após a emissão, é possível baixar o PDF e o XML, documentos essenciais para controle contábil, envio ao cliente e arquivamento fiscal. Como emitir NFS-e no portal no Lucro Presumido Como emitir NFSe no portal - Passo a passo para empresas do Lucro Presumido também é realizado pelo Emissor Nacional de NFS-e, mas com diferenças importantes em relação ao Simples Nacional. Nesse regime, além dos dados básicos, é obrigatório informar a tributação federal incidente sobre a prestação de serviços. O contribuinte deve preencher corretamente campos relacionados a PIS, Cofins, IRRF e CSLL, quando aplicável, bem como indicar possíveis retenções. A conferência cuidadosa dessas informações é essencial para evitar erros fiscais e divergências na apuração dos tributos. Emissão de NFS-e para exportação de serviços Como emitir NFSe no portal - Passo a passo também se aplica aos casos de exportação de serviços, quando o tomador está localizado no exterior e o resultado do serviço ocorre fora do Brasil. Nessas situações, a NFS-e deve ser emitida pelo Emissor Nacional, observando regras específicas. É necessário identificar corretamente o tomador estrangeiro, caracterizar a operação como exportação e preencher os campos que tratam da não incidência do ISS, conforme a legislação vigente. O procedimento varia de acordo com o regime tributário da empresa. Exportação no Simples Nacional Como emitir NFSe no portal - Passo a passo no Simples Nacional, em operações de exportação, exige que o tomador seja identificado como residente no exterior. Durante a emissão, o prestador deve marcar a opção correspondente à exportação de serviços. Quando atendidos os requisitos legais, aplica-se a não incidência do ISS, mantendo a apuração dos tributos conforme as regras do Simples Nacional. O correto preenchimento evita cobranças indevidas e problemas futuros com o Fisco. Exportação no Lucro Presumido Como emitir NFSe no portal - Passo a passo no Lucro Presumido segue lógica semelhante, porém com maior atenção à tributação federal. O prestador deve identificar o tomador no exterior, indicar a exportação e informar corretamente os dados exigidos. Nos casos em que a exportação é caracterizada, há não incidência do ISS, e os campos de PIS, Cofins, IRRF e CSLL devem ser preenchidos conforme as regras específicas desse regime e da natureza da operação. Importação de NFS-e no portal nacional Como emitir NFSe no portal - Passo a passo também inclui a importação de NFS-e no Emissor Nacional, recurso utilizado para registrar notas fiscais de serviços que já foram emitidas fora da plataforma principal do contribuinte. Esse procedimento é comum quando a empresa utiliza sistemas próprios de gestão e precisa centralizar as informações fiscais. A importação garante o correto controle contábil, evita divergências nos registros e assegura que todas as NFS-e estejam devidamente lançadas no ambiente nacional. Download do XML da NFS-e Como emitir NFSe no portal - Passo a passo para importação começa pelo download do arquivo XML da nota fiscal. No portal do Emissor Nacional de NFS-e, o contribuinte deve localizar a nota já emitida e salvar o XML em seu computador. Esse arquivo contém todas as informações fiscais da NFS-e e é indispensável para a importação correta em sistemas de gestão ou plataformas contábeis. Importação manual e validação da nota Como emitir NFSe no portal - Passo a passo segue com a importação manual do XML na plataforma de gestão utilizada pela empresa. Após carregar o arquivo, o sistema realiza a validação das informações, conferindo dados do prestador, tomador, serviço e valores. Durante essa etapa, podem ser solicitados ajustes ou complementos, como retenções ou enquadramento tributário, para que a nota seja registrada corretamente e sem inconsistências fiscais. Substituição de Nota Fiscal de Serviços eletrônica Como emitir NFSe no portal - Passo a passo também envolve a substituição da NFS-e, procedimento utilizado quando há necessidade de corrigir informações de uma nota fiscal já emitida. Essa alternativa permite ajustar erros sem recorrer ao cancelamento, desde que respeitados os prazos legais. A substituição mantém o histórico da operação e evita problemas fiscais decorrentes de informações incorretas na nota original. Quando é permitido substituir a NFS-e Como emitir NFSe no portal - Passo a passo permite a substituição da NFS-e quando há erro em dados como tomador, descrição do serviço ou valores informados. O sistema autoriza a substituição apenas dentro do prazo estabelecido pelo regime tributário. Notas emitidas fora do período permitido não podem ser substituídas diretamente, exigindo procedimentos adicionais ou orientação contábil específica. Cancelamento de Nota Fiscal de Serviços eletrônica Como emitir NFSe no portal - Passo a passo também contempla o cancelamento da NFS-e, procedimento indicado quando a prestação do serviço não ocorreu. O cancelamento anula a nota fiscal e evita efeitos fiscais indevidos. Sempre que houver erro de preenchimento, o caminho correto é a substituição da NFS-e, e não o cancelamento. Utilizar o procedimento adequado reduz riscos e retrabalho. Quando utilizar o cancelamento da NFS-e Como emitir NFSe no portal - Passo a passo orienta que o cancelamento seja utilizado exclusivamente quando o serviço não foi prestado. Nesses casos, o contribuinte deve acessar o Emissor Nacional de NFS-e e solicitar o cancelamento da nota emitida. Se a nota já tiver sido importada para um sistema de gestão ou plataforma contábil, é importante registrar o cancelamento também nesse ambiente para manter a consistência das informações fiscais. Prazo para cancelamento da nota fiscal Como emitir NFSe no portal - Passo a passo inclui observar os prazos de cancelamento, que também variam conforme o regime. Para o Simples Nacional, o cancelamento pode ser feito até o dia 5 do mês subsequente à emissão. No Lucro Presumido, o prazo é até o dia 1º do mês subsequente. Após esses períodos, o cancelamento pode exigir procedimentos complementares, como ajustes contábeis ou reabertura de período. Conclusão: Como emitir NFSe no portal - Passo a passo exige atenção ao cadastro, à configuração inicial, à correta identificação do serviço, ao enquadramento tributário e ao preenchimento dos dados do tomador. Com a padronização do Emissor Nacional, o processo se tornou mais uniforme, mas continua demandando cuidado. Ao seguir corretamente cada etapa, respeitar prazos legais e compreender as diferenças entre Simples Nacional, Lucro Presumido e operações de exportação, o contribuinte garante conformidade fiscal, reduz riscos e realiza a emissão da NFS-e de forma segura e eficiente. Perguntas Frequentes: Como emitir uma nota fiscal de serviço passo a passo Como emitir uma nota fiscal de serviço passo a passo? O processo envolve cinco etapas principais: cadastro no sistema da prefeitura ou no Portal Nacional da NFS-e, acesso ao sistema com login ou certificado digital, escolha da opção de emissão da nota, preenchimento dos dados da NFS-e e, por fim, revisão e emissão da nota fiscal. Quem pode emitir NFS-e pelo Portal Nacional? Podem emitir NFS-e pelo Portal Nacional os prestadores de serviços dos municípios que já aderiram ao padrão nacional, incluindo MEIs e empresas do Simples Nacional ou Lucro Presumido. Em cidades que ainda não aderiram, a emissão continua sendo feita pelo sistema da prefeitura. Como emitir nota fiscal como MEI pelo aplicativo NFS-e? O MEI deve acessar o Portal Nacional ou o aplicativo NFS-e Mobile e cadastrar seus Serviços Favoritos, identificados por um ícone de estrela. Após cadastrar ao menos um serviço, o aplicativo permitirá a emissão das notas fiscais de forma simplificada. Como faço o primeiro acesso ao Emissor Nacional da NFS-e? Para o primeiro acesso, é necessário entrar em https://www.nfse.gov.br/EmissorNacional, clicar em “Fazer Primeiro Acesso” e preencher os dados solicitados. Após concluir o cadastro, o acesso ao sistema é liberado. Como emitir nota fiscal de MEI passo a passo? - Acessar o Emissor Nacional da NFS-e; - Identificar-se como contribuinte enquadrado no MEI; - Informar os dados da nota fiscal; - Validar as informações; - Transmitir a nota; - Imprimir o DANFE e baixar o arquivo XML. Quais são os pré-requisitos para emitir nota fiscal? É necessário possuir CNPJ ou CPF regularizado, realizar o cadastro no sistema da prefeitura ou no Portal Nacional da NFS-e e, em alguns casos, ter certificado digital (e-CNPJ ou e-CPF), especialmente para empresas que não são MEI. Como funciona a emissão da NFS-e no Portal Nacional? Após acessar o sistema com login, senha ou certificado digital, o contribuinte deve verificar as configurações iniciais, clicar em “Emitir NFS-e”, preencher os dados do prestador, do tomador e do serviço, informar valores e concluir a emissão da nota fiscal. O que fazer após emitir a nota fiscal de serviço? Depois da emissão, a nota fiscal pode ser enviada ao cliente, geralmente por e-mail, e deve ser armazenada para fins de controle fiscal e contábil. Também é recomendável guardar o XML da NFS-e. Use Inteligencia Artificial para deixar a gestão do Simples Nacional rápida, fácil e segura!"
}