{
  "url": "https://ell.stackexchange.com/questions/269526/what-does-calve-exactly-mean",
  "title": "word usage - What does calve exactly mean? - English Language Learners Stack Exchange",
  "text": "Do all mammals calve, or only cows calve? Neither. The term \"calve\" was first used of cows, but it has long been used of whales giving birth, and a young whale is called a \"calf\". The term might be used for a few other animals, but is not used for most mammals. Dogs \"whelp\", horses \"foal\", and sheep \"drop a lamb\" but the season when they do so is \"lambing time\". Cats, foxes, rodents, and some others are said to \"litter\". I think that \"whelp\" is also used of wolves. In all these cases \"give birth\" may be used instead. The verb \"calve\" is also used when an iceberg breaks off from the parent glacier, as by analogy the iceberg is \"born\". \"Calve\" is also used in some other cases where a smaller thing breaks off from a larger. I believe it is sometimes used of comets, for example. Dictionary.com defines the verb \"calve\" as: verb (used without object), calved, calv·ing. - to give birth to a calf: -- The cow is expected to calve tomorrow. - (of a glacier, an iceberg,> etc.) to break up or splinter so as to produce a detached piece. verb (used with object), calved, calv·ing. - to give birth to (a calf). - (of a > glacier, an iceberg, etc.) to break off or detach (a piece): -- The > glacier calved an iceberg. There is a very similar definition from American Heritage and one from Collins and one from Oxford/Lexico I think this verb should not be used in general for \"to give birth to\" but only with certain specific kinds of animals (cows, whales, elephants, etc) and with a few kinds of objects where a smaller fragment breaks off of a larger, mostly n glaciers and things thought to act in a way similar way to glaciers. This Ngram suggests that \"calve\" is significantly less common than \"give birth to\" or spawn\". This one shows similar results for the gerund forms."
}