{
  "url": "https://busseto.com/index.php?p=salumi-explained",
  "title": "Busseto",
  "text": "The King of Italian Ham Learn MoreThe King of Italian Ham Learn MoreDry Cured & Thinly Sliced Learn MoreSmoky & Spicy Spanish-style Salami Learn MoreOn-the-go Protein Power Learn MoreItalian Unsmoked Bacon Learn MoreLean & Flavorful Salted Beef Learn MoreOnly the Good Stuff Learn MoreTraditional Classics & New Favorites Learn MoreCured meats encompass meats prepared using the time-honored technique of dry curing. This process used to preserve and flavor meats draws out any moisture, creating the salumi you know and love. All salami is salumi, but not all salumi is salami. Salumi encompasses meats prepared in an Italian fashion—unlike, say, French charcuterie. Salami is a type of salumi: it is highly seasoned, fermented and air-dried to perfection. Salumi also includes whole-muscle cuts like prosciutto. Simple ingredients are the secret to quality cured meats. As our Salumiere Lorenzo says, it’s all about moderation. Minor tweaks to time-honored techniques are what allow these ingredients to shine. The most important ingredient when making salami, of course, is time. Every minute matters when dry curing—it can change your experience entirely. Quality is often in the eye (and taste) of the beholder. However, particle definition and the color of meat are two telltale signs. Particle definition speaks to the raised islands of fat in the salami—the more defined they are, the better. Quality salumi also boasts vivid colors. Look for bold reds and pinks. Cured meats encompass meats prepared using the time-honored technique of dry curing. This process used to preserve and flavor meats draws out any moisture, creating the salumi you know and love. All salami is salumi, but not all salumi is salami. Salumi encompasses meats prepared in an Italian fashion—unlike, say, French charcuterie. Salami is a type of salumi: it is highly seasoned, fermented and air-dried to perfection. Salumi also includes whole-muscle cuts like prosciutto. Simple ingredients are the secret to quality cured meats. As our Salumiere Lorenzo says, it’s all about moderation. Minor tweaks to time-honored techniques are what allow these ingredients to shine. The most important ingredient when making salami, of course, is time. Every minute matters when dry curing—it can change your experience entirely. Quality is often in the eye (and taste) of the beholder. However, particle definition and the color of meat are two telltale signs. Particle definition speaks to the raised islands of fat in the salami—the more defined they are, the better. Quality salumi also boasts vivid colors. Look for bold reds and pinks. The King of Italian Ham Learn MoreDry Cured & Thinly Sliced Learn MoreOn-the-go Protein Power Learn MoreSmoky & Spicy Spanish-style Salami Learn MoreTraditional Classics & New Favorites Learn More"
}