{
  "url": "https://www.dictionary.com/browse/just",
  "title": "JUST Definition & Meaning | Dictionary.com",
  "text": "just 1 Americanadjective - guided by truth, reason, justice, and fairness. We hope to be just in our understanding of such difficult situations. - Antonyms: - biased - done or made according to principle; equitable; proper. a just reply. - based on right; rightful; lawful. a just claim. - Synonyms: - legal, legitimate - in keeping with truth or fact; true; correct. a just analysis. - Antonyms: - untrue - given or awarded rightly; deserved, as a sentence, punishment, or reward. a just penalty. - Synonyms: - due, apt, suited, condign, appropriate - Antonyms: - unjustified - in accordance with standards or requirements; proper or right. just proportions. - (especially in Biblical use) righteous. - actual, real, or genuine. adverb - within a brief preceding time; but a moment before. The sun just came out. - exactly or precisely. This is just what I mean. - by a narrow margin; barely. The arrow just missed the mark. - only or merely. He was just a clerk until he became ambitious. - actually; really; positively. The weather is just glorious. idioms noun adjective - - fair or impartial in action or judgment - ( as collective noun; preceded by the ) the just - - conforming to high moral standards; honest - consistent with justice a just action - rightly applied or given; deserved a just reward - legally valid; lawful a just inheritance - well-founded; reasonable just criticism - correct, accurate, or true a just account adverb - used with forms of have to indicate an action performed in the very recent past I have just closed the door - at this very instant he's just coming in to land - no more than; merely; only just an ordinary car - exactly; precisely that's just what I mean - by a small margin; barely he just got there in time - (intensifier) it's just wonderful to see you - informal indeed; with a vengeance isn't it just - - at the point of starting (to do something) - very nearly; almost I've just about had enough - - an expression requesting the hearer to wait or pause for a brief period of time - - a very short time ago - at this moment - informal in a little while - - having reached exactly it's just on five o'clock - - an expression of complete agreement or of unwillingness to dissent - arranged with precision - Usage The use of just with exactly ( it's just exactly what they want ) is redundant and should be avoided: it's exactly what they want Other Word Forms - juster noun - justly adverb - justness noun Etymology Origin of just First recorded in 1325–75; Middle English, from Latin jūstus “righteous,” equivalent to jūs “law, right” + -tus, adjective suffix Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. \"What matters here is not just how much iron enters the ocean, but the chemical form it takes,\" says Winckler. From Science Daily He explained, “We were just introduced by friends. That’s it. We found out that we had mutual friends and we started to just chat.” From MarketWatch \"We've got some real quality in our team, you've just got to bring the best out of each and every player.\" From BBC Even with gross domestic product growth running at just a little over 2% a year, Australia’s economy is badly constrained. At just about half a meter long, Foskeia ranks among the smallest known ornithopod dinosaurs. From Science Daily Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}