{
  "url": "https://www.merriam-webster.com/dictionary/mother",
  "title": "MOTHER Definition & Meaning - Merriam-Webster",
  "text": "1 a : a female parent She's the mother of three small children. b(1) : a woman in authority specifically : the superior of a religious community of women Mother Teresa (2) : an old or elderly woman Mother Hubbard 3 : maternal tenderness or affection … all my mother came into mine eyes and gave me up to tears.—William Shakespeare 4 5 : something that is an extreme or ultimate example of its kind especially in terms of scale the mother of all construction projects the mother of all ocean liners 1 a : of, relating to, or being a mother b : bearing the relation of a mother 2 : derived from or as if from one's mother the mother dialect 3 : acting as or providing parental stock —used without reference to sex a mother plant mothered; mothering ˈmə-t͟hə-riŋ ˈmət͟h-riŋ 1 a : to give birth to She mothered two sons. b : to give rise to : produce … a good invention mothered by the necessity of rationing …—M. F. K. Fisher 2 : to care for or protect like a mother too old to be mothered plural mothers 1 : a slimy or gelatinous mass or film that contains bacteria, yeasts, or both, that forms in liquids during the process of fermentation, and that is often used as a starter (see starter entry 1 sense 3b) in the production of certain food and beverage products: a : mother of vinegar When the mother descends to the bottom of the barrel, the vinegar is ready to use.—William L. Hamilton After about 2 months, when the alcohol has acidified, or when a taste of the vinegar makes your mouth pucker, it's ready to strain and bottle. (You can save the mother to begin a new batch.)—Tejal Rao b : scoby A kombucha \"mother\" floats atop a vat of the fermented tea looking like a brown, gelatinous disk of bacteria and yeast, which it is.—Melissa Nann Burke The brand's approach includes straining out the mother, leaving the kombucha with more of the mouthfeel of traditional teas and other mainstream beverages.—Dale Buss 2 : a dough of fermented flour and water used as a starter especially in baking : mother dough Each day pieces are taken and used to create new loaves, and the mother is fed to survive.—Sophie Witts Love words? Need even more definitions? Merriam-Webster unabridged"
}