{
  "url": "https://play.google.com/store/apps/details?id=com.autodesk.autocadws&hl=pt-BR",
  "title": "AutoCAD – Editor de DWG – Apps no Google Play",
  "text": "Veja, edite e meça desenhos a qualquer hora, em qualquer lugar! Recursos essenciais de desenho e projeto para suas necessidades diárias: o Autodesk®️ AutoCAD® Web️ para dispositivos móveis é uma solução confiável que oferece acesso aos principais comandos do AutoCAD necessários para realizar uma edição leve e gerar projetos fundamentais, tudo isso por um preço acessível. Os planos de assinatura do AutoCAD Web estão disponíveis nas seguintes opções: • Mensal por US$ 9,99 • Anual por US$ 99,99 • Incluído gratuitamente com assinaturas do AutoCAD e do AutoCAD LT Use as ferramentas familiares de desenho do AutoCAD no dispositivo móvel em uma interface simplificada, permitindo que você acesse, crie e atualize arquivos DWG™ a qualquer momento e em qualquer lugar. Versão de avaliação de 30 dias: aproveite uma versão de avaliação gratuita totalmente funcional do AutoCAD Web por 30 dias. Após o término da versão de avaliação, será possível acessar a funcionalidade limitada de somente leitura sem uma assinatura paga. Assinantes atuais do AutoCAD ou do AutoCAD LT para desktop: entre na Autodesk Account para acessar o AutoCAD Web para dispositivos móveis. Principais benefícios: • Trabalhar off-line nos projetos sem uma conexão com a Internet e sincronizar mais tarde • Proteger os desenhos na Autodesk Account ou em suas contas próprias de armazenamento externo • Colaborar em tempo real com os membros da equipe e reduzir erros • Substituir as plantas nos locais de trabalho pelos desenhos do dispositivo móvel • Simplificar os fluxos de trabalho abrindo arquivos DWG diretamente no Autodesk Drive, Autodesk Docs, Microsoft OneDrive, Box, Dropbox ou Google Drive. Recursos: • Visualização de arquivos 2D • Criação, edição e compartilhamento de desenhos 2D • Trabalhar off-line e sincronizar as alterações quando estiver novamente on-line • Inserir blocos do desenho DWG • Gerenciar camadas e visibilidade de camadas • Ferramentas de edição de geometria e desenho • Ferramentas de anotação e revisão • Medir distância, ângulo, área e raio • Visualizar e editar arquivos DWG no armazenamento interno, no e-mail ou da nuvem • Importar valores de Leica DISTO • Visualizar coordenadas e propriedades Todos os novos usuários têm acesso a uma versão gratuita de avaliação do AutoCAD Web por 30 dias. As assinaturas serão cobradas no cartão de crédito pela conta do Google Play. As assinaturas serão renovadas automaticamente, a menos que sejam canceladas no mínimo 24 horas antes do fim do período atual. Você não conseguirá cancelar a assinatura durante o período de atividade. *Os produtos e serviços gratuitos estão sujeitos aos Termos de uso da Autodesk disponíveis em https://www.autodesk.com/company/terms-of-use/br/general-terms Saiba mais: Website da Autodesk: https://www.autodesk.com/products/autocad-web Termos de uso: https://www.autodesk.com/company/legal-notices-trademarks/terms-of-service-autodesk360-web-services/autodesk-autocad-mobile-terms-of-service Atualizado em 16 de dez. de 2025"
}