{
  "url": "https://www.dictionary.com/browse/good",
  "title": "GOOD Definition & Meaning | Dictionary.com",
  "text": "good Americanadjective - morally excellent; virtuous; righteous; pious. a good man. - Synonyms: - upright, exemplary, worthy, meritorious, conscientious, moral, pure - satisfactory in quality, quantity, or degree. a good teacher; good health. - Synonyms: - admirable, outstanding, adequate - of high quality; excellent. - right; proper; fit. It is good that you are here. His credentials are good. - well-behaved. a good child. - kind, beneficent, or friendly. to do a good deed. - Synonyms: - obliging, gracious, humane, benevolent, kindly - honorable or worthy; in good standing. a good name. - educated and refined. She has a good background. - financially sound or safe. His credit is good. - genuine; not counterfeit. a good quarter. - sound or valid. good judgment; good reasons. - reliable; dependable; responsible. good advice. - healthful; beneficial. Fresh fruit is good for you. - in excellent condition; healthy. good teeth. - not spoiled or tainted; edible; palatable. The meat was still good after three months in the freezer. - favorable; propitious. good news. - cheerful; optimistic; amiable. in good spirits. - free of distress or pain; comfortable. to feel good after surgery. - agreeable; pleasant. Have a good time. - attractive; handsome. She has a good figure. - (of the complexion) smooth; free from blemish. - close or intimate; warm. She's a good friend of mine. - sufficient or ample. a good supply. - advantageous; satisfactory for the purpose. a good day for fishing. - Synonyms: - profitable, beneficial, serviceable, useful - competent or skillful; clever. a good manager; good at arithmetic. - skillfully or expertly done. a really good job; a good play. - conforming to rules of grammar, usage, etc.; correct. good English. - socially proper. good manners. - remaining available to one. Don't throw good money after bad. - comparatively new or of relatively fine quality. Don't play in the mud in your good clothes. - finest or most dressy. He wore his good suit to the office today. - full. a good day's journey away. - fairly large or great. a good amount. - free from precipitation or cloudiness. good weather. - Medicine/Medical. (of a patient's condition) having stable and normal vital signs, being conscious and comfortable, and having excellent appetite, mobility, etc. - fertile; rich. good soil. - loyal. a good political party member. - (of a return or service in tennis, squash, handball, etc.) landing within the limits of a court or section of a court. - Informal. (used when declining an offer or suggestion, as to communicate that one is already satisfied). \"More coffee?\" \"No thanks, I’m good!\" - Horse Racing. (of the surface of a track) drying after a rain so as to be still slightly sticky. This horse runs best on a good track. - (of meat, especially beef ) noting or pertaining to the specific grade below “choice,” containing more lean muscle and less edible fat than “prime” or “choice.” - favorably regarded (used as an epithet for a ship, town, etc.). the good ship Syrena. noun - profit or advantage; worth; benefit. What good will that do? We shall work for the common good. - excellence or merit; kindness. to do good. - moral righteousness; virtue. to be a power for good. - (especially in the grading of U.S. beef) an official grade below that of “choice.” - goods, - possessions, especially movable effects or personal property. - articles of trade; wares; merchandise. canned goods. - Informal. what has been promised or is expected. to deliver the goods. - Informal. items that are authentic rather than imitation; the genuine article. If you want real pearls, we have the goods. - Informal. evidence of guilt, as stolen articles. to catch someone with the goods. - cloth or textile material. top-quality linen goods. - Chiefly British. merchandise sent by land, rather than by water or air. - - the good, - the ideal of goodness or morality. - good things or persons collectively. - interjection adverb idioms - come to no good, to end in failure or as a failure. Her jealous relatives said that she would come to no good. - for good, finally and permanently; forever: Also for good and all. to leave the country for good. - good and, very; completely; exceedingly. This soup is good and hot. - good full, (of a sail or sails) well filled, especially when sailing close to the wind; clean full; rap full. - to the good, - generally advantageous. That's all to the good, but what do I get out of it? - richer in profit or gain. When he withdrew from the partnership, he was several thousand dollars to the good. - - as good as. as. - no good, without value or merit; worthless; contemptible. The check was no good. - make good, - to make recompense for; repay. - to implement an agreement; fulfill. - to be successful. - to substantiate; verify. - to carry out; accomplish; execute. The convicts made good their getaway. - - good for, - certain to repay (money owed) because of integrity, financial stability, etc. - the equivalent in value of. Two thousand stamps are good for one coffeepot. - able to survive or continue functioning for (the length of time or the distance indicated). These tires are good for another 10,000 miles. - valid or in effect for (the length of time indicated). a license good for one year. - (used as an expression of approval). Good for you! - adjective - having admirable, pleasing, superior, or positive qualities; not negative, bad or mediocre a good idea a good teacher - - morally excellent or admirable; virtuous; righteous a good man - ( as collective noun; preceded by the ) the good - - suitable or efficient for a purpose a good secretary a good winter coat - beneficial or advantageous vegetables are good for you - not ruined or decayed; sound or whole the meat is still good - kindly, generous, or approving you are good to him - right or acceptable your qualifications are good for the job - rich and fertile good land - valid or genuine I would not do this without good reason - honourable or held in high esteem a good family - commercially or financially secure, sound, or safe good securities a good investment - (of a draft) drawn for a stated sum - (of debts) expected to be fully paid - clever, competent, or talented he's good at science - obedient or well-behaved a good dog - reliable, safe, or recommended a good make of clothes - affording material pleasure or indulgence the good things in life the good life - having a well-proportioned, beautiful, or generally fine appearance a good figure a good complexion - complete; full I took a good look round the house - propitious; opportune a good time to ask the manager for a rise - satisfying or gratifying a good rest - comfortable did you have a good night? - newest or of the best quality to keep the good plates for important guests - fairly large, extensive, or long a good distance away - sufficient; ample we have a good supply of food - (of meat) of the third government grade, above standard and below choice - serious or intellectual good music - used in a traditional description the good ship ``America'' - used in polite or patronizing phrases or to express anger (often intended ironically) how is your good lady? look here, my good man! - - an unbelievable assertion - a very funny joke - - virtually; practically it's as good as finished - excellent; very good indeed - would you please - to recover and perform well after a bad start or setback - informal (intensifier) good and mad - (intensifier; used in mild oaths) good grief! good heavens! interjection noun - moral or material advantage or use; benefit or profit for the good of our workers what is the good of worrying? - positive moral qualities; goodness; virtue; righteousness; piety - (sometimes capital) moral qualities seen as a single abstract entity we must pursue the Good - a good thing - economics a commodity or service that satisfies a human need - forever; permanently I have left them for good - - to recompense or repair damage or injury - to be successful - to demonstrate or prove the truth of (a statement or accusation) - to secure and retain (a position) - to effect or fulfil (something intended or promised) - - well done, well said, etc: a term of congratulation - - to handle to good effect I never got any good of this machine - to understand properly I could never get any good of him - to receive cooperation from - Usage Good is common as an adverb in informal speech, especially after forms of do: He did good on the test. She sees good with her new glasses. This use does not occur in formal speech or edited writing, where the adverb well is used instead: He did well on the test. She sees well with her new glasses. The adjective good is standard after linking verbs like taste, smell, look, feel, be, and seem: Everything tastes good. The biscuits smell good. You're looking good today. When used after look or feel, good may refer to spirits as well as health: I'm feeling pretty good this morning, ready to take on the world. Well is both an adjective and an adverb. As an adjective used after look, feel, or other linking verbs, it often refers to good health: You're looking well; we missed you while you were in the hospital. See also bad . Related Words See property . Other Word Forms - goodish adjective - quasi-good adjective Etymology Origin of good First recorded before 900; Middle English good, god; Old English gōd; cognate with Dutch goed, German gut, Old Norse gōthr, Gothic goths Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. To better understand how these systems evolved, the researchers generated new genetic data from sea squirts, a lamprey, and a species of frog. From Science Daily His best and most successful works took place in the past and were in the line of one of his heroes, the high-Tory Borderer Sir Walter Scott. From BBC He added: \"We're giving these meadows the best possible chance to recover, thrive and deliver real benefits for wildlife, climate and coastal communities.\" From BBC \"I'm fiercely determined, I'm fiercely competitive and I want the best for these guys, and I want the best for English cricket.\" From BBC Meanwhile, the parents of the babies who died do their best to carry on through each new revelation. From BBC Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}