{
  "url": "https://www.ferminiberico.us/",
  "title": "HOME - Fermín Iberico",
  "text": "A CUT ABOVE PURE TRADITION FOR MORE THAN 60 YEARS PURE TRADITION FOR MORE THAN 60 YEARS Proud to be the first Iberico brand to arrive in the US. For more than 60 years, Fermín has been producing the highest quality lberico products in the world and we are proud to produce and import the largest number of Iberico dry cured products in the market. OUR IBERICO OUR IBERICO Iberico pig is a direct descendant of the wild boars that used to inhabit the entire Mediterranean basin many years ago. They have a thin and stylized skeleton with a long straight snout and very strong legs. But, what truly makes this animal unique is its ability to develop fat infiltrations in their muscles, creating a perfect marbling effect on their meat. AN ARTISANAL PROCESS AN ARTISANAL PROCESS Located in the Sierra de Francia, more than l,000 meters in elevation in the heart of a National Park declared a Biosphere Reserve by UNESCO, the medieval and magical village of La Alberca, has the perfect micro climate for our products to dry and age naturally. This climate allows us to continue our traditional methods to guarantee the best quality of our products. OUR CHEFS OUR CHEFS \"Fermín Loin is an unforgettable Iberico delicacy cut; the loin has the perfect marriage of fat and meat. The flavor will haunt your dreams\" \"When this jamón ibérico de bellota is under your nose you know it - aromas of acorns, wet grass, and thyme all come to you before you even taste it. Once the fat starts melting on your tongue, you get flavors of acorns, toasted hazelnuts, wet wood, and wildflowers - and then the fifth flavor, umami, adds a profound richness to round out the entire experience.\" \"It awaken your senses, indulge in happiness. Close your eyes and savor this delicate and flavorful Jamón Iberico de Cebo. Take your time, get to know it, and learn more about its history, tradition and the passionate families who made this piece of art so delectable.\" \"When this jamón ibérico de bellota is under your nose you know it - aromas of acorns, wet grass, and thyme all come to you before you even taste it. Once the fat starts melting on your tongue, you get flavors of acorns, toasted hazelnuts, wet wood, and wildflowers - and then the fifth flavor, umami, adds a profound richness to round out the entire experience.\""
}