{
  "url": "https://schaller.info/en/schaller-anniversary",
  "title": "80 Years: World´s Finest Guitar Parts",
  "text": "80 Years: World´s Finest Guitar Parts Schaller GmbH in Postbauer-Heng near Nuremberg in Bavaria has been on the market since 1945 and is now the world market leader for guitar components. The legendary company directed by Dr. Lars Bünning has around 65 employees. It has become an indispensable part of the musical instrument industry today. Schaller supplies precision products in the field of musical instrument hardware. The machine heads, bridges, tremolos, strap locks and other guitar accessories \"Made in Germany\" are well received worldwide. And that is a tradition. Difficult beginnings after World War II At the end of 1945 the company was initially founded as a one-man operation on a very modest basis. At the age of 22, Helmut Schaller (1923-1999) began working as a toolmaker and radio mechanic in a nine-square-meter workshop after the end of the Second World War. For Schaller - as for a whole generation - the year 1945 marked a profound turning point - and a new beginning in German history. The country to which Schaller returned from captivity in 1945 was largely destroyed. This was one of the results of the twelve years of Nazi rule and the Second World War caused by the Nazis, which had lasted for almost six long years. The Allied war opponents had reacted to the National Socialist aggression with many thousands of air strikes. Half of the living space was bombed, the roads were hardly usable, coal was scarce and the last war supplies were used up. Germany's economy and infrastructure had collapsed. In addition, there were millions of war returnees, refugees and displaced persons. Many millions had died through or during the war. Millions of people who survived had suffered unspeakably. How did you build a new economy, a new country, a democratic-free state in the heart of Europe under these conditions? Tackle it and start over Most people wanted to leave the war behind them as quickly as possible, they wanted to get down to business and build something new. Helmut Schaller was definitely one of those who wanted to get started now. He had served as a soldier in the Wehrmacht for several years, had become a prisoner of war in the US and set to work immediately after his release. Because Schaller's hometown Nuremberg was in ruins, he looked in the area for a way to turn his business idea into reality. He found what he was looking for in Feucht near Nuremberg and began building a new life in an old farmhouse in the center of the village. Know-how and ingenuity Schaller was well prepared and equipped for this. After all, he had trained as a toolmaker at Diehl in Nuremberg before the war. In addition, he was able to specialize in high-frequency technology during his military service in Halle and Magdeburg. So the business idea was obvious. After all, he had the technical qualifications and the know-how to open a radio and electrical repair workshop. His passion for tinkering helped him with heavy repairs and, given the prevailing lack of spare parts, over some hurdles. At the same time, Schaller successfully made up for any outstanding exams and, as the culmination of his efforts, was awarded the title of radio mechanic in 1946. In a short time he had built up a permanent customer base with repairs to electrical appliances. These customers remained loyal to him when, in 1948, he was able to expand his business to include a retail outlet for radio and electronic equipment that could be bought again after the currency reform. In addition, he built a furniture store in Feucht and a mechanical manufacture in toolmaking. Social Commitment At the same time, he took part in building a new social order. His political home was the newly founded Christian Social Union (CSU). Since the 1950s he was represented in the district assembly of Nürnberger Land and in 1958 even won a mandate from the state Bavaria assembly. A stroke of luck for the music world Guitar boom In the wake of modern musical styles, Framus soon no longer built exclusively violins, zithers and concert guitars: Jazz guitars were increasingly in demand. There was a real guitar boom. The aim was to give the guitar a better hearing than the other instruments in modern bands through pickups and amplifiers. As early as 1948 Wilfer had therefore started to build up his own production for guitar electronics. But he quickly reached the limits of what was possible, and in any case he had all his hands to do with expanding the production capacities for guitar production. A liaison forged with Schaller brought the solution in the early 1950s. Back then, Wilfer was able to convince Schaller to develop and build amplifiers and pickups exclusively for Framus instruments. With this move, the production of guitar electronics was not only outsourced, but also professionalized. The task found the right man in Helmut Schaller. Schaller himself had found his real profession, in which he was able to set significant accents with great passion through innovation and inventiveness: the modern guitar and its accessories. Hollywood guitar For several years, the \"Electro-Acoustics Department at Fred Wilfer KG\" was headed by the \"Fa. Radio Schaller ”. The latter became the market leader in Europe, as a Framus press release from 1957 proudly stated. Schaller was able to take the first important steps with electronics for lapsteel and Hawaiian guitars. His pickups were also of great importance for archtops, i.e. jazz guitars or as they were called back then in Germany: strike guitars. The two young entrepreneurs, Schaller and Wilfer, finally achieved a brilliant coup with the “Hollywood” guitar model. In the meantime, so-called “solid body guitars“, which had been developed in the USA, began to gain popularity. With the various “Hollywood” models, German electric guitars came onto the market for the first time, which aroused the curiosity of the public thanks to the well-chosen model name that promised the “American way of life” that was longed for at the time. The traditional instrument making craft, innovative guitar electronics and modern marketing entered into a future-oriented symbiosis with Hollywood instruments. In the Framus advertising brochure it said about the new electric guitars: “They are the result of years of development work in the field of electro-acoustics in connection with traditional and modern guitar making.” Equipped with two or three pickups, with a cutaway or symmetrical with two bulges, as a guitar or as a bass - Schaller and Framus put on a whole series of “Hollywood” instruments that made the hearts of guitarists beat faster. A year later, the Hollywoods could be upgraded with a specially designed vibrato system, which of course was due to Helmut Schaller's enthusiasm for experimentation and innovation. Phoenix in the music biz At the suggestion of Wilfer and guitarists, Schaller soon turned to other problematic areas of the modern guitar. How could this question best be resolved? How could that problem be solved? Schaller paid the utmost attention to every concern presented and found a satisfactory, sometimes groundbreaking solution. Tremolos, volume pedals, echo and reverb devices, distortion devices, effects devices, bridges - Schaller had the right answers for everything. In the meantime, Framus was no longer the only buyer of Schaller products, but also other Bubenreuth and German guitar manufacturers such as Höfner, Hopf, Hoyer and Klira. A little later, the American guitar makers Fender, Gibson, Martin and Ovation joined the company as customers of Schaller. Even the German Democratic Republic used expensive foreign currency to buy from Schaller in the Federal Republic in order to make their Markneukirchen guitar production competitive. The call from Schaller had spread even beyond the iron curtain. The crowning glory: machine heads The English jazz guitarist Ivor Mairants summed up the importance of the Bavarian company for the music industry, which had advanced from a small radio business to the most important European guitar accessory supplier within fifteen years. Ivor Mairants - a connoisseur of the music business and equally virtuoso musician - praises the Schaller company in his 1980 autobiography \"My Fifty Fretting Years\": \"Helmut Schaller [...] being a fine engineer, had produced amplifiers, pickups and guitar leads, but his ace card was in the production of geared machine heads. These were giving Grover machine heads a very good run and, in fact, overtaking them. ”In 1966, machine heads were added to the portfolio for the first time. The \"M6\" tuner was the world's first fully encapsulated and self-locking precision mechanism. From 1967, brand manufacturers such as Ovation, Gibson and Martin used Schaller machine heads. Fender also switched to Schaller machine heads in 1976 and is still in business relationship with Schaller today. Expansion course In 1968 the company moved from Feucht to Postbauer-Heng just 15 kilometer away to a new and modern production facility. In the 1970s, bass tuners (M4), bridges (including TOM bridges for Gibson guitars) and other types of pickups (Golden 50, S6, T6) were added to the portfolio. In 1977 Floyd Rose®* knocked on Schaller`s door with an idea for a double locking tremolo. In a joint workshop at Schaller over a period of three months, this new type of tremolo was developed and produced by Schaller and launched on the market from 1980. At the beginning of the 1980s, the production of loudspeakers, amplifiers and reverb devices was discontinued. In 1981, Schaller developed and patented the Security Locks, with which a secure connection between the guitar and the strap is achieved. They are still the best-selling Schaller product to this day. (*Floyd Rose® is a registered trademark of Floyd Rose Marketing.) Sprawling and disoriented Until the death of Helmut Schaller in 1999 and his son René Schaller (1953-1998), the product portfolio was constantly expanded (e.g. with violin accessories, cables and much more). Even special machines for strings were developed and built in-house. However, with all these efforts it was no longer possible to build on previous successes. In the years after Helmut Schaller's death, a community of heirs ran the company together with the widow Grete Schaller (1926 - 2007), but without being able to provide sustainable impetus for new products. On the contrary: The company accumulated debts and got into precarious financial difficulties. Thanks to many years of experience and know-how, the workforce alone was able to ensure the high quality of the products and ensure the survival of the company. Your stamina cannot be rated highly enough. Schaller post-millenium era The breakthrough came in two happy steps in the second half of the 2000s. In August 2006, the Schaller company was renamed from a partnership to a GmbH (Ltd.). In this context, Dr. Lars Bünning was appointed managing director, who identified himself fully with the company from the very first moment and now set the course for the future of the company. In January 2009, Dr. Bünning was finally able to take over the shares in the GmbH from the family and has since acted as owner and managing director of Schaller. Since 2007 the company has been concentrating on the strategy of \"quality, innovation and service\" and on the field of guitar hardware. The production program now includes machine heads (GrandTune and M6 Series, replacement machine heads and bass machine heads), bridges and tailpieces (Signum, Hannes, TOM and 3D bridges), tremolos (LockMeister, Schaller and Vintage), accessories (S-Locks) , Preamps (\"Flagship\"), piezo pickups (Oyster) and megaswitches as well as pickup frames and covers. The production of electromagnetic pickups was discontinued in 2017. This concentration on precision mechanical products turned out to be a strategic move, which was finally reflected in 2016 in the name change from Schaller Electronic to Schaller GmbH. - 2016: Presentation of a modernized M6 series (90, 135, 180 and Pin) with numerous innovations and a 1:18 gear ratio. - 2017: Introduction of the one-piece Signum wraparound guitar bridge, with adjustable string saddles and lockable height adjustment screws. - 2017/2019: Update of Megaswitch toggle and rotary switches with extensive circuit diagrams for numerous switching variants. - 2018: Relaunch of responsive website - mobile-friendly, bilingual (de/en) with a new shop configurator and manufacturer support - January 2018: Presentation of the S-Locks - the next generation of Schaller Security Locks in a new design and with three new security elements. - July 2018: Additional titanium string saddles for the Schaller GTM bridge and Vintage Tremolo. - 2021: Schaller webshop direct customer support B2B and B2C. - April 2023: Presentation of the world's first double-locking tremolo “LockMeister 6” with two new pitch perfect features: 4 different tremolo and 5 different nut radii (in two fingerboard widths) extend the tremolo's range of functions. - June 2023: Schaller Oyster contact piezo pickup - now retuned, in slim and elegant nickel-plated or Pure Sound Brass shell. - June 2023: Deluxe Kluson style guitar machine heads with improved 1:18 gear ratio. - June 2023: Expansion of the knob range to include the Schaller potentiometer knob with knurled engraving and toggle knobs with SAE 8-32 and M 3.5 internal threads. - April 2024: Relaunch of the Schaller website with new, user-friendly configurator with real-time generated display of surfaces and wings, detailed technical drawings of head plate arrangement and positioning axes in the installation cross-section. - August 2024: S-Locks 100% environmentally friendly in plastic-free packaging made from bio-based potato starch and certified paper fiber. - November 2024: Schaller's new climate strategy with photovoltaics from AMPERIOS. Using 804 modules from our system, with an output of up to 340 kWp per day, the self-generated electricity reduces CO₂ emissions by an impressive 150 tons per year. - November 2024: Expansion of the BM bass machine heads range to include Music Man & Rickenbacker style models. - January 2025: The LockMeister 6 gets another pitch perfect upgrade, the longer fine tuning screws for an extended tuning range of the strings. Stay curious: we'll keep you up to date! Continuous innovation All products are manufactured in the factory in Postbauer-Heng (100% Made in Germany) with the greatest care by employees who have worked for Schaller for decades to the highest conceivable level of quality. The number of employees is around 65. For some time now, there has been a search for additional skilled workers to strengthen the Schaller team. The steadily advanced automation of the past few years has meanwhile paid off. The newly established turning shop with the most precise CNC machines, the most modern zinc die-casting machine and automatic / robot systems were the most visible of several central investments that reflect the company's willingness to innovate and ensure its competitiveness on the world market. This push for modernization was just as much a fundamental prerequisite for improvements and updates to proven products as it was for the development and production of new and innovative Schaller products of the highest precision. The customers - meanwhile half of the guitar manufacturer and half of the end customer (musician) - appreciate this. Therefore Dr. Bünning created the company's claim: \"Schaller - The Original Innovators\""
}