{
  "url": "https://forums.qrz.com/index.php?threads/hamclock-on-windows.893651/",
  "title": "HamClock on Windows!!! | QRZ Forums",
  "text": "I posted a video a while back showing that HamClock can be loaded on a Windows system. Since then a lot of people have commented that they have had problems getting it to load right. So, I have made a video going through the steps in real-time on how to load and configure Hamclock on a Windows computer, I tried this setup on both Windows 10 and 11, and it runs just fine on both. Hope you enjoy it!! 73s Hi, after following all procedure the following error came up C:\\Users\\Michael>wsl sudo hamclock [sudo] password for mgarr: sudo: hamclock: command not found C:\\Users\\Michael> any help to resolve & how ? thnaks in advance I have had Ham Clock running on windows for quite a long time and it has worked flawlessly. But I just ran the latest update and it shut ham clock down and now I cannot connect to the 127.0.0.1:8081 anymore. I am thinking hamclock is not running. I checked to see if port 8081 was being used and its not. So I am not sure why it did this. Before the update it was perfect so something happened during that update. I did uninstall and reinstall both WSL and Ham clock following the instructions and it made no difference. So I am hoping someone has some ideas what could be causing this not to run anymore. Thanks, WD9HXC Update: I was able to get it running by uninstalling and re-installing Ubuntu. Then reinstalling Ham clock like it was never installed. But its all good now. Could you help me get my Hamclock to turn off or on at the times I selected in the setup menu? There are directions in the manual that talk about setting the on-off times, and a comment about the clock never turning off if \"...mumbo jumbo to me...\" so I am stumped. Everything else works great, I don't want it to run 24/7. What is the secret? Thanks, Larry VA7LSP My version of hamclock, or ham clock, doesn't require Windows - or any other operating system. Though it does require a battery: Sorry you found the playful levity inappropriate or offensive. Feel free to report my post to the site admins. Thank You for sharing this video. WSL works well on my Windows 10 machine. I can view HamClock in both browser-based and Linux terminal. Update: I just fegured it out, in case anybody is interested: Since we are running HamClock on Windows10 or 11 thru a Vitual Machine running Ubuntu Linux we have to do the following settings to allow HamClock DX Cluster window to diplay real time info from WSJTX and at the same time run GridTracker. 1. In WSJT-X Settings -> Tab Reporting->UDP Server must be an IP for MultiCast: UDP Server: 224.0.2.0 UDP Server Port Number: 2237 and press OK 2. Re-open WSJT-X Settings -> Tab Reporting and now 2 more options are available: Outgoing interfaces: Check both \"loopback\" and \"V Ethernet\" Multicast TTL: 1 3. On Hamclock Setting Page2 select: WSJT-X: Yes Port: 2237 Host: 224.0.2.0 4. On GridTracker Settings ->Tab Genetal ->\"Receive UDP MSGs Received from WSJT-X\" Click on \"Multicast?\" -it becomes green IP: 224.0.2.0 Port: 2237 and BOOM!! All three WSJT-X + GridTracker + Hamclock work together in realtime! 73' de SV2TBR I am trying to setup HamClock, GridTracker, and WSJT-X. However, after I follow Step 1 in your post, and then re-open Settings for Step 2, I do not see the two new options you are talking about. However, my HamClock is running on the Inovato Quadra. Thoughts on how I can get these three programs to all play nice? Hahahahahahahaha! Haha! Some folks take their \"Hobby\" seriously... like wait for you in the parking lot to give you unsolicited feedback seriously. #SadHam"
}