{
  "url": "https://nypost.com/2025/02/20/real-estate/nyc-apartment-where-nanny-killed-2-kids-rents-for-8750-month/",
  "title": "NYC apartment where nanny killed 2 kids rents for $8,750/month",
  "text": "A grim crime that shook New York City to its core hasn’t stopped the Upper West Side apartment where it took place from attracting new renters. The three-bedroom, two-bathroom unit at 321 Columbus Ave., where two young siblings — Lucia and Leo Krim — were fatally stabbed by their nanny in 2012, has been leased once again, The Post has learned. The unit’s newest tenant inked the lease on Feb. 13 for $8,750 per month — down nearly 30% from the $12,000 it commanded back in 2008, according to StreetEasy records. The apartment first returned to the rental market in April 2015, just 2.5 years after the horrific murders, for a reduced price of $9,000 per month. Now, more than a decade after the murders, the unit’s price has dipped even further. Last October, it was re-listed at its latest rate before securing a new occupant last week. Despite its tragic history, the listing paints the property as a dream home after a gut renovation. Boasting soaring 10-foot ceilings, restored hardwood floors and a modern kitchen outfitted with high-end stainless steel appliances, the apartment sits in the historic La Rochelle, a striking pre-war building in one of Manhattan’s most coveted neighborhoods. The murders of Lucia, 6, and her little brother Leo, 2, left New Yorkers — especially those who leave their kids in the care of nannies — horrified. On Oct. 25, 2012, their mother, Marina Krim, returned home with her middle child, Nessie, after a swimming lesson — only to discover the unimaginable. Inside the family’s bathroom, the two children lay dead in the tub, covered in stab wounds. Their nanny, Yoselyn Ortega, had attacked them with kitchen knives before turning the blade on herself in an apparent suicide attempt. Ortega survived. Chilling footage captured Marina wailing in agony as she was rushed from the scene. The father, Kevin Krim, was away on a business trip at the time. A lengthy legal battle followed. Ortega, who claimed she was in a psychotic state, was found guilty in 2018 of first- and second-degree murder. She is serving life in prison without the possibility of parole. After the murders, the Krims had two more children, Felix and Linus. Felix was born in 2013 and Linus was born in 2016. The Corcoran Group, which repped the listing, declined The Post’s request for comment on the lease. La Rochelle is a 76-unit building two blocks south of the Museum of Natural History. StreetEasy shows there’s just one unit for rent inside currently — a two-bedroom spread asking $8,250 per month."
}