{
  "url": "https://www.baladin.it/en/history",
  "title": "History",
  "text": "Le Baladin pub opens in Piozzo (Cuneo). It will give its name to the brewery once it becomes a brewpub. Right from the beginning, over 200 mainly foreign and in particular Belgian beer labels are served. Le Baladin becomes a brewpub where beer is produced and directly sold. Blonde and Ambrée (both in filtered and non filtered versions) are the first draught beers produced by Baladin. This is the year of Super, the first bottled beer by Baladin. It is soon followed by Brune (only available on draught in Piozzo). The production of Isaac begins - a blanche inspired by Belgian beers and dedicated to Teo’s son. Niňa is the new beer by Baladin - an Anglo-Saxon inspired, hand pumped bitter. To find the right name for his latest product, Teo launches a competition won by an Argentinian friend. Nöel, a dark, strong-bodied ale, is created to celebrate Christmas. Wayan is created, the saison dedicated to Teo’s newborn daughter. Space is tight, so the first transformation of Teo’s parents’ hen house is required. Chickens are evicted to make room for the fermentation cellar. Soon after, Teo is forced to come up with the idea of the beerduct: an underground duct to transfer the wort from the main square of Piozzo to the legendary hen house. Baladin presents Isaac and Super at the GBBF (Great British Beer Festival). Birrificio Italiano also participates in the event with its Amber Shock. Teo and his good friend Ago are the first Italian representatives to attend the legendary event in the UK. Special thanks go to our friend Kuaska for representing and introducing us to the English colleagues. Teo creates Nora, an Egyptian ale which he dedicates to the mother of his children. Demand grows and the equipment changes. Its larger size requires a move to the now former hen house. Selezione Baladin is created, the distribution company which sells Baladin beers as well as a selection of other top quality products in Italy and abroad. Elixir joins our product range. It is a strong beer, fermented with whisky yeasts. September 2004 is the date of birth of Xyauyù, the oxidized barley wine that is the crown-jewel in Teo’s experimentations. Since its creation, Xyauyù has won everyone over. Its success has been acknowledged by several awards and victories: that is why it has become a true symbol of Baladin production. Michael Jackson (The Beer Hunter), the most famous beer taster in the world, publishes a new Italian edition of his guide to the 500 best world beer, where he includes Isaac. Baladin makes its cider – Sidro Baladin – with the delicious apples from Savoy. Teo receives the “Semper Ardens awards for beer culture” from Danish Carlsberg. The acknowledgement is given to people who contribute to the development of beer culture in the world. Teo is the first Italian to receive the prestigious award as “promoter of beer culture in the world of gastronomy and in the catering sector”. Mama Kriek is created from Wayan, with the addition of griotta cherries. The label features a portrait of Teo’s mother Maria while she cooks the cherries used to flavor this aromatic beer. Teo experiments with cereal farming (spring two-row barley) on a 4 ha. plot near Piozzo and the concept of “Morally Controlled Production Chain” is developed. This is the first step towards the status of farm brewery. Baladin launches Erika, a saison made with heather honey and refermented with fir honeydew produced by Thun. The name will later change to Mielika. The ultimate beer tasting glass is developed. Its name, TEKU™, comes from the combination of the names of its two creators: TEo and KUaska. When the new FIAT 500 is launched, Baladin presents a special edition of Super - Super 500 - of which only 500 numbered bottles exist. FIAT produces only one Baladin 500, which will become a model car for gift boxes. After 3 years of hard work Casa Baladin, a beer restaurant with rooms, is opened. It is conceived as a restaurant with special menus accompanied by Baladin beers, and a unique place where guests can feel at home and relax, maybe take a Turkish a bath and then stay in one of the 5 available rooms. Gusto is created from Wayan, although with more marked pepper notes. The beer is dedicated to the team who has worked hard to create Casa Baladin. X-Fumè, a variation of Xyauyù Oro, is obtained from the infusion of Lapsang Souchong tea leaves. The first 10 hectares of spring two-row barley are sown in Melfi (Basilicata). The fields are directly managed by Baladin. Riad Baladin opens in Morocco, in Essaouira, with the help of our friend Nicole Pavlin. An evocative place and 8 dream rooms which perfectly represent Teo’s love for Africa. Open Baladin is the first open source beer in history. The recipe is published online with the right quantities for home brewing. The project is based on sharing and spreading the recipe; so much so that Baladin launches an Open competition at its “Una Birra per l’Estate” (A Beer for the Summer) event. The monthly magazine Wired is informed and publishes a long article to Teo and his project. Baladin is awarded the title of Brewery of the Year by Unionbirrai. Xyauyù wins the first prize at the “Beer of the year 2008” awards in the barley wine category (beer with a high alcohol by volume content). Bottega Baladin opens. An eclectic shop where Teo can express his taste in other products. In addition to more classic items, Bottega also sells a selection of clothes and fabrics. The Guide to Italian beers 2010 is presented. Baladin obtains several important acknowledgements as a brewery (it is awarded the Slow Food snail) and for its beers: Elixir, Erika, Lurisia 8, Lurisia 10, Lurisia 12, Nora and Xyauyù are given 5 stars. The new plant of Birrificio Baladin is opened in Farigliano. The previous production plant was not able to meet the growing demand, so a larger one was needed. In order to avoid building on green areas, an 3,000 m² warehouse (we thought it was huge at the time) is bought and renovated in the near village of Farigliano. Solar panels are installed on the roof, thus starting the process towards energy self-sufficiency. Open Baladin Cinzano opens. It is the first pub aimed at spreading the culture of Italian craft beer through the sale of Baladin products and 100 labels of bottled beer from all over Europe, in addition to a selection of draught beers which changes throughout the year. Foreign brewers are also welcome and some of their best products are often served draught. Teo Musso joins the board of Assobirra. An absolute first for a representative of the craft sector. At the celebration Una Birra per l’Estate the hops plants are planted with many home-brewer friends. This is a first, very important step which will bear its fruits three years later. Open Baladin Roma opens in the center of Rome, in the Campo dei fiori area. It is a large pub which follows the formula tested months before in Cinzano (100 labels of bottled beers from various Italian craft breweries) with no less than 40 taps and a continuously changing selection of great Italian and foreign craft beers. It immediately becomes one of the symbols of the Italian craft beer movement. Nöel wins the gold medal at the Mondial de la Bière in Strasbourg. The barley fields in Melfi, in Basilicata, where the climate is favorable to this crop, reach 25 hectares. 5 strains of yeast produced in Italy are selected for the exclusive use of Baladin. Xyauyù receives the first prize at the “Beer of the Year 2010” awards in the barley wine category (beers with a high alcohol by volume content). The new 250 ml bottles of Super and Isaac are launched. Small, great beers. The “Sfuso Baladin” project is presented. To serve customers who want to take home draught beer, an innovative, reusable glass bottle is invented to preserve the fragrance of beer for a few days. Packaging costs as well as glass waste are reduced. Nelson is launched - a golden, draught only beer made with Nelson Sauvin New Zealand hops. Bibite Baladin (Ginger, Spuma Nera and Cedrata) are launched to rediscover the taste of old-style soft drinks. Natural products with no preservatives, simple and tasty. Cantina Baladin is created in the former hen house and former brewing room. It becomes the place where beer and wine reconcile, just as master brewer Teo and his winemaker father Enrico. The aging cellar contains 160 barriques for the Terre and Lune project (we’ll talk about it again in 2011...) and for Xyauyù. The Guide to Italian Beers 2011 is presented. Baladin obtains important acknowledgements, as a brewery (it is awarded the Slow Food snail) and for its beer: Isaac, Elixir, Erik, Mama Kriek, Nora and Xyauyù are given 5 stars. Mono Baladin is presented, a unique project for sound monogamy. This somewhat odd definition indicates the rediscovery of the sounds of old times, when exalting or counterfeiting sounds were certainly not the goals of those who built sound systems. A return to analog sounds, in true Baladin spirit. Baladin Cafè Saluzzo opens. The place is a true work of art that is worth visiting and where beers from Piozzo and a few guest beers can be tasted. Xyauyù Oro 2005 wins the first prize at the “Beer of the Year 2011” awards in the barley wine category (beers with a high alcohol by volume content). The fields directly managed by Baladin in Melfi expand and reach 68 hectares. “Super Arrogant” is created by Teo in cooperation with American master brewers Greg and Steve from Stone Brewing - the makers of the legendary Arrogant Bastard Ale. “Cars 2” by Disney Pixar is released in Italian theaters. Our American friends and authors pay a little homage to Baladin and Piozzo. Birreria New York opens in the US branch of Eataly, wanted by Oscar Farinetti to showcase Italy in the Big Apple. Nazionale is launched, the first 100% Italian craft beer with barley from Melfi, hops from Cussanio (planted back in 2008) and the special yeast selected for Baladin in Italy. Super Bitter is created – a provocative statement beer for hops lovers. The basis is Super and American hops are added with a dry hopping procedure. Terre and Lune, the two beers dedicated to the world of wine, are presented. Terre is dedicated to red wines, is produced with barley malt and Nerone rice and aged in oak barrels where once great Italian red wines were aged. Lune is made with barley malt and spelt and is aged in oak barrels previously used for great Italian white wines. Both beers are aged in Cantina Baladin. “Zucca” is created to celebrate the Pumpkin Festival of Piozzo and follows the American style of pumpkin ales. Baladin Cafè Cuneo opens in the beautiful setting of Viale degli Angeli. Cola Baladin is created in cooperation with Slow Food. Cola Baladin only uses cola nuts from the Kenema (Africa) Slow Food presidium. Its amaranth color comes from the color of cola fruits. Part of the revenues is given to the Slow Food Foundation for Biodiversity to support the Kenema Presidium and contribute to the funding of the One Thousand Garden in Africa project, promoted by Slow Food and FAO. The classic dark ale Nöel changes its name to Leön, so that it is not necessarily identified as a seasonal beer… because it is not! Baladin launches its Christmas ale “Nöel Vanille”. Dark, with a thick head, Nöel Vanille mesmerizes with its explosion of scents and aromas which evoke a festive atmosphere, full of cuddles and lazy times. Its typical chocolate notes mix with the aromas of dried fruit and toffee. In this version Nöel is characterized by the aroma of vanilla. Baladin meets an important production target: 9,000 hectoliters per year. A great achievement, although still very far from the necessary 18,000/20,000 hectoliters to ensure full sustainability of the production cycle - from the production of raw materials, to energy production and product distribution. Our range of classic beers (Isaac – Nora – Wayan – Super – Leön – Elixir) and the beers from the cellar (all Xyauyù and l’Esprit de Nöel) are now sealed with corks and protected by a layer of shellac. The aim is to use natural and recyclable materials. Also, restaurant owners are given the opportunity to open our bottles with a know and appreciated gesture. Birrificio Baladin changes its commercial name to Birrificio Baladin Società Agricola. Finally we are an agricultural company thanks to the direct production of almost all the barley required for the production of base malt, and of part of the hops. The 50 ton silo which will contain Baladin malt is set up. This allows the optimization of transport costs - with a 40% reduction - and it will no longer be necessary to manually handle hundreds of 25 kg bags. Xyauyù Oro 2008 wins the first prize at the “Beer of the Year 2012” awards in the barley wine category (beers with a high alcohol by volume content). Teo, Leonardo and Sam Calagione, in cooperation with archeologist Patrick McGovern (“Doctor Pat”), work at Etrusca, a beer made with the typical ingredients of that historical time. The three breweries differentiate their own version by fermenting it in a different way: Baladin uses wooden barrels, Birra del Borgo chooses amphorae and Dogfish Head a special copper container. Semi-official inauguration of the new Birrificio Baladin Società Agricola. All rooms are updated and customized in Baladin style to welcome beer lovers and communicate, through colors and images, the philosophy of Baladin and the different stages of craft beer production in Piozzo (… actually Piozzo/Farigliano). The Guide to Italian Beers 2013 is presented. Baladin obtains important acknowledgments as a brewery (it is awarded the Slow Food snail) and for its beers. Isaac, Super and Xyauyù Oro 2008 are acknowledged as slow beers (the top evaluation), Lurisia 4 as a daily beer and Elixir as a great beer. Petit Baladin opens in Turin in the San Salvario neighborhood. The beers from Piozzo officially land in the main city of Piedmont. The style of the pub is Seventies inspired, informal, carefully decorated and with an open kitchen. YI-ER is born from the cooperation between Teo and his long time friend and companion since the very beginning of the Italian craft beer movement Agostino “Ago” Arioli from Birrificio Italiano. Teo creates a top fermented beer inspired by “Imperial Russian Stouts”, with a high alcohol by volume content (11%) and fermented in oak barrels. His beer builds the malty basis of the blend. Ago creates a bottom fermented 8% beer, which ferments in steel vessels. Raspberries are added at the end of the fermentation process. His beer is the hoppy part of the final blend. The first beer for the blend is brewed at Open Days at the Baladin brewery in Farigliano. The combination of the two beers generates the YI-ER blend, 9.5% ABV. A beer with a unique, balanced style. NO.AU opens in Rome. This small pub is the exclusive realm of very special beers: reserves by Teo and Leonardo and from all over the world (first and foremost from Italy). Gabriele Bonci works in the kitchen. Beers are served draught, especially from casks. Their names are Befanà (Francesco Conforti & Davide Pedrini), Óttemel (Egidio Latronico), Tròppel (Maurizio Caselli & Alessandro Gardelli) and Fèrmete (Birrando Gustando Association). 4 beers produced by Baladin in cooperation with the winners of the “Una birra per l’Estate 2011” competition and of the “Campionato Italiano Homebrewer 2011” (the Italian Homebrewer Championship 2011) thanks to the support of MoBi and the “Birrando Gustando” association. We believe that this is also a way to disseminate the culture of Italian craft beer, a wonderful experience and an exciting opportunity for sharing. The harvest of Italian hops has been abundant and of good quality. Even more beer lovers have the opportunity to taste the all-Italian delicious Nazionale. Created from a recipe developed by Teo, Leo and Sam in March, here comes ƎTRUSCA. Leo chooses amphorae for the refermentation process, Sam goes for copper and Teo picks wood! 3 beers with the same complex construction and 3 different souls. The legendary Oro 2009 has finished its 2 year aging time and is ready to be drunk. It is accompanied by Barrel - the same product, but aged in rum barrels - and Fumè, aged in Scottish whisky barrels Distilled 2011 beer which was left to rest in oak barrels until a perfect harmony between its spirit and the aromas of the barrels it was kept in was created. A little “treat” for passionate drinkers who love taste and elegance. The color is straw yellow, the taste is smooth with gentle notes of wood and chocolate. Renewed image for the \"open source\" Baladin’s beers. It is a blonde beer, saison style. Actually, it was produced as a pilot of the new version (2013) of Wayan to study the balance between different types of pepper. In its genesis it was used also to test a type of yeast that favored an high attenuation. After the victory in 2008, the Baladin brewery is back on the podium of the contest of Italian craft beers. Born from a reinterpretation of a classic Baladin beer: Elixir but characterized by the use of an American hop ... cultivated in Italy. MeM is however to be discovered thanks to his Italian-American flavor in which there is a clear date known smoked malts. The Cascade hops is produced by the Frè farm not so far from Piozzo. From Elixir retains the strong character and high attenuation due to the use of whiskey yeast. Amber with persistent foam. MeM is going to Musso and Musso from the surnames of Teo Musso and Musso Antonello, owner of Frè farm. The last addition to the Kikke Baladin “family”, these chocolates are the result of the cooperation with Sabadì, where Simone Sabaini - the man behind the company based in Modica - and Teo have come up with the idea of creating six tasty products which perfectly combine with our six beers from the Classic range. Teo’s life story and his fascinating journey to discover the craft beer. Dedicated by Feltrinelli publisher. Goodbye and thank you 25 cl, welcome 33 cl! Teo ventures again into the world of macro-oxidation. This new exploration of taste starts from Xyauyù Oro, combined with a product of the best Italian farming: Kentucky tobacco. Using a cold infusion technique, tobacco is added to the oak barrels where the beer is kept. Friday, September 13, 2013 officially opens Baladin Milan. Six beers of excellent quality are the best in Italy according to the first Cerevisia contest, born to promoting the excellence of Italian brewing. The beers were judged in two categories. High fermentation and low fermentation. First among the ales was our \"Nazionale 3.3\" Gold One (Mauro Queirolo) – W Two e Christmas Tree (Fabio Donelli – Alice Davoli). New hombrew beers experiences produced in large pot. A very limited edition of 500 bottles of Baladin beer distillate with Italian hops flowers from our fields in Piedmont, added with cold hopping. While preserving the smoothness of the original distillate, it also presents delicate, slightly bitter herbaceous notes. It still has its typical clear, straw yellow color. This result makes all of very proud ... Thanks to Xyauyù Oro – Xyauyù Barrel – Lune – Terre – Mielika. Open mind in the center of Turin. 38 beer on draft available for the best craft Italian breweries. Of 4,754 beers judged, Xyauyù gets the bronze medal in the category \"Experimantal Beers\". Bibendum Baladin is a birraenoteca, a new place where the world of craft beer is blended with the world of wine, a place where wines and beers lives will gradually equal attention, since they already have equal dignity. Super Bitter won the category \"North of Italy - High Fermentation\" Open Baladin Fest (Turin) first edition. The brand new event devoted to live beer and master brewers. 2014 main theme: celebrating 18 years of live beer in Italy with more than 160 craft beers. There have been many master brewers invited to tell us something about themselves and discuss their everyday job. 16,000 hl/year products. An important goal but in line with expectations to ensure the sustainability of the production cycle: from the ground to the glass. \"Slip\", a Kölsch-style beer, from the recipe of Gianriccardo Corbo, homebrewer who participated to the Italian Hombrewing Championship organized by Mo.Bi. Thanks to the result obtained in the final ranking he had the right to join Baladin to produce a single big batch of his beer. The word \"Guiguette\" identified, in France, the clubs born near Paris, where you can eat informally but also listen to music and dance. In Italy they are known as balera. Often they have a large terrace, just as in our case. The spirit wants to help people to get together, enjoy listening music but also talking, sharing moments, drinking a good beer. Suzy Dry has delicate and fresh scents of white flowers and strawberry grapes. The taste reveals slightly winey aromas and smooth notes of plums, supported by a delicate, pleasant acidity with makes this beer rather easy to drink and somewhat hides the alcohol content. In the final notes, the freshness of the pepper prevails and harmoniously blends with the delicate taste of the cereals used in this beer. Baladin and Mr. Malt (www.mr-malt.it) have created the evolution of the malt extract kit dedicated to Open Amber. Homebrewers can replicate all three Open beers (White - Gold - Amber) starting from raw materials: barley malt, hops, yeast and spices where necessary. All quantities were measured and a detailed guide will help during the entire process. Welcome MelaZen: the recipe contains apples and ginger, two excellent products of farming. Fresh, tasty, intriguing. Welcome Baladin Metodo Classico. All beers produced by Teo Musso undergo a second fermentation in the bottle, but in this case the concept is taken to the extreme with the aim of exploring the most intimate secrets and most hidden nuances of this technique. Nasce Baladin POP: la prima birra artigianale in lattina. Si tratta di una birra in pieno stile Baladin reinterpretata in chiave popular con l’intento di proporre un prodotto di alta qualità ma facilmente fruibile. RateBeer - importante sito statunitense attraverso cui gli appassionati provenienti da tutto il mondo possono proporre, commentare e giudicare le birre, i birrifici e i pub – premia Baladin in 4 categorie. Xyauyù Barrel (GOLD MEDAL – The Best Beers by Style Category – Barley Wine); Xyauyù Barrel (Top beer by Country – Italy); Birrificio Baladin (Top Brewer by Country – Italy); Open Baladin Roma (Top Places To Have A Beer In The World). Baladin was presented 5 awards in 4 categories. Xyauyù Kentucky 1st place \"High fermentation, high ABV of Angloamerican inspiration (Barley wine)\"; Xyauyù Barrel 1st place \"Aged in wood, high and low fermentation\"; Lune 2nd place \"Aged in wood, high and low fermentation\"; Xyauyù Fumè 3rd place \"Smoked, high and low fermentation\"; Nora Sour 3rd place \"Sour beers\". The new edition of \"Guida alle birre d'Italia\" by SlowFood Editore is out!Baladin Brewery was awarded the ‘Chiocciola’ (the ‘snail’ symbol) and received many distinctions for our beers. We are so proud of these achievements! In Cuneo Open comes with 32 tap lines of the best Italian craft beers and the first Open Lab, the laboratory for homebrewes. Baladin awarded two first places in two categories! Wayan was the gold medal in the category Saison, while Isaac in the Wheat Beer. We are proud that these two historic beers continue to enjoy success . The new site, inaugurated with four days of parties from july the 13th to 16th 2016 is located within a 73.000sqm property that includes a beautiful rustic house and is surrounded by an equally stunning park named ‘Baladin Open Garden’. RateBeer - valuable American website through which beer lovers from all over the world can rate, comment, and judge beers - awards Baladin 4 prices. Birrificio Baladin (Top Brewer by Country – Italy) - Xyauyù Barrel (The Best Beers In The World – TOP 100 beers) - Xyauyù Barrel (SILVER MEDAL – The Best Beers by Style Category – Barley Wine) - Xyauyù Barrel (Top Beer by Country – Italy) - Open Baladin Roma (Best Places For Beer – Italy) The first 100% Italian makes us proud! Medals awarded to: Nazionale, Xyauyù, Xyauyù Barrel, Lune. Special mention for Terre. Finipa is born. It is a session IPA created by Mattia Ruzzafante, homebrewer and brewmaster for a day for he has won the Italian Homebrewing Championship powered by Mo.Bi. Super celebrates 20 years with three special and limited edition of the Baladin’s masterpiece. Super Mosaic, marked by Mosaic hop; Super Gentile, with the Tonda Gentile nut from Piedmont, and Cinnamon, characterized by cinnamon. After a long crowdfunding campaign, Baladin Open Garden opens its doors to the first Summer in the Garden: a great season full of events, live shows, and concerts to spread craft beer culture and to create moments of sharing either for Baladin’s community and all the people fond of brewing in general. Andrey is born. It is an American Wheat Ale, from a Sebastiano Cannata’s recipe. He is a homebrewer and brewmaster for a day for he has won the Italian Homebrewing Championship powered by Mo.Bi. Baladin Caselle Aeroporto opens in the departure are of the Turin international airport. The “live” beers produced in Piozzo are served in a large box of Nazionale beer, the symbol of 100% Italian craft beer. This little gem of a gastropub also offers burgers and high-quality dishes to its customers. Baladin Garden beer is born. It is a unique beer, a smoked ale, devoted to Baladin Open Garden, and it uses malted barley toasted in a coal oven in Cascina Baladin. Bottled in magnum size only for those who have contributed to the crowdfunding, it is available in bulk in all Baladin’s pubs and during events and fairs. Baladin per FICO opens. In the largest agri-food park in Italy, FICO (Italian Farm Factory) we are present with a brewpub: a brewery with an attached educational area, and a space where beers and food are served. Also, in order to showcase the world of independent craft beer in Italy, we have also accepted to manage a beer shop with carefully selected, representative products. Super Arrogant 20 anni born. Arrogant Bastard Ale - an American legend - was created in 1997, just like Super Baladin. Long-time friends Teo and Greg thus decide to brew a \"special edition\" beer to celebrate this important anniversary. Baladin selects the cereals and takes care of the fermentation, while Arrogant Brewing chooses the hops. The result is an interesting beer, with a strong body that comes from the malt, and a high degree of bitterness, where resinous scents and aromas stand out, as well as grapefruit citrusy notes and spices from the Chinook American hops. Nöel Liquirizia is born to celebrate Christmas 2017. Baladin Zanzibar opens. A charming resort where simplicity rather than luxury makes you feel like home! Magika is born. An experimental beer ispired to the doublel belgian ale. Super FICO and Ruggine are born. These are extraordinary draft beers served only in FICO Bologna pubs and restaurants. Eurhopea is born, an experimental beer with 100% European raw materials. Nazionale Gluten Free is born. The first 100% Italian beer and it’s gluten-free! University of Udine’s beer is born. This is an educational beer created in partnership with all the students of this university. Soraya, the new summer ale devoted by Teo Musso to his youngest daughter, is born. Nazionale Bio Revolution and Fair Cinnamon, made for Altromercato consortium (one of the leading players in Italy as far as Equal and Fair Trade are concerned), are born. These two beers tell the story of Italy and the whole world. Brewmaster for a day. Rebelot by Gianluca Toso is born. He is the winner of the Piozzo’s stage of the Italian Homebrewing Championship powered by Mo.Bi. Baladin presents Kioke during Turin’s Salone del Gusto. This beer melts the Italian brewing tradition with the huge cypress wood barrels handmade by Japanese artisans. Beermouth is born. It is a Vermouth based on beer, created from the winegrowing and brewing heritage thanks to Teo Musso’s “clear, visionary madness”. Roxa is born. It is an American Amber Ale characterized by citrus and bitter notes. Available only on tap, it is perfect for a night out in your favourite pub. Oval is born. It is characterized by wild yeasts and Brettanomyces Bruxellensis. Limited edition available only on tap. Tonica al Fieno is born. Made with spring hay - the one that is cut first and is the most fragrant – from the Alps around Cuneo. Winner of the awards “Innovation of the year 2019” at Barawards (Bargiornale magazine). Three Amor beers devoted to brothers Alajmo's gastronomic project are born. Three beers for three fathers: the citrusy scented Bianca - created by Teo - Ambrata, with a touch of saffron by chef Massimiliano Alajmo, and Scusa which represents perfectly Raffaello's (Massimiliano's brother) strong personality. TEKU™ Spirits is born. Teku has inspired it, but this new glass it's devoted to Beermouth and beer spirits. Italian Alley opens in Camden Market (London): five arches where you can find Italian food and Baladin Beers Baladin Italian Alley is born. It is available only on tap and only in Italian Alley pubs in London. The University beer project is going ahead. This year, all the students have created in our brewery in Piozzo a Bière Blanche inspired by Belgian beers. It is available in all Udine University stores. Rock'n'Roll Tattoo #1 is born. It is the first of a series of limited edition labels created by well-known tattoo artists. The first design has been made by Sergio Messina (Shock Tattoo Studio, Rome) The Italian Beer Consortium is born. Its main aim is to protect Made in Italy craft beer productions. Its chairman? Teo Musso! C'è Fermento: a beer created by Cuneo artisans in our brewery in Piozzo to celebrate the tenth edition of the namesake event in Saluzzo (Cuneo) organised by Fondazione Amleto Bertoni. POP - the first Italian craft beer in a can - renews its image with 12 brand new designs. Because life is in colours! It's time for NEPO! A cobot (collaborative robot) that taps beer simulating the human gestures. It was created by EPF Automation who have offered their technical knowledge to the world of Baladin Beer. This is a new experiment in the Open Project, which aims at innovating and spreading the craft beer culture. Rock’n’roll Tatto N.2 is born. The second limited edition can with a label dedicated to the world of tattoos. The work is design by the Turin tattoo artist Hefrem Avagnina of the Imago Amens studio. Nazionale Luppolo Fresco 2019 is arrived! A special edition of the first 100% Italian craft beer, made with extremely fresh hops used just a few days after the harvest. Available in keg, and from 2019 a limited number of cans - just 2,000. Nöel Chocolat is ready and it uses a rare cocoa, characterized by a great aroma. The name is Criollo cocoa, in the rare and aromatic Chuao variety, coming from the agricultural supply chain of Domori company. All this thanks to the friendship between Teo and Gianluca Franzoni, legendary cacao selector and popularizer of this ancient and noble product of the Earth. Isaac Sour 2015 - experimental beer refermented with lactic bacteria to explore the evolution of its tastes; the result is a sour beer with pleasant aromas of apricot and peach which perfectly blend with delicate citrusy, lactic notes. Baladin 4.8 is born, a light beer with a strong, distinctive character. A 100% Italian beer, is part of the From the Earth to Beer project, launched to give emphasis to the Italian agricultural sector that supplies all the ingredients used in the recipe. L’IPPA is born. Teo Musso interprets the India Pale Ale style with 100% Italian ingredients. SUD di BALADIN is born. Sud di Baladin is created to thank the lands of southern Italy, the source of amazing ingredients. A 100% Italian beer, Teo Musso calls it an Italian Mediterranean Ale. Baladin Camden opens in London: it is in the heart of Camden Market in London, right in front of the statue of Amy Winehouse. A quintessential Baladin pub, it is the place where Italian food and Italian craft beer meet. The Nazionale range extends. Nazionale Bianca, Nazionale Ambrata and Nazionale Forte are born. Agrumata is born. A soft drink made with a mix of Italian citrus fruits. The Flower Power are born. During the first lockdown, this very special series is born to share our positive message to look forward because life is like a flower that is reborn every spring and has the power to make us feel good. Six new labels for our most loved beers, in each one we have included references to pop art, music and geek culture. Baladin Cider is born. It is made exclusively from Italian apples. It won the World Gluten Free Beer Award 2020, category cider. Tonica Baladin and Ginger Beer are born. Developed for mixology. A more classic tonic water and an explosion of ginger and lemon for ginger beer. Nazionale Astrid is born. A limited and numbered edition can of three different graphic subjects representing Astrid’s face, the character designed by the star-comics artist Mirka Andolfo. Created for the special event of Star Days ‘Edizioni Star Comics’, the three cans represent three fundamental steps: pencil drawing, ink drawing and colour drawing. Nazionale Luppolo Fresco 2020 is born. A special edition of the first 100% Italian craft beer, made with extremely fresh hops used just a few days after the harvest. Available in keg, and from 2020 a limited number of cans - just 3,000. Tonica Amara is born. The bitterness is emphasized by mixing different roots and barks with absinthe. Baladin presents Amaro Baladin. On a summer night, Teo ‘was playing’ with some spices to emphasize the bitterness of Beermouth. A few months later of hard work in the brewery, a liqueur based on Xyauyù beer – the amaro - was presented: elegant and strong bitter notes with flowery and lavender nuances. Baladin Green Pea is born. The basis is Nazionale Baladin Bio – biological - with a greater presence of coriander. Dedicated to the Green Pea project: the first Green Retail Park in the world dedicated to the theme of Respect. For the first time the can featuring the 360® End technology: the entire lid can be removed, turning the can into a drinking cup. A new green approach to packaging. Tonica al Fumo is born. A touch of smokiness comes from an extract of toasted oak wood. Oxpera is Born. A gastronomic beer dedicated to the world of restaurants. It is created from a blend of craft beer and craft beer vinegar. The can range is enriched with 4 classics. Nazionale, Super Bitter, L’IPPA and Rock’n’Roll. Tonica Paprika is born. Special edition of tonic water with paprika dedicated to the new comics by Mirka Andolfo: Sweet Paprika. Baladin Cocktail, easy to drink, are born. Reinterpretations of great classics but with ingredients from the Baladin supply chain. Innovative and ecological packaging: the 360® End can with full opening. Winner of the Brands Award 2021, new entry category (MARK UP and GDOWEEK magazines). Briciola is born. Beer born with unsold bread. In collaboration with the association of bakers of Cuneo. POP renews the graphics and adopts the total opening 360® End. Sud di Baladin renews the graphics and adopts the total opening 360® End. The Baladin TeKu Club is born. A project dedicated to the Baladinian community. A kit full of surprises, beer, and special offers and events exclusively for members. Open Baladin Genève is born. A brewpub with 30 beers on draft, of which 16 Swiss and 2 produced inside the pub. The open mind arrives abroad! Launch of the \"Beer Revolution – The History of Craft Beer\" podcast, written and narrated by Eugenio Signoroni and produced by Piano P in collaboration with Birra Baladin. Baladin 4.8 \"SAVE THE GLACIER\" is presented. A limited edition can dedicated to the project Skyway Mont Blanc. An important message of environmental sustainability. Baladin Rock'n'Roll Marlene Kuntz \"Karma Climate\" is presented. A limited edition can with a new recipe that uses Baladin yeast, dedicated to the new disc of the band from Cuneo. Brew to raise awareness of the dramatic environmental situation. THE YEAR OF OPEN 2022 Baladin refreshes the format of the Open project. Each year, only one new beer will be presented and included in our beer range. The recipe will be developed with the reigning champion of the Italian homebrewing championship and the Baladin master brewers. A new beer style each year. For this first edition (available in casks and 7,000 cans), the chosen beer is a 100% Italian Black IPA. The creators of the recipe are the winners of the 2019 (Elia Barozzi) – 2020 (Jacopo Deola) – 2021 (Luca Trovato) editions. Tonica al Pompelmo is here. Pink grapefruit meets quinine. A citrusy and pleasantly bitter taste with a hint of pink. Participation in the Envelope 6 contest by Eurostampa typography, in collaboration with the University of Gastronomic Sciences of Pollenzo. Launch of the Beer Revolution comic book, written and illustrated by Antonio \"Sualzo\" Vincenti, in collaboration with Teo, and published by Star Comics. Dedicated to the world of craft beer, it takes readers on a journey to discover 15 craft breweries around the world. The first Baladin Advent Calendar is born, illustrated by Marco Bailone, the creator of Bevitore Sacro. The Oceanic Brewery is inaugurated aboard the flagship of MSC Cruises, the MSC World Europa. Under Teo's guidance, three craft beers are created, brewed with desalinated seawater and exclusively served onboard. The Baladin Gin is born, in collaboration with Quaglia Distillery. Botanic is born. The first non-alcoholic and low-calories beer, made by Baladin. 100% Italian ingredients; fermented with Saccharomyces cerevisiae yeast and spiced with Coriander, Gentian, Passiflora and essential oil of Cannabis sativa. Available in can, only in Italy. The Super special edition \"Cirque Bidon\" is launched to celebrate the new show by François Rauline (the man behind the name Baladin), produced at Baladin Open Garden in Piozzo. Illustration by Gabriella Piccatto. Soraya is born, dedicated to Teo's daughter for her tenth birthday. 100% Italian, with Piedmontese raw materials, extra dry and delicate like a rose petal. OPEN 2023 is born. 100% Italian Hazy IPA produced in collaboration with the 2022 Italian homebrewing champion, Jacopo Deola. Only available in Italy. The Metodo Classico Cuvée 60 Mesi is born. An evolution of the 2017 batch, initially presented as 36 Mesi (October 2021), but left in the bottle for two more years by Teo’s choice. Limited to 2,577 bottles. The Sud di Baladin special edition FOODMETTI 2023 is born. The label is dedicated to writer Marco Malvaldi, with an illustration by Giacomo Bevilacqua. The second Baladin Advent Calendar is born, illustrated by Gabriella Piccatto, featuring the Cirque Bidon by François Rauline, the man who, in 1986, suggested Teo Musso name his pub \"Le Baladin\". The Nöel Orange & Cacao is born, brewed with orange peels and cocoa bean husks. Gold medal winner at the Brussels Beer Challenge 2024 in the Winter Ale category. On March 5, Teo’s birthday, the Beer Revolution equity crowdfunding is launched. In just 6 days, €5 million is raised and 2,197 Baladin members join! The IPPA Subsonica \"Realtà Aumentata\" is born – a special series dedicated to the Turin band’s new album, written at Casa Baladin. The Nazionale Leggera is born, a 100% Italian light beer (according to Italian law) with only 3.2% alcohol content. The Nazionale Gluten Free receives the Spiga Barrata, an international certification that confirms the beer contains less than 20 ppm of gluten. The OPEN 2024 is born – a 100% Italian Hay APA, brewed in collaboration with 2023 Italian homebrewing champion, Andrea Morelli. Available only in Italy. https://www.baladin.it/hubfs/img/Storia/2024_Open.jpg The POP special ed"
}