{
  "url": "https://www.goodtherapy.org/for-professionals/software-technology/ehr-emr/article/what-are-emrs-and-ehrs-and-why-do-they-matter-to-therapists",
  "title": "What Are EMRs and EHRs, and Why Do They Matter to Therapists?",
  "text": "The transition to electronic medical records has introduced many therapists to a new and occasionally intimidating lexicon. In therapy, EMR and EHR both refer to a specific type of medical record, but many people use them interchangeably. An electronic medical record (EMR) is a digital chart from a single practice. An electronic health record (EHR), by contrast, is a patient chart designed to be shared across practices. It may contain information from many therapists, as well as the patient’s other health care providers. What Is an EMR, and How Is It Used in Therapy? An electronic medical record is the digital chart for a single practice. In the context of therapy, it might include clinical notes, diagnosis, a list of psychiatric medications the client takes, and any other details relevant to the client’s mental health treatment. EMRs are a more modernized version of the handwritten notes many therapists still keep. But unlike these notes, they contain much more data about a client. EMRs make it easier to track changes in a client’s health over time, to make treatment recommendations, and to share medical records with a client’s other health care providers. What Is an EHR, and How Is It Used in Therapy? An EHR is a more comprehensive medical record. It is designed to be shared with other providers, and as such, offers a more inclusive view of the client’s overall health. Therapy records may be included as part of an EHR, though most therapists leave out treatment notes and other highly confidential details. How EMRs and EHRs Improve Treatment Outcomes Electronic records make it easier to share important data across practices and between clinicians. Clients may not have to worry as much that their therapist does not know which medications they’re taking or that their psychiatrist will never talk to their primary care provider. EMRs and EHRs offer a more integrative approach that allows therapists to view relevant health information. For example, a therapist might notice a history of thyroid disease in a client’s chart. Because thyroid issues can affect mental health, this may affect treatment approach. Likewise, a primary care provider may note a client’s history of anxiety in their records. This can help the physician provide more responsive care and may even assist with ruling certain diagnoses out. When therapists work in large health care organizations, their EMRs may automatically be integrated into the system’s EHR system. This allows other clinicians within the system to see important information about the client’s overall health. However, clients still retain a right to control their records, including to control record disclosure. Some prefer not to share mental health treatment records with other providers. Others are willing to share their diagnosis or treatment history, but not detailed treatment notes. Therapists are obligated to disclose their privacy policies and to honor client requests regarding medical privacy. EHR for Therapists: Basic Requirements Most therapists use practice management software to manage EHRs and EMRs while ensuring both access and confidentiality for clients. The American Psychological Association (APA) does not endorse a specific system, and the law does not require therapists to even use practice management software to manage EMRs and EHRS. When choosing a strategy for managing medical records, it’s important to weigh the following: - HIPAA compliance: Patient medical records must be encrypted and stored in a secure fashion. - Segregation of data: Some therapists and clinicians prefer to keep mental health records separate from other medical records. While integrated records can improve client health, practice management software should give clients control over who can see their therapy records. - Storage: Most systems either store data in the cloud or on a clinician’s computer. There are benefits and risks to each approach, so carefully research your options. - Client access: Clinicians must ensure that clients can easily access their data without needlessly opening access to third parties. Choose programs that allow clients to download their information with minimal technical requirements and that will work on a wide range of computers. GoodTherapy supports therapists at every stage of their career with continuing education, practice management support, and more. Members enjoy access to our popular directory, helping them to find new clients in their area. Join GoodTherapy to enjoy these benefits today! References: - Difference between EHR and EMR. (n.d.). Retrieved from https://www.usfhealthonline.com/resources/key-concepts/ehr-vs-emr - EHR: Frequently asked questions. (n. d.). American Psychiatric Association. Retrieved from https://www.psychiatry.org/psychiatrists/practice/practice-management/health-information-technology/ehr-faq - Garrett, P., & Seidman, J. (2011, January 4). EMR vs. EHR—What is the difference? Retrieved from https://www.healthit.gov/buzz-blog/electronic-health-and-medical-records/emr-vs-ehr-difference"
}