{
  "url": "https://www.reddit.com/r/horror/comments/zl5zjz/smile_2022was/",
  "title": "Reddit - The heart of the internet",
  "text": "I've been ranting against this movie since I saw it. I was so close to liking it, but it made just a few major decisions that ruined it. Mainly, the character writing was lazy and convenient. This A simple fix would to be to have a few scenes up front where she's trying to be calm, but fails to convince anyone. You could even get a cool scare of her seeing someone smile at her in a crowd, and she closes her eyes knowing its all in her head, and then she opens them again with the smiling person right in her face. But we skipped any rational thought to her losing her shit immediately. Also, her husband is introduced as the most supportive guy in the world. Then he turns on a dime when she gets this curse. All of a sudden he just can't be bothered to even listen to her for a second. That's lazy ass writing. And don't get me started on the cheap jump scare where a scene changes to a car screeching to a stop. cars ain't scary, bitch! EDIT: I left this comment 2 years ago, I don't have anything to say to any of you. Yeah how she goes from professional to idiot that refuses to explain anything was frustrating. When her sister says “I think you’re having a mental breakdown” and Rose says “What? No, you’re not listening.” That was frustrating. You’re supposed to say “I know what it sounds like, let me try and explain everything clearer. I have evidence” etc. It’s that all too common trope in horror movies where the main character does something stupid. And don’t get me started on the cheap Know it is a bit of grave robbing given the age of this post, but you mostly hit the nail on the head for me. While it is entirely understandable that she starts acting more and more deranged over the course of the film, her absolutely refusal to act rationally even when presented with the opportunity was just infuriating. You're carrying around a file folder containing what is more or less certain proof of the supernatural (The string of 21 suicides) and you just don't tell anyone? You just let people go on thinking you are nuts rather than telling them \"I am the latest in a host of bizarre suicides going back the last six months, there is clearly something abnormal at work stemming from my patients, especially in light of my otherwise entirely stable history.\" I'm not sure it would have saved her, but for godsake she works in an emergency mental health ward. Have her restrained in a padded room with people only allowed to visit her in large groups and see what happens. That has got to have a better success rate than \"I'll go back to my childhood home and confront my demons.\" Lady, despite the blurry message of this movie, you are not suffering mental health issues. Gozer the Gozarian is psychically trying to murder you. Bahghull is trying to get you to perpetuate an endless cycle of suicides. The closest movie I can compare this to is Oculus, and while that film's protagonists still failed, at least her failure was in underestimating the abilities of her supernatural opponent, rather than suddenly believing that closure and the power of positive thinking will beat Pazuzu. Very late but she does try to show explain the evidence but the reports contained graphic images of death and her sister was already terrified about the dog scene. I think her decent into madness is completely believable when you include having witnessed someone die in the creepiest way possible right in front of you…to the paranoia creeping up and then the cat scene drives home that she’s clearly not lucid any longer and on top of it all she just gift wrapped a dead fucking cat that was opened at a kids birthday party in front of everyone she knows. She has no idea how this happened, the room stares at her as they rush to the corners in fear of what kind of psycho would do that… So now she’s full blown panic mode and further descending into madness and nobody believes her and after that cat thing of course nobody is going to listen and understand because she’s demonstrably crazy from their perspective. It is a very subjective type of horror. I was one of those scaredy cats, even though I'm not scared by much else in movies The type of horror that really scares me is when there's something watching me, stalking me, messing with me and I can't see it or I don't know where it is, but I know it's there. That really freaks me out, and I know it doesn't for a lot of people. it's actually where I got my arachnophobia, I lost a huge spider and lost it. I was paranoid for months. One movie example is Hopefully I explained it well lol. You must have loved It Follows lol I loved It Follows, they were some really freaky moments! Thank you! See that’s an amazing response. Now I get why it scares certain people. Thank you for the explanation and not attacking me like some others on the thread! Horror and any other genre will always be subjective. As a movie, I enjoyed it. It was uncomfortable and well-acted. But I question the message of the movie. So trauma is just inescapable? I would have liked to see her at least take a chunk out of the trauma demon in some way or disrupt it by finding a way around the chain. I'm cool with her dying, but I needed something more there. To rationalize it, I was thinking that the movie was saying that she waited far too long to face her trauma, and by the time she did it was too powerful to overcome. I also didn't appreciate the movie's portrayal of Other than that, I enjoyed it. 😆 I thought the depiction of therapy was weirdly competent. Rose's therapist remembers her name and trauma issues and does the intervention and the phone call. There's plenty of mental health services that can't even manage that first step It feels like there’s a really well done film inside this movie, there’s shots where it’s beautifully framed and slow and then it just jumps to shitty generic jump scares I truly think this started as a slower artier film and then a studio fucked it to death It was really fun in the theater. They used jump scares and loud noises/ music well. I can imagine some of that would be lost at home. (People on Reddit have informed me that this movie was made for streaming, which is even more surprising that it played so well in a theater) Haven’t seen it at home, but I’ve recommended people see it in theaters too. I saw it late at night, alone, in a semi-empty theater, and left very very scared Watched this at home when it came out on streaming and it didn’t hit nearly as well. Inconsequential, but I really noticed it during the title card. The theatre surround during that made it so much better and jarring. They used jump scares well. Can someone explain this to me. When I saw the jump scares in this movie, I thought they were the epitome of \"cheap jump scares\". But everyone has been raving about how great the jump scares are. What specific jump scares are good and why? I think people had very low expectations for this movie and it just outperformed them. The concept and trailer seemed goofy as fuck so people expected the movie to be a joke. Instead it was a very competent horror film. It maintained a consistent tone throughout the whole film and didn't get sidetracked by attempts humor or dumb sideplots/characters. The music and soundscape were excellent as many have said and really elevated the film to the next level. There were also some very effective jump scares and moments of building tension. Seeing it in a theater, many people were genuinely frightened. Finally the whole \"smile\" concept is just genuinely frightening to many people in an uncanny valley sort of way. I think the smiling actors did a very good job, even though some were better than others. In the end some people may not be affected by it at all and therefore be bored by the movie, It Follows was the same type of thing. That's all to say I think Smile is a solid horror movie that doesn't break any new ground but does what it needs to well. Many people were just impressed it wasn't dogshit. The first girl who died in front of Rose had one of the most unsettling smiles I have ever seen. Chilled me to the bone. At a certain point movies stop being scary and you just appreciate certain scenes as being engaging or creepy. I like cats so the party scene was unsettling for me. It’s like an ai write a horror movie. Just uses a bunch of stuff from other okayish movies. It needed more dread. It Follows is a great example of a film that played with dread much better Was saying this. There was too many gaps without the monster. I mean the best scenes all involved the monster and I felt like they only happened every like 20-30 minutes. I saw Dead Meat say that they liked it because it was a constant sense of dread, but I Massively disagreed. There's was so much bullshit in between the scary scenes. It Follows was real dread. You were searching the background the entire movie for the monster. Why does everyone use It Follows as an example when its so much more The Ring. It felt very much like that movie and I liked it for it I felt like I was watching a movie where every scene had been taken from somewhere else and it was so predictable I was never scared Props where they are due though, the teeth monster right at the end had a great design. Only part of the movie that is memorable for me I liked the first half but by the end I was getting antsy. We spend a majority of the time with the MC as she tries to figure out this curse…and we, the watchers, already know because we’ve seen this 80 other times so it felt bland and basic. Yeah this was the big problem for me. As the audience you know what's going on as soon an the inciting incident happens. But the back half of the movie is the character figuring out what's going on, researching it, trying to convince multiple other people to believe her, etc. Not only is the movie way behind the audience at that point but some characters, particularly the cop friend, seem not very bright to fail at putting 2 and 2 together. (Even though admittedly in real life it would take forever to reach some supernatural conclusion) To me the movie was mostly setup and then didn't know where to go. And the mental illness angle didn't do much for me either - the movie was alluding to genuine mental illness and the main character's personal trauma but ultimately they had nothing to do with anything. Very early on it stopped being ambiguous and was plainly supernatural, so I don't know what the point of the mental illness / trauma angle was. It reminded me somewhat of the HBO show \"The Outsider\" which also had a strong setup and something to say about trauma but fell down halfway through. The sound and the camera work did a lot of the heavy lifting. For me the film was mostly vibes, and started to lose me when it got more into the plot. I don't think you can make a 2-hours just-vibes movie so I'm not suggesting having plot was the problem - but the particular plot just wasn't that interesting. I loved it but your mileage may vary!"
}