{
  "url": "https://dictionary.cambridge.org/dictionary/english/repurpose",
  "title": "REPURPOSE | English meaning - Cambridge Dictionary",
  "text": "- adopt - adoption - avail - avail yourself of something phrasal verb - be/go heavy on something idiom - blow - exhaust - get through phrasal verb - give/allow something full play idiom - go into something phrasal verb - go through phrasal verb - gobble something up phrasal verb - recycle - spare - swallow - trade on something phrasal verb - turn over phrasal verb - turn to someone phrasal verb - turn/use something to good account idiom - unblock Meaning of repurpose in English repurpose | Business English Examples of repurpose repurpose Many of the changes to the building have been to subdivide former study halls and repurpose other rooms into usable classroom space. These conflicts have regarded issues such as construction of new toll roads and the repurposing of a decommissioned air base. Still, physical spaces can be flexibly repurposed and worked around if the inhabitants desire a social dynamic not instantly afforded by the space. Repurpose schools, which face staff changes or conversion to charters to give them a jolt. Of note in the camp is its repurposing of various areas of its two predecessor camps. Many organizations use thin clients for applications which require high security, involve unreliable users or repurpose older machines for continued use. So we plan to repurpose the episodes to broaden the market. Over the centuries, the two monuments endured numerous attempts of destruction in order to repurpose their materials. Since the transference of ownership, restoration has commenced on various elements of the sites, but no specific repurposing has been determined. They would repurpose the sanctuary itself, and build an economically feasible tower in the empty space where the educational wing once stood. Much remodeling was done throughout the site so as to repurpose buildings to suit their own needs. They repurpose the buildings and redevelop the land while working with and selling/leasing the land to private developers. Attempts by various organizations have begun to repurpose the high-rise. The objects stored in the centralized repository can be made available to course developers and content experts throughout an organization for potential reuse and repurpose. These systems allow for a much more efficient way to recapture and repurpose the heat created with combustion generators. These examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors."
}