{
  "url": "https://www.probabilidadyestadistica.net/tabla-de-la-distribucion-normal/",
  "title": "▷ Tabla de la Distribución Normal",
  "text": "En este post encontrarás la tabla de la distribución normal y, además, unas instrucciones de cómo usar la tabla de la distribución normal. Índice Valores de la tabla de la distribución normal En la siguiente tabla se muestran los valores de las probabilidades acumuladas de la distribución normal (cola izquierda). Ten en cuenta que los valores de esta tabla corresponden a la distribución normal estándar, por lo que para usar la tabla primero debes tipificar la variable. Cómo usar la tabla de la distribución normal Para usar la tabla de la distribución normal debes seguir los siguientes pasos: Estandarizar (o tipificar) el valor de la distribución normal. Para ello, tenemos que restar el valor menos la media de la distribución normal y luego dividir por la desviación típica de la distribución normal. Entrar en la tabla por la fila que corresponde a la parte entera y al primer decimal del valor obtenido en el paso anterior. Entrar en la tabla por la columna del segundo decimal del valor obtenido. El valor de la probabilidad acumulada es el valor que se encuentra donde se juntan la fila y la columna de los pasos anteriores. Para que puedas ver un ejemplo del uso de la tabla de la distribución normal, a continuación hallaremos la probabilidad acumulada de que un valor sea inferior a 33 en una distribución normal de media 28 y desviación típica 7. Para poder utilizar la tabla de la distribución normal, primero debemos llevar a cabo el proceso de tipificación para obtener la distribución normal estándar. Para ello, tenemos que restar la media al valor en cuestión y luego dividir por la desviación típica de la distribución: Así que restamos la media y dividimos entre la desviación estándar al valor de la probabilidad: Una vez hemos tipificado la variable, vamos a la tabla de probabilidades de la distribución normal estándar (vista más arriba) para ver a qué probabilidad corresponde el valor de 0,71: Por lo tanto, la probabilidad de obtener un valor igual o más pequeño que 0,71 es del 76,11%. Ten en cuenta que si el valor de Z obtenido en el proceso es negativo, para calcular su probabilidad se tiene que restar uno menos la probabilidad del valor de Z en positivo. Fíjate en el siguiente ejemplo: ¡Hola! Soy Marc Gisbert Juárez, ingeniero industrial con un doble máster en Ingeniería Industrial e Ingeniería de Organización por la UPC. Llevo más de 11 años dando clases de asignaturas relacionadas con la ingeniería, especialmente matemáticas, probabilidad y estadística. Me encanta enseñar y ver cómo los alumnos mejoran poco a poco. Poder ayudarles a entender algo que al principio parecía complicado es lo que más me motiva y me hace feliz. 5 comentarios en “Tabla de la distribución normal”"
}