{
  "url": "https://www.rd.com/list/foods-dogs-cant-eat/",
  "title": "18 Foods Dogs Can't Eat — Toxic Foods for Dogs to Avoid",
  "text": "What's good (or what tastes good) for us isn't necessarily great for our fur babies. Vets tell us about the foods dogs can't eat—and why they're off-limits. 18 Human Foods Dogs Can’t Eat, According to Vets Avocados Yes, they’re a fruit and no, your dog shouldn’t eat them. Avocados contain persin, a toxin that can cause vomiting and diarrhea. “It’s particularly concentrated in the skin of the avocado, although any part of the fruit is unsafe for dogs to eat,” says Shawna Garner, DVM, a veterinarian and the owner of Albright Veterinary Services. Avocados are also very high in fat, notes Gary Richter, DVM, a veterinarian with Rover. So in addition to their toxic nature, they can cause gastrointestinal upset if ingested in large amounts. Bacon We’re as surprised as you are to find bacon on our list of foods dogs can’t eat. The high fat and sodium content puts your dog at risk for illnesses like pancreatitis, high blood pressure, obesity and bowel cancer. But if your pet is begging for some of your breakfast, it’s safe to slip them small bits of low-fat, low-sodium bacon. This is the kind of dog food manufacturers use in their products. Candy Keep the candy bowl far away from your dog. Eating significant amounts of sugary, high-fat sweets can cause pancreatitis in dogs, even though symptoms may not show for two to four days. Look out for decreased appetite, diarrhea, lethargy and abdominal pain. Cherries The pit and skin of cherries contain small amounts of cyanide, says Dr. Garner. So if your dog gets hold of a whole bowl of cherries, they can be poisoned. “If a dog eats a whole cherry, this may cause an upset stomach,” she says. “However, several cherries could lead to breathing difficulties and an unwanted emergency visit to the vet.” Chocolate Chocolate is the worst kind of candy your dog can eat because it contains theobromine, a substance similar to caffeine. Baking and dark chocolates have the highest levels of theobromine, but milk and white chocolate are also harmful to dogs. Symptoms of chocolate poisoning include high blood pressure, tremors and seizures. Citrus A section of orange or tangerine may be safe to feed your dog, but watch out for the rest of the fruit. “Other parts of the plant, including the leaves, stem and skin, are toxic,” says Dr. Garner. “If consumed, they can cause an upset stomach and vomiting and diarrhea if consumed in large amounts.” Coffee and tea These drinks—and really any form of caffeine—can give animals hypertension, abnormal heart rhythms, hyperthermia (increased body temperature) and seizures. A few laps of spilled coffee won’t poison your dog, but ingesting moderate amounts of coffee grounds and tea bags can kill small dogs. Dried fruit With the exception of a couple of dried cranberries, dried fruit is generally a no-no for dogs. While none have the toxicity of raisins, dried fruit is high in sugar, which makes it an unhealthy snack. “You’re better off choosing fresh fruit alternatives,” Dr. Garner says, “as long as they are safe for dogs to eat.” Fat trimmings and cooked bones Don’t scrape leftovers from your steak dinner into the dog bowl. Not only can fat trimmings lead to obesity—it doesn’t take many extra calories for small dogs to become obese—but they also contribute to pancreatitis. Severe cases can result in a blood infection and internal bleeding. Small bones, like those found in some meat, are a choking hazard, and they can splinter and tear into a dog’s throat or intestines. Grapes and raisins Dog parents won’t be shocked to see these items on our list of foods dogs can’t eat. Dr. Richter says grapes and raisins can cause kidney toxicity in some dogs. “The effect is not dose-dependent,” he adds, “so even a single grape or raisin can potentially be fatal.” While fatalities are rare, if you know your dog has eaten grapes or raisins, take them to the vet ASAP. Macadamia nuts Nuts are generally not a good snack for dogs due to their high fat content; plus, packaged nuts are often loaded with salt. But macadamia nuts are particularly problematic because they can cause weakness, vomiting and diarrhea in dogs. While these symptoms will usually resolve on their own, Dr. Garner says it’s still a good idea to call your veterinarian if your dog gets hold of these nuts. Mushrooms If you and your dog take a walk through the woods or anywhere wild mushrooms might pop up (even your own backyard!), make sure he doesn’t chomp on one while he has his nose to the ground. “Store-bought shouldn’t be hazardous,” says Dr. Garner, “but it’s best to avoid mushrooms altogether when it comes to a dog’s diet.” Onions Avoid foods from the onion family—including garlic, leeks and chives—because they contain a toxin called N-propyl disulfide. “This can cause serious damage to canine red blood cells, meaning that the dog’s body will struggle to distribute oxygen properly,” says Dr. Garner. “It is never safe to give a dog onion or any other foods from the onion family.” Dr. Richter concurs. “Onion toxicity is rare because most dogs wouldn’t eat enough onions to be a problem,” he says. “But theoretically, if someone had a large plate of cooked onions that got eaten by the dog, it could be a problem.” You should be on particularly high alert during holidays. For example, think of all the Thanksgiving foods that incorporate cooked onions and could pose a danger to your pet. Veterinarian Lisa Weeth, DVM, head of the nutrition department at Metropolitan Animal Specialty Hospital, adds a special note of caution: “A 50-pound dog sneaking a few licks of a sauce that includes garlic and onion is unlikely to cause any issues, but adding garlic to their diet as an additive or in a supplement over days to weeks can cause nausea or vomiting and result in anemia. If the anemia becomes severe enough and chronic enough, it can cause lethargy, weakness, pale gums and collapse. There are many in the blogosphere who still tout unproven health ‘benefits’ for garlic while ignoring the very real negative health risks of this food. I would not recommend intentionally feeding anything in the garlic or onion family to dogs.” Peaches The flesh of a peach is a great source of fiber and vitamin A, but the pit contains cyanide. Cyanide interferes with cellular oxygen transport, preventing your dog’s blood cells from getting the right amount of oxygen. Signs of cyanide poisoning include dilated pupils, red gums and difficulty breathing. Other pitted fruits, including cherries and plums, pose the same risk. Be sure to cut the fruit into small pieces before feeding your dog, and keep the pit away from your pooch. Raw fish Eating raw fish regularly can cause a vitamin B deficiency, which could be accompanied by seizures. The most toxic fish for dogs are salmon and trout. Raw salmon can host parasites infected with the bacterium Neorickettsia helminthoeca, which can be fatal if not treated properly. Raw meat Raw meat is a controversial topic for pet owners. Meat is a great source of protein, but it carries the risk of microbes and parasites like E. coli or, in raw poultry, salmonella. If you do give raw meat to your dog, buy the highest quality possible and keep all ingredients fresh. Salt Salt poisoning is real—and it’s serious. After eating too much salt, your dog could experience vomiting, diarrhea, excessive thirst or urination, potential injury to the kidneys and even death. Be on the lookout for sources of salt in places other than your kitchen, like rock salt for deicing, table salt, paint balls and seawater. Tomatoes Like other fruits and vegetables in the nightshade family, tomatoes contain solanine, which, when ingested in large amounts, can cause GI distress and arrhythmia in dogs. The good news is that ripe tomatoes contain far less solanine than green ones, so a piece of ripe tomato is probably OK and not poisonous for your dog. But absolutely keep them away from green tomatoes, tomato leaves and tomato stems, where solanine is concentrated. Signs of food poisoning in dogs If your dog eats something toxic (or something contaminated by bacteria), they could get food poisoning. And while dangerous foods for dogs may not be on the menu at your house, your furry best friend may have other ideas. To ensure your pet’s safety, learn the signs of canine food poisoning: - Vomiting - Diarrhea - Gas - Pale gums - Jaundice - Lethargy - Weakness - Poor coordination - Seizures If you suspect your dog has food poisoning, call your vet ASAP. Or phone the American Society for the Prevention of Cruelty to Animals’ poison control hotline (888-426-4435) or the Pet Poison Helpline (855-764-7661). They’ll give you instructions on what to do, which may include taking your dog to the emergency vet. Keep other animals away from the problematic food so as not to get them sick too. Additional reporting by Claire Nowak. Why trust us At Reader’s Digest, we’re committed to producing high-quality content by writers with expertise and experience in their field in consultation with relevant, qualified experts. We rely on reputable primary sources, including government and professional organizations and academic institutions as well as our writers’ personal experiences where appropriate. We verify all facts and data, back them with credible sourcing and revisit them over time to ensure they remain accurate and up to date. Read more about our team, our contributors and our editorial policies. Sources: - Shawna Garner, DVM, veterinarian and owner of Albright Veterinary Services - Lisa Weeth, DVM, board-certified veterinary nutritionist and the founder of Weeth Nutrition Services - Gary Richter, DVM, veterinary health expert with Rover, medical director of Montclair Veterinary Hospital and founder of Holistic Veterinary Care - Interdisciplinary Toxicology: “Some food toxic for pets” - U.S. Food and Drug Administration: “Good Dog, Bad Food: Foods for People That Are Bad for Your Dog” - ASPCA: “ASPCA Poison Control” - Pet Poison Helpline: “We Want to Help”"
}