{
  "url": "https://tastehungary.com/journal/tokaji-aszu-the-story-of-the-worlds-oldest-sweet-wine/",
  "title": "Tokaji Aszú: The Story of The World’s Oldest Sweet Wine - Taste Hungary",
  "text": "Home / Blog / Wine / Tokaji Aszú: The Story of The World’s Oldest Sweet Wine Tokaji Aszú: The Story of The World’s Oldest Sweet Wine THE TERROIR Everything about Tokaj—from its rich volcanic clay soil and its microclimate (ideal for bringing on the fabled noble rot) to its indigenous grape varieties and its subterranean labyrinth of mould-covered cellars—contributes to the distinctive personality of its wines. Tokaj is Hungary’s most famous wine region and a beautiful part of the country to explore. The area retained more independence way back during the Ottoman occupation, and traditions here are strong and deep. The region is framed by natural borders: the town of Tokaj in the southwest corner where the Bodrog and the Tisza rivers meet, the Bodrog river to the southeast, and the Zemplén hills to the northwest. Ten million years ago the area was full of volcanoes, resulting in a wide variety of rhyolite, tuffa, and zeolite vineyards. Wines from these different vineyards can all be quite different, and winemakers here love to experiment with single vineyard wines. TABLE OF CONTENTS The Tokaj region has 5,500 hectares of vineyards and 27 towns and villages. It’s a white wine region best known for its sweet aszú wines, which are made from botrytized grapes, but more than half of the wine it produces is dry. Six grape varieties are permitted to grow in Tokaj. The superstars are the indigenous varieties Furmint and Hárslevelű, with Furmint being the high profile grape that tends to steal the show. Other varieties grown in smaller quantities are Sárga Muskotály, Kövérszölö, Zéta (a crossing of Furmint and Bouvier), and Kabar (a crossing of Hárslevelű and Bouvier). All of these varieties can be used in aszú. A few other grapes are grown in very small quantities (though they aren’t allowed to carry the name Tokaj on their label), such as Pinot Noir. CENTURIES OF HISTORY, AND THE DOM PERIGNON OF TOKAJI ASZÚ Long before the Tokaj-Hegyalja region was declared a protected UNESCO World Heritage Site in 2002, it was recognized as a first-class wine region. It’s also perhaps the first region to produce wine from botrytized grapes at such a scale. If we believe the legend, then we have the invading 16th-17th-century Ottomans to partially thank for the discovery of the noble rot in Tokaj, which led to the creation of Tokaj aszú. The story goes that Zsuzsanna Lórántffy (who was the wife of Prince György Rákóczi I and a major landowner in the region) and her vineyard manager, László Máté Szepsi, decided to postpone the harvest on the family’s extensive vineyards when the Turkish invasion was imminent. By the time they got around to the harvest, the grapes had turned into shriveled botrytized raisins. The winemakers decided to use them anyway, and Tokaj aszú was born. “The ‘invention’ of aszú wine as it is known today is attributed to Szepsi,” writes Miles Lambert-Gócs in Tokaj Wine: Fame, Fate, Tradition. “By most accounts, this happened around 1620, although others have thought it might have been earlier … However, oral tradition may be wrong as to Szepsi’s actual contribution. The fact that a 4-puttonyos wine of 1646 was exported to Poland and a law of 1655 required separate harvesting of botrytized fruit strongly suggests that aszú wine production was taking place since at least 1600, and that any innovation by Szepsi had to do with some particular detail.” “Undeniably, there is an aura about Szepsi: he ranks among the very few persons to whom a kind of wine is attributed. He could be called the Dom Perignon of Hungary,” continues Lambert-Gócs. “From all the fanfare about him in Hungarian wine history, it can hardly be doubted that he made a major contribution of some sort, a contribution that profoundly affected the fabrication of botrytis wines in Hegyalja. But just what was his contribution? Did he actually ‘discover’ botrytis or ‘invent’ botrytis aszú wine? Not likely, since over one-hundred years had passed since the very overripe grapes were being used in Hegyalja. Was he the first person to ‘soak’ the mass of aszú-grape material before fermentation? Again, not likely, since this was a Balkan method known in Hegyalja long before his time … But, in the end, without any documentation, it seems destined always to remain guesswork.” Sometimes legends are just legends after all … We can go back even further to see that “the first mention of Aszú grape wine is in 1571, in a property deal clearly demonstrating that the aszú grapes had been kept separate from the normal grapes in the vineyard of Mézes Mály,” writes Oz Clarke in The History of Wine in 100 Bottles. “And this would at the very least imply that the producers of Tokaji were the first in the world to harvest shrivelled and nobly rotten grapes on purpose – the Germans on the Rhine didn’t get the hang of purposefully nobly rotting their grapes until 1775.” THE WORLD’S FIRST CLASSIFIED VINEYARDS The Tokaj region had one of the world’s earliest vineyard classification systems. “Tokaj’s vineyards have been classified at various points in their history: 1641, 1700, 1770 and 1995,” writes Tim Atkin in Tradition and Innovation in The Tokaj Region. “None of these classifications enjoys official status, but they do demonstrate that the region has always set great store by the differences between individual sites. The 1700 classification … divided the vineyards into First, Second and Third Growths … Many of these vineyards remain highly prized to this day.” The 1700 Classification was 56 years before the demarcation of the Douro Valley and 155 years before the 1855 Médoc Classification in Bordeaux. NEW TECHNOLOGY AND THE BEGINNING MODERN TOKAJ Many of the winemakers who helped bring modern Tokaj back to life got their training by working for the state-owned wine factories. Now, the next generation of winemakers in Tokaj is pushing forward. They are succeeding with once again spreading the region’s name around the wine world, making top-notch modern aszú, and also creating a demand for the lovely dry Furmints which are now important to all Tokaji producers. When the Iron Curtain fell and the market opened, foreign investors began pouring money into the region and partnering with Hungarians to establish wineries or opening state-of-the-art wineries themselves. Starting with the wave of French investors, winemaking became modernized in Tokaj during the late 1980s/early 1990s. Disznókő, Oremus, Királyudvar, the Royal Tokaji Wine Company, Chateau Megyer, and Chateau Pajzos are some of the most prominent foreign-backed companies. Aszú wines have been made essentially the same way for hundreds of years, although now they are made with modern technology, state-of-the-art equipment, and new innovations. Fine Hungarian Wine, Shipped to Your Home Hundreds of unique Hungarian wine and spirits, shipped directly from our Budapest shop to most European countries! Fine Hungarian Wine, Shipped to Your Home Hundreds of unique Hungarian wine and spirits, shipped directly from our Budapest shop to most European countries! THE “KING OF WINE” Tokaj aszú has always had a fan club that has included royalty, artists, and popes. The wine made its way to the capitals and palaces of Europe long before there were advertising campaigns and marketing slogans to spread the word. Tokaj’s most glorious period was between the 17th and 19th centuries, when the region’s wines were drunk by royalty and celebrities around the world. The wine was treated as a symbol of Hungary and was often used as a diplomatic tool. After receiving a shipment of Tokaj wine as a gift from Prince Rákóczi II, Louis XIV famously called it the “wine of kings, the king of wine.” Peter the Great is said to have ordered 600 barrels of it every year and subsequent czars spent significant proportions of their court budgets on keeping their supply of Tokaj wine stocked. Pope Pius X was a great fan and gushed: “such wine is what is worthy of the Holy Father.” When Empress Maria Theresa sent Pope Benedict XIV a gift of Tokaj wine, he exclaimed: “Blessed be the soil that hath grown thee, blessed be the woman who sent thee, and blessed am I who drink thee.” Catherine the Great, Frederick II of Prussia, Napoleon III, Goethe, Schubert, Beethoven, and Liszt all loved Tokaj wine. Emperor Franz Joseph sent Queen Victoria Tokaj aszú as a birthday gift every year. Voltaire praised his favorite wine by saying: “Tokaj brings vigor to the smallest fiber of my brain and revives the enchanting sparkle of wit and good humor.” And in a more modern example, Philip Pullman’s novel, The Golden Compass (part of his Dark Materials trilogy), opens with a character being served a glass of ‘Tokay’ Hungarian wine. Luckily, us ordinary people can also enjoy the golden sweet perfection that is Tokaj aszú. THE MANY HARVESTS OF TOKAJ In Tokaj the harvest is a long, labor-intensive process that begins at the end of August and usually ends in November (though harvesting aszú berries into January isn’t unheard of). There are essentially three types of harvests in Tokaj: the dry wine harvests, the aszú harvest, and the szamorodni harvest. First comes the standard dry wine harvest, in which grapes are picked when they are in the ideal condition to make crisp dry wine. Tokaj dry wine production is straightforward: after the harvest the grapes are pressed and fermented. Dry Furmint, Hárslevelű, and Sárga Muskotály are made from this first harvest, as well as the base wine for Tokaj aszú. Even though Tokaj is best known for its sweet wines, between 40 and 60 percent of the wines produced here annually are dry, depending on the weather. More dry wines will be produced in years when the weather conditions aren’t good for producing the “noble rot” that turns grapes into what are called “aszú berries”. The most important harvest in Tokaj is the aszú harvest, which typically begins at the end of October, when the grapes—which have now hopefully acquired the noble rot (or Botrytis cinerea) that is essential for making Tokaj aszú—start to look like raisins. Winemakers in Tokaj eagerly await the arrival of botrytis, anxiously checking weather conditions and vineyards, so they can start harvesting at just the right time. In good years—when humidity comes from the meeting of the rivers Bodrog and Tisza with the plain and there’s lots of autumn morning dew mixed with drying breezes—more aszú wine will be produced and it will be richer and more concentrated. In a bad year, especially when there’s a wet fall, there will be a short aszú harvest due to little or no noble rot. The aszú berries are selected by hand, one by one, by experienced pickers in a process that’s repeated several more times. An average picker can pick only six to eight kilograms of aszú berries per day. BOTRYTIS CINEREA “Also known as “noble rot,” it is a beneficial mold that grows on ripe wine grapes in the vineyard under specific climatic conditions. The mold dehydrates the grapes, leaving them shriveled and raisinlike and concentrates the sugars and flavors. Wines made from these berries have a rich, complex, honeyed character and are often high in residual sugar. Botrytis contributes the unique, concentrated flavors in such wines as BA and TBA Rieslings from Germany, Sauternes from Bordeaux, Aszú from Hungary’s Tokay district and an assortment of late-harvest wines from other regions.” —Definition from Wine Spectator MAKING TOKAJI ASZÚ After the harvest, the aszú grapes are macerated in base wine or fermenting must (which was made from the first harvest) for between 12 and 60 hours. Next, the aszú grape mixture that was macerated in the base wine (sometimes called the aszú dough) is pressed and the resulting juice is fermented. The wine is then stored in oak barrels, which are typically made from oak from the nearby Zemplén forest, and aged for several years in the underground stone cellar systems that’s unique to the Tokaj region. MEASURING SWEETNESS The sweetness of Tokaj aszú has traditionally been measured in puttonys. A puttony is a 25-liter wooden tub, which was used for harvesting the aszú grapes. The most prized types of Tokaji aszú were made as either a five puttonyos version or a six puttonyos version, which means that the equivalent of five or six tubs of botrytized grapes had been added to each cask of must or base wine. (In Tokaj, aszú is made in 136-liter Gönc casks). So the higher the puttony number, the sweeter, more golden colored, and more expensive the wine will be. (For a more concrete idea of the sweetness level, a three puttonyos aszú had from 60 to 90 grams of residual sugar per liter, a four puttonyos had from 90 to 120, a five puttonyos from 120 to 150, and a six puttonyos from 150 to 180.) However new wine laws enacted over the past few years have aimed to increase the quality of Tokaj wines, and to decrease the confusion on the market due to the the numerous types of Tokaj wines that were available. First the production of three and four puttonyos aszú was phased out, and now the numbers 5 and 6 will also be disappearing from bottles of aszú. The minimum residual sugar has been set at 120 grams per liter for any wine to be called an aszú, and they must be aged for a minimum of 18 months in oak. PRECIOUS ESZENCIA Eszencia—the rarest form of Tokaji wine—is also made from the hand-picked aszú berries. To make eszencia, a vat is filled with aszú berries and the pressure of the grapes pushes out the free-run eszencia, which is like a thick syrup. The sugar content of eszencia is so high (between 500 and 700 grams per liter) that it ferments very slowly and more resembles a thin honey rather than a wine. Even after a long fermentation the alcohol content rarely exceeds five percent. András Bacsó from Oremus Winery explained that from one hectare of vineyards they can make two bottles of eszencia. From about 150 kilograms of grapes, they yield about one percent of that as eszencia. Not much eszencia is bottled (and in bad years none is produced). But when it is bottled, 375ml bottles sell for hundreds of dollars, mostly as novelties for collectors. Despite its price, winemakers don’t make eszencia for the money. “At least one hundred times more grapes are needed for eszencia than for a bottle of table wine,” wrote British wine writer Hugh Johnson of a bottle of his own Royal Tokaji Wine Company’s eszencia. “Eszencia is the purest expression of a terroir and its vintage known to man. Kings, Queens, Emperors, Czars and Popes have recognized eszencia as the purest health restorative wine, and occasional aphrodisiac, for centuries.” THE AGEING CELLARS Labyrinths of barrel-lined cellars, some of which are several kilometers long, have been dug in the volcanic rock below the ground throughout the entire Tokaj region. Like the soil and the climate, the special character of these dark, narrow passages plays an important role in the winemaking process, according to many Tokaj winemakers. Below each village in the region are kilometers and kilometers of cellars. In Tolcsva alone there are 50 kilometers of cellars, built between the 14th and 17th century. It’s also likely that many of the cave-like cellars in the region, which have entrances which could be hidden, were built to hide the wine from invaders. Oremus, one of the region’s largest wineries, has a four-kilometer-long cellar system. These subterranean cellars (and nearly everything inside of them) are covered in a fuzzy black “noble mould”. The mould forms from the combination of the high humidity and the alcohol. In addition to looking picturesque, it has the important function of purifying the air, making the conditions ideal for storing and aging aszú. Cellar temperatures remains at a constant 10 or 11 degrees Celsius throughout the year. During the summer cellar doors are often kept closed to keep the temperature cool, while in the winter the doors are kept open to collect the cold air that will keep the cellar cool during the summer months. The mould keeps the humidity inside the cellars constant, absorbing it in the wet months and releasing it in the dry months. Despite the abundance of mould, the cellars smell fresh and pure. TASTING NOTES Tokaji aszú is a golden colored wine—which comes in endless shades of gold—with the older vintages turning darker shades of amber as they age. It’s a rich wine, with a thick and creamy texture (from the high sugar content), concentrated flavors, and a huge diversity of flavors and styles. Of course it’s very sweet, but the sweetness is almost not even the point. Tokaji aszú is famous for its perfect harmony between its high sugar content and its high (and very refined) acidity. Aszú is more about this perfect balance than about its sweetness. When it comes to flavors and aromas, the list of tastes found in aszú is extensive, and they come in so many layers. Depending on the bottle —whether it has been made in the more traditional oxidative style or the more modern reductive style, and also how old the wine is—there are so many characteristics that can be found. You’ll taste sweetness in flavors like brown sugar and honey. But aszú is always super fresh tasting, with many fruit flavors, such as apricot, peach, pear, lime, fig, pineapple, orange zest, grapefruit, and sometimes black currant or plum. There are fresh flowers in there, like chamomile and acacia. There can be cooked fruit flavors such as apricot and plum jam, and herbal characteristics like dill and mint are common. There’s also often a stony taste. From the oak aging there can be some spices (like ginger and cloves), vanilla, birch, toffee, and coffee. And with aging, the fruit flavors turn to dried fruit flavors such as dried apricots, figs, prunes, and citrus peel. Almonds, hazelnuts, walnuts, walnut brittle, coffee, white chocolate, tea, and caramel start showing up. There can even be some truffles, smoked meat, smoke, musk, and smoked salt hanging around in a glass of aszú. Though Tokaji aszú is known for its perfect balance between its sweetness and acidity and its layers of abundance of flavors, one of its finest attributes is also its seemingly endless finish. You’ll still be tasting the flavors from a good glass of aszú for minutes afterwards. PAIRING ASZÚ WITH FOOD While Tokaji aszú absolutely does make for a perfect dessert in itself, sweet Tokaj wines are not just for dessert. The classic food pairings to match with Tokaj aszú are foie gras and blue cheese—tried-and-true combinations which are always delicious. But get creative with aszú! The thing that makes it such a stunning wine is its high acidity that checks its high level of sweetness. This is also what makes it a good wine to drink with food that is on the spicy side (Indian cuisine is a wonderful match for both dry and sweet wines from Tokaj). And if you are drinking your aszú with dessert, try it with a dessert that does not have too much sweetness in it—like a classic Hungarian cheese or poppyseed strudel—or something with hazelnuts, walnuts, or citrus. Or, simply enjoy a glass of aszú on its own, and contemplate all that went into making that glass of amazingly complex wine. There were centuries of history, accidental discoveries, smart innovations, passionate people, celebrity fans, family investments, state-of-the-art technology, and just plain sheer luck that went into making that glass of Tokaji aszú. Want to taste Tokaji aszú? Visit The Tasting Table Budapest. Order from our menu, or book one of our daily tastings: Wine, Cheese, & Charcuterie Tasting and Essentials of Hungarian Wine Tasting). We also have a collection of old and rare aszú served by Coravin. Want to experience Tokaj for yourself? Taste Hungary has small-group wine tours to Tokaj several times a week and daily private tours."
}