{
  "url": "https://www.cvs.com/",
  "title": "CVS - Online Drugstore, Pharmacy, Prescriptions & Health Information",
  "text": "Let’s make healthier happen together™ Prescription peace of mind. CVS® makes managing your Rx easier. Manage prescriptionsGear up for game day with Extra Big Deals. Shop Extra Big DealsProtect against the flu and get $5 off $20 after vaccination.* Schedule your vaccinationsYour neighborhood pharmacy Where you get your medicine matters® Your local CVS Pharmacy® has a team dedicated to supporting you. Plus, we accept most insurance plans,* making it easier for you to get the care you need. Explore pharmacy servicesAll the techs and pharmacists are thoroughly knowledgeable and very professional. I trust them completely with all my prescriptions.” [Text: On The Beat by CVS®. What makes a \"community pharmacy\"?] [A man in a pharmacy coat, Justin, a CVS Pharmacist of 12 years, stands inside of a CVS.] Justin, speaking: When I think about community pharmacy, I think about establishing trust and care from a health care provider to a patient who may not have access to health care otherwise. [Logo: CVS Pharmacy] CVS pharmacist Justin shares what he thinks makes a pharmacy part of the community. Play Justin’s videoAll the techs and pharmacists are thoroughly knowledgeable and very professional. I trust them completely with all my prescriptions.” From the moment I walk through the door, I’m always greeted with a warm smile and genuine kindness.” Everyone at this pharmacy works so hard and yet are so helpful and personable.” Wellness Zone This week’s deals & offers Feel-good finds for everyone Show some love this Valentine’s Day. Visit the Valentine's Day ShopShare a memory with 50% off sitewide for Photo.* Shop Photo dealsExtra big savings on what you need most. Shop Extra Big DealsShow some love this Valentine’s Day. Visit the Valentine's Day ShopBuy 1, get 1 for $1 on Valentine’s kisses and minis.* Shop kisses and minisBuy 1, get 1 50% off Valentine’s exchange kits.* Shop kid's exchange kitsRefresh your morning routine. Play 3-by-3 routine video[Text overlay: 3-by-3 by 12 PM morning routine with CVS.] [A person turns off their alarm at 6 AM.] [Text overlay: The goal: 3 cups of water. 3,000 steps. 30 grams of protein. By 12 PM.] [They put a water tumbler, Smart Water and Well Market Hydrate and Glow drink mix on a countertop.] [Text overlay: 6:30 AM: Hydrate.] [They put the water and powder into the tumbler.] [Text overlay: 7 AM: Move your body.] [They put on running shoes.] [Text overlay: 8 AM: Hydrate.] [They drink from the tumbler.] [Text overlay: 9 AM: CVS run.] [They grab their order from CVS.] [Text overlay: 11 AM: Pack in your protein.] [They put banana slices, protein powder, spinach leaves and strawberry slices into a blender and press a button.] [Text overlay: You did it! 12 PM. 3 cups water. 3,000 steps. 30 grams protein.] [They drink their smoothie.] [Text overlay: Here for all your mindful morning trend-trying.] [A CVS bag on a countertop with items displayed in front: a water tumbler, Smart Water, Body Fortress whey protein, a Think bar and Well Market Hydrate and Glow drink mix.] Health services Schedule a flu shot. Grab some extra savings. Flu shots are free with most insurance,* and appointments can often be made on the same day. Plus, get a $5 off $20 coupon* for the next time you shop at CVS. Schedule your vaccinationsNo cost with most insurance. Eligibility varies by patient and insurance plan. Restrictions apply. Get details here. No cost with most insurance. Eligibility varies by patient and insurance plan. Restrictions apply. Get details here. Same-day care is just around the corner MinuteClinic® is open for you nights and weekends, with appointments available in person and virtually.* Schedule a MinuteClinic appointmentChoose from more than 195 MinuteClinic services Explore MinuteClinicOak Street Health specializes in primary care for older adults Our dedicated care team understands the unique needs of adults on Medicare. Same-day or next-day appointments where available. Learn more about Oak Street HealthExtraCare Earn up to $50 in ExtraBucks Rewards®* for filling scripts With ExtraCare® rewards at the pharmacy, you’ll earn credits for filling scripts, getting vaccinations and more. Join ExtraCare & opt inOur commitments to you *for $5 off $20 offer: Offer available January 10, 2026, through August 9, 2026, while supplies last. Customers who schedule their appointment online will receive the coupon after vaccination. Limit one per customer per vaccine visit. For vaccines that require multiple doses, the coupon will be given with vaccine series completion. Merchandise coupon redeemable at CVS Pharmacy® and Longs Drugs® for one-time use. ExtraCare® card required to receive savings. Terms and conditions apply. Details on coupon. Coupon barcode number must be provided to redeem online. $5 savings applied to total qualifying minimum purchase of $20 (after other coupons and discounts are applied). Coupon shall not be issued in Arkansas, New Jersey or New York, or at MinuteClinic® locations in Arkansas, Massachusetts, New Jersey or New York. Coupon cannot be redeemed at CVS Pharmacy® at Target, CVS Pharmacy® at Schnucks® or at MinuteClinic® locations. This offer is solely made by CVS® and is not connected with any vaccine manufacturer. *for 14 no-cost vaccines: Select vaccines are no cost with most insurance. Eligibility varies by patient and insurance plan. Eligible patients will not pay any copayments unless otherwise required by their plan, including Medicare Part B. Availability varies by state based on regulations. This is not an all-inclusive list of who should be vaccinated. Age restrictions apply. Available when a certified immunizer is on duty. Vaccines are available at most CVS Pharmacy® locations. Get vaccine details. *for save more claim: Based on average 12-month savings taken just after customers both sign in to the CVS Health® app and link their ExtraCare® card to the app for the first time versus customers who did not use any digital products but still had at least a single purchase tied to an ExtraCare card within three months of when the study began. Savings vary by member engagement. *for most insurance plans accepted: Insurance participation may vary by region. Check with your insurance plan to confirm whether your insurance is accepted. *for 50% off sitewide for photo: Add $25 or more of any photo product(s) to your cart and enter promo code SITEWIDE2026 to receive 50% off your photo order or get 40% off your photo order with no minimum purchase. Offer valid online and in the CVS Health® app. Offer starts on January 25, 2026, at 12:01 AM ET and ends February 7, 2026, at 11:59 PM ET. Only one discount may be applied to each item. Discount valid on photo products only and excludes additional photo book pages, eight-gigabyte (GB) photo USB drives, Erin Condren licensed planners and NFL licensed products. Promo code must be entered at time of checkout to apply discount. Savings are not transferable. Offers do not apply to tax and shipping charges. CVS Pharmacy® reserves the right to make changes to or terminate this offer at any time. Same-day pickup applies to select photo products and orders received by 7 PM local time. *for buy 1, get 1 for $1: Buy 1, get 1 for $1 promotions expire February 7, 2026, at 11:59 PM ET. Buy 1, get 1 for $1 offers valid within each brand only. You must put both items in your basket; savings will be applied at checkout. ExtraBucks Rewards® offer limit of one per household with card. *for buy 1, get 1 50% off: Buy 1, get 1 50% off; spend $30, get $10 ExtraBucks Rewards®; instant savings; buy more, save more; and ExtraBucks Rewards promotions expire February 7, 2026, at 11:59 PM ET. Buy 1, get 1 50% off; spend $30, get $10 ExtraBucks Rewards; instant savings; and buy more, save more offers valid within each brand only. You must put both items in your basket; savings will be applied at checkout. ExtraBucks Rewards offer limit of one per household with card. *for free flu shot: Select vaccines are no cost with most insurance. Eligibility varies by patient and insurance plan. Eligible patients will not pay any copayments unless otherwise required by their plan, including Medicare Part B. Availability varies by state based on regulations. This is not an all-inclusive list of who should be vaccinated. Age restrictions apply. Available when a certified immunizer is on duty. Vaccines are available at most CVS Pharmacy® locations. Get details. *for available in person and virtually claim: MinuteClinic Virtual Care® services and appointment availability may vary. Credit, debit, health savings account (HSA) and flexible spending account (FSA) cards and some insurance accepted. Services not yet available in Alabama and Mississippi. *for earn up to $50 in extrabucks rewards: You must enroll in the ExtraCare® program and opt in to earn ExtraBucks Rewards® for pharmacy activities. You will receive $2 ExtraBucks Rewards when you accumulate 4 credits, up to $50 ExtraBucks Rewards in a calendar year. Rewards at the pharmacy are valid only in the United States and are not available in Arkansas, New Jersey or New York; for any prescriptions transferred to a CVS Pharmacy® location in Alabama, Illinois, Mississippi, Oregon or Tennessee; for any controlled substance prescriptions; or where otherwise prohibited by law. Check ExtraCare terms and conditions for details or ask a CVS® pharmacy team member for a copy."
}