{
  "url": "https://www.silverbay.com/?page_id=7934",
  "title": "Explore the North Shore | City of Silver Bay, Minnesota",
  "text": "Explore the North Shore There is a lot to do in Silver Bay and on the North Shore. Check out the resources below for area businesses and attractions. https://cgee-hamline.org/PocketGallery/ Click on the below images for information about the North Shore Nearby Attractions State Parks Visit the mouth of the beautiful Baptism River at the gorgeous Tettegouche State Park. Located just four miles north of Silver Bay on highway 61, Tettegouche offers access to breathtaking views, such as Shovel Point and fabulous amenities at the newly reconstructed visitor center. Just 15 miles south of Silver Bay, explore the waterfalls of Gooseberry Falls State Park. Stop at Split Rock Lighthouse and take a tour of the historic grounds or bring a tent and camp near the pristine Lake Superior. Travel up the shore about 30 miles to Temperance State Park for a chance to see local wildlife or venture a little farther and spend a day in Canada. The Canadian Border is about 100 miles from Silver Bay. Trail Systems With the array of State Parks nearby, there are plenty of hiking, biking, skiing, snowmobiling and sight-seeing trails to venture out on. No matter the season, there’s something for everyone. View the walking, hiking and biking trail map for the Silver Bay area here. Gitchi-Gami State Trail (biking, roller-blade, walking trail) If you are a mountain bike enthusiast, you will find some top-quality trails in our area. Some bases to start exploring include the McDougal Lake Tour and the Nickel Lake Area. Lake Superior Water Trail (kayaking), Two Harbors to Caribou River Map The State of Minnesota has set up a water trail for sea kayakers along the shores of Lake Superior. It will eventually extend the entire way around Lake Superior. Click on the map links above for the water trail sections near Silver Bay. Silver Bay offers access to numerous hiking trails including the Superior Hiking Trail, which weaves through area forests and hills, revealing breathtaking views between Duluth and Grand Marais. The newly added Superior Advantage overlook provides excellent views of the city and Lake Superior. The snowmobile trails in the Silver Bay area are maintained by the Silver Trail Riders club. Donations for trail maintenance are appreciated and may be sent to PO Box 55, Silver Bay, MN 55614. For more information about the Silver Trail Riders club, contact Bill at 218.220.8189 or email. The ski trails in and around Silver Bay are one of the area’s best kept secrets. There are miles of well-groomed cross-country ski trails that pass through Tettegouche State Park, Bean and Bear Lakes and views of the Sawtooth Mountains. Sporting Facilities For a listing of sporting facilities available within Silver Bay, visit our Parks and Recreation web page."
}