{
  "url": "https://thejapanesebar.com/cuisine-washoku/ikura/",
  "title": "All About Ikura: Salmon Egg Sushi, Ikura Don, and More (2023)",
  "text": "If you or someone you know is ikura-curious, you’re in the right place. This page breaks down the most important topics regarding salmon roe, popular dishes, dietary info, and more. I include a number of affiliate links that support this blog and I may earn commissions on qualifying purchases. What is Ikura? Ikura is the Japanese term for salmon roe. It’s sometimes called red caviar, as well. These large eggs have a soft texture, a briny flavor, and a mild fishiness. Ikura is also one of the healthier ingredients you can enjoy. Salmon roe is sourced in the late summer and fall from fish that are still in the ocean. The roe is typically brined in salt before being frozen at very cold temperatures. Soy sauce is sometimes substituted. Either way, the salt and sub-zero freezing allow ikura to be available year-round. What Does Ikura Taste Like? Ikura is soft-textured. It has a satisfying and audible pop when you bite into it. Inside it’s a bit oily. The flavor is briny, slightly fishy, and subtly sweet. It tastes kind of like the ocean, and ikura has a lot of umami. Am I selling it well?! I’ve sold a lot of ikura over the years, and I’ve found it’s an acquired taste. If you’re new to sushi, there are better options. I didn’t love it either at first. But over time, it’s become one of my favorite things to eat. And it’s especially delicious when you wash it down with some chilled sake. advertisement Types of Salmon Roe Ikura sushi is widely available, but the type of salmon it comes from is rarely listed. In general, the two most popular types come from chum salmon and pink salmon. Chum Salmon Roe Chum salmon are a prolific species. They’re also called keta salmon and dog salmon. The flesh of the chum is soft and deteriorates rapidly, so if you find it, it’s usually smoked. But the eggs of the chum salmon are highly prized. Their range includes Hokkaido, Alaska, British Columbia, and Russia. The roe of chum is the largest of the salmon and has the richest flavor. The eggs are light orange in color. Pink Salmon Roe Pink salmon is another abundant species. They’re a smaller Pacific salmon that spawns every two years. They’re sometimes called humpback salmon. Pinks They have small to medium-sized eggs that are golden in color. The flavor of their ikura is quite sweet. Coho Salmon Ikura Coho, or silver salmon, is a species of Pacific salmon that are harder to find. They don’t reproduce in the same volumes as chums, pinks, or sockeye. The roe of coho is orangish to dark red and is small to medium in size. Coho ikura has a mild, bitter-sweet flavor when compared to other roe. Coho salmon are struggling across some of their range. So they’re not always a sustainable option. King Salmon Ikura King salmon, or chinook, are the largest and rarest species of Pacific salmon. Their eggs are usually slightly smaller than chums, however. The ikura of chinook salmon is orange and has a rich flavor. It’s very tasty but hard to find. Chinook salmon are struggling as a species, so they’re not a sustainable option. Sockeye Salmon Roe Sockeye salmon are an abundant species of Pacific salmon. They’re prized for their lean meat, and their ikura is delicious too. Sockeye salmon roe is small and deep red in color. They have a mild, slightly sweet flavor. Serving Ikura: Salmon Roe Dishes For a long time, ikura don was the defacto way of serving salmon roe. As a side note, ikura don doesn’t traditionally use sushi rice, so it’s not sushi. It’s a much more recent idea to use salmon roe in sushi preparations. Below I’ll discuss the most popular ways of serving ikura. Ikura Gunkan / Nigiri Ikura in sushi likely started with the gunkan-style. This variation of nigiri looks like a warship, with nori wrapped around the rice and roe to hold it together. The Original Gunkan-Style Sushi A famous restaurant called Kyubey may have been where ikura sushi originated. Chef Hisaji Imada claims that around 1937, a customer challenged him to make ikura nigiri. This wasn’t something being done, but he gave it a shot anyway. The challenge was to keep salmon roe on top of the sushi rice. Conventionally, this was impossible. But he had a brilliant idea: wrap nori around the sushi rice and salmon roe to hold it all in place. And the ikura gunkanmaki was born. This may have been the first time salmon roe was used in sushi. And it was also (supposedly) the invention of gunkan-style sushi. After all of this, ikura sushi still didn’t take off in a big way. It was a seasonal ingredient that was only available in the fall. And it didn’t hold well. Jiro Dreams of Ikura Sushi In Jiro Ono’s book, Sushi Chef Sukiyabashi Jiro, he describes being one of the few Tokyo chefs to serve ikura in his restaurant. He certainly wasn’t the first, but he did help the ingredient grow In popularity. It started when a customer had brought him soy sauce-marinated Hokkaido ikura and asked him to play around with it. Jiro took up the challenge. He started by serving small bowls of marinated salmon roe as shuko, which is like an appetizer that’s served along with sake. It was a hit. He then decided to serve it as gunkanmaki. And it was an even bigger hit. After much trial and error, he eventually landed on a way of preserving and freezing the salmon roe so that it could be served fresh all year. This was in the early 1980s. A lot has changed since then. It’s a rare sushi restaurant that doesn’t serve ikura sushi. As an Amazon Associate I earn commissions from qualifying purchases. Adding Quail Egg to Ikura Sushi Quail egg (uzura no tamago) is a popular addition to gunkan sushi, especially ikura. It’s a combination that works: ikura has a snappy texture, and uzura adds silkiness and gentle umami. I recommend pairing this combo with savory and tart sake like kimoto and yamahai. Champagne, unoaked chardonnay (esp. Chablis), dry sherry, pilsner, and a dry martini* also make excellent pairings. Why Cucumber and Ikura are a Thing Cucumber slices are often added to ikura gunkan, and there’s a good reason. The cucumber is supposed to be dipped in soy sauce, then it and the sushi are eaten together. This is opposed to dunking the bottom area of sushi directly into the soy sauce. The rice will absorb lots of soy, which isn’t ideal. An additional benefit to the cucumber slice is a satisfying crunch. It works well with the unique, gummy-like texture of salmon eggs. Ikura Sashimi Sometimes salmon roe is served by itself as sashimi. It’s often laid over a piece of cucumber or a shiso leaf. This is probably the healthiest way to enjoy it. Ikura Don This is the most common way you’ll find ikura served in Japan. Because regular, unseasoned steamed rice is used, it’s not considered sushi. However, it’s totally fine to substitute sushi rice if you prefer. Shredded nori seaweed, shiso, wasabi, and uni are common additions to ikura don. Raw egg (quail or chicken) is also a tasty and textural add-on. Salmon Roe as a Garnish Most diners are probably introduced to ikura in the form of a garnish. It’s a beautiful addition to a lot of foods and even drinks. Salmon roe is an excellent addition on top of raw oysters. It’s also sometimes placed on top of nigiri or sushi rolls. One of the most common ways you’ll find ikura served is on chirashi. This sushi dish features a variety of seafood types, and salmon roe is nearly always on the list. Lastly, salmon roe looks very good in shooters and in sparkling wine. advertisement Ikura Health and Nutritional Info Salmon and their roe are considered very healthy to eat. They are rich in omega-3 fatty acids, which are great for cardiovascular health. Salmon roe is also high in protein, antioxidants, potassium, and vitamins A, C, and B12. It’s said to prevent depression, inflammation, and arthritis*. One ounce of king salmon contains around 70 calories, < 1g of carbs, 8 g of protein, and 4g of fat**. These figures do not account for sushi rice. *Source WebMD **Source Nutrition Advance Is Ikura Safe During Pregnancy? The salmon roe served in Japanese restaurants isn’t usually cooked. But it is cured in salt, then frozen at temperatures around -50 °C. This kills bacteria like listeria which could be potentially harmful. This means ikura is probably safe with limited consumption. However, I’m not a doctor or qualified to give medical advice. When in doubt, err on the side of caution. Prepping and Storing Ikura Ikura is almost always salted immediately after harvest. As soon as it’s exposed to air, it begins to harden and will become too firm rapidly. After salting, salmon roe is flash-frozen to -50 °C or below. It can then be stored for a year or more without losing its quality. Thawing this very cold, frozen ikura is a two-step process. It’s first placed into a freezer that’s around -10 °C. After it has acclimated to that temperature, it can be placed into a refrigerator to thaw completely. Thawed in this manner, the salmon roe will look, feel, and taste as good as when it’s freshly caught. The deep freezing process also kills harmful pathogens and bacteria. Marinating Salmon Roe Salmon roe is often marinated in a mixture of sake and soy sauce after thawing. Mirin is sometimes used, as well, but can make the roe too firm. Marinating red caviar in dashi is another popular option. It adds a bit more umami and melds with the briny, rich flavor of the eggs. For a simple, effective soy sauce-cured ikura (ikura no shoyuzuke) recipe, check out Akira San’s Sushi at Home video below. This channel is super-informative and will get you on the right track. How Long Does Ikura Last in the Fridge? After thawing, salmon roe will last around five days in the refrigerator. Thawed, then refrozen eggs will often lose their firm texture. What Do You Think? From my experience, Westerners are rarely neutral on ikura. They either love it or won’t touch the stuff. Early in my sushi days, I tried it but hated it. Eventually, I enjoyed a few eggs here and there. And finally today, I can put it down! I’d love to hear your opinion or if you have an ikura experience to share. Do so by commenting below."
}