{
  "url": "https://opengovco.com/business/20161823410",
  "title": "Emery Cahoj LLC. · 2417 Crestridge Dr, Castle Rock, CO 80104",
  "text": "Emery Cahoj LLC. (Entity #20161823410) is a DLLC in Castle Rock, Colorado registered with the Colorado Department of State (CDOS). The entity was formed on December 2, 2016 in the jurisdiction of Colorado. The registered office location is at 2417 Crestridge Dr, Castle Rock, CO 80104. The current entity status is good standing. The registered agent of the entity is Emery Cahoj . The agent office address is 2417 Crestridge Dr, Castle Rock, CO 80104. Do you have more infomration about Emery Cahoj LLC.? Please fill in the following form. This dataset includes about two million business entities (corporations, LLCs, etc.) registered with Colorado Department of State (CDOS) since 1864. The Colorado Department of State (CDOS) is Colorado's central filing office for corporations, partnerships, limited liability companies and business trusts. Each business is registered with business name, principal address, mailing address, registered agent name, entity status and formed date, etc. The Colorado Department of State (CDOS) is Colorado's central filing office for corporations, partnerships, limited liability companies and business trusts. This dataset includes colorado business entities (corporations, LLCs, etc.) registered with the Colorado Secretary of State. The business registration goes back to the 1800's. The following are the entity types of Colorado businesses: Limited liability company (LLC), Profit corporation, Nonprofit corporation, Foreign entity, Profit corporation, Cooperative (Article 56), Cooperative association (Article 55), Limited cooperative association (Article 58), Limited partnership (LP), Limited liability partnership (LLP), Limited liability limited partnership (LLLP), Limited liability limited partnership - Article 61 (LLLP), Limited partnership association (LPA), Cooperative (Article 56), Cooperative association (Article 55), Limited cooperative association (LCA). Each business is registered with business name, principal address, mailing address, owner name, owner address, entity status, type and creation date. There are over 2 million unique business id's registered with the state of Colorado, and there is an average of 2,000 new businesses added each week. Business Entity ID is the business number from CDOS (also the unique identifier). Principal Address, however, is not always guaranteed to be the physical location of the business entity's main operation. Some businesses can be registered in Colorado but have an address outside of the state or may list a PO box and there are businesses with locations that don't have a public access entry point. Mailing Address is the mailing address of the business owne, and the Agent address may be the address of the agent or in some cases has the same address as the business owner. The Colorado Information Marketplace (CIM) is the central online home for state open data, giving the public greater access to public data and increasing transparency in government operations. By opening up public data, Colorado is providing fuel for entrepreneurs, researchers, and citizens to build innovative solutions and create insights."
}