{
  "url": "https://www.cnn.com/2026/02/03/tech/spain-under-16-social-media-ban-intl",
  "title": "Spain will ban social media for under-16s | CNN Business",
  "text": "Spain will ban social media for under-16s and require platforms to employ strict age verification tools, joining Australia, France and Denmark in moves to curb the influence of digital platforms on children. “Our children are exposed to a space they were never meant to navigate alone. A space of addiction, abuse, pornography, manipulation and violence,” Spanish Prime Minister Pedro Sánchez said Tuesday. “We will no longer accept that, we will protect them from the digital Wild West.” Speaking at the World Governments Summit in Dubai, Sánchez said his government would also introduce new laws to hold social media executives criminally liable for failing to remove illegal or hateful content. The new rules will also sanction people and platforms that amplify illegal content, including via algorithms. “We will turn algorithmic manipulation and amplification of illegal content into a new criminal offense,” he said. “Spreading hate must come at a cost.” The process of passing legislation will begin next week. Other proposed measures include developing a “hate and polarization footprint,” Sánchez said, a system to track and quantify how digital platforms fuel division and amplify hate. In December, Australia became the first country in the world to implement a social media ban for under-16s, barring access to 10 platforms, including Facebook, TikTok, Instagram, Snapchat and X. Britain is considering a similar move, while France and Denmark have recently announced plans to stop under-15s accessing social media. French President Emmanuel Macron said last month that he wanted to fast-track the legal process to ensure the ban would be in place before the start of a new school year in September. Other countries in Europe are also taking a tougher approach to social media companies. Sánchez said Spain had joined forces with five other European nations “committed to enforcing stricter, faster and more effective regulation of social media.” He did not name the countries but explained that the group would hold its first meeting in the coming days with a view to coordinating enforcement across borders. “This is a battle that far exceeds the boundaries of any country,” he said."
}