{
  "url": "https://forum.supremacy1914.com/index.php?1-introduction-en_10/",
  "title": "1. Introducción - Supremacy - Forum",
  "text": "1. Introducción Supremacy 1914 es un juego de estrategia multijugador online a tiempo real ambientado en la Primera Guerra Mundial. Te harás con el control de una nación y tratarás de usar habilidades diplomáticas, destreza militar y tácticas secretas en la lucha por el dominio del continente o el mundo entero. Supremacy 1914 se juega en distintas partidas que pueden tardar desde dos semanas a varios meses en finalizar y pueden enfrentar hasta 500 jugadores entre sí en un combate a tiempo real. Las partidas se llevan a cabo en mapas históricos en los que tendrás que manejar tu economía, dirigir tus ejércitos para expandir tu territorio y formar coaliciones con otros jugadores para alcanzar la victoria en la partida. Las órdenes de las unidades y las producciones se llevarán a cabo aunque no estés conectado. Sin embargo, mantener una estrecha vigilancia sobre lo que sucede en el mapa y gestionar determinadas situaciones al momento es clave para la victoria. Se pueden jugar varias partidas al mismo tiempo y así explorar distintas estrategias y desafiar a distintos jugadores. Al jugar y ganar partidas, obtendrás premios y ascenderás de rango para medir tu progreso frente a los demás. También puedes unirte a alianzas, entrar en partidas por equipos y crear partidas personalizadas con distintas características y modos de juego. 1.1 Tabla de Contenidos Este manual cubre todo lo que necesitas saber para poder participar con éxito en una partida de Supremacy 1914. Sin embargo, no profundiza en muchos de los detalles y tácticas del juego. Depende de ti dominar el juego y a tus oponentes. Si quieres leer sobre un tema concreto, puedes pinchar sobre uno de los siguientes enlaces: ALCANZAR LA VICTORIA El objetivo en las partidas es ser el primer jugador en alcanzar un determinado Índice de Poder y, por tanto, ganar la partida. Tu Índice de Poder se basa en factores que reflejan tu progreso en el dominio del mapa. Para incrementarlo, debes: - Conquistar provincias. - Construir mejoras. - Aumentar la moral de tus provincias. Puesto que cada construcción contribuye a la puntuación según su nivel, la mejora del nivel de la construcción también te acercará a la victoria. Sin embargo, tu Índice de Poder no es una puntuación absoluta. Refleja que proporción de las construcciones y de la moral controlas, con lo que el progreso de otros jugadores afecta a tu puntuación. Por tanto, otra forma de aumentar tu Índice de Poder es reduciendo la moral de tus enemigos o destruir sus construcciones. Tu Índice de Poder sólo aumentará si progresas más que la media de los jugadores. ¿EN QUÉ CONSISTEN LAS PARTIDAS? Una partida de Supremacy 1914 contiene un número limitado de jugadores. Podéis jugar varias partidas al mismo tiempo y así poder alternar entre distintos mapas y escenarios, explorar distintas estrategias, gobernar distintos países, desafiar amigos en partidas privadas protegidas con contraseña, etc. Con cada partida rankeada que juguéis, obtendréis tantos Goldmarks como Índice de Poder tengáis al finalizar la partida, además de aumentar vuestra puntuación y vuestras estadísticas de combate. También podréis conseguir distintos logros que reflejen vuestro progreso en el juego. Échale un vistazo a la sección de Nuevas partidas para descubrir sobre las diferentes posibilidades de configuración y para encontrar partidas en curso con esa configuración."
}