{
  "url": "https://www.bordeaux.com/en/wine-styles/",
  "title": "Wine styles - Vins de Bordeaux",
  "text": "All our wine styles Wine is a bit like people: each has its own character, energy, charm — and yes, the occasional quirk. Step into the world of Bordeaux and explore its many styles, from the gentlest to the most structured, from the juiciest to the most powerful. Every bottle is an invitation; every style a distinct composition. Some Bordeaux profiles dance on light, airy notes, while others captivate with depth, power and a touch of quiet contemplation. The good news? In Bordeaux, there’s always a style that suits your palate. No complicated rules here — just pleasure, sensations and stories worth sharing. Whether you’re planning a casual apéritif, a refined dinner or anything in between, find the cuvée that will make your taste buds sing. Explore, taste, compare… and be surprised by the endless diversity of Bordeaux wines. Red wines light and fruity Bordeaux’s easygoing pleasure No fuss, no frills — here, it’s all about fruit. Light and fruity Bordeaux reds deliver sheer freshness and juicy appeal from the first sip to the last. Straightforward but never simple, they combine bright aromatics, a supple texture and an effortless, spontaneous charm. Usually aged only briefly, these wines showcase purity of fruit and the vibrancy of primary aromas, making them instantly enjoyable and mouth‑watering. How to spot them In the glass, expect a bright, luminous colour. On the nose, fresh and tangy red fruits often mingle with a hint of wildflowers. On the palate, softness and freshness take the lead, offering an easy, unpretentious drinking experience. These cuvées are wonderfully versatile — from lasagna to seared meats or marinated vegetables, they slip naturally onto the table in any season. Perfect for sharing with friends, without overthinking it. Best enjoyed young, ideally within 1 to 3 years — a true youthful charmer.. Red wines fresh and generous Bordeaux’s rock’n’roll spirit This is the style that goes its own way. Balancing freshness with depth, it nudges the classic Bordeaux codes without ever pretending to be a rebel. Its secret? A calm, unhurried vinification — sometimes in unexpected vessels — that lets ripe, expressive fruit shine through, with a lovely, lingering finish. How to spot it? The colour can vary, but on the nose, ripe and fleshy fruit leaps from the glass. On the palate, it marries suppleness with substance, delivering that irresistible, mouth‑watering generosity that makes you put the glass down… only to pick it right back up. This style pairs beautifully with marinated octopus, mushroom omelette, red meat — and even with roasted carrots, sweet potatoes, or potatoes in all their forms. Versatile and relaxed, it works just as well for apéritif as it does at the dinner table. Best enjoyed young, this charmer can nevertheless age comfortably for 5 to 10 years. Red wines Balanced and silky Bordeaux elegance This style captures the poise and harmony that define Bordeaux’s finest reds. Structured yet velvety, it brings together a firm backbone and beautifully rounded edges, shaped by attentive winemaking and thoughtful ageing. Complex and refined, it weaves together layered aromas and varied textures for a pleasure that is both immediate and lingering. How to recognise it? Its colour is deep and captivating. On the nose, ripe fruit leads the way, lifted at times by a subtle floral or spicy note. On the palate, everything falls into place: supple tannins, gentle roundness and a refined balance that stretches into a long, harmonious finish. Structured, flavourful dishes make ideal companions — gourmet burgers, slow‑cooked stews, red meat or dishes with rich sauces. This is a style that truly shines at the table. You can enjoy it young, in all its polished charm, or let it evolve for 5 to 10 years to reveal its full complexity. Red WInes Elegant and complex The Bordeaux icon A true emblem of Bordeaux, this style captures the region’s tradition, craftsmanship and quiet power. Built on a firm structure yet marked by remarkable finesse, it’s the kind of wine conceived to stand the test of time — sometimes decades. Complexity and elegance define its character, reflecting both an exceptional terroir and meticulous work in the vineyard and cellar. How to recognise it? Its colour is deep and commanding. On the nose, the bouquet is intense, layered and captivating, offering a seemingly endless aromatic spectrum. On the palate, intensity takes centre stage: structured tannins, precision, and an impressive length that unfurls with refinement — the signature of the finest cuvées. What does it pair well with? This style shines alongside flavour‑rich dishes such as characterful meats, firm‑fleshed fish, couscous, mushrooms or roasted vegetables. It’s a natural companion for seated meals where one takes the time to appreciate each moment. How long can it age? Often kept for the long haul, this distinguished style can mature for 10, 15, even 20 years depending on the conditions — allowing its complexity to deepen and its tannins to soften beautifully. White wines floral and fruity The radiant freshness of Bordeaux Light, crisp and effortlessly charming, this style of dry white is a burst of freshness and pure fruit. It wins you over with its vibrant energy and expressive aromatics, where fruit and floral notes come together for instant pleasure. A wine that brings a smile from the very first sip – and one you share without overthinking it. How to recognise it? A bright, pale robe. On the nose, expect delicate floral notes lifted by fresh fruit – apple, pear, lemon. On the palate, it’s all about vivacity and lightness, delivering a clean, refreshing finish. Perfect with salads, seafood, grilled fish, sushi or light appetisers – this is a style you can enjoy all year round. Best enjoyed young, this charmer reveals its full freshness and aromatic sparkle in its early years. With more than 1,800 producers crafting dry white wines across 12 AOPs in Bordeaux, you’re bound to find a cuvée that suits your palate. Useful to know: a dry white wine contains less than 3 grams of residual sugar per litre. En voir plus White wines round and complex The Bordeaux tightrope walker Structured and generous, this style of dry white blends roundness, complexity and finesse. Its aromas run deep, with ripe fruit layered over floral and mineral notes, and occasionally lifted by a gentle hint of spice. It’s a wine that wins you over through its balance — fine‑boned yet deliciously ample. How to recognise it? Its robe is golden, bright and limpid. On the nose, white and yellow fruit mingle with floral nuances, sometimes edged with a whisper of hazelnut or honey. On the palate, it shows breadth and balance, expressive and rounded with a lingering, well‑defined finish. Perfect with grilled fish, poultry, risotto, refined vegetable dishes or seafood, this style shines both on a relaxed table and at a summer BBQ. Best enjoyed young if you love freshness, though some bottles can easily be cellared for 3 to 5 years to deepen their texture and aromatics. En voir plus Useful to know: A dry white wine contains less than 3 grams of residual sugar per litre. Sweet white wines sweet and fruity The gentle side of Bordeaux Here, fruit takes the lead with generous expressiveness. Soft, velvety and highly aromatic, this style of sweet white wine is all about spontaneous pleasure. It brings together richness and balance without ever feeling heavy, delivering notes of ripe and candied fruit. How to spot it? Its robe is golden and radiant. On the nose, expect yellow and exotic fruits lifted by hints of honey, flowers and nougat. On the palate, it is sweet, silky and harmonious, with a mellow, cushion‑soft finish that makes it hard not to take another sip. Soft cheeses, chili con carne, roast chicken, fruit tarts, foie gras (of course) — or even as an apéritif for a sweet‑savory moment. This style is a surprisingly versatile partner throughout a meal, provided you enjoy a touch of generosity. This indulgent profile is best enjoyed young for its vibrant fruit, though some moelleux can age comfortably for 3 to 5 years. En voir plus Good to know : sweet wines contain a higher level of residual sugar than dry wines. Moelleux whites typically range from 12 to 45 grams of sugar per litre. Sweet white wines Sweet and complex The exquisite Bordeaux treat Here we reach the sublime. These luscious wines are born of rare know‑how, near‑meditative patience, and an exceptional terroir. Rich yet finely drawn, they unfold in layers of aroma and intensity without ever tipping into heaviness. They are wines of sweetness, yes — but above all of remarkable complexity, capable of ageing with astonishing grace. How to recognise it ? Its colour glows gold, sometimes amber, always radiant. On the nose, we speak of true perfume: honey, candied fruit, gentle spices, flowers, and occasionally a lift of citrus that brightens the whole. On the palate, the texture is silky and expansive, with a finish that seems to stretch on and on — a moment suspended in time. Spiced dishes, blue cheeses, fruit‑based desserts, or simply the quiet pleasure of the end of a meal… it pairs beautifully with contemplative moments. This liquid gold is one to keep: 10, 20 years, sometimes far more. Time is its greatest ally. En voir plus Useful to know : sweet wines contain more residual sugar than dry wines. Luscious Bordeaux whites (liquoreux) hold more than 45 grams of sugar per litre. rosés wines Bordeaux’s easygoing conviviality Spontaneity and freshness lead the way here. Light, crisp and fruit‑forward, Bordeaux rosés are the ideal companions for sunlit, simple moments — though they’re far from limited to summer sipping. They’re generous without fuss, refreshingly bright, joyful, and bursting with tangy fruit that lifts any occasion. How to recognise it ? Its colour ranges from pale blush to luminous salmon. On the nose, expect fresh red‑fruit aromas strawberry, raspberry sometimes lifted by a delicate floral touch. On the palate, brightness and lightness take centre stage, delivering instant pleasure and an easy sense of sharing. Paired with salads, grilled dishes, tapas, Mediterranean plates or fish en papillote, this style is a true chameleon perfect for aperitif hour or a laid‑back table. Often best enjoyed young, within three years, to savour its full freshness. But some top Bordeaux rosés age surprisingly well, revealing an impressive ability to hold their own over time. Clairets wines The rooted Bordeaux style Halfway between red and rosé, clairet is the historic Bordeaux style making a well‑deserved comeback. A long‑standing classic, clairet is returning to the spotlight, and for good reason: it has everything to charm lovers of lighter red wines. Expressive and generous, clairets deliver ripe fruit intensity and a lively, lightly tangy freshness a combination that makes them wonderfully versatile. How to spot it ? Its colour sits in the deep‑rosé spectrum, shading toward light red. On the nose, vivid aromas of red and black fruits take centre stage, sometimes lifted by a subtle spicy note. On the palate, it is both supple and full, juicy and immediately appealing the kind of wine made for sharing. Clairet pairs effortlessly with just about anything: barbecues, grilled meats, lighter sauced dishes, roasted vegetables, mild cheeses or even a simple salad. Best enjoyed young for its exuberant fruit, though some clairets can age 2 to 3 years without losing their charm. A clairet cocktail idea Easy to make, with a bright raspberry‑pink glow in the glass : Clairet + lemonade + 1 raspberry dropped into the glass. Crémants wines The festive team of Bordeaux Airy, sparkling and elegantly understated, Crémant de Bordeaux is the wine of everyday celebration. With its fine bubbles, lively freshness and bright aromatics, it delivers energy and indulgence in equal measure — always with a touch of finesse and at wonderfully friendly prices. How to recognise it? Its colour ranges from pale straw to delicate rosé, always with a brilliant sheen and a lively stream of bubbles. On the nose, floral and fruity notes often mingle with a subtle hint of brioche or toasted bread. On the palate, it’s crisp, elegant and refreshing, with an effervescence that brings lift and momentum to every sip. Whether served with aperitifs, seafood, sushi, generous salads, light desserts, or simply shared with friends for the pleasure of it, both classic white Crémants and rosé Crémants always find their place at the table. Best enjoyed young, this sparkling charmer reveals all its vibrancy when its bubbles are at their peak — though, as always, some cuvées are crafted for ageing and stand the test of time beautifully. Useful notes: Crémant de Bordeaux is made using the same method as Champagne — the traditional method."
}