{
  "url": "https://www.emvco.com/",
  "title": "Enabling Seamless and Secure Payments Worldwide | EMVCo",
  "text": "EMVCo creates and manages EMV® Specifications and programmes that enable seamless and secure card-based payments for businesses and consumers worldwide. Millions of card-based payments are made and accepted daily. Whatever you are buying, wherever you are in the world, you expect your payment card to work. In-store, online or remote, the process needs to be familiar, convenient and reliable. EMVCo helps make this possible. EMV Technologies are the suite of payment technologies that EMV Specifications and programmes support. Industry stakeholders use EMV Specifications to design payment products and solutions they can trust to work seamlessly and securely everywhere. This is important to the delivery of safe and reliable payments that merchants, businesses and consumers expect globally. More than a hundred organisations – including merchants, issuers, acquirers, payment networks, financial institutions, manufacturers, technology providers and testing laboratories – contribute their knowledge and expertise to the development of EMV Specifications. EMVCo Associates can contribute their knowledge and expertise to shape the development of EMV Specifications. EMVCo Subscribers can receive notice of pending EMV Specification developments and participate in a formal dialogue with EMVCo. All industry participants can review and provide comments on new EMV Specifications and major updates before final publication. EMVCo's new website and Participant Dashboard are now live. To access your account for the first time on our new website you'll need to carry out a password reset here. You will then be sent an email to reset your password. EMVCo Associates, Subscribers and public users of emvco.com can create accounts to manage their engagement and participation with EMVCo. Using your EMVCo account, you can create your own watchlist of EMV technologies documents, monitor queries and responses, and manage your profile."
}