{
  "url": "https://www.apple.com/os/ios/",
  "title": "OS - iOS 26 - Apple",
  "text": "A new design with Liquid Glass. Beautiful, delightful, and instantly familiar. Visual intelligence now lets you search, ask questions, and take action with the content on your iPhone screen.1 Personalize chats with new backgrounds and answer questions with polls in Messages. Communicate across languages with Live Translation in Messages,2 FaceTime, and Phone.3 Eliminate distractions with new screening tools in Phone,4 FaceTime, and Messages. Get more information at a glance with Live Activities and react with Tapbacks in CarPlay.5 Design A whole new element of delight. The new design with Liquid Glass is beautiful, delightful, and instantly familiar. It gives you a more consistent experience across your apps and devices, making everything you do feel fluid. A fresh design. With the optical qualities of glass and a sense of fluidity, Liquid Glass brings an expressive new design to your Lock Screen, Home Screen, Control Center, apps, and more. A more vibrant Lock Screen. The time dynamically adapts to your photo wallpaper and notifications, keeping your subject in view. When you move your iPhone, your photo comes to life with a new 3D effect.6 Updated app icons. Take your pick from updated light and dark appearances, new color-tinted icons, and a stunning clear look. Dynamic controls. Across apps, Liquid Glass controls reflect and refract their surroundings and fluidly morph to bring more focus to your content. A shared look across the system. Liquid Glass enables a more delightful experience across apps and devices so it’s easier to use your Apple products together as you move across them throughout your day. Apple Intelligence Effortlessly helpful every day. Apple Intelligence is integrated into even more places to help you communicate across languages, create more personal images, and get more done.7 Live Translation. Automatically translate texts in Messages,2 display live translated captions in FaceTime, and get spoken translations for calls in the Phone app.3 Use Live Translation with AirPods. When the person you’re speaking with responds in a different language, their words are automatically translated and spoken out loud in a natural voice.8 Do more with visual intelligence. It builds on Apple Intelligence, so you can search across your most used apps, add an event to your calendar, and ask questions — letting you do more with what’s on your screen. More ways to express yourself with images. Mix emoji and descriptions to make something brand-new. In Image Playground, discover additional ChatGPT styles. And have even more control when making images inspired by family and friends using Genmoji and Image Playground. Accelerate your workflows. Intelligent actions in Shortcuts can summarize text, create images, or tap directly into Apple Intelligence models to provide responses that feed into your shortcut. Communication Less noise. More fun. Enjoy fewer interruptions and more ways to dial up the personality in your daily interactions — so you can focus on the conversations that matter most. Manage unwanted calls. Call Screening automatically answers unknown callers without interrupting you. Once the caller shares their name and the reason for their call, your phone rings and you can decide if you want to pick up.4 Screen new senders. Approve unknown numbers with new screening tools that detect spam and give you control over who appears in your conversations in Messages, and your recent calls in Phone and FaceTime. Let the Phone app wait on hold for you. Hold Assist keeps your spot in line while you wait for a live agent and notifies you when they’re ready.9 Polls in Messages. Create a poll to let the group chat decide. Everyone in the conversation can contribute options and watch as votes come in. Add a background to any conversation. Select from stunning built-in options or choose any of your own photos to bring a distinct personality to your Messages conversations. Discovery Step into your comfort zone. On the spot. Tap into features that help you explore the world while protecting your privacy. And with the new Games app, stay up to date across all your games and discover new ones. Maps understands your preferred routes. Maps learns the routes you travel regularly and can alert you about significant delays, even before you head out. If your routine changes, iPhone adapts to it so you can conquer your commute. Visited Places in Maps. Never forget a place with the option to remember where you’ve been with Visited Places. Quickly find that great cafe from a trip and share it with a tap.10 AutoMix and Lyrics Translation. AutoMix in Apple Music uses intelligence to seamlessly mix from one song to the next like a DJ, time stretching and beatmatching at the perfect moment. And Lyrics Translation helps you understand the meaning behind your favorite songs.11 Store even more in Wallet. Create a digital ID in Wallet using your U.S. passport.12 It can be used at TSA checkpoints, in apps, and in person. Boarding passes now include convenient access to airport maps, luggage tracking with Find My, and shareable Live Activities. New Games app. Stay up to date with what’s happening across all your games, discover new ones your friends are playing, and get tailored recommendations. Compete with friends in score-based showdowns with Challenges. New features include an all-new experience designed with Braille13 users in mind, more options for Vehicle Motion Cues to help reduce motion sickness, and a more customizable reading experience. Family. Parents can move kids to Child Accounts more easily and take advantage of a wide set of parental controls designed to keep children safe. These include enhancements across Communication Limits, Communication Safety, and the App Store. Audio recording. Capture high-quality audio during video conference calls. And record in high definition in Camera with AirPods and AirPods Pro with the H2 chip. Reminders. With Apple Intelligence, Reminders can suggest tasks, grocery items, and follow-ups based on emails or other text on your device. It can also automatically categorize related reminders into sections within a list. Photos. With an updated layout, easy-to-use controls, and Library and Collections as your two main tabs, Photos makes it easier than ever to find what you’re looking for. Bring your favorite photo to life as a spatial scene, which uses the same advanced technology as visionOS to create a captivating 3D effect. AirPods Camera Remote. Start recording video in Camera by pressing and holding on AirPods or AirPods Pro with the H2 chip. Clock. Set a snooze duration between 1 and 15 minutes, giving you more flexibility and customization for your daily alarms. CarPlay. React with a Tapback in Messages, follow Live Activities, and get more information at a glance so you can stay connected and focused while you drive.5 Journal. Multiple journals let you keep entries for different aspects of your life separate, images can be added inline with text, and a beautiful map view shows entries based on their location."
}