{
  "url": "https://www.health.com/occupational-therapy-7508576",
  "title": "Occupational Therapy (OT): Who Needs It, Benefits, What To Expect",
  "text": "What Is Occupational Therapy? By Brittany Dube, MPH Brittany Dube, MPH Brittany Dube is a public health professional with expertise in health education and community health. She works for her local Department of Health as a Behavioral Health, Health Promotion, and Emergency Response Specialist. health's editorial guidelines Updated on September 28, 2025 Medically reviewed by Forest Miller, OTR/L Medically reviewed by Forest Miller, OTR/L Forest Miller, OTR/L, MSOT, is an occupational therapist specializing in geriatric rehabilitation and treating conditions affecting people's upper extremities. learn more In This Article View All In This Article Purpose Goals and Skills Providers What To Expect OT for Children Occupational vs. Physical Therapy How To Find Support FAQs Close The Good Brigade / Getty Images Occupational therapy (OT) helps you regain your ability to perform daily tasks and live independently. OTs create personalized plans to help improve your physical, emotional, and social needs.An OT does not diagnose conditions but works with medical doctors to improve your treatment. Occupational therapy (OT) is a form of rehabilitation therapy that helps you improve your ability to carry out daily tasks, or occupations. Generally, a healthcare provider can refer you to an occupational therapist to help you better manage certain health conditions and injuries that interfere with completing routine activities at home, in the workplace, at school, or in your community. Occupational therapy may be one part of a more comprehensive treatment plan to manage your condition or injury. Your provider may also suggest medication, lifestyle changes, physical therapy, or surgical procedures in addition to OT, depending on your situation. Purpose The purpose of OT is to support people living with certain health conditions or injuries. This treatment helps you regain, maintain, or adjust the ability to carry out daily activities. Occupational therapists—health professionals who specialize in OT—will assess your capabilities, learn about any challenges you're facing, and develop intervention plans to help support your physical, emotional, and social needs. A wide variety of conditions and injuries can benefit from occupational therapy. These may include: Alzheimer's disease Attention deficit hyperactivity disorder (ADHD) Autism Birth defects Broken bones and fractures Cancer Carpal tunnel syndrome Cerebral palsy Chronic pain Multiple sclerosis Parkinson's disease Recovering from surgery (e.g., a joint replacement) Sensory processing disorders Severe burns Stroke Traumatic brain injuries Types of arthritis including rheumatoid, psoriatic, and osteoarthritis Vision changes Note that the list is not exhaustive. The ultimate goal of OT is to help you regain independence in your daily activities as you live with and manage your specific condition. Your healthcare provider may recommend OT for a variety of health conditions and your exact treatment plan will depend on your individual case. What Goals and Skills Does OT Work On? Occupational therapists can help you learn a wide range of skills to accomplish your individual goals. They may help you: Adjust to the decline in your functioning associated with cancer and other medical conditions Develop your fine motor skills, such as picking up and holding objects, handwriting, or computer skills Find and use adaptive equipment like wheelchairs, communication aids, or bathing equipment Identify and reduce fall hazards in your home or adapt your environment to make it more accessible Improve your hand-eye coordination Master basic life skills, such as showering, getting dressed, or eating Plan your return to work or school after recovering from an illness or injury Sharpen your cognitive functioning skills, such as memory Talk to your loved ones and help them learn ways to support you while you manage your condition Teach you exercises that can help you regain mobility or flexibility Occupational therapists tend to be very adaptive in their techniques and can plan for and help you reach several diverse individual goals. They will spend time getting to know you, your lifestyle, and your condition before developing a treatment plan that works best for you. Who Practices Occupational Therapy? If a healthcare provider recommends OT for you, there are a few professionals who are able to support your treatment. You will likely work with one or more of the following providers: Doctor of Occupational Therapy (OTD): Have a Bachelor’s degree in a related field and a doctorate degree from a licensed OT programOccupational therapist: Hold a Bachelor’s degree in a related field, such as psychology or health science, and a Master’s degree from a licensed OT programOccupational therapy assistant (OTA): Support an occupational therapist or OTD and receive an Associate’s degree from an occupational therapy program in a community or junior college Both occupational therapists and OTDs can assess and evaluate you and develop treatment plans. OTAs can help the primary therapist or OTD deliver your treatment plan, but they can’t evaluate your condition. All three types of providers are required to complete supervised fieldwork as part of their training and pass a national exam. All states also require occupational therapy professionals to attain a license and some require providers to complete continuing education requirements throughout their career. What To Expect At the beginning of your occupational therapy sessions, your provider will complete an evaluation to better assess your condition and needs. They may ask you about your medical history, underlying conditions, injuries, and your goals. This will help them tailor your treatment plan to your individual needs. Once your occupational therapy provider learns more about you, they will design your treatment plan, or intervention plan. As your sessions continue, your provider will reevaluate and adjust your goals periodically to ensure that your needs are being met. You can expect your sessions to generally last somewhere between 30 and 60 minutes. How often and how long these sessions last will depend on the severity of your condition. Most people however may attend sessions as many as one to three times a week—especially when they first start OT. Occupational Therapy for Children It's common for children to also participate in occupational therapy, as research has shown that OT can help youth manage learning disabilities, neurological conditions like autism and ADHD, and sports injuries. If your child is in occupational therapy, you can expect that their evaluation and treatment process will look similar to that of an adult. However, the primary difference between child and adult OT sessions is that child sessions will likely include play, toys, and games to keep the child engaged. Your child's OT provider may focus on boosting self-esteem, developing or fine-tuning motor skills, helping work through cognitive challenges, and encouraging social interactions with others, among other skill-building techniques. You may begin to see your child grow and flourish in their development as they continue working with an occupational therapist. As they play and learn new skills from their occupational therapist, they may begin to develop an increase in their self-confidence and improve their school performance. If you think occupational therapy may be helpful for your child, talk to a pediatrician about options. Occupational Therapy vs. Physical Therapy While occupational therapy and physical therapy share some qualities, such as working to improve your quality of life and ability to carry out daily tasks, there are some distinct differences. Physical Therapy Occupational Therapy Focuses on improving large muscle movements Works on small muscles and fine motor functioning Emphasizes physical recovery, such as improving mobility, strength, and stamina Helps with lifestyle adjustments, accessibility, social functioning, and sensory processing Incorporates interventions for physical health conditions Offers treatment options for both physical injuries and mental health conditions Follow us to see more of our stories on Google. Follow Us On How To Find Support If you think you or your child could benefit from occupational therapy, there are a few ways to find care: Ask other trusted professionals for a referral, such as your primary healthcare provider or your child’s school nurse or counselor. Check your insurance plan and nearby hospitals, clinics, or rehabilitation centers to see if they have consultations for occupational therapists available. Search online databases that list occupational therapy practices in your area. Frequently Asked Questions Why does a child with autism need occupational therapy? Occupational therapy can support children and adults with autism to develop skills to perform daily tasks, such as dressing and eating. Occupational therapists can also help people with autism by using adaptive technology to better communicate their thoughts and feelings. What are the primary responsibilities of an occupational therapist? Occupational therapists will evaluate your individual needs, develop an intervention plan that helps you meet your goals, and plan OT sessions that deliver the treatment that is right for you. Does an occupational therapist diagnose health conditions? No, occupational therapists do not diagnose health conditions. Most people will receive a referral from their healthcare provider to meet with an occupational therapist. The role of the therapist is to then assess their client's needs and learn their strengths to create sessions that cater to their individual goals. Occupational therapists can work with a primary healthcare provider, however, to ensure that treatment is improving a person's condition. Read more: Wellness Fitness Was this page helpful? Thanks for your feedback! Tell us why! Other Submit 8 Sources Health.com uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. U.S. Bureau of Labor Statistics. Occupational Outlook Handbook: Occupational Therapists. National Institutes of Health Clinical Center. Occupational Therapy. Nemours KidsHealth. Occupational Therapy. American Occupational Therapy Association. What is occupational therapy? American Occupational Therapy Association. Program admissions and formats. American Occupational Therapy Association. Occupational therapy scope of practice. Am J Occup Ther. 2021;75(Supplement_3):7513410020. doi:10.5014/ajot.2021.75S3005 National Council on Aging. What Is a Physical Therapist and How Can Physical Therapy Help Me? Eunice Kennedy Shriver National Institute of Child Health and Human Development. Occupational Therapy for Autism. Related Articles What To Know About Physical Therapy How To Use an Inversion Table Safely for Back Pain Do You Have Delayed Onset Muscle Soreness (DOMS)? Can Reflexology Ease Stress and Offer Pain Relief? What Are Bungee Workouts, and Should You Try One? 7 Exercises You Think Burn a Lot of Calories, But Actually Don’t 5 Experts Agree: This Is the #1 Workout Supplement To Boost Performance and Results Pelvic Floor Therapy: Techniques and Exercises What To Know About Pre-Workout Supplements Everything You Need To Know About Somatic Yoga 3 Ways Exercise Boosts Your Immune System 11 Potential Causes of Knee Pain After Working Out Why Being a Weekend Warrior Might Keep You Just as Healthy as Working Out Every Day How Does 'Adult Tummy Time' Benefit Posture and Neck Pain? 10 Supplements That Promote Muscle Growth How To Do 12-3-30 for Beginners Newsletter Sign Up By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookies Settings Accept All Cookies"
}