{
  "url": "https://finance.yahoo.com/quote/DKNG/",
  "title": "DraftKings Inc. (DKNG) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "DraftKings Inc. (DKNG) News headlines DraftKings (DKNG) is facing multiple challenges, including sluggish user growth and increased competition from emerging prediction markets. Analysts have mixed views, with some upgrades amid concerns about expense management and market expansion. DraftKings (DKNG) is facing multiple challenges, including sluggish user growth and increased competition from emerging prediction markets. Analysts have mixed views, with some upgrades amid concerns about expense management and market expansion. - Previous Close 27.51 - Open 27.76 - Bid 27.30 x 3200 - Ask 27.52 x 3200 - Day's Range 27.35 - 28.13 - 52 Week Range 26.23 - 53.61 - Volume 16,931,248 - Avg. Volume 13,922,786 - Market Cap (intraday) 13.649B - Beta (5Y Monthly) 1.65 - PE Ratio (TTM) -- - EPS (TTM) -0.54 - Earnings Date Feb 12, 2026 - Forward Dividend & Yield -- - Ex-Dividend Date -- - 1y Target Est 45.10 DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting, daily fantasy sports, media, digital lottery courier, media, and other products, as well as retails sportsbooks. The company also offers iGaming, or online casino products, which includes blackjack, roulette, baccarat and slot machines. In addition, the company engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. Further, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT on marketplace. The company is headquartered in Boston, Massachusetts. www.draftkings.comRecent News: DKNG View MorePerformance Overview: DKNG Trailing total returns as of 2/2/2026, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) . YTD Return 1-Year Return 3-Year Return 5-Year Return Earnings Trends: DKNG View MoreAnalyst Insights: DKNG View MoreStatistics: DKNG View MoreValuation Measures Market Cap 14.90B Enterprise Value 15.58B Trailing P/E -- Forward P/E 17.45 PEG Ratio (5yr expected) -- Price/Sales (ttm) 2.71 Price/Book (mrq) 20.35 Enterprise Value/Revenue 2.85 Enterprise Value/EBITDA -- Financial Highlights Profitability and Income Statement Profit Margin -4.90% Return on Assets (ttm) -4.72% Return on Equity (ttm) -29.59% Revenue (ttm) 5.46B Net Income Avi to Common (ttm) -267.57M Diluted EPS (ttm) -0.54 Balance Sheet and Cash Flow Total Cash (mrq) 1.23B Total Debt/Equity (mrq) 260.36% Levered Free Cash Flow (ttm) 435.32M Compare To: DKNG Select to analyze similar companies using key performance metrics; select up to 4 stocks. Company Insights: DKNG Fair Value Dividend Score Hiring Score Insider Sentiment Score Research Reports: DKNG View MoreSMID January 2026 Pick List This pick list highlights constituents of the Morningstar US Mid Cap Index that we believe offer investors the best risk-adjusted return prospects. The market capitalization range for U.S. mid-caps typically falls between $1 billion and $8 billion and represents 20% of the total capitalization of the U.S. equity market. SMID December 2025 Pick List This pick list highlights constituents of the Morningstar US Mid Cap Index that we believe offer investors the best risk-adjusted return prospects. The market capitalization range for U.S. mid-caps typically falls between $1 billion and $8 billion and represents 20% of the total capitalization of the U.S. equity market. SMID November 2025 Pick List This pick list highlights constituents of the Morningstar US Mid Cap Index that we believe offer investors the best risk-adjusted return prospects. The market capitalization range for U.S. mid-caps typically falls between $1 billion and $8 billion and represents 20% of the total capitalization of the U.S. equity market. Draft Kings Predictions launch expected to aid growth DraftKings Inc., based in Boston, is a digital sports entertainment and gaming company that provides users with daily sports, sports betting, and iGaming opportunities. It is also involved in the design and development of sports betting and casino gaming software. The company has approximately 900 employees. RatingPrice Target"
}