{
  "url": "https://www.polet.network/publications/preprints/bhowmik2024",
  "title": "Technology and policy co-evolution: the case of solar power in India 2010-2024 — POLET",
  "text": "Technology and policy co-evolution: the case of solar power in India 2010-2024 S.Bhowmik, A. Cherp, V.Vinichenko (pre-print). Technology and policy co-evolution: the case of solar power in India. POLET Working Paper series 2024-4 ABSTRACT India has consistently set ambitious renewable energy targets to meet rising electricity demand and reinforce its commitment to climate action. Achieving these targets relies heavily on the rapid and sustained adoption of solar technology, particularly utility-scale solar, which has historically driven most of the country’s solar growth. However, recent regional stagnation in expansion highlights the challenges of sustaining momentum and scaling adoption. We examine the role policies have played in driving solar technology growth in India. Drawing on literature on technology growth and policy mix, we examine what policies have evolved along the S-curve, both national and sub-nationally. We systematically identify the types of barriers that emerged as solar technology grew, and the policy mix that were used to address these challenges. We find that policy responses have become increasingly diverse, dynamically adapting over time to address new and shifting priorities at different phases of technology growth. These evolving priorities are also addressed with distinct sets of policy instruments. Furthermore, even as solar technology costs have declined, we observe that the number of policies has continued to grow, suggesting that cost reductions alone are insufficient to sustain growth. We also show how solar technology, policies, and politics have co-evolved in the case of utility-scale solar in India. We find that while changes in the policy mix can drive growth, they also reflect the challenge policymakers face in balancing multiple and at times conflicting priorities. Changes in the policy mix that revolves out of the need to navigate these competeing interests can introduce hidden costs that slow technology adoption, despite positive cost developments earlier. This analysis provides an overview of the co-evolution of technology and policy, underscoring the importance of integrating policy and political considerations when projecting technological growth. Our findings highlight that relying solely on cost-based assumptions can prove inadequate. Finally, we offer a perspective from a developing country context, where similar research has been limited, and where policymakers balance the complex task of meeting rising electricity demand, advancing electricity market liberalization, and renewable energy integration."
}