{
  "url": "https://mb.srb2.org/addons/2011x-sonic-exe.8757/",
  "title": "[Open Assets] - 2011X (sonic.exe) | SRB2 Message Board",
  "text": "- What permissions do you give others to modify and/or maintain your submission? - Modify: YES - Maintain: YES - I give permission for my entire submission to be modified by others or used in their own work. I give permission for my entire submission to be maintained by others as well. WARNING: This mod contains horror elements that some may find disturbing, including blood. It also contains flashing lights. Both of these can be disabled; see the Console Variables section below. HELLO DO YOU WANT TO PLAY WITH ME? (Not a screenshot) X – also known as SONIC.EXE – emerges from the void to play its sick games with Sonic and his friends! Run as long as you can, fight back if you have to, and escape to the safety of the next level… even if you won’t be safe for long.HELLO DO YOU WANT TO PLAY WITH ME? (Not a screenshot) Every level starts with business as usual. Give it long enough, though, and it will come seeking. X will spawn in and start hunting you down. If it catches you, it’ll grab you and start choking you. Press the buttons you see on your HUD to struggle for your life – if you’re quick enough, you can escape to live another day.(Character statistics have been altered for dramatic effect) Be careful about stunning it, though. It’s rare to see, especially in singleplayer, but X isn’t one to take humiliation lying down. Make it look bad, and you might just touch off a nerve… X has a wide array of customization, both client- and server-side. Use the exe_menu command to change these all in one place; don't worry, X won't chase you while you're using this menu. Variables: Variables: - exe_chasemusic: Accepts several options; use help exe_chasemusic to see all of them. Defaults to Retro. Determines what music will play when X sets its sights on you. - exe_lastlifemusic: Accepts On or Off. Defaults to On. Determines whether or not X's chase music will change when you're on your last life. - exe_screenshake: Accepts floats from 0 to 2. Defaults to 1. Multiplier for the intensity of the screenshake that happens when being chased by X. - exe_blood: Accepts On or Off. Defaults to On. Determines whether or not X will be splattered with blood after killing a player. - exe_flashing: Accepts On or Off. Defaults to On. Determines whether or not the screen will flash in certain situations, such as X teleporting to you or rage mode starting. While this mod does not contain strobing lights, it's still recommended to turn this off if you have photosensitive epilepsy. - exe_splashtype: Accepts Regular, Plain, or Blind. Defaults to Regular. If X’s messages blocking your screen annoys you, set this to Plain to have more visibility at the cost of aesthetics. Or set it to Blind if you hate seeing. - exe_radar: Accepts On or Off. Defaults to On. Determines whether a directional indicator will show when X has grabbed another player. - exe_ragefilter: Accepts Full, Vignette, Color, or None. Defaults to Full. Toggles whether the visual effects for X’s Rage mode will show, with options to only have the vignette or the color filter. - exe_randomspawn: Admin only. Accepts On or Off. Defaults to On. Determines whether X will randomly spawn. If this is off, X can still be spawned by an admin. - exe_spawntime_min and exe_spawntime_max: Admin only. Accepts integers 1 or higher. Defaults to 15 and 60. Determines the range of time during which X can randomly spawn. For multiplayer use, it’s reccomended to set these to higher values such as 30 and 150 to make it spawn less frequently, as levels tend to take longer and the timer does not reset on death. - exe_dorage: Admin only. Accepts On or Off. Defaults to On. Determines whether or not X will randomly enter Rage Mode once stunned enough times. - exe_ragehits_min and exe_ragehits_max: Admin only. Accepts integers 1 or higher. Defaults to 20 and 30. Determines the range of hits between which X can randomly decide to enter rage mode. - exe_minplayers: Admin only. Accepts integers 1 or higher. Defaults to 1. Determines how many players need to be online for X to spawn. - exe_escapestyle: Admin only. Accepts simon or mash. Defaults to simon. Determines whether to use the new grab escape system, introduced in v1.1, or the old one, which was used before this mod's SRB2MB release. - exe_dosaveload: Accepts Yes or No. Defaults to Yes. If set to No, console variable values will not be saved or loaded. - exe_menu: Open a menu that lets you adjust options and use commands relating to 2011X. - exe_spectate: Start spectating X, focusing your camera on it as it goes about its rampage. If you’re stuck as a spectator, you might have to spectate another player to see properly. - exe_forcespawn: Admin only. Make X immediately spawn. - exe_startragemode: Admin only. Make X immediately enter rage mode. - exe_despawn: Admin only. Cheat marked. If X is in the level, remove it and stop it from coming back. - exe_motd <seconds> <message>: Display a message from X. Use # to insert a line break, e.g. “SO MANY SOULS,#SO LITTLE TIME##WOULDN’T YOU AGREE?” PikaJade, Seulyy: Primary coders JoeDoughBoi: Character Outcome Memories: Inspiration, sound effects, voice clips Sonic.EXE (Lost & Found): Base code Mylo T., romoney5: Code help Venus: Additional voice clips Sonic the Hedgehog 3: Additional sprites Sonic.EXE (MY5TCrimson), SONIC 2011, Deltarune: Sound effects DrStephen: Basis for stun sprite (from Frostiikin's CrossMomentum) Outcome Memories, Silent Hill, Sonic.EXE (MY5TCrimson), Deltarune, Round2.EXE: Music JoeDoughBoi: Character Outcome Memories: Inspiration, sound effects, voice clips Sonic.EXE (Lost & Found): Base code Mylo T., romoney5: Code help Venus: Additional voice clips Sonic the Hedgehog 3: Additional sprites Sonic.EXE (MY5TCrimson), SONIC 2011, Deltarune: Sound effects DrStephen: Basis for stun sprite (from Frostiikin's CrossMomentum) Outcome Memories, Silent Hill, Sonic.EXE (MY5TCrimson), Deltarune, Round2.EXE: Music"
}