{
  "url": "https://noncredit.temple.edu/olli",
  "title": "Osher Lifelong Learning Institute |",
  "text": "To register for OLLI courses, you first need to enroll in an OLLI membership. Membership is a prerequisite for course registration. If you haven’t yet enrolled in an OLLI membership, please click here to visit the \"Become an OLLI Member\" page. Course registration will open before the semester starts. We will announce the exact dates on our homepage and send an email notification to all OLLI members. To ensure fairness for all members, we use a registration system called \"The Lottery.\" This system means there is no advantage to registering early or disadvantage to registering later. When you register, you'll be placed on a waitlist for your chosen courses. After the registration period ends, we will review all registrations. If a course has enough available spots, everyone on the waitlist will be admitted. For oversubscribed courses, a lottery will randomly select participants. Most courses with a capacity of 200 or more students are likely to admit all who apply. Check the course description for the maximum class size. Within a week and a half (or 1.5 weeks) after the registration period is over, all OLLI members will receive an email notification with details about the courses they are registered in. You can also log in to your Lifelong Learning Extended Education (LLEE) account (formerly Destiny One) to view this information. For instructions on how to check your course registrations, please refer to the section above titled \"How to Look Up What OLLI Courses You Are Registered In.\" If there are remaining spots in any courses, they will be made available on our \"Course Registration\" page on a first-come, first-served basis. If you’re interested in a course not listed, you can email olli@temple.edu to inquire about any recently vacated spots. For instructions on how to register for courses, please see the section above titled \"How to Register for Courses.\" If you have any questions or need assistance, please email olli@temple.edu, and we will be happy to help."
}