{
  "url": "https://www.psychologytoday.com/us/basics/sex",
  "title": "Sex | Psychology Today",
  "text": "The Fundamentals of Sex From attraction to action, sexual behavior takes many forms. As pioneering sex researcher Alfred Kinsey put it, the only universal in human sexuality is variability itself. Human interest in sex can be thought of as a built-in imperative: Survival of the species depends on it. And although sexual desire tends to wax and wane over the course of one's life, depending on external demands and relationship satisfaction, it often serves as a passport to bonding, intimacy, pleasure, and even human growth and healing. People engage in sexual activity for many reasons: To feel alive, to maintain a vital aspect of human functioning, to feel desirable or attractive, to achieve closeness, or to please a partner they love. Sex can be one of the most difficult subjects for a couple to discuss: Bodies and interests change over time, and most people will experience some type of sexual problem at some point in life. Therefore, open communication is essential to intimacy and long-term satisfaction. To learn more, see Human Sexuality and Core Questions About Sex. How Does Desire Emerge? Sexual desire involves both biology and psychology, can be unpredictable, and can manifest very differently in men and in women. For men, arousal typically precedes desire. But for women, desire often precedes arousal, in response to physical intimacy, emotional connection, and an atmosphere free of distraction. Researchers studying human desire explore the interplay of biological influences such as neurohormones and psychological influences such as emotions and relationship factors. Smell often plays a subtle role in attraction; research shows that women are attracted to mates whose natural body odor, or pheromones, signals a genetic profile distinct from their own. Low sexual desire is common among both men and women but it can often be resolved within couples by addressing conflicts, more consistently exchanging affection and conversation outside the bedroom, and making sufficient time for sex. To learn more, see Sexual Attraction and Desire and How Men and Women Think About Sex. The Pleasure of Sex The pleasure of sex arises from factors including the release of neurochemicals such as oxytocin and dopamine, and the sense of connection expressed through touching, massaging, and cuddling. There is no one way to be sexual, and there is enormous variation in the activities that people find arousing. Men are especially stimulated by visual imagery: About 90 percent of young men report using pornography with some regularity. Many couples today engage in behaviors that were once perceived as atypical, including dominance play and anal intercourse. Researchers now understand that flexibility in sexual repertoires is healthy and generally enhances relationships. Clinicians regard specific behaviors as problematic only when they create harm or distress for one or both partners or when the behavior is compulsive—that is, when it becomes the only means of arousal. \"Sex addiction\" is a label often used to suggest an excessive or pathological interest in sex, but it is not a recognized clinical diagnosis and studies show that this perception tends to be tied more to an individual's moral or religious outlook than to their actual sexual practice. To learn more see Arousal, Orgasm and Post-Coital Behavior and Hookups and Casual Sex. How Does Sex Change Over the Lifespan? Sexual behavior changes over time, and the trajectory of change may vary between men and women. Young women may have difficulty navigating cultural attitudes about sexual behavior and promiscuity as they begin to explore their sexuality, but age tends to bring confidence and greater skill at communicating their needs and desires. Young men often have concerns about performance, penis size, or premature ejaculation. Anxiety is a threat to performance for either men or women. Couples tend to report that their sex life is most robust in their 30s and 40s, but sex is often most deeply rewarding for older partners. People can enjoy satisfying sex throughout the lifespan if they make adjustments for the many changes that time brings, such as relying less on penile penetration and more on massage, whole-body touching, and oral sex. To learn more, see Sex in Long-Term Relationships and Sexual Concerns. What Are the Different Sexual Disorders? A wide variety of behaviors, preferences, and quirks are recognized as part of healthy sexual activity. A sexual behavior becomes a disorder, however, when it leads to significant distress, threatens to harm others, or becomes compulsive. There is a range of clinically recognized sexual disorders. Erectile disorder, also called erectile dysfunction, is a chronic inability to get or to maintain an erection. Orgasmic disorder may be diagnosed when a woman is not able to reach orgasm, and genito-pelvic pain or penetration disorder refers to the experience of extreme pain during penetrative sex. And paraphilias such as pedophilia and fetishistic disorder are present when a person’s sexual arousal depends on fantasizing about or engaging in disturbing or extreme sexual behavior. For more information, see Sexual Disorders and the Diagnosis Dictionary."
}