{
  "url": "https://kronenbourg.com/lentreprise/",
  "title": "L'entreprise » Brasseries Kronenbourg » Brasseries Kronenbourg aujourd'hui « L'entreprise Kronenbourg SAS, brasseur depuis 1664",
  "text": "1 bière sur 4 consommée en France est produite à Obernai salariés à Obernai, Boulogne-BIllancourt et dans toute la France de parts de marché volume Nous brassons des bières aux saveurs et aux goûts très diversifiés, rassemblant hommes et femmes. Faire de la diversité des bières autant de moments de partage : telle est notre raison d’être. Nos maîtres-brasseurs, nos techniciens et opérateurs, nos équipes marketing et commerciales, tous nos collaborateurs sont mus par la passion de leur métier : faire découvrir et apprécier la bière. Ils écoutent les consommateurs, sondent leurs envies et leurs aspirations afin d'anticiper les nouvelles tendances. C’est ainsi que des formats aux contenants, des saveurs aux arômes, nous innovons sans cesse pour le confort et plaisir des amateurs de bières. En 2011, nous avons été l'une des toutes premières entreprises à se voir décerner le label Origine France Garantie pour nos marques Kronenbourg et 1664*. Ce label assure que la production principale a lieu en France avec au moins 50% de la valeur ajoutée acquise dans l’Hexagone. Nous produisons en effet quasiment 100% de nos bières à Obernai et 80% de l’orge que nous utilisons provient du nord-est de la France. Depuis cette date nous nous sommes assuré de garder ce label origine France. Nous sommes convaincus que notre pérennité est liée à la détermination que nous avons toujours eue de créer de la valeur pour la société dans son ensemble et d’exercer notre métier en préservant la nature. Conviction partagée par le Groupe Carlsberg qui, depuis 140 ans, grâce à l’action de sa Fondation, soutient des projets d’intérêt général dans le domaine de la Science et des Arts. À travers nos pratiques responsables, nous visons un développement durable qui se décline en 5 axes : *Sauf les dernières innovations Kronenbourg 1947, 1664 BIO non filtrée et 1664 Créations Houblon"
}