{
  "url": "https://en.wikipedia.org/wiki/Tatra_(company)",
  "title": "Tatra (company) - Wikipedia",
  "text": "Tatra (company) Tatra is a Czech vehicle manufacturer from Kopřivnice. Owned by the TATRA TRUCKS a.s. company, it is the third oldest company in the world producing motor vehicles with an unbroken history.[a][1] The company was founded in 1850 as Ignatz Schustala & Cie. In 1890, it became a joint-stock company and was renamed the Nesselsdorfer Wagenbau-Fabriksgesellschaft. In 1897, the Nesselsdorfer Wagenbau-Fabriksgesellschaft produced the Präsident, which was the first factory-produced automobile with a petrol engine to be made in Central and Eastern Europe. The First Truck was made a year later, in 1898. In 1918, the company was renamed Kopřivnická vozovka a.s., and in 1919 it changed from the Nesselsdorfer marque to the Tatra badge,[2] named after the nearby Tatra Mountains on the Czechoslovak-Polish border (now on the Polish-Slovak border). In the interwar period, Tatra came to international prominence with its line of affordable cars based on backbone tube chassis and air-cooled engines, starting with Tatra 11 (1923). The company also became the pioneer of automotive aerodynamics, starting with Tatra 77 (1934). Following the 1938 German-Czechoslovak war and Munich Agreement, the town of Kopřivnice was occupied by Nazi Germany and Tatra's manufacturing capacity was directed towards military production. Trucks like Tatra 111 (1942) became instrumental both for the German Nazi war effort as well as post-war reconstruction in Central Europe and Soviet Union. Today, Tatra's production focuses on heavy, off-road trucks based on its century-long development of backbone chassis, swinging half-axles, and air-cooled engines. The core of its production consists of the Tatra 817, intended primarily for military operators,[3] and the Tatra Phoenix (Tatra chassis with DAF cabin and Paccar water-cooled engine), aimed primarily for the civilian market. In 2023, the company plans to produce over 2,000 trucks.[4] Early years [edit]In 1850, Ignaz Schustala founded \"Ignatz Schustala & Cie\" in Kopřivnice, and the company entered the business of manufacturing horse-drawn vehicles. In the 1880s, the company began manufacturing railroad cars.[citation needed] In 1890, the company became a joint-stock company, and was renamed the Nesselsdorfer Wagenbau-Fabriksgesellschaft. Also that year, Hugo Fischer von Röslerstamm became the company's technical director. After Schustala died in 1891, von Röslerstamm took over the management of the business. In 1897, the company began the creation of an automobile with an internal combustion engine.[5] Using a Benz automobile purchased by von Röslerstamm as inspiration, the company built its first car, the Präsident, under the direction of engineers Hans Ledwinka and Edmund Rumpler. The Präsident was exhibited in Vienna later that year.[6] The company began taking orders for cars, and between 1897 and 1900, nine improved cars based on the Präsident were made.[7] The first car to be completely designed by Ledwinka was the Nesselsdorf A , which was produced in 1900. The Nesselsdorf A was equipped with a rear-mounted 2714 cc engine, and had a top speed of 40 km/h (25 mph). 22 units were built. The Nesselsdorf A was followed in 1902 by the Type B, which featured a central engine. Ledwinka then left the company to concentrate on steam engine development. He returned in 1905 and designed a completely new car, the Type S, which was equipped with a 3308 cc 4-cylinder engine. In 1912, production was badly affected by a strike that lasted 23 weeks, and von Röslerstamm left the company. In 1916, Ledwinka left the company again, this time to work for one of its competitors, Steyr-Werke in Graz.[8] Tatra concept [edit]In 1919, the company began using the Tatra brand for its cars. In 1921, the company was renamed \"Kopřivnická vozovka\". That year, the company's director, Leopold Pasching, convinced Ledwinka to return to the company to run its new car plant.[8] Ledwinka's next design, the Tatra 11, which was released in 1923, featured a rigid backbone tube with swinging semi-axles at the rear, giving independent suspension. The Tatra 11 was fitted with a front-mounted, air-cooled 1056 cc two-cylinder engine. In 1924, the company was renamed \"Závody Tatra\". The Tatra 17, released in 1925, featured a 1930 cc water-cooled six-cylinder engine, and fully independent suspension. In 1926, the Tatra 11 was succeeded by the Tatra 12, which was similar to the Tatra 11, but was equipped with four-wheel brakes. In 1927, the company was renamed \"Ringhoffer-Tatra\". Prewar streamliners [edit]Tatra's specialty was luxury cars using the most recent technology, going from air-cooled flat-twins to fours and sixes, culminating (briefly) with the OHC 6-litre V12 in 1931.[9] In the 1930s, under the supervision of Austrian engineer Hans Ledwinka, his son Erich and German engineer Erich Übelacker, and protected by high tariffs and absence of foreign assemblers,[10][11] Tatra began building advanced, streamlined cars after obtaining licences from Paul Jaray, which started in 1934 with the large Tatra 77, the world's first production aerodynamic car.[12][13] The average drag coefficient of a 1:5 model of the fastback Tatra 77 was recorded as 0.2455.[14] It featured (as did almost all subsequent big Tatras) a rear-mounted, air-cooled V8 engine.[15] Tatra and the conception of the Volkswagen Beetle [edit]Both Adolf Hitler and Ferdinand Porsche were influenced by the Tatras.[16] Hitler was a keen automotive enthusiast, and had ridden in Tatras during political tours of Czechoslovakia.[10][16] He had also dined numerous times with Ledwinka.[16] After one of these dinners Hitler remarked to Porsche, \"This is the car for my roads\".[10][16][17] From 1933 onwards, Ledwinka and Porsche met regularly to discuss their designs,[18] and Porsche admitted \"Well, sometimes I looked over his shoulder and sometimes he looked over mine\" while designing the Volkswagen.[16][17] There is no doubt that the Beetle bore a striking resemblance to the Tatras, particularly the Tatra V570.[16] Like the Beetle, the Tatra 97 of 1936 had a rear-located, rear-wheel drive, air-cooled four-cylinder boxer engine accommodating four passengers and providing luggage storage under the front bonnet and behind the rear seat. Another similarity between this Tatra and the Beetle is the central structural tunnel. Tatra launched a lawsuit against Volkswagen for patent infringement, but this was stopped when Germany invaded Czechoslovakia. At the same time, Tatra was forced to stop producing the T97. The matter was reopened after World War II, and in 1965 Volkswagen paid the Ringhoffer family DM 1,000,000 in an out-of-court settlement.[19] Tatra and Volkswagen's body design were preceded by similar designs of Hungarian automotive engineer Béla Barényi, whose sketches resembling the Volkswagen Beetle date back to 1925.[20] War years [edit]After the 1938 invasion of Czechoslovakia by Nazi Germany, Tatras were kept in production, largely because Germans liked the cars. Many German officers died in car accidents caused by driving the heavy, rear-engined Tatras faster around corners than they could handle. At the time, as an anecdote, Tatra became known as the 'Czech Secret Weapon' for the scores of officers who died behind the wheel; at one point official orders were issued forbidding German officers from driving Tatras.[10][21] Tatra was instrumental in the production of trucks and tank engines for the German war effort.[citation needed] Postwar management [edit]The factory was nationalised in 1945, almost three years before the Communist Party came to power, and in January 1946 was renamed \"Tatra Národní Podnik\". Although production of prewar models continued, a new model, the Tatra 600 Tatraplan was designed—the name celebrating the new Communist planned economy and the aeroplane inspiration (Colloq. Czech: aeroplán). It went into production in 1948. In 1951, the state planning department decided that the Tatraplan should henceforth be built at the Škoda plant in Mladá Boleslav, leaving Tatra free to concentrate on trucks, buses, and railway equipment. The Tatra 603 [edit]In 1953, amid much dissatisfaction among Communist party leaders with the poor-quality official cars imported from Russia, Tatra was again permitted to produce a luxury car, the Tatra 603.[22] Much like Tatra's prewar cars, it was driven by a rear-mounted, air-cooled V8 and had the company's trademark aerodynamic styling. The Tatra 603 initially featured three headlights, and the first prototypes had a central rear stabilising fin, though this feature was lost on production vehicles. It was also fitted with almost American-style thick chrome bumpers with bullets (a.k.a. Dagmar bumpers). Almost entirely hand-built, Tatras were not available for normal citizens as they were not permitted to buy them.[citation needed] The cars were reserved for the Communist Party elite and industrial officials,[23] as well as being exported to most other communist nations as official state cars. Notably, Cuban President Fidel Castro had a white Tatra 603, custom-fitted with air conditioning. Tatra 603s were built until 1975, a twenty-year reign as one of communism's finest cars. Numerous improvements were made during its production run, although not all vehicles built were actually new but rather reconditioned. In exchange for a newer model year car, the older vehicle was returned to the factory. There, it was upgraded to current model year specifications, refinished, and sent out again as a putatively new vehicle to replace another older T603. This makes it difficult to trace the history of surviving vehicles. [24] 1970s makeover—the Tatra 613 [edit]In 1968, a replacement was developed: the Tatra 613. It was styled by the Italian styling house of Vignale and was a more modern, less rounded shape. It was not until 1973 that the car went into production, and volume production did not begin until the following year. Although the layout remained the same, the body was all new, as was the engine, which was equipped with four overhead camshafts, a higher capacity motor (3495 cc) and an output close to 165 bhp (123 kW; 167 PS). In addition, it had been moved somewhat forward for improved balance. These cars were built in five series and went through several modifications until production ceased in 1996. Over 11,000 cars were built, and sales slowed to a trickle of just a few dozen per year towards the end of production as Tatras began to seem more and more outdated. 1990s Tatra 700 [edit]The Tatra 700 was a large luxury car released in 1996 by Tatra. It was essentially a heavily restyled version of the Tatra 613 model it replaced, with updated body panels and detailing. The T700 was offered as both a saloon and coupé with either a 3.5 or 4.4 litre 90° air-cooled V8 petrol engine. The model was neither successful nor produced in large numbers, with a total of 69–72 cars manufactured. The T700 was the last passenger car made by Tatra, with production halting in 1999. At this point, Tatra abandoned automobile manufacturing to concentrate on truck design and manufacture. 1990s Tatra MTX V8 [edit]The Tatra MTX V8 was the fastest Czech car of all time. Production started in 1991 in Kopřivnice. It has a Tatra 623 V8 engine with inlet manifold injection producing 225 kW at 6500 rpm. It accelerates from 0–100 km/h (62 mph) in 5.6 seconds. The top speed is 265 kilometres per hour (165 mph). The Czech designer Václav Král designed this vehicle, with only five ever produced. 2000s [edit]In February 2008, Tatra announced the world's first and only air-cooled engine meeting the then forthcoming Euro 5 emissions standards. The press release claims 7.5 times lower emissions of particulates and 3.5 times lower emissions of nitrogen oxides compared to the previous engine. Further, production of air-cooled engines should significantly reduce the production of greenhouse gases due to the absence of liquid cooling systems. All Tatra vehicles from February 2008 onwards should use the new engine.[25] A month later, Tatra CEO Ronald Adams told The Prague Post Tatra could return to producing passenger cars, saying: \"We would not come back to compete with the large automobile mass producers such as Volkswagen, Škoda, Toyota etc. But we might come back with a replica of the old Tatra cars using a current undercarriage and driveline from one of the major automotive producers.\"[26] The company has launched a feasibility study, hoping to produce one thousand replicas of their legendary Tatraplan and 603 cars in 2010.[27] In July 2008, pictures of a fuel cell concept car designed by Mike Jelinek, the Tatra 903, were shown.[28] A Tatra 87 is on exhibit at the Minneapolis Institute of Arts.[29] Trucks [edit]1898–1914 beginning [edit]The first truck manufactured at Kopřivnice in 1898[30] was a flatbed[31] with two liquid-cooled side-by-side-mounted two-cylinder Benz engines each at 2.7 L capacity with total power output of 8.8 kW (12 hp) placed after the rear axle and cargo capacity of 2.5 ton. The unique feature of the engine setup was that the engines could be operated sequentially depending on the load requirements. No. 1 engine was started via a cranking handle and had a flywheel attached, and No. 2 engine, without the flywheel, was connected via a gear clutch and started by the first engine already running. The second truck manufactured was once again a flatbed R type of 2.5 ton cargo capacity built in 1909. Powered by a liquid-cooled petrol four-cylinder engine of 4.1 L capacity and power output of 18.4 kW (25 hp) with the engine placed above the front axle, which is the conventional design to this day. The vehicle featured solid rubber tyres and semi-elliptic leaf spring suspension. In 1910, Tatra manufactured its first bus, the Omnibus type SO, with a total production of five units. 1914–1922 serial production [edit]The first true serial truck production at Tatra was instigated by the beginning of World War I. In the year 1914, there were only two trucks made, type T 14/40 HP; however, by 1915's end, the production jumped to a total of 105 TL-2 units, and the following year, 1916, the numbers rose to a total of 196 TL-2 and 30 TL-4. Production peaked in 1917 with 19 TL-2 and 303 TL-4 models, but then production declined, and a similar number of vehicles of one type manufactured in a year was not achieved or surpassed until 1936 with the T 27 model. Technically, models TL-2 and TL-4 were almost identically designed; in fact, TL-4 evolved from TL-2, where both had liquid-cooled OHC engines of max power output of 25.7 kW (35 PS; 34 hp). The TL-2 had a GVM 2,100 kg (4,630 lb) and 4,000 kg (8,818 lb) GCM, TL-4 had 2,700 kg (5,952 lb) GVM and 6,700 kg (14,771 lb) GCM respectively. Both types remained in production in small series until 1927. The TL-4 is considered the first truck to come out of NW (Nesselsdorfer Wagenbau) to carry the name Tatra in 1919.[32] 1923–1938 Tatra concept [edit]After the introduction of Tatra 11 and Tatra 12 cars with their distinctive backbone tube design and swing axles, Tatra introduced its first truck on the same basis,[33] the light utility Tatra 13 powered by 2-cylinder air-cooled petrol engine with power output 8.8 kW (12 hp) and 1,000 kg (2,205 lb) cargo capacity. Further models followed, and in 1926, T23 and T24 were introduced, nicknamed \"bulldogs\", which could be considered Tatra's precursors to COE designed trucks. Improved version T13 was introduced as T26 with a more powerful 4-cylinder flat air-cooled engine and in six-wheeler chassis created capable offroad light utility truck which later evolved into T72 model which was heavily used by the Czechoslovak Army at the time and was also manufactured under license by the French company Lorraine-Dietrich. In 1933, Tatra built a limited series of T25 heavy artillery tractors with 4 and 6-cylinder petrol engines. The most popular Tatra truck before World War II was type T27 powered by 4-cylinder petrol or diesel engines, which remained in production for nearly 17 years (1930–1947) with total production of 7,620 units.[34] By adding an extra axle to the rear, the type T28 was created; however, it was not successful and only limited production resulted in a mainly bus chassis. In the period from 1931 to 1938, Tatra also built a small utility truck based on the chassis from T30 named Tatra T43 which remained popular with small business owners. T72 model successfully continued the line to T82 built mainly for military in cargo and personnel transport between 1935 and 1938 and further to T92 and T93 built for the Romanian army from 1938 to 1941 which were identical except T93 had also a driven front axle.[35] 1939–1956 World War II and beyond [edit]Following the Nazi occupation of Czechoslovakia, the production at Kopřivnice was annexed by the Germans for the supply of trucks needed by the Wehrmacht. Apart from the existing line-up of T27, T92/92, a new heavy truck, the T81, commenced production featuring a liquid-cooled 12.5 L V8 diesel engine with a power output of 118 kW (160 PS; 158 hp), in 6×4 axle configuration. This vehicle evolved in 1942 into the T111 which continued in production until 1962, with a total of 33,690 units made.[36] The T111 also featured Tatra's first air-cooled diesel engine, a massive V12 originally designed for the armoured Sd.Kfz. 234 Puma. In the latter stages of World War II, Tatra was instrumental in the development of air-cooled diesel engines for German tanks. In late 1944, General Heinz Guderian ordered that production of the Type 38(t) Hetzer tank be modified to incorporate a Tatra Type 928 V-8 air-cooled diesel engine, though this order was delayed so production could continue uninterrupted. After the war, the T111 contributed heavily to the rebuilding effort in Central and Eastern Europe, and a memorial was built at Magadan, Siberia, for its exploits in the Far East of the USSR.[37] 1957–1982 moving forward [edit]The decision to replace the reliable but ageing T111 was taken in 1952 based on central planning economy of socialist government where directive was made to Tatra N.P. that it should concentrate on the manufacture of 7 to 10 ton capacity commercial vehicles and in 1956 first T137 and T138 trucks were exhibited at the Czechoslovak machinery expo in Brno. Production of the T111 continued alongside the T138 series until 1962. The T138 itself continued in production until 1969 when it was replaced by the T148, which provided an increase in power output, reliability, and product improvements. In 1967, Tatra began production of the T813 off-road truck using its modular construction technology; the model incorporated the latest trends in commercial vehicle design, such as cab-over-engine (COE) and wide profile tyres. It featured a new V12 engine, and all military versions had a central tyre inflation/deflation system as standard equipment. The T813 was designed to tow loads up to 100 tons GCM, and it was a familiar sight on the roads in Czechoslovakia hauling large, often oversized loads. 1982–2008 T815 and beyond [edit]The Tatra 815 was designed for extreme off-road conditions, and its road versions are derived from the off-road original. After the 53rd session of the Council for Mutual Economic Assistance, a directive was issued that Tatra N.P. would be the sole supplier of off-road commercial vehicles of <12 ton capacity for Eastern Bloc countries, leading to a modernization of the company and its production models. Following extensive testing at different sites, including Siberia, the type T815 was introduced in 1982, with production starting in 1983. The T815 was made of 142 main assembly components as opposed to the 219 main assembly components of its predecessor.[38] The engine's power output was increased by up to 45% and a new COE tiltable cabin was introduced. Modular engine designs resulted in offerings of V8, V10, or V12 engines with or without a turbocharger. T815 was upgraded to T815-2 with minor cosmetic changes and improved ergonomics and safety – the biggest change was the engine emissions accordance with the \"Euro0\" limits and to Euro I limits in 1993 (turbocharged V8 engine only since this time for the full legislation; the Deutz 513 air-cooled V8 engine was offered as an alternative). The TerrNo1, introduced in 1997,[39] featured a redesigned cabin as well as better sound and heat insulation than the previous models. The TerrNo1 was based on the same frame as the previous models, so its cabin could be retrofitted to all type T815s built since 1993.[40] In 2000, the TerrNo1 cabin was again redesigned, and for the first time, there was an option to fit liquid-cooled engines. The TerrNo1 model introduced the 'KingFrame rear axle suspension setup. Another step in evolution for the T3B engine came with the Euro II emission limits. Following further improvements in 2003, the T815 had the new Euro III T3C V8 engine mated to all new 14-speed range+split gearbox as well as an option for engines from other suppliers such as Caterpillar, Cummins, Detroit Diesel, Deutz and MTU to be fitted. In September 2006, Tatra introduced its Euro IV compliant turbocharged T3D engine with the SCR exhaust technology, and in February 2008, the company introduced the world's first Euro V-compliant air-cooled diesel engine based on the T3D engine.[41] The T816 (T815-6) Armax[42] and Force[43] series, derivatives of Tatra 815, were introduced in 1993 after Tatra participated in the tender process to supply heavy duty off-road trucks to the UAE armed forces. After two years of bidding, the company secured a contract worth $180 million.[44] The resulting model became known as T816 \"LIWA\" (Arabic for \"desert\").[45] The 2008 model intended for military customers is the T817 (T815-7),[46][47] marketed primarily toward the armed services of NATO member countries as a high-mobility heavy-duty tactical truck with a low profile cabin for C-130 Hercules transportability. During the 1990s, Tatra decided to produce a bonneted CBE heavy-duty off-road truck to continue the successful line started with the T111. This resulted in the T163 Jamal, which was put into full production in 1999[48] after the first prototypes were built in 1997 and following extensive testing. The T163 was purpose-built to be a heavy-duty dump truck due to demand, and was based on Tatra's signature backbone tube chassis construction with its cabin being designed by Jiří Španihel.[49] The truck is used mainly on construction sites and in quarries. Tatra was also a successful bidder for the Czech Army replacement of aging Praga V3S (with the Tatra I6 air-cooled engine – one half of the T111 V12 one) medium off-road truck with T810 which technically is not a \"genuine\" Tatra as its origin goes back to when former Czech company ROSS, in partnership with Renault Trucks, obtained a contract to supply the army with medium size off-road trucks, the \"ROSS R210 6×6\". The company, however, went bankrupt in 1998, and Tatra bought full rights to the design, then modernized and reintroduced it as T810 while continuing cooperation with Renault.[50] Under the deal Renault supplies the cabins and the engines and Praga supplied axles and transmissions for the prototypes; however, the whole project has been dogged by controversy due to the way Tatra had obtained the contract, its relationship with supplier Praga and the subsequent court case brought against it by Praga.[51] The serial T810 vehicles are equipped with the new design Tatra rigid axles with the WABCO disc brakes, with the ZF Ecolite transmission and Steyr drop box. Navistar and Tatra [edit]Tatra and Navistar Defence introduced at Eurosatory Exposition in Paris, France (Jun 14–18, 2010), the results of their strategic alliance since October 2009, the models ATX6 (universal container carrier) and ATX8 (troop carrier).[52] The vehicles appear to be based on Tatra 815-7 (T817) 6×6, 8×8 chassis,[53] suspension and cabins while using Navistar engines and other components.[54] Under the deal Navistar Defence and Tatra A.S. will market the vehicles in North America, which includes sales to the United States military and foreign military sales financed by the United States government. Tatra will source parts and components through Navistar's global parts and support network for Tatra trucks delivered in markets outside of North America, as well as market Navistar-Tatra vehicles around the world in their primary markets.[citation needed] Ownership [edit]The Terex Corporation, an American company, acquired the majority ownership (71%) of Tatra in late 2003.[55] As of late 2006, however, majority ownership (80.51%) was in the hands of Tatra Holdings s.r.o., an international consortium comprising Vectra Limited of the UK, Sam Eyde of the U.S., KBC Private Equity of Belgium, Meadowhill s.r.o. of the Czech Republic, and Ronald Adams of the U.S. On 15 December 2006, a contract was signed between Tatra and the Czech Republic for 556 trucks at roughly $130 million, or 2.6 billion Czech crowns. This contract was signed instead of the replacement of older military vehicles. In April 2007, Tatra announced that it had already matched its production in 2006 and produced 1,600 vehicles. In 2007, Tatra planned to produce between 2,300 and 2,500 vehicles. In contrast to previous years, Tatra has increased employment by the hundreds within the past two quarters, has reversed previous errors, and was growing again.[citation needed] In August 2011, DAF Trucks announced it had built up a 19% stake in Tatra to tighten up cooperation between the companies.[56] DAF's cabs and Paccar engines became the mainstay of the civilian Tatra 158 Phoenix, while DAF dealerships started selling Tatra trucks.[57] In early 2013, Tatra was facing mounting financial problems. Even though the company had sufficient orders for new trucks, manufacturing was halted as banks refused to provide further loans, and the company was facing imminent bankruptcy. In March 2013, the majority stake in Tatra was acquired by major Czech defense contractor Czechoslovak Group and Czech metallurgy company Promet Group, which provided the company with necessary financial stability. With new owners, Tatra focused its production primarily towards building specialist vehicles tailored to buyers' custom orders. While in 2013 sales amounted to 722 units, in 2023 the company plans to sell over 2,000 trucks, with future increases in sales requiring enlarging of manufacturing capacity.[58] Current models [edit]Tatra is known as a heavy-truck maker.[59] It mostly supplies individual, highly specialized custom-made vehicles and also sells just the backbone chassis for use in other manufacturers' trucks or specialized vehicles.[60] The current serial production models are: - Tatra 810 Tactic – medium off-road truck based on conventional frame, portal axles, and equipped with a Renault water-cooled engine and cabin. Primarily intended for military operators, also offered on the civilian market. - Tatra 817 Force – heavy off-road truck based on Tatra backbone chassis, Tatra air-cooled engines (other engines also possible) and Tatra cabin. Primarily intended for military operators, also offered on the civilian market. - Tatra 158 Phoenix – heavy off-road truck based on Tatra backbone chassis and equipped with DAF cabin and ZF water-cooled engines. Primarily intended for civilian operators, also offered on the military market. Worldwide distribution [edit]Germany [edit]Several fire brigades and civil protection (THW), mostly in eastern Germany, are traditionally using Tatra trucks. Tatra's own conversion company, THT, builds vehicles for fire brigades and civil protection. Popular in Germany is a large Water tender and pumper based on the Tatra 815.[citation needed] The vehicle's water tank has a volume of 4,000 liters or more and a separate tank for foam agent. The 4×4 transmission and a gear wading depth of 1.20m make it suitable for rough terrain. In German use, the vehicle is called \"TLF4000\" (Tanklöschfahrzeug 4000) and is primarily used at airports and to fight forest fires.[61] In 2021 the Bundeswehr fire brigade ordered 76 Tatra firefighting vehicles to fight forest fires (ordered by BwFuhrparkService GmbH). They are based upon the Tatra T 815-7 4×4 chassis, with equipment by Austrian Rosenbauer Group.[62] India [edit]Tatra had a truck-building joint venture in India called Tatra Vectra Motors Ltd, formerly called Tatra Trucks India Ltd. It is a joint venture between Tatra and the Vectra Group from England.[63] In 2002, the company received a 1,070-truck order from the Government of India.[64] Tatra's growing involvement in India's defense industry has been cited as an example of growing relations between the Czech Republic and India.[65] In 2009, Vectra announced a new joint venture with Russia's Kamaz to form Kamaz Vectra Motors Limited to manufacture Kamaz trucks in India.[66][67] This joint venture replaced the former Tatra Vectra venture.[66] The manufacturing plant is located in Hosur, Tamil Nadu. The fully integrated manufacturing facility includes an engine assembly and testing plant, a cabin welding shop, a frame fabrication shop, and a test track. Most Tatra trucks for sale in India are manufactured in collaboration with Bharat Earth Movers Limited (BEML).[68] Tatra was part of a 2012 investigation in what has been described a \"procurement scam\" involving former BEML chief VRS Natarajan.[69] - Tatra Recovery Vehicle of the Indian Army - A Tatra Truck at India Gate, New Delhi, on India Republic Day on 26 January - Indian Army Tatra truck carrying BM-30 Smerch rocket Israel [edit]Reportedly, following one of the Israeli-Arab conflicts, Israel tested some Tatras captured from the Egyptian armed forces. The Israel Defense Forces' command was apparently quite impressed with their performance, independent air cooling, and their capabilities as military trucks in long-range raiding operations in desert terrain, and became interested in including these trucks in their arsenal. As direct purchase from Czechoslovakia was impossible due to its alignment with Israeli foes, the lore has it that Israelis used the well-paid services of Nicolae Ceauşescu-led Romania, in cooperation with an American Company called ATC (American Truck Company) to purchase military trucks, including desert-equipped Tatras, leading to jokes that \"Romania has a new desert\". Current photos of various Israeli weapon systems, including SPYDER slated for India, show new Tatras as the carrier vehicles.[citation needed] A number of Tatra trucks entered service in the Israeli Army's various sectors, with the brand mark of \"American Truck Company\", under which Tatras were sold from the U.S. market and exported to Israel. United States [edit]American Truck Company was a quasi-independent company set up by Terex, when they controlled Tatra, to import Tatra vehicles in both knock down kits or fully built and carry out assembly operations, repair and service, body building on chassis in the United States.[70][71] These trucks were offered to the military and other government organizations and were badged and sold in the United States under the ATC brand.[71] ATC badged Tatras were fitted with American Cummins turbodiesel engines in place of the Tatra's air-cooled diesel.[71] Tatra aircraft [edit]The Ringhoffer-Tatra Works Ltd. produced several aircraft and aero-engines in the 1930s and 1940s before annexation by Germany, and after under the orders of the RLM. Among the aircraft produced were the following:[72]- Built under licence [edit]- Tatra T.126 (Avro 626 Avian) - Tatra T.131 (Bücker Bü 131 Jungmann) Tatra designed and built [edit]Historic models [edit]Passenger cars [edit]Before the company was renamed to Tatra [edit]- NW Präsident (1897) - NW Präsident II (1898) - NW Elektromobil (1900) - NW A (1900–1902) - NW B (1902–1904) - NW C (1902–1905) - NW D (1902–1905) - NW E (1904–1906) - NW F (1906) - NW J (1906–1911) - NW L (1906–1911) - NW S (1906–1911) - NW T (1914–1919) - NW U (1915–1919) After the name Tatra was adopted [edit]- Tatra 10 (1919–1927, renamed from NW U) - Tatra 11 (1923–1927) - Tatra 12 (1926–1934) - Tatra 17 (1925–1929) - Tatra 20 (1919–1926, renamed from NW T) - Tatra 30 (1926–1931) - Tatra 31 (1928–1930, based on the T17) - Tatra 52 (1931–1939) - Tatra 54 (1931–1934) - Tatra 57 (1931–1948) - Tatra 70 (1931–1936) - Tatra 75 (1934–1942) - Tatra 77 (1934–1938) - Tatra 80 (1930–1937, based on the T70) - Tatra 87 (1937–1950) - Tatra 97 (1937–1939) - Tatra 107 (1946; initial designation for the T600) - Tatra 600 Tatraplan (1948–1952) - Tatra 603 (1956–1975) - Tatra 613 (1974–1996) - Tatra 623 (1980–1998) - Tatra 700 (1996–1999) Trucks [edit]- NW First Truck (1898) - NW O (1907–1909) - NW R (1908) - NW K (1909–1911) - NW M (1909–1911) - NW SO (1910–1914) - NW TL-2 (1915–1924) - NW TL-4 (1916–1924) - NW TO (1920–1928) - Tatra 13 (1925–1933) - Tatra 22 (1934–1935, derived from the T27) - Tatra 23 (1927–1933, first Tatra truck with a backbone frame) - Tatra 24 (1929–1939, three-axle version of T23) - Tatra 25 (1928, 1933–1934) - Tatra 26 (1926–1933) - Tatra 27 (1930–1947) - Tatra 28 (1932, three-axle version of T27) - Tatra 43 (1929–1938) - Tatra 49 (1929–1930) - Tatra 72 (1933–1937) - Tatra 74 - Tatra 79 - Tatra 81 (1939–1942, predecessor of T111) - Tatra 82 (1935–1937) - Tatra 85 (1936–1941) - Tatra 92 (1938–1940, developed from T82) - Tatra 93 (1937–1941) - Tatra 98 - Tatra 111 (1942–1962) - Tatra 114 (1947–1948, developed from the T27) - Tatra 115 (1948–1949, T114 development) - Tatra 128 (1951–1952, T111 derivative) - Tatra 138 (1959–1971) - OT-64 SKOT Tatra engine powered 8×8 armored personnel carrier - Tatra 141 (1957–1970, tractor-trailer version of T111) - Tatra 147 (1957–1961, shortened version of T111) - Tatra 148 (1972–1982, improved T138) - Tatra 158 Phoenix (2011–present) - Tatra 163 Jamal (1999–2014) - Tatra 805 (1953–1960) - Tatra 809 (1953) - Tatra 810 ANTS (2008–present) - Tatra 813 (1967–1982) - Tatra 815, 815-2 and TerrNo1 (1983–2025) - Tatra 816 (1996–present) - Tatra 817 (2008–present, developed from the T815) Buses [edit]- Tatra 500 HB (1950–1957) Trolleybuses [edit]Railcars [edit]- Tatra 14 (1925–1968, self-propelled freight trolley) - Tatra 15 (1927–1932, railcar with T57 body) - Tatra 16 (1926, small freight railcar with van body) - Tatra 18 (1925–1926, armored version of T14) - Tatra 19 Prototypes and racing cars [edit]- NW Rennzweier (1900) - NW Second Truck (1909) - NW T14/40 (1914) - Tatra 12 Targa Florio (1925) - Tatra 30 Sport (1926) - Tatra 34 (prototype armored car based on T31) - Tatra 84 (1935, first all-wheel-drive Tatra) - Tatra 90 (1935) - Tatra 112 - Tatra 113 - Tatra 116/117/120 (1948) - Tatra 118/119/122 (1948) - Tatra 130 (1951, three-axle version of T128) - Tatra 131 (1951, T128 with dual rear wheels) - Tatra 137 (1956, two-axle version of T138, produced as the T138 4x4) - Tatra 157 (1972; intended to replace the T148 but became the T815) - Tatra 162 (1987) - Tatra 163 Jamal Evo (2003) - Tatra 201 (1947) - Tatra 600 Diesel (1952) - Tatra 601 Convertible (1951) - Tatra 601 Monte Carlo (1949) - Tatra 602 Tatraplan Sport (1949) - Tatra 603 A (1964) - Tatra 603 B5 (1966) - Tatra 603 B6 (1967) - Tatra 603 MB (1961) - Tatra 603 Monte Carlo - Tatra 603 X (1966) - Tatra 604 (1954) - Tatra 605 (1957) - Tatra 607 Monopost (1950–1954) - Tatra 607-2 (1954–1958) - Tatra 801 (1949) - Tatra 803 (1950) - Tatra 804 (1951, lightweight T803) - Tatra 806 (1951, based on T803) - Tatra Baghira (1973) - Tatra Delfín (1963) - Tatra JK 2500 (1956) - Tatra T-III (1936 prototype tank) - Tatra Prezident (1994) - MTX Tatra V8 (1991) - Tatra V570 (1931) - Tatra V740 (1937) - Tatra V750 (1935) - Tatra V799 (1938) - Tatra V809 (1940) - Tatra V855 (1942) See also [edit]Notes [edit]- ^ After Benz & Cie. and Peugeot References [edit]- ^ \"About the Company\". Tatratrucks. - ^ Margolius, Ivan & Henry, John G. (2015). Tatra - The Legacy of Hans Ledwinka. Dorchester: Veloce Publishing. ISBN 978-1-845847-99-9. - ^ Lopatka, Jan (2025-12-16). \"Czech defence group CSG wins $1 billion Asian truck deal, opens Slovak ammunition line\". Reuters. Retrieved 2026-01-19. - ^ \"Navštívili jsme společnosti Tatra Trucks a Tatra Defence Vehicle\". - ^ \"First long-distance journey in Tatra car 125 years ago\". Radio Prague International. 2023-05-19. Retrieved 2023-10-23. - ^ Wise, David Burgess. \"Rumpler: One Aeroplane which Never Flew\", in Northey, Tom, ed. World of Automobiles (London: Orbis, 1974), Vol. 17, p.1964. - ^ \"NW Präsident - Jak to všechno začalo\". AutoZine.cz (in Czech). 2015-03-01. - ^ a b \"Hans Ledwinka :: Tatratrucks.com\". www.tatratrucks.com. - ^ G.N. Georgano Cars: Early and Vintage, 1886–1930. (London: Grange-Universal, 1985) - ^ a b c d Margolius, Ivan & Henry, John G. (1990). Tatra - The Legacy of Hans Ledwinka. Harrow: SAF. ISBN 0-946719-06-3. - ^ G.N. Georgano. - ^ \"Cars & history: Tatra T77 & T77A (1933–1938)\". Tatra. NL: Demon. Archived from the original on 2006-10-12. Retrieved 2018-08-21. - ^ Ross, Robert (2023-01-23). \"Car of the Week: The 1934 Tatra T77 Is a Czech Wonder. Now a Fully Restored Model Is up for Grabs\". Robb Report. Retrieved 2023-10-23. - ^ Bohumír Mimra, 'Vývojové směry moderního automobilismu', SIA 1936, Technická práce na Ostravsku 1926 – 1936, Moravská Ostrava 1936, p. 593. - ^ \"The Remarkably Futuristic Tatra T77 From 1934\". Silodrome. 2023-03-03. Retrieved 2023-10-23. - ^ a b c d e f Willson, Quentin The Ultimate Classic Car Book. New Your, New York: DK Publishing Inc., 1995. ISBN 0-7894-0159-2. Pages 214-215 - ^ a b Car Wars, Jonathan Mantle, Arcade Publishing, 1997 - ^ \"Brief History of Tatra\". UKCAR. Retrieved 2011-01-27. - ^ Schmarbeck, Wolfgang (1997). Hans Ledwinka: Seine Autos - Sein Leben (in German). Graz: H. Weishaupt Verlag. p. 174. ISBN 3-900310-56-4. - ^ McHUGH, DAVID (2019-07-09). \"From Nazis to hippies: End of the road for Volkswagen Beetle\". AP NEWS. Retrieved 2019-07-09. - ^ \"1961 Corvair/Rear-engine cars\". Time. 2007-09-07. Archived from the original on 2007-10-15. Retrieved 2008-06-10. - ^ savoy (2023-08-24). \"1958 Tatra T-603 Saloon | Savoy Automobile Museum\". Retrieved 2026-01-04. - ^ Anderson, Brad (2023-02-01). \"The Tatra 603-2 Is A Premium Sedan That You've Never Heard Of\". Carscoops. Retrieved 2023-10-23. - ^ \"Tatra 603 – Historic Vehicle Overview\". HistoricVehicles.com.au. - ^ \"Tatra.cz\" (PDF). Archived from the original (PDF) on 2008-10-29. - ^ \"Prague Post\". Prague Post. Retrieved 2018-12-26. - ^ \"Tatra plans to renew production of its legendary models\". Radio Prague International. 2008-04-03. Retrieved 2010-09-16. - ^ \"Tatra 903 Fuel Cell Concept - Carscoops\". Carscoops. 2008-07-01. Retrieved 2020-11-06. - ^ \"Tatra T87 four-door sedan\". Retrieved 2018-12-26. - ^ \"Tatra history milestones\". Archived from the original on 2010-08-19. - ^ Prospector, Gold (2008-04-27). \"Picture of replica first Tatra truck\". Flickr.com. Retrieved 2010-09-16. - ^ Moderní užitkové automobily Tatra kolektiv vývojove konstrukce N.P. Tatra Kopřivnice 1979 Naše Vojsko Praha, 1. vydání Modern Utility Automobiles Tatra by design team of N.P. Tatra Kopřivnice, 1979, Naśe Vojsko, Prague, 1st edition - ^ \"Tatra swings into action 78 years on\". Archived from the original on 2009-09-25. - ^ \"Tatra 27 vehicle description. Retrieved 2008-11-29\". Tatraportal.sk. Retrieved 2010-09-16. - ^ \"Tatra 92 technical specifications. Retrieved 2008-11-29\". Tatraportal.sk. Retrieved 2010-09-16. - ^ \"Tatra 111 specifications. Retrieved 2008-11-29\". Tatraportal.sk. Retrieved 2010-09-16. - ^ Tatratech.wz.cz Archived 2011-07-18 at the Wayback Machine Tatra 111 history, (in Czech) Retrieved 2008-11-29 - ^ The Automobil revue, issue 10'82, the technical monthly of the Czechoslovak Federal Ministry of General Engineering, current ISSN 1211-9555 - ^ \"Tatra 815 descri"
}