{
  "url": "https://www.uzitalk.com/forums/index.php?threads/kns-precision-adjustable-gas-piston-for-galil.95290/",
  "title": "KNS precision/adjustable gas piston for Galil? | UZI Talk Forums",
  "text": "I installed a KNS piston on my 5.56x45 Galil Ace pistol (that will be an SBR when/if the ATF ever approves my efiled stamp). Keep in mind that this 5.56x45 Ace was a special release that takes original Galil magazines and new Galil magazines that have a bolt lock back follower. Unlike most other KNS pistons, this one is very short because there is no neck to the piston. It was easy to change out with the factory piston. It came with a large and a small opening. After installing it on the bolt carrier, I had to swap the large opening for the small opening and set it to the proper torque. All in all, the installation was pretty easy. I still don't understand why KNS includes roll pins that are only long enough to catch on one side of the piston's wall. I test fired it yesterday and started with the valve fully closed using a Galil 10rd magazine that came with my Springfield Galil that's pictured above. Note that this piston has a much smaller range than most of the other KNS pistons. The spent cases ejected with too much velocity and went very far. I then adjusted to ten clicks open and fired five cartridges. The spent cases would weakly eject, but would not cycle then next cartridge into the chamber. I then went to five clicks and back to seven clicks and had 100% reliable function with both. Thinking I was good, I decided to load up a new 30rd Galil magazine and blast through it to confirm reliable function at seven clicks. Unfortunately, the spent cases would eject, but feeding was unreliable for the first five cartridges or so. After that, it would run fine. I had to adjust the piston back down to five clicks from closed in order for the pistol to function reliably through an entire magazine. During this testing process, I concluded that the new spring in the new 30rd Galil magazine is putting high pressure on the cartridges which are in turn putting pressure on the bottom of the bolt which slows down the cyclic rate. Interestingly, when I started with a full magazine and the KNS piston adjusted to five clicks, the first five spent cases would go a pretty short distance. Then as I fired through the magazine, the spent cases would go further and further. The bottom line here is that the pressure caused by the magazines on the bottom of the bolt does impact the ultimate setting that you can achieve for reliable function. It's something that I never would have thought about. I'm going to try these new Galil magazines in my Springfield Galil to see if I'll need to adjust it's piston setting when using them."
}