{
  "url": "https://m.letras.mus.br/blog/bandas-de-rock-nacional/",
  "title": "As 20 melhores bandas de rock nacional de todos os tempos - LETRAS.MUS.BR",
  "text": "30 de Novembro de 2019, às 19:00 Geralmente, quando falamos de rock, pensamos direto em grandes nomes internacionais e esquecemos de mencionar os vários cantores e bandas de rock nacional que são incríveis. Falando um pouco de história, o rock teve seu boom no mundo todo na década de 1950, principalmente com o fenômeno Elvis Presley. Contudo, foi só nos anos 80 que o rock ganhou realmente destaque no cenário nacional, com a ascensão de bandas como o Legião Urbana e os Titãs, que obtiveram um sucesso exponencial na época e ganharam uma legião de fãs (não podia deixar passar o trocadilho 😅). Depois de anos, colecionamos uma diversidade enorme de grupos de rock nacional. Porém, algumas bandas e cantores específicos acabaram se consolidando de maneira única no cenário musical e fizeram história no gênero. Quer saber quem são? Relembre os nomes das melhores bandas de rock nacional de todos os tempos! O primeiro nome da nossa lista é o Legião Urbana! Assim como mencionamos anteriormente, o Legião e as composições de Renato Russo foram sucesso absoluto na década de 80 e até as gerações mais novas conhecem seus hits. Significado de Pais e Filhos: entenda a música do Legião Urbana Banda que passou a ganhar bastante destaque no fim dos anos 90, o Charlie Brown Jr. veio com uma proposta de som mais hardcore com uma pegada descontraída e jovem. Definitivamente, as suas músicas marcaram toda uma geração. Confira 42 frases da banda Charlie Brown Jr para se inspirar e usar de legenda O Engenheiros do Hawaii também marcou o rock nacional dos anos 80. Suas músicas ganharam bastante popularidade por trazerem críticas sociais em algumas de suas letras. Afinal, quem é Ana? Confira a análise da música Refrão de Bolero, do Engenheiros do Hawaii, e descubra 😊 Abram alas para a musa do rock! Pitty começou suas atividades em 2003 com o lançamento do marcante álbum Admirável Chip Novo e até hoje faz muita música boa. Frases da Pitty: 45 trechos de músicas da diva do rock Skank, a banda belo-horizontina comandada pelos vocais de Samuel Rosa, surgiu no início dos anos 90 e também possui uma quantidade interminável de hits. Infelizmente, recentemente, o grupo anunciou uma pausa em suas atividades por tempo indeterminado… Vamos torcer pra que não seja para sempre, né? Confira 40 frases de hits memoráveis do Skank O Barão Vermelho foi fundado na década de 80 no Rio de Janeiro. Com certeza, a banda foi um marco no cenário do rock nacional, muito por ter como um de seus integrantes um dos maiores cantores da nossa história, Cazuza. Clássicos do rock: as 9 melhores músicas do Barão Vermelho O Roupa Nova teve seu auge nos anos 80 e 90. Eles já venderam mais de 20 milhões de discos e emplacaram mais de 50 singles de sucesso durante toda a carreira, como a famosíssima Whisky a Go Go. As 12 melhores músicas do Roupa Nova Fundada pelos irmãos Fê e Flávio Lemos e com Dinho Ouro Preto nos vocais, o Capital Inicial também surgiu no cenário da década de 80, em Brasília, e não pararam de fazer música desde então! As melhores do Capital Inicial: 11 músicas para relembrar Valeu a pena, ê ê… Todo mundo já escutou a música Pescador de Ilusões em algum momento na vida! Ela é só um dos grandes sucessos de O Rappa, grupo que mistura o rock, o reggae e o rap e dá origem a composições incríveis. O Rappa: 32 frases que vão te colocar pra pensar Quando começaram, os Titãs possuíam oito integrantes no grupo, acredita? Entre eles, Nando Reis, Arnaldo Antunes, Paulo Miklos e Tony Bellotto, o único que continua na formação atual da banda. Conheça a história da música Marvin, hit dos Titãs O Raimundos surgiu em Brasília, em 87, com Digão e Rodolfo Abrantes. Curiosidade: no início, eles eram uma banda cover de Ramones, uma de suas maiores influências musicais. Por isso o nome Raimundos. Os Paralamas do Sucesso são uma banda de rock formada em 1982 por Herbert Vianna, Bi Ribeiro e João Barone. Além de terem uma vasta discografia, eles também já acumularam diversos prêmios, como o Grammy Latinos de melhor álbum de rock. As 61 melhores frases do Paralamas do Sucesso O Mamonas Assassinas foi um fenômeno absoluto nos anos 90 com suas músicas zoeiras. Infelizmente, a banda teve um fim trágico em 1996, num acidente aéreo que levou a óbito todos os integrantes. Foi uma enorme comoção nacional. Felizmente, suas músicas permanecem vivas nos corações dos brasileiros. Vem se divertir com as melhores músicas dos Mamonas Assassinas Vamos com um pouco de metal agora! O Angra foi formado em São Paulo nos anos 90 e é reconhecido no mundo inteiro. Só pra você ter uma ideia, eles já venderam mais de 5 milhões de discos mundialmente e já fizeram diversas turnês, principalmente pela Europa. André Matos e a banda Angra: os pioneiros do metal melódico brasileiro Não poderíamos deixar de fora essa mulher icônica que marcou a história da música brasileira! Rita Lee foi cantora, compositora e multi-instrumentista, referência do rock nacional e ex-integrante do grupo Os Mutantes que (spoiler!) estão nessa lista também. Se inspire com a rainha do rock: as melhores frases da Rita Lee Como o próprio nome já diz, Os Novos Baianos nasceu na Bahia no finalzinho dos anos 60. Eles ganharam bastante popularidade nos anos 70 e misturavam diversos ritmos em suas músicas, como o rock, samba e a bossa nova. Os Mutantes foram uma banda de rock psicodélico formada na época do movimento Tropicalista, na década de 60. Com os vocais singulares de Rita Lee, o grupo até hoje é um marco na música brasileira. O Matanza foi uma banda carioca formada em 1996 que misturava o hardcore, o country e o metal e possui 7 álbuns gravados. Infelizmente, por motivos pessoais e por vontade de seguir diferentes caminhos artisticamente, o grupo acabou encerrando suas atividades em 2018. O Kid Abelha fez bastante sucesso no Brasil na década de 80. O grupo foi originalmente formado por Paula Toller, George Israel e Bruno Fortunato e já vendeu mais de 9 milhões de discos pelo país! Confira a análise de Como Eu Quero, do Kid Abelha, uma falsa canção de amor Por último, vamos falar de Los Hermanos! A banda carioca de Marcelo Camelo e Rodrigo Amarante foi febre no início dos anos 2000 e continua fazendo sucesso até hoje, principalmente com seu sucesso mais marcante, Anna Júlia. A história da música Conversa de Botas Batidas, do Los Hermanos Essa foi a nossa lista de melhores bandas de rock nacional! Tem alguma banda que nós não citamos e que você colocaria na lista? Conta pra gente nos comentários 😜 E pra continuar nesse embalo, vem conferir as melhores bandas de rock internacional de todos os tempos! Curta as suas músicas sem interrupções Pague uma vez e use por um ano inteiro R$ /ano Use o Letras sem anúncios. R$ /ano Benefícios Premium + aulas de idiomas com música. Já é assinante? Faça login."
}