{
  "url": "https://support.microsoft.com/pt-pt/office/como-iniciar-sessão-no-hotmail-c378938b-c0eb-40c1-b99e-338dd9e776a8",
  "title": "Como iniciar sessão no Hotmail - Suporte da Microsoft",
  "text": "Como iniciar sessão no Hotmail Aplica-se A Inicie sessão no Hotmail ou Outlook.com O Hotmail é agora Outlook.com Para iniciar sessão no Hotmail, precisará do nome de utilizador e da palavras-passe da sua conta Microsoft. Iniciar sessão no outlook.live.com Sugestões: - Se não conseguir iniciar sessão ou caso se tenha esquecido do seu nome de utilizador ou palavras-passe, utilize a nossa resolução de problemas de início de sessão. - Se quiser abrir uma nova conta, pode criar uma no https://signup.live.com/. Resolução de problemas: Não é possível iniciar sessão no Hotmail ou Outlook.com Notas: - A sua palavra-passe do Hotmail ou Outlook.com é a mesma que a palavra-passe da sua Conta Microsoft. - Se conseguir iniciar sessão mas estiver a ter problemas com o Outlook.com, verifique o estado do serviço. Se o estado não estiver verde, aguarde até que o serviço volte ao normal e tente novamente. - A Microsoft mantém-se sempre atenta a atividades invulgares de início de sessão, caso outra pessoa esteja a tentar entrar na sua conta. Se estiver em viagem para um novo local ou utilizar um novo dispositivo, poderá pedir-nos para confirmar que é realmente você. Se não conseguir iniciar sessão, experimente a ferramenta de resolução de problemas de início de sessão abaixo ou verifique as outras soluções listadas. Iniciar resolução de problemas A sua conta poderá estar temporariamente bloqueada por termos detetado algum tipo de atividade de início de sessão invulgar. Se a sua conta estiver bloqueada, consulte Desbloquear a minha conta do Outlook.com. A Microsoft mantém-se sempre atenta a atividades invulgares de início de sessão, caso outra pessoa estiver a tentar entrar na sua conta. Se estiver em viagem para um novo local ou utilizar um novo dispositivo, poderá pedir-nos para confirmar que é realmente você. Leia Como aceder ao Outlook.com quando viajar para obter mais informações. O Hotmail é agora Outlook.com. Para iniciar sessão na sua conta do Hotmail, aceda a www.outlook.com e selecione Iniciar sessão. Caso se tenha esquecido do seu nome de utilizador ou palavra-passe, utilize a nossa resolução de problemas de início de sessão, mas tenha em atenção que, se não iniciar sessão na sua conta há mais de 2 anos, a sua conta poderá ter sido eliminada. A experiência de início de sessão no browser está a mudar quando inicia sessão em qualquer produto ou serviço com a sua conta Microsoft. A partir de fevereiro de 2025, permanecerá com sessão iniciada automaticamente, a menos que termine sessão ou utilize a navegação privada. Se utilizar o Outlook no seu computador, o browser irá lembrar-se das suas informações de início de sessão, mas se iniciar sessão num computador, telemóvel ou tablet que não lhe pertence ou que seja acedido por outras pessoas, deve seguir os passos abaixo para utilizar uma janela de navegação privada. A navegação privada garante que outras pessoas não poderão: - Aceda à sua conta Microsoft, OneDrive ou Outlook.com caixa de correio. - Veja o seu histórico de pesquisa e navegação. Para terminar sessão no Outlook num browser, selecione a sua imagem de perfil e selecione Terminar sessão. Em alternativa, pode terminar sessão manualmente abaixo. Sugestão: Feche sempre todas as janelas do browser depois de terminar sessão. Se já não tiver acesso a um dispositivo onde iniciou sessão, leia Como terminar sessão em qualquer lugar. Consulte Também Começar a trabalhar com o novo Outlook para Windows Gerir contas de e-mail no Outlook.com Desbloquear a minha conta do Outlook.com Browsers suportados para o Outlook na Web e Outlook.com Se iniciar sessão com uma conta escolar ou profissional, saiba Como iniciar sessão no Outlook na Web"
}