{
  "url": "https://abcnews.go.com/GMA/Culture/brad-pitt-discusses-power-people-love-back/story?id=122792696",
  "title": "Brad Pitt shares simple life 'equation' he lives by in his 60s - ABC News",
  "text": "Brad Pitt shares simple life 'equation' he lives by in his 60s The actor opened up about growth, reflection and learning from mistakes. Brad Pitt is opening up about a few important life lessons he's learned. Speaking with Entertainment Tonight at the \"F1\" premiere in Mexico City this week, the actor reflected on where he is now after recently telling GQ that he feels \"contained\" and \"secure\" in this chapter of his life. When asked what brought him to this point, Pitt said, \"No matter the mistake, you know, you just learn from it and move on. It'll lead to the next success.\" He added, \"I think you get to my age and see how important it is to surround yourself with the people you know, the people you love, the people that love you back. Friends, family and that's it. From there, we get to go make things. It's a pretty simple … equation.\" Pitt stars as a former driver making a return to the racing world in the upcoming Apple Studios film \"F1.\" He teams up with Damson Idris, who plays his teammate on the fictional APXGP team, according to a press release. The film is directed by Joseph Kosinski, known for big-screen hits like \"Top Gun: Maverick\" and \"Oblivion,\" both starring Tom Cruise. When asked during the interview if the experience ever made him feel like he could be a real Formula 1 driver, Pitt replied, \"If I was a little bit younger, I would have taken that turn, I think so.\" \"It's so sublime. It's a feeling I've never had, to experience downforce, to experience the way these cars can stick to the road around a high speed corner, it's staggering,\" he said. \"It's awesome.\" In his GQ interview last month, Pitt spoke candidly about life in the public eye. \"My personal life is always in the news,\" he said at the time. \"It's been in the news for 30 years, bro. Or some version of my personal life, let's put it that way.\" He described fame as a lingering distraction he's learned to live with. \"It's been an annoyance I've had to always deal with in different degrees, large and small, as I do the things I really want to do,\" he continued. \"So, it's always been this kind of nagging time suck or waste of time, if you let it be that, I don't know.\" Still, Pitt said he's reached a place of peace. \"My life is fairly contained,\" he added. \"It feels pretty warm and secure with my friends, with my loves, with my fam, with my knowledge of who I am, that, you know, it's like this fly buzzing around a little bit.\""
}