{
  "url": "https://www.kontidesign.com/works",
  "title": "View luxury shipping container projects | Konti",
  "text": "We craft and design elegant, sustainable spaces out of shipping containers and other responsible materials by using advanced technological, biological, and modular systems. Casa Mar Azul won the prestigious 2024 USGBC Local Market Leadership Award - Rise to the Challenge Award. Casa Mar Azul is a luxury, single-family home built using shipping containers, featuring 3 bedrooms, 2.5 bathrooms, a spacious kitchen, and various gathering spaces such as a living room, outdoor dining areas, a plunge pool, and a roof deck with a solar panel pergola. We are proud to achieve LEED Platinum certification in 2022 for Casa Mar Azul. By using sustainable building principles, we completed this beautiful home with a 60-80% lower carbon footprint than typical construction. Our project highlights innovation in green construction, and we invite you to join the USGBC’s public directory for broader recognition. At Konti Design Build Studio, we partner with clients to design and build resilient, eco-friendly hotels, offices, storefronts, healthcare facilities, and more, providing turnkey solutions from concept to completion. Partner with Konti Design Build Studio to cut your time-to-market by up to 50%. Our modular construction methods are not only more sustainable, but more time efficient and offer you project timeline savings as well as long-term energy savings. We design and build eco-friendly residences with sustainability and long-term resiliency in mind, utilizing environmentally friendly materials and energy-efficient technologies. These projects contribute to a healthier environment and promote a more sustainable way of living. At KONTi Design | Build Studio, we lead the development, design, and construction of sustainable mixed-use and commercial properties with a focus on environmental preservation, architectural innovation, and long-term value. We are actively seeking like-minded investors and partners to bring new resilient developments to life across Puerto Rico. A standout example of our approach is Elefante—Puerto Rico’s first fully self-sustainable hotel, designed and developed by KONTi. It represents a bold vision for the future of hospitality: modular, off-grid, and deeply connected to its natural context. If you're interested in investing in purpose-driven development that merges profit with impact, we’d love to connect. This 10-bedroom eco-lodge combines sustainability, resiliency, and comfort, offering guests immersive nature experiences, farm-to-table dining, and local activities. Built from renewable materials, it features energy-efficient designs, solar power, rainwater harvesting, and eco-friendly waste management. And it’s built entirely off-grid, making it a stable, self-sustaining space in the midst of any crisis. Casa Mar Azul, designed by KONTi Design for Ganadores IBR in Isabela, Puerto Rico, is the first single-family home in the Caribbean to achieve LEED Platinum certification in 2022. It also won the prestigious 2024 USGBC Local Market Leadership Award - Rise to the Challenge Award. The LEED Platinum certification not only reflects the space's environmental benefits but also adds financial value by increasing the home’s resale potential by 25% and reducing long-term utility costs. At Konti Design Build Studio, we plan, design, and build every space following LEED parameters. If you want to get your space LEED certified to increase its value and highlight its eco-friendliness, we can make it happen."
}