{
  "url": "https://www.laett.com/index.cfm?zone=/unionactive/view_page.cfm&page=Inside20Wireman",
  "title": "Electrical Training Institute | Inside Wireman",
  "text": "OFFICIAL NOTICE Apprentice Opportunity for the Inside Wireman Program The Electrical Training Institute's Joint Apprenticeship & Training Committee offers a complete 5-year program incorporating on-the-job training and supplemental classroom related instruction for the Inside Wireman Program and continues to accept applications from eligible applicants in accordance with its approved standards and selection procedures. NOTICE: APPLICANT REGISTRATION IS ONLINE ONLY! All Applicants are directed to apply using our online system. Visit our website at: www.laett.com. Applicants who complete the online application must upload all required documents along with their application. All qualifying applicants will have the opportunity to take the written aptitude test. All aptitude tests will be administered at our facility located at the address below: Electrical Training Institute 6023 S. Garfield Avenue City of Commerce, CA 90040 Required Documents: - Valid Government Issued Photo ID (All applicants must be at least18 years of age at the time of application) - Original High School Diploma, GED, or or college degree (Please note: any foreign high school diploma, college degree, or transcript must be translated and notarized by a California notary. Make sure when uploading your documents, you upload the original and the translated notarized copy.) - Must provide proof of completing an Algebra course or its equivalent (excluding geometry) by submitting one of the following: - A copy of your high school transcript showing at least: Two semesters of High School Algebra with a passing grade of \"C\" or better OR - College transcripts showing at least: One semester of post High School Algebra with a passing grade of \"C\" or better OR - Certificate showing successful completion of the Electrical Training Alliance's On-Line Tech Math Course. - A valid social security number must be provided at the time of your indenture as an apprentice. Without a valid social security number, we cannot register you as an apprentice with the State of California. As a result, you will not be able to continue with the apprenticeship program. Veterans that meet one or more of the following criteria will have the algebra requirement waived: - Military veterans with at least three years of active-duty military service within the U.S. Armed Forces who were discharged under honorable conditions within five years of their application date. (Must provide DD214 Member-4 Form). - Reservists with at least six years of U.S. military reserve service who are either still serving as a reservist, or were discharged under honorable conditions within two years of their application date. (Must provide sufficient documentation to verify military reserve service, such as a statement of service). - An honorably discharged military veteran who completed military technical training school in a MOS applicable to the commercial and/or industrial electrical construction industry (as determined by ETI staff), and can document a minimum of two years of military experience in that MOS within five years of their application date. Once an applicant is invited to boot camp, the applicant must provide the original copies of the previously submitted documents. If you are submitting transcripts to verify the educational requirements, those transcripts must be a sealed official copy. Photocopies will not be accepted. Our staff will verify all submitted documents. All original documents will be returned to the applicant upon verification. Our Personal Experience Form or PEF is your opportunity to let us know about any life and/or work experience you have gained that may be relevant to the position you are applying for. When completing your PEF, you will be allowed to upload documentation to support your work, education, and/or military experience. It is imperative that you read all instructions carefully and take the time to complete your PEF accurately and upload all supporting documentation. If inaccuracies are discovered with any area of your submitted PEF during the review process, you will not receive credit for those areas. Any experience submitted for review without accompanying documentation will not be considered. Please note that it is crucial to include all your educational, military, and/or work experience in the PEF, along with supporting documentation. We cannot stress enough how important this is. The PEF constitutes up to 40% of your final score, so failing to complete the form fully before submitting could negatively impact your final score, and consequently, your ranking on our Pool of Eligible candidates list. Once you are provided access to complete your PEF, you will have 14 days to complete and submit it, along with supporting documentation for review. If you fail to submit your PEF and documentation within the 14-day window, we will cancel your application and you will have to reapply. Once we receive your completed PEF, our staff will schedule a time for you to come to our facility and take the aptitude test. When you report on your scheduled date and time, you will be given 2 hours and 20 minutes to complete the test which consists of five topics: mathematical reasoning, numerical reasoning, reading comprehension, mechanical reasoning, and paper folding. A study guide for the aptitude test is available for purchase on the GAN HR website. You can click here to be taken to their site. You can also find this link by visiting the Applicant Information tab of our website and clicking the button labeled “Study Guide.” Please note that all applicants must take the aptitude test regardless of the program selected. What is Apprenticeship? Apprenticeship is a well-organized and supervised training method we use to enable people with little or no prior knowledge of the electrical trade to become qualified journey-level electrical workers. It is an “earn while you learn program” meaning you will work full time and go to school. 1. You will be employed under a union contract, which includes regular wage increases and diversified training. 2. You will be paid good wages while you learn. 3. You will gain experience using the most modern practices. 4. You will work under the direction of a competent journey level electrical worker who will teach you the trade in the shop and the jobsite. 5. You will be required to attend a combination of day and night classes for a minimum of 240 hours per year. This is one reason for our high academic entrance requirements. You will not receive compensation during your class weeks, but you may be eligible for unemployment benefits. Career Description The Electrical Construction Trade requires physical effort on the part of the apprentice. Construction’s scope of work requires that apprentices be able to climb ladders and scaffolds, pull and push materials and equipment, crawl, crouch, work in cramped and confined quarters, and lift 25 to 50 pounds on a fairly consistent basis. Apprentices must also possess the ability to read, hear, and understand written and spoken instructions and warnings in English, and closely follow specific instructions and warnings, especially safety directions and warnings. Inside Wiremen use many and varied hand and power tools to install conduit, wiring, fixtures, devices, and electrical apparatuses within commercial, industrial, and residential buildings. We Are Selective A good candidate is an individual who excelled in school, demonstrates reliability, possesses a sincere desire to succeed, has a positive attitude and a desire to work hard. The electrical construction trade is an occupation requiring a high level of knowledge and skill. We are extremely proud of our history of helping candidates who enter our program become successful, qualified journey-level electrical workers. What Benefits Do I Gain if I Am Accepted? 1. An opportunity to learn a most respected trade in one of the most technical crafts of the Building Trades and earn a good wage while you learn. 2. An opportunity to become a member of the most respected and progressive Union in the Building and Construction Trades: The International Brotherhood of Electrical Workers. 3. The opportunity to “earn” journey level electrical worker status and certification, which is recognized throughout the United States. Your journey level electrical worker status is security for yourself and your family for life. 4. The opportunity to continue your education after you become a journey level electrical worker, for our industry has extension courses to teach various specialties of our trade, and keep you updated on the most modern technologies. 5. The opportunity to earn an exceptional wage during your working life and receive valuable benefits throughout your retirement. What is Expected of Me if I Am Selected? 1. Your commitment and dedication to a very valuable career. 2. Your eagerness to learn and grow. 3. A commitment to excellence and dependability in the classroom and on the job. 4. A day’s work for a day’s pay. 5. A commitment to remaining drug-free. 6. A commitment to adhere to all apprentice policies. Pre-employment and continued drug testing is required. Marijuana is considered an illegal drug under ETI’s various Apprentice Policies, including its Substance Abuse Policy, as it continues to be illegal under federal law. Drug testing will include testing for marijuana as well as other illegal drugs. If prior to Boot Camp or at Boot Camp you fail any drug test, you refuse to consent to any drug test, you do not have sufficient hair for the hair follicle test (hair must be one inch long or longer to test) or do not provide a sufficient sample of urine for the drug test, your conditional offer of entry into the apprenticeship program will be revoked, and you must wait at least six months to re-apply to the program by submitting a new application and following all subsequent application policies and procedures. Check the ETI website for Application Information www.laett.com Equal Opportunity Pledge The JATC will not discriminate against apprenticeship applicants or apprentices based on race, religious creed (including religious dress and grooming), color, national origin, ancestry, physical disability, mental disability (including cognitive disability), medical condition, genetic information, marital status, sex (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breast feeding), sexual orientation, sex stereotype, gender, gender identity, gender expression, age 40 or older, and military and veteran status. The JATC will take affirmative action to provide equal opportunity in apprenticeship and will operate, conduct, and administer this apprenticeship program as required under Title 29 of the Code of Federal Regulations, part 30, and the equal opportunity regulations of the State of California. Your Right to Equal Opportunity It is against the law for a sponsor of an apprenticeship program registered for Federal purposes to discriminate or retaliate against, or harass, an apprenticeship applicant or apprentice based on race, color, religion, national origin, sex, sexual orientation, age (40 years or older), genetic information, or disability. The sponsor must ensure equal opportunity with regard to all terms, conditions, and privileges associated with apprenticeship. Filing a Discrimination Complaint If you think you have been subjected to such discrimination, harassment, or retaliation, you may file a complaint: - within 300 days from the date of the alleged discrimination, harassment, retaliation, or failure to follow the equal opportunity standards with the U.S. Department of Labor, Office of Apprenticeship, 200 Constitution Avenue, NW, Washington, DC 20210, Attn: Apprenticeship EEO Complaints, Jose Velazquez, (202) 693-2909, ApprenticeshipEEOcomplaints@dol.gov; or - within 180 days from the date of the alleged discrimination, harassment, retaliation, or failure to follow the equal opportunity standards with the State of California, Division of Apprenticeship Standards, Administrator of Apprenticeship, Department of Industrial Relations, 1515 Clay Street, Oakland, CA 94612. You may also be able to file complaints directly with the U.S. Equal Employment Opportunity Commission (EEOC) or the California Department of Fair Employment and Housing (DFEH) within the time periods set by those agencies. Their contact information is as follows: - EEOC: 1-800-669-4000 (toll-free) or 1-800-669-6820 (toll-free TTY number for individuals with hearing impairments). EEOC field office information is available at www.eeoc.gov or in most telephone directories in the U.S. Government or Federal Government section. Additional information about EEOC, including information about charge filing, is available at www.eeoc.gov; and d) DFEH: (800)884-1684; TTY (800)700- 2320; videophone for the hearing impaired (916)226-5285; email contact.center@dfeh.ca.gov, or www.dfeh.ca.gov. Each complaint filed must be made in writing and include the following information - Complainant’s name, address and telephone number, or other means for contacting the complainant; - The identity of the respondent (i.e. the name, address, and telephone number of the individual or entity that the complainant alleges is responsible for the discrimination); - A short description of the events that the complainant believes were discriminatory, harassing, or retaliatory, including, but not limited to, when the events took place, what occurred, and why the complainant believes the actions were discriminatory, harassing, or retaliatory (for example, because of his/her race, color, religion, sex, sexual orientation, national origin, age (40 or older), genetic information, or disability); and - The complainant’s signature or the signature of the complainant’s authorized representative. Click here to download PDF"
}