{
  "url": "https://support.microsoft.com/pt-br/windows/conectar-se-a-uma-vpn-no-windows-3d29aeb1-f497-f6b7-7633-115722c1009c",
  "title": "Conectar-se a uma VPN no Windows - Suporte da Microsoft",
  "text": "Conectar-se a uma VPN no Windows Aplica-se a Seja para uso pessoal ou de trabalho, você pode se conectar a uma VPN (rede virtual privada) em seu dispositivo Windows. A conexão VPN pode proporcionar uma conexão mais segura com a rede de sua empresa e com a Internet (por exemplo, se você estiver trabalhando em um café ou local público semelhante). Observação: Esse recurso não está disponível no Windows 11 SE. Saiba mais. Crie um perfil VPN Antes de se conectar a uma VPN, você deve ter um perfil VPN em seu dispositivo. Você pode criar um perfil de VPN por conta própria ou configurar uma conta de trabalho para obter um perfil de VPN da sua empresa. Antes de começar: - Se for para uso profissional, procure pelas configurações de VPN ou um aplicativo de VPN no site da intranet da empresa enquanto estiver no trabalho ou entre em contato com o suporte da empresa. - Se for para um serviço de VPN que você assina para uso pessoal, visite a Microsoft Store para ver se há um aplicativo para esse serviço ou acesse o site do serviço VPN para ver se as configurações de conexão VPN a serem usadas estão listadas lá. Depois de ter suas configurações de VPN pessoais ou de trabalho prontas: - No aplicativo Configurações em seu dispositivo Windows, selecione & rede > VPN > Adicionar VPN. - Em Adicionar uma conexão VPN, faça o seguinte: - Em provedor VPN, escolha Windows (interno). - Na caixa nome da conexão, insira um nome que você reconhecerá (por exemplo, Minha VPN pessoal). Esse é o nome da conexão VPN a ser procurado quando você quiser se conectar. - Na caixa Nome ou endereço do servidor, insira o endereço do servidor VPN. - Para tipo de VPN, escolha o tipo de conexão VPN que você deseja criar. Você precisará saber qual tipo de conexão de VPN sua empresa ou serviço VPN usa. - Para Tipo de informações de entrada, escolha o tipo de informações de entrada (ou as credenciais) a serem usadas. Isso pode ser um nome de usuário e senha, uma senha ocasional, um certificado ou um cartão inteligente, se você estiver se conectando a uma VPN para trabalho. Insira seu nome de usuário e sua senha nas caixas correspondentes (opcional). - - Selecione Salvar. Se você precisar editar as informações de conexão VPN ou especificar configurações adicionais, como configurações de proxy: - Na página configurações de VPN, selecione a conexão VPN que você deseja editar, selecione Opções avançadas e selecione Editar ao lado dos detalhes que você deseja atualizar. Depois de fazer as atualizações necessárias, selecione Salvar ou Aplicar. Conecte-se a uma VPN Depois que tiver um perfil de VPN, você poderá se conectar. - Na barra de tarefas, selecione o ícone Rede, Volume, Bateria > VPN. - Se você tiver uma VPN configurada, poderá ativá-la e desativá-la alternando o lado esquerdo da configuração rápida de VPN , marcada com um (1), abaixo. - Se houver várias VPNs configuradas, você precisará selecionar uma para se conectar. Selecione Gerenciar conexões VPN (marcadas com um (2) na imagem), selecione a desejada na lista de conexões e selecione Conectar. - Se solicitado, insira seu nome de usuário e senha ou outras informações de entrada. - No aplicativo Configurações em seu dispositivo Windows, selecione VPN de> da Internet & rede. - Ao lado da conexão VPN que você deseja usar, selecione Conectar. - Se solicitado, insira seu nome de usuário e senha ou outras informações de entrada. Verificar a conexão VPN - Na página configurações de VPN, o nome da conexão VPN exibirá Conectado abaixo dele. - Na barra de tarefas, um escudo azul será exibido quando você estiver conectado a uma VPN reconhecida. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. Seja para uso pessoal ou de trabalho, você pode se conectar a uma VPN (rede virtual privada) em seu dispositivo Windows. A conexão VPN pode proporcionar uma conexão mais segura com a rede de sua empresa e com a Internet (por exemplo, se você estiver trabalhando em um café ou local público semelhante). Crie um perfil VPN Antes de se conectar a uma VPN, você deve ter um perfil VPN em seu dispositivo. Você pode criar um perfil de VPN por conta própria ou configurar uma conta de trabalho para obter um perfil de VPN da sua empresa. Antes de começar: - Se for para uso profissional, procure pelas configurações de VPN ou um aplicativo de VPN no site da intranet da empresa enquanto estiver no trabalho ou entre em contato com o suporte da empresa. - Se for para um serviço de VPN que você assina para uso pessoal, visite a Microsoft Store para ver se há um aplicativo para esse serviço e acesse o site do serviço de VPN para ver se as configurações de conexão VPN estão listadas lá. - Selecione o botão Iniciar e selecione Configurações > Rede & Internet > VPN > Adicionar uma conexão VPN. - Em adicionar uma conexão VPN, faça o seguinte: - Em Provedor VPN, escolha Windows (nativo). - Na caixa nome da conexão, insira um nome que você reconhecerá (por exemplo, Minha VPN pessoal). Esse é o nome da conexão VPN a ser procurado quando você quiser se conectar. - Na caixa Nome ou endereço do servidor, insira o endereço do servidor VPN. - Para Tipo de VPN, escolha o tipo de conexão VPN que você deseja criar. Você precisará saber qual tipo de conexão de VPN sua empresa ou serviço VPN usa. - Para Tipo de informações de entrada, escolha o tipo de informações de entrada (ou as credenciais) a serem usadas. Isso pode ser um nome de usuário e senha, uma senha ocasional, um certificado ou um cartão inteligente, se você estiver se conectando a uma VPN para trabalho. Insira seu nome de usuário e sua senha nas caixas correspondentes (opcional). - - Selecione Salvar. Caso precise editar as informações de conexão VPN ou especificar outras configurações, como as configurações de proxy para a conexão VPN, escolha a conexão VPN e, em seguida, selecione opções avançadas. Conecte-se a uma VPN Depois que tiver um perfil de VPN, você poderá se conectar. - No canto direito da barra de tarefas, selecione o ícone de rede ( ou ). - Selecione a conexão VPN que você deseja usar e siga um destes procedimentos, dependendo do que acontecer quando você selecionar a conexão VPN: - Se o botão conectar for exibido em conexão VPN, selecione conectar. - Se a opção VPN em configurações for aberta, selecione a conexão VPN e, em seguida, selecione conectar. - - Se for solicitado, insira seu nome de usuário e uma senha ou outras informações de entrada. Quando conectada, o nome da conexão VPN exibirá conectado abaixo dele. Para conferir se você está conectado à VPN enquanto trabalha no computador, selecione o ícone rede (ou no ) canto direito da barra de tarefas e em seguida verifique se a conexão VPN diz conectado."
}