{
  "url": "https://en.wikipedia.org/wiki/Haifa",
  "title": "Haifa - Wikipedia",
  "text": "Haifa Haifa (/ˈhaɪfə/ HY-fə; Hebrew: חיפה, romanized: Ḥēyfā, IPA: [ˈχajfa]; Arabic: حيفا, romanized: Ḥayfā, IPA: [ħaj.faː])[2] is the third-largest city in Israel—after Jerusalem and Tel Aviv—with a population of 298,312 in 2023. The city of Haifa forms part of the Haifa metropolitan area, the third-most populous metropolitan area in Israel.[3] It is home to the Baháʼí Faith's Baháʼí World Centre, a UNESCO World Heritage Site and destination for Baháʼí pilgrimage.[4] Built on the slopes of Mount Carmel, the settlement has a history spanning more than 3,000 years. Over the millennia, the Haifa area has changed hands: being conquered and ruled by the Canaanites, Israelites, Phoenicians, Assyrians, Babylonians, Persians, Hasmoneans, Romans, Byzantines, Arabs, Crusaders, Ottomans, and the British. The earliest known settlement in the vicinity was Tell Abu Hawam, a small port city established in the Late Bronze Age (14th century BCE).[5] In the 3rd century CE, Haifa was known as a dye-making center. Haifa el-Atika, 5km northwest of Tell Abu Hawam, is the former site of Haifa as it existed between the 11th–18th centuries. In the late Ottoman period, in the 1760s, Haifa el-Atika was relocated 2.5 kilometres (1+1⁄2 miles) to the east as a new, fortified town, today known as the Old City of Haifa. During and after the Battle of Haifa in the 1948 Palestine war, most of the city's Arab population fled or were expelled and the Old City was subsequently demolished. That year, the city became part of the then-newly-established state of Israel. As of 2016[update], the city is a major seaport located on Israel's Mediterranean coastline in the Bay of Haifa covering 63.7 km2 (24.6 sq mi). It lies about 90 km (56 mi) north of Tel Aviv and is the major regional center of northern Israel. Two respected academic institutions, the University of Haifa and the Technion – Israel Institute of Technology the oldest and top ranked university in both Israel and the Middle East, are located in Haifa, in addition to the largest K–12 school in Israel, the Hebrew Reali School. The city plays an important role in Israel's economy. It is home to Matam, one of the oldest and largest high-tech parks in the country; and prior to the opening of Tel Aviv Light Rail, Haifa is the only city with underground rapid transit system in Israel known as the Carmelit.[6][7] Haifa Bay is a center of heavy industry, petroleum refining and chemical processing. Haifa formerly functioned as the western terminus of an oil pipeline from Iraq via Jordan.[8] It is one of Israel's mixed cities, with an Arab-Israeli population of c.10%. Etymology The ultimate origin of the name Haifa remains unclear. One theory holds it derives from the name of the high priest Caiaphas.[citation needed] Some Christians believe it was named for Saint Peter, whose Aramaic name was Keipha.[citation needed] Another theory holds it could be derived from the Hebrew verb root חפה (hafa), from H-f-h root (ח-פ-ה), meaning to cover or shield, i.e. Mount Carmel covers Haifa;[9] others point to a possible origin in the Hebrew word חוֹף (hof), meaning \"shore\", or חוֹף יָפֶה (hof yafe), meaning \"beautiful shore\".[9][10] Other spellings in English included Caipha, Kaipha, Caiffa, Kaiffa and Khaifa.[11] The name Efa first appears during Roman rule, some time after the end of the 1st century, when a Roman fortress and small Jewish settlement were established not far from Tell es-Samak.[12][13] 'Haifa' is mentioned more than 100 times in the Talmud, a work central to Judaism.[13] Hefa or Hepha in Eusebius of Caesarea's 4th-century work, Onomasticon,[14] is said to be another name for Sycaminum.[15] This synonymizing of the names is explained by Moshe Sharon, who writes that the twin ancient settlements, which he calls Haifa-Sycaminon, gradually expanded into one another, becoming a twin city known by the Greek names Sycaminon or Sycaminos Polis.[13] References to this city end with the Byzantine period.[5] The Crusaders believed the name Haifa was related to Cephas, the Aramaic name of Simon Peter.[16] Eusebius is also said to have referred to Hefa as Caiaphas civitas,[17] while the 12th-century chronicler Benjamin of Tudela is said to have attributed the settlement's founding to Caiaphas, the Jewish high priest at the time of Jesus.[16] Locations Classical-era Haifa is thought to be the archaeological site of Tell Abu Hawam, about 2.5km southeast of the Old City, which contains remains from Iron Age, Roman and Byzantine Haifa. It was abandoned by the twelfth century.[18] Other sources suggest it may have been along the shores of the Haifa Bay, either at the site of Bat Galim or Haifa el-Atika.[19] Medieval Haifa, or Haifa el-Atika, is the former site of Haifa as it existed during the Fatimid (11-12th centuries), Crusader (12th–13th centuries), Mamluk (13th–16th centuries) and early Ottoman (16th–18th centuries) periods. By the late eleventh century, this new fortified settlement had developed about 5km northwest of Tell Abu Hawam (about 2.5km northwest of the Old City). Contemporary sources from the crusader period refer to two Haifas, an “old” and a “new” Haifa.[18] In the late Ottoman period, in the 1760s, Haifa el-Atika was demolished and relocated 2.5 kilometres (1+1⁄2 miles) to the east as a new, fortified town, today known as the Old City of Haifa.[20] This new village, the nucleus of modern Haifa, was originally called in Arabic al-imara al-jadida (lit. 'the new construction'), though others residing there initially called it Haifa al-Jadida ('New Haifa') and then simply 'Haifa'.[2] With the expansion of Haifa in the late 19th and 20th centuries, 'New Haifa' became known as the Old City of Haifa.[21] History Bronze Age: Tell Abu Hawam A town known today as Tell Abu Hawam was established during the Late Bronze Age (14th century BCE).[5] It was a port and fishing village. The 6th-century BCE geographer Scylax describes a city \"between the bay and the Promontory of Zeus\" (i.e., Mount Carmel) which may be a reference to a settlement on the site of modern-day Haifa in the Persian period.[5] The city moved to a new site south of what is now Bat Galim, in the Hellenistic period, after the old port became blocked with silt.[5] Roman period In about the 3rd century CE, Haifa was first mentioned in Talmudic literature, as a Jewish fishing village and the home of Rabbi Avdimi and other Jewish scholars. According to the Talmud, fishermen caught Murex, sea snails which yielded purple dye used to make tallit (Jewish prayer shawls) from Haifa to the Ladder of the Tyrians. Tombs dating from the Roman era, including Jewish burial caves, have been found in the area.[5][22][23] Byzantine period Under Byzantine rule, Haifa continued to grow but did not assume major importance.[24] A kinah speaks of the destruction of the Jewish community of Haifa along with other communities when the Byzantines reconquered the country from the Sasanian Empire in 628 during the Byzantine-Sasanian War.[23] Early Muslim period Following the Arab conquest of the Levant in the 630s–40s, Haifa was largely overshadowed by the port city of 'Akka.[2] Under the Rashidun Caliphate, Haifa began to develop.[25] A 25-meter-long shipwreck dating back to the seventh-century was discovered near Haifa. The ship was built using the \"shell-first\" method, containing the largest collection of Byzantine and early Islamic ceramics discovered in Israel. Many inscriptions in both Greek and Arabic letters, the name of Allah and numerous Christian crosses were unearthed, including 103 amphoras with 6 types of which 2 types had never been discovered previously.[26][27][28] In the 9th century under the Umayyad and Abbasid Caliphates, Haifa established trading relations with Egyptian ports and the city featured several shipyards. The inhabitants, Arabs and Jews, engaged in trade and maritime commerce. Glass production and dye-making from marine snails were the city's most lucrative industries.[25] The geographer Nasir-i-Khusrau visited in 1047 and noted: \"Haifa lies on the seashore, and there are here palm-gardens and trees in numbers. There are in this town shipbuilders, who build very large craft.\"[29] Haifa was later mentioned by the 12th-century geographer Muhammad al-Idrisi and the 13th-century geographer Yaqut al-Hamawi.[30] Crusader, Ayyubid and Mamluk periods Prosperity ended in 1100 or 1101, when Haifa was besieged and blockaded by European Christians shortly after the end of the First Crusade, and then conquered after a fierce battle with its Jewish inhabitants and Fatimid garrison. Jews comprised the majority of the city's population at the time.[23][31][32] Under the Crusaders, Haifa was reduced to a small fortified coastal stronghold.[31] It was a part of the Principality of Galilee within the Kingdom of Jerusalem. Following their victory at the Battle of Hattin, Saladin's Ayyubid army captured Haifa in mid-July 1187 and the city's Crusader fortress was destroyed.[5][33] The Crusaders under Richard the Lionheart retook Haifa in 1191.[34] In the 12th century religious hermits started inhabiting the caves on Mount Carmel, and in the 13th century they formed a new Catholic monastic order, the Carmelites.[35] Under Muslim rule, the church which they had built on Mount Carmel was turned into a mosque, later becoming a hospital. In the 19th century, it was restored as a Carmelite monastery, the Stella Maris Monastery. The altar of the church as we see it today, stands over a cave associated with Prophet Elijah.[36] In 1265, the army of Mamluk sultan Baibars captured Haifa, destroying its fortifications, which had been rebuilt by King Louis IX of France, as well as the majority of the city's homes to prevent the European Crusaders from returning.[37] From the time of its conquest by the Mamluks to the 15th century, Haifa was an unfortified small village or uninhabited. At various times there were a few Jews living there and both Jews and Christians made pilgrimages to the Cave of Elijah on Mount Carmel.[23] During Mamluk rule in the 14th century, al-Idrisi wrote that Haifa served as the port for Tiberias and featured a \"fine harbor for the anchorage of galleys and other vessels.[30] Ottoman period Haifa may have been uninhabited when the Ottoman Empire conquered Palestine in 1516. In 1559, Haifa formed part of the newly-formed Lajjun Sanjak of the Damascus Eyalet. The local Bedouin emirs of the Turabay dynasty largely held the governorship of Lajjun from this point until 1677.[38][39] The Turabays levied customs on the European ships which occasionally docked in the harbor of Haifa, which they also used for their own imports, namely coffee, rice and cloth.[40][41] The revenues derived from Haifa ranged from 1,000 akçes in 1538 to 10,000 akçes in 1596 (1548).[42] In 1596 (or 1548), Haifa appeared in Ottoman tax registers as being in the nahiya (subdistrict) of Sahil Atlit of the Lajjun Sanjak. It had a population of 32 Muslim households and paid taxes on wheat, barley, summer crops, olives, and goats or beehives.[43] An early indication of its resettlement was given in a description by German traveller Leonhard Rauwolf, who visited Palestine in 1575.[23] The early Turabay governors did not invest in securing or building Haifa, which became a haven for Maltese pirates.[44] During the conflict between the Turabays and the Druze governor Fakhr al-Din II of Sidon-Beirut and Safed, control of Haifa and its tower switched hands between their forces multiple times in 1623–1624, until Ahmad Bey Turabay ultimately regained control. He then demolished Haifa's tower to prevent its recapture.[45] Due to attacks by the Maltese pirates and the conflicts between the Turabays and Fakhr al-Din, European merchants avoided trading in Haifa. To attract French merchants to the harbor, in 1631, Ahmad Bey began to rebuild and resettle Haifa and permitted the Carmelites to construct houses there.[44] The French diplomat Laurent d'Arvieux visited the town in the 1650s and 1660s, stating that its name was pronounced locally as Hheïfa, with Europeans calling it Caïfa after Caiaphas. d'Arvieux wrote that it had once been a substantial town, evidenced by extensive surrounding ruins (including a castle and two ruined churches), but was then an small, undefended and poor town inhabited by Muslims, Jews, and a few Christians.[46] The English writer Richard Pococke visited in the late 1730s, writing that the name 'Hepha' came from Kepha, due to \"the rocky ground it is situated on\". He noted the rock-cut tombs in the area, as well as \"a well-built old church entire, which might have been the cathedral... ruins of a large building, that seems to have been the castle; and... two forts, as a defence against the corsairs\".[47] In 1742, Haifa was a small village and had a Jewish community composed mainly of immigrants from Morocco and Algeria which had a synagogue.[22] It had 250 inhabitants in 1764–5. It was located at Tell el-Semak, the site of ancient Sycaminum.[20][48] In 1761,[49] 1765,[20][50] or 1769,[51] Daher al-Umar, Arab ruler of Acre and the Galilee, destroyed the old city (today called 'Haifa El-Atika') and rebuilt the town in a new location, surrounding it with a wall (today called the 'Old City of Haifa').[49] This event is marked as the beginning of the town's modern era. Giovanni Mariti visited the area in the 1760s, shortly after the city's relocation. He wrote that the inhabitants were Muslims and Greek Catholic and Greek Orthodox, and that \"New Caiffa\" was built with the stones of the recently vacated old town, of which \"nothing is now left of it but the ruins of the metropolitan church\".[52] This event marked the beginning of modern Haifa.[20] In 1799, Napoleon Bonaparte captured Haifa during his abotive attempt to conquer Palestine and Syria from the Ottomans, but he soon had to withdraw; in the campaign's final proclamation, Napoleon took credit for having razed the fortifications of \"Kaïffa\" (as the name was spelled at the time) along with those of Gaza, Jaffa and Acre. Between 1831 and 1840, the Egyptian viceroy Muhammad Ali governed Haifa, after his son Ibrahim Pasha had wrested control over it from the Ottomans.[53][54] When the Egyptian occupation ended and Acre declined, the importance of Haifa rose. In 1858, the walled city of Haifa was overcrowded and the first houses began to be built outside the city walls on the mountain slope.[22] The British Survey of Western Palestine estimated Haifa's population to be about 3,000 in 1859.[55] Haifa remained majority Muslim throughout this time but a small Jewish community continued to exist there. In 1798, Rabbi Nachman of Breslov spent Rosh Hashanah with the Jewish community of Haifa. In 1839 the Jewish population numbered 124.[56] Due to the growing influence of the Carmelite monks, Haifa's Christian population also grew. By 1840 approximately 40% of the inhabitants were Christian Arabs.[23] The arrival of German messianics, many of whom were Templers, in 1868, who settled in what is now known as the German Colony, was a turning point in Haifa's development.[54] The Templers built and operated a steam-based power station, opened factories and inaugurated carriage services to Acre, Nazareth and Tiberias, playing a key role in modernizing the city.[57] The first major wave of Jewish immigration to Haifa took place in the mid-19th century from Morocco, with a smaller wave of immigration from Turkey a few years later.[58] In the 1870s, large numbers of Jewish and Arab migrants came to Haifa due to the town's growing prosperity. Jews constituted one-eighth of Haifa's population, almost all of whom were recent immigrants from Morocco and Turkey who lived in the Jewish Quarter, which was located in the eastern part of the town. Continued Jewish immigration gradually raised the Jewish population of Haifa, and included a small number of Ashkenazi families, most of whom opened hotels for Jewish migrants coming into the city. In 1875, the Jewish community of Haifa held its own census which counted the Jewish population at about 200.[59] The First Aliyah of the late 19th century and the Second Aliyah of the early 20th century saw Jewish immigrants, mainly from Eastern Europe, arrive in Haifa in significant numbers. In particular, a significant number of Jewish immigrants from Romania settled in Haifa in the 1880s during the First Aliyah period. The Central Jewish Colonisation Society in Romania purchased over 1,000 acres (4.0 km2) near Haifa. As the Jewish settlers had been city dwellers, they hired the former fellahin tenants to instruct them in agriculture.[60] The Jewish population rose from 1,500 in 1900 to 3,000 on the eve of World War I.[61] In the early 20th century, Haifa began to emerge as an industrial port city and growing population center. A branch of the Hejaz Railway, known as the Jezreel Valley railway, was built between 1903 and 1905. The railway increased the city's volume of trade, and attracted workers and foreign merchants.[62] In 1912, construction began on the Technion Institute of Technology, a Jewish technical school that was to later become one of Israel's top universities, although studies did not begin until 1924.[63] The Jews of Haifa also founded numerous factories and cultural institutions. Bahá'í faith's shrine In 1909, Haifa became important to the Bahá'í Faith when the remains of the Báb, founder of the Bábí Faith and forerunner of Bahá'u'lláh in the Bahá'í Faith, were moved from Acre to Haifa and interred in the shrine built on Mount Carmel. Bahá'ís consider the shrine to be their second holiest place on Earth after the Shrine of Bahá'u'lláh in Acre. Its precise location on Mount Carmel was shown by Bahá'u'lláh himself to his eldest son, 'Abdu'l-Bahá, in 1891. 'Abdu'l-Bahá planned the structure, which was designed and completed several years later by his grandson, Shoghi Effendi. In a separate room, the remains of 'Abdu'l-Bahá were buried in November 1921.[64] British Mandate Haifa was captured from the Ottomans in September 1918 by Indian horsemen of the British Army armed with spears and swords who overran Ottoman positions.[65] On 22 September, British troops were heading to Nazareth when a reconnaissance report was received indicating that the Turks were leaving Haifa. The British made preparations to enter the city and came under fire in the Balad al-Sheikh district (today Nesher). After the British regrouped, an elite unit of Indian horsemen were sent to attack the Turkish positions on the flanks and overrun their artillery guns on Mount Carmel.[65] In the early 20th century, early Ahmadi Muslims migrated to Kababir, a small suburb of Haifa, today consisting of Jews and Ahmadis. Over years the community developed and now acts as the Arab centre of the community. The community broadcasts its programmes to the Arab world via the MTA 3 channel from Haifa. Kababir is also known for its Mahmood mosque, a unique architectural landmark.[66] Under the British Mandate, Haifa saw large-scale development and became an industrial port city.[54][67] The Baháʼí Faith in 1918 and today has its administrative and spiritual centre in the environs of Haifa.[68][69] Many Jewish immigrants of the Fourth Aliyah and Fifth Aliyah settled in Haifa. The port was a major source of income, and the nearby Jewish towns of the Krayot were established in the 1930s. At the same time, the Arab population also swelled by an influx of migrants, coming mainly from surrounding villages as well as the Syrian Hauran.[70] The Arab immigration mainly came as a result of prices and salary drop.[70] The 1922 census of Palestine, conducted by the British authorities, recorded Haifa's population as 24,634 (9,377 Muslims, 8,863 Christians, 6,230 Jews, 152 Baháʼí, and 12 Druze).[71] By the time of the 1931 census of Palestine, this had increased to 50,403 (20,324 Muslims, 15,923 Jews, 13,824 Christians, 196 Baháʼí, 126 Druze, and 10 with no religion).[72][73][74] Between the censuses of 1922 and 1931, the Muslim, Jewish, and Christian populations rose by 217%, 256%, and 156%, respectively.[75] In 1938, 99,000 people (including 48,000 Jews) lived in Haifa.[76][77] Haifa's development owed much to British plans to make it a central port and hub for Middle-East crude oil. The British Government of Palestine developed the port and built refineries, thereby facilitating the rapid development of the city as a center for the country's heavy industries. Haifa was also among the first towns to be fully electrified. The Palestine Electric Company inaugurated the Haifa Electrical Power Station already in 1925, opening the door to considerable industrialization.[78] The State-run Palestine Railways also built its main workshops in Haifa. During World War II, the city was repeatedly hit during the Italian bombing of Mandatory Palestine, with the port and refineries being major targets. By 1945 the population was 138,300 (75,500 Jews, 35,940 Muslims, 26,570 Christians, and 290 \"other\").[79][80][81] In 1947, about 70,910 Arabs (41,000 Muslims and 29,910 Christians) and 74,230 Jews were living there.[82] The Christian community were mostly Greek-Melkite Catholics. 1947–1948 Civil War in Palestine The 1947 UN Partition Plan in late November 1947 designated Haifa as part of the proposed Jewish state. Arab protests over that decision evolved into violence between Jews and Arabs that left several dozen people dead during December.[83] The Arab city was in a state of chaos. The local Arab national committee tried to stabilize the situation by organizing garrison, calming the frightened residents and to stop the flight. In a public statement, the national committee called upon the Arab residents to obey orders, be alert, keep calm, and added: \"Keep away the cowards who wish to flee. Expell them from your lines. Despise them, because they harm more than the enemy\". Despite the efforts, Arab residents abandoned the streets which bordered Jewish neighborhoods and during the days of the general strike instigated by the Arab Higher Committee, some 250 Arab families abandoned the Khalisa neighborhood.[84] On 30 December 1947, members of the Irgun, a Jewish underground militia, threw bombs into a crowd of Arabs outside the gates of the Consolidated Refineries in Haifa, killing six and injuring 42. In response, Arab employees of the company killed 39 Jewish employees in what became known as the Haifa Oil Refinery massacre.[85] The Jewish Haganah militia retaliated with a raid on the Arab village of Balad al-Shaykh, where many of the Arab refinery workers lived, in what became known as the Balad al-Shaykh massacre.[86] British forces in Haifa redeployed on 21 April 1948, withdrawing from most of the city while still maintaining control over the port facilities. According to Ilan Pappé, although the Jewish mayor of the city, Shabtai Levy, urged the Arab residents to stay, in other parts of town loudspeakers could be heard ordering Arabs to leave \"before it's too late.\"[87] On 21 April, the downtown, controlled by a combination of local and foreign (ALA) Arab irregulars, was assaulted by Jewish forces in Operation Bi'ur Hametz by the Carmeli Brigade of the Haganah, commanded by Moshe Carmel. Arab neighborhoods were attacked with mortars and gunfire,[88] which, according to Ilan Pappé, culminated in an attack on a Palestinian crowd in the old marketplace using three-inch (76 mm) mortars on 22 April 1948.[89][90][91] Rashid al-Haj Ibrahim, a Palestinian Arab municipal leader, described attacks \"provoking terror among the women and children, who were very influenced by the horrors of Dayr Yasin\", and provided an eyewitness account of the flight of Haifa's Arab residents:[88] Thousands of women, children and men hurried to the port district in a state of chaos and terror without precedent in the history of the Arab nation. They fled their houses to the coast, barefoot and naked, to wait for their turn to travel to Lebanon. They left their homeland, their houses, their possessions, their money, their welfare, and their trades, to surrender their dignity and their souls. The operation led to a massive displacement of Haifa's Arab population, and was part of the larger 1948 Palestinian expulsion and flight. According to The Economist at the time, only 5,000–6,000 of the city's 62,000 Arabs remained there by 2 October 1948.[92] Morris quotes British sources as stating that during the battles between 22 and 23 April 100 Arabs were killed and 100 wounded, but he adds that the total may have been higher.[93] Historian Walid Khalidi described \"the mass exodus of Haifa’s Arab population\" as \"the spontaneous reaction to the ruthless combination of terror and psychological warfare tactics adopted by the Haganah during the attack.\"[1] State of Israel After the Declaration of the Establishment of the State of Israel on 14 May 1948 Haifa became the gateway for Jewish immigration into Israel. During the 1948 Arab–Israeli War, the neighborhoods of Haifa were sometimes contested. After the war, Jewish immigrants were settled in new neighborhoods, among them Kiryat Hayim, Ramot Remez, Ramat Shaul, Kiryat Sprinzak, and Kiryat Eliezer. Bnei Zion Hospital (formerly Rothschild Hospital) and the Central Synagogue in Hadar HaCarmel date from this period. In 1953, a master plan was created for transportation and the future architectural layout.[94] In 1959, a group of Sephardi and Mizrahi Jews, mostly Moroccan Jews, rioted in Wadi Salib, claiming the state was discriminating against them.[95] Their demand for \"bread and work\" was directed at the state institutions and what they viewed as an Ashkenazi elite in the Labor Party and the Histadrut.[96] Tel Aviv gained in status, while Haifa suffered a decline in the role as regional capital. The opening of Ashdod as a port exacerbated this. Tourism shrank when the Israeli Ministry of Tourism placed emphasis on developing Tiberias as a tourist centre.[97] Nevertheless, Haifa's population had reached 200,000 by the early 1970s, and mass immigration from the former Soviet Union boosted the population by a further 35,000.[54] The Matam high-tech park, the first dedicated high-tech park in Israel, opened in Haifa in the 1970s. Many of Wadi Salib's historic Ottoman buildings have now been demolished, and in the 1990s a major section of the Old City was razed to make way for a new municipal center.[54][96] From 1999 to 2003, several Palestinian suicide attacks took place in Haifa (in Maxim and Matza restaurants, bus 37, and others), killing 68 civilians. In 2006, Haifa was hit by 93 Hezbollah rockets during the Second Lebanon War, killing 11 civilians and leading to half of the city's population fleeing at the end of the first week of the war.[98] Among the places hit by rockets were a train depot and the oil refinery complex.[99][100] Demographics Haifa is Israel's third-largest city, consisting of 103,000 households,[103] or a population of 298,312. Immigrants from the former Soviet Union constitute 25% of Haifa's population,[104] thus making Russian one of the three main spoken languages of the city. According to the Israeli Central Bureau of Statistics, Israeli Arabs constitute 10% of Haifa's population, the majority living in the Wadi Nisnas, Abbas and Khalisa neighborhoods.[104] The Wadi Nisnas and Abbas neighborhoods are largely Christian,[105][106] Khalisa and Kababir are largely Muslim,[106] while Ein HaYam is a mixed Arab Christian and Muslim neighborhood.[106] Haifa is commonly portrayed as a model of co-existence between Arabs and Jews, although tensions and hostility do still exist.[107] Between 1994 and 2009, the city had a declining and aging population compared to Tel Aviv and Jerusalem, as young people moved to the center of the country for education and jobs, while young families migrated to bedroom communities in the suburbs. However, as a result of new projects and improving infrastructure, the city managed to reverse its population decline, reducing emigration while attracting more internal migration into the city. In 2009, positive net immigration into the city was shown for the first time in 15 years.[108][109] A development plan approved in 2016 seeks to raise Haifa's population to 330,000 residents by 2025.[110] Religious and ethnic communities The population is heterogeneous. Israeli Jews comprise some 82% of the population, almost 14% are Christians (the majority of whom are Arab Christians)[109] and, some 4% are Muslims. Haifa also includes Druze and Baháʼí Faith communities. In 2006, 27% of the Arab population was aged 14 and under, compared to 17% of the Jewish and other population groups. The trend continues in the age 15–29 group, in which 27% of the Arab population is found, and the age 30–44 group (23%). The population of Jews and others in these age groups are 22% and 18% respectively. Nineteen percent of the city's Jewish and other population is between 45 and 59, compared to 14% of the Arab population. This continues with 14% of Jews and others aged 60–74 and 10% over age 75, in comparison to 7% and just 2% respectively in the Arab population.[101] Arabs in Haifa tend to be wealthier and better educated compare to other Arabs elsewhere in Israel.[111] Haifa is home to the second-largest Arab Christian community in Israel,[112] many of them lives in the Arabic-speaking neighborhoods in the lowlands near the sea; neighborhoods such as German Colony, Wadi Nisnas and Abbas, are largely Arab Christian.[105][106] There are also a significant number of wealthy Christian Arabs in the Hadar West and Central.[106] The Christian communities of Haifa are varied and included various denominations, the most prominent among them the Melkite Greek Catholic, followed by Greek Orthodox, Latin Catholics, Maronites, Armenian Orthodox, and Protestants.[113] The Christian Arab communities in Haifa tend to be wealthier and better educated compare to other Arabs elsewhere in Israel.[114] The Melkite Greek Catholic Archeparchy of Akka is based in Haifa, and its cathedral episcopal see is St. Elijah Greek-Melkite Cathedral.[115] Following Israel's withdrawal from Lebanon in 2000, some former South Lebanon Army soldiers and officers who fled from Lebanon settled in Haifa with their families.[116] In 2006, 2.9% of the Jews in the city were Haredi, compared to 7.5% on a national scale.[101] However, the Haredi community in Haifa is growing fast due to a high fertility rate.[117] 66.6% were secular, compared to a national average of 43.7%.[101] There is also a Scandinavian Seamen Protestant church, established by Norwegian Righteous Among the Nations pastor Per Faye-Hansen.[118] Haifa is the center of liberal Arabic-speaking culture, as it was under British colonial rule. The Arabic-speaking neighborhoods, which are mixed Muslim and Christian, are in the lowlands near the sea, while Jewish neighborhoods are at a higher elevation. An active Arab cultural life has developed in the 21st century.[111] The city is the center of many Arab-owned businesses such as theaters, bars, cafes, restaurants and nightclubs which also host different cultural discussions and art exhibitions.[111] Geography Haifa is situated on the Israeli Mediterranean Coastal Plain, the historic land bridge between Europe, Africa, and Asia, and the mouth of the Kishon River.[119] Located on the northern slopes of Mount Carmel and around Haifa Bay, the city is split over three tiers.[120] The lowest is the center of commerce and industry including the Port of Haifa.[120] The middle level is on the slopes of Mount Carmel and consists of older residential neighborhoods, while the upper level consists of modern neighborhoods looking over the lower tiers.[120] From here views can be had across the Western Galilee region of Israel towards Rosh HaNikra and the Lebanese border.[120] Haifa is about 90 km (55.9 mi) north of the city of Tel Aviv, and has a large number of beaches on the Mediterranean.[121] Flora and fauna The Carmel Mountain has three main wadis: Lotem, Amik and Si'ach. For the most part these valleys are undeveloped natural corridors that run up through the city from the coast to the top of the mountain. Marked hiking paths traverse these areas and they provide habitat for wildlife such as wild boar, golden jackal, hyrax, Egyptian mongoose, owls and chameleons.[citation needed] Haifa is inundated with boars. The boars began to descend from the valleys around the city from before 2019, and began to roam in the city's streets. In 2019, mayor Einat Kalisch-Rotem decided to stop shooting the boars.[122] Boar sighting figures have struggled to go down since the Israel Nature and Parks Authority began fencing off forested areas, because residents often feed the boars.[123] Climate Haifa has a hot-summer Mediterranean climate with hot, dry summers and mild, rainy winters (Köppen climate classification Csa).[124] Spring arrives in March when temperatures begin to increase. By late May, the temperature has warmed up considerably to herald warm summer days. The average temperature in summer is 26 °C (79 °F) and in winter, 12 °C (54 °F). Frost is rare in Haifa, but temperatures around 3 °C (37 °F) can sometimes occur, usually in the early morning. Snow is very rare, which last fell in 1950. Humidity tends to be high all year round, and rain usually occurs between September and May. Annual precipitation is approximately 629 mm (25 in). Neighborhoods Haifa has developed in tiers, from the lower to the upper city on the Carmel. The oldest neighborhood in modern Haifa is Wadi Salib, the Old City center near the port, which has been bisected by a major road and razed in part to make way for Government Buildings. Wadi Salib stretches across to Wadi Nisnas, the center of Arab life in Haifa today. In the 19th century, under Ottoman rule, the German Colony was built, providing the first model of urban planning in Haifa. Some of the buildings have been restored and the colony has turned into a center of Haifa nightlife.[120] The first buildings in Hadar were constructed at the start of the 20th century. Hadar was Haifa's cultural center and marketplace throughout the 1920s and into the 1980s, nestled above and around Haifa's Arab neighborhoods. Today Hadar stretches from the port area near the bay, approximately halfway up Mount Carmel, around the German Colony, Wadi Nisnas and Wadi Salib.[128] Hadar houses two commercial centers (one in the port area, and one midway up the mountain) surrounded by some of the city's older neighborhoods. Neve Sha'anan, a neighborhood located on the second tier of Mount Carmel, was founded in the 1920s. West of the port are the neighborhoods of Bat Galim, Shikmona Beach, and Kiryat Eliezer. To the west and east of Hadar are the Arab neighborhoods of Abbas and Khalisa, built in the 1960s and 70s.[129] To the south of Mount Carmel's headland, along the road to Tel Aviv, are the neighborhoods of Ein HaYam, Shaar HaAliya, Kiryat Sprinzak and Neve David. Above Hadar are affluent neighborhoods such as the Carmel Tzarfati (French Carmel), Merkaz HaCarmel (Carmel Center), Romema (Ramot Ben Gurion), Ahuzat HaCarmel (Ahuza), Carmeliya, Vardiya, Ramat Golda, Ramat Alon and Hod Ha'Carmel (Denya). While there are general divisions between Arab and Jewish neighborhoods, there is an increasing trend for wealthy Arabs to move into affluent Jewish neighborhoods.[109] Another Carmel neighborhood is Kababir, home to the National Headquarters of Israel's Ahmadiyya Community;[129] located near Merkaz HaCarmel and overlooking the coast. Urban development Recently, residential construction has been concentrated around Kiryat Haim and Kiryat Shmuel, with 75,000 m2 (807,293 sq ft) of new residential construction between 2002 and 2004, the Carmel, with 70,000 m2 (753,474 sq ft), and Ramot Neve Sha'anan with approximately 70,000 m2 (753,474 sq ft)[130] Non-residential construction was highest in the Lower Town, (90,000 sq m), Haifa Bay (72,000 sq m) and Ramot Neve Sha'anan (54,000 sq m).[130] In 2004, 80% of construction in the city was private.[130] Currently, the city has a modest number of skyscrapers and high-rise buildings.[131] Though buildings rising up to 20 stories were built on Mount Carmel in the past, the Haifa municipality banned the construction of any new buildings taller than nine stories on Mount Carmel in July 2012.[132] The neighborhood of Wadi Salib, located in the heart of downtown Haifa, is being redeveloped. Most of its Jewish and Arab residents are considered squatters and have been gradually evicted over the years. The Haifa Economic Corporation Ltd is developing two 1,000 square meter lots for office and commercial use.[133] Some historic buildings have been renovated and redeveloped, especially into nightclubs and theaters, such as the Palace of the Pasha, a Turkish bathhouse, and a Middle Eastern music and dance club, which has been converted into theaters and offices.[96] In 2012, a new, massive development plan was announced for Haifa's waterfront. According to the plan, the western section of the city's port will be torn down, and all port activity will be moved to the east. The west side of the port will be transformed into a tourism and nightlife center and a point of embarkation and arrival for sea travel through the construction of public spaces, a beach promenade, and the renovation of commercial buildings. The train tracks that currently bisect the city and separate the city's beach from the rest of Haifa will also be buried.[134] A park will be developed on the border of the Kishon River, the refineries' cooling towers will be turned into a visitors' center, and bridges will lead from the port to the rest of the city. Massive renovations are also currently underway in Haifa's lower town, in the Turkish market and Paris Square, which will become the city's business center.[135] In addition, the ammonia depository tank in the Haifa bay industrial zone will be dismantled, and a new one built in an alternative location.[136] Another plan seeks to turn the western section of Haifa Port into a major tourism and nightlife center, as well as a functioning point of embarkation and arrival for sea travel. All port activity will be moved to the western side, and the area will be redeveloped. Public spaces and a beach promenade will be developed, and commercial buildings will be renovated.[137] As part of the development plans, the Israeli Navy, which has a large presence in Haifa, will withdraw from the shoreline between Bat Galim and Hof Hashaket. A 5 km (3.1 mi) long esplanade which will encircle the shoreline will be constructed. It will include a bicycle path, and possibly also a small bridge under which navy vessels will pass on their way to the sea.[138] In addition, a 50,000 square-meter entertainment complex that will contain a Disney theme park, cinemas, shops, and a 25-screen Multiplex theater will be built at the Check Post exit from the Carmel Tunnels.[139] In 2014, a new major plan for the city was proposed, under which extensive development of residential, business, and leisure areas will take place with the target of increasing the city's population by 60,000 by 2025. Under the plan, five new neighborhoods will be built, along with new high-tech parks. In addition, existing employment centers will be renovated, and new leisure areas and a large park will be built.[140] In 2016, a new plan for the city was approved. The plan included a new main downtown business district, the creation of a park in a current industrial area, new construction and renovation of public buildings and hubs of higher education, tourism, culture, commerce, leisure, and residence.[110] Economy The common Israeli saying, \"Haifa works, Jerusalem prays, and Tel Aviv plays\" attests to Haifa's reputation as a city of workers and industry.[141] The industrial region of Haifa is in the eastern part of th"
}