{
  "url": "https://www.spanishdict.com/guide/u-with-an-accent",
  "title": "“U” with an Accent | SpanishDictionary.com",
  "text": "“U” with an Accent The letter u with a tilde serves a variety of purposes in Spanish, such as marking word stress and distinguishing between types of words. Ú and Word Stress A written accent placed over a letter primarily serves as a pronunciation marker. It indicates which syllable to stress. In words like crepúsculo(twilight), the accent is necessary because it tells us to pronounce the first u with greater emphasis. Let’s take a look at the various types of words that use an u with a tilde: Diphthongs and Hiatus A diptongo(diphthong) is any combination of two vowels pronounced as one syllable, for example a strong + weak or weak + weak vowel combination, as in lengua(language), canción(song), or cuidar(to care for). On the other hand, when a sequence of vowels is pronounced as two syllables in Spanish, that sequence is called an hiato(hiatus). A hiatus may be formed by a combination of an unstressed open vowel (a, e, o) + a stressed closed vowel (i, u), as in reír(to laugh), oír(to hear), and transeúnte(passerby), or a combination of a stressed closed vowel + unstressed open vowel, as in María(Mary) and frío(cold). The reason that Raúland baúlhave a tilde over the u is that they contain an unstressed open vowel followed by a stressed closed vowel—that is, a hiatus—and hiatus carry a tilde no matter what! Ú and Word Types A tilde over a vowel may mark the difference between certain possessive adjectives and subject pronouns. The following examples demonstrate that when a tilde is added, the possessive adjective tu(your) changes to the subject pronoun tú(you). Writing/Typing an Accent Over the U The tilde over the u is written as a short diagonal line, from the top right to the bottom left. To type ú on your keyboard, you can copy and paste ú, use the character code Alt + 0250, or learn the keyboard shortcuts on your Mac or PC. Take a look at how to type ú on your Mac or PC! On a PC There are several keyboard shortcuts you can use for Spanish letters and punctuation on your PC. Please note that these shortcuts sometimes only work on newer computers and may only work in Microsoft Office. If you’re using Office for Windows, use the following shortcut: - For an ú, press Ctrl + ', then the u. On a Mac To get the ú on a Mac, hold down the Option/Alt key (⌥), and press the e key. Then, release both keys and press the u key. If you write in Spanish often, we recommend going into your settings and adding the US International keyboard. This keyboard layout supports all major Western European languages, and it uses the right Alt key as a modifier for special characters. Would you like to learn more about accents and word stress in Spanish? Check out these articles!"
}