{
  "url": "https://www.jules.com/",
  "title": "Jules | Vêtements homme et prêt-a-porter masculin",
  "text": "Déclarez votre flamme Une collaboration audacieuse pour celles et ceux qui n’ont pas froid au style… ni au cœur. Je découvreCapsule exclusive Cette capsule FRANCE RUGBY célèbre les émotions du jeu : le courage, la fierté, l’esprit d’équipe. Je découvreAlors on sait que ce qui fait votre beauté, c'est bien plus que votre physique. Vous êtes BEAUX parce que vous aimez, vous supportez, vous contestez, vous râlez, vous riez... Vous êtes beaux parce que vous avez confiance en vous, que vous avez du talent... Mais aussi parce que vous doutez, que vous ratez et que vous recommencez. On sait aussi que vous aimez avoir de l'ALLURE, dans le regard des femmes, des hommes, de vos enfants, de vos potes… bref dans les yeux de tous ceux qui comptent pour vous. Chez Jules, on vous observe, vous, ce que vous faites, et tout ce que vous êtes. On s'intéresse à ce qui vous fait vibrer et à tout ce qui vous saoule…Et on crée avec PASSION autant de vêtements qu'il y a d'hommes différents, à des prix accessibles, sans jamais renier la qualité et dans le plus grand respect de la planète. Des looks qui vous permettent de vous sentir le plus à l'aise possible, dans votre peau comme dans vos gestes, pour que vous gardiez cette CONFIANCE EN VOUS, qui vous permet de vous exprimer et d'être la belle personne que vous êtes, dans tous les moments de votre vie. Avec nous, pas de blabla, pas de fashion faux pas, mais toujours un REGARD COMPLICE à vos côtés. Chez Jules on sait que chaque homme a QUELQUE CHOSE DE BEAU EN LUI, et notre savoir-faire c'est de le mettre en valeur aux yeux de tous. JULES, ET EN PLUS VOUS ÊTES BEAU. Vous cherchez un style qui vous ressemble, sans compromis sur le confort ? Vous êtes au bon endroit. Découvrez notre collection de vêtements pour homme. Des basiques revisités, comme les jeans, les chinos et les tee-shirts, aux pièces plus habillées comme les chemises et les vestes de costume , nous avons tout ce qu'il vous faut pour créer des looks aussi variés que vos envies. Que vous souhaitiez affronter l'hiver emmitouflé dans un pull douillet ou profiter de l'été en bermuda pour homme, notre collection pour homme s'adapte à toutes les saisons et à toutes les occasions. L'élégance n'a jamais été aussi accessible : osez les combinaisons audacieuses et les coupes modernes pour un style unique qui vous démarquera. Nos vêtements pour homme sont pensés pour vous offrir un confort absolu, tout en vous permettant d'affirmer votre personnalité. Des coupes ajustées, des matières nobles et des finitions soignées : chaque détail compte. Que vous soyez un homme au style plutôt casual, chic ou sportif, vous trouverez forcément votre bonheur dans notre collection. Mixez les pièces, osez les couleurs, créez votre propre style."
}