{
  "url": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-fall-for-2nd-day-as-tech-slides-on-ai-worries-with-google-earnings-ahead-210024017.html",
  "title": "Stock market today: S&P 500, Nasdaq fall for 2nd day as tech slides on AI worries with Google earnings ahead",
  "text": "Stock market today: S&P 500, Nasdaq fall for 2nd day as tech slides on AI worries with Google earnings ahead US stocks mostly fell on Wednesday as Wall Street assessed a fresh wave of earnings and waited for Alphabet (GOOG, GOOGL) results, eyeing the fallout from an AI-stoked slump in software and tech stocks. The S&P 500 (^GSPC) slid about 0.5%, while the Nasdaq Composite (^IXIC) fell over 1.5%, continuing their bruising from Tuesday's session. The Dow Jones Industrial Average (^DJI) rose 0.4% as investors rotated away from tech stocks and into more blue-chip names. Wall Street is failing to find its feet after AI disruption fears fueled a rush out of software stocks — spilling over into a deep global sell-off that hit Europe and Asia markets alike. Meanwhile, broader AI gloom has helped spur the rotation from high-profile tech names into value stocks, with megacaps taking the hit. Nvidia (NVDA) fell over 3%, while Google fell nearly 2% ahead of its earnings reveal. Amazon (AMZN) slid over 2%, and Tesla (TSLA) sank more than 3%. Even better-than-expected earnings are no longer enough to convince the market, JPMorgan warned, unless the company reporting can show that AI will be a tailwind rather than a headwind. Advanced Micro Devices (AMD) shares plummeted as the chipmaker's weak sales outlook cast doubt on its ability to take on AI bellwether Nvidia. In a sign of cracks in the labor market, an ADP report showed employers added just 22,000 jobs in January, versus the 45,000 expected. Private data has taken on outsized importance amid the delay in federal jobs data from the partial government shutdown that ended Tuesday, as the Bureau of Labor Statistics has rescheduled the official jobs report for next Wednesday. Meanwhile, gold (GC=F) gained amid US-Iran tensions, but its comeback from a hefty record-shedding slump faltered as it fell back below $5,000 an ounce. Bitcoin (BTC-USD) losses also piled up, as the cryptocurrency traded near $72,000 at one point. In corporates, pharma fortunes diverged as Eli Lilly's (LLY) stock jumped after it posted an upbeat 2026 profit forecast thanks to soaring demand for its weight-loss drugs. But shares in rival Novo Nordisk (NVO, NOVO-B.CO) tumbled after the maker of Ozempic and Wegovy shocked investors by forecasting a steep drop in sales. LIVE 25 updates"
}