{
  "url": "https://nameberry.com/b/boy-baby-name-ivan",
  "title": "Ivan - Baby Name Meaning, Origin, and Popularity for a Boy | Nameberry",
  "text": "Ivan Russian variation of John \"God is gracious\" Share Copy link Ivan Origin and Meaning Variation of Ivanhoe - Ivan Rank in US Top 1000 - Ivan Rank in Nameberry Top 1000 - Names Similar to Ivan - Famous People Named Ivan - The name Ivan in Pop Culture - International Variations of the name Ivan - The name Ivan in Nameberry Blog Posts - The name Ivan in Nameberry Forums # 153 in the US Ivan Rank in US Top 1000 # 361 on Nameberry Ivan Rank in Nameberry Top 1000 Popularity of the name Ivan - 153US2024 - 361Nameberry2026 - 139Future2028 - 274England2024 - 288Germany2016 - 77Spain2023 - 66Portugal2014 - 69Mexico2021 - 191switzerland2023 - 191Poland2020 - 25Estonia2025 - 38Bosnia and Herzegovina2024 - 7Croatia2024 - 11Ukraine2022 20 Names Similar to Ivan These 20 names were selected by our users that were looking for other names like Ivan. - Kenneth - Emmanuel - Duncan - Julien - Marcus - Seth - Jeremiah - Marco - Raymond - Ruben - Malcom - Jesse - Rafael - Neil - Dominic - Lorenzo - Bruce - Joel - Julius - Donovan Famous People Named Ivan - Ivan I Daniilovich KalitaPrince of Moscow - Ivan II Ivanovich the FairPrince of Moscow - Ivan III Vasilyevich aka Ivan the GreatPrince of Moscow - Ivan IV Vasilyevich aka Ivan the TerribleTsar of Russia - Ivan AlexanderTsar of Bulgaria - Ivan Asen I and IITsars of Bulgaria - Ivan Khristoforovich BagramyanRussian WWII commander - Ivan Lendltennis player - Ivan Andreyevich BukinRussian ice dancer - Ivan BassoItalian road bicycle racer - Ivan AivazovskyRussian painter - (Ivan) Nathan Followillmusician from band \"Kings of Leon\" - Ivan TodorovicSerbian footballer (plays for Portugal) - Ivan \"Kuki\" KukoljSerbian singer - Ivan SanchezSpanish actor - Ivan DodigCroatian tennis player - Ivan Petrovich Pavlovrenowned Russian physiologist and Nobel Prize winner - Ivan Buninwinner of the Nobel Prize in Literature - Ivan MartinezSpanish YouTuber; twin brother Emilio Martinez - Ivan OrkinAmerican chef, creator of Ivan Ramen restaurants The name Ivan in Pop Culture - Ivan Braginskypersonification of Russia in the manga/anime Axis Powers: Hetalia - \"The One and Only Ivan\"novel by Katherine Applegate - Ivan Alexeevcharacter in film \"Tapeheads\" - Ivancharacter in animated series \"Foster's Home for Imaginary Friends\" - \"Ivan the Fool\" short story by Leo Tolstoy - Ivan Vankovillain in \"The Invincible Iron\" comics - Ivan Denisovich Shukhovtitle character in Aleksandr Solzhenitsyn's \"One Day in the Life of Ivan Denisovich\" - Ivancharacter in video game \"Golden Sun\" - Ivan Vassilevich Lomovcharacter in Anton Chekhov's \"A Marriage Proposal\" - Ivan Raidenovich Raikovcharacter in video game \"Metal Gear Solid 3: Snake Eater\" - \"The Death of Ivan Ilyich\" novel by Leo Tolstoy - Ivan Karamazovcharacter in Fyodor Dostoevsky's \"The Brothers Karamazov\" - Ivandoorman in 2006 film \"Curious George\" - Ivan Veenmain character in Vladimir Nabokov's \"Ada or Ardor\" - Ivan Dragoboxer in film \"Rocky IV\" - Ivan Nikolayevich Ponyryov (Bezdomny)character in Mikhail Bulgakov's \"The Master and Margarita\" - Ivan Shawblycharacter on TV's \"Mona the Vampire\" - Ivancharacter in Aphmau's YouTube series - Ivan Bruelcharacter in \"Miraculous: Tales of Ladybug & Cat Noir\" - Ivana vampire in the French online visual novel Moonlight Lovers International Variations of the name Ivan - VanushaRussian - EyvindIrish Gaelic - VanyaRussian - VánaCzech - YvanBreton - IoannRussian - VánuskaCzech - IwanWelsh - EyvanIrish Gaelic - IvánekCzech The name Ivan in Nameberry Blog Posts - How to Name Your Baby After Your Grandpa - Vampire Names Bite Back! - Top Boys Name For Each Letter: a 130-year survey - 100 Brilliant Boy Names in Translation - The Top Global Names Right Now - The Baby Names That Should Be on Everyone's List More Lists containing Ivan - Names that Peaked in 2004 - Russian Names - Russian Names for Boys - 4 Letter Boy Names - Names Ending in N for Boys - Names That Mean God - Names That Mean Gracious - Names That Mean Variation - Names that Peaked in 2012 - Two Syllable Names for Boys - Boy Dog Names That Start With I - Dog Names That Start With I - Animal Names for Boys - Eastern European Names - Russian Names that Start With I Find your type. Analyze your Baby Name DNA and find the names that match your unique style. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access."
}