{
  "url": "https://dictionary.cambridge.org/dictionary/english/taste",
  "title": "TASTE | English meaning - Cambridge Dictionary",
  "text": "taste noun uk /teɪst/ us /teɪst/taste noun (FLAVOUR) B1 [ C or U ] - When preparing meals, you need to think about variety and taste as well as nutritional value. - Lemons have a sharp taste. - This wine has a light, fresh taste. - Aniseed has a very distinctive taste - I don't like it personally. - We value herbs for their taste, but we forget that they also have medicinal properties. - acidic - acidulous - acridly - aftertaste - ageusia - flavourfully - flavourless - flavoursome - fruitily - fruitiness - pungency - pungently - saltily - saltiness - salty - umami - unseasoned - unsweetened - velvety - vinous You can also find related words, phrases, and synonyms in the topics: taste noun (JUDGMENT) - adorkable - affection - appreciate - approve of someone - attached - attachment - be a glutton for something idiom - dig - fancy - go a bundle on something idiom - go for someone phrasal verb - gravitate towards/to something/someone phrasal verb - grow on someone phrasal verb - hatefully - predilection - prize - proclivity - protective - shine - shook You can also find related words, phrases, and synonyms in the topics: taste noun (EXPERIENCE) taste verb [T] (FOOD/DRINK) - al desko - binge - binge eating - bite - break bread idiom - devour - feeder - feeding - finish - finish up phrasal verb - food baby - gobble - graze - gulp - partake - pick - pick at something phrasal verb - picnic - pig - snaffle You can also find related words, phrases, and synonyms in the topics: taste verb [T] (EXPERIENCE) - (straight) from the horse's mouth idiom - afflict - affliction - almost/nearly die of something idiom - battle scar - be a martyr to something idiom - bear - depth - escape - get the short end of the stick idiom - go through phrasal verb - grief-stricken - grip - hands-on - horse - practical - run up against something phrasal verb - seat-of-the-pants - see life idiom - stricken"
}