{
  "url": "https://www.mined.gob.sv/",
  "title": "Ministerio de Educación, Ciencia y Tecnología",
  "text": "INSTITUCIONES Portal de Transparencia Gestion de casos antisoborno Generic selectors Exact matches only Exact matches only Search in title Search in title Search in content Search in content Search in excerpt Search in posts Search in posts Search in pages Search in pages EN ES Inicio Servicios Nuestro Trabajo Programas Institución Primera Infancia Educación Superior Evaluación de los aprendizajes SIGES Correo Institucional Estadísticas Educativas Marco Institucional Planificación Institucional Logros y Memorias Portal de Transparencia Contáctenos Denuncias de Casos Antisoborno Solicitud de Información Pública Preguntas Frecuentes Directorio Horarios de atención Avisos y denuncias Organismos Internacionales Banco Mundial – Estándares Ambientales y Sociales Anterior Siguiente Trámites y Servicios en Línea Portal de Calidad Educación Familiar El Do, Re, Mi, Fa, Sol de Mis Derechos Gestion Educativa Política del Sistema de Gestión Antisoborno Código de Ética Curso del Sistema de Gestión Antisoborno AVISOS Mar 10 2023 En cumplimiento de lo dispuesto por la Corte IDH, publicamos la Sentencia del caso Manuela y otros Vs. El Salvador, 2 de noviembre de 2021 Feb 03 2026 SDO 40/2025 MINEDUCYT BIRF“ADQUISICIÓN DE MATERIALES DIDÁCTICOS DE ARTE Y CONSTRUCCIÓN PARA EL DESARROLLO DE LA MOTRICIDAD FINA Y GRUESA PARA NIÑEZ DE PRIMERA INFANCIA Feb 02 2026 CP No. 16/2025 MINEDUCYT-BID 7521 “SUMINISTRO DE ELECTRODOMÉSTICOS PARA LOS CENTROS DE DESARROLLO INFANTIL (CDI)” NOTICIAS Ene 13 2025 ACUERDO No. 15-2315 «INSTRUCTIVO PARA LA ADQUISICIÓN DE BIENES Y SERVICIOS DEL PROGRAMA DOTACIÓN DE UNIFORMES, ZAPATOS Y ÚTILES ESCOLARES. Ene 13 2025 Documentos Circular No 1 – Orientaciones para la Conformación Directivas Grado y Consejo Estudiantes, Orientaciones Normas de Convivencia y Reglamento Interno Escolar Sep 29 2022 MINED e Instituciones de Educación Superior lanzan campaña «Súmate a la U» Estadísticas Educativas Descargas Preguntas Frecuentes Programas Avisos"
}