{
  "url": "https://stockanalysis.com/stocks/baba/",
  "title": "Alibaba Group Holding (BABA) Stock Price & Overview",
  "text": "Alibaba Group Holding Limited (BABA) About BABA Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. It operates digital retail platforms under the Taobao and Tmall names; wholesale marketplaces through 1688.com and Alibaba.com; global e-commerce platform under the AliExpress name; e-commerce platforms under the Lazada, Trendyol, and Daraz names; and consumer-to-consumer community ... [Read more] Financial Performance In fiscal year 2025, Alibaba's revenue was 996.35 billion, an increase of 5.86% compared to the previous year's 941.17 billion. Earnings were 129.47 billion, an increase of 62.36%. Financial numbers in CNY Financial StatementsAnalyst Summary According to 14 analysts, the average rating for BABA stock is \"Strong Buy.\" The 12-month stock price target is $188.69, which is an increase of 18.57% from the latest price. News First Eagle Global Equity ETF Q4 2025 Portfolio Review The Global Equity ETF posted a return of 5.58% in fourth quarter 2025. Leading contributors in the First Eagle Global Equity ETF this quarter included Samsung Electronics Co., Ltd., Alphabet Inc. Clas... Alibaba Raises Stakes in China's Chatbot War Ahead of Lunar New Year China-based Alibaba plans to spend 3 billion yuan (about $432 million) during the Lunar New Year holiday to promote its Qwen artificial intelligence app, Reuters reported Monday (Feb. 2). The move esc... Alibaba to spend $431 million for Lunar New Year AI push as chatbot war heats up Alibaba said on Monday it will spend 3 billion yuan ($431 million) to attract users to its Qwen AI app during the Lunar New Year holiday, heating up a race between China's largest tech firms. Alibaba to merge with China's Zelos on $2 billion robovan business, WSJ reports Alibaba's logistics arm plans to merge its autonomous-driving unit Cainiao with China's Zelos Technology, forming a new entity valued at approximately $2 billion, the Wall Street Journal reported on T... Alibaba to Team Up With Zelos on $2 Billion Robovan Business Alibaba's logistics arm plans to merge its autonomous-driving unit with Chinese robovan specialist Zelos Technology. 'Very constructive' on Asia in 2026, with Chinese stocks tipped for 20% gains: Goldman Sachs Kevin Sneader, President of APAC exâJapan at Goldman Sachs, speaks with CNBC's Emily Tan on the sidelines of the 19th Asian Financial Forum. He points to investor appetite for AI driving flows into As... One year after DeepSeek, Chinese AI firms from Alibaba to Moonshot race to release new models Chinese tech firms are releasing AI models at a faster pace as competition with U.S. rivals tightens. Open-source and low-cost strategies are driving the adoption of Chinese AI in emerging markets. First Eagle Overseas Fund Q4 2025 Portfolio Review First Eagle Overseas Fund A Shares (without sales charge*) posted a return of 5.78% in fourth quarter 2025. Leading contributors in the First Eagle Overseas Fund this quarter included gold bullion, FA... Texas governor bars state employees from using Alibaba, Temu products Texas will bar its employees from using Alibaba, Temu and TP-Link hardware and software, the governor said in a statement, saying his state made the decision to protect the \"privacy of Texans\" from th... 5 Tech Stocks Surging as Wall Street Money Floods East Investing in China is always fraught with political tensions from the ruling government. Alibaba and Tencent's woes are just two recent examples. Alibaba Reportedly Planning T-Head Spinoff â Eyeing High China Chip Valuations? China's leading e-commerce company is reportedly considering a spinoff and separate listing for its chip-making unit, following a similar plan by Baidu Alibaba Stock Gains. How It Plans to Rival Nvidia on AI Chips. Alibaba is one of multiple Chinese companies hoping to take advantage of the gap left by Nvidia's current absence from China's artificial-intelligence chip market. Alibaba reportedly lining up AI chip IPO after wave of Chinese offerings Alibaba shares were rallying in premarket trade after a report it may float its chipmaking unit called T-Head. Alibaba to plan IPO for AI chipmaking unit T-Head, Bloomberg News reports Alibaba is preparing to list its chipmaking arm, T-Head, Bloomberg News reported on Thursday, citing people familiar with the matter. Final Trades: IBM, Alibaba, Nu Holdings and the IYH The Investment Committee give you their top stocks to watch for the second half. BABA Signals China's Nuclear Power Shift Amid AI Surge Alibaba's (BABA) electricity generation venture with China Nuclear Power Co. follows similar moves in American mega caps like Microsoft (MSFT) and Meta Platforms (META) to power AI. Marley Kayden talk... China's Alibaba and ByteDance Embrace Agentic Commerce Big Tech companies in China like Alibaba and ByteDance are adding agentic commerce to their arsenal, CNBC reported Wednesday (Jan. 21). Alibaba updated its consumer-facing Qwen AI chatbot last week wi... Chinese tech giants enter the 'agentic commerce' race as AI reshapes super apps Chinese tech firms are turning AI chatbots into full-service shopping and payment tools. Alibaba, Tencent and ByteDance are racing to build AI-powered super apps. Calamos Convertible Fund Q4 2025 Performance Update For the quarter ended December 31, 2025, the fund returned 1.59% (Class I shares at NAV) versus the ICE BofA VXA0 - Convertible Index return of 1.97%. Lumentum's stock and convertible advanced signifi... Alibaba-backed startup Moonshot AI's valuation is up $500 million, sources say, after its rivals IPO in Hong Kong Investors are now valuing Alibaba-backed Moonshot AI at $4.8 billion, two people familiar with the matter told CNBC. It's a $500 million increase in the valuation the startup achieved last month. Alibaba Stock Drops After a Blistering AI Rally. These 2 Worries Are Rattling Investors. Alibaba Group stock tumbled on Monday, taking some of the shine off a recent rally for the Chinese online retailer. Alibaba Qwen Upgrade: The Market Can No Longer Ignore This AI Catalyst Alibaba Group Holding Limited unveiled a major upgrade to its Qwen AI app, integrating it across core platforms for ecosystem-wide AI leverage. BABA's unified AI interface strategy aligns with China's... Alibaba Adds Agentic and Payments Capabilities to Consumer AI App Alibaba has added agentic and payments capabilities to its consumer-facing artificial intelligence (AI) app Qwen App. With new features that are now available for public testing in China, Qwen App can... Alibaba Updates Its Qwen AI App. How It's Following Microsoft and Alphabet. The online retailer said at a launch event on Thursday that it has connected Qwen to its e-commerce and online travel agency platforms. China's Alibaba Links Qwen AI App to Vast Consumer Ecosystem Alibaba Group is rolling out a major update of its Qwen app, integrating the chatbot into its ecosystem and allowing it to carry out tasks on users' behalf."
}