{
  "url": "https://www.britannica.com/quiz/i-am-the-greatest-athlete",
  "title": "I Am the Greatest (Athlete) Quiz | Britannica",
  "text": "I Am the Greatest (Athlete) - Question: Which heavyweight boxer proclaimed \"I am the greatest\" after his win over Sonny Liston? - Answer: Muhammad Ali is frequently called “the Greatest”; he lost only five fights during his career. He lent his voice for the animated series I Am the Greatest!: The Adventures of Muhammad Ali (1977). - Question: The number 42 is retired from all of Major League Baseball in honor of what player? - Answer: Jackie Robinson famously broke the Major League Baseball color line in 1947. He retired in 1956. The number 42 was retired in his honor in 1997. - Question: Which athlete is the most-decorated Olympian of all time, with a total haul of 28 medals, including 23 golds, of which a record 8 golds were won in a single Games? - Answer: With 8 golds in the Olympic Games in Beijing in 2008, Michael Phelps broke the previous record of 7 golds, set by Mark Spitz in 1972. - Question: Who set a 100-meter world record at the 2008 Olympic Games in Beijing while running with an untied shoe? - Answer: Usain Bolt was the first to win the 100-meter gold metal in three consecutive Olympic Games, doing so in 2008, 2012, and 2016. He repeated the feat in the 200-meter event. Bolt was so far ahead of his competition in the 2008 Beijing 100-meter event that he started celebrating before the race was over. - Question: One of the best basketball players in NBA history, who left the sport in 1994 to try his hand at professional baseball? - Answer: When Michael Jordan quit basketball (he was to return later), he decided to try baseball, partially as a tribute to his father, who had been murdered in the summer of 1993. - Question: Helping Brazil beat Sweden 5–2, at 17 years old, who is the youngest person to play and win in a World Cup final? - Answer: Pelé, at age 17, won his first World Cup in 1958 and went on to win two more, in 1962 and 1970. - Question: Roger Bannister was a British doctor and athlete who was the first to achieve what? - Answer: At the time, it was considered impossible to run a mile in less than four minutes. Without any formal training, Roger Bannister achieved the feat in 1954. - Question: With 24 victories, who has the most singles Grand Slam wins in the open era of tennis? - Answer: In September 2023 Novak Djokovic won the U.S. Open, his 24th Grand Slam victory, surpassing previous open era record holder Serena Williams. Margaret Court also has 24 Grand Slam wins, but many of them were before the open era. - Question: Jesse Owens made history by winning four Olympic gold medals in what city? - Answer: The 1936 Olympics in Berlin were intended by Adolf Hitler to be a showcase for Aryan supremacy. Jesse Owens, with his four gold medals, helped disprove such notions on Hitler’s home turf. - Question: Romanian athlete Nadia Comăneci stunned the world at the 1976 Olympic Games in Montreal by being the first to accomplish what feat? - Answer: When Nadia Comăneci scored a perfect 10, the scoreboard wasn't equipped to show 10.00. It showed 1.00 before officials announced the correct score. - Question: In 1986 what golfer won the last of his record 18 major championships at age 46? - Answer: Jack Nicklaus was the third oldest to win a major, doing so at the 1986 Masters Tournament. - Question: What successful NBA coach wrote a book called “Eleven Rings: The Soul of Success,” referring to the 11 championship wins he led his teams to? - Answer: Phil Jackson led the Chicago Bulls to six wins and the Los Angeles Lakers to five. He also was a practitioner of Zen Buddhism. Save your scores! Login before you play. Jed Jacobsohn/Getty Images Jed Jacobsohn/Getty Images"
}