{
  "url": "https://www.wsetglobal.com/knowledge-centre/blog/2024/tokaji-decoded-the-science-behind-hungary-s-iconic-sweet-wines/",
  "title": "Tokaji decoded: the science behind Hungary’s iconic sweet wines | Wine & Spirit Education Trust",
  "text": "Few wines can claim a legacy as rich as Tokaji. Hailing from Hungary’s Tokaj region—one of the world’s first officially classified wine regions—these sweet, golden-hued wines have graced the tables of kings and inspired poets for centuries. From Louis XIV of France, who called it \"Vinum Regum, Rex Vinorum\" (Wine of Kings, King of Wines), to Voltaire, who described it as a \"divine nectar,\" Tokaji has long been a symbol of luxury and excellence. What makes Tokaji truly special is its unique production process. Grapes affected by noble rot (Botrytis cinerea) shrivel on the vine, concentrating their sugars and flavours. The result? Wines that combine intense sweetness with vibrant acidity, creating a balance that has captivated wine lovers for generations. While the focus of this blog post is the sweetness that defines Tokaji’s iconic style, it’s important to note that the region also produces crisp, mineral-driven dry whites. These wines, primarily made from Furmint grapes, showcase Tokaj’s ability to craft high-acid, age-worthy wines that reflect the minerality of its volcanic soils. Whether you’re drawn to Tokaji’s illustrious history, curious about its science, or eager to explore its diverse styles, this guide will decode what makes these wines some of the most fascinating—and delicious—in the world. Scroll to the end for our quick quiz and see how much you’ve learned! WSET wine courses cover much you need to know about this fascinating region. From beginner-friendly overviews to in-depth modules in our advanced qualifications, you’ll gain the knowledge and confidence to explore Tokaji—and other world-class wine regions—with ease. Tokaj’s unique climate: the perfect conditions for sweet wines Tokaji vineyards are nestled on the slopes of the Carpathian Mountains, where a unique combination of climate and geography creates the perfect conditions for winemaking. The region’s moderate climate, coupled with the influence of rivers like the Bodrog and Tisza, generates humid mornings ideal for the development of noble rot (Botrytis cinerea), the key to Tokaji’s famed sweet wines. Sunny afternoons follow, helping to ripen the grapes and concentrate their natural sugars and flavours. This delicate balance of humidity and sunshine is rare, allowing Tokaj to consistently produce botrytised wines of remarkable complexity. For centuries, Hungarian winemakers have harnessed these natural advantages with precision, creating wines that combine intense sweetness with vibrant acidity. This balance not only defines Tokaji’s signature style but also ensures the wines remain fresh and age-worthy for decades. The grapes that define Tokaji Three key grape varieties form the foundation of Tokaji wines, each contributing distinct characteristics: - Furmint: The most widely planted grape, known for its high acidity and aging potential. Young Furmint delivers crisp apple flavours, which evolve into notes of honey and nuts with time. - Hárslevelű: Adds richness, floral aromas, and complexity to blends. - Sárga Muskotály (Muscat Blanc à Petits Grains): Bright and intensely aromatic, contributing lively freshness to Tokaji wines. These grapes are often blended to create balanced wines, but each can also shine in single-varietal expressions, especially in dry styles. Tokaji wine styles Tokaji Aszú The most iconic style of Tokaji, Tokaji Aszú, is crafted using hand-picked, botrytised grapes (aszú berries). These shriveled, sugar-rich berries are macerated into a base wine, creating an amber-hued liquid bursting with flavours of orange peel, apricots, and honey. The sweetness of Tokaji Aszú is traditionally measured using the puttonyos scale, which indicates the number of baskets (puttonyos) of botrytised grapes added to a barrel of wine. A higher number means more sweetness and concentration: - 5 puttonyos: Contains at least 120g/L residual sugar. Balanced and luscious, this is the entry point for aszú wines. - 6 puttonyos: Contains 150g/L or more of residual sugar. These wines are richer, with intense concentration and luxurious texture. Modern regulations now require all Tokaji aszú wines to contain at least 120g/L residual sugar, but the 6 puttonyos level is still used to signify higher sweetness and prestige. Eszencia The rarest and most concentrated Tokaji wine, Eszencia, is made exclusively from the free-run juice of botrytised grapes. No pressing is required; the juice slowly drips from the berries due to their extreme shriveling. - Residual sugar: Exceeds 450g/L, making it one of the sweetest wines in the world. - Alcohol: Typically under 5%, as the high sugar levels limit fermentation. Traditionally sipped in tiny amounts, it delivers an explosion of sweetness, balanced by vibrant acidity. This nectar-like wine is also famous for its longevity, capable of aging for over a century. Late harvest wines: a modern twist Late harvest wines are a more approachable take on Tokaji’s sweet wine tradition. Made from grapes left on the vine to ripen longer (often with some Botrytis influence), they are lighter and fresher than Aszú. - Flavour profile: Notes of ripe stone fruits, honey, and citrus. - Style: Perfect for those new to Tokaji’s sweet side or seeking a less intense option. Szamorodni The name Szamorodni means “as it comes,” referring to the mix of healthy and botrytised grapes used in production. This traditional style produces two distinct expressions: - Sweet (édes): A fruit-forward, lighter alternative to Aszú, showcasing flavours of honey and dried fruits. - Dry (száraz): Aged under flor-like yeast, developing savoury, nutty, and oxidative notes similar to Fino sherry. Dry wines Though Tokaj’s sweet wines are world-famous, its dry whites are equally compelling. Primarily made from Furmint, these wines range from fresh, unoaked styles to complex, barrel-aged expressions. Their acidity and minerality make them versatile food wines. - Styles: Fresh, unoaked expressions with zesty acidity or complex, barrel-aged wines with rich texture. - Pairings: Ideal with seafood, poultry, or creamy dishes. The science of sweetness What sets Tokaji apart is its reliance on noble rot, a naturally occurring fungus that transforms fully ripe grapes into sugar-rich berries. Under the right conditions—humid, misty mornings followed by warm, sunny afternoons—this fungus punctures the grape skins with microscopic filaments, creating tiny holes. Water evaporates through these openings, concentrating the grapes’ acids, sugars, and flavours. For Tokaji Aszú, the hand-picked aszú berries are macerated in a base wine or fermenting must to extract their intense sweetness and flavour. The mixture is then pressed, fermented, and aged for several years in oak barrels, which allow the wine to develop its hallmark complexity and balance. For Eszencia, the free-run juice from aszú berries is collected as a thick, syrupy liquid with sugar levels of 450+ g/L. Fermentation is incredibly slow due to the high sugar content, often taking years to reach just 2–5% alcohol. Just how sweet Is Tokaji? When it comes to sweetness, Tokaji wines are truly in a league of their own: - Tokaji Aszú (5 puttonyos): 120g/L - Tokaji Aszú (6 puttonyos): 150+ g/L - Eszencia: 450+ g/L For comparison, Sauternes—a benchmark sweet wine—ranges from 100–220g/L, while Port typically sits at around 100g/L. Tokaji’s incredible sugar levels, combined with its vibrant acidity, make it a uniquely balanced and decadent experience. How to enjoy Tokaji Pair it: Sweet Tokaji is a classic match for desserts like apricot tart, blue cheese, or foie gras. Dry styles shine with seafood, poultry, or creamy pasta dishes. Age it: Many Tokaji wines, especially Aszú and Eszencia, improve with age, gaining complexity and depth over decades. Gift it: With their distinctive 50cl bottles and luxurious reputation, Tokaji wines make a thoughtful and elegant gift. Tokaji offers a rich and diverse world of wine for those willing to explore it. Whether you’re captivated by its history, intrigued by its unique production methods, or simply looking to try something extraordinary, Tokaji is a region that delivers on every level. Before you go, why not test your Tokaji knowledge? Take our quick 5-question quiz and see how well you know Hungary’s iconic sweet wines!"
}