{
  "url": "https://tot.money/prezzi",
  "title": "Piani e Costi del Conto Aziendale Online – Tot",
  "text": "Scegli il piano migliore per la tua impresa Che tu sia un freelance, ditta individuale o un'impresa con molti dipendenti, abbiamo la soluzione giusta per la tua attività. E il primo mese con Tot è sempre gratuito Essentials costo medio mensile | unico addebito di 84€ + IVA Primi 30 giorni sempre gratuiti CONTO IBAN italiano 100 operazioni in uscita incluse all’anno Operazioni in entrata gratuite e illimitate CARTE 1 carta di credito Visa Carte di debito fisiche Mastercard Carte di debito virtuali Mastercard Cashback sugli acquisti con carte di debito EXPENSE MANAGEMENT Upload giustificativi di spesa da app Export note spese con allegati utenze Utenze Base Utenze Avanzate amministrazione Riconciliazione fatture e export prima nota Paga fatture con un click Plus costo medio mensile | unico addebito di 180 € + IVA Primi 30 giorni sempre gratuiti CONTO IBAN italiano 250 operazioni in uscita incluse all’anno Operazioni in entrata gratuite e illimitate CARTE 1 carta di credito Visa Carte di debito fisiche Mastercard add on Carte di debito virtuali Mastercard add on Cashback sugli acquisti con carte di debito EXPENSE MANAGEMENT Upload giustificativi di spesa da app Export note spese con allegati utenze 1 utenza Base inclusa Utenze Avanzate add on amministrazione Riconciliazione fatture e export prima nota Paga fatture con un click Premium costo medio mensile | unico addebito di 468 € + IVA Primi 30 giorni sempre gratuiti CONTO IBAN italiano 700 operazioni in uscita incluse all’anno Operazioni in entrata gratuite e illimitate CARTE 1 carta di credito Visa Carte di debito fisiche Mastercard add on Carte di debito virtuali Mastercard add on Cashback sugli acquisti con carte di debito EXPENSE MANAGEMENT Upload giustificativi di spesa da app Export note spese con allegati utenze 2 utenze Base incluse 1 utenza Avanzata inclusa amministrazione Riconciliazione fatture e export prima nota Paga fatture con un click Smart costo medio mensile | unico addebito di 420 € + IVA Primi 30 giorni sempre gratuiti CONTO IBAN italiano 350 operazioni in uscita incluse all’anno Operazioni in entrata gratuite e illimitate CARTE 1 carta di credito Visa 2 carte di debito fisiche Mastercard 200 carte di debito virtuali Mastercard 0,5% Cashback sugli acquisti con carte di debito EXPENSE MANAGEMENT Upload giustificativi di spesa da app Export note spese con allegati utenze Utenze Base add on 1 utenza Avanzata inclusa amministrazione Riconciliazione fatture e export prima nota Paga fatture con un click XLarge costo medio mensile | unico addebito di 1140 € + IVA Primi 30 giorni sempre gratuiti CONTO IBAN italiano 1200 operazioni in uscita incluse all’anno Operazioni in entrata gratuite e illimitate CARTE 1 carta di credito Visa 10 carte di debito fisiche Mastercard 500 carte di debito virtuali Mastercard 1% Cashback sugli acquisti con carte di debito EXPENSE MANAGEMENT Upload giustificativi di spesa da app Export note spese con allegati utenze 5 utenze Base incluse 5 utenze Avanzate incluse amministrazione Riconciliazione fatture e export prima nota Paga fatture con un click Special all'anno Parla con un nostro esperto PUOI AVERE Tutte le operazioni in uscita di cui ha bisogno la tua azienda Tutte le carte di debito fisiche di cui ha bisogno il tuo team Tutte le carte virtuali che ti servono da assegnare a ciascun centro di costo Tutte le utenze Base e Avanzate che servono per dare maggiore flessibilità alla tua gestione finanziaria e contabile Tutti i vantaggi del poter importare le fatture direttamente in piattaforma, pagarle con un click e fare la riconciliazione Non sai che piano scegliere? Compila il form e ti aiutiamo a trovare quello giusto Piani, caratteristiche e prezzi Confronta le caratteristiche Scopri le differenze principali tra i piani per trovare la soluzione più adatta alle tue esigenze al mese + IVA, addebito unico annuale al mese + IVA, addebito unico annuale Conto aziendale Operazioni in uscita incluse 100/anno 250/anno Operazioni in entrata gratuite e illimitate Le transazioni in entrata sono sempre escluse dal conteggio delle operazioni. Si applicano solamente commissioni e limitazioni per i bonifici in divisa diversa dall'Euro, o ricevuti da Paesi non SEE.IBAN italiano Banca depositaria italiana, protezione fondi fino a 100.000 € grazie al Fondo Interbancario per la Tutela dei Depositi.Zero costi di apertura Primi 30 giorni gratuiti Recesso sempre gratuito, senza vincoli.Versamento contanti È possibile versare gratuitamente contanti sul proprio conto Tot attraverso gli sportelli delle filiali Banca Sella, oppure con il servizio a pagamento T-Bonifico in tutti i centri abilitati Mooney.Imposta di bollo sul conto Importo applicabile solamente se il saldo del tuo conto è superiore a 77,46 €. Altrimenti, non pagheresti nulla.2,00 € 2,00 € Spese di chiusura conto Zero Zero Strumenti di pagamento Bonifici SEPA istantanei Bonifici istantanei inclusi e senza commissioni in tutti i piani Tot.Inclusi Inclusi Bonifici SEPA programmabili I bonifici SEPA ordinari sono programmabili fino a 30 giorni lavorativi in anticipo.Addebiti tramite SDD Pagamenti F24 Hai a disposizione i modelli F24 Ordinario, Accise, Semplificato e Precompilato.Pagamenti I24 Funzionalità subito disponibile, così puoi lasciare che sia il tuo commercialista ad occuparsi del pagamento delle tue imposte.Collegamento Entratel Collegamento Fisconline Pagamenti pagoPA Nessuna commissione aggiuntiva per i pagamenti verso la Pubblica Amministrazione.Pagamenti RiBa Commissioni aggiuntive sui pagamenti inclusi nel piano Zero Zero Commissioni aggiuntive per operazioni extra soglia Tutte le operazioni extra non incluse nel piano che hai scelto ti costeranno 0,50 € ciascuna. Non ci sono limiti a quante operazioni in più puoi effettuare.0,50 €/cad. 0,50 €/cad. Carte aziendali Carta di credito business (circuito Visa) Sempre inclusa in ogni piano, senza costi di emissione e di spedizione.Inclusa Inclusa Carte di debito fisiche (circuito Mastercard) Incluse nei piani Business Pro, senza costi di emissione e di spedizione. Carte aggiuntive a 5,00 €/mese cad. Non ci sono limiti a quante carte di debito fisiche puoi aggiungere al tuo piano.5,00 €/mese cad. Carte di debito virtuali (circuito Mastercard) Incluse nei piani Business Pro, senza costi di emissione. 1,00 €/mese cad. Non ci sono limiti a quante carte di debito fisiche puoi aggiungere al tuo piano.1,00 €/mese cad. Cashback carte di debito Mastercard Il cashback viene erogato come sconto in fattura sul tuo piano Tot, fino ad azzeramento del canone del conto.Compatibilità Apple Pay Compatibilità Google Pay Compatibilità PayPal Compatibilità Amazon Pay Protocollo EMV 3-D Secure EMV 3DS aiuta a prevenire le frodi e ad aumentare la sicurezza dei pagamenti online.Commissioni pagamenti con carta Zero Zero Commissione prelievi con carta Visa Business 3,99% 3,99% Commissione prelievi con carte Mastercard Business 2,00% Imposta di bollo annuale su estratto conto carta di credito Non paghi alcun bollo sull'estratto conto della carta di credito Visa. Zero. Nada.Zero Zero Expense Management Upload giustificativi da app Allega fino a 5 giustificativi per singola transazione in formato PDF, JPEG, PNG e HEIC.Annotazioni sulle transazioni Possibilità di inserire un commento per motivare ogni spesa.Export note spese e giustificativi Scarica la riconciliazione già pronta (CSV, Excel e PDF) con l’allegato dei giustificativi.Amministrazione Collegamento cassetto fiscale per import fatture Sincronizza tutte le fatture aziendali nel tuo account Tot per gestire il tuo flusso di cassa, a prescindere dal software di fatturazione elettronica che già usi.Pagamento fatture con bonifico precompilato Paga i tuoi fornitori con un semplice click, creando un bonifico già precompilato con i dati delle tue fatture.Riconciliazione automatica pagamenti e fatture Esportazione file per la prima nota Prepara la lista di transazioni e fatture riconciliate necessaria alla redazione della prima nota, e velocizza il lavoro contabile del tuo team o del tuo commercialista.Ruoli e accessi per il team Utenze Base Utenze Base aggiuntive non incluse nel piano: 3,00 €/mese cad. Non ci sono limiti a quante utenze base puoi aggiungere al tuo piano. Funzionalità non disponibile per il piano Essentials.1 inclusa Utenze Avanzate Utenze Avanzate aggiuntive non incluse nel piano: 5,00 €/mese cad. Non ci sono limiti a quante utenze avanzate puoi aggiungere al tuo piano. Funzionalità non disponibile per il piano Essentials.5,00 €/mese cad. Assistenza clienti Supporto clienti via chat, con operatori dall'Italia Controllo dinamico anti-frodi Funzionalità Tutte le caratteristiche dei piani a confronto Conto aziendale Operazioni in uscita incluse 100/anno 250/anno 350/anno 700/anno 1200/anno Operazioni in entrata gratuite e illimitate Le transazioni in entrata sono sempre escluse dal conteggio delle operazioni. Si applicano solamente commissioni e limitazioni per i bonifici in divisa diversa dall'Euro, o ricevuti da Paesi non SEE.IBAN italiano Banca depositaria italiana, protezione fondi fino a 100.000 € grazie al Fondo Interbancario per la Tutela dei Depositi.Zero costi di apertura Primi 30 giorni gratuiti Recesso sempre gratuito, senza vincoli.Versamento contanti È possibile versare gratuitamente contanti sul proprio conto Tot attraverso gli sportelli delle filiali Banca Sella, oppure con il servizio a pagamento T-Bonifico in tutti i centri abilitati Mooney.Imposta di bollo sul conto Importo applicabile solamente se il saldo del tuo conto è superiore a 77,46 €. Altrimenti, non pagheresti nulla.2,00 € 2,00 € 2,00 € 2,00 € 2,00 € Spese di chiusura conto Zero Zero Zero Zero Zero Strumenti di pagamento Bonifici SEPA istantanei Bonifici istantanei inclusi e senza commissioni in tutti i piani Tot.Inclusi Inclusi Inclusi Inclusi Inclusi Bonifici SEPA programmabili I bonifici SEPA ordinari sono programmabili fino a 30 giorni lavorativi in anticipo.Addebiti tramite SDD Pagamenti F24 Hai a disposizione i modelli F24 Ordinario, Accise, Semplificato e Precompilato.Pagamenti I24 Funzionalità subito disponibile, così puoi lasciare che sia il tuo commercialista ad occuparsi del pagamento delle tue imposte.Collegamento Entratel Collegamento Fisconline Pagamenti pagoPA Nessuna commissione aggiuntiva per i pagamenti verso la Pubblica Amministrazione.Pagamenti RiBa Commissioni aggiuntive sui pagamenti inclusi nel piano Zero Zero Zero Zero Zero Commissioni aggiuntive per operazioni extra soglia Tutte le operazioni extra non incluse nel piano che hai scelto ti costeranno 0,50 € ciascuna. Non ci sono limiti a quante operazioni in più puoi effettuare.0,50 €/cad. 0,50 €/cad. 0,50 €/cad. 0,50 €/cad. 0,50 €/cad. Carte aziendali Carta di credito business (circuito Visa) Sempre inclusa in ogni piano, senza costi di emissione e di spedizione.Inclusa Inclusa Inclusa Inclusa Inclusa Carte di debito fisiche (circuito Mastercard) Incluse nei piani Business Pro, senza costi di emissione e di spedizione. Carte aggiuntive a 5,00 €/mese cad. Non ci sono limiti a quante carte di debito fisiche puoi aggiungere al tuo piano.5,00 €/mese cad. 2 incluse 5,00 €/mese cad. 10 incluse Carte di debito virtuali (circuito Mastercard) Incluse nei piani Business Pro, senza costi di emissione. 1,00 €/mese cad. Non ci sono limiti a quante carte di debito fisiche puoi aggiungere al tuo piano.1,00 €/mese cad. 200 incluse 1,00 €/mese cad. 500 incluse Cashback carte di debito Mastercard Il cashback viene erogato come sconto in fattura sul tuo piano Tot, fino ad azzeramento del canone del conto.0,5% 1% Compatibilità Apple Pay Compatibilità Google Pay Compatibilità PayPal Compatibilità Amazon Pay Protocollo EMV 3-D Secure EMV 3DS aiuta a prevenire le frodi e ad aumentare la sicurezza dei pagamenti online.Commissioni pagamenti con carta Zero Zero Zero Zero Zero Commissione prelievi con carta Visa Business 3,99% 3,99% 3,99% 3,99% 3,99% Commissione prelievi con carte Mastercard Business 2,00% 2,00% 2,00% 2,00% Imposta di bollo annuale su estratto conto carta di credito Non paghi alcun bollo sull'estratto conto della carta di credito Visa. Zero. Nada.Zero Zero Zero Zero Zero Expense Management Upload giustificativi da app Allega fino a 5 giustificativi per singola transazione in formato PDF, JPEG, PNG e HEIC.Annotazioni sulle transazioni Possibilità di inserire un commento per motivare ogni spesa.Export note spese e giustificativi Scarica la riconciliazione già pronta (CSV, Excel e PDF) con l’allegato dei giustificativi.Amministrazione Collegamento cassetto fiscale per import fatture Sincronizza tutte le fatture aziendali nel tuo account Tot per gestire il tuo flusso di cassa, a prescindere dal software di fatturazione elettronica che già usi.Pagamento fatture con bonifico precompilato Paga i tuoi fornitori con un semplice click, creando un bonifico già precompilato con i dati delle tue fatture.Riconciliazione automatica pagamenti e fatture Esportazione file per la prima nota Prepara la lista di transazioni e fatture riconciliate necessaria alla redazione della prima nota, e velocizza il lavoro contabile del tuo team o del tuo commercialista.Ruoli e accessi per il team Utenze Base Utenze Base aggiuntive non incluse nel piano: 3,00 €/mese cad. Non ci sono limiti a quante utenze base puoi aggiungere al tuo piano. Funzionalità non disponibile per il piano Essentials.1 inclusa 3,00 €/mese cad. 2 incluse 5 incluse Utenze Avanzate Utenze Avanzate aggiuntive non incluse nel piano: 5,00 €/mese cad. Non ci sono limiti a quante utenze avanzate puoi aggiungere al tuo piano. Funzionalità non disponibile per il piano Essentials.5,00 €/mese cad. 1 inclusa 1 inclusa 5 incluse Assistenza clienti Supporto clienti via chat, con operatori dall'Italia Controllo dinamico anti-frodi Apertura partita IVA e costituzione società Il tuo business inizia da qui La legge è dalla tua parte Puoi andare sul sicuro, perché la possibilità di costituire SRL e Startup attraverso strumenti digitali in Italia è resa pienamente possibile dal D.Lgs. n. 183/2021. Un commercialista di fiducia Online non significa \"fai-da-te\". Significa meno spostamenti, più flessibilità e più tempo che il commercialista potrà darti. E non sarà un chatbot o un AI, ma un essere umano al 100%. Costi chiari, risparmio certo Costituire una società online è più conveniente, perché ti permette di risparmiare fino al 75% rispetto ad un notaio offline. Provare per credere. Il cliente al centro Il tuo business è al sicuro Sicurezza e privacy Tot protegge i tuoi dati e i tuoi pagamenti Accesso biometrico Codice OTP Blocco carte Tutela depositi Fondo Interbancario Capitali garantiti fino a 100.000 € con il FITD Assistenza clienti italiana Persone vere sempre pronte ad aiutarti 100% di utenti soddisfatti del supporto ricevuto. 10 minuti il tempo medio per prendere in carico una richiesta. Conto Tot recensioni Dicono di Tot Domande frequenti"
}