{
  "url": "https://abcnews.go.com/Politics/missing-danish-flags-spark-outrage-after-trumps-nato/story?id=129651048",
  "title": "Missing Danish flags spark further outrage after Trump's NATO comments - ABC News",
  "text": "Missing Danish flags spark further outrage after Trump's NATO comments The flags were outside the U.S. embassy in Denmark to honor Danish soldiers. The U.S. Embassy in Denmark on Tuesday removed 44 Danish flags honoring each of the Danish soldiers killed in Afghanistan that had been placed in planters outside the building -- drawing further outrage from the country’s veterans following comments President Donald Trump made last week dismissing the country's contributions to the war in Afghanistan. But the removal of the flags by the embassy was not intended to be malicious, said a State Department spokesperson who spoke on the condition of anonymity to discuss sensitive information. And the flags -- which were placed there by activists Tuesday morning -- have since been replaced, the spokesperson said. Embassy staff was not aware of why the flags were placed in planters outside the embassy, the spokesperson said, adding that the flags were not placed by embassy staff and their placement was not coordinated with embassy staff, which led to the confusion. Security personnel typically clean up flags, banners and signs that demonstrators leave behind at the embassy, the spokesperson added, explaining that security staff do not generally prohibit the placing of such items. But they also, as a general rule, remove all such items left behind, and clean up the area at the end of their shift. \"While the flags placed Tuesday afternoon were removed in accordance with this policy, they were returned to those who left them. Additional flags subsequently placed are currently in place and will remain so,\" the spokesperson said. According to Danish media, Danish veterans put the flags in the flower boxes in commemoration of fallen Danish soldiers following comments by Trump minimizing the role that tens of thousands of troops from NATO countries played in Afghanistan. “We’ve never needed them. We have never really asked anything of them,” Trump said during an interview with Fox Business. “You know, they’ll say they sent some troops to Afghanistan, or this or that, and they did; they stayed a little back, a little off the front lines.” The president's comments come amid increasing tensions between the U.S., Denmark and NATO allies after Trump floated military action and threatened to impose tariffs on European countries that oppose his quest to have the U.S. take control of the Danish territory of Greenland."
}