{
  "url": "https://public-connect.jp/job/11117",
  "title": "一般行政上級（社会福祉）/ SPI3で公務員対策不要/2027年4月採用/先行実施枠試験/",
  "text": "応募方法を確認 お気に入りに登録 職務内容 「福祉の現場から、佐倉の未来を支える。」 市民一人ひとりの生活課題に向き合い、安心して暮らせる地域づくりを支える専門職です。 高齢者、障がいのある方、子どもや家庭、生活に困難を抱える方など、さまざまな立場の市民に寄り添い、必要な支援につなげていく役割を担っています。 相談業務だけでなく、福祉制度の案内や利用調整、関係機関との連携、支援計画の作成など、行政職員として幅広い業務に携わります。 一般行政事務のほか、生活保護、児童・高齢者・障害者福祉に関する相談支援等を行います。 応募資格/適性 【必須要件】 次の(1)、(2)両方の条件を満たしている方 (1)平成 11 年 4 月 2 日から平成 17 年 4 月 1 日までに生まれた方 (2)社会福祉士及び精神保健福祉士の資格を有する方（令和 9 年 3 月末日までに取得見込みの方を含む。） ※以下に該当する方は、受験できません。 ア日本国籍を有しない方 イ地方公務員法第 16 条に定める欠格条項に該当する方 ・拘禁刑以上の刑に処せられ、その執行を終わるまで又はその執行を受けることがなくなるまでの方 ・佐倉市の職員として懲戒免職の処分を受け、当該処分の日から 2 年を経過しない方 ・日本国憲法施行の日以後において日本国憲法又はその下に成立した政府を暴力で破壊することを主張する政党、その他の団体を結成し、又はこれに加入した方 ウ平成 11 年改正前の民法の規定による準禁治産の宣言を受けている方（心身耗弱を原因とするもの以外） 求人に関連するブログ 募集要項 - 勤務先名 佐倉市役所 - 募集職種 社会福祉職 - 勤務形態 正社員 正式名称：正規職員 - 採用予定人数 3 人 - 給与 月給 259,459円 ~ 地域手当（ 9.2 ％）を含みます。また、上位の学歴や職歴がある場合は、一定の基準で算出された額が加算される場合があります。 このほか、通勤手当、住居手当、時間外勤務手当、扶養手当等の手当があります。また、 6 月と 12 月に期末・勤勉手当（標準：年間 4.65 月分）が支給されます。 ※これらの給与等の額や期末・勤勉手当の月数等は、改定されることがあります。 - 勤務時間 / 形態 ①勤務時間 ・ 1 週間当たり 38 時間 45 分（ 1 日当たり 7 時間 45 分×週当たり 5 日）です。 ・ 原則として、勤務日は月曜日から金曜日まで、 1 日の始業・終業時刻は 8 時 30 分から 17 時 15 分までですが、職場によって異なる場合があります。 ②休日・休暇等 ・ 休日は、原則、日曜日及び土曜日のほか、国民の祝日及び年末年始です。（勤務時間と同様、職場によって異なる場合があります。） ・ 休暇・休業には、次のようなものがあります。 【有給】 年次有給休暇：一年度当たり 20 日 夏季、結婚、妊娠出産、子の看護、忌引による休暇 等：休暇の種類により日数は異なります。 【無給】 介護休暇、育児休業 等：休暇の種類により日数は異なります。 - 勤務場所 佐倉市役所 - 勤務地 〒285-8501 千葉県佐倉市海隣寺町97番地 ※本庁舎勤務となった場合の住所になります。 ※配属先によって市内の公共施設等の勤務となる可能性があります。 - アクセス 京成本線 京成佐倉駅 南口から徒歩約 10 分 - 待遇 / 福利厚生 ・市町村共済組合、職員互助会等で各種の給付や事業を行っています。 ・健康診断、人間ドッグ、出産祝い、入園入学祝い、旅行、宿泊施設、映画、飲食店、スポーツクラブなどで様々なサービスを受けたり、割引価格で利用することができます。 詳しくは上記「関連するブログ」の「給与・諸手当」「働く環境」をご覧ください 受動喫煙防止措置 敷地内禁煙（屋外に喫煙場所あり） 応募方法 申込フォーム（ちば電子申請サービス） 【申込】 令和８年度佐倉市職員採用試験【先行実施枠】受験申込フォーム（行政職・保健師用） 《受験申込期間》 令和 8 年 2 月 2 日（月）から 2 月 25 日（水）まで 《受験申込方法》 受験申込み前に、必ず試験案内を確認してください。 やむを得ない事情で電子申請ができない場合は、 2 月 12 日（木）までに佐倉市総務部人事課までご連絡ください。 《書類選考》・ 1 次試験前に 、履歴書及びエントリーシートによる書類選考を実施します。 ・書類選考の結果は、 3 月 3 日（ 火 ）まで に 、全員に電子メールを送信します。電子メールが届かない場合は、翌 4 日（水）に人事課職員採用担当までお問合せください。 - 選考に関する添付ファイル - 令和８年度佐倉市職員採用試験案内（行政職・保健師） - 選考フロー 一次選考 3 月 5 日（木）～ 3 月 22 日（日） 【SPI3】性格＋基礎能力 ↓ 二次選考 4 月中旬 【集団面接】佐倉市役所 ↓ 三次選考 5 月中旬 【個人面接】佐倉市役所 ↓ 合格 その他留意事項 【採用試験に関するQ&Aについて】 佐倉市公式ホームページでは、採用試験に関するQ&Aを掲載しています。 採用試験Q&A（佐倉市公式ホームページ） この求人に応募するには 会員登録が必要です。 この求人に応募するには 会員登録が必要です。 官公庁概要 - 官公庁名 佐倉市役所 - 都道府県 / 市区町村 千葉県 佐倉市 - 官公庁の種類 地方公共団体 - 職員人数 1070名 - 平均年齢 44歳 - URL https://www.city.sakura.lg.jp/ 所在地 〒285-8501 千葉県佐倉市海隣寺町97番地 この官公庁の求人 行政事務 一般行政上級/ SPI3で公務員対策不要/2027年4月採用/先行実施枠試験/ 土木職・土木技術職・土木技師・農業土木職 土木上級/ SPI3で公務員対策不要/2027年4月採用/先行実施枠試験/ 建築職・建築技術者 建築上級/ SPI3で公務員対策不要/2027年4月採用/先行実施枠試験/ この官公庁のブログ"
}