{
  "url": "https://en.wikipedia.org/wiki/Runa_(given_name)",
  "title": "Runa (given name) - Wikipedia",
  "text": "Runa (given name) Appearance Runa is a feminine given name with multiple origins from different, unrelated cultures. Runa or Rúna is a feminine given name of Old Norse origin meaning rune or secret lore. It is a feminine version of the name Rune.[1] It is also in occasional use as a Japanese pronunciation of the name Luna. The name has been used in at least one instance as a nonstandard pronunciation in Japan for the Japanese kanji 月, also meaning moon.[2] The name also has other meanings in Japanese depending on the kanji that are used to spell it. Runa is also a name in use in Arabic as رنا, in Urdu as رونا, in Hindi as रूना and in Bangla as রুনা and is said to refer to the sixth month of the Islamic calendar.[3] People [edit]American [edit]- Runa Lucienne (born 1988), model and actress Bengali [edit]- Runa Basu, cricketer - Runa Islam (born 1970), artist - Runa Khan, actress - Runa Laila (born 1952), singer Canadian [edit]- Runa Reta (born 1980), squash player Indian [edit]- Runa Rizvi, singer Japanese [edit]- Runa Akiyama (1954-2014), actress - Runa Imai (born 2000), swimmer - Runa Konomi (born 2000), professional footballer - Runa Natsui (born 1995), actress and model - Runa Takamura (1952–2004), J-pop singer, actress, and dancer Nepalese [edit]- Runa Pradhan (born 1984), swimmer Norwegian [edit]- Runa Førde (born 1933), painter, illustrator and graphic artist - Runa Sandvik (born 1988), computer security expert - Runa Vikestad (born 1984), footballer Fictional characters [edit]- Runa, an Utgar Minion Kyrie character from the HeroScape miniature wargame - Rūna, a Valkyrior in Marvel Comics - Runa Rindo from Fairy Navigator Runa - Runa Kuribayashi, a second managers of Jōzenji High School Volleyball in Haikyū!! - Runa Tokisaka, from the anime The SoulTaker - Runa Yomozuki from the manga/anime series Kakegurui - Runa Sasaki (佐々木瑠奈, Sasaki Runa) is one of the characters in Loving Yamada at Lv999! series, written and illustrated by Mashiro. - The alternate name of Luna from the Casshan/Casshern series - The alternate name of Luna Platz from Mega Man Star Force - Runa Shirakawa, from the manga/anime series You Were Experienced, I Was Not: Our Dating Story Notes [edit]- ^ \"Meaning and Origin for the name Runa - Behind the Name\". - ^ Ha, Thu-Huong (7 January 2023). \"Across Japan, baby names are getting more creative\". japantimes.co.jp. The Japan Times. Retrieved 7 January 2023. - ^ \"Meaning and Origin for the name Runa - Muslim Names.com\"."
}