{
  "url": "https://sharepoint.stackexchange.com/questions/27436/explain-it-to-me-sharepoint-deployment-scope-solution-and-features",
  "title": "2010 - Explain it to me: SharePoint deployment scope, solution and features - SharePoint Stack Exchange",
  "text": "For Features SharePoint Features can be scoped to the Farm, Web Application, Site Collection, and Web Site level depending on the purpose of the feature. The Feature scope is determined by the setting of the Scope attribute in the Feature element defined in the feature.xml file. A sample Feature element tag is given below: <Feature Id=\"F62C96CF-79FD-44be-8882-E9BFBD199184\" Title=\"Feature Title\" Description=\"Feature Description\" Version=\"1.0.0.0\" Scope=\"Site\" Hidden=\"false\"> </Feature> Web Site scoped Feature (Scope=\"Web\"): A Web Site scoped Feature is one that can be activated only at the individual Web site level. List templates, list instances, custom actions, event receivers, etc are the some common elements for web site scoped features. Web Site scoped features can be activated by using: Run the following STSADM command: stsadm -o installfeature -name FeatureFolderName –url http://servername/site/subsite Site Collection scoped Feature (Scope=\"Site\"): A Site Collection scoped Feature is one that can be activated at the site collection level and contains items that apply to the site collection as a whole (for example, content types that are shared across the site collection), as well as items that can be activated per site (for example, list instances, etc). Site Collection scoped features can be activated by: Run the following STSADM command: stsadm -o installfeature -name FeatureFolderName –url http://servername/site/sitecollection Web Application scoped Feature (Scope=\"WebApplication\"): A Web Application scoped Feature is one that can be activated at the web application level and contains items like administrative web application links, delegate control registrations, feature/site template association, document form registrations, etc. A farm Feature can contain, for example, links to /_layouts pages and files, /_admin pages, and other elements. Web Applicationscoped features can be activated by using: Run the following STSADM command: stsadm -o installfeature -name FeatureFolderName -url http://servername Farm scoped Feature (Scope=\"Farm\"): A Farm scoped Feature can be activated at the server farm level. A farm Feature contains a number of elements that are critical for implementing applications and logic anywhere within a deployment. A farm Feature can contain, for example, links to /_layouts pages and files, /_admin pages, and other elements. Farm scoped features can be activated by using: Run the following STSADM command: stsadm -o installfeature -name FeatureFolderName For solutions SharePoint solutions are either deployed globally or targeted to a particular web application. The decision of which is made automatically by the SharePoint Solution framework depending on the contents of the solution manifest. Exception to this rule are Sandbox solutions which are managed on the site collection level. Globally Deployed Solutions When a solution is deployed globally, the assembly DLL file will go and sit under windows\\assembly folder. All SharePoint application pools, including Central Administration’s, are recycled automatically. This can be good and bad. This is good because any GAC installed DLL that has been upgraded needs to be reloaded. This can be bad though with regards to the availability of your entire SharePoint Farm. Web Application Targeted Solutions When a web application targeted solution is deployed or retracted, the assembly DLL file will go and sit under the inetpub\\websitename\\bin folder. Only the application pools of the targeted web applications are recycled. When deploying and retracting a web application targeted solution, deploy or retract it only to those web applications that will use it … thus preventing unnecessary recycling of application pools. Sandbox Solutions Sandbox solutions are deployed to the site collection. This new mechanism has been introduced in SharePoint 2010 to provided more isolation between deployed components. Sandbox Solutions deployment does not require application pool recycle and does not allow deploying DLLs into the GAC, as everything is stored in content database where site collection resides. These solution also provide much more restrictive execution model and limited access to SharePoint API. PowerShell Code to deploy solutions (WSP) :- PowerShell to deploy the WSP to the GAC on server and deploy to all URLS Add-SPSolution -LiteralPath $path install-spsolution -Identity $solution -GACDeployment PowerShell to deploy the WSP to the GAC on server and deploy only to 1 specific web application (not in bin folder) Add-SPSolution -LiteralPath $path install-spsolution -Identity $solution -WebApplication $oURL -GACDeployment PowerShell to deploy to specific webapplication at bin folder on server Install-SPSolution -Identity $solution -WebApplication $webApp PowerShell to deploy to all the webapplication at their bin folders on server Install-SPSolution -Identity $solution -AllWebApplications Reference: Understanding Scope of SharePoint Features"
}