{
  "url": "https://www.sportfishingmag.com/tunas-world-an-illustrated-guide/",
  "title": "Different Types of Tuna, Species of Tuna | Sport Fishing Mag",
  "text": "Tunas are part of the family Scombridae, which also includes mackerels, large and small. But there are tunas, and then there are, well, “true tunas.” Two groups (sometimes known as “tribes”) dominate the tuna species. One is Thunnini, which is the group considered true tunas, characterized by two separate dorsal fins and a relatively thick body. The 15 species of Thunnini are albacore, bigeye, black skipjack, blackfin, bluefin (three species: Atlantic, Pacific, southern), bullet, frigate, kawakawa, little tunny, longtail, skipjack, slender and yellowfin. The other tribe is Sardini; these tunas — the dogtooth tuna and several species of smaller true bonitos — are somewhat more mackerel-like (notably with a more elongated body and a row of sharp, conical teeth). Below you will find complete breakdowns of the various types of tuna in the world. ALBACORE (Thunnus alalunga) Easily identified, having by far the longest pectoral fins of any tuna, albacore are also noted for the lightest, whitest flesh among tunas. Circumglobal, albacore prefer temperate (versus tropical) seas and rarely venture near shore. They’ve long been a popular target for California anglers, particularly off the central part of the state, but their availability in the summer varies greatly from year to year. Later in summer and fall, albacore move up into waters off Oregon, Washington and British Columbia but are often too far offshore for most sport-fishing boats. BIGEYE (Thunnus obesus) Bigeye may be confused with yellowfin, but their yellow finlets are edged in black and their eyes may indeed be a bit larger. The bigeye may also be more robust in its body shape. But the single sure way to distinguish the two species is underneath the skin: The bigeye’s liver is striated (striped or streaked); the yellowfin’s is not. Found worldwide, this prized game fish is also an important target for commercial longliners. BLACKFIN (Thunnus atlanticus) The most common tuna of the Florida Keys and South Florida, blackfin tuna are found in tropical and warm temperate waters of the western Atlantic Ocean. Anglers target them from Brazil to North Carolina, including the Gulf of Mexico, but most of the world records hail from Florida. A blakfin’s pec fins reach somewhere between the twelfth dorsal spine and the origin of the second dorsal fin, but they never extend beyond the second dorsal fin as in the albacore, explains the IGFA. A blackfin’s finlets are uniformly dark, without a touch of the bright yellow often present in other tunas. The blackfin is a schooling fish that feeds near the surface, mostly caught while trolling ballyhoo or jigging with artificials. Overshadowed by yellowfins where the two species overlap, blackfins are still a fine-tasting tuna that draws praise when served properly. BLACK SKIPJACK (Euthynnus lineatus) This species is one of the few tunas limited to the eastern Pacific, found in waters off California to Peru. The black skippy can be identified by the four or five broad, straight stripes that extend horizontally along its back. A hard-hitting, fast-moving predator, smaller skipjack are popular among anglers for use as live bait for billfish and large yellowfin. The strong dark-red flesh is not appealing to most fishermen. BLUEFIN (Thunnus thynnus) The king of tunas, giant bluefin are for many anglers the ultimate prize among all game fishes. Ditto for sushi eaters, who at market may bid hundreds of thousands of dollars for a single giant. There’s some irony in the fact that before the latter part of the 20th century, sport fishermen had no use for giant bluefin, which at best were used for pet food, being considered unpalatable. Go figure. Bluefin mature at about six years of age, around 300 pounds. Atlantic bluefin spawn in the Mediterranean and Gulf of Mexico. Researchers discovered and confirmed a third spawning area in the western Atlantic called the Slope Sea. They’re not terribly picky eaters, devouring even very small baitfish, and invertebrates, including starfish, have shown up in stomach analyses. Bluefin range from far offshore to near-coastal waters. The three species of bluefin (Atlantic, Pacific and southern) tolerate a great range of temperatures and migrate great distances, across both oceans. Satellite tags have revealed transatlantic crossings in less than 60 days. Decades ago, giants made a reliable migration each May off Bimini and down the Florida Strait, but that suddenly came to an end after the 1960s. In recent years, Southern California anglers have been catching bluefin of sizes exceptional for those waters. BONITOS (Sarda spp) In addition to the Atlantic bonito, there are three other species of Sarda (Pacific, striped and Australian). These four true bonitos are related to dogtooth tuna and share that species’ shape — more elongated than other “true” tunas — and somewhat non-tuna-like sharp-toothed dentition. All are small coastal pelagics; all make outstanding light-tackle game fish and (even if not universally appreciated) fine table fare as sashimi or cooked. (Not to be confused with little tunny/false albacore, often called “bonito.”) DOGTOOTH (Gymnosarda unicolor) That the Indo-Pacific dogtooth (along with true bonitos — basically smaller versions) belong in a different group from bluefin, yellowfin and relatives isn’t hard to imagine. Unlike those true tunas, dogtooth are longer, leaner and maybe even meaner. Per its name, check out its dentures, most impressive of any tuna. Also, dogtooth are far more solitary, and unlike most tunas are not a schooling species. Finally, they prefer to haunt steep reef slopes; anglers needn’t travel far offshore to tangle with doggies. A fine eating fish, dogtooth are known for their brutal power when hooked. KAWAKAWA (Euthynnus affinis) Known as mackerel tuna in Australia, the kawakawa — native to the Indo- and western Pacific — is similar to the little tunny of Atlantic waters. It is also a dark-meat species, though popular among many anglers for food, as in Hawaii. Kawakawa are, typically, tremendous fighters for their size. Kawakawa mostly inhabit coastal reefs and may even move into estuaries. LITTLE TUNNY (Euthynnus alletteratus) A fish of many names, little tunny are known as false albacore off the U.S. Northeast and mid-Atlantic states, where they’re a very popular game fish among light-tackle and fly anglers. In the Southeast and Gulf, they’re mislabeled bonito, and generally avoided. Yet they are tremendous fighters for their size, battling in classic tuna fashion. Little tunny are readily identified by the wavy lines along their upper back, behind the dorsal, and the spots between pectoral and ventral fins. Small tunny are also popular as baitfish, drifted live or trolled dead. They form and feed in tight schools, often churning the surface as they gorge on baitfish. The dark-red, bloody meat of little tunny keeps them out of fish boxes. LONGTAIL (Thunnus tonggol) The longtail inhabits the Indo-Pacific, quite near shore, even prowling estuaries and river mouths, where it often roams in large shoals. A popular game fish among Australians, the species is there labeled northern bluefin, though it is not a species of bluefin. SKIPJACK (Katsuwonus pelamis) With distinct horizontal stripes limited to its lower half (and no stripes dorsally), the skipjack is readily distinguished from other small tunas. One of the most widely dispersed of small tunas, the skipjack is found in all temperate and tropical seas, where it often forms huge schools. Not all anglers realize that its light meat should make it a preferred species for the fish box. The skipjack is of huge importance globally as a commercial species, with great tonnage ending up canned. YELLOWFIN (Thunnus albacares) Named for its bright-yellow finlets, the yellowfin is fantastically popular among anglers who fish tropical seas around the world. Their habit of schooling and feeding at the surface makes yellowfin particularly exciting targets for run-‘n’-gunners. Yellowfin are decidedly bluewater pelagics but may move into coastal waters at times. The fast-growing tuna can reach 200 pounds in seven years. Anglers in eastern Pacific waters take advantage of the yellowfin symbiotically feeding with dolphin (porpoise). From years spent as an observer for the Inter-American Tropical Tuna Commission, California photographer, writer and angler Bill Boyce says tuna definitely follow dolphin (not vice versa). The tuna seem to understand that dolphin will find the baitfish; the tuna then help corral the bait, pushing it to the surface."
}