{
  "url": "https://greenfelt.net/addiction",
  "title": "Addiction Solitaire - Green Felt",
  "text": "Play Addiction Solitaire online, right in your browser. Green Felt solitaire games feature innovative game-play features and a friendly, competitive community. Addiction is a solitaire card game using 48 out of a deck of 52 playing cards. First, all 52 cards are laid out into 4 rows of 13 cards. Then, the Aces are removed and discarded from play. This leaves four gaps, four left behind by the Aces. The rule of the game are as follows: - A gap can be filled by moving into it the card that is the same suit and a rank higher than the card on the gap's left. - Nothing may be placed in a gap to the right of a King or another gap. - Only 2s maybe be played in the left column. - When no move is possible all cards that are not in suit sequence starting from 2 in the left column may be shuffled and replaced. You may do this up to 3 times. The game is won when all 48 cards are arranged such that each row has 2 to King of the same suit in order starting in the left column. There are many keys you can use to make your game playing more efficient: - Space - Auto-finish—In foundation games, this moves all the cards it can up to the foundations - z - Undo - x - Redo - n - New Game - g - Replay the same game - f - Flip a card from the stock There is also a card-finder keyboard feature you can use to help you locate cards: - a - Highlight the aces - 1 though 9 - Highlight the cards with the rank pressed - 0 or t - Highlight the tens - d, c, h, s - Highlight the cards with the suit - r, b - Highlight the red or black cards You may combine the rank keys with the suit or color keys. For example, if you hold down the \"5\" key and the \"d\" key then only the 5 of diamonds will be highlighted. \"a\" and \"r\" will highlight the red aces. There are ways to use the mouse to make your game playing more efficient: - Left Click - Move the card to the most logical place (might not be the best move, however) - Left Click in Empty Area - Auto-finish—In foundation games, this moves all the cards it can up to the foundations - Right Click - Undo You can use super moves to make your game playing more efficient. Clicking or dragging a card that isn't immediately accessible will attempt to move all the cards above it in its stack until the move is valid. The effect will be the same as clicking each card. If you cancel the drag or undo the move, all the cards will go back to where they were. Dragging a card or cards to the middle of a stack will attempt to move all the cards above the destination out of the way. The effect is the same as clicking each card. To see where the cards will move, hold the dragged card(s) at the destination for a second. If you decide to move the dragged card(s) somewhere else, just drag them there and the other cards will go back to where they were. Undoing the move will also move the cards back. If you drag a card or cards to the middle of a stack and the cards that move away would be valid to move back on top of the dragged card(s), then they'll slide out of the way and let you just slip the card(s) in. The score is based on the lengths of the runs of cards of the same suit: The max is 13 so that a complete game's score is 52, like the foundation based games. It's not linear so that it rewards games with longer runs."
}