{
  "url": "https://support.google.com/translate/answer/6142483?hl=es-419&co=GENIE.Platform=Desktop",
  "title": "Traducir imágenes - Ordenador - Ayuda de Google Translate",
  "text": "Puedes usar la cámara de tu teléfono para traducir texto en la aplicación Traductor . Por ejemplo, puedes traducir carteles o notas escritas a mano. Traducir texto de imágenes Puedes traducir el texto de las imágenes de tu dispositivo en el Traductor de Google. Importante: La precisión de la traducción depende de la claridad del texto. La traducción de texto pequeño, poco claro o estilizado puede no ser precisa. Para traducir texto dentro de una imagen, sigue estos pasos: - En tu ordenador, ve al Traductor de Google. - En la parte superior, selecciona la pestaña Imágenes. - Elige la combinación de idiomas de la traducción. - Del: elige un idioma o selecciona Detectar idioma. - Al: elige el idioma al que quieras traducir. - Para elegir una imagen que quieras traducir, haz clic en Explorar ordenador. Trabajar con texto traducido Una vez que se haya traducido la imagen, puedes copiar el texto traducido o descargar la imagen traducida. En la esquina superior, haz clic en Borrar para iniciar la traducción de otra imagen. En la parte superior de la imagen, elige una opción: - Mostrar texto original: para mostrar el texto original junto al texto traducido, activa Mostrar versión original. - Ampliar el texto traducido: para ampliar la imagen traducida, desactiva Mostrar versión original. - Copiar texto: para copiar el texto traducido, haz clic en Copiar texto . - Descargar imagen traducida: para descargar la imagen traducida, haz clic en Descargar traducción . Nota: En pantallas más pequeñas, si la opción \"Mostrar versión original\" está activada, no podrás ver el texto traducido en paralelo. Conseguir los mejores resultados Para obtener la mejor traducción posible de tus imágenes, sigue estas recomendaciones: - Comprueba que los idiomas de los campos \"Traducir del\" y \"Traducir al\" sean correctos. - Sube imágenes nítidas con fuentes habituales para obtener los mejores resultados. Enviar comentarios Para enviar comentarios, haz clic en Enviar comentarios."
}