{
  "url": "https://en.wikipedia.org/wiki/Lurpak",
  "title": "Lurpak - Wikipedia",
  "text": "Lurpak Lurpak is a Danish brand of butter owned by Arla Foods. It is sold in over 75 countries worldwide,[1] and is known for its distinctive silver packaging.[2] Lurpak came into existence in October 1901 after a cooperative of several Danish dairy farmers decided to create and register a common brand and mark for butter to increase sales.[3] Its trumpetlike logo is based on the lur, an ancient brass instrument once used in Scandinavia.[4][5] Lurpak's principal market is the United Kingdom.[6] Lurpak butter is made from milk, but their spreadable range contains rapeseed oil.[7] Product range [edit]- Lurpak Slightly Salted Butter - Lurpak Cheese Spread - Lurpak Lighter Spreadable - Lurpak Lightest Spreadable - Lurpak Organic Spreadable - Lurpak Unsalted - Lurpak Spreadable Slightly Salted Butter - Lurpak Spreadable Margarine Butter - Lurpak With Crushed Garlic - Lurpak Olive Oil Spread - Lurpak Softest Slightly Salted (launched Spring 2018) - Lurpak Plant Based Advertising campaigns [edit]In 1985, Lurpak launched a television campaign for the United Kingdom featuring Douglas, a trombonist made from butter, trying to play the famous classical composition Flight of the Bumblebee by Rimsky-Korsakov at the end of each advert spot (usually being stopped by the voiceover \"Not now, Douglas!\"), in tribute to Arthur Tolcher's appearances on the television show Morecambe and Wise. This was created by Aardman Animations, and featured the voice of Penelope Keith, with the intro to the Agnus Dei from Faure's Requiem as background music. This ran for almost twenty years, until Lurpak repositioned with the \"Good Food Deserves Lurpak\" campaign, created by Wieden+Kennedy, and featuring the voice of Rutger Hauer.[8][9] Similar brands [edit]In the United Kingdom, discount retailer Aldi has introduced its own brand lookalike \"butter blended with rapeseed oil\", named Nordpak,[10][11] which is manufactured in Ireland.[12] Lidl and Tesco also have their own brand lookalikes, named Danpak and Butterpak, respectively.[citation needed] References [edit]- ^ \"Lurpak Crowned Best Butter in the World at Cheese Contest\". The Cattle Site. Retrieved 19 May 2020. - ^ \"Tub Retains Signature Shine\". .packaginginsights.com/. Retrieved 19 May 2020. - ^ Creating Nordic Capitalism: The Development of a Competitive Periphery. Palgrave Macmillan. 16 September 2017. ISBN 978-1-137-07137-8. - ^ \"The lurs of the Bronze Age\". National Museum of Denmark. Retrieved 19 May 2020. - ^ Goodall, Howard (2013). The Story of Music. London: Vintage Books. p. 10. ISBN 9780099587170. - ^ Wienberg, Christian (3 September 2020). \"Butter Hoarding Boosts Profit of Maker of Lurpak\". Bloomberg. Retrieved 3 September 2020. - ^ \"Lurpak® Spreadable Slightly Salted\". new.lurpak.com. Retrieved 12 February 2023. - ^ \"welcome to optimism: we salute you, brave food warriors\". - ^ Naylor, Tony (24 April 2009). \"AdWatch: Lurpak can't butter us up\". The Guardian. London. Retrieved 11 May 2010. - ^ Smith, Sophie (7 July 2017). \"How Aldi and Lidl have wooed British shoppers: the top 5 discounter tactics\". The Telegraph. Retrieved 4 June 2019 – via www.telegraph.co.uk. - ^ Patel, Ajay (March 2018). \"Copycat products: 'living dangerously' with intellectual property\". The Conversation. Retrieved 4 June 2019. - ^ \"Country of origin of butter and cheddar sold in Scottish and British retailers: analysis - gov.scot\". www.gov.scot. Retrieved 4 June 2019."
}