{
  "url": "https://www.coldwellbankerhomes.com/pa/pittsburgh/agent/bayram-onder-kan/aid_275267/",
  "title": "Bayram Onder Kan, Real Estate Agent - Pittsburgh - Coldwell Banker Realty",
  "text": "Sales Associate - Phone (412) 689-0035 mobile (412) 366-1600 office (412) 689-0035 direct - - Areas ServedPittsburgh, Wexford, Franklin Park, McCandless, Cranberry Township, Ross Township, Gibsonia, McKnight, Hampton, Fox Chapel, Pine Township, Marshall, Ohio Township, Scott Township, Mount Lebanon, Upper Saint Clair, Brookline, Dormont, Bluff, McKees Rocks, McKeesport Know Your Real Estate Agent: Meet Bayram Önder Kan Connect with Bayram Onder Designations e-PRO Internet Professional (e-PRO), REALTOR National Association of REALTORS (NAR), Short Sales and Foreclosure Certification (SFR) Languages other than English Turkish More about Bayram Onder Kan When embarking on the exciting journey of buying or selling a home, it's crucial to have a trustworthy and knowledgeable real estate agent like me by your side. Allow me to introduce myself – I am Bayram Önder Kan, a seasoned real estate professional with a unique blend of skills and experiences that set me apart in the world of real estate. My journey in real estate is rooted in a solid educational foundation. I hold a Bachelor's degree in Business Administration, with a major in Marketing, from Marmara University. During my college years, I developed a deep understanding of marketing principles, which would later prove invaluable in my career. But my commitment to education didn't stop there. I went on to earn a Master's degree in Interactive Multimedia from Duquesne University. This educational milestone allowed me to delve deeply into the world of multimedia and digital communication, setting the stage for my expertise in internet marketing and social media strategies. What truly sets me apart is my diverse professional background. Before entering the real estate world, I wore various hats in my career, ranging from entrepreneurship to web design. I even owned and managed restaurants, which gave me valuable experience in communication, negotiation, and delivering exceptional customer service. My Master's degree in Interactive Multimedia not only added a layer of expertise to my skill set but also provided me with a unique advantage in the realm of real estate. In today's digital age, the ability to leverage internet marketing and social media strategies is a significant asset. My mastery of multimedia has allowed me to stay at the forefront of digital marketing trends, ensuring my clients receive the most effective and up-to-date strategies to market their properties. My dedication to excellence extends beyond my own achievements. I am committed to staying informed about the latest real estate trends and technology, ensuring that I provide my clients with the highest level of service and expertise. On a personal note, I have been married for two decades to my college sweetheart, and we are blessed with a wonderful son. Family values are at the core of everything I do, and I understand the significance of finding the perfect home for your loved ones. As your real estate agent, I am not just a professional; I'm your ally. Whether you're a first-time homebuyer, a seasoned investor, or somewhere in between, I am here to guide you through the exciting journey of real estate. With my strong educational background, diverse professional experiences, multimedia mastery, and a commitment to excellence, I am well-equipped to help you achieve your real estate goals. If you're in the Pittsburgh, Pennsylvania area and seeking a real estate agent who truly understands the ins and outs of the market, I am the name you can trust. Reach out to me, and embark on your real estate journey with confidence. Your dream property in Pittsburgh is just a call away. North Hills 9600 Perry Hwy Ste 100, Pittsburgh, PA 15237-5552 (412) 366-1600"
}