{
  "url": "https://es.m.wikipedia.org/wiki/Uno",
  "title": "Uno - Wikipedia, la enciclopedia libre",
  "text": "Uno El uno (1) o su apócope un son el primer o segundo —tema en discusión— número natural y es el número entero que sigue al cero (0) y precede al dos (2).ⓘ El 1 (uno, unidad) es un número que representa una única entidad, que forma parte de la secuencia infinita de números naturales. Esta propiedad fundamental ha dado lugar a usos únicos en otros campos, desde la ciencia hasta los deportes, donde comúnmente denota lo primero, lo principal o lo más alto de un grupo. 1 es la unidad de conteo o medida, un determinante para sustantivos singulares y un pronombre. Históricamente, la representación del 1 evolucionó desde los antiguos símbolos sumerios y babilónicos hasta el número árabe moderno. En matemáticas, 1 es la identidad multiplicativa, lo que significa que cualquier número multiplicado por 1 es igual al mismo número. Por convención, el 1 no se considera un número primo. En tecnología digital, 1 representa el estado «encendido» en código binario, la base de la informática. Filosóficamente, el 1 simboliza la realidad última o fuente de la existencia en varias tradiciones. En matemáticas [editar]El número 1 es el primer número natural después del 0. Cada número natural, incluido el 1, se construye por sucesión, es decir, añadiendo 1 al número natural anterior. El número 1 es la identidad multiplicativa de los números enteros, reales y complejos, es decir, cualquier número. multiplicado por 1 permanece sin cambios (). Como resultado, el cuadrado (), raíz cuadrada (), y cualquier otra potencia de 1 siempre es igual a 1.[2] 1 es su propio factorial () y 0! también es 1. Estos son un caso especial del producto vacío.[3] Aunque 1 cumple con la definición ingenua de un número primo, al ser divisible exactamente solo por 1 y por sí mismo (también 1), por convención moderna no se lo considera ni un número primo ni un número compuesto.[4] Las diferentes construcciones matemáticas de los números naturales representan el 1 de diversas maneras. En la formulación original de Giuseppe Peano de los axiomas de Peano, un conjunto de postulados para definir los números naturales de una manera precisa y lógica, el 1 era tratado como el punto de partida de la secuencia de números naturales.[5][6] Peano revisó posteriormente sus axiomas para comenzar la secuencia con 0.[5][7] En la asignación cardinal de Von Neumann de números naturales, donde cada número se define como un conjunto que contiene todos los números anteriores, 1 se representa como el conjunto unitario , un conjunto que contiene sólo el elemento 0.[8] El sistema de numeración unario, tal como se utiliza para contar, es un ejemplo de un sistema de numeración de «base 1», ya que solo se utiliza una marca – el recuento en sí – es necesario. Si bien esta es la forma más sencilla de representar los números naturales, la base 1 rara vez se utiliza como base práctica para contar debido a su difícil legibilidad.[9][10] En muchos problemas matemáticos y de ingeniería, los valores numéricos normalmente se normalizan para caer dentro del intervalo de unidad ([0,1]), donde 1 representa el valor máximo posible. Por ejemplo, por definición, 1 es la probabilidad de un evento que es absolutamente o casi seguro que ocurra.[11] Del mismo modo, los vectores a menudo se normalizan en vectores unitarios (es decir, vectores de magnitud uno), porque estos suelen tener propiedades más deseables. Las funciones a menudo se normalizan con la condición de que tengan integral uno, valor máximo uno o integral al cuadrado uno, dependiendo de la aplicación.[12] 1 es el valor de la constante de Legendre, introducida en 1808 por Adrien-Marie Legendre para expresar el comportamiento asintótico de la función de conteo de primos.[13] La conjetura de Weil sobre los números de Tamagawa establece que el número de Tamagawa , una medida geométrica de un grupo algebraico lineal conectado sobre un cuerpo numérico global, es 1 para todos los grupos simplemente conectados (aquellos que están conectados por trayectorias sin 'agujeros').[14][15] 1 es el dígito inicial más común en muchos conjuntos de datos numéricos del mundo real. Esta es una consecuencia de la ley de Benford, que establece que la probabilidad de un dígito inicial específico es . La tendencia de los números del mundo real a crecer de forma exponencial o logarítmica sesga la distribución hacia dígitos iniciales más pequeños, y el 1 aparece aproximadamente el 30% del tiempo.[16] Como una palabra [editar]One es más comúnmente un determinante inglés usado con singular sustantivos contables, como en one day at a time en español 'un día tras otro'.[17] Uno también es un pronombre utilizado para referirse a una persona no especificada o a personas en general como en uno debe cuidar de sí mismo.[18] Finalmente, one es un noun cuando se refiere al número uno como en one plus one is two (uno más uno son dos)y cuando se usa como pro form, como en the green one is nice (el verde es bonito) o those ones look good (esos tienen buena pinta). Etimología [editar]Uno proviene de la palabra inglesa an,[19] que proviene de la raíz protogermánica *ainaz.[19] La raíz protogermánica *ainaz proviene de la raíz protoindoeuropea *oi-no-.[19] Compara la raíz proto-germánica *ainaz con frisón antiguo an, gótica ains, danesa en, neerlandesa een, alemana eins y nórdico antiguo einn. Compárese la raíz protoindoeuropea *oi-no- (que significa \"uno, solo\"[19]) con griega oinos (que significa \"as\" en los dados[19]), latín unus (uno[19]), persa antiguo aivam, Antiguo eslavo eclesiástico -inu e ino-, lituano vienas, Idioma irlandés antiguo oin y bretón un (uno[19]). Símbolos y representación [editar]Historia [editar]Entre los primeros registros conocidos de un sistema numérico se encuentra el sistema decimal- sexagesimal sumerio en tablilla de barro que datan de la primera mitad del tercer milenio a. C..[20] Los números sumerios arcaicos 1 y 60 consistían en símbolos semicirculares horizontales.[21] Por c. 2350 a. C., los antiguos números curviformes sumerios fueron reemplazados por símbolos cuneiformes, y el 1 y el 60 estaban representados por el mismo símbolo. El sistema cuneiforme sumerio es un antecesor directo de los sistemas decimales cuneiformes semíticos eblaíta y asirio-babilónico.[22] Los documentos babilónicos sobrevivientes datan en su mayoría de las eras del Babilónico Antiguo (c. 1500 a. C.) y los seléucidas (c. 300 a. C.).[20] La notación de números en escritura cuneiforme babilónica utilizaba el mismo símbolo para 1 y 60 que en el sistema sumerio.[23] El glifo más comúnmente utilizado en el mundo occidental moderno para representar el número 1 es el número arábigo, una línea vertical, a menudo con una serifa en la parte superior y a veces una línea horizontal corta en la parte inferior. Se remonta a la escritura brahmica de la antigua India, representada por Aśoka como una simple línea vertical en sus Edictos de Ashoka en c. 250 a. C.[24] Las formas numéricas de esta escritura se transmitieron a Europa a través del Magreb y al-Ándalus durante la Edad Media.[25] El numeral arábigo y otros glifos utilizados para representar el número uno (por ejemplo, el numeral romano (I), número chino (一)) son logogramas. Estos símbolos representan directamente el concepto de «uno» sin descomponerlo en componentes fonéticos.[26] Tipografías modernas [editar]En los tipos de letra modernos, la forma del carácter del dígito 1 se compone típicamente como una figura alineada con un ascendente, de modo que el dígito tiene la misma altura y ancho que una letra mayúscula. Sin embargo, en tipos de letra con cifras elzevirianas (también conocidas como numerales de estilo antiguo o figuras no lineales), el glifo generalmente tiene la altura de la x y está diseñado para seguir el ritmo de la minúscula, como, por ejemplo, en.[27] En tipos de letra antiguos (por ejemplo, Hoefler Text), el tipo de letra del número 1 se parece a una versión en mayúsculas pequeñas (versalita) de I, con serifas paralelas en la parte superior e inferior, mientras que la letra mayúsculaI una forma de altura completa. Esta es una reliquia del sistema de numeración romana donde I representa a 1.[28] Muchas máquinas de escribir antiguas no tienen una tecla dedicada para el número 1, por lo que es necesario utilizar la letra l minúscula o la I mayúscula como sustitutos.[29][30] [31] [32] La minúscula «j» puede considerarse una variante de un número romano en minúscula «i», a menudo empleado para la i final de un número romano «en minúscula». También es posible encontrar ejemplos históricos del uso de j o J como sustituto del numeral árabigo 1.[33][34][35][36] En alemán, la serifa en la parte superior puede extenderse en un trazo ascendente tan largo como la línea vertical. Esta variación puede generar confusión con el glifo utilizado para el siete en otros países, por lo que para proporcionar una distinción visual entre los dos, el dígito 7 puede escribirse con un trazo horizontal a través de la línea vertical.[37] En otros campos [editar]En la tecnología digital, los datos se representan mediante un código binario, es decir, un sistema numérico de base 2 con números representados por una secuencia de 1 y 0. Los datos digitalizados se representan en dispositivos físicos, como computadora s, como pulsos de electricidad a través de dispositivos de conmutación como transistor es o puertas lógicas, donde «1» representa el valor de «encendido». Como tal, el valor numérico de verdadero es igual a 1 en muchos lenguajes de programación.[38][39] En el cálculo lambda y la teoría de la computabilidad, los números naturales se representan mediante la codificación de Church como funciones, donde el numeral de Church para 1 se representa mediante la función aplicado a un argumento una vez (1).[40] En física, ciertas constantes físicas se establecen en 1 en los sistemas de unidades naturales para simplificar la forma de las ecuaciones; por ejemplo, en las unidades de Planck, la velocidad de la luz es igual a 1.[41] Las magnitudes adimensionales también se conocen como «cantidades de dimensión uno».[42] En mecánica cuántica, la condición de normalización para funciones de onda requiere que la integral del módulo al cuadrado de una función de onda sea igual a 1.[43] En química, el hidrógeno, el primer elemento de la tabla periódica y el elemento más abundante en el universo conocido, tiene un número atómico de 1. El grupo 1 de la tabla periódica está formado por el hidrógeno y los metales alcalinos.[44] En filosofía, el número 1 se considera comúnmente un símbolo de unidad, que a menudo representa a Dios o al universo en las tradiciones monoteístas.[45] Los pitagóricos consideraban que los números eran plurales y por lo tanto no clasificaban al 1 en sí como un número, sino como el origen de todos los números. En su filosofía de los números, donde los números impares eran considerados masculinos y los pares femeninos, el 1 era considerado neutral, capaz de transformar números pares en impares y viceversa mediante la suma.[45] El tratado sobre los números del filósofo neopitagórico Nicómaco de Gerasa, recuperado por Boecio en su traducción latina, Introducción a la aritmética, afirmó que el uno no es un número, sino la fuente de los números.[46] En la filosofía de Plotino (y la de otros neoplatónicos), «El Uno» es la realidad última y la fuente de toda existencia.[47] Filón de Alejandría (20 a. C. - 50 d. C.) consideraba el número uno como el número de Dios y la base de todos los números.[48] Véase también [editar]Referencias [editar]- ↑ \"Ordinales\" en el Diccionario Panhispánico de Dudas - Primera edición (octubre 2005) - ↑ Colman, 1912, chapt.2. - ↑ Graham, Knuth y Patashnik, 1994, p. 111. - ↑ Caldwell y Xiong, 2012, pp. 8–9. - ↑ a b Kennedy, 1974, pp. 389. - ↑ Peano, 1889, p. 1. - ↑ Peano, 1908, p. 27. - ↑ Halmos, 1974, p. 32. - ↑ Hodges, 2009, p. 14. - ↑ Hext, 1990. - ↑ Graham, Knuth y Patashnik, 1994, p. 381. - ↑ Blokhintsev, 2012, p. 35. - ↑ Pintz, 1980, pp. 733-735. - ↑ Gaitsgory y Lurie, 2019, pp. 204–307. - ↑ Kottwitz, 1988. - ↑ Miller, 2015, pp. 3-4. - ↑ Huddleston, Rodney D.; Pullum, Geoffrey K.; Reynolds, Brett (2022). Introducción del estudiante a la gramática inglesa (2nd edición). Cambridge, Reino Unido: Cambridge University Press. p. 117. ISBN 978-1-316-51464-1. - ↑ Huddleston, Rodney D.; Pullum, Geoffrey K.; Reynolds, Brett (2022). Una introducción del estudiante a la gramática inglesa (2nd edición). Cambridge, Reino Unido: Cambridge University Press. p. 140. ISBN 978-1-316-51464-1. - ↑ a b c d e f g «Diccionario Etimológico Online». etymonline. com. Douglas Harper. - ↑ a b Conway y Guy, 1996, p. 17. - ↑ Chrisomalis, 2010, p. 241. - ↑ Chrisomalis, 2010, p. 244. - ↑ Chrisomalis, 2010, p. 249. - ↑ Acharya, Eka Ratna (2018). «Evidences of Hierarchy of Brahmi Numeral System». Journal of the Institute of Engineering 14: 136-142. doi:10.3126/jie.v14i1.20077. - ↑ Schubring, 2008, pp. 147. - ↑ Crystal, 2008, pp. 289. - ↑ Cullen, 2007, p. 93. - ↑ «Fonts by Hoefler&Co.». www.typography.com. Consultado el 21 de noviembre de 2023. - ↑ «Why Old Typewriters Lack A \"1\" Key». Post Haste Telegraph Company. 2 de abril de 2017. - ↑ Polt, 2015, pp. 203. - ↑ Chicago, 1993, pp. 52. - ↑ Guastello, 2023, pp. 453. - ↑ Köhler, Christian (23 de noviembre de 1693). «Der allzeitfertige Rechenmeister». - ↑ ten Hoorn, Jan (23 de noviembre de 1679). «Naeuw-keurig reys-boek: bysonderlijk dienstig voor kooplieden, en reysende persoonen, sijnde een trysoor voor den koophandel, in sigh begrijpende alle maate, en gewighte, Boekhouden, Wissel, Asseurantie ... : vorders hoe men ... kan reysen ... door Neederlandt, Duytschlandt, Vrankryk, Spanjen, Portugael en Italiën ...». - ↑ «Articvli Defensionales Peremptoriales & Elisivi, Bvrgermaister vnd Raths zu Nürmberg, Contra Brandenburg, In causa die Fraiszlich Obrigkait [et]c: Produ. 7. Feb. Anno [et]c. 33». Heußler. 23 de noviembre de 1586. - ↑ August (Herzog), Braunschweig-Lüneburg (23 de noviembre de 1624). «Gustavi Seleni Cryptomenytices Et Cryptographiae Libri IX.: In quibus & planißima Steganographiae a Johanne Trithemio ... magice & aenigmatice olim conscriptae, Enodatio traditur; Inspersis ubique Authoris ac Aliorum, non contemnendis inventis». Johann & Heinrich Stern. - ↑ Huber y Headrick, 1999, pp. 181. - ↑ Woodford, 2006, p. 9. - ↑ Godbole, 2002, p. 34. - ↑ Hindley y Seldin, 2008, p. 48. - ↑ Glick, Darby y Marmodoro, 2020, pp. 99. - ↑ Mills, 1995, pp. 538-539. - ↑ McWeeny, 1972, pp. 14. - ↑ Emsley, 2001. - ↑ a b Stewart, 2024. - ↑ British Society for the History of Science (1 de julio de 1977). «From Abacus to Algorism: Theory and Practice in Medieval Arithmetic». The British Journal for the History of Science (Cambridge University Press) 10 (2): Abstract. doi:10.1017/S0007087400015375. Archivado desde el original el 16 de mayo de 2021. Consultado el 16 de mayo de 2021. - ↑ Halfwassen, 2014, pp. 182–183. - ↑ «De Allegoriis Legum», ii.12 [i.66] Bibliografía [editar]- Blokhintsev, D. I. (2012). Quantum Mechanics. Springer Science & Business Media. ISBN 978-9401097116. - Caldwell, Chris K.; Xiong, Yeng (2012). «What is the smallest prime?». Journal of Integer Sequences (Waterloo, CA: Universidad de Waterloo David R. Cheriton School of Computer Science) 15 (9, Article 12.9.7): 1-14. - The Chicago Manual of Style (14.º edición). University of Chicago Press. 1993. ISBN 0-226-10389-7. - Chrisomalis, Stephen (2010). Numerical Notation: A Comparative History. Nueva York: Cambridge University Press. ISBN 978-0-521-87818-0. doi:10.1017/CBO9780511676062. - Colman, Samuel (1912). Coan, C. Arthur, ed. Nature's Harmonic Unity: A Treatise on Its Relation to Proportional Form. Nueva York y Londres: G.P. Putnam's Sons. - Crystal, D. (2008). A Dictionary of Linguistics and Phonetics (6.º edición). Malden, MA: Wiley-Blackwell. ISBN 978-0631226642. - Conway, John H.; Guy, Richard K. (1996). The Book of Numbers. Nueva York: Copernicus Publications. ISBN 0614971667. doi:10.1007/978-1-4612-4072-3. - Cullen, Kristin (2007). Layout Workbook: A Real-World Guide to Building Pages in Graphic Design. Gloucester, MA: Rockport Publishers. pp. 1-240. ISBN 978-1-592-533-527. - Emsley, John (2001). Nature's Building Blocks: An A-Z Guide to the Elements (illustrated, reprint edición). Oxford, UK: Oxford University Press. ISBN 0198503415. - Gaitsgory, Dennis; Lurie, Jacob (2019). Weil's Conjecture for Function Fields (Volume I). Annals of Mathematics Studies 199. Princeton: Princeton University Press. pp. viii, 1-311. ISBN 978-0-691-18213-1. doi:10.2307/j.ctv4v32qc. - Glick, David; Darby, George; Marmodoro, Anna (2020). The Foundation of Reality: Fundamentality, Space, and Time. Oxford University Press. ISBN 978-0198831501. - Guastello, Stephen J. (2023). Human Factors Engineering and Ergonomics: A Systems Approach (3.º edición). CRC press. ISBN 978-1000822045. - Godbole, Achyut S. (2002). Data Comms & Networks. Tata McGraw-Hill Education. ISBN 978-1-259-08223-8. - Graham, Ronald L.; Knuth, Donald E.; Patashnik, Oren (1994). Concrete Mathematics (2.º edición). Reading, MA: Addison-Wesley. ISBN 0-201-14236-8. - Halfwassen, Jens (2014). «The Metaphysics of the One». En Remes, Pauliina; Slaveva-Griffin, Svetla, eds. The Routledge Handbook of Neoplatonism. Routledge Handbooks in Philosophy. Abingdon-on-Thames y Nueva York: Routledge. ISBN 9781138573963. - Halmos, Paul R. (1974). Naive Set Theory. Undergraduate Texts in Mathematics. Springer. pp. vii, 1-104. ISBN 0-387-90092-6. doi:10.1007/978-1-4757-1645-0. - Hext, Jan (1990). Programming Structures: Machines and programs 1. Prentice Hall. p. 33. ISBN 9780724809400.. - Hindley, J. Roger; Seldin, Jonathan P. (2008). Lambda-Calculus and Combinators: An Introduction (2.º edición). Cambridge, UK: Cambridge University Press. pp. xi, 1-358. ISBN 978-1-139-473-248. - Hodges, Andrew (2009). One to Nine: The Inner Life of Numbers. Nueva York: W. W. Norton & Company. pp. 1-330. ISBN 9780385672665. - Huber, Roy A.; Headrick, A. M. (1999). Handwriting Identification: Facts and Fundamentals. CRC Press. ISBN 1420048775. - Huddleston, Rodney D.; Pullum, Geoffrey K.; Reynolds, Brett (2022). A student's Introduction to English Grammar (2.º edición). Cambridge: Cambridge University Press. pp. 1-418. ISBN 978-1-316-51464-1. OCLC 1255524478. - Huddleston, Rodney D.; Pullum, Geoffrey K. (2002). The Cambridge grammar of the English language. Cambridge; Nueva York: Cambridge University Press. ISBN 978-0-521-43146-0. - Hurford, James R. (1994). Grammar: A Student's Guide. Cambridge, UK: Cambridge University Press. pp. 1-288. ISBN 978-0-521-45627-2. OCLC 29702087. - Kennedy, Hubert C. (1974). «Peano's concept of number». Historia Mathematica 1 (4): 387-408. doi:10.1016/0315-0860(74)90031-7. - Kottwitz, Robert E. (1988). «Tamagawa numbers». Annals of Mathematics. 2 (Princeton, NJ: Universidad de Princeton y el Instituto de Estudios Avanzados) 127 (3): 629-646. doi:10.2307/2007007. - McWeeny, Roy (1972). Quantum Mechanics: Principles and Formalism. Dover Books on Physics. Courier Corporation, 2012. ISBN 0486143805. - Miller, Steven J., ed. (2015). Benford's law: theory and applications. Princeton, NJ: Princeton University Press. pp. xxvi, 1-438. ISBN 978-0-691-14761-1. - Mills, I. M. (1995). «Unity as a Unit». Metrologia 31 (6): 537-541. Bibcode:1995Metro..31..537M. doi:10.1088/0026-1394/31/6/013. - Peano, Giuseppe (1889). Arithmetices principia, nova methodo exposita [Los principios de la aritmética, presentados mediante un nuevo método]. Un extracto del tratado donde Peano presentó por primera vez sus axiomas y definió recursivamente operaciones aritméticas. Turín: Fratres Bocca. pp. xvi, 1-20. - Peano, Giuseppe (1908). Formulario Mathematico [Formulario Matemático] (V edición). Turin: Fratres Bocca. pp. xxxvi, 1-463. - Pintz, Janos (1980). «On Legendre's Prime Number Formula». The American Mathematical Monthly 87 (9): 733-735. ISSN 0002-9890. doi:10.2307/2321863. - Polt, Richard (2015). The Typewriter Revolution: A Typist's Companion for the 21st Century. The Countryman Press. ISBN 978-1581575873. - Radford, Luis; Schubring, Gert; Seeger, Falk (2008). «Processes of Algebraization». En Kaiser, Gabriele, ed. Semiotics in Mathematics Education: Epistemology, History, Classroom, and Culture. Semiotic Perspectives in the Teaching and Learning of Math Series 1. Netherlands: Sense Publishers. ISBN 978-9087905972. - Stewart, Ian (2024). «Number Symbolism». Enciclopedia Británica. Consultado el 21 de agosto de 2024. - Woodford, Chris (2006). Digital Technology. Evans Brothers. ISBN 978-0-237-52725-9. Consultado el 24 de marzo de 2016. Enlaces externos [editar]- Wikimedia Commons alberga una galería multimedia sobre Uno. - Wikcionario tiene definiciones y otra información sobre uno."
}