{
  "url": "https://www.bordendairy.com/press-room/history/",
  "title": "History - Borden Dairy",
  "text": "The Borden brand name has a rich history that traces its roots back to Gail Borden, an entrepreneur and inventor who lived during the 1800s. Though he pursued several career paths throughout his lifetime, Mr. Borden is best known for revolutionizing the dairy industry by developing the first successful commercial method of condensing milk. With Mr. Borden’s invention, dairy products could be preserved for long periods of time and could be shipped across hundreds of miles for the first time ever. On Aug. 19, 1856, Mr. Borden filed a patent for his process of condensing milk and soon began opening milk factories. After some initial financial difficulties, Mr. Borden founded the New York Condensed Milk Company with his partner, Jeremiah Milbank, and opened the first successful plant in Wassaic, NY in 1861. During the Civil War, Mr. Borden’s company prospered through major contracts supplying the Union Army with previously unobtainable milk. Following Mr. Borden’s death in 1874, the New York Condensed Milk Company continued producing new products and added processed milk and evaporated milk to its offerings. In 1885, the company pioneered the use of glass milk bottles. It wasn’t until 1919 that the New York Condensed Milk Company changed its name to Borden Company, to honor its founder. Borden Company expanded rapidly in the 1920s by acquiring two of the largest ice cream manufacturers in the U.S., by adding cheese to its product offerings and by acquiring a chemicals company. Between 1927 and 1930, Borden Company bought more than 200 companies around the U.S. and became the nation’s largest distributor of fluid milk. In 1936, Elsie the Cow was introduced as the Borden brand’s mascot. Elsie was an advertising fixture throughout the 1940s and was officially trademarked in 1951. Elsie became an American icon, bringing Borden nationwide recognition through contests and campaigns featuring Elsie and her expanding family: husband Elmer the bull, their calves Beulah and Beauregard and the twins Larabee and Lobelia. Elmer served as mascot for the company’s chemical division and the namesake of Elmer’s Glue. Nearly a century after her “birth,” Elsie remains one of America’s beloved mascots. In 2000, Elsie was named one of the top 10 advertising icons of the 20th century by AdAge. Borden Company continued to expand throughout the 20th century. The chemical division of Borden Company became extremely successful and was renamed Borden Chemical in 1958. Borden Chemical owned plants that made adhesive, plastics and resins, including Elmer’s Glue and Krazy Glue. The year 1966 marked major changes in the business: Borden Company changed its name to Borden Inc., moved headquarters to Columbus, Ohio and became the first U.S. dairy producer to use the U.S. Department of Agriculture Inspection Shield. Borden Inc. was now a large conglomerate. The Borden Foods division acquired companies that made pastas and sauces, bakery products, snacks, jams and jellies and, of course, cheese, milk and ice cream. By the late 1980s, Borden was the world’s largest dairy operator, with sales exceeding $7.2 billion. The company was also the nation’s most active acquirer in 1987 after making 23 acquisitions totaling $442.6 million. Borden acquired 39 more operations before 1990. By the early ‘90s, Borden’s net income fell, leading to several business units becoming divested. In 1995, Kohlberg Kravis Roberts (KKR) acquired Borden for $2 billion and took the company private after 68 years of public trading. The story of our company, Borden Dairy, begins in the 2000s, when Borden Inc. underwent a series of reorganizations. In 2009, Grupo Lala purchased the dairy business, National Dairy LLC, and later established its U.S. operations under the name Borden Dairy, to once again acknowledge the lasting legacy that Mr. Borden left on the industry. In 2020, Capitol Peak Partners purchased the business and continues to run the company today. Today, Borden Dairy is headquartered in Dallas, TX and operates 5 production plants and 30 distribution centers across the Midwest, South, and Southeast. We offer 35+ dairy products that are enjoyed by millions and remain a staple in the dairy industry. As we look to the future, Borden is entering an exciting phase — reintroducing Elsie to a new generation and reaffirming our commitment to quality, tradition, and community."
}