{
  "url": "https://en.m.wikipedia.org/wiki/Mirel's_Score",
  "title": "Mirel's score - Wikipedia",
  "text": "Mirel's score Appearance (Redirected from Mirel's Score) Mirels' score is a tool useful in the management of bone tumors, by identifying those patients who would benefit from prophylactic fixation if they have a high enough risk of pathological fracture. Scoring [edit]A score of 1 to 3 is given for four criteria and summed together. A score greater than 8 suggests prophylactic internal fixation prior to irradiation. References [edit]- ^ Mirels, Hilton (1989). \"Metastatic disease in long bones. A proposed scoring system for diagnosing impending pathologic fractures\". Clinical Orthopaedics and Related Research. 249 (249): 256–64. doi:10.1097/00003086-198912000-00027. PMID 2684463. Republished as: Mirels, Hilton (2003). \"The Classic: Metastatic Disease in Long Bones a Proposed Scoring System for Diagnosing Impending Pathologic Fractures\". Clinical Orthopaedics and Related Research. 415 (415 Suppl): S4–13. doi:10.1097/01.blo.0000093045.56370.dd. PMID 14600587. S2CID 43255503. Further reading [edit]- Haidukewych, G. J. (2012). \"Metastatic disease around the hip: Maintaining quality of life\". Journal of Bone and Joint Surgery. 94 (11 Suppl A): 22–5. doi:10.1302/0301-620X.94B10.30509. PMID 23118375. - Al-Ghamdi, Ahmed; Hings, Ingrid; Turcotte, Robert E (2009). \"Management of long-bone metastases: A surgical perspective\". Aging Health. 5 (3): 313–21. doi:10.2217/ahe.09.30. - Ward, William G.; Spang, Jeff; Howe, David (2000). \"Metastatic Disease of the Femur\". Orthopedic Clinics of North America. 31 (4): 633–45. doi:10.1016/S0030-5898(05)70181-4. PMID 11043102. - Brennan, David; Kelly, Michael E.; Nason, Gregory J.; Collins-Smyth, Coilin; McGuire, Barry B.; Lennon, Gerald M. (2013). \"Tibial Metastasis from Muscle Invasive Bladder Carcinoma: An Unusual Site\". Current Urology. 7 (3): 160–2. doi:10.1159/000343556. PMC 4024504. PMID 24917780. - Agarwal, Manishg; Nayak, Prakash (2015). \"Management of skeletal metastases: An orthopaedic surgeon′s guide\". Indian Journal of Orthopaedics. 49 (1): 83–100. doi:10.4103/0019-5413.143915. PMC 4292329. PMID 25593359. - Gerrand, Craig H.; Rankin, Kenneth (2014). \"Metastatic Disease in Long Bones. A Proposed Scoring System for Diagnosing Impending Pathologic Fractures\". In Banaszkiewicz, Paul; Kader, Deiary F. (eds.). Classic Papers in Orthopaedics. pp. 479–80. doi:10.1007/978-1-4471-5451-8_123. ISBN 978-1-4471-5450-1."
}