{
  "url": "https://en.wikipedia.org/wiki/Denmark",
  "title": "Denmark - Wikipedia",
  "text": "Denmark Denmark[b] is a Nordic country in Northern Europe. It is the metropole and most populous constituent of the Kingdom of Denmark,[N 5] also known as the Danish Realm, a constitutionally unitary state that includes the autonomous territories of the Faroe Islands and Greenland in the north Atlantic Ocean.[13] Metropolitan Denmark,[N 6] also called \"continental Denmark\" or \"Denmark proper\",[14] consists of the northern Jutland peninsula and an archipelago of 406 islands.[15] It is the southernmost of the Scandinavian countries, lying southwest of Sweden, south of Norway, and north of Germany, with which it shares a short border. Denmark proper is situated between the North Sea to the west and the Baltic Sea to the east.[N 7] The Kingdom of Denmark, including the Faroe Islands and Greenland, has roughly 1,400 islands greater than 100 square metres (1,100 sq ft) in area; 443 have been named and 78 are inhabited.[16] Denmark's population is over 6 million (1 May 2025),[9] of which roughly 40% live in Zealand, (Sjælland) the largest and most populated island in Denmark proper; Copenhagen, (København) the capital and largest city of the Danish Realm, is situated on Zealand and Amager and Slotsholmen.[17] Composed mostly of flat, arable land, Denmark is characterised by sandy coasts, low elevation, and a temperate climate. Denmark exercises hegemonic influence in the Danish Realm, devolving powers to the other constituent entities to handle their internal affairs. Home rule was established in the Faroe Islands in 1948; Greenland achieved home rule in 1979 and further autonomy in 2009.[18] The unified Kingdom of Denmark emerged in the eighth century AD as a maritime power amid the struggle for control of the Baltic Sea.[2] In 1397, it formed the Kalmar Union with Norway and Sweden. This union persisted until Sweden's secession in 1523. The remaining Kingdom of Denmark–Norway endured a series of wars in the 17th century that resulted in territorial cessions to Sweden. A surge of nationalist movements in the 19th century were defeated by the Danes in the First Schleswig War of 1848. The adoption of the Constitution of Denmark on 5 June 1849 ended the absolute monarchy. In the Second Schleswig War Denmark lost Schleswig-Holstein, which led to changes in Danish politics henceforth emphasising social cohesion in the diminished realm, as well as the clearing of the vast moors of Jutland for agriculture, new Christian movements split between Indre Mission and Grundtvig, but generally a stronger self-perception among the people of belonging to a unified country and state. In 1920, North Schleswig became Danish again. Denmark began industrialising in the mid 19th century, becoming a major agricultural exporter. It introduced social and labour market reforms in the early 20th century, forming the basis for the present welfare state model and advanced mixed economy. Denmark remained neutral during World War I; Danish neutrality was violated in World War II by a rapid German invasion in April 1940. During occupation, a resistance movement emerged in 1943, while Iceland declared independence in 1944; Denmark was liberated after the end of the war in May 1945. In 1973, Denmark, together with Greenland but not the Faroe Islands, became a member of what is now the European Union; however, it negotiated certain opt-outs, such as retaining its own currency, the krone. Denmark is a developed country with an advanced high-income economy, high standard of living, and robust social welfare policies. Danish culture and society are broadly progressive egalitarian, and socially liberal; Denmark was the first country to legally recognise same-sex partnerships. It is a founding member of NATO, the Nordic Council, the OECD, the OSCE, the Council of Europe and the United Nations, and is part of the Schengen Area. Denmark maintains close political, cultural, and linguistic ties with its Scandinavian neighbours. Etymology The etymology of the name \"Denmark\", the relationship between \"Danes\" and \"Denmark\", and the emergence of Denmark as a unified kingdom are topics of continuous scholarly debate.[19][20] This is centred primarily on the morpheme \"Dan\" and whether it refers to the Dani or a historical person Dan and the exact meaning of the -\"mark\" ending. Most etymological dictionaries and handbooks derive \"Dan\" from a word meaning \"flat land\",[21] related to German Tenne \"threshing floor\", English den \"cave\".[21] The element mark is believed to mean woodland or borderland (see marches), with probable references to the border forests in south Schleswig.[22] The first recorded use of the word Danmark within Denmark itself is found on the two Jelling stones, which are runestones believed to have been erected by Gorm the Old, considered to be Denmark's first king, (c. 955) and Harald Bluetooth (c. 965). The larger of the two stones is popularly cited as the \"baptismal certificate\" (dåbsattest) of Denmark,[23] though both use the word \"Denmark\", in the accusative ᛏᛅᚾᛘᛅᚢᚱᚴ tanmaurk ([danmɒrk]) on the large stone, and the genitive ᛏᛅᚾᛘᛅᚱᚴᛅᚱ \"tanmarkar\" (pronounced [danmarkaɽ]) on the small stone, while the dative form tąnmarku (pronounced [danmarkʊ]) is found on the contemporaneous Skivum stone. The inhabitants of Denmark are there called tani ([danɪ]), or \"Danes\", in the accusative. History Prehistory The earliest archaeological finds in Denmark date back to the Eem interglacial period from 130,000 to 110,000 BC.[24] Denmark has been inhabited since around 12,500 BC and agriculture has been evident since 3900 BC.[25] The Nordic Bronze Age (1800–600 BC) in Denmark was marked by burial mounds, which left an abundance of findings including lurs and the Sun Chariot. During the Pre-Roman Iron Age (500 BC – AD 1), native groups began migrating south, and the first tribal Danes came to the country between the Pre-Roman and the Germanic Iron Age,[26] in the Roman Iron Age (AD 1–400).[25] The Roman provinces maintained trade routes and relations with native tribes in Denmark, and Roman coins have been found in Denmark. Evidence of strong Celtic cultural influence dates from this period in Denmark and much of North-West Europe and is among other things reflected in the finding of the Gundestrup cauldron. The tribal Danes came from the east Danish islands (Zealand) and Scania, today Skåne in Southern Sweden, and spoke an early form of North Germanic. Historians believe that before their arrival, most of Jutland and the nearest islands were settled by tribal Jutes. Many Jutes migrated to Great Britain, according to legend some as mercenaries of Brythonic King Vortigern, and formed the south-eastern territories of Kent, the Isle of Wight and other areas, where they settled. They were later absorbed or ethnically cleansed by the invading Angles and Saxons, who formed the Anglo-Saxons. The remaining Jutish population in Jutland assimilated in with the settling Danes. A short note about the Dani in Getica by the historian Jordanes is believed to be an early mention of the Danes, one of the ethnic groups from whom modern Danes are descended.[27][28] The Danevirke defence structures were built in phases from the 3rd century forward and the sheer size of the construction efforts in AD 737 are attributed to the emergence of a Danish king.[29] A new runic alphabet was first used around the same time and Ribe, the oldest town of Denmark, was founded about AD 700. Viking and Middle Ages From the 8th to the 10th century the population of the wider Scandinavian region was called Vikings by non-Scandinavians. While they mostly lived off agriculture, fishing and trade, they were excellent sailors and would travel as far as Iceland, Greenland and Canada. They traded in all parts of Europe, down to Constantinople and beyond, but would also raid local settlements and set up colonies in far-flung places. The Danish Vikings were most actively raiding the eastern and southern British Isles and Western Europe. They settled in parts of England (known as the Danelaw) under King Sweyn Forkbeard in 1013, and in France where Danes and Norwegians were allowed to settle in what would become Normandy in exchange of allegiance to Robert I of France with Rollo as first ruler.[30] Some Anglo-Saxon pence of this period have been found in Denmark.[31] Denmark was largely consolidated by the late 8th century and its rulers are consistently referred to in Frankish sources as kings (reges). Under the reign of Gudfred in 804 the Danish kingdom may have included all the lands of Jutland, Scania and the Danish islands, excluding Bornholm.[32] The extant Danish monarchy traces its roots back to Gorm the Old, who established his reign in the early 10th century.[2] As attested by the Jelling stones, the Danes were Christianised around 965 by Harald Bluetooth, the son of Gorm and Thyra. It is believed that Denmark became Christian for political reasons so as not to get invaded by the Holy Roman Empire. A rising Christian power in Europe, the Holy Roman Empire was an important trading partner for the Danes. As a deterrent against this threat, Harald built six fortresses around Denmark called Trelleborg and built a further Danevirke. In the early 11th century, Canute the Great won and united Denmark, England, and Norway for almost 30 years with a Scandinavian army.[31][33] Throughout the High and Late Middle Ages, Denmark also included Skåneland (the areas of Scania, Halland, and Blekinge in present-day southern Sweden) and Danish kings ruled Danish Estonia, as well as the duchies of Schleswig and Holstein. Most of the latter two now form the state of Schleswig-Holstein in northern Germany. In 1397, Denmark entered into a personal union known as the Kalmar Union with Norway and Sweden, united under Queen Margaret I.[34][35][36] The three countries were to be treated as equals in the union. However, even from the start, Margaret may not have been so idealistic; treating Denmark as the clear \"senior\" partner of the union.[37][38] Thus, much of the next 125 years of Scandinavian history revolves around this union, with Sweden breaking off and re-joining the Kalmar Union repeatedly. The issue was for practical purposes resolved on 17 June 1523, as Swedish King Gustav Vasa conquered the city of Stockholm. The Protestant Reformation spread to Scandinavia in the 1530s, and following the Count's Feud civil war, Denmark converted to Lutheranism in 1536. Later that year, Denmark entered into a new union with Norway. Early modern history (1536–1849) After Sweden permanently broke away from the Kalmar Union, Denmark tried on several occasions to reassert control over its neighbour. King Christian IV attacked Sweden in the 1611–1613 Kalmar War but failed to accomplish his main objective of forcing it to return to the union. The war led to no territorial changes, but Sweden was forced to pay a war indemnity of 1 million silver riksdaler to Denmark, an amount known as the Älvsborg ransom.[39] King Christian used this money to found several towns and fortresses, most notably Glückstadt (founded as a rival to Hamburg) and Christiania. Inspired by the Dutch East India Company, he founded a similar Danish company and planned to claim Ceylon as a colony, but the company only managed to acquire Tranquebar on India's Coromandel Coast.[40][41] Denmark's large colonial aspirations included a few key trading posts in Africa and India. While Denmark's trading posts in India were of little note, it played an important role in the highly lucrative Atlantic slave trade, through its trading outposts in Fort Christiansborg in Osu, Ghana through which 1.5 million slaves were traded.[42][43] While the Danish colonial empire was sustained by trade with other major powers, and plantations – ultimately a lack of resources led to its stagnation.[44] In the Thirty Years' War, Christian tried to become the leader of the Lutheran states in Germany but suffered a crushing defeat at the Battle of Lutter.[45] The result was that the Catholic army under Albrecht von Wallenstein was able to invade, occupy, and pillage Jutland, forcing Denmark to withdraw from the war.[46] Denmark managed to avoid territorial concessions, but King Gustavus Adolphus' intervention in Germany was seen as a sign that the military power of Sweden was on the rise while Denmark's influence in the region was declining. Swedish armies invaded Jutland in 1643 and claimed Scania in 1644. In the 1645 Treaty of Brømsebro, Denmark surrendered Halland, Gotland, the last parts of Danish Estonia, and several provinces in Norway. Seeing an opportunity to tear up the Treaty of Brømsebro, King Frederick III of Denmark, in 1657, declared war on Sweden, the latter being deeply involved in the Second Northern War (1655–1660), and marched on Bremen-Verden. This led to a massive Danish defeat as the armies of King Charles X Gustav of Sweden conquered Jutland and, following the Swedish March across the frozen Danish straits, occupied Funen and much of Zealand before signing the Peace of Roskilde in February 1658, which gave Sweden control of Scania, Blekinge, Bohuslän, Trøndelag, and the island of Bornholm. Charles X Gustav quickly regretted not having ruined Denmark and in August 1658, he launched a second attack on Denmark, conquered most of the Danish islands, and began a two-year-long siege of Copenhagen. King Frederick III actively led the defence of the city, rallying its citizens to take up arms, and repelled the Swedish attacks.[47][48] The siege ended following the death of Charles X Gustav in 1660.[49] In the ensuing peace settlement, Denmark managed to maintain its independence and regain control of Trøndelag and Bornholm.[50] Attaining great popularity following the war, Frederick III used this to disband the elective monarchy in favour of absolute monarchy, which lasted until 1848 in Denmark.[51] Denmark tried but failed to regain control of Scania in the Scanian War (1675–1679). After the Great Northern War (1700–21), Denmark managed to regain control of the parts of Schleswig and Holstein ruled by the house of Holstein-Gottorp in the 1720 Treaty of Frederiksborg and the 1773 Treaty of Tsarskoye Selo, respectively. Denmark prospered greatly in the last decades of the 18th century due to its neutral status allowing it to trade with both sides in the many contemporary wars. In the Napoleonic Wars, Denmark traded with both France and the United Kingdom and joined the League of Armed Neutrality with Russia, Sweden, and Prussia.[52] British fears that Denmark-Norway would ally with France led to two attacks against Danish targets in Copenhagen in 1801 and 1807. These attacks resulted in the British capturing most of the Dano-Norwegian navy and led to the outbreak of the Gunboat War. In 1807 much of Copenhagen was burned down as a result of these bombardments, including Vor Frue Kirke, the main Danish cathedral. British control of the waterways between Denmark and Norway proved disastrous to the union's economy and in 1813 Denmark–Norway went bankrupt.[citation needed] The union was dissolved by the Treaty of Kiel in 1814; the Danish monarchy \"irrevocably and forever\" renounced claims to the Kingdom of Norway in favour of the Swedish king.[53] Denmark kept the possessions of Iceland (which retained the Danish monarchy until 1944), the Faroe Islands and Greenland, all of which had been governed by Norway for centuries.[54] Apart from the Nordic colonies, Denmark continued to rule over Danish India from 1620 to 1869, the Danish Gold Coast (Ghana) from 1658 to 1850, and the Danish West Indies from 1671 to 1917. Constitutional monarchy (1849–present) A nascent Danish liberal and national movement gained momentum in the 1830s; after the European Revolutions of 1848, Denmark peacefully became a constitutional monarchy on 5 June 1849. A new constitution established a two-chamber parliament. Denmark faced war against both Prussia and the Austrian Empire in what became known as the Second Schleswig War, lasting from February to October 1864. Denmark was defeated and obliged to cede Schleswig and Holstein to Prussia. This loss came as the latest in the long series of defeats and territorial losses that had begun in the 17th century. After these events, Denmark pursued a policy of neutrality in Europe.[55] Industrialisation came to Denmark in the second half of the 19th century.[56] The nation's first railways were constructed in the 1850s, and improved communications and overseas trade allowed industry to develop in spite of Denmark's lack of natural resources. Trade unions developed, starting in the 1870s. There was a considerable migration of people from the countryside to the cities, and Danish agriculture became centred on the export of dairy and meat products. Denmark maintained its neutral stance during World War I. After the defeat of Germany, the Versailles powers offered to return the region of Schleswig-Holstein to Denmark. Fearing German irredentism, Denmark refused to consider the return of the area without a plebiscite; the two Schleswig Plebiscites took place on 10 February and 14 March 1920, respectively. On 10 July 1920, Northern Schleswig was recovered by Denmark, thereby adding some 163,600 inhabitants and 3,984 square kilometres (1,538 sq mi). The country's first social democratic government took office in 1924.[57] In 1939, Denmark signed a 10-year nonaggression pact with Nazi Germany. However, Germany invaded Denmark on 9 April 1940, and the Danish government quickly surrendered. However, as around 10% of the German army's foodstuff was supplied by Danish agricultural output and Germany wanted that supply line to continue, the occupation was more cooperative and less harsh than many other countries in Europe. World War II in Denmark was characterised by economic co-operation with Germany until 1943, when the Danish government refused further co-operation and its navy scuttled most of its ships and sent many of its officers to Sweden, which was neutral. At that point the government fell. The Danish resistance performed a rescue operation that managed to evacuate several thousand Jews and their families to safety in Sweden before the Germans could send them to death camps. Some Danes supported Nazism by joining the Danish Nazi Party or volunteering to fight with Germany as part of the Frikorps Danmark.[58] Iceland severed ties with Denmark and became an independent republic in 1944; Germany surrendered in May 1945. In 1948, the Faroe Islands gained home rule. In 1949, Denmark became a founding member of NATO. Denmark was a founding member of the European Free Trade Association (EFTA). During the 1960s, the EFTA countries were often referred to as the Outer Seven, as opposed to the Inner Six of what was then the European Economic Community (EEC).[59] In 1973, along with Britain and Ireland, Denmark joined the European Economic Community (now the European Union) after a public referendum. The Maastricht Treaty, which involved further European integration, was rejected by the Danish people in 1992; it was only accepted after a second referendum in 1993, which provided for four opt-outs from policies. The Danes rejected the euro as the national currency in a referendum in 2000. Greenland gained home rule in 1979 and was awarded self-determination in 2009. Neither the Faroe Islands nor Greenland are members of the European Union, the Faroese having declined membership of the EEC in 1973 and Greenland in 1986, in both cases because of fisheries policies. Constitutional change in 1953 led to a single-chamber parliament elected by proportional representation, female accession to the Danish throne, and Greenland becoming an integral part of Denmark. The centre-left Social Democrats led a string of coalition governments for most of the second half of the 20th century, introducing the Nordic welfare model. The Liberal Party and the Conservative People's Party have also led centre-right governments. Since 2025 the Danish territory of Greenland has been the target of U.S. hybrid warfare under Donald Trump.[60] Mette Frederiksen said that \"the Kingdom of Denmark—and thus Greenland—is a member of NATO and is therefore covered by the Alliance’s collective security guarantee [...] I [...] strongly urge the United States to cease its threats against a historically close ally.\"[61] Geography Located in Northern Europe, Denmark[N 6] consists of the northern part of the Jutland peninsula and an archipelago of 406 islands.[15] Of these, the largest island is Zealand, on which the capital Copenhagen is situated, followed by the North Jutlandic Island, Funen, and Lolland.[63] The island of Bornholm is located some 150 km east of the rest of the country, in the Baltic Sea. Many of the larger islands are connected by bridges; a bridge-tunnel across the Øresund connects Zealand with Sweden; the Great Belt Fixed Link connects Funen with Zealand; and the Little Belt Bridge connects Jutland with Funen. Ferries or small aircraft connect to the smaller islands. The four cities with populations over 100,000 are the capital Copenhagen on Zealand; Aarhus and Aalborg in Jutland; and Odense on Funen. The metropolitan part occupies a total area of 42,943.9 square kilometres (16,581 sq mi).[64] The area of inland water is 600 km2 (232 sq mi).[65] The size of the land area cannot be stated exactly since the ocean constantly erodes and adds material to the coastline, and because of human land reclamation projects (to counter erosion). Post-glacial rebound raises the land by a bit less than 1 cm (0.4 in) per year in the north and east, extending the coast. A circle enclosing the same area as Denmark would be 234 kilometres (145 miles) in diameter with a circumference of 736 km (457 mi) (land area only: 232.33 km (144.36 mi) and 730 km (454 mi) respectively). It shares a border of 68 kilometres (42 mi) with Germany to the south and is otherwise surrounded by 8,750 km (5,437 mi) of tidal shoreline (including small bays and inlets).[66] No location in Denmark is farther from the coast than 52 km (32 mi). On the south-west coast of Jutland, the tide is between 1 and 2 m (3.28 and 6.56 ft), and the tideline moves outward and inward on a 10 km (6.2 mi) stretch.[67] Denmark's territorial waters total 105,000 square kilometres (40,541 square miles). Denmark's northernmost point is Skagen point (the north beach of the Skaw) at 57° 45' 7\" northern latitude; the southernmost is Gedser point (the southern tip of Falster) at 54° 33' 35\" northern latitude; the westernmost point is Blåvandshuk at 8° 4' 22\" eastern longitude; and the easternmost point is Østerskær at 15° 11' 55\" eastern longitude. This is in the small Ertholmene archipelago 18 kilometres (11 mi) north-east of Bornholm. The distance from east to west is 452 kilometres (281 mi), from north to south 368 kilometres (229 mi). The metropolitan part is flat with little elevation, having an average height above sea level of 31 metres (102 ft). The highest natural point is Møllehøj, at 170.86 metres (560.56 ft).[68] Although this is by far the lowest high point in the Nordic countries and also less than half of the highest point in Southern Sweden, Denmark's general elevation in its interior is generally at a safe level from rising sea levels. Lammefjorden, deeper than −7 m (−23 ft) (near Audebo), is the lowest point. A sizeable portion of Denmark's terrain consists of rolling plains whilst the coastline is sandy, with large dunes in northern Jutland. Although once extensively forested, today Denmark largely consists of arable land. It is drained by a dozen or so streams, and the most significant include the Gudenå, Odense, Skjern, Suså and Vidå—a stream that flows along its southern border with Germany. The country has 1008 lakes, 16 have an area of more than 500 hectares (1,200 acres). Lake Arresø, located northwest of Copenhagen, is the largest lake.[65] The Kingdom of Denmark includes two overseas territories, both well to the west of Denmark: Greenland, the world's largest island, and the Faroe Islands in the North Atlantic Ocean. These territories are self-governing under their own parliaments (the Løgting and Inatsisartut) and form, together with continental Denmark, part of the Danish Realm, a country. Climate Denmark has a temperate climate, characterised by cool to cold winters, with mean temperatures in January of 1.5 °C (34.7 °F), and mild summers, with a mean temperature in August of 17.2 °C (63.0 °F).[69] The most extreme temperatures recorded in Denmark, since 1874 when recordings began, was 36.4 °C (97.5 °F) in 1975 and −31.2 °C (−24.2 °F) in 1982.[70] Denmark has an average of 179 days per year with precipitation, on average receiving a total of 765 millimetres (30 in) per year; autumn is the wettest season and spring the driest.[69] The position between a continent and an ocean means that the weather is often unstable.[71] Because of Denmark's northern location, there are large seasonal variations in daylight: short days during the winter with sunrise around 8:45 am and sunset 3:45 pm (standard time), as well as long summer days with sunrise at 4:30 am and sunset at 10 pm (daylight saving time).[72] In the middle of summer, it is light all night long. Ecology Denmark belongs to the Boreal Kingdom and can be subdivided into two ecoregions: the Atlantic mixed forests and Baltic mixed forests.[73][74] Almost all of Denmark's primeval temperate forests have been destroyed or fragmented, chiefly for agricultural purposes during the last millennia.[75] The deforestation has created large swaths of heathland and devastating sand drifts.[75] In spite of this, there are several larger second growth woodlands in the country and, in total, 12.9% of the land is now forested.[76] Norway spruce is the most widespread tree (2017); an important tree in the Christmas tree production. Denmark holds a Forest Landscape Integrity Index mean score of 0.5/10, ranking it 171st globally out of 172 countries—behind only San Marino.[77][further explanation needed] Roe deer occupy the countryside in growing numbers, and large-antlered red deer can be found in the sparse woodlands of Jutland. Denmark is also home to smaller mammals, such as polecats, hares and hedgehogs.[78] Approximately 400 bird species inhabit Denmark and about 160 of those breed in the country.[79] Large marine mammals include healthy populations of harbour porpoises, growing numbers of pinnipeds and occasional visits of whales, including blue whales and orcas. Cod, herring and plaice are abundant culinary fish in Danish waters and form the basis for a large fishing industry.[80] Environment Denmark historically taken a progressive stance on environmental preservation: In 1971, it established a Ministry of Environment and was the first country in the world to implement an environmental law in 1973.[81] Land and water pollution are two of Denmark's most significant environmental issues, although much of its household and industrial waste is now increasingly filtered and sometimes recycled. Denmark is a signatory to the Climate Change-Kyoto Protocol to reduce greenhouse gas emissions.[82] However, its national ecological footprint is 8.26 global hectares per person, which is very high compared to a world average of 1.7 in 2010.[83] Contributing factors are an exceptionally high value for cropland and grazing land,[84] possibly due to substantially high meat production (115.8 kilograms (255 lb) meat annually per capita) and economic size of the meat and dairy industries.[85] Notwithstanding its relatively high emissions, Denmark topped the list of the 2015 Climate Change Performance Index due to its implementation effective climate protection policies.[86] The country has consistently placed first since 2020.[87] Denmark ranked 10th in the Environmental Performance Index,[88] which measures progress at mitigating climate change, safeguarding ecosystem vitality, and promoting environmental health.[89] In 2021, Denmark joined Costa Rica to launch the \"Beyond Oil and Gas alliance\" for stopping use fossil fuels.[90] The Danish government stopped issuing new licences for oil and gas extraction in December 2020.[91] Denmark's territories, Greenland and the Faroe Islands, catch approximately 650 whales per year.[92][93] Greenland's quotas for the catch of whales are determined according to the advice of the International Whaling Commission (IWC), having quota decision-making powers.[94] Government services and politics Politics in Denmark operate under a framework laid out in the Constitution of Denmark.[N 8] First written in 1849, it establishes a sovereign state in the form of a constitutional monarchy, with a representative unicameral parliamentary system. The monarch officially retains executive power and presides over the Council of State (privy council).[96][97] In practice, the duties of the monarch are strictly representative and ceremonial,[N 9][98] such as the formal appointment and dismissal of the Prime Minister and other Government ministers. The Monarch is not answerable for their actions, and their person is sacrosanct.[99] Hereditary monarch King Frederik X has been head of state since 14 January 2024.[100] The Danish political system, which emphasizes broad consensus, is used by American political scientist Francis Fukuyama as a reference point for near-perfect governance; his phrase \"getting to Denmark\" refers to the country's status as a global model for stable social and political institutions.[101] Government The Danish parliament is unicameral and called the Folketing (Danish: Folketinget). It is the legislature of the Kingdom of Denmark, passing acts that apply in Denmark and, variably, Greenland and the Faroe Islands. The Folketing is also responsible for adopting the state's budgets, approving the state's accounts, appointing and exercising control of the Government, and taking part in international co-operation. Bills may be initiated by the Government or by members of parliament. All bills passed must be presented before the Council of State to receive Royal Assent within thirty days in order to become law.[102] Denmark is a representative democracy with universal suffrage.[N 10] Membership of the Folketing is based on proportional representation of political parties,[104] with a 2% electoral threshold. Denmark elects 175 members to the Folketing, with Greenland and the Faroe Islands electing an additional two members each—179 members in total.[105] Parliamentary elections are held at least every four years, but it is within the powers of the prime minister to ask the monarch to call for an election before the term has elapsed. On a vote of no confidence, the Folketing may force a single minister or an entire government to resign.[106] The Government of Denmark operates as a cabinet government, where executive authority is exercised—formally, on behalf of the monarch—by the prime minister and other cabinet ministers, who head ministries. As the executive branch, the Cabinet is responsible for proposing bills and a budget, executing the laws, and guiding the foreign and internal policies of Denmark. The monarch usually, but not necessarily, requests the person most likely to command the confidence majority in the Folketing to become prime minister; this is often the current leader of the largest political party or, more effectively, through a coalition of parties. A single party generally does not have sufficient political power in terms of the number of seats to form a cabinet on its own; Denmark has often been ruled by coalition governments, themselves usually minority governments dependent on non-government parties.[107] Following the 2022 Danish general election in November 2022, incumbent prime minister and Social Democratic leader Mette Frederiksen in December 2022 formed the current Frederiksen II Cabinet, a coalition government with the until then leading opposition party Venstre and the recently founded Moderate party.[108] Law and judicial system Denmark has a civil law system with some references to Germanic law. Denmark resembles Norway and Sweden in never having developed a case-law like that of England and the United States nor comprehensive codes like those of France and Germany. Much of its law is customary.[110] The judicial system of Denmark is divided between courts with regular civil and criminal jurisdiction and administrative courts with jurisdiction over litigation between individuals and the public administration. Articles sixty-two and sixty-four of the Constitution (grundloven) ensure judicial independence from government and Parliament by providing that judges shall only be guided by the law, including acts, statutes and practice.[111] The Kingdom of Denmark does not have a single unified judicial system – Denmark has one system, Greenland another, and the Faroe Islands a third.[112] However, decisions by the highest courts in Greenland and the Faroe Islands may be appealed to the Danish High Courts. The Danish Supreme Court is the highest civil and criminal court responsible for the administration of justice in the Kingdom. Danish Realm The Kingdom of Denmark is a unitary state that comprises, in addition to metropolitan Denmark, two autonomous territories[13] in the North Atlantic Ocean: the Faroe Islands and Greenland. They have been integrated parts of the Danish Realm since the 18th century; however, due to their separate historical and cultural identities, these parts of the Realm have extensive political powers and have assumed legislative and administrative responsibility in a substantial number of fields.[113] Home rule was granted to the Faroe Islands in 1948 and to Greenland in 1979, each having previously had the status of counties.[114] The Faroe Islands and Greenland have their own home governments and parliaments and are effectively self-governing in regards to domestic affairs apart from the judicial system and monetary policy.[114] High Commissioners (Rigsombudsmand) act as representatives of the Danish government in the Faroese Løgting and in the Greenlandic Parliament, but they cannot vote.[114] The Faroese home government is defined to be an equal partner with the Danish national government,[115] while the Greenlandic people are defined as a separate people with the right to self-determination.[116] Administrative divisions Denmark, with a total area of 43,094 square kilometres (16,639 sq mi), is divided into five administrative regions (Danish: regioner). The regions are further subdivided into 98 municipalities (kommuner). The easternmost land in Denmark, the Ertholmene archipelago, with an area of 39 hectares (0.16 sq mi), is neither part of a municipality nor a region but belongs to the Ministry of Defence.[119] The provinces of Denmark are statistical divisions of Denmark, positioned between the administrative regions and municipalities. They are not administrative divisions, nor subject for any kind of political elections, but are mainly for statistical use. The regions were created on 1 January 2007 to replace the 16 former counties. At the same time, smaller municipalities were merged into larger units, reducing the number from 271 to 98.[120] Most municipalities have a population of at least 20,000 to give them financial and professional sustainability, although a few exceptions were made to this rule.[121] The administrative divisions are led by directly elected councils, elected proportionally every four years; the most recent Danish local elections were held on 18 November 2025. Other regional structures use the municipal boundaries as a layout, including the police districts, the court districts and the electoral wards. Regions The governing bodies of the regions are the regional councils, each with forty-one councillors elected for four-year terms. The councils are headed by regional district chairmen (regionsrådsformand), who are elected by the council.[122] The areas of responsibility for the regional councils are the national health service, social services and regional development.[122][123] Unlike the counties they replaced, the regions are not allowed to levy taxes and the health service is partly financed by a national health care contribution until 2018 (sundhedsbidrag), partly by funds from both government and municipalities.[124] From 1 January 2019 this contribution will be abolished, as it is being replaced by higher income tax instead. The area and populations of the regions vary widely; for example, the Capital Region has a population three times larger than that of North Denmark Region. Under the county system certain densely populated municipalities, such as Copenhagen Municipality and Frederiksberg, had been given a status equivalent to that of counties, making them first-level administrative divisions. These sui generis municipalities were incorporated into the new regions under the 2007 reforms. On 1 January 2027, the Capital Region and Region Zealand will be merged to form the Region of Eastern Denmark.[125] Foreign relations Denmark wields considerable influence in Northern Europe and is a middle power in international affairs.[126] In recent years, Greenland and the Faroe Islands have been guaranteed a say in foreign policy issues such as fishing, whaling, and geopolitical concerns. The foreign policy of Denmark is substantially influenced by its membership of the European Union (EU); Denmark including Greenland joined the European Economic Community (EEC), the EU's predecessor, in 1973.[N 11] Denmark held the Presidency of the Council of the European Union on seven occasions, most recently from January to June 2012.[127] Following World War II, Denmark ended its two-hundred-year-long policy of neutrality. It has been a founding member of the North Atlantic Treaty Organization (NATO) since 1949, and membership remains highly popular.[128] As a member of Development Assistance Committee (DAC), Denmark has for a long time been among the countries of the world contributing the largest percentage of gross national income to development aid. In 2015, Denmark contributed 0.85% of its gross national income (GNI) to foreign aid and was one of only six countries meeting the longstanding UN target of 0.7% of GNI.[N 12][129] The country participates in both bilateral and multilateral aid, with the aid usually administered by the Ministry of Foreign Affairs. The organisational name of Danish International Development Agency (DANIDA) is often used, in particular when operating bilateral aid. According to the 2024 Global Peace Index, Denmark is the 8th most peaceful country in the world.[130] Military Denmark's armed forces are known as the Danish Defence (Danish: Forsvaret). The Minister of Defence is commander-in-chief of the Danish Defence, and serves as chief diplomatic official abroad. During peacetime, the Ministry of Defence employs around 33,000 people in total. The main military branches employ almost 27,000: 15,460 in the Royal Danish Army, 5,300 in the Royal Danish Navy and 6,050 in the Royal Danish Air Force (all including conscripts).[citation needed] The Danish Emergency Management Agency employs 2,000 (including conscripts), and about 4,000 are in non-branch-specific services like the Danish Defence Command and the Danish Defence Intelligence Service. Furthermore, around 44,500 serve as volunteers in the Danish Home Guard.[131] Denmark is a long-time supporter of international peacekeeping, but since the NATO bombing of Yugoslavia in 1999 and the War in Afghanistan in 2001, Denmark has also found a new role as a warring nation, participating actively in several wars and invasions. This relatively new situation has stirred some internal critique, but the Danish population has generally been very supportive, in particular of the War in Afghanistan.[132][133] The Danish Defence has around 1,400[134] staff in international missions, "
}