{
  "url": "https://apps.apple.com/us/app/roblox/id431946152",
  "title": "âRoblox App - App Store",
  "text": "Roblox Play, Create, and Connect Free Â· InâApp Purchases ROBLOX â PLAY, CREATE, AND EXPLORE MILLIONS OF EXPERIENCES Thereâs something for everyone on Roblox. Whether youâre looking to explore, create, roleplay, compete, or hang out with friends, there's an endless amount of immersive experiences for you to discover. And even more are being made every day, all from a growing community of creators around the world. Already have a Roblox account? Log in with your existing account and start exploring some of the most popular experiences from the Roblox community today, including Grow a Garden, Adopt Me!, Dress to Impress, SpongeBob Tower Defense, Brookhaven RP, How to Train Your Dragon, and more. WHAT YOU CAN DO ON ROBLOX DISCOVER ENDLESS EXPERIENCES - Dive into adventures, role-playing games, simulators, obstacle courses, and more - Explore trending experiences and fun, new games daily - Compete in multiplayer battles, run your own business, or embark on epic quests CREATE YOUR OWN AVATAR - Customize your avatar with your favorite clothing, accessories, and hairstyles - Discover thousands of user-created avatar items in the Marketplace - Express yourself with unique animations and emotes EXPLORE TOGETHERâANYTIME, ANYWHERE - Play on mobile, tablet, PC, console, and VR headsets - Hang out and play with friends in multiplayer games across any device CHAT AND PLAY WITH PEOPLE YOU KNOW - Join a Party and jump into experiences together - Age verified users can also chat via voice or text CREATE, BUILD, AND SHARE - Design games and virtual spaces using Roblox Studio on Windows or Mac - Publish and share your experiences with millions of players INDUSTRY-LEADING SAFETY AND CIVILITY - Advanced content filtering and moderation - Parental controls and account restrictions for younger players - Clear community guidelines promoting respectful interactions - Dedicated trust & safety teams working around the clock WHY MILLIONS PLAY AND CREATE ON ROBLOX - Immersive 3D multiplayer games and experiences - Safe, inclusive environments for everyone - A platform empowering anyone to become a creator - New content added daily by a global community CREATE YOUR OWN EXPERIENCES: https://www.roblox.com/develop SUPPORT: https://en.help.roblox.com/hc/en-us CONTACT: https://corp.roblox.com/contact/ PRIVACY POLICY: https://www.roblox.com/info/privacy PARENTâS GUIDE: https://corp.roblox.com/parents/ TERMS OF USE: https://en.help.roblox.com/hc/en-us/articles/115004647846 PLEASE NOTE: A network connection is required. Roblox works best over Wi-Fi. Events A Closer Look To make Roblox work better for you, we deliver updates regularly. These updates include bug fixes and improvements for speed and reliability. The developer, Roblox Corporation, indicated that the appâs privacy practices may include handling of data as described below. For more information, see the developerâs privacy policy . Data Linked to You The following data may be collected and linked to your identity: - Purchases - Location - Contact Info - User Content - Search History - Identifiers - Usage Data - Diagnostics Accessibility The developer has not yet indicated which accessibility features this app supports. Learn More Information - Seller - Roblox Corporation - Size - 230.6 MB - Category - Action - Compatibility Requires iOS 13.0 or later. - iPhone Requires iOS 13.0 or later. - iPad Requires iPadOS 13.0 or later. - iPod touch Requires iOS 13.0 or later. - Languages English and 14 more - English, French, German, Indonesian, Italian, Japanese, Korean, Portuguese, Russian, Simplified Chinese, Spanish, Thai, Traditional Chinese, Turkish, Vietnamese - Age Rating 13+ - 13+ - This app has an age rating of 13+ with content restrictions. Some content may be rated higher, but access is managed by the developer through in-app controls. - In-App Controls Age Assurance Parental Controls Frequent Cartoon or Fantasy Violence Guns or Other Weapons Infrequent Realistic Violence Horror/Fear Themes Contains Loot Boxes Advertising Messaging and Chat User-Generated Content - In-App Purchases Yes - Roblox Premium 450 $4.99 - Roblox Premium 450 One Month $4.99 - Roblox Premium 1000 One Month $9.99 - Roblox Premium 2200 One Month $19.99 - Copyright - Â© Roblox Corporation"
}