{
  "url": "https://forums.qrz.com/index.php?threads/callsign-lookups-not-populating-name.910598/",
  "title": "Callsign lookups not populating name | QRZ Forums",
  "text": "I have had an issue for quite a while with HRD leaving the name field blank when looking up the callsign from QRZ. I switched over the Log4OM today and I still have the same issue with not receiving the name field being populated automatically. It makes me wonder if there is a setting or something on QRZ that is preventing that from happening since it has been an issue with both programs. All the settings on both logging software programs were set up properly as far as I could tell. Any suggestions to resolve it are appreciated. Are you logged into QRZ via you logging software? There should be a place for your QRZ log-on credentials in LOG4OM. Otherwise when you're not logged in the name and address fields are blank when doing look ups. This morning my new setup using multicast (was not using it on HRD) with Win4Yaesu, Log4OM, WSJT-X, and Gridtracker is working properly and populating the name field. I love this new setup and love using W4Y and Log4OM - less learning curve and more intuitive imho. Since I would have to reinstall HRD and change the settings in every program back to test it, I am not going through that again. I wanted out of Ham Radio Deluxe and found a solution I like, so I am all good. No idea why HRD was acting that way. Thanks for the willingness to jump in and find out what was going on! 73 Just curious about this. I have used HRD for years and have never had any issue with QRZ. I use the XML lookup feature through QRZ and it works just fine. Did you put in your QRZ credentials into the HRD \"Callsign Lookup\" under the \"more\" tab of the logbook section of HRD? That is all one needs to do to make sure the QRZ lookup feature works. ...............Bob Bob.. following your thread to K4SAX on HRD & QRZ XLM. I've used the XLM subscription in past years with my permanent HRD license and all worked great. Let the subscription laps and decided to subscripe again, but just couldn't get it to work. Tried everything QRZ customer support suggested like API matching on QRZ & HRD, subscription and finally XLM testing on QRZ. On HRD I confirmed enabled logbook QRZ XLM with passw &user was current. Logbook would not populate. On HRD test lookup did not show QRZ as failed, but no data. I finally got my subscription cancellled. Really wanted the service, but seemed like neither QRZ nor HRD could help. Didn't seem there were any other variables. Any thoughts? Mel N6MEL Which subscription lapsed?? HRD or QRZ XML?? Sounds like you may have an old setting in HRD that may be causing a problem. Have you tried a completely new install of HRD?? If you are running Windows, even if you delete HRD via the Windows programs options, it still leaves HRD data on your computer. You have to go and delete ALL the folders containing HRD data. This involves finding all the \"appdata\" folders that HRD populates. Better to find another computer/laptop that has never had HRD installed and start a fresh install. I assume you were able to check the QRZ XML data link to make sure it was working for you. If so, it would suggest the problem is with HRD not populating the data. I would try a fresh install on a separate computer just to test. .............Bob"
}