{
  "url": "https://play.google.com/store/apps/details?id=com.wsandroid.suite&hl=en_US",
  "title": "McAfee Security: Antivirus VPN - Apps on Google Play",
  "text": "In today's digital world, knowing what's real and what's fake is more critical than ever. Introducing McAfee’s Scam Detector™ – your first line of defense against deceptive texts and emails. Protect your new devices. McAfee+ delivers comprehensive, award-winning cybersecurity to shield your data and devices from viruses, malware, spyware and financial fraud. This powerful mobile security app combines advanced Antivirus, a private VPN, robust identity protection, and real-time cybersecurity alerts, all in one place. Email Protection flags risky emails and phishing attempts, and Text Scam Protection catches suspicious text messages before you click. Our automatic VPN ensures secure browsing with IP address encryption, while the network scanner and WiFi security verify connections to maintain your safety on public networks. McAfee+ delivers all-in-one protection to safeguard you from scammers, malware, suspicious activity and online threats. Includes scam detection and virus scanner, personal info removal from risky sites, identity theft monitoring, VPN, and more. FEATURES SCAM DETECTOR ▪ Text scam protection filters risky messages and phishing attempts, and blocks harmful sites ▪ Identify suspicious emails and get scam warnings with email scam protection ANTIVIRUS & VIRUS SCANNER* ▪ Smart AI protection scans and detects threats in real-time ▪ Antimalware & anti spyware with award-winning Antivirus and virus cleaner ▪ Virus and malware protection for personal files, apps and downloads UNLIMITED SECURE VPN** ▪ Private VPN and WiFi analyzer shield your device from unsecured networks to prevent hacking, phishing & fraud ▪ Connect to different countries with a safe VPN that changes your location with IP address encryption for WiFi security and privacy 24/7 IDENTITY MONITORING** ▪ Real-time alerts for security breaches help to safeguard you from identity theft and fraud ▪ Identity protection monitors up to 10 email addresses, ID numbers, passport numbers TRANSACTION & CREDIT MONITORING ▪ Keep a close eye on your financial activity and safeguard your accounts with transaction monitoring ▪ Track changes to your credit score for early detection of potential issues PERSONAL DATA CLEANUP ▪ Discover if your personal information is exposed by data brokers and easily request its removal ONLINE ACCOUNT CLEANUP ▪ Take control of your online footprint ▪ Scan for old and high risk online accounts SAFE BROWSING & WiFi SCAN ▪ Browse safely with ip address encryption, and automatically block malicious websites while online ▪ Scan any Wi-Fi network for safety vulnerabilities before you connect with WiFi analyzer SOCIAL PRIVACY MANAGER ▪ Control who can see your info on social media Download McAfee+ Security today to enhance your online safety with identity theft protection, private VPN and safe browser, and cybersecurity features that shield you from online threats. -- PLANS AND SUBSCRIPTIONS McAfee Security - Free ▪ Single device protection ▪ Antivirus Scan* ▪ Wi-Fi Scan ▪ Identity Scan McAfee Basic Protection: ▪ Single device protection ▪ Antivirus* ▪ Secure VPN** ▪ Basic Identity Monitoring** ▪ WiFi Scan ▪ Safe Browsing ▪ Text Scam Detector McAfee+ Advanced: ▪ Unlimited device protection ▪ Antivirus* ▪ Secure VPN** ▪ Identity Monitoring** ▪ WiFi Scan ▪ Safe Browsing ▪ Personal Data Cleanup ▪ Transaction Monitoring ▪ Credit Monitoring ▪ ID Restoration ▪ Security Freeze ▪ Scam Detector ▪ Online Account Cleanup ▪ 24/7 online security experts ▪ Social Privacy Manager *Our Antivirus and virus cleaner is only available on PCs and Android devices **Not all features are available for all devices, locations or subscriptions not listed in the description. See System Requirements for additional information. McAfee uses the AccessibilityService API to access information about the websites you visit. This allows us to protect you in real-time from harmful sites."
}