{
  "url": "https://forum.wordreference.com/threads/goodwill.33033/",
  "title": "goodwill | WordReference Forums",
  "text": "EVAVIGIL said: Estoy de acuerdo con Fernando; si nos atenemos a la definición que comenzó el hilo, sin duda es fondo de comercio (aquí y en Argentina). No compliquemos más las cosas. Un saludito. EVA. Aquí está justamente el problema. Este hilo lo empezó esta consulta de María Elena: Estoy leyendo unos documentos de contabilidad en inglés y me encontré con la palabra \"goodwill\", he tratado de \"traducir\" pero en los diccionarios me sale solo \"buena voluntad\" y yo sé que no es eso. ¿Alguien me puede ayudar? Yo no veo aquí ninguna definición. Más tarde, alguien dió una definición correspondiente a una de las tantas acepciones de \"goodwill\", como el valor de los activos intangibles de la empresa, la cual efectivamente corresponde a fondo de comercio o derecho de llave. Nadie ha discutido esta traducción, pero este no era el tema en discusión en este hilo. Yo fuí de opinión, y mi experiencia me llevó a reparar en ello, que en la ocurrencia se trataba de otra acepción de goodwill, correspondiente al sobreprecio o sobrevalor pagado en una adquisición. Igual, yo le recomendé a María Elena que no tradujera goodwill ya que el público al que está destinado este tipo de prospectos entiende perfectamente de qué se trata. No entiendo por qué Fernando se enfrascó en una discusión sorda y tautológica, insistiendo majaderamente que como la definición era la supuestamente dada originalmente en este hilo, la traducción era fondo de comercio y punto. Por supuesto, a mí me da lo mismo, pero si estoy seguro de algo no puedo dejar que se induzca a error a una forera que ha consultado gentilmente. Felizmente, la propia María Elena terció en la discusión, agradeciéndole cariñosamente a todos los que habíamos intervenido y señalando que dado el contexto de la operación en cuestión y su país, Guatemala, ella se quedaba con la acepción de \"sobreprecio o sobrevalor de una adquisición\". No creo pues que se me pueda acusar de complicar las cosas, sino todo lo contrario. Saludos."
}