{
  "url": "https://www.weihenstephaner.com/our-brewery",
  "title": "Our Brewery - Weihenstephaner",
  "text": "Bavarian State Brewery Weihenstephan The World’s Oldest Brewery Almost a thousand years ago the Bavarian State Brewery Weihenstephan was the monastery brewery of the Benedictine monks. Then, the Royal Bavarian State Brewery, it is now operating as a state directed enterprise under the control of the Bavarian Government. The Weihenstephan Monastery stands high above the city of Freising on the Weihenstephan hill. From here you have a breathtaking view of the old town of Freising, the Upper Bavarian Plateau and the distant Alps. This is the origin of beer. Tradition and Innovation As the oldest still existing brewery in the world it stands upon the Weihenstephan hill, surrounded by the comparatively very young Weihenstephan science center of the Technical University of Munich. And so, a unique tradition and brewing culture developed over the centuries. Today, Korbinian’s heirs use the most modern technology, but they never forget their own history and their own high standards. This allowes us to brew a variety of beers of the highest possible quality. Enjoy an exciting journey through time to the origin of beer The world has changed through the ages and today is a product of this change. It’s nice to know that in the eventful history of Weihenstephan, with all its developments, achievements and setbacks, one thing has remained constant: our beer. Thus the Weihenstephan Monastery Brewery - after nearly a thousand years - still stands upon the Weihenstephan Hill, proud of its quality and its tradition and conscious of its position as the oldest existing brewery in the world. Brewing Process Brewing is our craft, and has been for nearly 1,000 years. Of course, high-tech has also come into brewing, but the basic brewing process remains unchanged. Freising The Weihenstephan Monastery is high above the city of Freising on the Weihenstephan hill. From here there is a breathtaking view of the old town of Freising, the Upper Bavarian Plateau and the distant Alps. For further information use the official website from Freising."
}