{
  "url": "https://en.wiktionary.org/wiki/maître",
  "title": "maître - Wiktionary, the free dictionary",
  "text": "maître Appearance Dutch [edit]Etymology [edit]From French maître. Doublet of maestro, magister, master, and meester. Pronunciation [edit]Noun [edit]maître m (plural maîtres, diminutive maîtretje n) Derived terms [edit]Related terms [edit]French [edit]Alternative forms [edit]Etymology [edit]Inherited from Middle French maistre, from Old French maistre, from Latin magistrum. Doublet of maestro, borrowed from Italian, magister, borrowed from Latin, and master, borrowed from English. Pronunciation [edit]Noun [edit]maître m (plural maîtres, feminine maîtresse or maître) - master - (military) Military rank in the Navy, usually equivalent to the rank of sergent-chef in the Army, or petty officer first class in the United States Navy - leader - teacher (in a primary school) - (Canada) holder of a master's degree Derived terms [edit]- coup de maître - de main de maître - Lemaître - maison de maître - Maître - maître à penser - maître d'armes - maître de ballet - maître de cérémonie - maître de conférences - maître de maison - maître d'école - maître d'hôtel - maître d'œuvre - maître d'ouvrage - maître principal - maître principal-major - maître-chef - maître-chef principal - passer maître - pièce maîtresse - premier maître - premier maître-chef - second maître - second maître de deuxième classe - second maître de première classe - second maître hors classe - trouver son maître Descendants [edit]Further reading [edit]- “maître”, in Trésor de la langue française informatisé [Digitized Treasury of the French Language], 2012 Anagrams [edit]Norman [edit]Alternative forms [edit]Etymology [edit]From Old French maistre, from Latin magister, magistrum. Pronunciation [edit]Noun [edit]maître m (plural maîtres, feminine maitrêsse) Derived terms [edit]- maît' à pause (“supply teacher”) - maît' d'êcole (“schoolmaster”) - maître dé (“middle finger”) - maître-pêtre (“webmaster”) - quartchi-maître (“quartermaster”) Categories: - Dutch terms borrowed from French - Dutch terms derived from French - Dutch doublets - Dutch terms with audio pronunciation - Dutch lemmas - Dutch nouns - Dutch nouns with plural in -s - Dutch terms spelled with Î - Dutch terms spelled with ◌̂ - Dutch masculine nouns - French terms derived from the Proto-Indo-European root *meh₂- (good) - French terms derived from Old French - French terms derived from Proto-Italic - French terms inherited from Old French - French terms derived from Latin - French terms inherited from Middle French - French terms inherited from Proto-Italic - French terms derived from Proto-Indo-European - French terms derived from Middle French - French terms inherited from Latin - French doublets - French 1-syllable words - French terms with IPA pronunciation - French terms with audio pronunciation - French terms with homophones - French lemmas - French nouns - French countable nouns - French masculine nouns - fr:Military - Canadian French - Norman terms inherited from Old French - Norman terms derived from Old French - Norman terms inherited from Latin - Norman terms derived from Latin - Norman terms with audio pronunciation - Norman lemmas - Norman nouns - Norman masculine nouns - Jersey Norman"
}