{
  "url": "https://www.akc.org/expert-advice/nutrition/fruits-vegetables-dogs-can-and-cant-eat/",
  "title": "Fruits and Vegetables Dogs Can or Can't Eat – American Kennel Club",
  "text": "AKC is a participant in affiliate advertising programs designed to provide a means for sites to earn advertising fees by advertising and linking to akc.org. If you purchase a product through this article, we may receive a portion of the sale. It’s not uncommon to want to spoil your dog by sharing your favorite human snack instead of a dog treat. After all, if it’s safe for you to eat, it must be OK for your dog to eat, right? Not necessarily. In This Article While many people foods are perfectly safe for dogs, some are very unhealthy and downright dangerous, so it’s critical to learn which fruits and vegetables dogs can eat. Dogs digest foods differently than humans do, and eating the wrong foods can lead dogs to long-term health problems and, in extreme cases, even death. As omnivores, dogs have no real need for fruits or vegetables as part of their diet, but giving dog-safe fruit or vegetables to dogs as a treat or snack is OK. Read on to find out which fruits and vegetables are OK for sharing in moderation and which should be avoided. Fruits Dogs Can Eat In moderation, many fruits can be delicious and healthy treats for dogs, providing a source of vitamins, minerals, and antioxidants. Here are some of the dog-friendly fruits you can share as an occasional treat. Apples Apples are an excellent source of vitamins A and C, as well as fiber for your dog. They’re low in protein and fat, making them the perfect snack for senior dogs. Just be sure to remove the seeds and core first. Try them frozen for an icy warm weather snack. You can also find it as an ingredient in apple-flavored dog treats. Bananas In moderation, bananas are a great low-calorie treat for dogs. They’re high in potassium, vitamins, biotin, fiber, and copper. They’re also low in cholesterol and sodium, but because of their high sugar content, bananas should be given as a treat, not part of your dog’s main diet. You can also find banana dog treats that never get overripe! Blueberries Blueberries are a superfood rich in antioxidants, which prevent cell damage in humans and canines alike. They’re packed with fiber and phytochemicals as well. Teaching your dog to catch treats in the air? Try blueberries! The powerhouse fruit is a popular ingredient for blueberry dog treats, sometimes in combination with other superfoods like yogurt. Cantaloupe Cantaloupe is packed with nutrients, low in calories, and a great source of water and fiber. It is, however, high in sugar, so should be shared in moderation, especially for dogs who are overweight or have diabetes. Try freezing balls or cubes of cantaloupe for your dog for a refreshing summertime enrichment snack. Cranberries Both cranberries and dried cranberries are safe to feed to dogs in small quantities. Whether your dog will actually like this tart treat is another question. Either way, moderation is important when feeding cranberries to dogs, as with any treat, as too many cranberries can lead to an upset stomach. It’s also worth noting that many dried cranberries sold for people to eat are sweetened, so giving them to your dog is adding unneeded sugar to their diet. Instead, if your dog craves the tangy taste of cranberries, opt for unsweetened fresh or frozen fruits, or pick up some crunchy cranberry dog treats. Cucumbers Cucumbers are especially good for overweight dogs, as they hold little to no carbohydrates or fat, and they’re full of satiating hydration. They’re loaded with vitamins K, C, and B1, as well as potassium, copper, magnesium, and biotin. Cool cucumbers are an excellent hot weather treat if your dog enjoys them, and you can even freeze slices for a fun enrichment snack. Mango This sweet and juicy tropical treat is packed with four different vitamins: A, B6, C, and E. Mangoes also have potassium and both beta-carotene and alpha-carotene. Just remember, as with most fruits, remove the hard pit first, as it contains small amounts of cyanide and can become a choking hazard. Mango is high in sugar, so use it as an occasional treat, especially for dogs who struggle with weight. A less messy option for getting the benefits of mango’s superfood nutrients is a chewy mango dog treat. Oranges Oranges are fine for dogs to eat, according to veterinarians, but it’s common for dogs to be turned off by any kind of strong citrus smells or tastes. Oranges are an excellent source of vitamin C, potassium, and fiber. In small quantities, the juicy flesh of an orange can be a tasty treat for your dog. Vets do recommend tossing the orange peel and only offering your dog the flesh of the orange, minus any seeds. Orange peel is rough on their digestive systems, and the oils may make your dog literally turn up their sensitive nose. If your dog isn’t a fan of fresh citrus, there are a few dog treats with oranges to choose from. Peaches Small amounts of cut-up fresh or frozen peaches are a great source of fiber and vitamin A, but just like cherries, the pit contains cyanide. As long as you completely cut the flesh away from the peach pit, fresh peach flesh can be a great summer treat. Be sure the pits are safely discarded in dog-safe trash receptacles. Skip canned peaches, as they usually contain high amounts of sugary syrups. Even canned or jarred peaches “in natural juice” have more sugar than any dog needs. Frozen peach slices can be a fun, hot-weather enrichment snack for dogs. Pears Pears are a great snack because they’re high in copper, vitamins C and K, and fiber. If you’re sharing pears with your dog, just be sure to cut the pear flesh into bite-size chunks and remove the pit and seeds first, as the seeds contain traces of cyanide. Skip canned or jarred pears with sugary syrups, even the ones labeled “in their own juice.” You can also find pear dog treats with other functional ingredients like duck or salmon. Pineapple A few chunks of pineapple are a great sweet treat for dogs, as long as the prickly outside peel and crown are removed first. The tropical fruit is full of vitamins, minerals, and fiber. It also contains bromelain, an enzyme that makes it easier for dogs to absorb proteins. As with other fruits, don’t choose canned or packaged pineapple in sweetened syrups, as dogs don’t need added sugars in their diets, especially if they’re prone to obesity. You can also find pineapple dog treats for a taste of the islands on the go. Pumpkin Pure pumpkin is a healthy food for dogs. Pumpkin is full of antioxidants, but its superpower is that it works to relieve both diarrhea and constipation in dogs. If you’re buying canned pumpkin, always choose 100% pumpkin puree, or you can also roast pumpkin in the oven yourself and feed the peeled pumpkin flesh to your dog. There are also many pumpkin supplements and pumpkin dog treats for dogs to enjoy. Raspberries Raspberries are safe for dogs in moderation. They contain antioxidants that are great for dogs. They’re low in sugar and calories, but high in fiber, manganese, and vitamin C. Raspberries are especially good for senior dogs because they have anti-inflammatory properties, which can help aging joints. Raspberries contain small, naturally occurring amounts of xylitol, so limit your dog to no more than 8 ounces of fresh or frozen raspberries. You can also choose a dog treat that includes raspberry as an ingredient. Strawberries Strawberries are full of fiber and vitamin C. Along with that, they also contain an enzyme that can help whiten your dog’s teeth. Like all fruits, strawberries contain natural sugar, so offer them in moderation. Frozen strawberries can be a fun enrichment treat for dogs. You could just eat the strawberries yourself and hide your dog’s favorite strawberry training treat in a cute strawberry-shaped snuffle mat instead! Watermelon Dogs can eat watermelon, but it’s important to remove the rind and seeds first, as they can cause intestinal blockage. Otherwise, watermelon flesh is safe for dogs. It’s full of vitamin A, B-6, and C, as well as potassium. Watermelon is 92% water, so it’s a great way to help keep your dog hydrated on hot summer days. Freeze chunks of seeded watermelon for a fun hot-weather enrichment treat for your dog. You can even find watermelon-flavored dog treats! Fruits Dogs Should Avoid While some fruits are perfectly healthy for humans, they could contain compounds, seeds, or parts that are dangerous, if not toxic, to dogs. It’s best to keep these fruits out of your dog’s reach to ensure their safety. Avocado While avocado may be a healthy snack for dog owners, it shouldn’t be given to dogs. The pit, skin, and leaves of avocados contain persin, a toxin that often causes vomiting and diarrhea in dogs. The fleshy inside of the avocado fruit doesn’t have as much persin as the rest of the plant, but it still can be too much for dogs to handle. Avocado flesh is also high in fat, which can cause gastrointestinal upset for dogs, or contribute to health conditions like pancreatitis if too much is consumed. Your dog can still enjoy the benefits of avocado if you look for dog treats for skin and coat that include avocado in the ingredients. Cherries With the exception of the fleshy fruit around the seed, cherry plants contain cyanide and are toxic to dogs. Cyanide disrupts cellular oxygen transport, which means that your dog’s blood cells can’t get enough oxygen. If you have a cherry tree in your yard, be sure your dog doesn’t have free access to fallen fruit. If your dog eats cherries whole or cherry pits, watch for dilated pupils, difficulty breathing, and red gums, as these may be signs of cyanide poisoning, which is a veterinary emergency. When enjoying cherries yourself, be sure to secure the discarded pits in a dog-proof trash can or trash bin that your dog can’t access, and let kids know not to share their cherries or cherry pits with your dog. To allow your dog to safely experience the antioxidant benefits that cherries have, consider cherry-flavored dog treats. Grapes If you think your dog has eaten grapes, call your veterinarian. Grapes and raisins are highly toxic to dogs, no matter their breed, sex, or age. In fact, grapes are so toxic that they can lead to acute sudden kidney failure. Always be mindful of this dangerous fruit around dogs, especially if you have children who eat grapes or raisins in your home. If you’re throwing away grapes or raisins, don’t put them in a compost heap your dog has access to. Be sure your trash can is designed to be dog-proof or placed where they can’t access it. Tomatoes While the ripened flesh of the tomato fruit is generally safe for dogs, the green parts of the tomato plant contain a toxic substance called solanine. A dog would need to eat a large amount of the tomato plant to make them sick, but it’s better to skip tomatoes all together just to be safe. If your dog likes to explore your vegetable garden, be sure to prevent them from having access to your tomato plants. Vegetables Dogs Can Eat Understanding which vegetables are safe for your dog is crucial. While many vegetables offer nutritional benefits for dogs, some can be toxic. Here are some vegetables that you can confidently chop up and share with your dog. Broccoli Broccoli is safe for dogs to eat in small amounts, and is best served as an occasional treat. It’s high in fiber and vitamin C and low in fat. However, broccoli florets contain isothiocyanates, which can cause mild-to-potentially-severe gastric irritation in some dogs. Tough broccoli stalks have been known to cause obstruction in the esophagus in dogs. If your dog likes broccoli, it’s better to offer them cooked broccoli to help avoid these issues. Or, let them gnaw on a broccoli-shaped dog chew toy while you dig in to your beef and broccoli takeout. Brussels Sprouts Brussels sprouts are loaded with nutrients and antioxidants that are great for humans and dogs, alike. Don’t overfeed them to your dog, however, because they can cause lots and lots of gas. If your dog is a big fan of Brussels sprouts, and you’re cool with the results, you might want to consider some dehydrated dog foods that include these leafy greens as a component. Carrots Carrots are an excellent low-calorie snack that is high in fiber and beta-carotene, which produces vitamin A. Plus, crunching on this orange root vegetable is great for your dog’s teeth. Carrots are included as an ingredient in many dog foods, as well as plenty of carrot dog treats. Celery In addition to vitamins A, B, and C, celery contains the nutrients needed to promote a healthy heart and possibly fight cancer. As if that wasn’t enough, celery is also known to freshen doggy breath. Find celery dog chews for an option many dogs would enjoy. Green Beans Chopped, steamed, raw, or canned – all types of green beans are safe for dogs to eat, as long as they’re plain. Green beans are full of important vitamins and minerals and they’re also full of fiber and low in calories. Opt for no-salt canned green beans for dogs for adding to food. Frozen green beans can also be fun enrichment snacks. Peas Green peas, snow peas, sugar snap peas, and garden or English peas are all OK for dogs to find in their bowl on occasion. Peas have several vitamins, minerals, and are rich in protein and high in fiber. You can feed your dog fresh or frozen peas, but avoid canned peas with added sodium. Spinach Dogs can eat spinach, but it’s not one of the top vegetables you’ll want to be sharing with them. Spinach is high in oxalic acid, which blocks the body’s ability to absorb calcium and can lead to kidney damage. While your dog would probably have to eat a very large amount of spinach to have this problem, it might be best to go with another vegetable. If you want to give your dog the benefits of the leafy green, you can find spinach dog treats for an occasional snack. Vegetables Dogs Should Avoid While many vegetables can be a healthy addition to a dog’s diet, others can be toxic or harmful for them to consume. Here are some veggies that shouldn’t make their way into your dog’s bowl. Asparagus While asparagus isn’t necessarily unsafe for dogs, there’s really no benefit to feeding it to them. It’s too tough to be eaten raw, and by the time you cook it down so it’s soft enough for dogs to eat, asparagus loses much of its nutritional value. If you really want to share a veggie with your dog, there are plenty of other options that would be a better choice. Mushrooms Wild mushrooms can be toxic for dogs. While only 50 – 100 of the 50,000 mushroom species worldwide are known to be toxic, the ones that are poisonous can really hurt your dog or even lead to death. While wild mushrooms are always a solid no, washed mushrooms purchased from the supermarket for human consumption are generally fine for dogs. Onions Dogs should never eat onions. If you think your dog has eaten onions, call your veterinarian. Onions, leeks, and chives are part of a family of plants called Allium that’s poisonous to most pets, especially cats. Eating onions can cause your dog’s red blood cells to rupture, and can also cause vomiting, diarrhea, stomach pain, and nausea. Poisoning from onions is more serious in Japanese breeds of dogs like Akitas and Shiba Inus, but all dogs are very susceptible to it. If you have children in your household, be sure they aren’t sharing foods with onions with your dog, and secure your leftovers where your dog cannot access them."
}