{
  "url": "https://www.allthingsmamma.com/simple-breakfast-casserole/",
  "title": "Cheesy Egg and Potato Breakfast Casserole | All Things Mamma",
  "text": "This post may contain affiliate links. Please read our disclosure policy. This simple cheesy egg and potato casserole is a delicious breakfast dish that is super quick and easy to make any day of the week! Pin this recipe now to save it for later Pin RecipeOne of my favorite things about having brunch at someone’s house is trying out a new breakfast casserole recipe. I just love all the different variations you can make with a simple base recipe of milk and eggs. Add in meat, cheeses and potatoes—and you can create a variety of dishes all unique! One of my favorite recipes is my Christmas Breakfast Casserole; I make often and it sits overnight before baking in the morning. But, recently I tried a new recipe that I made with fresh potatoes that have never been frozen! Easy Cheesy Egg and Potato Breakfast Casserole Recipe While you can buy potatoes and shred them yourself—skin on or skin off, whichever you prefer—I usually buy the refrigerated kind at the grocery store. That way, we get all that fresh potato goodness, but I don’t have to spend 20 minutes grating them by hand! They come in several varieties, so you can switch up the flavors of this recipe based on the kind you choose. I love that I can use my bag of refrigerated potatoes with whatever I have on hand and have a fresh breakfast casserole in the morning instead of being prepared the night before! I just pull out my potatoes, check the fridge to see what veggies I have, add eggs, and cheese, and done! 45 minutes later I have a hot, fresh, family-friendly breakfast that my entire family (including the kids!) will eat. (If you love breakfast casseroles, be sure to try my Sausage Croissant Breakfast Casserole and Green Chile Egg Casserole too!) Grab my Favorite Tools Click on the products below to see my favorite tools for making this recipe! Ingredients For Simple Breakfast Casserole - Fresh shredded potatoes – I like the original Simply Potatoes but the Southwestern potatoes also are delicious. They have peppers added into the bag, which will give the casserole a lot of extra flavor. - Eggs - Milk – Whole milk is perfect for creating a creamy, rich breakfast casserole but any kind of milk will work! - Shredded cheese – I like to use shredded cheddar cheese or Mexican blend shredded cheese. - Salt - Pepper Variations - Add some cooked bacon pieces to the casserole before it bakes. Some sliced breakfast sausage stirred into the potatoes will also help make this meal even more hearty and filling. - Use your own grated potatoes rather than frozen shredded potatoes. If you choose to make your own shredded hash browns, you should first grate a few large, Yukon gold potatoes and then rinse the shredded potatoes with water. This will help remove some of the starch. You will need about 4 cups of shredded potatoes to make this breakfast casserole. - Make a veggie breakfast casserole by stirring in 1 diced red bell pepper, 1 cup of sliced mushrooms, or 1 cup of diced tomatoes. This can all be added to the potato mix before it is baked! How to Make a Simple Breakfast Casserole - Prep your equipment: Start by preheating the oven to 350ºF and lightly greasing a 9×13 casserole dish. - Mix the ingredients: In a large mixing bowl, combine the shredded potatoes, eggs, milk, salt, and pepper. Stir until well-combined. Then, pour the mixture into the casserole dish. - Add cheese: Sprinkle the shredded cheese over the casserole, making the cheese as even as possible. - Bake the casserole: Bake the breakfast casserole for about 45 minutes. The cheese will be melted over the top of the casserole and the edges will be bubbling. How to Store Breakfast Casserole If you have leftover breakfast casserole, you can wrap it in an airtight container and store it in the fridge for 2-3 days. To reheat the casserole, pop it in the microwave and reheat it in 30-second increments until it is hot again. You can also reheat it in the oven until the edges of the casserole are bubbling once again. Then, it is ready to eat! Serving Suggestions Pair this egg casserole with oven-baked bacon or your favorite breakfast sausage. It’s great with fresh fruit or a fruit salad too! FAQs My easy breakfast casserole is made with milk, eggs, salt, pepper, and shredded potatoes. You can add some sliced veggies to the dish and bacon or breakfast sausage are also good add-ins. However, it is nice and simple with just 5 ingredients. Serve this breakfast casserole with a side of breakfast sausage, some crispy bacon, or even with a few mimosas. A nice fruit salad would also be a good side dish for the casserole and bring some color to the table. Too much moisture can cause your casserole to be soggy. Make sure you are precise when measuring the milk, and if you shred your own potatoes for the recipe, set them in a colander to let the liquid strain off. More Easy Breakfast Recipes Breakfast Casseroles Bacon, Egg and Cheese Biscuit Casserole All Recipes Kid-Approved Chocolate Chip Waffles Need help with this recipe? Click the buttons below to summarize it, adjust for diets, swap ingredients, or ask your own questions! Cheesy Egg and Potato Breakfast Casserole Ingredients - 4 eggs - 1 cup milk - 1/4 teaspoon salt - 1/4 teaspoon pepper - 1 bag Simply Potatoes any variety - 1 cup shredded cheese any kind Instructions - Preheat oven to 350 degrees F. - Lightly grease a casserole dish. - Mix eggs, milk, salt and pepper into a large bowl.4 eggs, 1 cup milk, 1/4 teaspoon salt, 1/4 teaspoon pepper - Add potatoes – fold together with egg mixture.1 bag Simply Potatoes - Add to casserole dish.1 cup shredded cheese - Top with cheese. - Bake for 45 minutes or until cheese is melted and bubbly."
}