{
  "url": "https://www.dictionary.com/browse/national",
  "title": "NATIONAL Definition & Meaning | Dictionary.com",
  "text": "national Americanadjective - of, relating to, or maintained by a nation as an organized whole or independent political unit. national affairs. - owned, preserved, or maintained by the federal government. a national wildlife refuge. - peculiar or common to the whole people of a country. national customs. - devoted to one's own nation, its interests, etc.; patriotic. to stir up national pride. - concerning or encompassing an entire nation. a national radio network. - limited to one nation. noun - a citizen or subject of a particular nation who is entitled to its protection. U.S. nationals living abroad. - Often nationals. a national competition, tournament, or the like. We're invited to Minneapolis for the nationals. - a national company or organization. adjective - of, involving, or relating to a nation as a whole - of, relating to, or characteristic of a particular nation the national dress of Poland - rare nationalistic or patriotic noun - a citizen or subject - a national newspaper noun Other Word Forms - antinational adjective - antinationally adverb - nationally adverb - nonnational adjective - nonnationally adverb - prenational adjective - pronational adjective - pseudonational adjective - pseudonationally adverb - quasi-national adjective - quasi-nationally adverb - subnational adjective - unnational adjective - unnationally adverb Etymology Origin of national Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. Miroslav Lajčák resigned from his role on Saturday after messages between the Slovakian national security adviser and Epstein were made public. From Salon The nonprofit wants to buy land in Brazil connecting a pair of national parks there so that big cats can roam there without being hunted down. Police said they were still searching for 13 other suspects, including three Turkish nationals and one German. From Barron's Richardson noted that ADP companies tend to grow faster than the national average. From Barron's Congress created the tax credit in last year’s major fiscal law, starting a national version of programs that have proliferated in states. Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}