{
  "url": "https://www.xatakandroid.com/tutoriales/whatsapp-web-guia-a-fondo-trucos-para-sacarle-maximo-partido",
  "title": "WhatsApp Web: qué es, cómo usarlo y trucos para sacarle el máximo partido en Android",
  "text": "Desde hace unos cuantos años WhatsApp, además de con su aplicación para móvil (iOS y Android), nos permite comunicarnos a través del PC, independientemente del sistema operativo que usemos en el mismo. WhatsApp Web es el cliente de escritorio del servicio de mensajería, herramienta que posibilita el estar pendientes a la aplicación de mensajería sin necesidad de estar mirando el móvil. En esta guía a fondo vamos a cubrir desde lo más básico a lo mas avanzado de WhatsApp Web, para que tanto si has usado este servicio como si es tu primera vez con él puedas acabar dominándolo por completo en cuestión de minutos. Repasaremos desde cómo usar WhatsApp Web en un PC hasta leer mensajes sin que lo sepan, entre otros consejos y trucos. Qué es WhatsApp Web Como su propio nombre indica, WhatsApp Web es una aplicación web que podemos ejecutar desde el propio navegador de nuestros dispositivos, ya sean móviles u ordenadores. En un inicio, WhatsApp sólo era usable desde la app para móviles, donde nació, pero con el paso del tiempo y las peticiones de los usuarios, habilitó un sitio web donde chatear con normalidad sin necesidad de instalar la aplicación oficial. La URL es sencilla a más no poder: web.whatsapp.com. Nada más acceder, nos pedirá escanear el código QR para habilitar nuestra cuenta, algo que te contamos paso a paso en la siguiente sección. Cómo usar WhatsApp Web en el ordenador Uno de los principales usos de WhatsApp Web es configurarlo en nuestro ordenador, para que no tengamos que andar pendientes del móvil mientras estamos en el escritorio. Aquí tenemos dos principales formas para trabajar con él. La primera es hacerlo a través de la versión web de WhatsApp, la página. Si quieres acceder a WhatsApp web desde el PC, estos son los pasos a seguir: - Abre WhatsApp Web en tu ordenador - Abre WhatsApp en tu teléfono - Pulsa sobre menú y ve a Dispositivos vinculados - Pulsa Vincular un dispositivo - Escanea el código QR que ves en la pantalla de tu ordenador Listo. Tras escanear el código quedará iniciada una sesión de WhatsApp Web que te permitirá utilizar el servicio. Hasta hace poco la conexión a WhatsApp Web dependía del móvil, pero desde la llegada del modo multidispositivo, se puede usar aunque el teléfono esté apagado o sin conexión. La otra forma de utilizar WhatsApp en el ordenador es a través de la aplicación oficial para tu correspondiente plataforma. En el caso de macOS y Windows encontramos clientes de WhatsApp, por lo que basta con descargarlos. Respecto a WhatsApp para PC encontramos casi las mismas funciones que en WhatsApp Web. Su principal ventaja es que no requiere de un navegador al ejecutarse como cualquier otra aplicación y que podemos configurarla para que se inicie al encender el ordenador, por lo que nos ahorramos el abrir navegador y acceder a WhatsApp Web. Una vez hayamos configurado estos programas, cuando los abramos la sesión estará iniciada, al igual que en WhatsApp Web. Tan solo tendremos que iniciar de nuevo sesión mediante código QR si cambiamos de dispositivo o si cerramos la sesión de forma manual. Ahora bien, hay una diferencia crucial entre WhatsApp Web en el navegador y en la aplicación de escritorio. Y es que, en la versión de escritorio podemos llamar y hacer videollamadas, algo imposible por el momento en la versión de navegador. Y, además, dependiendo del usuario, puede ser un elemento que ayude a decidirse por una versión u otra. Cómo usar WhatsApp Web en una tablet Tras muchos años de espera, la aplicación de WhatsApp ya se puede instalar en tablets, por lo que puedes usar la misma aplicación que usas en el móvil en tu tablet. Tu móvil seguirá siendo el dispositivo principal, pero conectarás la aplicación de WhatsApp a tu cuenta como un dispositivo vinculado. Para ello básicamente debes instalar WhatsApp en tu tablet, abrir la aplicación y seguir las instrucciones que aparecen en pantalla. WhatsApp te mostrará un código QR en la tablet que debes escanear con tu móvil, desde los ajustes de Dispositivos vinculados. Claro, que si lo prefieres por cualquier motivo, también puedes usar WhatsApp Web en tu tablet. Esta puede ser una buena opción para un uso puntual para el cual no quieres instalar nada adicional. Para usar WhatsApp Web en tu tablet debes seguir estos pasos: - Accede a tu navegador habitual - Activa el modo escritorio - Realiza el mismo proceso anterior, escaneando el código QR que arroja WhatsApp Web en tu tablet desde el móvil Con este pequeño cambio hacemos entender al navegador que estamos usando un ordenador, por lo que podremos usar WhatsApp Web en la tablet, como si de un PC se tratase. Ten en cuenta que esta versión está pensada para PC y no para tablet, por lo que puede no ser todo lo perfecta a nivel de interfaz respecto al ordenador. Cómo usar WhatsApp Web en el móvil Usar WhatsApp Web en el móvil también es posible, aunque será necesario un terminal secundario para poder realizar el proceso, ya que no es posible utilizar la aplicación de WhatsApp y WhatsApp Web de forma simultánea. Si intentamos escanear el código QR de WhatsApp Web desde nuestro propio teléfono, se nos devolverá a la aplicación para Android. Así, el proceso para usar WhatsApp Web desde un móvil es similar a los anteriores, aunque con el añadido del segundo teléfono. - Abre WhatsApp Web en tu móvil secundario - Activa el modo escritorio del navegador - Escanea el código desde tu teléfono principal (en el que tienes instalada la aplicación de WhatsApp) - Ahora tendrás WhatsApp Web totalmente funcional en el segundo móvil y funcionando vía app en el principal Eso sí, a no ser que tengas un dispositivo iOS y otro Android, hacer esto no tiene demasiado sentido. Hace un tiempo sí, ya que era la forma de tener WhatsApp en dos dispositivos a la vez, pero desde que se puede tener WhatsApp en dos móviles a la vez sin trucos ni nada especial, no tiene tanto sentido abrir WhatsApp Web en el teléfono. Si quieres hacerlo, ahí te hemos dejado el modo, pero es mejor descargar la app nativa. Qué puedes hacer y qué no en WhatsApp Web WhatsApp Web es bastante completo a nivel de funcionalidades y podemos realizar las funciones principales de WhatsApp como enviar y recibir mensajes, notas de voz, consultar los archivos multimedia y demás. No obstante, hay una lista a tener en cuenta con ciertas funciones que no podemos realizar, aunque poco a poco va ganando estas funciones para equipararse a la versión para móviles: - Añadir filtros a las fotos (sólo puedes desenfocar) - Compartir ubicación - Configurar opciones de la cuenta como cambiar el número de teléfono - Consultar el uso de datos y otras estadísticas - Añadir contactos (aunque puedes escribir a números sin guardar) - Crear difusiones Poco a poco se ha ido haciendo más y más completo y podemos hacer encuestas, mandar contactos e incluso hacer stickers con nuestras fotos, por lo que la lista anterior disminuye con frecuencia cada vez que se añaden nuevas funciones de WhatsApp en el móvil a WhatsApp en la web. En el caso de que utilices WhatsApp Web en un móvil las funciones son las mismas, aunque has de tener en cuenta que el servicio no está optimizado para este formato, por lo que puede funcionar algo lento y es algo incómodo. No obstante, mediante los permisos de Android podemos enviar archivos, mensajes, notas de voz y demás, al igual que si lo hiciéramos desde la web en PC o desde la propia aplicación de WhatsApp para PC. Qué hacer si no te funciona WhatsApp Web WhatsApp Web no es perfecto, por lo que puede sufrir problemas de conexión o caídas, al igual que la propia app para móvil. Si tu móvil tiene algún tipo de problema de conexión, WhatsApp Web fallará, así que comprueba siempre tu teléfono por si es el principal responsable. WhatsApp Web ya no necesita que mantengas tu móvil encendido y conectado a Internet, aunque sí necesita que se conecte a la red de vez en cuando. Si no, la sesión caducará y deberás volver a registrarlo. Trucos para WhatsApp Web Visto cómo usar WhatsApp Web, y tras dar un repaso por sus principales funciones, vamos a dar un repaso a algunos trucos para que puedas empezar a exprimirlo al máximo, ya que hay varios atajos y secretos que no viene mal conocer. Comprueba las sesiones que hay iniciadas Uno de los primeros pasos a dar cuando empezamos a utilizar WhatsApp Web es controlar el número de sesiones que hay activas. Podemos consultar esto desde 'WhatsApp Web' en los ajustes de WhatsApp para Android. De este modo, podemos echar un vistazo a todas las sesiones que tenemos abiertas para ver si nos lo hemos dejado, por ejemplo, en el ordenador del trabajo. Para acceder al apartado, en la página principal de WhatsApp debemos ir a los tres puntos verticales de la zona superior derecha y pulsar en 'Dispositivos vinculados'. Hecho esto, veremos las sesiones y podemos vincular un nuevo dispositivo o cerrar alguna sesión abierta. Atajos de teclado WhatsApp Web tiene varios atajos de teclado para que puedas manejarte por la aplicación de forma más rápida. En concreto, este es el listado de los atajos disponibles que más se utilizan. - Ctrl + N: Nuevo chat. - Ctrl + E: Archivar la conversación - Ctrl + Shift + M: Silenciar la conversación - Ctrl + Backspace: Borrar la conversación - Ctrl + Shift + U: Marcar como no leído - Ctrl + Shift + N: Crear un nuevo grupo - Ctrl + P: Abrir el perfil - Alt + F4: Cerrar la ventana del chat - Ctrl + Alt + /: Buscar - Ctrl + Alt + Shift + F: Buscar en el chat - Crtl + Alt + Shift + Tab: Chat anterior - Ctrl + Alt + Tab: Siguiente chat - Ctrl + Alt + Shift + P: Fijar chat - Ctrl + Alt + N: Nuevo chat - Alt + K: Ampliar búsqueda - Crtl + Alt + S: Panel de stickers - Ctrl + Alt + E: Panel de Emojis - Shift + ,: Reducir la velocidad del mensaje de voz seleccionado Adjuntar archivos Adjuntar archivos en WhatsApp Web es bastante parecido al mismo sistema que encontramos en Android, salvando que no podemos compartir nuestra ubicación ni archivos de audio. Esto se traduce en que tenemos siete posibilidades en el apartado de adjuntos. - Adjuntar fotografías y vídeos desde el explorador de archivos de tu PC - Abrir la cámara de tu PC para hacer y enviar una foto - Enviar documentos desde el explorador de archivos - Enviar contactos - Enviar documento - Hacer encuesta - Nuevo sticker Leer mensajes sin que lo sepan Un truco \"ninja\" para leer mensajes en WhatsApp Web sin dejar rastro es dejar el ratón justo encima del mensaje que nos acaban de enviar. Así, se generará una pequeña vista previa del mismo y, en caso de que tengas activo el doble check azul, a la otra persona no le aparecerá que has visto dicho mensaje, ya que no has entrado en la conversación. Usar varias cuentas En el caso de que tengas más de un número de teléfono, te podrás preguntar cómo iniciar dos sesiones distintas en WhatsApp Web teniendo en cuenta que la aplicación no es multicuenta. La solución más sencilla aquí es abrir una ventana de incógnito en tu navegador para poder realizar de nuevo el proceso de inicio de sesión. Enviar emojis de forma rápida Uno de los trucos más útiles para WhatsApp Web es controlar la búsqueda rápida de emojis. El servicio web ofrece distintas sugerencias de emojis cuando escribimos una palabra a la que le anteceden dos puntos. Pasar archivos del móvil al PC WhatsApp está lejos de Telegram en cuanto al uso como nube propia pero también lo puedes usar para mandarte cosas del móvil a tu PC y al revés. Para ello puedes usar los trucos de siempre para tener un chat contigo mismo, aunque la aplicación te facilita hacerlo desde el menú de nuevo mensaje. Allí apareces tú como contacto arriba del todo. Los archivos que envíes a WhatsApp Web los podrás ver y guardar en tu móvil y viceversa, por lo que se trata de un buen método para pasar archivos entre móvil y PC de forma rápida y sencilla, además de poder enviar notas, direcciones o cualquier otra cosa. Crea un acceso directo Si usas WhatsApp Web en el móvil o tablet de forma habitual, puede ser un engorro estar constantemente accediendo a la web, por lo que crear un acceso directo para tener WhatsApp Web en el launcher puede ser una buena idea. No tienes más que abrir el navegador, ir a la dirección y añadir a pantalla de inicio. Al no ser una aplicación web progresiva no confundirás el icono con el de la aplicación de WhatsApp, ya que el icono que te aparezca estará basado en tu navegador. Activa el modo oscuro WhatsApp Web te permite activar el modo oscuro, tanto manualmente como funcionando en consonancia con el propio tema de tu sistema operativo, Windows o macOS. Para ello, solo tienes que ir al menú de ajustes, darle a 'Tema' y seleccionar el que quieras. También puede ser el predeterminado por el sistema. Usa WhatsApp Web con el móvil apagado Como decíamos al principio, hace poco WhatsApp estrenó el modo multidispositivo que nos permite usar WhatsApp desde otros dispositivos sin depender del móvil. Esto hace que WhatsApp Web funcione sin necesidad de que el móvil esté encendido o tenga conexión de red todo el tiempo. Para poder usarlo sólo tienes que actualizar WhatsApp a la última versión (si no lo has hecho ya) e iniciar sesión en la versión web como de costumbre. Verás que ahora ya no aparece el molesto mensaje de 'teléfono sin conexión'. Configura la descarga automática Hace unos años no se podía, pero ahora es posible configurar la descarga de archivos automáticos. O no. Yendo a los tres puntos verticales arriba a la derecha, pulsamos en 'Configuración' y nos vamos a 'Descarga de archivos multimedia'. Ahí, seleccionamos lo que queremos que se descargue de manera automática. Chat con mensajes que se borran solos Algo que podemos hacer desde hace unas semanas es configurar un chat con mensajes que se autodestruyen. Para ello, lo único que hay que hacer es ir a 'Configuración' y abrir la pestaña de 'Privacidad'. Hecho esto, seleccionamos el apartado de 'Mensajes temporales' y configuramos que se borren tras veinticuatro horas, siete o noventa días. Así, los nuevos chats empezarán automáticamente con ese límite de tiempo para la lectura, pero es algo que no afectará a los chats y mensajes existentes. Si quieres hacer que chats existentes también caduquen, deberás abrirlos y configurarlos uno a uno. Reacciones rápidas a los mensajes Una función genial para no tener que hablar es la de reaccionar a los mensajes. En lugar de decir sólo un \"ok\", es mejor mandar un miniemoji al mensaje que queramos responder. Al pasar el ratón por un mensaje, aparecerá a la derecha del mismo el icono de una cara sonriente. Si pulsa encima, se despliega una barra con emojis de reacción rápida y un símbolo '+' si queremos más reacciones. Crea stickers a partir de tus fotos Y algo genial es que podemos crear stickers en WhatsApp Web. En un chat, lo único que debemos hacer es seleccionar el icono '+' de la parte inferior y pulsar sobre 'Nuevo sticker'. Nos pedirá que subamos un archivo y podremos recortar de forma bastante precisa el contorno para guardarlo en nuestra cuenta. Si luego quieres reutilizar ese sticker, podrás hacerlo sin problema pulsando en el icono de la carita sonriente de la barra de escritura. Estos stickers personalizados también los puedes usar más tarde desde WhatsApp en tu móvil o tablet. En Xataka Android | Hackear WhatsApp: los peligros de las aplicaciones que prometen espiar conversaciones En Xataka Android | Los 98 mejores packs de stickers para WhatsApp de 2023, cómo descargarlos y de qué manera puedes hacer los tuyos"
}