{
  "url": "https://www.60millions-mag.com/forum/amazon-f143/debit-injustifie-d-amazon-t202997.html",
  "title": "Forum 60 millions de consommateurs • Consulter le sujet - Débit injustifié d'Amazon",
  "text": "Bonjour à tous, Je tente de l'aide, des info sur ce forum, mais aussi apporter ma contribution face à ma mésaventure. Je suis en débit différé sur mon compte bancaire, courant juin je découvre une débit provenant d'Amazon vu le libellé: \" AMZN MKTP FR********* \" montant de 135,99€. Seulement, je n'ai rien commandé depuis plus de 3 mois sur ce site. Je vérifie mon compte Amazon, l'historique confirme l'absence de Cde . J'alerte Amazon par téléphone à plusieurs reprises en expliquant qu'il y a un débit sur mon compte bancaire qui ne m'est pas imputable. Mon interlocutrice me confirme que en effet pas d'achat sur mon compte Amazon depuis plus de trois mois. Mon ticket d'appel est transféré au service en charge de ce débit particulièrement louche ! A force d'insister auprès d'un des opérateur téléphonique, ceci afin de comprendre ce qui a bien pu se passer, j' apprend qu'un compte a été créé en utilisant les informations de ma carte bancaire, mais que le n° de téléphone est différend...? Que mon compte Amazon n'a pas été piraté, là ça me rassure car utilisant un mots de passe impossible à se rappeler ou à cracker, car créé par un générateur de mots de passe aléatoire en 279 bits, 32 caractères. Ayant un antivirus robuste sur mon PC etc... etc.. Pour finir, la réponse par mail d'Amazon est de \"botter\" vers ma banque en m'invitant à demander le remboursement de cette transaction. Mais pourtant Amazon à bien identifier qu'il y a eu quelque chose d'anormal...? Bref, la seule erreur que j'ai pu commettre serait d'avoir enregistrer pour plus de facilité le moyen de paiement sur mon compte Amazon. - Actuellement j'ai révoqué ma carte bancaire, j'aurais certainement les frais liés. - J'ai fait une demande auprès de ma banque, mais j'ai des doutes sur la suite. - Comment les informations de ma carte bancaire ont ils pu être utilisées, sur Amazon alors que mon compte n'a pas été piraté...? - Comment Amazon peut il se défausser sur ce type de situation..? Si vous avez une aide à me proposer, été dans la même situation, ça m’intéresse fortement ! :)"
}