{
  "url": "https://www.giustonewport.com/",
  "title": "Giusto Newport | Italian Restaurant in Newport, RI",
  "text": "Home Main content starts here, tab to start navigatingWelcome to ABOUT US Giusto, Italian for “just, fair and right,” is the first independent restaurant from Rhode Island native Chef Kevin O’Donnell. At its heart, Giusto is built on one guiding belief: do the right thing. That means taking care of our team first, because genuine hospitality begins with how we treat each other. When we create a culture where everyone feels safe, respected and supported, we believe those feelings will reach every guest who walks through our doors. Our cooking is inspired by the simplicity of traditional Italian cuisine and its devotion to quality ingredients. We are lucky to call Rhode Island home, with a collection of passionate farmers and fishermen to supply us with incredible products to cook with. The result is a new type of Italian-American cuisine that honors tradition while drawing outside the lines, a balance between tradition and freedom we call Freestyle Italian. Our wine list is 100% Italian (with the exception of Champagne) and showcases small, natural, and biodynamic producers, many making their Rhode Island debut at Giusto. Each bottle tells a story of craftsmanship and integrity that mirrors our own values in the kitchen. Giusto is built on care, connection, and community. We believe a restaurant should bring people together, not just around a table, but around shared purpose. Our team is proud to partner with local organizations, including Plates with Purpose, the Women's Resource Center, Newport Pride, the MLK Center and FeedRI. Through these partnerships, we aim to give back to the community that supports us and make a positive impact beyond our walls. Dining at Giusto is about more than just a meal. It’s about connection; to people, to place and to purpose. When you choose Giusto, you are choosing to support a small business run by a local family who believes in their community and doing the right thing."
}