{
  "url": "https://www.bankmillennium.pl/en/electronic-banking/millenet-for-individuals-business",
  "title": "Internet banking - Electronic banking - Bank Millennium",
  "text": "Since 25.08 It will not be possible to log in to Millenet from the version of the browser you are now using. Update the browser on your device and use online banking in a comfortable and secure way. Update the browserYou can add the browser from which you often log in to Millenet to your trusted list. Then you will not be asked for additional authorisation when logging in for 90 days. You will log in quickly and securely. Example: When you log in from home, you can add the browser on your home device to the trusted browsers. Once you have saved your browser, the next time you log in, you no longer need to additionally authorise the login with an SMS code or in the app. However, if you log in from another browser, e.g. at work, you will be asked for additional authorisation. Your security is of paramount importance to us! That's why, in exceptional cases, you may need additional confirmation even if you add a browser to the trusted list. Worth to know: You will use trusted browsers when logging in to online banking both on your computer and on your phone. If you have any questions, please check the questions and answers section - Help with logging in. Millenet gives you: You can apply for a benefit in the ‘Family 800+’ Programme. By applying now, you will ensure payment of the benefit for the new period: from 1 June 2025 to 31 May 2026). Please visit the application or Millenet. Create a free Trusted Profile and gain access to numerous public administration websites Apply to ZUS via Millenet or our mobile app You can update your mailing address and ID card details conveniently in mobile app or Millenet. It's a free service which enables household finance managing. Thanks to the Finance Manager you can easily control your expenses and manage savings. You make a number of transactions every day. In Millenet, you can add attachments to the transaction (e.g. receipt or invoice) or tag it (e.g. #holiday) in order to find everything easier. Top up a phone and profit from numerous promotions! Want to have financial information at your fingertips? Choose monthly online statements and view them whenever you want on your phone or computer. Get direct support for registered users in Millenet by screen sharing service. Get immediate help of our consultant 24 hours, 7 days a week For security reasons, use recommended browsers to log in to Millenet system - Chrome, Safari, Firefox, Internet Explorer, Opera. You can download them for free from the Internet. Logging in to Millenet is possible using older software, however some of the functions may not be available or part of the content may be displayed incorrectly. Remember to keep your browser up to date and use the latest available version. Account rights for the proxy Below you will find a list of operations that can be performed by the proxy to the account in Millenet and mobile app:"
}