{
  "url": "https://my.clevelandclinic.org/health/diseases/15252-delirium",
  "title": "Delirium: What It Is, Causes, Symptoms & Treatment",
  "text": "Delirium is a type of confusion that happens when illness, changes in your environment or other factors put too much stress on your brain. It’s more common in adults over 65. Delirium is a serious condition that can lead to long-term or even lasting problems, especially if not treated quickly. That’s why prevention is so important. Advertisement Cleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy Delirium is new or worsened confusion and changes to your mental abilities. It affects your thinking, memory, awareness and focus. It may cause you to act very differently than you typically would. It develops over hours to days. Advertisement Cleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy It could go away if your doctor finds and treats the cause. But it may lead to ongoing issues with your thinking or memory. Delirium can be serious and lead to life-threatening complications in certain cases. There are three types: Symptoms of delirium include: Symptoms can vary from person to person. They usually come and go, and they often feel worse at night than during the day. Advertisement Delirium happens when your body or brain is under too much stress. They have a hard time coping, which causes symptoms. This isn’t the same as everyday stress, like relationships, financial or work-related stress. Here are some examples of stressful triggers: Delirium is possible during the end stages of life, especially for people receiving palliative care or hospice care. You may be more at risk for delirium if you: Complications may include: These may be short-term with treatment. Or they can be serious and even life-threatening, especially for people who are already sick. Each case is different. Your provider will make a diagnosis after: There’s no test that shows if you have delirium. But tests play an important role in determining the cause of your delirium symptoms. Your provider might recommend the following tests: These tests may also help your provider determine the best treatment for you. Treatment focuses on finding and managing the cause of your symptoms. Recovery takes time, but your provider may suggest ways to help you feel more comfortable (supportive therapy), like: Advertisement There aren’t any FDA-approved medications available to treat delirium. But providers use medications to manage certain causes, like: Your provider will review how well you respond to these medications, usually on a daily basis. If there are side effects or you don’t need the medication anymore, your provider will stop it. Don’t make changes to your dose unless your provider tells you. If you have delirium, changes in brain function can make it hard to understand what’s happening around you. It can also affect your memory, judgment and how you speak or act. This condition is usually temporary, but symptoms can linger. This is more likely if you have a severe case. But even with quick treatment, some effects may last. Your provider can tell you more about what your situation looks like since it can vary from person to person. Delirium doesn’t come with a set life expectancy like some other conditions do. But it’s a serious condition that can raise your risk of death, depending on factors like: Advertisement The outlook can vary widely, especially if delirium is severe or goes untreated. Your healthcare provider can give you the clearest picture based on your specific situation. Prevention for delirium may include: Delirium can be frightening, both for you and for those by your side. Your loved one may say you seem like a completely different person. In some cases, especially near the end of life, it can be even more heartbreaking. But some cases of delirium aren’t permanent. If you get help quickly, your symptoms may get better. That’s why it’s so important to understand the signs, know the risk factors and take steps to prevent it whenever possible. Advertisement Learn more about the Health Library and our editorial process. Cleveland Clinic's health articles are based on evidence-backed information and review by medical professionals to ensure accuracy, reliability, and up-to-date clinical standards. Cleveland Clinic's health articles are based on evidence-backed information and review by medical professionals to ensure accuracy, reliability, and up-to-date clinical standards. Whether you need stitches, a broken bone set or think your appendix might be causing your abdominal pain, Cleveland Clinic’s emergency medicine team is here to help."
}