{
  "url": "https://mb.srb2.org/addons/x-sonic.7372/updates",
  "title": "X Sonic - Updates | SRB2 Message Board",
  "text": "Golden Shine posting! I got reports v1.1b caused more memoryleaks in SST than previous versions, even with the stupid memory leak fix enabled. Since nothing big was added GFX-wise, but charging was now toggled on by default, which uses splats for its aura GFX....well, there's a good chance SRB2 caches splats as \"rollangled\" in its memory too. I suspect SRB2 might have the same memory-accumulation issue there too. Therefore, v1.1c is an experimental version that turns off alot of splat effects entirely when the \"stupid memory leak fix\" is enabled. Let me know it how goes! CHANGES: -The \"Stupid Memory Leak Fix\" now disables most splats entirely as an experiment. If crashes diminish from this, that means SRB2 gets memory leaks from splats as well. -Chaos Blast now blows away nearby scenery as well. -Boosted speed gained from slopes when using the Groundslam in Dark/Super Rush Assault. -Slightly improved parkour detection on harsh/UDMF slopes. BUGS FIXED: -Runshoes effect flipping incorrectly when upside down. -Zipdash sometimes being used twice if using custom1 on the ground, either underwater or as Super/Dark Sonic. -Occasional eardrum destruction when destroying scenery. Note! Please don't report issues discovered on the Cell Games arena. That map is too massive for SRB2 to keep stable, tenfold so if you're using Software mode. It'll be far too likely issues there are caused by map rendering problems rather than X Sonic. Golden Shine posting! Doing some maintenance on a few things I missed, plus some small QoL things! -1 more Planet Egg per stage can spawn in modded campaigns. -Removed SRB2's weird superform 31-minute limit. I only did so for X Sonic just to not get in the way of niche other character. -You no longer take increased knockback during the spindash taunt. -The 2006 levelpack's snowboard now has a bit of support, using X Sonic's grind animation-Sprite error when getting hurt mid-spindash. -Disabled Milnekick since I know better than to create a Milne Chronicles sequel. -Fixed a silly death animation glitch -Random minor stuff. SST now also tracks alot of stats. See the SST changelog below! -Sliiiightly stepped back on Super Rush Assault's bonkers damage buff. -Adjusted vertical-adjustment system to better keep in mind what the player is trying to do. STAT TRACKING: -Added stat tracking to the scoreboard. Wins and losses are tracked, as well as your personal beam struggle & counter-records! -Once 3 SST victories have been gained, one player is crowned the SST champion on the scoreboard! -Once 5 SST victories have been gained, the best fighter receives the favor of the Chaos Emeralds, circling around them in awe. Defeat them to gain their favor for yourself! -Forfeiting a match subtracts a win from your stats in addition to giving a loss. -Your win/loss stats are disregarded once you untransform or switch stages. Golden Shine posting! X Sonic's v1 release was surprisingly stable! Considering we got thousands of bugtesters after our small private handful, I was expecting alot worse! Still, nothing's ever perfect, so v1.1 aims to fix the biggest issues the original release had, and introduces some quality of life changes! CHANGELOGS: -Dedicated Servers getting constant resynchs. -Super Time Attack not activating transformations beyond the first stage in Marathon Mode. -Inactive invincibility during Fake Emerald scenes, sometimes causing a sprite error that persists afterwards on taking damage.-Power Rings spawning in walls when monitors are placed too close, potentially bouncing to the ceiling or getting crushed. -Super Time Attack trying to activate transformations in NiGHTS too. -Ring Burst invincibility outprioritizing Dark Super's, letting him take damage in instances where he shouldn't. -Frame-perfect sliding animation glitch when zipdashing-buffer leaping on landing -Zipdash aimline not adjusting correctly in flipped gravity. -Rare lack of resetting squash&stretch on Snapdived objects. -X HUD more aggressively fights off other HUD, hopefully fixing more problems than it creates. -Other minor things. -Added a Super Sonic signpost, similar to how full power Dark Sonic had one. -You no longer take extra knockback from Metal Sonic. -Adjusted kick pushback on some bosses to be more aggressive and have a momentum failsafe. -Overwrote vanilla's lying message when you get all 7 Chaos Emeralds. -Removed Ring Burst's ability to instaturn 180 degrees, unless using burst movement. (Double-Tap the control stick backwards) -The Russian Kickdance taunt now knocks off NPC Amy. -Super & Dark Sonic can now access their edge frames with Toss Flag as a taunt. -Untransforming now only takes the initial transformation cost rather than ALL rings. -Slightly decreased the amount of darkness needed to ascend Dark Sonic phases. (10%-ish.) -Dark Sonic now breaks bustable floors with his zipdash start animation. (Prevents a need for Ring Bursting) -Phase 3 Dark Sonic now creates tornadoes on Hyper Meteor Smashes. (In Dark Rush Assault, hold & release SPIN with good timing!) -Eased up on perfect Dark Sonic's Hyper Smash timing. (+2 frames) -Super Sonic's Sonic Boom Kick now destroys scenery objects. -Bonking into walls no longer adjusts your camera. -Increased ease of grabbing Power Rings Super Sonic Tenkaichi got some updates as well to be more fun! The hype reactions were a delight, thanks for all the cheers! -FreeCharge is now toggled ON by default. -You now TAP Custom3 for Chaos Blast, while HOLDING it charges Tension. Holding C3 when your Tension Bar is full taunts. -Charging Tension now pushes your foe away. (It does not inflict knockback/stun) -Increased damage for winning beam struggles. -Increased damage for the Chaos Control Ultimate. -Ultimates can now be used at 90% Tension rather than 98%. -Increased time leniency and rebalanced damage output for the Super Rush Assault Ultimate. -Super Rush Assault damage now shows more precise damage numbers. -Decreased movement speed penalty for an initial backwards zipdash. -Zipdashes now temporarily activate faster after taking damage, after a fresh Chaos Snap, or after a Zipdash Clash. -Increased time window for Ring Burst followups after a Zipdash Tackle. (+4 frames) -Counterattacks now become aggressively faster and more difficult as chains build up. -The loser of a counterchain now takes the entire chain number as extra damage! (So a chain of 80 would deal 80 extra damage) -Removed the 1 damage dealt per counter. -Increased amount of SST counterchain HUD reactions. -Added auto-JUMP/SPIN input system when you're too vertically far apart for the camera to track your foe. Alright, that's all from me! Enjoy zipping around some more as (the) Blue Blur!"
}