{
  "url": "https://edition.cnn.com/2024/01/31/asia/pakistan-imran-khan-sentence-14-years-intl-hnk/index.html",
  "title": "Pakistan’s former leader Imran Khan sentenced to 14 years in prison, a day after being jailed for 10 years | CNN",
  "text": "Pakistan’s incarcerated former Prime Minister Imran Khan has been sentenced to 14 years in prison for corruption, his Pakistan Tehreef-e-Insaaf (PTI) party said Wednesday, in the second legal blow to beset the beleaguered politician this week. Khan and his wife, Bushra Bibi, were convicted by the National Accountability Bureau in a case related to the unlawful sale of state gifts during his tenure as prime minister from 2018 to 2022. Khan, who has been jailed since August on several charges, has also been barred from holding office for 10 years, the PTI said. Bibi was taken into police custody shortly after the sentencing, the party added. Wednesday’s sentencing comes almost one week away from a general election expected on February 8 and just a day after Khan was handed a 10-year sentence for leaking state secrets. He will be allowed to serve his sentences concurrently. Pakistan’s upcoming election is seen by many analysts as one of the least credible in the country’s nearly 77-year history, owing to the military’s crackdown on Khan and his aides. Khan maintains widespread popularity among Pakistan’s largely young voters, who view him as a clean break from the political dynasties or military establishments that ruled the South Asian nation for much of its independent history. The former star cricketer turned politician rose to power on a ticket of anti-corruption in 2018, but has been embroiled in political controversy since he was dramatically ousted in a parliamentary no-confidence vote in April 2022. That moment set the stage for a months-long showdown between Khan and the powerful military, who he accused of orchestrating his removal. The military denies Khan’s accusations. One of the few politicians to challenge Pakistan’s army generals, Khan drew tens of thousands to nationwide rallies that became a fixture in Pakistan’s volatile political scene, with public anger reverberating across the country against the ruling dispensation. In response, Khan and members of his party were subjected to a widespread crackdown, with some saying they were intimidated into silence, and others arrested on various charges or banned from leaving the country. The PTI has been prohibited from using its famous cricket bat symbol on ballots and TV stations are banned from running Khan’s speeches. “Another sad day in our judicial system history, which is being dismantled,” the PTI said of Wednesday’s sentencing, adding “this ridiculous decision will also be challenged.” Khan was sentenced to three years in prison and barred from holding office for five years last August in the same case by the Election Commission of Pakistan. That conviction was later suspended. He maintains the charges against him are politically motivated, an allegation authorities deny. This story has been updated."
}