{
  "url": "https://www.bladeforums.com/threads/why-was-this-knife-discontinued-cold-steel-triple-action.1555401/",
  "title": "Why was this knife discontinued? (Cold Steel Triple Action) | BladeForums.com",
  "text": "The BladeForums.com 2024 Traditional Knife is available! Price is $250 ea (shipped within CONUS). Order here: https://www.bladeforums.com/help/2024-traditional/ Too tactical, or not tactical enough? I've watched that CS guy video, and I bet he can't even conceive of \"too tactical\"...It was too tactical and the company didn’t want to tarnish their reputation. Too tactical, or not tactical enough? I've watched that CS guy video, and I bet he can't even conceive of \"too tactical\"... Yes. I think I failed with my reply.Read deeper into the comment... he was being ironicable. Yes. I think I failed with my reply. It was too tactical and the company didn’t want to tarnish their reputation. So as the title says, I found a video of this on youtube not long ago and I am curious how come it's discontinued? Thanks in advance. My thoughts exactly!Too tactical, or not tactical enough? I've watched that CS guy video, and I bet he can't even conceive of \"too tactical\"... Thats what I was thinking. Looks like it would make a cool collectors item now though.It also probably wasn't able to escape being treated or classified like a balisong or gravity knife. Yes!! I have that Perrin, great little knife, fun to play with too. I've also played with the Tanto Triple Action, I quite enjoyed it. People are quite right about the handles being easily scratched...I had one of these when I was younger. It was the tanto version. If I remember correctly I loaned it to a friend who promptly lost it. (Don’t lend knives to friends, there is no way they will care for your knife as you do) I have a very similar but smaller knife called the Fred Perrin Le Trifolder. The issue with it is that the edge is on the opposite side if the blade as the Cold Steel example. This means if you don’t grip the knife tightly while you cut the blade has a tendency to want to push the knife open. Edge is to the left in this pic. So you can see that unless you tightly hold down the third section there is nothing preventing the blade from folding back. (Edge is to the left, imagine putting pressure on it) I have heard these knives called “Jacobs Ladder” knives. They are overall fun to play with but imho mostly a toy. Unlike a balisong which is a great practical design. Yes!! I have that Perrin, great little knife, fun to play with too. I've also played with the Tanto Triple Action, I quite enjoyed it. People are quite right about the handles being easily scratched... Not attempting to hijack the thread, but I'm curious if anyone would be interested in a more modern iteration of Jacobs Ladder type designs with G10 handles? I have been looking around, but I'm not finding much currently available. To the OP, I'm fairly certain the Triple Action was discontinued to make room for new products / lack of sales to justify continuing making it. Yeah, I kind of assumed that the rest of the knives made with those designs would likely be 'vintage', older cheap knives, since they seem to be so hard to find, even just pictures. Little to no documentation about them either, from what I've seen online.They’re pretty rare designs. The Perrin one I have has that Micarta oval on the front scale. It sort of helps for when I am fliping it open like a balisong. I haven’t seen one of these knives in g10. Infact the only ones I know of are the Perrin and the Cold Steel. Other than that I used to see some cheap chinese ones back when I was a kid in the 90’s."
}