{
  "url": "https://www.tomsguide.com/phones/iphones/ios-26-guide",
  "title": "iOS 26 guide: All the new features for your iPhone and how to use them | Tom's Guide",
  "text": "iOS 26 guide: All the new features for your iPhone and how to use them Everything you need to know about Apple's latest iPhone software Here at Tom’s Guide our expert editors are committed to bringing you the best news, reviews and guides to help you stay informed and ahead of the curve! You are now subscribed Your newsletter sign-up was successful Want to add more newsletters? Daily (Mon-Sun) Tom's Guide Daily Sign up to get the latest updates on all of your favorite content! From cutting-edge tech news and the hottest streaming buzz to unbeatable deals on the best products and in-depth reviews, we’ve got you covered. Weekly on Thursday Tom's AI Guide Be AI savvy with your weekly newsletter summing up all the biggest AI news you need to know. Plus, analysis from our AI editor and tips on how to use the latest AI tools! Weekly on Friday Tom's iGuide Unlock the vast world of Apple news straight to your inbox. With coverage on everything from exciting product launches to essential software updates, this is your go-to source for the latest updates on all the best Apple content. Weekly on Monday Tom's Streaming Guide Our weekly newsletter is expertly crafted to immerse you in the world of streaming. Stay updated on the latest releases and our top recommendations across your favorite streaming platforms. Join the club Get full access to premium articles, exclusive features and a growing list of member rewards. Any iOS update is going to have its share of unfamiliar features with new twists and turns that you may not immediately grasp. Apple's iOS 26 update is a case in point, as this year's version of the iPhone software rolls out new capabilities and enhancements to old features while also switching up the interface for the first time in a dozen years. For the most part, these are positive changes, as I observe in my iOS 26 review, but they will take some getting used to. Fortunately, I've been working with iOS 26 since Apple released the initial developer beta in June, and I can help you get the lay of the land now that the full iOS 26 release is available to download. In this iOS 26 guide, I'll walk you through the biggest changes in Apple's software update. This guide features highlights of the major iOS 26 changes as well as links back to our coverage for a more in-depth explanation of what's new in the update and how to make the most of it. Though some of the how-to articles may refer to the iOS 26 beta, the same steps apply in the version of iOS 26 that's now available. iOS 26: How to download the update Our guide on how to download iOS 26 offers step-by-step instructions on updating your iPhone's software. Just make sure you've got an iOS 26 supported device capable of running the update. That's any iPhone released from 2019 onward — basically, the iPhone 11 or later. That means the iPhone XR, iPhone XS and iPhone XS Max are the only iOS 18-compatible devices that can't upgrade to iOS 26. (And no, you didn't fall asleep and miss eight iOS updates between iOS 18 and iOS 26. Apple decided to switch to a different naming convention for its software, replacing the version number with the year following the update's release.) Also, be aware that not every feature will work on every iOS 26-compatible phone. There are Apple Intelligence features in iOS 26 that require at least an iPhone 15 Pro or later. A new spatial photos feature only works on the iPhone 12 later. iOS 26 and Liquid Glass Liquid Glass is the name Apple's given to the new interface for its iPhone software, as well as for the software updates that are also now available for the Mac, iPad, Apple Watch and Apple TV. Apple wants a more unified software experience with streamlined menus with a look that takes its inspiration from the visionOS software that powers the Vision Pro headset. Get instant access to breaking news, the hottest reviews, great deals and helpful tips. Liquid Glass is characterized by translucent menus and fluid animations as on-screen elements adjust to your actions. (Think the URL bar shrinking in Safari as you scroll down a web page.) Some icons have been changed around in iOS 26, and you've got new tinting options, including one that makes those icons completely clear. We've got a comparison between the iOS 26 and iOS 18 interfaces that can help you get used to what's changing with the look of Apple's iPhone software. And if you find the translucent look distracting, we can show you how to adjust the transparency of interface elements in Settings. As part of iOS 26's interface changes, your iPhone lock screen can take on a new look with spatial photos available as the background image for your phone and an adaptive time feature that adjusts the look of the on-screen clock to fit with the other visual elements. We go through all the iOS 26 lock screen changes. iOS 26 Phone and FaceTime app The Phone app gets a unified interface that combines your recents and missed calls into a single window. (You can switch back to the old look if you prefer.) But the biggest additions are call screening and hold assist, and they're available on any phone capable of running iOS 26. Call screening fields incoming calls from unknown numbers, having those callers identify themselves and why they're calling. That information appears on your iPhone screen, letting you decide whether to take the call. We've got a look at how the iPhone's call screening compares to what the Google Pixel offers. Hold Assist does exactly what its name implies — it will monitor the phone line when you're put on hold, freeing you up to do other things. When a live agent comes on the line, you'll get a notification. Here are more details on how call screening and Hold Assist work in iOS 26. FaceTime gets a new look, too, with a tiled interface that shows off contact posters of the people you've talked to. There are call screening features here as well. Meanwhile, phones that support Apple Intelligence get a big boost to both the Phone and FaceTime apps — live translations so that you can carry on a conversation with a person in another language. Only select languages are supported right now, and you'll need to download the appropriate language from the Translate app for the feature to work seamlessly. iOS 26 Messages Of the current apps on your iPhone, Messages sees the highest volume of changes, and we detail everything that's new in iOS 26 Messages. But here are the highlights of what you'll see after updating to iOS 26. Group chats pick up a lot of new features, such as typing indicators and the ability to send Apple Cash to groups. Group chats are also the biggest beneficiary of a new polling feature that lets you put polls into chats so that people can vote for their favorite option. (Here's how to create a poll in iOS 26 Messages.) From an aesthetic standpoint, you can now use wallpapers as the background for your chat screens — each conversation can have its own background. And like Phone and FaceTime, Messages gains a way to screen out texts from unknown senders, just by adjusting one of the app's settings. iOS 26 Camera Streamlined controls are a theme throughout iOS 26, but that's the most evident in the Camera app. Launch your camera, and you'll see just two controls for video and photo. Swiping left or right brings up other camera modes, such as portrait, pano, slo-mo and time lapse. An upward swipe brings additional settings to adjust things like aspect ratio, exposure and more. And in video mode, you just need to tap the Format button to bring up all your available options. My colleague John Velasco has more on the streamlined camera interface and how it simplifies the task of adjusting settings. He also looks at new iOS 26 AirPod features that turn your earbuds into camera remotes and recording tools. iOS 26 Photos After a big Photos overhaul in iOS 18, Apple is at it again with iOS 26, though this time the changes are more modest. The new version of Photos restores tabs for toggling between your library and your collections, an addition that should save some scrolling while addressing complaints about last year's redesign. That's not the only change to Photos' look, though. You also have the ability to customize the layout of Collections. And if you have an iPhone 12 or later, you can turn images in your library into spatial photos that offer depth effects. (A bonus: if you've got a photo widget on your home screen to serve up favorite photos at random, they'll be automatically converted to spatial images.) See our guide to the biggest changes in iOS 26 Photos for more details. iOS 26 Visual Intelligence iPhones that support Apple Intelligence will benefit from expanded Visual Intelligence features in iOS 26. Specifically, the update adds the ability for the AI-powered tool to look at the contents of your iPhone screen via a screenshot. When you take a screenshot on a supported phone, you'll get on-screen options for searching with Google or ChatGPT. You'll also have contextually relevant commands like translation tools or creating calendar events. And you can highlight specific areas of the screenshot for searching, similar to Android's Circle to Search feature. I spent some hands-on time with Visual Intelligence in iOS 26 if you want to see examples of what the new capabilities allow you to do. iOS 26 Shortcuts and Reminders One of Apple's goals with iOS 26 has been to work Apple Intelligence into more of the iPhone's built-in apps. That's evident in the new versions of Shortcuts and Reminders, both of which now support some of Apple's AI features. In Shortcuts, you can now create workflows that tap into Apple Intelligence features like Writing Tools or Image Playground. For example, you could now make a shortcut that summarize text, pasting that summary into a document. Apple Intelligence support also extends to Apple Intelligence's on-device models and ChatGPT. As for Reminders, the app can now look at text in emails and on websites to find and create relevant tasks. It also works with recipes in the Apple News Plus service to automatically create grocery lists. And reminders can now be automatically categorized in a list thanks to Apple Intelligence integration. Apple Maps The first time you launch the iOS 26 Maps app, you'll be asked if you want the app to log all the places you visit. The idea behind this Visited Places feature is that it will help you remember favorite locations for later reference without any additional action on your part. Here's my experience using Visited Places, a feature that remains in beta even after iOS 26's full release. Another new Maps feature takes note of your preferred routes for frequent trips like commutes, school drop-offs and errands, showing you a preview of that route in a Maps widget. There are also notification alerts when there's likely to be a delay on that route so you can look for an alternative way of getting to Point B. iOS 26 Games iOS 26 adds a couple of new apps — Preview, which is an iPhone addition of the PDF viewing app on your Mac, and Games, which is entirely new. Apple treats Games like a one-stop shop for all the games installed on your iPhone, and indeed every game you've ever tried. You can launch games directly from the app or re-download them from the App Store if you've discovered something you haven't played in a while. You'll find recommendations, especially from the Apple Arcade subscription service. The true value of the Games app may not emerge until the fall when app makers starting releasing their iOS 26-inspired updates. There's a Play Together tab in which you can challenge friends to see who can post a better score in specific games, and there's clearly a push for app to add challenges that you'll be able to access from the Games app. iOS 26 CarPlay Liquid Glass also comes to CarPlay in iOS 26, but our CarPlay hands-on found the most welcome changes to be the addition of widgets and the ability to respond to text messages with tapbacks. Both of those features let you glance at information and respond quickly without distracting you from your drive. Other iOS 26 features By now, you've probably surmised that there's a lot to this iOS 26 update. Here's a quick round-up of other features and additions you should be aware of as you try out the updated software. - iOS 26 Safari gets a redesign toolbar, though you have some control over how that redesign looks. - iOS 26 Music adds an AutoMix feature for Apple Music subscribers, and anyone can now pin their favorite songs, albums. artists and playlists to the top of the app's Library tab. - iOS 26 Wallet will let you create a digital passport that you can use as ID at TSA checkpoints for domestic flights, though this feature isn't supposed to arrive until later. - Genmoji and Image Playground both gain new features, as you can now combine two emoji to make a new one or add expressions to the genmoji of people. Expressions are also available in Image Playground which gains access to ChatGPT for more images styles. iOS 26 overview iOS 26 may be out, but our work with the new software continues. Keep checking this guide as we update and add more on the features Apple has introduced in this software update — especially when the inevitable iOS 26 updates follow in the next few months. More from Tom's Guide - Try these iOS 26 features first - iPhone 17 delays — how long will you have to wait if you order today? - iPhone Air hands-on Philip Michaels is a Managing Editor at Tom's Guide. He's been covering personal technology since 1999 and was in the building when Steve Jobs showed off the iPhone for the first time. He's been evaluating smartphones since that first iPhone debuted in 2007, and he's been following phone carriers and smartphone plans since 2015. He has strong opinions about Apple, the Oakland Athletics, old movies and proper butchery techniques. Follow him at @PhilipMichaels. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name."
}