{
  "url": "https://www.highspeedinternet.com/tools/speed-test",
  "title": "Internet Speed Test | Check Download & Upload Speeds",
  "text": "More questions and answers Select a link to jump to a specific question and answer. What is a good internet speed? According to data pulled from our How Much Speed Do You Need tool, the average respondent has six devices and is suggested an internet speed of 100Mbps. However, a good internet speed is subjective. What works for you may not be enough for someone else. To determine what’s a good speed, think about how much bandwidth you need for all the devices you have connected to the internet, whether they’re active or passive. First, figure out how much speed your active devices need. The following chart is based on the recommended speed requirement for streaming 4K video: In short, tally up all your active devices and multiply by 25Mbps. Next, add extra bandwidth for all your other devices that can’t stream video, like thermostats and smart speakers. Multiply that total by 2Mbps. The total sum of the two should be good for your download speed needs. But what about upload speeds? We suggest an upload speed of at least 35Mbps if you livestream 4K content, plus some additional bandwidth for all your other applications. The FCC’s upload speed of 20Mbps for broadband is probably fine for those who don’t livestream. How much internet speed do I need? We recommend 100Mbps at the very least, based on data pulled from our How Much Speed Do You Need tool. For example, you should have at least 25Mbps reserved for each device that can stream 4K video. Plus, you need at least 2Mbps for every passive device connected to your home network, like AI-driven speakers and smart thermostats. Honestly, you probably have more internet-connected devices than you think, so it’s always good to check your gateway, router, or mesh system app to see a list of devices that are actively using the internet. Use our quick tool to test how much bandwidth you need. How Much Internet Speed Do You Need? Est. Time: 60 seconds Answer 6 questions and get a personalized internet speed recommendation! How many people in your household use the internet/WiFi on a daily basis? How many devices in your home connect to the internet, including tablets, gaming consoles, and smart devices? How many people in your household work from home? What video quality do you use for streaming TV and movies? How intensely does your household participate in online gaming? Does your household download large files from the cloud or via the internet? Why is my internet so slow? If your speed test results are slower than expected, make sure you didn’t run the test using the 2.4 GHz Wi-Fi band—it’s the slowest of the three Wi-Fi connections. By default, band steering can force your devices to use the 2.4 GHz band if it’s the stronger connection, so your results may be far lower than expected. Other factors can thwart your speed test results, too, like failing or outdated equipment, local network congestion, bad wired connections, and more. Consult our guide on how to determine and fix your internet issues. Why doesn’t my internet speed match my plan? Advertised speeds are always based on a wired connection. Your speed results may not match that number if you run the test over Wi-Fi. Range and interference will thwart your results as well as the band you choose. Run the speed test over a wired connection to get the best, most accurate results. That said, your internet speed likely does match your plan, but current conditions may produce unexpected results. Most of the time, your internet speeds will fluctuate within a small range of the advertised max speed. What you see on the speed test is simply where your internet speeds are at that moment. The result will be slightly different if you run the speed test again. Some internet providers state “up to” when advertising maximum speeds because many variables can prevent you from hitting that top speed. You may even see disclaimers like “wireless speeds may vary” because Wi-Fi speeds are always inconsistent, no matter what provider you choose—it’s just how Wi-Fi works. For example, there may be issues with the provider’s service area, like faulty connections somewhere within the neighborhood. Speed may be slow because you’re using the internet at peak times, or your router may be outdated. Roots may be growing into the cable buried in your yard. How can I improve my internet speed? You can improve your internet speed by restarting your equipment, updating your equipment’s firmware, restarting your devices, or upgrading to a faster plan. We can walk you through 10 steps to improve your internet speed in just 15 minutes. Do I need a faster router? You need a faster router if it’s outdated, failing, can’t handle all of your devices, or has an internet port that’s slower than the plan you have. The latest Wi-Fi specification is version 7, so now is a good time to upgrade if you’re sporting a Wi-Fi 5 router. Wi-Fi 7 is best, honestly, but Wi-Fi 6E also works if your devices can access the 6 GHz band. The sun is setting on Wi-Fi 6. However, keep in mind that the internet port on the router you choose needs to be faster than the plan you have. There are four versions made available in modern routers—the type depends on the model: What is the fastest type of internet? Fiber internet provides the fastest plans you can get—at least, for now. Speeds typically range from 100Mbps to 50,000Mbps (50Gbps) both ways, meaning the uploads are normally just as fast as the downloads. However, the speeds and providers you can get depend squarely on your location. Who are the fastest internet providers? Brightspeed has the fastest speed average based on proprietary data pulled from our speed tests in 2025, but it doesn’t offer the fastest plan available. The fastest plan you can get for home internet is 50Gbps (from Ziply Fiber), followed by 8Gbps (Brightspeed, Google Fiber, Optimum, Quantum Fiber) and 7Gbps (Frontier). Cable internet currently caps at 2Gbps (Astound, Spectrum, Xfinity, Xtream). See our report on the Fastest Internet Providers. Looking for provider speed test results? *Average of HighSpeedInternet.com speed test results for all provider’s users."
}