{
  "url": "https://dictionary.cambridge.org/us/dictionary/english/aspirant",
  "title": "ASPIRANT | definition in the Cambridge English Dictionary",
  "text": "- ache for something phrasal verb - acquisitive - ambitious - ambitiously - angle - angle for something phrasal verb - burn - fancy - hearty appetite - hunger - hunger after/for something phrasal verb - hungrily - hungry - pine - set your heart on something/doing something idiom - set your sights on something idiom - shook - shopping list - sight - straw Meaning of aspirant in English Examples of aspirant aspirant Some are selected by the candidates themselves, and some are taken from a list of approved aspirants. From Chicago Tribune But no moderator asks or any presidential aspirant talks about the nature of our economic growth and whether we are on the right track. From Huffington Post It stands to reason that more female elected officials should mean more female presidential aspirants. From CBS News What new and more exacting model of self, in other words, will colleges be urging their teen-age aspirants to approximate? From The New Yorker The young aspirant now had a core curriculum to follow to become a writer, but knew he'd have to hang in for the long haul. And for presidents or presidential aspirants, we're talking about a special kind of joke. From The Atlantic Now it's pushed back its timetable for integration to 2017 at the earliest, trying the patience of aspirant commercial drone pilots. From Slate Magazine And a story of an ending will never be as inspiring to aspirants as a story of a dawn. From The New Yorker I have often been astonished how rapidly and ruthlessly young novelists, or simply first novelists, will sever themselves from the community of frustrated aspirants. The presidential aspirants who drop in as featured guests are slotted into a more or less set program of the organizers' devising. From The Atlantic For comedy nerds and aspirants, that year marked the multifront emergence of a new and form-busting mode of humor: hyper-intelligent, deeply personal, and occasionally surreal. From WIRED For many spiritual aspirants, the first part of their training is to sit in the cremation grounds. From Huffington Post Such crony capitalism denies a level playing field to potential aspirants and restricts economic mobility. From Huffington Post In the popular imagination, blogging has become a viable career path with legions of aspirants. From The Atlantic He will preside at evening prayer with deacons and their wives, deacon aspirants and their wives, and lay ecclesial ministers. From Chicago Tribune These examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors."
}