{
  "url": "https://www.omnicalculator.com/health/apri",
  "title": "APRI Calculator",
  "text": "APRI Calculator The APRI calculator computes the AST to Platelet Ratio Index (APRI), which we use to predict fibrosis and cirrhosis. Calculating a patient's APRI score allows clinicians to easily predict hepatic fibrosis without performing a more invasive medical tests, e.g., biopsy. Are you interested in other calculators that can help assess whether or not a patient has liver disease? Check out the MELD calculator (Model for End-Stage Liver Disease) and the Child Pugh calculator. We try our best to make our Omni Calculators as precise and reliable as possible. However, this tool can never replace a professional doctor's assessment. AST to Platelet Ratio Index - How to calculate APRI score? The aspartate aminotransferase (AST) to platelet ratio index is an easy, non-invasive alternative to liver biopsy for identifying hepatic fibrosis. Currently, a biopsy is the most common method for diagnosing liver ﬁbrosis. However, this procedure is associated with patient discomfort and, in some cases, complications. Therefore, researchers developed APRI, an indirect biochemical marker of hepatic ﬁbrosis. We calculate it using routine laboratory parameters, which reflect alterations in hepatic function. It was initially validated in patients with chronic hepatitis C (CHC), but can also be used to identify other common ﬁbrotic liver diseases. The formula used to calculate APRI is: APRI = [(AST level / AST upper limit) / Platelet count] × 100 where, AST level - the aspartate aminotransferase level of the patient, expressed in IU/L (international units per litre); AST upper limit - a value used to make the calculations more specific. Most experts recommend using the value of 40, expressed in IU/L; and Platelet count - the patient's platelet count, expressed in 10⁹/L. APRI score - interpretation We can interpret the APRI score as follows: - Significant fibrosis: APRI threshold of 0.7 (77% sensitive and 72% specific); - Severe fibrosis: APRI threshold of 1.0 (61% sensitive and 64% specific); and - Cirrhosis: APRI threshold of 1.0 (76% sensitive and 72% specific). The percentages above are the correlation coefficients: *Sensitivity - ability to correctly identify those with the disease (true positive rate). *Specificity - ability to correctly identify those without the disease (true negative rate). The results are based on the study .The interpretation is based on another systematic review, :- a low APRI score (less than 0.5) is associated with a greater negative predictive value (and the ability to rule out cirrhosis); and - a high APRI score (greater than 1.5) is associated with a greater positive predictive value (and the ability to rule in cirrhosis). The APRI calculator To find out the patient's APRI score, you need to enter only two values: - AST level - the aspartate aminotransferase level of the patient (expressed in IU/L, i.e., international units per litre). - Platelet count - the patient's platelet count (expressed in 10⁹/L). The third value, AST upper limit, is optional. It is, by default, 40 IU/L, but you can change if you need. Calculating APRI score - a practical example Let's calculate the APRI score of a patient with the following laboratory tests: - AST level - 110 IU/L; - AST upper limit - 40 IU/L; and - platelet count - 110 × 10⁹/L. APRI = [(AST level / AST upper limit) / Platelet count] × 100 APRI = [(110 / 40) / 110] × 100 APRI = [2.75 / 110] × 100 APRI = 0.025 × 100 APRI = 2.5 This patient likely has severe fibrosis or cirrhosis."
}