{
  "url": "https://www.piller.com/products/",
  "title": "Products - Piller Power",
  "text": "Piller excels in providing comprehensive power solutions. Our offerings span kinetic energy storage systems, ground power units and 50/60Hz frequency converters. Boasting 7000+ kinetic energy storage devices and 6000+ rotary UPS units (up to 3600kVA) installed globally, our dedicated team of 300+ service technicians serve clients in over 50 countries. SHIELDX™ Dynamic Power Stabilization SHIELDX™ brings together two complementary battery-free technologies that work in tandem to address the very behaviours that make AI-driven loads so disruptive. UB-V Series for Data Centres Introducing Piller’s new high-performance UB-V ELECTRICALLY COUPLED UPS series for the conditioned power protection needs of cloud hyperscale, wholesale colocation and large enterprise deployments. UB-V Series for Industrial & Other Sectors Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. UNIBLOCK™ – UPS up to 50MW Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. CPM – Critical Power Modules with Flywheel 225kW up to 2.4MW Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. M+ Series Modular Static UPS All New Hot-Swappable Static UPS for Data Centres. The Piller M+ 500 is a high-density modular static UPS with impressive best-in -class efficiency and high short circuit capability. With its compact footprint, the M+ 500’s hot-swappable modular design allows for quick plug-and-play maintenance, ensuring minimal downtime. APOTRANS – Static Transfer Switch 25A up to 1600A Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. APOTRANS Static Transfer Switch 25A to 63A Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. APOTRANS Static Transfer Switch 125A to 1600A Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. APOSTAR – Static UPS from 3kVA up to 500kVA Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. Energy Storage Flywheels and Battery Systems Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions. DeRUPS™ Configuration Unique to Piller is the DeRUPS™ solution, an alternative to the more conventional DRUPS offering where a diesel generator is combined with UPS either upstream or downstream and integrated in the control system of a UNIBLOCK™ UBT+ Rotary UPS to build a powerful and multifunctional system. Isolated Parallel (IP) System Configuration The isolated-parallel system uniquely enables the advantages of combining isolated-redundant and parallel-redundant UPS configurations offering outstanding maintainability and unique fault tolerance characteristics in data centre applications where high operational efficiencies are critical and minimising space requirement and maximising return on capital are of the highest priority. Frequency Converters Meeting today’s industrial and commercial power protection challenges. Technological advances in virtually every field of human endeavour are bringing unprecedented demands for clean, uninterrupted power and with it, the need for ever more dependable, powerful and flexible UPS solutions."
}