{
  "url": "https://en.wikipedia.org/wiki/Provence",
  "title": "Provence - Wikipedia",
  "text": "Provence Provence[a] is a geographical, cultural region and historical province of southeastern France, which stretches from the left bank of the lower Rhône to the west to the Italian border to the east; it is bordered by the Mediterranean Sea to the south. It largely corresponds with the modern administrative region of Provence-Alpes-Côte d'Azur and includes the departments of Var, Bouches-du-Rhône, Alpes-de-Haute-Provence, as well as parts of Alpes-Maritimes and Vaucluse.[1] The largest city of the region and its modern-day capital is Marseille. The Romans made the region the first Roman province beyond the Alps and called it Provincia Romana, which evolved into the present name. Until 1481 it was ruled by the counts of Provence from their capital in Aquae Sextiae (today Aix-en-Provence), then became a province of the kings of France.[1] It also hosted the Avignon papacy in the middle ages, when the Pope and his Curia fled Rome. While the region has been part of France for more than 500 years, it still retains a distinct cultural and linguistic identity, particularly in the interior of the region.[2] Etymology [edit]The region got its name in Roman times, when it was known as Provincia Romana, simply \"the Roman province\". This name eventually was shortened to Provincia (the province),[3] and as the language evolved from Latin to Provençal, so did the pronunciation and spelling. History [edit]Prehistoric Provence [edit]The coast of Provence has some of the earliest known sites of human habitation in Europe. Primitive stone tools dating back 1 to 1.05 million years BC have been found in the Grotte du Vallonnet near Roquebrune-Cap-Martin, between Monaco and Menton.[4] More sophisticated tools, worked on both sides of the stone and dating to 600,000 BC, were found in the Cave of Escale at Saint-Estève-Janson; tools from 400,000 BC and some of the first fireplaces in Europe were found at Terra Amata in Nice.[5] Tools dating to the Middle Paleolithic (300,000 BC) and Upper Paleolithic (30,000–10,000 BC) were discovered in the Observatory Cave, in the Jardin Exotique of Monaco.[6] The Paleolithic period in Provence saw great changes in the climate. Two ice ages came and went, and the sea level changed dramatically. At the beginning of the Paleolithic, the sea level in western Provence was 150 meters higher than today. By the end of the Paleolithic, it had dropped to 100 to 150 metres below the sea level today. The cave dwellings of the early inhabitants of Provence were regularly flooded by the rising sea or left far from the sea and swept away by erosion.[7] The changes in the sea level led to one of the most remarkable discoveries of signs of early man in Provence. In 1985, a diver named Henri Cosquer discovered the mouth of a submarine cave 37 metres below the surface of the Calanque de Morgiou near Marseille. The entrance led to a cave above sea level. Inside, the walls of the Cosquer Cave are decorated with drawings of bison, seals, auks, horses and outlines of human hands, dating to between 27,000 and 19,000 BC.[8] The end of the Paleolithic and beginning of the Neolithic period saw the sea settle at its present level, a warming of the climate and the retreat of the forests. The disappearance of the forests and the deer and other easily hunted game meant that the inhabitants of Provence had to survive on rabbits, snails and wild sheep. In about 6000 BC, the Castelnovian people, living around Châteauneuf-les-Martigues, were among the first people in Europe to domesticate wild sheep, and to cease moving constantly from place to place. Once they settled in one place they were able to develop new industries. Inspired by pottery from the eastern Mediterranean, in about 6000 BC they created the first pottery made in France.[7] Around 6000 BC, a wave of new settlers from the east, the Chasséens, arrived in Provence. They were farmers and warriors, and gradually displaced the earlier pastoral people from their lands. They were followed about 2500 BC by another wave of people, also farmers, known as the Courronniens, who arrived by sea and settled along the coast of what is now the Bouches-du-Rhône.[7] Traces of these early civilisations can be found in many parts of Provence. A Neolithic site dating to about 6,000 BC was discovered in Marseille near the Saint-Charles railway station. and a dolmen from the Bronze Age (2500–900 BC) can be found near Draguignan. Ligures and Celts in Provence [edit]Between the 10th and 4th century BC, the Ligures were found in Provence from Massilia as far as modern Liguria. They were of uncertain origin; they may have been the descendants of the indigenous Neolithic peoples.[9] According to Strabo, the Ligurians, living in proximity to numerous Celtic mountain tribes, were a different people (ἑτεροεθνεῖς), but \"were similar to the Celts in their modes of life\".[10] They did not have their own alphabet, but their language remains in place names in Provence ending in the suffixes -asc, -osc, -inc, -ates, and -auni.[9] The ancient geographer Posidonius wrote of them: \"Their country is savage and dry. The soil is so rocky that you cannot plant anything without striking stones. The men compensate for the lack of wheat by hunting... They climb the mountains like goats.\"[11] They were also warlike; they invaded Italy and went as far as Rome in the 4th century BC, and they later aided the passage of Hannibal, on his way to attack Rome (218 BC). Traces of the Ligures remain today in the dolmens and other megaliths found in eastern Provence, in the primitive stone shelters called 'Bories' found in the Luberon and Comtat, and in the rock carvings in the Valley of Marvels near Mont Bégo in the Alpes-Maritimes, at an altitude of 2,000 meters.[12] Between the 8th and 5th centuries BC, tribes of Celtic peoples, probably coming from Central Europe, also began moving into Provence. They had weapons made of iron, which allowed them to easily defeat the local tribes, who were still armed with bronze weapons. One tribe, called the Segobriga, settled near modern-day Marseille. The Caturiges, Tricastins, and Cavares settled to the west of the Durance river.[13] Celts and Ligurians spread throughout the area and the Celto-Ligures eventually shared the territory of Provence, each tribe in its own alpine valley or settlement along a river, each with its own king and dynasty. They built hilltop forts and settlements, later given the Latin name oppidum. Today the traces of 165 oppida are found in the Var, and as many as 285 in the Alpes-Maritimes.[12] They worshipped various aspects of nature, establishing sacred woods at Sainte-Baume and Gemenos, and healing springs at Glanum and Vernègues. Later, in the 5th and 4th centuries BC, the different tribes formed confederations; the Voconces in the area from the Isère to the Vaucluse; the Cavares in the Comtat; and the Salyens, from the Rhône river to the Var. The tribes began to trade their local products, iron, silver, alabaster, marble, gold, resin, wax, honey and cheese; with their neighbours, first by trading routes along the Rhône river, and later Etruscan traders visited the coast. Etruscan amphorae from the 7th and 6th centuries BC have been found in Marseille, Cassis, and in hilltop oppida in the region.[12] Greeks in Provence [edit]Traders from the island of Rhodes were visiting the coast of Provence in the 7th century BC. Rhodes pottery from that century has been found in Marseille, near Martigues and Istres, and at Mont Garou and Evenos near Toulon. The traders from Rhodes gave their names to the ancient town of Rhodanousia (Ancient Greek: 'Ροδανουσίαν) (now Trinquetaille, across the Rhône river from Arles), and to the main river of Provence, the Rhodanos, today known as the Rhône.[14] The first permanent Greek settlement was Massalia, established at modern-day Marseille in about 600 BC by colonists coming from Phocaea (now Foça, on the Aegean coast of Asia Minor). A second wave of colonists arrived in about 540 BC, when Phocaea was destroyed by the Persians.[15] Massalia became one of the major trading ports of the ancient world. At its height, in the 4th century BC, it had a population of about 6,000 inhabitants, living on about fifty hectares surrounded by a wall. It was governed as an aristocratic republic, by an assembly of the 600 wealthiest citizens. It had a large temple of the cult of Apollo of Delphi on a hilltop overlooking the port, and a temple of the cult of Artemis of Ephesus at the other end of the city. The Drachma coins minted in Massalia were found in all parts of Ligurian-Celtic Gaul. Traders from Massalia ventured inland deep into France on the Rivers Durance and Rhône, and established overland trade routes deep into Gaul, and to Switzerland and Burgundy, and as far north as the Baltic Sea. They exported their own products; local wine, salted pork and fish, aromatic and medicinal plants, coral and cork.[15] The Massalians also established a series of small colonies and trading posts along the coast; which later became towns; they founded Citharista (La Ciotat); Tauroeis (Le Brusc); Olbia (near Hyères); Pergantion (Breganson); Caccabaria (Cavalaire); Athenopolis (Saint-Tropez); Antipolis (Antibes); Nikaia (Nice), and Monoicos (Monaco). They established inland towns at Glanum (Saint-Remy) and Mastrabala (Saint-Blaise). The most famous citizen of Massalia was the mathematician, astronomer and navigator Pytheas. Pytheas made mathematical instruments which allowed him to establish almost exactly the latitude of Marseille, and he was the first scientist to observe that the tides were connected with the phases of the moon. Between 330 and 320 BC he organised an expedition by ship into the Atlantic and as far north as England, and to visit Iceland, Shetland, and Norway. He was the first scientist to describe drift ice and the midnight sun. Though he hoped to establish a sea trading route for tin from Cornwall, his trip was not a commercial success, and it was not repeated. The Massalians found it cheaper and simpler to trade with Northern Europe over land routes.[16] Roman Provence (2nd century BC to 5th century AD) [edit]In the 2nd century BC the people of Massalia appealed to Rome for help against the Ligures. Roman legions entered Provence three times; first in 181 BC the Romans suppressed Ligurian uprisings near Genoa; in 154 BC the Roman Consul Optimus defeated the Oxybii and the Deciates, who were attacking Antibes; and in 125 BC, the Romans put down an uprising of a confederation of Celtic tribes.[17] After this battle, the Romans decided to establish permanent settlements in Provence. In 122 BC, next to the Celtic town of Entremont, the Romans built a new town, Aquae Sextiae, later called Aix-en-Provence. In 118 BC they founded Narbo (Narbonne). The Roman general Gaius Marius crushed the last serious resistance in 102 BC by defeating the Cimbri and the Teutons. He then began building roads to facilitate troop movements and commerce between Rome, Spain and Northern Europe; one from the coast inland to Apt and Tarascon, and the other along the coast from Italy to Spain, passing through Fréjus and Aix-en-Provence. In 49 BC, Massalia had the misfortune to choose the wrong side in the power struggle between Pompey and Julius Caesar. Pompey was defeated, and Massalia lost its territories and political influence. Roman veterans, in the meantime, populated two new towns, Arles and Fréjus, at the sites of older Greek settlements. In 8 BC the Emperor Augustus built a triumphal monument at La Turbie to commemorate the pacification of the region, and he began to Romanize Provence politically and culturally. Roman engineers and architects built monuments, theatres, baths, villas, fora, arenas and aqueducts, many of which still exist. (See Architecture of Provence.) Roman towns were built at Cavaillon; Orange; Arles; Fréjus; Glanum (outside Saint-Rémy-de-Provence); Carpentras; Vaison-la-Romaine; Nîmes; Vernègues; Saint-Chamas and Cimiez (above Nice). The Roman province, which was called Gallia Narbonensis, for its capital, Narbo (modern Narbonne), extended from Italy to Spain, from the Alps to the Pyrenees. The Pax Romana in Provence lasted until the middle of the 3rd century. Germanic tribes invaded Provence in 257 and 275. At the beginning the 4th century, the court of Roman Emperor Constantine (ca. 272–337) was forced to take refuge in Arles. By the end of the 5th century, Roman power in Provence had vanished, and an age of invasions, wars, and chaos began. Arrival of Christianity (3rd–6th centuries) [edit]There are many legends about the earliest Christians in Provence, but they are difficult to verify. It is documented that there were organised churches and bishops in the Roman towns of Provence as early as the 3rd and 4th centuries; in Arles in 254; Marseille in 314; Orange, Vaison and Apt in 314; Cavaillon, Digne, Embrun, Gap, and Fréjus at the end of the 4th century; Aix-en-Provence in 408; Carpentras, Avignon, Riez, Cimiez (today part of Nice) and Vence in 439; Antibes in 442; Toulon in 451; Senez in 406, Saint-Paul-Trois-Châteaux in 517; and Glandèves in 541.[18] The oldest Christian structure still surviving in Provence is the baptistery of the Fréjus Cathedral, dating from the 5th century. At about the same time, the first two monasteries in Provence were founded: Lérins Abbey, on the island of Saint-Honorat near Cannes, and Abbey of St Victor in Marseille. Germanic invasions, Merovingians and Carolingians (5th–9th centuries) [edit]Beginning in the second half of the 5th century, as Roman power waned, successive waves of Germanic tribes entered Provence: first the Visigoths (480), then the Ostrogoths, then the Burgundians, finally, the Franks in the 6th century. Arab invaders and Berber pirates came from North Africa to the Coast of Provence in the early 7th century. During the late 7th and the early 8th centuries, Provence was formally subject to the Frankish kings of the Merovingian dynasty, but it was in fact ruled by its own regional nobility of Gallo-Roman stock, which ruled themselves according to Roman, not Frankish, law. Actually, the region enjoyed more prestige than the northern Franks had, but the local aristocracy feared Charles Martel's expansionist ambitions.[19] In 737, Charles Martel headed down the Rhône Valley after subduing Burgundy. He attacked Avignon and Arles, garrisoned by the Umayyads, and came back in 739 to capture for a second time Avignon and chase the duke Maurontus to his stronghold of Marseille.[19] The city was brought to heel and the duke had to flee to an island. The region was thereafter under the rule of Carolingian kings, descended from Charles Martel, and then was part of the empire of Charlemagne (742–814). In 879, after the death of the Carolingian ruler Charles the Bald, Boso of Provence (also known as Boson), his brother-in-law, broke away from the Carolingian kingdom of Louis III and was elected the first ruler of an independent state of Provence. Fraxinet, the Counts of Provence (9th–13th centuries) [edit]Three different dynasties of counts ruled Provence during the Middle Ages, and Provence became a prize in the complex rivalries between the Catalan rulers of Barcelona, the kings of Burgundy, the German rulers of the Holy Roman Empire, and the Angevin kings of France.[clarification needed] The Bosonids (879–1112) were the descendants of the first king of Provence, Boson. His son, Louis the Blind (890–928), lost his sight trying to win the throne of Italy, after which his cousin, Hugh of Italy (died 947), became the duke of Provence and the count of Vienne. Hugh moved the capital of Provence from Vienne to Arles and made Provence a fief of Rudolph II of Burgundy. In the 9th century, Arab pirates (called Saracens by the French) and then the Normans invaded Provence. The Normans pillaged the region and then left, but the Saracens built castles and began raiding towns and holding local residents for ransom. The conquering Arabs established the emirate of Fraxinet in 887. Early in 973, the Saracens captured Maieul, the abbot of the monastery at Cluny, and held him for ransom. The ransom was paid and the abbot was released, but the people of Provence, led by Count William I, rose up and defeated the Saracens near their most powerful fortress (La Garde-Freinet) at the Battle of Tourtour. The Saracens who were not killed in the battle were baptised and enslaved, and the remaining Saracens in Provence fled the region. Meanwhile, dynastic quarrels continued. A war between Rudolph III of Burgundy and his rival, German emperor Conrad the Salic led in 1032 to Provence becoming a fiefdom of the Holy Roman Empire, which it remained until 1246. In 1112, the last descendant of Boson, Douce I, Countess of Provence, married the Catalan Ramon Berenguer III, Count of Barcelona, who as a result became Raymond Berenguer I, Count of Provence. He ruled Provence from 1112 until 1131, and his descendants, the Catalan counts, ruled in Provence until 1246. In 1125, Provence was divided; the part of Provence north and west of the Durance river went to the Count of Toulouse, while the lands between the Durance and the Mediterranean, and from the Rhône river to the Alps, belonged to the counts of Provence. The capital of Provence was moved from Arles to Aix-en-Provence, and later to Brignoles.[20] Under the Catalan counts, the 12th century saw the construction of important cathedrals and abbeys in Provence, in a harmonious new style, the Romanesque, which united the Gallo-Roman style of the Rhône Valley with the Lombard style of the Alps. Aix Cathedral was built on the site of the old Roman forum, and then rebuilt in the Gothic style in the 13th and 14th centuries. The Church of St. Trophime in Arles was a landmark of Romanesque architecture, built between the 12th and the 15th centuries. A vast fortress-like monastery, Montmajour Abbey, was built on an island just north of Arles and became a major destination for medieval pilgrims. In the 12th century, three Cistercian monasteries were built in remote parts of Provence, far from the political intrigues of the cities. Sénanque Abbey was the first, established in the Luberon between 1148 and 1178. Thoronet Abbey was founded in a remote valley near Draguignan in 1160. Silvacane Abbey, on the Durance river at La Roque-d'Anthéron, was founded in 1175. In the 13th century, the French kings started to use marriage to extend their influence into the south of France. One son of King Louis VIII \"the Lion\", Alphonse, Count of Poitou, married the heiress of the Count of Toulouse, Joan. Another, Louis IX \"the Saint\" of France or Saint Louis (1214–1270), married Marguerite of Provence. Then, in 1246, Charles, Count of Anjou, the youngest son of Louis VIII, married the heiress of Provence, Beatrice. Provence's fortunes became tied to the Angevin Dynasty and the Kingdom of Naples.[21] The popes in Avignon (14th century) [edit]In 1309, Pope Clement V, who was originally from Bordeaux, moved the Papal Curia to Avignon, a period known as the Avignon Papacy.[22] From 1309 until 1377, seven popes reigned in Avignon before the Schism between the Roman and Avignon churches, which led to the creation of rival popes in both places. After that, three antipopes reigned in Avignon until 1423, when the papacy finally returned to Rome. Between 1334 and 1363 the old and new Papal Palaces of Avignon were built by Popes Benedict XII and Clement VI respectively; together the Palais des Papes was the largest Gothic palace in Europe.[23] The 14th century was a terrible time in Provence, and all of Europe: the population of Provence had been about 400,000 people; the Black Death (1348–1350) killed fifteen thousand people in Arles, half the population of the city, and greatly reduced the population of the whole region. The defeat of the French Army during the Hundred Years' War forced the cities of Provence to build walls and towers to defend themselves against armies of former soldiers who ravaged the countryside. The Angevin rulers of Provence also had a difficult time. An assembly of nobles, religious leaders, and town leaders of Provence was organised to resist the authority of Queen Joan I of Naples (1343–1382). She was murdered in 1382 by her cousin and heir, Charles of Durazzo, who started a new war, leading to the separation of Nice, Puget-Théniers and Barcelonnette from Provence in 1388, and their attachment to the County of Savoy. From 1388 up to 1526, the area acquired by the Savoy was known as Terres Neuves de Provence; after 1526 it officially took on the name County of Nice. Good King René, the last ruler of Provence [edit]The 15th century saw a series of wars between the kings of Aragon and the counts of Provence. In 1423 the army of Alphonse of Aragon captured Marseille, and in 1443 they captured Naples, and forced its ruler, King René I of Naples, to flee. He eventually settled in one of his remaining territories, Provence. History and legend has given René the title \"Good King René of Provence\", though he only lived in Provence in the last ten years of his life, from 1470 to 1480, and his political policies of territorial expansion were costly and unsuccessful. Provence benefitted from population growth and economic expansion, and René was a generous patron of the arts, sponsoring painters Nicolas Froment, Louis Bréa, and other masters. He also completed one of the finest castles in Provence at Tarascon, on the Rhône river. When René died in 1480, his title passed to his nephew Charles du Maine. One year later, in 1481, when Charles died, the title passed to Louis XI of France. Provence was legally incorporated into the French royal domain in 1486. - The Chateau of René in Tarascon (15th century) 1486 to 1789 [edit]Soon after Provence became part of France, it became involved in the Wars of Religion that swept the country in the 16th century. Between 1493 and 1501, many Jews were expelled from their homes and sought sanctuary in the region of Avignon, which was still under the direct rule of the Pope. In 1545, the Parlement of Aix-en-Provence ordered the destruction of the villages of Lourmarin, Mérindol, Cabriéres in the Luberon, because their inhabitants were Vaudois, of Italian Piedmontese origin, and were not considered sufficiently orthodox Catholics. Most of Provence remained strongly Catholic, though Protestants controlled the Principality of Orange, an enclave ruled by William of the House of Orange-Nassau of the Netherlands, who inherited it in 1544 and which was not incorporated into France until 1673. An army of the Catholic League laid siege to the Protestant town of Mėnerbes in the Vaucluse between 1573 and 1578. The wars did not stop until the end of the 16th century, with the consolidation of power in Provence by the Bourbon kings. The semi-independent Parliament of Provence in Aix and some of the cities of Provence, particularly Marseille, continued to rebel against the authority of the Bourbon king. After uprisings in 1630–31 and 1648–1652, the young King Louis XIV had two large forts, fort St. Jean and Fort St. Nicholas, built at the harbour entrance to control the city's unruly population. At the beginning of the 17th century, Cardinal Richelieu began to build a naval arsenal and dockyard at Toulon to serve as a base for a new French Mediterranean fleet. The base was greatly enlarged by Jean-Baptiste Colbert, the minister of Louis XIV, who also commissioned his chief military engineer Vauban to strengthen the fortifications around the city. At the beginning of the 17th century, Provence had a population of about 450,000 people.[24] It was predominantly rural, devoted to raising wheat, wine, and olives, with small industries for tanning, pottery, perfume-making, and ship and boat building. Provençal quilts, made from the mid-17th century onwards, were successfully exported to England, Spain, Italy, Germany and the Netherlands.[25] There was considerable commerce along the coast, and up and down the Rhône river. The cities: Marseille, Toulon, Avignon and Aix-en-Provence, saw the construction of boulevards and richly decorated private houses. At the beginning of the 18th century, Provence suffered from the economic malaise of the end of the reign of Louis XIV. The Great Plague of Marseille struck the region between 1720 and 1722, beginning in Marseille, killing some 40,000 people. Still, by the end of the century, many artisanal industries began to flourish; making perfumes in Grasse; olive oil in Aix and the Alpilles; textiles in Orange, Avignon and Tarascon; and faience pottery in Marseille, Apt, Aubagne, and Moustiers-Sainte-Marie. Many immigrants arrived from Liguria and the Piedmont in Italy. By the end of the 18th century, Marseille had a population of 120,000 people, making it the third largest city in France.[24] During the French Revolution [edit]Most of Provence, with the exception of Marseille, Aix and Avignon, was rural, conservative and largely royalist, and the Revolution was as violent and bloody in Provence as it was in other parts of France. On 30 April 1790, Fort Saint-Nicolas in Marseille was besieged, and many of the soldiers inside were massacred. On 17 October 1791, a massacre of royalists and religious figures took place in the ice storage rooms (glacières) of the prison of the Palace of the Popes in Avignon. When the radical Montagnards seized power from the Girondins in May 1793, a real counter-revolution broke out in Avignon, Marseille and Toulon. A revolutionary army under General Carteaux recaptured Marseille in August 1793 and renamed it \"City without a Name\" (Ville sans Nom.) In Toulon, the opponents of the Revolution handed the city to a British and Spanish fleet on 28 August 1793. A Revolutionary Army laid siege to the British positions for four months (see the Siege of Toulon) and finally, the enterprise of the young commander of artillery, Napoleon Bonaparte defeated the British and drove them out in December 1793. About 15,000 royalists escaped with the British fleet, but five to eight hundred of the 7,000 who remained were shot on the Champ de Mars, and Toulon was renamed Port la Montagne. The fall of the Montagnards in July 1794 was followed by a new White Terror aimed at the revolutionaries. Calm was not restored until the rise of the Directory to power in 1795. Provence produced some memorable figures in the French Revolution; both moderates such as the comte de Mirabeau and figures of the far left such as the Marquis de Sade; there was also the military figure Charles Barbaroux and the theorist Emmanuel-Joseph Sieyès (1748–1836), who instigated the coup of 18 Brumaire which brought Napoleon to power. The revolutionary anthem La Marseillaise despite its origins on the Rhine got its name because revolutionary volunteers from Marseille sang it on the streets of Paris. Under Napoleon [edit]Napoleon restored the belongings and power of the families of the Ancien Régime in Provence. The British fleet of Admiral Horatio Nelson blockaded Toulon, and almost all maritime commerce was stopped, causing hardship and poverty. When Napoleon was defeated, his fall was celebrated in Provence. When he escaped from Elba on 1 March 1815, and landed at Golfe-Juan, he detoured to avoid the cities of Provence, which were hostile to him, and therefore directed his small force directly to the northeast of it.[26] 19th century [edit]Provence enjoyed prosperity in the 19th century; the ports of Marseille and Toulon connected Provence with the expanding French Empire in North Africa and the Orient, especially after the opening of the Suez Canal in 1869. In April–July 1859, Napoleon III made a secret agreement with Cavour, Prime Minister of Piedmont, for France to assist in expelling Austria from the Italian Peninsula and bringing about a united Italy, in exchange for Piedmont ceding Savoy and the Nice region to France. He went to war with Austria in 1859 and won a victory at Solferino, which resulted in Austria ceding Lombardy to France. France immediately ceded Lombardy to Piedmont, and, in return, Napoleon received Savoy and Nice in 1860, and Roquebrune-Cap-Martin and Menton in 1861. The railroad connected Paris with Marseille (1848) and then with Toulon and Nice (1864). Nice, Antibes and Hyères became popular winter resorts for European royalty, including Queen Victoria. Under Napoleon III, Marseille grew to a population of 250,000, including a very large Italian community. Toulon had a population of 80,000. The large cities like Marseille and Toulon saw the building of churches, opera houses, grand boulevards, and parks. After the fall of Louis Napoleon following the defeat in the Franco-Prussian War, barricades went up in the streets of Marseille (23 March 1871) and the Communards, led by Gaston Cremieux and following the lead of the Paris Commune, took control of the city. The Commune was crushed by the army and Cremieux was executed on 30 November 1871. Though Provence was generally conservative, it often elected reformist leaders; Prime Minister Léon Gambetta was the son of a Marseille grocer, and future prime minister Georges Clemenceau was elected deputy of Var in 1885. The second half of the 19th century saw a revival of the Provençal language and culture, particularly traditional rural values. driven by a movement of writers and poets called the Félibrige, led by poet Frédéric Mistral. Mistral achieved literary success with his poem Mirèio (Mireille in French); he was awarded the Nobel Prize for literature in 1904. 20th century [edit]Between World War I and World War II, Provence was bitterly divided between the more conservative rural areas and the more radical big cities. There were widespread strikes in Marseille in 1919, and riots in Toulon in 1935. After the defeat of France by Germany in June 1940, France was divided into an occupied zone and unoccupied zone, with Provence in the unoccupied zone. Parts of eastern Provence were occupied by Italian soldiers. Collaboration and passive resistance gradually gave way to more active resistance, particularly after Nazi Germany invaded the Soviet Union in June 1941 and the Communist Party became active in the resistance. Jean Moulin, the deputy of Charles de Gaulle, the leader of the Free France resistance movement, was parachuted into Eygalières, in the Bouches-du-Rhône on 2 January 1942 to unite the diverse resistance movements in all of France against the Germans. In November 1942, following Allied landings in North Africa (Operation Torch), the Germans occupied all of Provence (Operation Attila) and then headed for Toulon (Case Anton). The French fleet at Toulon sabotaged its own ships to keep them from falling into German hands. The Germans began a systematic rounding-up of French Jews and refugees from Nice and Marseille. Many thousands were taken to concentration camps, and few survived. A large quarter around the port of Marseille was emptied of inhabitants and dynamited, so it would not serve as a base for the resistance. Nonetheless, the resistance grew stronger; the leader of the pro-German militia, the Milice, in Marseille was assassinated in April 1943. On 15 August 1944, two months after the Allied landings in Normandy (Operation Overlord), the Seventh United States Army under General Alexander Patch, with a Free French corps under General Jean de Lattre de Tassigny, landed on the coast of Var between St. Raphael and Cavalaire (Operation Dragoon). The American forces moved north toward Manosque, Sisteron and Gap, while the French First Armored Division under General Vigier liberated Brignoles, Salon, Arles, and Avignon. The Germans in Toulon resisted until 27 August, and Marseille was not liberated until 25 August. After the end of the war, Provence faced an enormous task of reconstruction, particularly of the ports and railroads destroyed during the war. As part of this effort, the first modern concrete apartment block, the Unité d'habitation of Corbusier, was built in Marseille in 1947–52. In 1962, Provence absorbed a large number of French citizens who left Algeria after its independence. Since that time, large North African communities settled in and around the big cities, particularly Marseille and Toulon. In the 1940s, Provence underwent a cultural renewal, with the founding of the Avignon Festival of theatre (1947), the reopening of the Cannes Film Festival (begun in 1939), and many other major events. With the building of new highways, particularly the Paris Marseille autoroute which opened in 1970, Provence became destination for mass tourism from all over Europe. Many Europeans, particularly from Britain, bought summer houses in Provence. The arrival of the TGV high-speed trains shortened the trip from Paris to Marseille to less than four hours. In recent years, residents of Provence have struggled to reconcile economic development and population growth with their desire to preserve the region's unique landscape and culture. Geography [edit]The original Roman province was called Gallia Transalpina, then Gallia Narbonensis, or simply Provincia Nostra ('Our Province') or Provincia. It extended from the Alps to the Pyrenees and north to the Vaucluse, with its capital in Narbo Martius (present-day Narbonne). Location and borders [edit]In the 15th century, the County of Provence was bordered by the river Var on the east and the Rhône to the west, with the Mediterranean to the south, and a northern border that roughly followed the Durance. Bordering it on the northwest were two territories that had earlier formed part of Provence, i.e., the Comtat Venaissin, centered on Avignon which was ruled by the pope from the 13th century until the French Revolution, and, just north of this, the Principality of Orange, that through inheritance became a possession of William the Silent, who became the founder of the present ruling house of the Netherlands, the House of Orange-Nassau. The principality was independent between the 12th century and 1673 when it was occupied and then annexed by Louis XIV during one of his wars with its prince, Dutch stadtholder William III, the future king of England. At the end of the 14th century, another piece of Provence along the Italian border, including Nice and the lower Alps, was detached from Provence and attached to the lands of the duke of Savoy. The lower Alps were re-attached to France after the Treaty of Utrecht in 1713, but Nice did not return to France until 1860, during the reign of Napoleon III.[27] The administrative region of Provence-Alpes-Cote d'Azur was created in 1982. It included Provence, plus the territory of the Comtat Venaissin around Avignon, and the Principality of Orange, the eastern portion of the Dauphiné, and the former County of Nice. The area immediately to the north, in the Drome, is sometimes referred to as the fr:Drôme Provençale, given its very similar features and landscapes. Rivers [edit]The Rhône river, on the western border of Provence, is one of the major rivers of France, and has been a highway of commerce and communications between inland France and the Mediterranean for centuries. It rises as the effluent of the Rhône Glacier in Valais, Switzerland, in the Saint-Gotthard massif, at an altitude of 1753 m. It is joined by the river Saône at Lyon. Along the Rhône Valley, it is joined on the right bank by the rivers Eyrieux, Ardèche, Cèze and Gardon (or Gard), on the left Alps bank by rivers Isère, Drôme, Ouvèze and Durance. At Arles, the Rhône divides itself in two arms, forming the Camargue delta, with all branches flowing into the Mediterranean Sea. One arm is called the \"Grand Rhône\"; the other one is the \"Petit Rhône\". The Durance river, a tributary of the Rhône, has its source in the Alps near Briançon. It flows south-west through Embrun, Sisteron, Manosque, Cavaillon, and Avignon, where it meets the Rhône. The Verdon River is a tributary of the Durance, rising at an altitude of 2,400 metres in the southwestern Alps near Barcelonette, and flowing southwest for 175 kilometres through the departments of Alpes-de-Haute-Provence and Var before it reaches the Durance at near Vinon-sur-Verdon, south of Manosque. The Verdon is best known for its canyon, the Verdon Gorge. This limestone canyon, also called the 'Grand Canyon of Verdon', 20 kilometres in length and more than 300 metres deep, is a popular climbing and sight-seeing area. The Var River rises near the Col de la Cayolle (2,326 m; 7,631 ft) in the Maritime Alps and flows generally southeast for 120 kilometres (75 mi) into the Mediterranean between Nice and Saint-Laurent-du-Var. Before Nice was returned to France in 1860, the Var marked the eastern border of France along the Mediterranean. The Var is the unique case in France of a river giving a name to a department, but not flowing through that department (due to subsequent adjustments to the department's boundaries). Camargue [edit]With an area of over 930 km2 (360 sq mi), Camargue is western Europe's largest river delta (technically an island, as it is wholly surrounded by water). It is a vast plain comprising large brine lagoons or étangs, cut off from the sea by sandbars and encircled by reed-covered marshes which are in turn surrounded by a large cultivated area. It is home to more than 400 species of birds, the brine ponds providing one of the few European habitats for the greater flamingo. Mountains [edit]By considering the Maritime Alps, along the border with Italy, as a part of the cultural Provence, they constitute the highest elevations of the region (the Punta dell'Argentera has an elevation of 3,297 m). They form the border between the French département Alpes-Maritimes and the Italian province of Cuneo. Mercantour National Park is located in the Maritime Alps. On the other hand, if the département Hautes Alpes is also considered as part of the modern Provence, then the alpin Écrins mountains represent the highest elevations of the region with the Barre des Écrins culminating at 4102m. Outside of the Maritime Alps, Mont Ventoux (Occitan: Ventor in classical norm or Ventour in Mistralian norm), at 1,909 metres (6,263 ft), is the highest peak in Provence. It is located some 20 km north-east of Carpentras, Vaucluse. On the north side, the mountain borders the Drôme département. It is nicknamed the \"Giant of Provence\", or \"The Bald Mountain\". Although geologically part of the Alps, is often considered to be separate from them, due to the lack of mountains of a similar height nearby. It stands alone to the west of the Luberon range, and just to the east of the Dentelles de Montmirail, its foothills. The top of the mountain is bare limestone without vegetation or trees. The white limestone on the mountain's barren peak means it appears from a distance to be snow-capped all year round (its snow cover actually lasts from December to April). The Alpilles are a chain of small mountains located about 20 kilometres (12 mi) south of Avignon. Although they are not particularly high – only some 387 metres (1,270 ft) at their highest point – the Alpilles stand out since they rise abruptly from the plain of the Rhône valley. The range is about 25 km long by about 8 to 10 km wide, running in an east–west direction between the Rhône and Durance rivers. The landscape of the Alpilles is one of arid limestone peaks separated by dry valleys. Montagne Sainte-Victoire is probably the best-known mountain in Provence, thanks to the painter Paul Cézanne, who could see it from his home, and painted it frequently. It is a limestone mountain ridge which extends over 18 kilometres between the départements of Bouches-du-Rhône and Var. Its highest point is the Pic des mouches at 1,011 m. The Massif des Maures (Moor Mountains) is a small chain of mountains that lies along the coast of the Mediterranean in the department of Var, between Hyères et Fréjus"
}