{
  "url": "https://www.imdb.com/title/tt2546866",
  "title": "Uncle (TV Series 2012–2017) - IMDb",
  "text": "Uncle - TV Series - 2012–2017 - 30m IMDb RATING 7.8/10 4.7K YOUR RATING An amateur musician of stunted emotional growth is reluctant to take care of his young nephew, but as his reluctance grows, his other emotions begin to follow to the fore, meaning he may eve... Read allAn amateur musician of stunted emotional growth is reluctant to take care of his young nephew, but as his reluctance grows, his other emotions begin to follow to the fore, meaning he may even become a better, more-rounded person.An amateur musician of stunted emotional growth is reluctant to take care of his young nephew, but as his reluctance grows, his other emotions begin to follow to the fore, meaning he may even become a better, more-rounded person. - Awards - 1 nomination total Browse episodes Featured reviews Been binging brit shows recently a lot for the \"Sarcastic\" and \"straight forward\" English humour apparently, and of course the most majestic accent in the word, the British accent. This series is literally everything!!! The jokes and performances are phenomenal!! Except sometimes it is too cringe to watch that i have to pause to ensure myself it's just a tv show. But the rock and roll media in the series is the main key!! I am a big fan of rock culture (a Gen z who's in love with rock music) and acquiring the knowledge of music and bands to watch the series is just the best thing ever. This show really deserves more viewers and attention because it is a perfect show for people to enjoy!!! (PS: I don't like cheesy humours, there's really lots of shows that i don't find it entertaining, but this one really makes me laugh my ass out!!! ) (PS: I don't like cheesy humours, there's really lots of shows that i don't find it entertaining, but this one really makes me laugh my ass out!!! ) This is a super new comedy. Funny, but with great pathos too. Not a situation comedy; more a character comedy. I hadn't heard of Nick Helm before this programme. He's well worth watching. Yes, \"Uncle\" has similarities to other current comedies about 'loser blokes over forty with no life' (e.g. \"Man Down\" with Greg Davies) - and the viewer feels for the 'loser' lead character in this programme, just as with the lead in \"Man Down\" - but, still, it stands its own ground. It's sadder, calmer, & less frenetic than \"Man Down\", with the characters more believable. \"Uncle\" touches on reality far more: hence the evoked sympathy with the lead character. Nick Helm gives a depth to the character of 'Andy' the uncle, that other comedians might avoid, or indeed not be capable of eliciting from the character. We see elements of 'Andy' that are likable, as well as the predictable moments when we cringe away from him. From the very first episode there are moments of darkness to his portrayal - tinged of course with just enough of the required humour. Helm builds a solid character in 'Andy', who never veers too much towards, or away from, the 'loser' aspect of the uncle. It would have been all too easy to have become a caricature. The other characters are also nicely played as 3-dimensional & fully human: with the flaws of the average human being, but also the plus-points and all the spectrum/grey areas in between. Con O'Neill is hilarious as the father of 'Andy's' main love interest. His owner of a rock bar with a gay clientèle, and a cross-dressing bewigged owner at that, is so on point. He manages to convey the hilarity of such a character whilst also making us believe his ominous threats to protect his daughter from Nick's repeated advances. Daisy Haggard is also excellent as Andy's sister: a very 'real' portrayal as a committed but isolated single mum. 'Andy's' young nephew - played by Elliot Speller-Gillott - is a budding talent. He plays a nice balance of a little bit geeky & a little bit cute; again a blend that mirrors a genuine 12 year old. In fact, the programme served to remind me that we were all that gawky, difficult age once! Not many comedies bring in that amount of scope. There hasn't been much good new comedy on TV for years, IMHO, so 'Uncle' is happily welcomed. (Too much rubbish \"reality TV\" is broadcast these days, & the broadcast schedule is sadly getting even more overloaded with these gross & dross programmes. But I digress . . . !) All in all, this is a programme well worth watching. Plus there is the appeal of the quirky musical elements: mock videos - in the style of pop/rock bands - that are performed by 'Andy' and alternating members of the rest of the cast. They are cleverly put together, and - a delightfully surprising bonus! - are a truly musical interlude. A particularly fetching aspect of each episode. The music in the 'videos' being original just adds to this appeal. Not to mention Nick Helm's pleasant voice! An original touch to a comedy programme. In the 'drama' part that is inherent to this comedy, the viewer gets to see the reasons why 'Andy' is not so successful in life, but also we see his kindness - towards his sister, and his growing fondness for his nephew. He is truly a diamond in the rough. Plus the way he shines when he sees the teacher of his nephew, the full-bodied personality of 'Andy' - that otherwise seems to lurk in the shadows - can finally be seen. 'Melodie' already likes him, but can he see what light she is already bringing out in him?! A truly appealing & witty man is there somewhere . . . But 'Andy' does not seem to see how he naturally comes alive around her. The sparks are clearly there. The question is, will 'Andy' also eventually sense this?! I have only seen as far as episode 4 . . . so roll on the next episode; maybe we'll find out if 'Andy' ever realises with whom he truly becomes alive! ~ by SceneByScene (UK) ~ Funny, but with great pathos too. Not a situation comedy; more a character comedy. I hadn't heard of Nick Helm before this programme. He's well worth watching. Yes, \"Uncle\" has similarities to other current comedies about 'loser blokes over forty with no life' (e.g. \"Man Down\" with Greg Davies) - and the viewer feels for the 'loser' lead character in this programme, just as with the lead in \"Man Down\" - but, still, it stands its own ground. It's sadder, calmer, & less frenetic than \"Man Down\", with the characters more believable. \"Uncle\" touches on reality far more: hence the evoked sympathy with the lead character. Nick Helm gives a depth to the character of 'Andy' the uncle, that other comedians might avoid, or indeed not be capable of eliciting from the character. We see elements of 'Andy' that are likable, as well as the predictable moments when we cringe away from him. From the very first episode there are moments of darkness to his portrayal - tinged of course with just enough of the required humour. Helm builds a solid character in 'Andy', who never veers too much towards, or away from, the 'loser' aspect of the uncle. It would have been all too easy to have become a caricature. The other characters are also nicely played as 3-dimensional & fully human: with the flaws of the average human being, but also the plus-points and all the spectrum/grey areas in between. Con O'Neill is hilarious as the father of 'Andy's' main love interest. His owner of a rock bar with a gay clientèle, and a cross-dressing bewigged owner at that, is so on point. He manages to convey the hilarity of such a character whilst also making us believe his ominous threats to protect his daughter from Nick's repeated advances. Daisy Haggard is also excellent as Andy's sister: a very 'real' portrayal as a committed but isolated single mum. 'Andy's' young nephew - played by Elliot Speller-Gillott - is a budding talent. He plays a nice balance of a little bit geeky & a little bit cute; again a blend that mirrors a genuine 12 year old. In fact, the programme served to remind me that we were all that gawky, difficult age once! Not many comedies bring in that amount of scope. There hasn't been much good new comedy on TV for years, IMHO, so 'Uncle' is happily welcomed. (Too much rubbish \"reality TV\" is broadcast these days, & the broadcast schedule is sadly getting even more overloaded with these gross & dross programmes. But I digress . . . !) All in all, this is a programme well worth watching. Plus there is the appeal of the quirky musical elements: mock videos - in the style of pop/rock bands - that are performed by 'Andy' and alternating members of the rest of the cast. They are cleverly put together, and - a delightfully surprising bonus! - are a truly musical interlude. A particularly fetching aspect of each episode. The music in the 'videos' being original just adds to this appeal. Not to mention Nick Helm's pleasant voice! An original touch to a comedy programme. In the 'drama' part that is inherent to this comedy, the viewer gets to see the reasons why 'Andy' is not so successful in life, but also we see his kindness - towards his sister, and his growing fondness for his nephew. He is truly a diamond in the rough. Plus the way he shines when he sees the teacher of his nephew, the full-bodied personality of 'Andy' - that otherwise seems to lurk in the shadows - can finally be seen. 'Melodie' already likes him, but can he see what light she is already bringing out in him?! A truly appealing & witty man is there somewhere . . . But 'Andy' does not seem to see how he naturally comes alive around her. The sparks are clearly there. The question is, will 'Andy' also eventually sense this?! I have only seen as far as episode 4 . . . so roll on the next episode; maybe we'll find out if 'Andy' ever realises with whom he truly becomes alive! ~ by SceneByScene (UK) ~ Uncle is a well written comedy and Nick Helm is an underrated talent.. I started watching the first few episodes and unded up binge watching the entire 3 series.. I started watching the first few episodes and unded up binge watching the entire 3 series.. This is a really great comedy drama TV series. I laughed all the way. I particularly loved the music video \"No Survivors\" Andy, Nick Helm is a fantastic character who is not entirely sympathetic to his young nephew Errol played by Elliot Speller- Gillott. Andy is charged with looking after Errol, and perhaps his ideas of life skills are not entirely appropriate for the nephew that has been put in his charge. Daisy Haggard is the absolutely gorgeous and fun sister, she adds to the chaos and confusion of Andy's love life. I'd love to have her as an extra sister. I saw the earlier channel 4 pilot to this, and the first episode was remade and polished the script to perfection. My only regret is that I can only get this on DVD not Blu Ray Boo Hoo. Andy, Nick Helm is a fantastic character who is not entirely sympathetic to his young nephew Errol played by Elliot Speller- Gillott. Andy is charged with looking after Errol, and perhaps his ideas of life skills are not entirely appropriate for the nephew that has been put in his charge. Daisy Haggard is the absolutely gorgeous and fun sister, she adds to the chaos and confusion of Andy's love life. I'd love to have her as an extra sister. I saw the earlier channel 4 pilot to this, and the first episode was remade and polished the script to perfection. My only regret is that I can only get this on DVD not Blu Ray Boo Hoo. Uncle is a sitcom I truly wish more people had seen. Throughout its (woefully short) 3 seasons, it deals with some very heavy themes, particularly depression and addiction, whilst still being very funny. The writing is sharp, hilarious and sincere. It's laden with pathos and there's clearly an understanding of mental health issues, yet it never strays into the realm of being patronising or sappy. I often find that sitcoms of this nature sacrifice a lot of the humour and begin to focus too much on tragedy and drama, Uncle does not, nor does it linger on the dark subjects unnecessarily. Maybe I'm alone in my love of this series, but it really resonated with me. I've experienced some very dark times (most of us have) but the one thing that kept me going was always laughter. Even at rock bottom, you can usually find something to laugh about, and that to me is what this series excels in conveying. It really struck a chord with me, and I highly recommend that everyone give it a try! Did you know - TriviaComedian Nick Helm (Andy) explained that the show was inspired by Wes Anderson's comedy film The Royal Tenenbaums (2001). - ConnectionsRemade as Uncle (2021) - How many seasons does Uncle have?Powered by Alexa Details - Runtime - 30m - Color - Aspect ratio - 16:9 HD Contribute to this page Suggest an edit or add missing content"
}