{
  "url": "https://www.norwest.com/",
  "title": "Norwest | Venture Capital & Growth Equity for Visionary Leaders",
  "text": "Growing together every step of the way. KATERINA MARKOV SCHNEIDER Founder and CEO, Ritual Growing together every step of the way. JOE KUDLA Founder and CEO, Vuori We empower great leaders throughout the journey of growth. A top venture and growth equity investment firm, Norwest works side-by-side with the world’s most successful entrepreneurs, providing expert guidance and personalized resources every step of the way. Vuori “Founders want investors who are helpful, but not overbearing. Norwest understands your vision and knows when to lend a hand, without a heavy hand. That is a real art.” JOE KUDLA Founder and CEO, Vuori Vuori “Founders want investors who are helpful, but not overbearing. Norwest understands your vision and knows when to lend a hand, without a heavy hand. That is a real art.” JOE KUDLA Founder and CEO, Vuori Ritual “Founders want investors who are helpful, but not overbearing. Norwest understands your vision and knows when to lend a hand, without a heavy hand. That is a real art.” KATERINA MARKOV SCHNEIDER Founder and CEO, Ritual YipitData \"When Norwest says 'invited guest' they mean it. Always above and beyond, but never intrusive, the Norwest team gives us guidance and thought partnership at every step. Huge value-add!” VIN VACANTI Co-Founder and CEO, YipitData YipitData \"When Norwest says 'invited guest' they mean it. Always above and beyond, but never intrusive, the Norwest team gives us guidance and thought partnership at every step. Huge value-add!” VIN VACANTI Co-Founder and CEO, YipitData Gong “Norwest showed conviction and trust in our company at a time when others didn’t – which let us go farther than anyone imagined.” AMIT BENDOV Co-founder and CEO, Gong Gong “Norwest showed conviction and trust in our company at a time when others didn’t – which let us go farther than anyone imagined.” AMIT BENDOV Co-founder and CEO, Gong YipitData \"When Norwest says 'invited guest' they mean it. Always above and beyond, but never intrusive, the Norwest team gives us guidance and thought partnership at every step. Huge value-add!” VIN VACANTI Co-Founder and CEO, YipitData Ritual “Norwest has guided us at every turn, always believing in us and providing the right support. They’ve made me a better CEO – and a better person.” KATERINA MARKOV SCHNEIDER Founder and CEO, Ritual Gong “Norwest showed conviction and trust in our company at a time when others didn’t – which let us go farther than anyone imagined.” AMIT BENDOV Co-founder and CEO, Gong YipitData \"When Norwest says 'invited guest' they mean it. Always above and beyond, but never intrusive, the Norwest team gives us guidance and thought partnership at every step. Huge value-add!” VIN VACANTI Co-Founder and CEO, YipitData"
}