{
  "url": "https://krinos.com/",
  "title": "Krinos – Website",
  "text": "Importers, Distributors & Manufacturers of Specialty Foods Importers, Distributors & Manufacturers of Specialty Foods Importers, Distributors & Manufacturers of Specialty Foods Importers, Distributors & Manufacturers of Specialty Foods Importers, Distributors & Manufacturers of Specialty Foods Featured Products Krinos Foods, Since 1958 Krinos Foods is the largest importer and distributor of Greek and Eastern European specialty foods in North America. Since 1958, Krinos has been bringing the finest specialty foods from around the world to customers’ tables. From Farm to Table Krinos Foods’ carefully selected network of farmers ensures the freshest ingredients for our products. Markets We Serve Ethnic Market We have a long tradition of serving ethnic food retailers and distributors of all sizes from industrial scale to mom-and-pop stores. Mainstream Market We partner with national distributors, club stores, and supermarket chains to create custom programs and product offerings. Foodservice We offer a wide range of international cuisine to restaurants, distributors, and operators in healthcare, K-12 schools, colleges and universities. Private Label The Olive Packing Company (part of the Krinos family) manufactures and co-packs private label gourmet olives and specialty products for some of the biggest retail brands. SKU Brands Suppliers Around the World Countries We Source From The Krinos Advantages Unlock a world of exceptional taste and culinary experience with Krinos, where quality meets passion in every product. Explore our unique selection and discover what sets us apart in flavor and excellence. Quality Made from the finest ingredients sourced from Greece and around the world. Value Krinos offers exceptional value with competitive pricing without sacrificing quality. Partnership In business since 1958, Krinos has been partnering with suppliers and customers from one generation to the next. Versatility Wide array of product selection to suit consumers’ changing taste and need. Quality Made from the finest ingredients sourced from Greece and around the world. Value Krinos offers exceptional value with competitive pricing without sacrificing quality. Partnership In business since 1958, Krinos has been partnering with suppliers and customers from one generation to the next. Versatility Wide array of product selection to suit consumers’ changing taste and need. This week's Special KRINOS Tahini 12 / 1 lb glass jars # 16013 KRINOS Extra Jumbo Pitted Kalamata Olives #16357 Best seller of the month HORIO Extra Virgin Olive Oil 6 / 101 oz tins #04700 KRINOS Kefalograviera Cheese 2 pcs / case #22200"
}