{
  "url": "https://servicio-cliente.co/claro",
  "title": "Claro ► Servicio Cliente",
  "text": "Consulta las dudas más frequentes y toda la información de contacto de Claro. Ponte al tanto de tus derechos y de las recomendaciones de los usuarios Para cancelar el servicio de plan postpago marque #611 y elija las opciones 1,2,3, también podrá escribir en la página sección PQR y llevarlas a los centros de atención, enviarla via fax 74212885 o por correo carrera 68ª #24b-10 plaza Claro, Bogotá. Puede dirigirse a cualquier Centro de Atención y Ventas, llamar a la línea de atención al cliente o desde el celular marcar #611 y dar en la opcion de hablar con un concultor. Para activaciones en prepago marque desde el celular a *225# acepte términos y condiciones, siga las instrucciones para confirmación de información personal, posteriormente recibirá un mensaje de confirmación. Para activaciones de líneas postpago, marque *411# en el plástico donde viene el chip encontrara un código de barras, digítelos y presione enviar, le pedirá confirmación de seriado y finalmente se activará la línea. Si hay algún inconveniente llamar a las líneas de servicio. En caso de pérdida o robo, podrá bloquear la línea por los canales virtuales escribiendo en Twitter a @claroTeAyuda, en Facebook @clarocolombia o en el chat de la app Mi Claro. También podrá hacerlo acercándose a los centros de atención y ventas autorizados o comunicándose con un asesor al *611, por ultimo solicite la reposición de la sim. Los pagos de facturas claro podrá realizarlos vía virtual desde la app Mi Claro, página web o en la factura electrónica donde aparecerá la opción “pagar tu factura aquí”. También podrá hacerlo via presencial en los siguientes puntos autorizados: Bancolombia, Banco de Bogotá, Davivienda, BBVA, Colpatria, Citibank, Baloto, Éxito, Red servi, Giros y finanzas, Efecty, en puntos regionales como: super efectivo, coopenesa, servy pagos, servicer o en los Centros de Atención y Ventas a nivel nacional. Los servicios de adelanto de saldo aplican para usuarios prepago, podrá activarlo marcando *259# mas el numero al que desea comunicarse. Escuchara un audio con el valor y la condición del servicio, posteriormente se conectara la llamada. Si no se consumen los 300 segundos en la llamada podrá utilizarlo en otra. Para ponerte en contacto con Claro, sea por un reclamo, queja u otro motivo, podes hacerlo llamando por teléfono al : 01 8003 200 200 (Servicio al cliente) 750 0500 (Bogotá) También podés contactarte por escrito a través de :"
}