{
  "url": "https://pt.m.wikipedia.org/wiki/Taylor_Swift",
  "title": "Taylor Swift – Wikipédia, a enciclopédia livre",
  "text": "Taylor Swift Taylor Alison Swift (Reading, 13 de dezembro de 1989) é uma cantora, compositora, produtora musical, diretora e empresária americana. Conhecida por suas composições narrativas que geralmente concentram-se em sua vida pessoal, ao qual recebem ampla cobertura midiática. Nascida em West Reading, Pensilvânia, Swift mudou-se para Nashville, Tennessee, aos 14 anos, para seguir uma carreira na música country. No mesmo período, ela assinou contrato com a Sony/ATV Music Publishing e em 2005 com a gravadora Big Machine Records, que lançou seus dois primeiros álbuns, o homônimo (2006) e Fearless (2008). Esse último, certificado de diamante nos Estados Unidos, foi o primeiro de todos os seus discos seguintes a alcançar o topo da Billboard 200. Seus lançamentos posteriores, Speak Now (2010), Red (2012), 1989 (2014) e Reputation (2017) venderam — cada um —, mais de um milhão de cópias em suas semanas de estreia em terras estadunidenses, tornando Swift a primeira artista na história a realizar esse feito. Os três últimos citados recalibraram sua imagem do country para a música pop. Após assinar com a Republic Records em 2018, ela lançou Lover (2019) e o documentário autobiográfico Miss Americana (2020). Swift explorou estilos folk nos álbuns Folklore e Evermore (ambos de 2020) e gêneros pop moderados em Midnights (2022) e The Tortured Poets Department (2024) — os dois que também debutaram com vendas acima de um milhão de cópias em seu país natal —, enquanto também regravou quatro de seus discos, sob o título (Taylor's Version)[a] após uma disputa sobre a propriedade de suas masters com a Big Machine. Ao longo de sua carreira ela colocou 12 músicas em primeiro lugar na tabela Billboard Hot 100, incluindo \"We Are Never Ever Getting Back Together\", \"Shake It Off\", \"Blank Space\", \"Bad Blood\", \"Look What You Made Me Do\", \"Cruel Summer\", \"All Too Well\", \"Cardigan\" e \"Anti-Hero\". A Eras Tour (2023–24) e o registro de mesmo nome são, respectivamente, a turnê musical e o filme-concerto com a maior bilheteria de todos os tempos; Swift se tornou a primeira bilionária a ter a música como principal fonte de renda e a artista feminina de maior bilheteria em turnê. Ao longo de sua carreira, estima-se que Swift tenha vendido cerca de 200 milhões de cópias com seus trabalhos, sendo reconhecida como uma recordista em vendas no mundo. Entre seus diversos prêmios e reconhecimentos encontram-se quatorze Grammy Awards — sendo o único artista a vencer quatro vezes na categoria Álbum do Ano —, um Emmy Award, trinta MTV Video Music Awards (VMA) e 84 recordes mundiais no Guinness World Records. Em publicações da Rolling Stone e The Daily Telegraph, Swift é citada como uma das maiores compositoras de todos os tempos, além de ter sido eleita a quinta maior mulher da história da música pela revista Bustle. Além disso, ela foi homenageada como artista e mulher da década na 47ª edição do American Music Awards, e pela Billboard, respectivamente. Também é tida como um ícone da cultura popular devido à sua influente carreira, filantropia e empoderamento feminino. Em 2024, a Billboard elegeu Swift como a segunda maior estrela pop do período 2000-2024.[8] Já em 2025, a revista a reconheceu como a artista feminina mais bem sucedida do século 21 em suas paradas musicais.[9] Biografia e carreira 1989—2003: Infância Taylor Alison Swift nasceu em 13 de dezembro de 1989, na cidade de Reading, na Pensilvânia.[10] Seu pai, Scott Kingsley Swift, é um consultor financeiro da Merrill Lynch.[11] Scott também nasceu na Pensilvânia e é descendente de três gerações de presidentes de bancos.[10][12] Sua mãe, Andrea (sobrenome de solteira Finlay), é uma dona de casa que anteriormente trabalhou como executiva de marketing de um fundo de investimento.[13] Andrea passou dez anos de sua vida em Singapura, antes de se mudar para o Texas; seu pai era engenheiro de plataforma de petróleo que trabalhou entre o território do Sudeste Asiático.[12] Swift recebeu o nome de gênero neutro \"Taylor\" porque sua mãe acreditava que este iria ajudar a formar uma carreira empresarial de sucesso.[14] A cantora possui um irmão mais novo, Austin, que foi estudante da Universidade de Notre Dame.[15] Taylor passou seus primeiros anos de vida em uma fazenda aonde eram cultivados pinheiros de Natal, no Condado de Montgomery, também na Pensilvânia. Estudou a pré-escola e seu jardim de infância na Alvernia Montessori School, dirigida por freiras franciscanas,[16] sendo mais tarde educada no colégio Wyndcroft, uma instituição particular para ambos os sexos em Pottstown.[17] Quando a artista tinha nove anos, sua família se mudou para Wyomissing, aonde foi aluna do West Reading Elementary Center e da Wyomissing Area Junior/Senior High School.[18] Ela passava o verão na casa de férias de praia de seus pais em Stone Harbor, Nova Jersey, e descreveu-o como o lugar onde a maioria das suas memórias de infância foram formadas.[19] A família da artista possuía vários cavalos quarto de milha e um pônei nascido em Shetland. O primeiro hobby da cantora foi hipismo inglês.[20] Sua mãe a colocou em uma sela pela primeira vez quando ainda tinha nove meses de idade, e mais tarde ela competiu em rodeios.[21] Quanto tinha nove anos, Swift se interessou por teatro musical. Ela se apresentou em várias produções da Berks Youth Theatre Academy e viajou regularmente para a Broadway para aulas de canto e atuação.[22][23] Ela então voltou sua atenção para a música country; as obras musicais de Shania Twain a fizeram \"simplesmente querer correr em uma quadra quatro vezes e ter fantasias com tudo\".[24] Seus finais de semana eram gastos se apresentando em festivais locais, feiras, cafeterias, concursos de caraoque, clubes de jardim, encontros de escoteiros e eventos esportivos.[12][13][25] Aos onze anos, após várias tentativas falhadas,[26] Swift venceu uma competição musical após interpretar \"Big Deal\" de LeAnn Rimes, tornando-se assim o ato de abertura para um concerto de Charlie Daniels em um anfiteatro de Strausstown.[22] Esta ambição crescente começou a isolar a jovem de seus colegas do ensino médio.[10] Após assistir a um episódio de Behind the Music sobre Faith Hill, a cantora sentia-se segura de que precisava ir para Nashville, Tennessee para buscar sua carreira musical.[27] Ainda em seus onze anos de vida, ela e sua mãe viajaram para Nashville para as férias de primavera e deixar fitas demo de interpretações de canções de Dolly Parton e Dixie Chicks para gravadoras musicais de Music Row.[28] Várias gravadoras a rejeitaram, e ela percebeu que \"todos em sua cidade queriam fazer o que eu queria fazer. Então, eu fiquei pensando a mim mesma, eu preciso achar um jeito de ser diferente\".[29] Um ano depois, um técnico em informática a ensinou como tocar três acordes em um violão, inspirando-a a escrever sua primeira canção, Lucky You.[30] Ela anteriormente tinha ganhado um concurso nacional de poemas com Monster in My Closet, mas focou sua atenção em compor músicas.[31] Em 2003, Taylor e seus pais começaram a negociar com Dan Dymtrow, gerente musical de Nova York. Com a ajuda dele, a jovem se tornou garota-propaganda da Abercrombie & Fitch como parte da campanha Rising Stars, teve uma música incluída na compilação da Maybelline e participou de reuniões com as principais gravadoras estadunidenses.[32] Após interpretar canções próprias em um showcase da RCA Records, a aluna da oitava série recebeu um contrato de artista em desenvolvimento e fez frequentes viagens para Nashville com sua mãe.[33] Quando tinha quatorze anos, o pai da musicista foi transferido para o escritório da Merrill Lynch no Tennessee, e a família se realocou em uma casa à beira de um lago em Hendersonville.[10] Ela descreveu o momento como \"um incrível sacrifício\" que sua família tinha que fazer.[28] \"Meus pais notaram que eu estava obcecada, que eu não iria deixar isso de lado, que não era só uma fase\".[34] No estado, ela foi educada na Hendersonville High School durante seu ano de caloura e o segundo ano.[35] Mais tarde, para encaixar os estudos com sua agenda de concertos, ela transferiu-se para a Aaron Academy, uma escola cristã particular que oferecia serviços de ensino doméstico. Ela recebeu seu diploma do ensino médio em 2008, completando seus dois últimos anos de estudos em apenas doze meses.[36][37] 2004—2008: Início da carreira e Taylor Swift O primeiro single de Swift, Tim McGraw, foi lançado no verão de 2006 e seu álbum de estreia, Taylor Swift, foi lançado no dia 19 de junho de 2006. A intérprete escreveu e co-escreveu todas as canções do projeto, que estreou na parada Billboard 200 na posição 19 e vendeu mais de 67 mil cópias na primeira semana.[38] Em seguida, chegou à primeira posição da parada Billboard Top Country Albums e em quinto lugar na Billboard 200. Mesmo assim, o álbum ocupou a primeira posição das paradas de country durante oito semanas consecutivas. No total, ela ficou no topo das listas por 24 semanas,[39] junto com as Dixie Chicks e com Carrie Underwood, que também são as únicas artistas country, nesta década, que ficaram no topo das paradas por mais de 20 semanas.[40] Vendeu até agora mais de cinco milhões de cópias.[41] Sobre o single Tim McGraw, ela disse:[42] O single chegou à 6ª posição na semana de 27 de junho de 2007. O clipe da canção estabeleceu um recorde ao aparecer por 30 semanas consecutivas no GAC's fan-voted weekly Top 20 music[43] e atingiu o 1º lugar nas paradas de clipes da CMT. O vídeo fez Swift ganhar o prêmio de Breakthrough Video of the Year no CMT Music Awards 2007.[43] Ficou na 6ª posição na parada de country da Billboard e na 40ª posição na Billboard Hot 100. Em 15 de maio de 2007, Swift cantou sua canção Tim McGraw nas premiações da ACM (Academy of Country Music), onde estava o próprio Tim McGraw. O segundo single de Taylor Swift, Teardrops on My Guitar, foi lançado em 24 de Fevereiro de 2007. A canção foi inspirada por um evento real, durante o colegial, quando ela gostava de um garoto chamado Drew Hardwick, mas ele via Swift apenas como uma amiga e como uma pessoa para ir pedir conselhos sobre o relacionamento com sua namorada. Ela escutou \"através de uma fonte confidencial\" que Drew está bem consciente de que a canção foi escrita sobre ele. Chegou à posição mais alta no verão de 2007, quando foi remixado com um ritmo mais pop e alcançou a 2ª posição na parada de country da Billboard e a 13ª posição na Billboard Hot 100. Em outubro de 2007, conseguiu o prêmio da Associação de Compositores de Nashville, como a melhor cantora e compositora do ano; sendo assim a cantora mais jovem da história da Associação a ganhar.[44] Em 7 de novembro de 2007, foi lançado à venda o terceiro single, Our Song, que chegou à primeira posição nas paradas de country por seis semanas, começando na semana de 22 de dezembro de 2007, tendo subido desde a sexta posição. Isso foi o maior pulo ao número um desde janeiro de 1998, quando Tim McGraw, com Just to See You Smile, também pulou de #6 para #1.[45] Our Song chegou à 16ª posição na Billboard Hot 100 e à 24ª posição na Billboard Pop 100. Taylor também gravou o EP natalino Sounds of the Season: The Taylor Swift Holiday Collection, que foi lançado à venda em 16 de outubro de 2007, apenas nas lojas Target. O álbum, que não fez tanto sucesso como seu álbum de estreia homônimo, contou com clássicos natalinos como Last Christmas e canções originais escritas por Swift. Foi indicada em 2008 ao Grammy na categoria de Melhor Cantor(a) Revelação, mas perdeu a disputa para Amy Winehouse. O quarto single de Taylor, Picture to Burn, estreou no início de 2008 e ficou na terceira colocação na parada de country da Billboard, além de ficar em 28º lugar na Billboard Hot 100. Swift foi a garota da capa da revista Seventeen, na edição de junho de 2008.[46] Ela foi também nomeada na 57ª posição, na categoria \"As Mulheres Mais Pops de 2008\" da revista Maxim.[47] Também foi capa das revistas CosmoGirl[48] e Teen Vogue.[49] Em junho de 2008, no CMA Music Festival, ocorrido em Nashville, Swift assinou autógrafos por aproximadamente oito horas seguidas. Foi a sessão de autógrafos mais longa desde a maratona de 23 horas de Garth Brooks, em 1996.[50] Em 2008, Swift colocou à venda uma reedição de seu disco, com o nome de Beautiful Eyes, somente disponível no Wal-Mart.[51] Trata-se de um CD duplo, no qual são incluídas duas canções inéditas (Beautiful Eyes e I Heart). Na primeira semana de lançamento, o álbum vendeu 45 000 cópias, estreando na 1.ª posição na tabela Billboard Top Country Albuns e na #9 na Billboard 200. Como seu álbum de estreia homônimo em segundo lugar na mesma semana, Swift se transformou na primeira artista a atingir as duas primeiras posições da Top Country Álbuns chart desde que LeAnn Rimes o fez em 1997.[52] Em julho de 2008, Swift se graduou na Academia Aaron, uma escola Cristã em Hendersonville, Tennessee, que oferece um programa de ensino em casa.[53] 2008—2010: Fearless e atuação O segundo álbum de estúdio de Swift, Fearless, foi lançado em 11 de novembro de 2008.[54] O single principal, \"Love Story\", foi lançado em setembro de 2008. Chegou ao número quatro na Billboard Hot 100[55] e número um na Austrália. Mais quatro singles foram lançados ao longo de 2008 e 2009: \"White Horse\", \"You Belong with Me\", \"Fifteen\" e \"Fearless\". \"You Belong With Me\" foi o single com maior número de álbuns na Billboard Hot 100, alcançando o número dois.[56] O álbum estreou no número um na Billboard 200 e foi o álbum mais vendido de 2009 nos Estados Unidos.[57] A primeira turnê de shows de Swift, a Fearless Tour, promoveu o álbum[58] e arrecadou mais de US$ 63 milhões.[59] Journey to Fearless, uma minissérie de documentários em três partes, foi ao ar na televisão e depois lançado em DVD e Blu-ray.[60] Swift também se apresentou como um ato de abertura à turnê mundial Escape Together de Keith Urban.[61] Em 2009, o videoclipe de You Belong with Me foi nomeado Melhor Vídeo Feminino no MTV Video Music Awards de 2009.[62] Onde teve seu discurso interrompido pelo rapper Kanye West,[63] um incidente que se tornou objeto de controvérsia, atenção generalizada da mídia e muitos memes da Internet.[64] Naquele ano, Swift ganhou cinco American Music Awards, incluindo Artista do Ano e Álbum de Country Favorito.[65] Foi nomeada pela Billboard como Artista do Ano de 2009.[66] O álbum ficou em 99º lugar na lista da NPR de 2017 dos 150 maiores álbuns feitos por mulheres.[67] No Grammy Awards de 2010, Fearless foi nomeado em Álbum do Ano e Melhor Álbum Country, e White Horse foi nomeado em Melhor Canção Country e Melhor Performance Vocal Country Feminina. Swift foi o artista mais jovem a vencer o prêmio de Álbum do Ano.[68] Durante a cerimônia, Swift cantou You Belong With Me e Rhiannon com Stevie Nicks, uma performance que recebeu críticas negativas e causou reação da mídia. Jon Caramanica, do The New York Times, considerou \"refrescante ver alguém tão talentoso fazer um palavrão ocasional\" e descreveu Swift como \"a nova estrela pop mais importante dos últimos anos\". Swift se tornou o artista mais jovem a ser nomeado Artista do Ano pela Country Music Association (CMA). Fearless também ganhou o prêmio CMA Album of the Year.[69] Swift contribuiu com os vocais de apoio de Half of My Heart, de John Mayer, um single de seu quarto álbum, Battle Studies (2009).[70] Ela co-escreveu e gravou Best Days of Your Life com Kellie Pickler,[71] e co-escreveu duas músicas para a trilha sonora de Hannah Montana: O Filme - You'll Always Find Your Way Back Home e Crazier.[72] Swift também forneceu vocais para Two Is Better Than One, do Boys Like Girls.[73] Ela contribuiu com duas músicas para a trilha sonora do filme Valentine's Day, incluindo a música country Today Was a Fairytale, que se tornou seu primeiro número um na parada Canadian Hot 100 e sua segunda música número dois nos EUA[74] Enquanto filmava sua estreia cinematográfica no filme Valentine's Day em outubro de 2009, Swift iniciou um relacionamento romântico com a co-estrela Taylor Lautner; eles terminaram no final daquele ano.[75] A comédia romântica, lançada em 2010, a viu interpretar a namorada chique de um atleta do ensino médio, um papel que o Los Angeles Times sentiu que mostrava que Swift tinha \"um sério potencial cômico\". Por outro lado, em uma crítica contundente, um crítico da Variety a considerou \"totalmente não direcionada\", argumentando que \"ela precisa encontrar um diretor qualificado para reprimi-la e canalizar sua energia obviamente abundante\".[76] Swift fez sua estreia na TV em um episódio de 2009 de CSI: Crime Scene Investigation da rede americana CBS[desambiguação necessária], interpretando uma adolescente de 16 anos (ela tinha 19). Foi a realização de um sonho, pois a cantora, fã da série, sempre dizia que queria viver uma personagem no drama policial.[77] Ela encarnou Hayley, garota que é a principal vítima do episódio, chamado de De Volta no Tempo (16º da nona temporada). Logo na segunda cena, Hayley apareceu morta, de olhos abertos, no estacionamento molhado de um hotel gerenciado pelos seus pais. O investigador Nick Stokes (George Eads) ficou encarregado de resolver o caso. Mais tarde naquele ano, Swift apresentou e se apresentou como convidado musical em um episódio do Saturday Night Live e foi o primeiro anfitrião a escrever seu próprio monólogo de abertura.[78][79] Em sua aparição, o programa teve a maior audiência em dois meses.[80] A Entertainment Weekly a descreveu como \"a melhor apresentadora do Saturday Night Live desta temporada até agora\", observando que \"ela estava sempre pronta para o desafio, parecia estar se divertindo e ajudou o resto do elenco a acertar as piadas\".[80] 2010—2014: Speak Now e Red Em agosto de 2010, Swift lançou \"Mine\", o single principal de seu terceiro álbum de estúdio, Speak Now. Ele entrou nas paradas dos EUA no número três, tornando Swift a segunda artista feminina na história do Hot 100 (depois de Mariah Carey) a estrear várias faixas entre as cinco melhores em um ano; a outra era \"Today Was a Fairytale\" no número dois.[81] Swift escreveu o álbum sozinho e coproduziu todas as faixas.[82][83] Speak Now, lançado em 25 de outubro de 2010,[84] foi um sucesso comercial, estreando no número um na Billboard 200 e se tornando o 16º álbum na história das paradas a alcançar vendas na semana de abertura de um milhão de cópias.[85] Tornou-se o álbum digital mais vendido por uma artista feminina, com 278 000 downloads em uma semana, ganhando a Swift uma entrada no Guinness Book de 2010. Três dos singles do álbum, Mine, Back to December e Mean, alcançaram o top 10 no Canadá,[86] enquanto nos EUA, os dois primeiros, juntamente com a faixa-título, alcançaram o top 10 Hot 100. Mais tarde, em 2010, ela namorou brevemente o ator Jake Gyllenhaal.[87] Mean ganhou as duas indicações que concorria na 54° edição do Grammy Awards, o de \"Melhor Música Country\"[88] e \"Melhor Performance Country Solo\".[88][89] Taylor também cantou Mean na premiação, com um visual rural.[90] Jayme Deerwester, do USA Today, escreveu que as críticas em 2010 pareciam ter \"a tornado uma melhor compositora e artista ao vivo\".[91] Swift ganhou outros prêmios por Speak Now, incluindo compositora/artista do ano pela Nashville Songwriters Association (2010 e 2011),[92] Mulher do ano pela Billboard (2011),[93] e artista do ano pela Academy of Country Music (2011 e 2012)[94] e pela Country Music Association em 2011.[95] No American Music Awards de 2011, Swift ganhou Artista do Ano e Álbum de Country Favorito.[96] A Rolling Stone colocou o Speak Now no número 45 em sua lista de 2012 dos \"50 melhores álbuns femininos de todos os tempos\", escrevendo: \"Ela pode ser tocada na estação country, mas é uma das poucas estrelas do rock genuínas que temos hoje em dia\".[97] A Speak Now World Tour foi realizada de fevereiro de 2011 a março de 2012 e arrecadou mais de US $123 milhões.[98] Em novembro de 2011, Swift lançou seu primeiro álbum ao vivo, Speak Now: World Tour Live.[99] No mês seguinte, ela contribuiu com duas músicas originais para o álbum da trilha sonora do filme Jogos Vorazes: Safe & Sound, coescrito e gravado com os The Civil Wars e T-Bone Burnett, e Eyes Open. Safe & Sound ganhou o prêmio de Song Writter for Visual Media na 55ª edição do Grammy Awards em 2013 e também foi indicado ao Globo de Ouro de Melhor Canção Original.[100][101] Swift contribuiu com os vocais do rapper B.o.B, Both of Us, lançado em maio de 2012.[102] De julho a setembro de 2012, Swift namorou o herdeiro político Conor Kennedy.[103] Em agosto, Swift lançou We Are Never Ever Getting Back Together, o single principal de seu quarto álbum de estúdio, Red. Tornou-se seu primeiro número um nos EUA e na Nova Zelândia[104] e alcançou o primeiro lugar no ranking de vendas de músicas digitais do iTunes 50 minutos após seu lançamento, se tornando a música que vendeu mais rápido da história digital.[105] Swift lançou o segundo single do álbum, Begin Again, em outubro. Chegou ao número sete na Billboard Hot 100.[106] Outros singles lançados no álbum incluem I Knew You Were Trouble, 22, Everything Has Changed, The Last Time e Red. I Knew You Were Trouble foi um grande sucesso comercial, chegando ao número dois nos Estados Unidos.[107] O Red foi lançado em 22 de outubro de 2012,[108] incorporando novos gêneros para o Swift, como heartland rock, dubstep e dance-pop. O álbum foi um sucesso crítico e comercial e estreou no número um na Billboard 200, com vendas na primeira semana de 1,21 milhão de cópias. Isso marcou as maiores vendas de abertura em uma década nos Estados Unidos, e fez de Swift a primeira mulher a ter dois milhões de lançamentos de álbuns, um recorde reconhecido pelo Guinness Book.[109][110] A Red Tour foi de março de 2013 a junho de 2014 e arrecadou mais de US$ 150 milhões; quebrou o recorde de vendas de ingressos na China, com todos os 18 000 ingressos vendidos em 60 segundos.[111] Red ganhou vários elogios, incluindo quatro indicações ao Grammy Awards de 2014.[112] Seu single I Knew You Were Trouble ganhou o prêmio de Melhor Vídeo Feminino no MTV Video Music Awards de 2013.[113] Swift foi nomeada Melhor Artista Country Feminina no American Music Awards de 2012 e Artista do Ano na cerimônia de 2013.[114][115] Ela recebeu o prêmio Compositora/Artista da Nashville Songwriters Association pelo quinto e sexto anos consecutivos em 2012 e 2013.[116] Swift também foi homenageada pela Associação com um Pinnacle Award especial, fazendo dela a segunda recebedora do prêmio depois de Garth Brooks.[117] Durante esse período, ela teve um relacionamento de curto prazo com o cantor britânico Harry Styles.[118] Em 2013, Swift co-escreveu e coproduziu Sweeter than Fiction com Jack Antonoff para a trilha sonora do filme One Chance e recebeu uma indicação de Melhor Canção Original no 71º Golden Globe Awards.[119] Ela participou da música de Tim McGraw Highway Don't Care, com a participação também de Keith Urban. Swift tocou As Tears Go By com os The Rolling Stones em Chicago, Illinois, como parte de sua turnê 50 & Counting e disse que a banda foi uma grande influência nas perspectivas de sua carreira.[120] Ela também se juntou à Florida Georgia Line no palco durante seu show no Country Radio Seminar de 2013 para cantar Cruise.[121] Swift dublou Audrey, uma amante das árvores, no filme de animação O Lórax: Em Busca da Trúfula Perdida (2012),[122] fez uma participação especial na série de comédia New Girl (2013),[123] e teve um papel coadjuvante adaptação cinematográfica de O Dador de Memórias (2014).[124] 2014—2017: 1989 Em março de 2014, Swift se mudou para Nova York. Nessa época, ela estava trabalhando em seu quinto álbum de estúdio, 1989, com os corroteristas Antonoff, Max Martin, Shellback, Imogen Heap, Ryan Tedder e Ali Payami. Ela promoveu o álbum através de várias campanhas, inclusive convidando fãs para sessões secretas de audição de álbuns. Creditado como seu \"primeiro álbum pop oficial e documentado\", marcou uma nova fase da carreira.[125] O álbum foi lançado em 27 de outubro de 2014, com críticas positivas.[126][127] 1989 vendeu 1,28 milhão de cópias nos EUA durante a primeira semana de seu lançamento e estreou no topo da Billboard 200. Isso fez da Swift a primeira artista a ter três álbuns vendendo mais de um milhão de cópias na semana de abertura, pela qual ganhou entrou Guinness World.[128] No final de 2014, ela se tornou o primeiro ato desde os Beatles a ter quatro álbuns de estúdio consecutivos registrando pelo menos seis semanas no topo da Billboard 200. Em junho de 2017, 1989 havia vendido mais de 10 milhões de cópias em todo o mundo.[129] O single principal, Shake It Off, foi lançado em agosto de 2014 e estreou no número um na Billboard Hot 100.[130] O álbum gerou dois singles número um adicionais - Blank Space e Bad Blood (com Kendrick Lamar) -, bem como as dez primeiras entradas Style e Wildest Dreams, e outros singles Out of the Woods e New Romantics. Shake It Off, Blank Space e Bad Blood também lideraram as paradas na Austrália e no Canadá. Depois que Blank Space alcançou o número um nos EUA imediatamente após Shake It Off, Swift se tornou a primeira mulher na história do Hot 100 a ter sucesso substituindo o outro no primeiro lugar.[131] O videoclipe de Blank Space foi brevemente o vídeo mais rápido a alcançar um bilhão de visualizações no Vevo.[132] O vídeo de Bad Blood quebrou o recorde de 24 horas do Vevo e conquistou dois troféus nos MTV Video Music Awards de 2015, incluindo Video of the Year,[133] A The 1989 World Tour ocorreu de maio a dezembro de 2015, arrecadou mais de US$ 250 milhões, quebrou vários recordes de turnê e foi a turnê com maior bilheteria do ano.[134] Swift foi nomeada Mulher do Ano da Billboard em 2014, tornando-se o primeiro artista a ganhar o prêmio duas vezes. Nesse ano, ela também recebeu o Dick Clark Award for Excellence no American Music Awards. Em 2015, Swift ganhou o Brit Award para artista solo internacional feminina. Swift foi um dos oito artistas a receber um prêmio de aniversário de 50 anos no Academy of Country Music Awards de 2015. Em 2016, ela ganhou três Grammy Awards de Best Pop Vocal Album, Album of the Year e Best Music Video de Bad Blood.[135] Ela se tornou a primeira mulher e o quinto ato geral a vencer o primeiro deles duas vezes como artista principal, bem como o primeiro ato a fazê-lo com álbuns de diferentes gêneros.[136] Em 2015, Swift comprou o Samuel Goldwyn Estate em Beverly Hills, Los Angeles e posteriormente trabalhou para restaurar a casa à sua condição original. Em março de 2015, ela começou a namorar o DJ escocês e produtor musical Calvin Harris,[137] e em junho, eles foram classificados como o casal de celebridades mais bem pago no ano passado pela Forbes, com ganhos combinados de mais de US$ 146 milhões. Depois que Swift e Harris anunciaram o fim de seu relacionamento em junho de 2016, a música que eles escreveram juntos, This Is What You Came For, que contou com vocais de Rihanna, foi lançada para o sucesso internacional. Swift foi creditado inicialmente sob o pseudônimo de Nils Sjöberg.[138] No mesmo mês, Swift começou a namorar o ator inglês Tom Hiddleston, a quem conheceu no evento do Met Gala que copresidiu naquele ano; o relacionamento terminou vários meses depois. Em agosto, Swift abordou o diagnóstico de câncer de sua mãe e incentivou outras pessoas a fazer exames médicos.[139] Em 2016, a TAS Rights Management, empresa de gestão e holding de direitos de propriedade intelectual da Swift, registrou 73 marcas registradas relacionadas a Swift e aos memes da era de 1989. Em setembro, ela começou a namorar o ator britânico Joe Alwyn.[140][141] Em outubro, Little Big Town lançou Better Man, escrito exclusivamente por Swift, para seu sétimo álbum, The Breaker. A música rendeu a Swift um prêmio de Canção do Ano no 51º CMA Awards. Dois meses depois, Swift e o cantor britânico Zayn Malik lançaram juntos um single chamado I Don't Wanna Live Forever para a trilha sonora do filme Fifty Shades Darker (2017). A música alcançou o número um na Suécia e o número dois nos Estados Unidos.[142][143] No MTV Video Music Awards de 2017, a dupla ganhou o prêmio de Melhor Colaboração pelo videoclipe da música.[144] Em 2016, segundo a revista Forbes, a cantora é a famosa que mais dinheiro ganha no mundo. Taylor Swift teve em 2016, 170 milhões de dólares (154 milhões de euros) de proveitos.[145] 2017—2018: Reputation Em agosto de 2017, Swift processou e venceu um julgamento civil contra David Mueller, uma ex-personalidade de programa matutino da KYGO-FM de Denver. Quatro anos antes, Swift informara os chefes de Mueller de que ele a atacara sexualmente, apalpando-a em um evento. Depois de ser demitido, Mueller acusou Swift de mentir e processou-a por fazê-lo perder o emprego. Pouco depois, Swift contra-processou por agressão sexual. O júri rejeitou as alegações de Mueller e decidiu em favor de Swift.[146] Swift depois limpou suas contas de redes social[147] e lançou Look What You Made Me Do como o single principal de seu sexto álbum, Reputation.[148] A canção liderou as paradas na Austrália, Irlanda, Nova Zelândia, Reino Unido e Estados Unidos. Seu videoclipe ganhou mais de 43,2 milhões de visualizações durante seu primeiro dia no YouTube, quebrando o recorde do site de videoclipe mais visto em 24 horas. Em outubro, Swift lançou o segundo single do álbum, ...Ready for It?, que ficou em terceiro lugar na Austrália e em número quatro nos Estados Unidos.[149] Dois singles promocionais foram lançados do Reputation, Gorgeous e Call It What You Want. Gorgeous mais tarde se tornou o quinto single do álbum na Europa.[150] O álbum foi lançado em novembro e vendeu 1,21 milhão de cópias nos Estados Unidos, tornando-se o álbum mais vendido do país em 2017. Com essa conquista, ela se tornou o primeiro ato a ter quatro álbuns que vendem um milhão de cópias em uma semana nos EUA[151] O álbum liderou as paradas em vários países, incluindo EUA, Reino Unido, Austrália e Canadá.[152] As vendas mundiais da primeira semana totalizaram dois milhões de cópias.[153] Reputation viu Swift tomar uma nova direção, musicalmente; o álbum é conhecido por seu som mais urbano e influências de hip hop e EDM.[154] Mais tarde naquele mês, Swift tocou ... Ready for It? e Call It What You Want no Saturday Night Live.[155] End Game, com Ed Sheeran e o rapper Future, seguiu em novembro como o terceiro single e alcançou o número 18 nos EUA[156] Outros singles do álbum incluem New Year's Day, lançado exclusivamente para a rádio country, e o hit Delicate.[157] Em abril de 2018, Swift apareceu em Babe, do Sugarland.[158] Em apoio à Reputation, ela embarcou em sua aclamada pela crítica Reputation Stadium Tour de maio a novembro de 2018.[159] A turnê quebrou vários recordes de presença no local e ganhos brutos nos EUA, recebendo US$ 266,1 milhões e vendendo mais de dois milhões de ingressos. Swift quebrou seu próprio recorde para a turnê doméstica de maior bilheteria por uma mulher, bem como o recorde da turnê norte-americana de maior bilheteria da história.[160] Em todo o mundo, a turnê arrecadou US$ 345,7 milhões,[161] fazendo dela a segunda turnê de concertos com maior bilheteria do ano. No American Music Awards de 2018, Swift venceu a Turnê do Ano, Artista do Ano, Artista Feminina Pop/Rock Favorita e Álbum Pop/Rock Favorito. Com um total de 23 prêmios, ela se tornou a artista feminina mais premiada da história do AMA, um recorde anteriormente mantido por Whitney Houston.[162] 2018—2021: Lover, Folklore e Evermore Em abril de 2019, Swift lançou \"Me!\", com Brendon Urie do Panic! at the Disco como primeiro single do seu sétimo álbum de estúdio, Lover.[163] A canção debutou em cem na Billboard Hot 100 e três dias depois saltou para dois, sendo o maior salto em uma semana na história da parada.[164] O vídeo clipe quebrou o recorde da Vevo, bem como o do YouTube, de mais visualizações de um vídeo de uma cantora nas primeiras 24 horas com 65,2 milhões de visualizações.[165] No entanto, a música recebeu críticas mistas e Swift removeu uma letra \"muito difamada\" da música do álbum. Em junho, ela lançou o segundo single You Need to Calm Down que estreou e alcançou o número dois na Billboard Hot 100.[166] Em julho, ela lançou o single promocional do álbum, The Archer.[167] A faixa-título foi lançada como terceiro single do álbum, e tornou-se o seu terceiro single consecutivo a estrear no Top 10 da Hot 100.[168] Lover foi lançado em 23 de agosto de 2019 e vendeu cerca de 867 000 unidades nos Estados Unidos na primeira semana, sendo 679 000 em vendas puras, fazendo com que o álbum estreasse em primeiro lugar na Billboard 200 e tornando Swift a primeira artista feminina a ter seis álbuns vendendo mais de 500 000 cópias em uma única semana.[169] Todas as 18 faixas do álbum foram mapeadas simultaneamente nas paradas da Billboard Hot 100, quebrando recordes com mais entradas simultâneas no Hot 100 por uma artista feminina e maior quantidade de estreias simultâneas do Hot 100 por uma artista feminina.[170] Swift promoveu o álbum e seus singles em várias apresentações ao vivo. Em 1 de maio de 2019, Swift fez a primeira apresentação ao vivo do single Me! no Billboard Music Awards de 2019, com Brendon Urie, em Las Vegas, nos Estados Unidos.[171] Swift e Urie cantaram a canção novamente no final da décima sexta temporada de The Voice, em 21 de maio.[172] Swift cantou Me! solo na final da décima quarta temporada de Next Top Model Alemanha, em 22 de maio.[173] Em 24 de maio, ela apareceu no talk show britânico The Graham Norton Show, como uma convidada musical, cantando Me!.[174] Em 25 de maio, Swift cantou Me! nas quartas-de-final da oitava temporada de The Voice: la plus belle voix, a edição francesa do The Voice.[175] No MTV Video Music Awards de 2019, os vídeos de Me! e You Need to Calm Down receberam doze indicações. Me! venceu a categoria de melhores efeitos visuais e You Need to Calm Down venceu as de Vídeo do ano - tornando Swift a primeira mulher e a segunda artista geral a ganhar o prêmio por um vídeo que codirigiu - e Vídeo do Bem. Swift foi o ato de abertura na cerimônia de premiação. Até o final de 2019, Lover se tornou o álbum físico mais vendido do ano nos EUA e o álbum mais vendido por uma artista feminina em todo o mundo.[176] Swift foi nomeada a artista global mais vendida do ano pela IFPI e se tornou a primeira mulher a ganhar a honra duas vezes, tendo vencido anteriormente em 2014. Lover e seus singles receberam três indicações ao Grammy Awards de 2020. O álbum foi indicado a Melhor Álbum Vocal Pop, que é a terceira indicação consecutiva de Swift na categoria, após 1989 (2014) e Reputation (2017). You Need to Calm Down foi indicado para Melhor Desempenho Solo de Pop enquanto a faixa-título Lover foi indicada para Canção do Ano.[177] Em junho de 2019, a Big Machine Records, antiga gravadora de Swift, foi adquirida pelo gerente de talentos Scooter Braun, uma compra que incluía o domínio de seus seis primeiros álbuns de estúdio.[178] Em um post no Tumblr, Swift criticou fortemente a transação, afirmando que ela tentava comprar os álbuns há anos e descreveu Braun como um \"valentão incessante e manipulador\".[178] Em agosto, Swift anunciou planos para regravar os álbuns em novembro de 2020.[179] Em novembro, Swift disse que Scott Borchetta, fundador da Braun e da Big Machine, a impediu de apresentar suas músicas mais antigas no American Music Awards de 2019 e de usar material mais antigo em seu documentário da Netflix, Miss Americana.[180] A Big Machine negou as duas alegações e disse que eram devidos \"milhões de dólares e múltiplos ativos\" por Swift.[181][182] Em resposta, os representantes de Swift divulgaram correspondência mostrando um executivo da Big Machine se recusando a conceder licenças para o documentário e declararam que a Big Machine devia a Swift quase US$ 8 milhões em royalties não pagos.[183] Em 18 de novembro, a Big Machine divulgou um comunicado dizendo que \"concordou em conceder todas as licenças das apresentações de seus artistas para transmitir pós-show e retransmitir em plataformas mutuamente aprovadas\" para o American Music Awards, embora não tenha mencionado o Swift por nome.[184] Swift ganhou seis American Music Awards naquele ano, incluindo o Artista da Década para os anos 2010. Em abril de 2020, a Big Machine lançou o Live from Clear Channel Stripped 2008, um álbum ao vivo de uma performance de um programa de rádio de 2008. Swift disse que não autorizou o lançamento.[185] Em novembro de 2019, Swift foi incluída na lista dos Maiores Artistas de Todos os Tempos da Billboard no número oito, a colocação mais alta de um ato que estreou no século XXI.[186] Nesse mesmo mês lançou uma música original que escreveu com Andrew Lloyd Webber intitulada Beautiful Ghosts para o filme Cats (2019).[187] Em dezembro, ela compôs, gravou e lançou um single de Natal, Christmas Tree Farm,[188] e atuou como Bombalurina na adaptação cinematográfica do musical Cats, de Lloyd Webber. Embora os críticos tenham analisado o filme negativamente, muitos observaram o breve papel de Swift como saldo positivo do filme.[189] Em 23 de janeiro de 2020, o documentário Miss Americana estreou no Festival Sundance de Cinema de 2020 e foi lançado na Netflix em 31 de janeiro, com críticas positivas.[190][191] A obra inclui a música Only the Young, que Swift escreveu após as eleições estadunidenses de 2018.[192] No mesmo mês, ela lançou uma versão ao vivo da música The Man e seu videoclipe.[193] Lover Fest, a turnê de Swift em apoio ao álbum, foi adiada para 2021 devido à pandemia de COVID-19.[194] Ela tocou Soon You'll Get Better pela primeira vez como parte do concerto on-line com benefícios de One World: Together at Home. As filmagens do concerto City of Lover de 2019 da Swift em Paris foram ao ar pela ABC em 17 de maio de 2020 e foram disponibilizadas para transmissão no Hulu e Disney+ no dia seguinte. Swift também lançou versões ao vivo das faixas do álbum Lover que ela apresentou no único show em Paris após a estreia do especial de televisão.[195] Em 2020, Swift lançou dois álbuns surpresa, sem focar muito em suas promoções. O primeiro, seu oitavo álbum de estúdio Folklore, foi lançado em 24 de julho. O segundo, seu nono álbum de estúdio Evermore, foi lançado em 11 de dezembro. Swift escreveu e gravou os álbuns enquanto estava isolada durante a pandemia de COVID-19, trabalhando com os produtores Jack Antonoff e Aaron Dessner, membro da banda The National. Ambos os álbuns incluem colaborações com Bon Iver, e Evermore apresenta colaborações com The National e Haim. O namorado de Swift, Joe Alwyn, co-escreveu e coproduziu algumas músicas de ambos os álbuns sob o pseudônimo de William Bowery. A produção do Folklore foi discutida no documentário Folklore: The Long Pond Studio Sessions, dirigido por Swift e lançado em 25 de novembro. Descritos por Swift e Dessner como \"gravações irmãs\", ambos os álbuns abraçam o folk indie e o rock alternativo, deixando de lado os lançamentos pop otimistas anteriores da cantora. Nos EUA, Folklore e Evermore contaram com três singles cada um - um para rádio mainstream, um para rádio country e um para a rádio triple A. Os singles, respectivamente, foram Cardigan, Betty, Exile (com Bon Iver); e Willow, No Body, No Crime (com Haim) e Coney Island (com The National). Na Alemanha, Folklore foi apoiado por outro single, The 1. Os singles principais de cada álbum, Cardigan e Willow, estrearam no topo da Billboard Hot 100 na mesma semana em que seus respectivos álbuns estrearam no topo da Billboard 200, fazendo com que Swift se tornasse a primeira artista a estrear no topo das paradas de singles e álbuns dos EUA simultaneamente. Cada álbum vendeu mais de um milhão de unidades em todo o mundo em sua primeira semana, com Folklore vendendo dois milhões. Folklore quebrou o Recorde Mundial do Guinness para o maior número de streams em um álbum no primeiro dia de uma artista feminina no Spotify, com mais de 80,6 milhõ"
}