{
  "url": "https://superuser.com/questions/1255553/how-to-enable-replace-as-you-type-on-windows-system-wide",
  "title": "How to enable Replace-as-you-Type on Windows (system-wide) - Super User",
  "text": "I use the autocorrect feature in Microsoft Office applications for this purpose. You can go to the autocorrect settings in Word and type Replace: \"\\pi\" with \"π\". Once defined, these shortcuts will work across the different Office applications including Outlook, PowerPoint, and Excel. In order to share this with other users, I've created a Word document with a macro for defining autocorrect entries, and the list of my shortcuts in the document. This is the macro defined in the Word document: Sub DefineNewAutocorrectEntry() ' ' This macro takes text on the current line in the form ' string c ' where string is a shortcut string and c is a single special character, ' preceeded by a single space and followed by a newline ' place the cursor at the beginning of the line and press ctrl-K ' (keyboard shortcut to this macro) ' the string is placed in the autocorrect table and the cursor is advanced ' to the start of the next line; pressing ctrl-K repeatedly steps through ' the lines to define all the strings ' Selection.EndKey Unit:=wdLine, Extend:=wdExtend Selection.Copy L = Len(Selection) strname = Left(Selection, L - 3) strval = Mid(Selection, L - 1, 1) AutoCorrect.Entries.Add Name:=strname, Value:=strval Selection.HomeKey Unit:=wdLine Selection.MoveDown Unit:=wdLine, Count:=1 End Sub And here is the Word document itself (to use it as described, you need to copy the macro to your document using the Visual Basic editor and define the CTRL-K keyboard shortcut to run it): This document defines typing shortcuts for commonly used symbols such as greek letters (upper and lower case), math symbols, and other miscellaneous symbols. For example, to get a lower case greek letter δ type “\\delta” and for upper case Δ type “_\\delta”. This file contains a macro called “DefineNewAutocorrectEntry” mapped to the keyboard shortcut “Ctrl-K” that takes a line of text in the form below and defines an autocorrect entry with the first part as the string typed and the second part as the special character with which it is replaced. To install the shortcuts, put your cursor at the beginning of the first line and press Ctrl-K. That line’s shortcut will be installed and the cursor will move to the next line. All the shortcuts can be defined by repeatedly pressing Ctrl-K (and if you choose not to define a shortcut, just cursor down to the next line). Once the typing shortcuts are defined, they will be available in Word, Powerpoint, Excel and Outlook. If you ever decide you don’t want them anymore, you can go to Tools->Autocorrect Options and just delete them. --- — \\- – \\minus – \\degrees ° \\infinity ∞ \\times × \\dot ∙ \\alpha α \\beta β \\gamma γ \\delta δ \\epsilon ε \\zeta ζ \\eta η \\theta θ \\iota ι \\kappa κ \\lambda λ \\mu μ \\nu ν \\xi ξ \\pi π \\rho ρ \\sigma σ \\tau τ \\upsilon υ \\phi φ \\chi χ \\psi ψ \\omega ω \\_gamma Γ \\_delta Δ \\_theta Θ \\_lambda Λ \\_xi Ξ \\_pi Π \\_sigma Σ \\_phi Φ \\_psi Ψ \\_omega Ω \\partial ∂ \\sqrt √ \\integral ∫ \\ne ≠ \\pm ± \\ge ≥ \\le ≤ You can add or delete from this list as your heart desires."
}