{
  "url": "https://en.wikipedia.org/wiki/Euro",
  "title": "Euro - Wikipedia",
  "text": "Euro The euro (symbol: €; currency code: EUR) is the official currency of 21 of the 27 member states of the European Union. This group of states is officially known as the euro area or, more commonly, the eurozone. The euro is divided into 100 euro cents.[7][8] The currency is also used officially by the institutions of the European Union, by four European microstates that are not EU members,[8] by one British Overseas Territory, as well as unilaterally by two European states that are not EU members. Outside Europe, a number of special territories of EU members also use the euro as their currency. The euro is used by 358 million people in the eurozone,[9][10] in addition to those living in states and territories where the euro is also the sole official currency. Furthermore, over 200 million people worldwide use currencies pegged to the euro. It is the second-largest reserve currency as well as the second-most traded currency in the world after the United States dollar.[11][12][13] As of December 2019,[update] with more than €1.3 trillion in circulation, the euro has one of the highest combined values of banknotes and coins in circulation in the world.[14][15] The name euro was officially adopted on 16 December 1995 in Madrid.[16] The euro was introduced to world financial markets as an accounting currency on 1 January 1999, replacing the former European Currency Unit (ECU) at a ratio of 1:1. Physical euro coins and banknotes entered into circulation on 1 January 2002, making it the day-to-day operating currency of its original members, and by March 2002 it had completely replaced the former currencies.[17] Between December 1999 and December 2002, the euro traded below parity with the US dollar, but it has since traded near or above parity with the US dollar. On 13 July 2022, the two currencies briefly hit parity for the first time in nearly two decades, due in part to the Russian invasion of Ukraine.[18] In the ten years ending 30 September 2025, the rate has averaged at about $1.00:€0.92.[19] Characteristics [edit]Administration [edit]The euro is managed and administered by the European Central Bank and the Eurosystem, composed of the central banks of the eurozone countries.[20] As an independent central bank, the ECB has sole authority to set monetary policy.[21] The Eurosystem participates in the printing, minting and distribution of euro banknotes and coins in all member states,[22] and the operation of the eurozone payment systems.[23] Through their ratification of the 1992 Maastricht Treaty (or subsequent treaties of accession), most EU member states committed to adopt the euro upon meeting certain monetary and budgetary convergence criteria, although not all participating states have done so. Denmark has negotiated exemptions,[24] while Sweden (which joined the EU in 1995, after the Maastricht Treaty was signed) turned down the euro in a 2003 non-binding referendum, and has circumvented its commitment to adopt the euro by not meeting the monetary and budgetary requirements. All nations that have joined the EU since 1993 have pledged to adopt the euro in due course. The Maastricht Treaty was amended by the 2001 Treaty of Nice, which closed the gaps and loopholes in the Maastricht and Rome Treaties.[25] Countries that use the euro [edit]The euro is the official currency of 44 countries and territories: Eurozone members [edit]The 21 participating members are: Special territories of members of the European Economic Area [edit]Special Autonomous Territories: Other users [edit]Microstates with a monetary agreement: Unilateral adopters: EU members not using the euro [edit] Committed to adopt the euro [edit]The following five EU member states, representing almost 90 million people, committed themselves in their respective Treaty of Accession to adopt the euro. However they do not have a deadline to do so and can delay the process by deliberately not complying with the convergence criteria (such as by not meeting the convergence criteria to join ERM II). Opt-outs [edit]The Maastricht Treaty of 1992 included protocols on Denmark and the United Kingdom, giving them opt-outs with the right to decide if and when they would adopt the euro.[33] - Denmark: The government of Denmark negotiated an opt-out to retain usage of the Danish krone, but the currency is pegged to the euro via the ERM II, the European Union's exchange rate mechanism. - United Kingdom: Prior to its withdrawal from the European Union in 2020, the United Kingdom negotiated an opt-out to retain usage of the pound sterling. Coins and banknotes [edit]Coins [edit]The euro is divided into 100 cents (also referred to as euro cents, especially when distinguishing them from other currencies, and referred to as such on the common side of all cent coins). In Community legislative acts the plural forms of euro and cent are spelled without the s, notwithstanding normal English usage.[34][35] Otherwise, normal English plurals are used,[36] with many local variations such as centime in France. All circulating coins have a common side showing the denomination or value and a map in the background. Due to the linguistic plurality in the European Union, the Latin alphabet version of euro is used (as opposed to the less common Greek or Cyrillic) and Arabic numerals (other text is used on national sides in national languages, but other text on the common side is avoided). For the denominations except the 1-, 2- and 5-cent coins, the map only showed the 15 member states of the union as of 2002. Beginning in 2007 or 2008 (depending on the country), the old map was replaced by a map of Europe also showing countries outside the EU.[37] The 1-, 2- and 5-cent coins, however, keep their old design, showing a geographical map of Europe with the EU member states as of 2002, raised somewhat above the rest of the map. All common sides were designed by Luc Luycx. The coins also have a national side showing an image specifically chosen by the country that issued the coin. Euro coins from any member state may be freely used in any nation that has adopted the euro. The coins are issued in denominations of €2, €1, 50c, 20c, 10c, 5c, 2c, and 1c. To avoid the use of the two smallest coins, some cash transactions are rounded to the nearest five cents in the Netherlands and Ireland[38][39] (by voluntary agreement) and in Finland and Italy (by law).[40] This practice is discouraged by the commission, as is the practice of certain shops of refusing to accept high-value euro notes.[41] Commemorative coins with €2 face value have been issued with changes to the design of the national side of the coin. These include both commonly issued coins, such as the €2 commemorative coin for the fiftieth anniversary of the signing of the Treaty of Rome, and nationally issued coins, such as the coin to commemorate the 2004 Summer Olympics issued by Greece. These coins are legal tender throughout the eurozone. Collector coins with various other denominations have been issued as well, but these are not intended for general circulation, and they are legal tender only in the member state that issued them.[42] Vatican euro coins with images of Pope Francis and Pope Benedict XVI Coin minting [edit]A number of institutions are authorised to mint euro coins: - Bayerisches Hauptmünzamt (Mint mark: D) - Currency Centre - Real Casa de la Moneda - Hamburgische Münze (J) - Hrvatska kovnica novca - Banknote and Securities Printing Foundation - Imprensa Nacional-Casa da Moeda - Istituto Poligrafico e Zecca dello Stato - Koninklijke Munt van België/Monnaie Royale de Belgique - Bulgarian Mint - Koninklijke Nederlandse Munt - Lietuvos monetų kalykla - Mincovňa Kremnica - Monnaie de Paris - Münze Österreich - Suomen Rahapaja/Myntverket i Finland - Staatliche Münze Berlin (A) - Staatliche Münzen Baden-Württemberg (F): Stuttgart, (G): Karlsruhe Banknotes [edit]The design for the euro banknotes has common designs on both sides. The design was created by the Austrian designer Robert Kalina.[43] Notes are issued in €500, €200, €100, €50, €20, €10, and €5. Each banknote has its own colour and is dedicated to an artistic period of European architecture. The front of the note features windows or gateways while the back has bridges, symbolising links between states in the union and with the future. While the designs are supposed to be devoid of any identifiable characteristics, the initial designs by Robert Kalina were of specific bridges, including the Rialto and the Pont de Neuilly, and were subsequently rendered more generic; the final designs still bear very close similarities to their specific prototypes; thus they are not truly generic. The monuments looked similar enough to different national monuments to please everyone.[44] The Europa series, or second series, consists of six denominations and no longer includes the €500 with issuance discontinued as of 27 April 2019.[45] However, both the first and the second series of euro banknotes, including the €500, remain legal tender throughout the euro area.[45] In December 2021, the ECB announced its plans to redesign euro banknotes by 2024. A theme advisory group, made up of one member from each euro area country, was selected to submit theme proposals to the ECB. The proposals will be voted on by the public; a design competition will also be held.[46] Issuing modalities for banknotes [edit]Since 1 January 2002, the national central banks (NCBs) and the ECB have issued euro banknotes on a joint basis.[47] Eurosystem NCBs are required to accept euro banknotes put into circulation by other Eurosystem members and these banknotes are not repatriated. The ECB issues 8% of the total value of banknotes issued by the Eurosystem.[47] In practice, the ECB's banknotes are put into circulation by the NCBs, thereby incurring matching liabilities vis-à-vis the ECB. These liabilities carry interest at the main refinancing rate of the ECB. The other 92% of euro banknotes are issued by the NCBs in proportion to their respective shares of the ECB capital key,[47] calculated using national share of European Union (EU) population and national share of EU GDP, equally weighted.[48] Banknote printing [edit]Member states authorised to print or to commission bank note printing: - Istituto Poligrafico e Zecca dello Stato - Banco de Portugal - Bank of Greece - Bank of France - Bulgarian National Bank - Bundesdruckerei - Central Bank of Ireland - De La Rue - Real Casa de la Moneda - Oberthur Fiduciaire - Giesecke+Devrient - Royal Joh. Enschedé - National Bank of Belgium - Oesterreichische Nationalbank - Setec Oy Payments clearing, electronic funds transfer [edit]Capital within the EU may be transferred in any amount from one state to another. All intra-Union transfers in euro are treated as domestic transactions and bear the corresponding domestic transfer costs.[55] This includes all member states of the EU, even those outside the eurozone providing the transactions are carried out in euro.[56] Credit/debit card charging and ATM withdrawals within the eurozone are also treated as domestic transactions; however paper-based payment orders, like cheques, have not been standardised so these are still domestic-based. The ECB has also set up a clearing system, T2 since March 2023, for large euro transactions.[57] History [edit]Introduction [edit]The euro was established by the provisions in the 1992 Maastricht Treaty.[59][60] To participate in the currency, member states are meant to meet strict criteria, such as a budget deficit of less than 3% of their GDP, a debt ratio of less than 60% of GDP (both of which were ultimately widely flouted after introduction), low inflation, and interest rates close to the EU average.[61][62] In the Maastricht Treaty, the United Kingdom and Denmark were granted exemptions per their request from moving to the stage of monetary union which resulted in the introduction of the euro (see also United Kingdom and the euro).[63][64] The name \"euro\" was officially adopted in Madrid on 16 December 1995.[16] Belgian Esperantist Germain Pirlot, a former teacher of French and history, is credited with naming the new currency by sending a letter to then President of the European Commission, Jacques Santer, suggesting the name \"euro\" on 4 August 1995.[65] Due to differences in national conventions for rounding and significant digits, all conversion between the national currencies had to be carried out using the process of triangulation via the euro.[66] The definitive values of one euro in terms of the exchange rates at which the currency entered the euro are shown in the table. The rates were determined by the Council of the European Union,[e] based on a recommendation from the European Commission based on the market rates on 31 December 1998. They were set so that one European Currency Unit (ECU) would equal one euro. The European Currency Unit was an accounting unit used by the EU, based on the currencies of the member states; it was not a currency in its own right. They could not be set earlier, because the ECU depended on the closing exchange rate of the non-euro currencies (principally pound sterling) that day. The procedure used to fix the conversion rate between the Greek drachma and the euro was different since the euro by then was already two years old. While the conversion rates for the initial eleven currencies were determined only hours before the euro was introduced, the conversion rate for the Greek drachma was fixed several months beforehand.[f] The currency was introduced in non-physical form (traveller's cheques, electronic transfers, banking, etc.) at midnight on 1 January 1999, when the national currencies of participating countries (the eurozone) ceased to exist independently. Their exchange rates were locked at fixed rates against each other. The euro thus became the successor to the European Currency Unit (ECU). The notes and coins for the old currencies, however, continued to be used as legal tender until new euro notes and coins were introduced on 1 January 2002. The changeover period during which the former currencies' notes and coins were exchanged for those of the euro lasted about two months, until 28 February 2002. The official date on which the national currencies ceased to be legal tender varied from member state to member state. The earliest date was in Germany, where the mark officially ceased to be legal tender on 31 December 2001, though the exchange period lasted for two months more. Even after the old currencies ceased to be legal tender, they continued to be accepted by national central banks for periods ranging from several years to indefinitely (the latter for Austria, Germany, Ireland, Estonia and Latvia in banknotes and coins, and for Belgium, Luxembourg, Slovenia and Slovakia in banknotes only). The earliest coins to become non-convertible were the Portuguese escudos, which ceased to have monetary value after 31 December 2002, although banknotes remained exchangeable until 2022. Currency sign [edit]A special euro currency sign (€) was designed after a public survey had narrowed ten of the original thirty proposals down to two. The President of the European Commission at the time (Jacques Santer) and the European Commissioner with responsibility for the euro (Yves-Thibault de Silguy) then chose the winning design.[67] Regarding the symbol, the European Commission stated on behalf of the European Union: The symbol € is based on the Greek letter epsilon (Є), with the first letter in the word \"Europe\" and with 2 parallel lines signifying stability. The European Commission also specified a euro logo with exact proportions.[68] Placement of the currency sign relative to the numeric amount varies from state to state, but for texts in English published by EU institutions, the symbol (or the ISO-standard \"EUR\") should precede the amount.[69] Eurozone crisis [edit]Following the 2008 financial crisis, fears of a sovereign default developed in 2009 among investors concerning some European states, with the situation becoming particularly tense in early 2010.[70][71] Greece was most acutely affected, but fellow Eurozone members Cyprus, Ireland, Italy, Portugal, and Spain were also significantly affected.[72][73] All these countries used EU funds except Italy, which is a major donor to the EFSF.[74] To be included in the eurozone, countries had to fulfil certain convergence criteria, but the meaningfulness of such criteria was diminished by the fact it was not enforced with the same level of strictness among countries.[75] According to the Economist Intelligence Unit in 2011, \"[I]f the [euro area] is treated as a single entity, its [economic and fiscal] position looks no worse and in some respects, rather better than that of the US or the UK\" and the budget deficit for the euro area as a whole is much lower and the euro area's government debt/GDP ratio of 86% in 2010 was about the same level as that of the United States. \"Moreover\", they write, \"private-sector indebtedness across the euro area as a whole is markedly lower than in the highly leveraged Anglo-Saxon economies\". The authors conclude that the crisis \"is as much political as economic\" and the result of the fact that the euro area lacks the support of \"institutional paraphernalia (and mutual bonds of solidarity) of a state\".[76] The crisis continued with S&P downgrading the credit rating of nine euro-area countries, including France, then downgrading the entire European Financial Stability Facility (EFSF) fund.[77] A historical parallel – to 1931 when Germany was burdened with debt, unemployment and austerity while France and the United States were relatively strong creditors – gained attention in summer 2012[78] even as Germany received a debt-rating warning of its own.[79][80] Direct and indirect usage [edit]Agreed direct usage with minting rights [edit]The euro is the sole currency of 21 EU member states: Austria, Bulgaria, Belgium, Croatia, Cyprus, Estonia, Finland, France, Germany, Greece, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, the Netherlands, Portugal, Slovakia, Slovenia, and Spain. These countries constitute the \"eurozone\", some 347 million people in total as of 2023[update].[81] According to bilateral agreements with the EU, the euro has also been designated as the sole and official currency in a further four European microstates awarded minting rights (Andorra, Monaco, San Marino and the Vatican City). All other EU member states (except Denmark, which has an opt-out), and any potential future members, are obliged to adopt the euro when economic conditions permit. Agreed direct usage without minting rights [edit]The euro is also the sole currency in three overseas territories of France that are not themselves part of the EU, namely Saint Barthélemy, Saint Pierre and Miquelon, and the French Southern and Antarctic Lands, as well as in the British Overseas Territory of Akrotiri and Dhekelia.[82] Unilateral direct usage [edit]The euro has been adopted unilaterally as the sole currency of Montenegro and Kosovo. It has also been used as a foreign trading currency in Cuba since 1998,[83] Syria since 2006,[84] and Venezuela since 2018.[85] In 2009, Zimbabwe abandoned its local currency and introduced major global convertible currencies instead, including the euro and the United States dollar. The direct usage of the euro outside of the official framework of the EU affects nearly 3 million people.[86] Currencies pegged to the euro [edit]Outside the eurozone, one EU member state has a currency that is pegged to the euro, which is a precondition to joining the eurozone. The Danish krone is pegged through to its participation in the ERM II. On the other hand, the currencies of countries and territories that were pegged to the European currencies that disappeared with the creation of the euro were now pegged to it. Currently, they are as follows: - Bosnia and Herzegovina: The Bosnia and Herzegovina convertible mark was pegged to the Deutsche mark. Currently, it has a fixed exchange rate of 1.95583 convertible marks = 1 euro. - Cape Verde: The Cape Verdean escudo was pegged to the Portuguese escudo. Currently, it has a fixed exchange rate of 110.625 Cape Verdean escudos = 1 euro. - Comoros: The Comorian franc was pegged to the French franc. Currently, it has a fixed exchange rate of 491.96775 Comorian francs = 1 euro. - Economic and Monetary Community of Central Africa (Cameroon, the Central African Republic, Chad, Equatorial Guinea, Gabon and the Republic of the Congo): the Central African CFA franc was pegged to the French franc. It currently has a fixed exchange rate of 655.957 Central African CFA francs = 1 euro. - North Macedonia: The Macedonian denar was pegged to the Deutsche mark. It is currently pegged to the euro. Its exchange rate remains stable at around 61 Macedonian denars to 1 euro. - West African Economic and Monetary Union (Benin, Burkina Faso, Guinea-Bissau, Ivory Coast, Mali, Niger, Senegal, and Togo): The West African CFA franc was pegged to the French franc. It currently has a fixed exchange rate of 655.957 West African CFA francs = 1 euro. - The French overseas collectivities of French Polynesia and Wallis and Futuna as well as the special collectivity of New Caledonia: the CFP franc was pegged to the French franc. It currently has a fixed exchange rate of 1000 CFP francs = 8.38 euros, which makes 119.331742 CFP francs ≈ 1 euro. Furthermore, the currency of São Tomé and Príncipe (the São Tomé and Príncipe dobra) is pegged to the euro following an agreement signed with Portugal in 2009 and which came into effect on 1 January 2010.[87] It has a fixed exchange rate of 24.5 São Tomé and Príncipe dobras = 1 euro. Of the currencies mentioned, the Bosnia and Herzegovina convertible mark maintains a fixed exchange rate through the currency board system; the Central African CFA franc, the West African CFA franc, the CFP franc, the Cape Verdean escudo, the Comorian franc, and the São Tomé and Príncipe dobra maintain a conventional fixed exchange rate; and the Macedonian denar uses a stabilized arrangement. Additionally, the currency of Morocco, the Moroccan dirham, is pegged to the euro through a basket of currencies. Other countries that, as of December 2024, have exchange rate regimes linked to the euro are Romania, Serbia, Albania, Singapore, Botswana, Tunisia, Samoa, Fiji, Libya, Kuwait, Syria, China and Vanuatu.[88][89][90][91] Pegging a country's currency to a major currency is regarded as a safety measure, especially for currencies of areas with weak economies, as the euro is seen as a stable currency, prevents runaway inflation, and encourages foreign investment due to its stability. In total, as of 2013[update], 182 million people in Africa use a currency pegged to the euro, 27 million people outside the eurozone in Europe, and another 545,000 people on Pacific islands.[81] Since 2005, stamps issued by the Sovereign Military Order of Malta have been denominated in euros, although the Order's official currency remains the Maltese scudo.[92] The Maltese scudo itself is pegged to the euro and is only recognised as legal tender within the Order. Countries and territories that have their currencies pegged to the euro, by continent: Europe - Bosnia and Herzegovina (Bosnia and Herzegovina convertible mark, BAM) - Denmark (Danish krone, DKK) - North Macedonia (Macedonian denar, MKD) - Sovereign Military Order of Malta (Maltese scudo)[93] Oceania - French Polynesia (CFP franc, XPF) - New Caledonia (CFP franc) - Wallis and Futuna (CFP franc) Africa - Benin (West African CFA franc, XOF) - Burkina Faso (West African CFA franc) - Cameroon (Central African CFA franc, XAF) - Cape Verde (Cape Verdean escudo, CVE) - Central African Republic (Central African CFA franc) - Chad (Central African CFA franc) - Comoros (Comorian franc, KMF) - Equatorial Guinea (Central African CFA franc) - Gabon (Central African CFA franc) - Guinea-Bissau (West African CFA franc) - Ivory Coast (West African CFA franc) - Mali (West African CFA franc) - Morocco (Moroccan dirham, MAD) (through a basket of currencies) - Niger (West African CFA franc) - Republic of the Congo (Central African CFA franc) - São Tomé and Príncipe (São Tomé and Príncipe dobra, STN) - Senegal (West African CFA franc) - Togo (West African CFA franc) Use as reserve currency [edit]Since its introduction in 1999, the euro has been the second most widely held international reserve currency after the U.S. dollar. The share of the euro as a reserve currency increased from 18% in 1999 to 27% in 2008. Over this period, the share held in U.S. dollar fell from 71% to 64% and that held in RMB fell from 6.4% to 3.3%. The euro inherited and built on the status of the Deutsche Mark as the second most important reserve currency. The euro remains underweight as a reserve currency in advanced economies while overweight in emerging and developing economies: according to the International Monetary Fund[94] the total of euro held as a reserve in the world at the end of 2008 was equal to $1.1 trillion or €850 billion, with a share of 22% of all currency reserves in advanced economies, but a total of 31% of all currency reserves in emerging and developing economies. The possibility of the euro becoming the first international reserve currency has been debated among economists.[95] Former Federal Reserve Chairman Alan Greenspan gave his opinion in September 2007 that it was \"absolutely conceivable that the euro will replace the US dollar as reserve currency, or will be traded as an equally important reserve currency\".[96] In contrast to Greenspan's 2007 assessment, the euro's increase in the share of the worldwide currency reserve basket has slowed considerably since 2007 and since the beginning of the Great Recession and Euro area crisis.[94] Economics [edit]Optimal currency area [edit]In economics, an optimum currency area, or region (OCA or OCR), is a geographical region in which it would maximise economic efficiency to have the entire region share a single currency. There are two models, both proposed by Robert Mundell: the stationary expectations model and the international risk sharing model. Mundell himself advocates the international risk sharing model and thus concludes in favour of the euro.[97] However, even before the creation of the single currency, there were concerns over diverging economies. Before the late-2000s recession it was considered unlikely that a state would leave the euro or the whole zone would collapse.[98] However the Greek government-debt crisis led to former British Foreign Secretary Jack Straw claiming the eurozone could not last in its current form.[99] Part of the problem seems to be the rules that were created when the euro was set up. John Lanchester, writing for The New Yorker, explains it: The guiding principle of the currency, which opened for business in 1999, were supposed to be a set of rules to limit a country's annual deficit to three per cent of gross domestic product, and the total accumulated debt to sixty per cent of G.D.P. It was a nice idea, but by 2004 the two biggest economies in the euro zone, Germany and France, had broken the rules for three years in a row.[100] Increasing business cycle divergence across the Eurozone over the last decades implies a decreasing optimum currency area.[101] Transaction costs and risks [edit]The most obvious benefit of adopting a single currency is to remove the cost of exchanging currency, theoretically allowing businesses and individuals to consummate previously unprofitable trades. For consumers, banks in the eurozone must charge the same for intra-member cross-border transactions as purely domestic transactions for electronic payments (e.g., credit cards, debit cards and cash machine withdrawals). Financial markets on the continent are expected to be far more liquid and flexible than they were in the past. The reduction in cross-border transaction costs will allow larger banking firms to provide a wider array of banking services that can compete across and beyond the eurozone. However, although transaction costs were reduced, some studies have shown that risk aversion has increased during the last 40 years in the Eurozone.[102] Price parity [edit]Another effect of the common European currency is that differences in prices—in particular in price levels—should decrease because of the law of one price. Differences in prices can trigger arbitrage, i.e., speculative trade in a commodity across borders purely to exploit the price differential. Therefore, prices on commonly traded goods are likely to converge, causing inflation in some regions and deflation in others during the transition. Some evidence of this has been observed in specific eurozone markets.[103] Macroeconomic stability [edit]Before the introduction of the euro, some countries had successfully contained inflation, which was then seen as a major economic problem, by establishing largely independent central banks. One such bank was the Bundesbank in Germany; the European Central Bank was modelled on the Bundesbank.[104] The euro has come under criticism due to its regulation, lack of flexibility and rigidity towards sharing member states on issues such as nominal interest rates.[105] Many national and corporate bonds denominated in euro are significantly more liquid and have lower interest rates than was historically the case when denominated in national currencies. While increased liquidity may lower the nominal interest rate on the bond, denominating the bond in a currency with low levels of inflation arguably plays a much larger role. A credible commitment to low levels of inflation and a stable debt reduces the risk that the value of the debt will be eroded by higher levels of inflation or default in the future, allowing debt to be issued at a lower nominal interest rate. There is also a cost in structurally keeping inflation lower than in the United States, United Kingdom, and China. The result is that seen from those countries, the euro has become expensive, making European products increasingly expensive for its largest importers; hence export from the eurozone becomes more difficult. In general, those in Europe who own large amounts of euro are served by high stability and low inflation. A monetary union means states in that union lose the main mechanism of recovery of their international competitiveness by weakening (depreciating) their currency. When wages become too high compared to productivity in the exports sector, then these exports become more expensive and they are crowded out from the market within a country and abroad. This drives the fall of employment and output in the exports sector and fall of trade and current account balances. Fall of output and employment in the tradable goods sector may be offset by the growth of non-exports sectors, especially in construction and services. Increased purchases abroad and negative current account balances can be financed without a problem as long as credit is cheap.[106] The need to finance trade deficit weakens currency, making exports automatically more attractive in a country and abroad. A state in a monetary union cannot use weakening of currency to recover its international competitiveness. To achieve this a state has to reduce prices, including wages (deflation). This could result in high unemployment and lower incomes as it was during the euro area crisis.[107] Trade [edit]The euro increased price transparency and stimulated cross-border trade.[108] A 2009 consensus from the studies of the introduction of the euro concluded that it has increased trade within the eurozone by 5% to 10%,[109] and a meta-analysis of all available studies on the effect of introduction of the euro on increased trade suggests that the prevalence of positive estimates is caused by publication bias and that the underlying effect may be negligible.[110] Although a more recent meta-analysis shows that publication bias decreases over time and that there are positive trade effects from the introduction of the euro, as long as results from before 2010 are taken into account. This may be because of the inclusion of the 2008 financial crisis and ongoing integration within the EU.[111] Furthermore, older studies based on certain methods of analysis of main trends reflecting general cohesion policies in Europe that started before, and continue after implementing the common currency find no effect on trade.[112][113] These results suggest that other policies aimed at European integration might be the source of observed increase in trade. According to Barry Eichengreen, studies disagree on the magnitude of the effect of the euro on trade, but they agree that it did have an effect.[108] Investment [edit]Physical investment seems to have increased by 5% in the eurozone due to the introduction.[114] Regarding foreign direct investment, a study found that the intra-eurozone FDI stocks have increased by about 20% during the first four years of the EMU.[115] Concerning the effect on corporate investment, there is evidence that the introduction of the euro has resulted in an increase in investment rates and that it has made it easier for firms to access financing in Europe. The euro has most specifically stimulated investment in companies that come from countries that previously had weak currencies. A study found that the introduction of the euro accounts for 22% of the investment rate after 1998 in countries that previously had a weak currency.[116] Inflation [edit]The introduction of the euro has led to extensive discussion about its possible effect on inflation. In the short term, there was a widespread impression in the population of the eurozone that the introduction of the euro had led to an increase in prices, but this impression was not confirmed by general indices of inflation and other studies.[117][118] A study of this paradox found that this was due to an asymmetric effect of the introduction of the euro on prices: while it had no effect on most goods, it had an effect on cheap goods which have seen their price round up after the introduction of the euro. The study found that consumers based their beliefs on inflation of those cheap goods which are frequently purchased.[119] It has also been suggested that the jump in small prices may be because prior to the introduction, retailers made fewer upward adjustments and waited for the introduction of the euro to do so.[120] Based on the introduction of the euro as the official currency in Croatia in 2023, the ECB argues that inflation due to a change of currency is a one-time effect of limited impact.[121] Exchange rate risk [edit]One of the advantages of the adoption of a common currency is the reduction of the risk associated with changes in currency exchange rates.[108] It has been found that the introduction of the euro created \"significant reductions in market risk exposures for nonfinancial firms both in and outside Europe\".[122] These reductions in market risk \"were concentrated in firms domiciled in the eurozone and in non-euro firms with a high fraction of foreign sales or assets in Europe\". Financial integration [edit]The introduction of the euro increased financial integration within Europe, which helped stimulate growth of a European securities market (bond markets are characterized by economies of scale dynamics).[108] According to a study on this question, it has \"significantly reshaped the European financial system, especially with respect to the securities markets [...] However, the real and policy barriers to integration in the retail and corporate banking sectors remain significant, even if the wholesale end of banking has been largely integrated.\"[123] Specifically, the euro has significantly decreased the cost of trade in bonds, equity, and banking assets within the eurozone.[124] On a global level, there is evidence that the introduction of the euro has led to an integration in terms of investment in bond portfolios, with eurozone countries lending and borrowing more between each other than with other countries.[125] Financial integration made it cheaper for European companies to borrow.[108] Banks, firms and households could also invest more easily outside of their own country, thus creating greater international risk-sharing.[108] Effect on interest rates [edit]As of January 2014, and since the introduction of the euro, interest rates of most member countries (particularly those with a weak currency) have decreased. Some of these countries had the most serious sovereign financing problems. The effect of declining interest rates, combined with excess liquidity continually provided by the ECB, made it easier for banks within the countries in which interest rates fell the most, and their linked sovereigns, to borrow significant amounts (above the 3% of GDP budget deficit imposed on the eurozone initially) and significantly inflate their public and private debt levels.[126] Following the 2008 financial crisis, governments in these countries found it necessary to bail out or nationalise their privately held banks to prevent systemic failure of the banking system when underlying hard or financial asset values were found to be grossly inflated and sometimes so nearly worthless there was no liquid market for them.[127] This further increased the already high levels of public debt to a level the markets began to consider unsustainable, via increasing government bond interest rates, leading to the euro area crisis. Price convergence [edit]The evidence on the convergence of prices in the eurozone with the introduction of the euro is mixed. Several studies failed to find any evidence of convergence following the introduction of the euro after a phase of convergence in the early 1990s.[128][129] Other studies have found evidence of price convergence,[130][131] in particular for cars.[132] A possible reason for the divergence between the different studies is that the processes of convergence may not have been linear, slowing down substantially between 2000 and 2003, and resurfacing after 2003 as suggested by a recent study (2009).[133] Tourism [edit]A study suggests that the introduction of the euro has had a positive effect on the amount of tourist travel within the EMU, with an increase of 6.5%.[134] Exchange rates [edit]Flexible exchange rates [edit]The ECB targets interest rates rather than exchange rates and in general, does not intervene on the foreign exchange rate markets. This is because of the implications of the Mundell–Fleming model, which implies a central bank cannot (without capital controls) maintain interest rate and exchange rate targets simultaneously, because increasing the money supply results in a depreciation of the currency. In the years following the Single European Act, the EU has liberalised its capital markets and, as the ECB has inflation targeting as its monetary policy, the exchange-rate regime of the euro is floating. Against other major currencies [edit]The euro is the second-most widely held reserve currency after the U.S. dollar. After its introduction on 4 January 1999 its exchange rate against the other major currencies fell reaching its lowest exchange rates in 2000 (3 May vs sterling, 25 October vs the U.S. dollar, 26 October vs Japanese yen). Afterwards it regained and its exchange rate reached its historical highest point in 2008 (15 July vs US dollar, 23 July vs Japanese yen, 29 December vs sterling). With the onset of the 2008 financial crisis, the euro initially fell, to regain later. Despite pressure due to the euro area crisis, the euro remained stable.[135] In November 2011 the euro's exchange rate index – measured against currencies of the bloc's major trading partners – was trading almost two percent higher on the year, approximately at the same level as it was before the crisis began in 2007"
}