{
  "url": "https://property.ca/",
  "title": "Property.ca - Search & Analyze all Houses for sale and rent in Toronto",
  "text": "Search Active & Sold Listings Showcased listings in Toronto Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Get insider access Want full access to current & past listings, data and tools to help you search smart? Index For- No Results Found Homes - No Results Found Toronto Homes Average Sold Price for past 14 days $ 1.09 M2.03% Year over year change in values Toronto Market Report Summary - Average Sold Price/ Size$1.09M/ 1380 FT2 - Average Rent Price/ Size$2,776/ 708 FT2 - Number of Transactions476 Sold/ 1519 Rented Recently Sold Listings in Toronto Real estate boards require you to be signed in to access price history. Explore years of sold & rented listings, data & photos. Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Loading Featured Listings in Toronto - For Sale - For Rent 1/50 Featured $5,490,000 2+1BD 2BA 2 Parking 2,250-2,499 sqft Maint. Fee $2,273 MLS#: C12417299 PROPERTY.CA INC. 1/50 Featured $1,999,000 2BD 3BA 1 Parking 1,400-1,599 sqft Maint. Fee $1,125 MLS#: C12532256 PROPERTY.CA INC. 1/24 Featured $1,998,000 2+3BD 3BA 2 Parking 2,500-2,749 sqft Maint. Fee $2,634 MLS#: C12716420 PROPERTY.CA INC. 1/43 Featured $1,599,900 3BD 3BA 2 Parking 2,500-2,749 sqft Maint. Fee $1,524 MLS#: W12471834 PROPERTY.CA INC. 1/22 Featured $1,501,500 2BD 2BA 1 Parking 1,200-1,399 sqft Maint. Fee $2,551 MLS#: C12743228 PROPERTY.CA INC. 1/47 Featured $1,398,000 1BD 1BA 1 Parking 1,200-1,399 sqft Maint. Fee $789 MLS#: C12733062 PROPERTY.CA INC. Find a property in your favourite area Neighbourhood Experts A better way to choose a realtor - homes for sale in Surrey - homes for sale in Toronto - homes for sale in Mississauga - homes for sale in Ottawa - homes for sale in Vancouver - homes for sale in North Vancouver - homes for sale in Vaughan - homes for sale in Calgary - homes for sale in Barrie - homes for sale in Langley City - homes for sale in Brampton - homes for sale in St. Catharines - homes for sale in Cambridge - homes for sale in Guelph - homes for sale in Hamilton City - homes for sale in Kitchener - homes for sale in Burlington - homes for sale in Chilliwack - homes for sale in Milton - homes for sale in Niagara Falls - homes for sale in Welland - homes for sale in Oshawa - homes for sale in Port Colborne - homes for sale in Ajax - homes for sale in Caledon - homes for sale in Grimsby - homes for sale in Maple Ridge - homes for sale in Orillia - homes for sale in Pickering - homes for sale in Waterloo - homes for sale in Whitby - homes for sale in Ancaster - homes for sale in Innisfil - homes for sale in Newmarket - homes for sale in Stoney Creek - homes for sale in Wasaga Beach - homes for sale in Aurora - homes for sale in Coquitlam - homes for sale in Fort Erie - homes for sale in Markham - homes for sale in Mission - homes for sale in Niagara-on-the-Lake - homes for sale in Richmond - homes for sale in Thorold - homes for sale in Collingwood - homes for sale in Delta - homes for sale in Dundas - homes for sale in New Westminster - homes for sale in Port Moody - homes for sale in Uxbridge - homes for sale in Waterdown - homes for sale in West Vancouver - homes for sale in Clarington - homes for sale in Georgina - homes for sale in Halton Hills - homes for sale in Midland - homes for sale in Oro-Medonte - homes for sale in Pitt Meadows - homes for sale in Port Dover - homes for sale in Richmond Hill - homes for sale in Wainfleet - homes for sale in Abbotsford - 4 bedroom houses for sale in Toronto - 2 bedroom houses for sale in Toronto - 3 bed houses for sale in Toronto - Townhouses for sale in Toronto - Semi detached houses for sale in Toronto - Detached houses for sale in Toronto - Houses for sale in Toronto - Cheap houses for sale in Toronto - 3 bedroom semi detached houses in Toronto - 4 bedroom semi detached houses in Toronto - homes for sale in Willowdale - homes for sale in King West - homes for sale in Mimico - homes for sale in Scarborough Town Centre - homes for sale in Harbourfront - homes for sale in Islington-City Centre West - homes for sale in Bayview Village - homes for sale in Church St. Corridor - homes for sale in Newtonbrook - homes for sale in L'amoreaux - There are no active MLS listings right now. Please check back soon!"
}