{
  "url": "https://www.cestee.fr/destination/france/paris/arc-de-triomphe",
  "title": "Arc de Triomphe, Paris - tout ce qu'il faut savoir",
  "text": "Arc de Triomphe Le magnifique et grand Arc de Triomphe de l'Étoile est l'un des arcs de triomphe les plus célèbres au monde et l'une des icônes de Paris. Chaque année, le Tour de France cycliste s'y termine. Il a été construit pendant 30 ans au début du XIXe siècle par Napoléon Bonaparte pour célébrer sa victoire à la bataille d'Austerlitz. Achevé en 1836, il est présenté au monde dans le plus pur style de l'architecture classique. Sa taille en fait l'une des plus grandes, décorée de récits de guerre, de mythologie romaine et de noms de personnages militaires. Il se trouve au milieu du rond-point de l'Étoile, très fréquenté, d'où partent 12 rues, dont la plus célèbre, les Champs-Élysées, qui mènent jusqu'à la façade du Louvre. Le toit de l'arche offre la plus belle vue sur ce faisceau de rues. Les 10 meilleurs hôtels de Paris Les dimensions de l'Arc de Triomphe L'Arc de Triomphe a été conçu par l'architecte Jean François Chalgrin et sa forme est véritablement monumentale. Il mesure 51 mètres de haut, 45 mètres de large et 22 mètres de profondeur. Il est orné d'un arc principal de 29 mètres de haut et de deux arcs latéraux plus petits de 19 mètres de haut. L'Arc de Triomphe de Paris est le deuxième plus grand au monde après celui de Pyongyang, en Corée du Nord, en 1982. Monument aux morts et flamme éternelle Directement sous l'arc se trouve la Tombe du Soldat inconnu, où brûle une flamme éternelle à la mémoire de plus d'un million de soldats morts pendant la Première Guerre mondiale. L'accès au mémorial et à toute la zone située sous l'arche est gratuit. Entrée et montée sur le toit Ouvert tous les jours de 10h à 22h30, et jusqu'à 23h en été. La montée sur le toit est payante. Vous pouvez acheter des billets sur place (attendez-vous à des files d'attente 24 heures sur 24 en été) ou en ligne sur le site officiel : paris-arc-de-triomphe.fr. - Adultes : - 1,5 million d'euros 16 eur - Enfants de moins de 18 ans - gratuit - Mineurs 18-25 ans - gratuit sur présentation de la carte ISIC Hébergement Outre le monument lui-même, le quartier de l'Arc de Triomphe est l'un des principaux points de correspondance des transports en commun parisiens, et il est donc stratégiquement très pratique de vivre dans ce quartier. Découvrez les hôtels du quartier que nous choisirions pour vous. - Princesse Caroline - L'hôtel 3* le moins cher à proximité, à seulement 200 mètres de l'Arc, avec des prix à partir de 128 eur par nuit pour 2 personnes. - Arc de Triomphe Etoile - un hôtel 3* moderne à 300 mètres de l'Arc, à partir de 143 eur par nuit pour 2 personnes - Radisson Blu Champs-Elysées - un hôtel 5* classique à quelques mètres de l'Arc, à partir de 293 euros par nuit pour 2 personnes. Comment s'y rendre Il y a une station de métro directement sous le rond-point. Charles de Gaulle-Étoileoù circulent les lignes de métro 1, 2, 6 et le RER A. - Métro 1 - Louvre, Place de la Concorde, Petit + Grand Palais, Chatelet, Hôtel de Ville, Le Marais, Bastille, Nation, Château Vincennes, La Défense - Gare de Lyon - Métro 2 - Montmartre, Bassin de la Villette, Nation, Cimetière du Père-Lachaise - Métro 6 - Trocadéro - Tour Eiffel, Tour Montparnasse, Catacombes, Place d'Italie - Gare Montparnasse, Gare de Bercy - RER A - Chatelet, Hôtel de Ville, Centre Pompidou, Opéra Garnier, La Défense, Nation, Disneyland - Gare de Lyon - Bus depuis la gare Charles de Gaulle Étoile Champs Élysées - 73 - Place de la Concorde, Petit + Grand Palais, Champs-Elysées, Musée d'Orsay, La Défense - Bus depuis les arrêts de bus Charles de Gaulle - Etoile - Friedland - 22 - Gare Saint-Lazare - 52 - Église de la Madeleine, Opéra Garnier - Bus à partir des arrêts de bus Charles de Gaulle - Etoile - Kléber - 22 - Trocadéro, Porte Saint-Cloud - 30 - Trocadéro, Tour Eiffel, Parc André Citroën - Bus à partir des arrêts Charles de Gaulle - Etoile - Marceau - 91 - Invalides, Gare Montparnasse, Pont de l'Alma, Porte d'Orléans - Bus à partir des arrêts de bus Charles de Gaulle - Etoile - Wagram - 30 - Place de Clichy, Moulin Rouge, Pigalle (Montmartre) - 31 - Gare de l'Est, Nord de Montmartre, Pont Cardinet - Bus à partir de l'arrêt Charles de Gaulle - Etoile - Mac Mahon - 91 - Pereire, Port de Champerret - 341 - Pereire, Gare de Clichy, Clichy - Saint-Ouen, Porte de Clignancourt Il y a plusieurs arrêts de bus autour du rond-point avec des noms similaires. Des passages souterrains mènent au rond-point lui-même, qui est librement accessible. Les 3 arcs de triomphe Saviez-vous que Paris ne possède pas qu'un seul arc de triomphe ? En fait, il s'agit simplement du plus grand et d'une partie de 3 arcs construits sur une ligne de 8 km de long. Le premier est également l'Arc de triomphe du Carrousel de Napoléon, datant de 1809, qui se dresse juste à côté du musée du Louvre. L'autre est la Grande Arche moderne, haute de 105 mètres, qui est en fait un gratte-ciel ressemblant à un arc de triomphe. Elle est située dans le célèbre quartier moderne de La Défense. A voir dans les environs Découvrez tous les endroits à voir à Paris. Reste-t-il des questions ? Si vous avez des questions ou des commentaires sur l'article..."
}