{
  "url": "https://en.wikipedia.org/wiki/Marco_(2024_film)",
  "title": "Marco (2024 film) - Wikipedia",
  "text": "Marco (2024 film) Marco is a 2024 Indian Malayalam-language neo-noir action thriller film written and directed by Haneef Adeni and produced by Shareef Muhammed under his Cubes Entertainments banner. It is the standalone spin-off to Mikhael (2019) and also the second installment in the Mikhael Extended Universe, starring Unni Mukundan in the titular role alongside an ensemble cast, including Siddique, Jagadish, Kabir Duhan Singh, Abhimanyu Shammi Thilakan, Anson Paul, Ishaan Shoukath and Yukti Thareja.[5][6] The music was composed by Ravi Basrur, while cinematography and editing were handled by Chandru Selvaraj and Shameer Muhammed, respectively. Marco was released worldwide on 20 December 2024, coinciding with Christmas. The film received positive reviews from critics, praising its cast performances (especially Unni Mukundan, Jagadish and Siddique), direction, screenplay, dialogues, making style, music, background scores, action sequences, and production values, with the film's plot and depictions of violence, especially those targeted towards women and children, receiving criticism and becoming the subject of controversy. It was known for its graphic violence and was considered as the most violent Indian film till now. Nonetheless, it was a commercial success at the box office and emerged as the highest-grossing A-rated Malayalam-language film of all time and one of the highest-grossing Malayalam films of all time.[7][8] Plot [edit]Victor, a blind person, witnesses the murder of his close friend Wasim. Despite his blindness, Victor identifies the killer by recognising the distinct scent of the killer's perfume and the killer's vehicle, a Land Rover Defender. Victor's identification leads the cops to suspect that the killer is Russell, who conspired with Wasim's elder brother Tariq, to carry out the murder. Tragically, Victor gets captured by Russell, who throws him into a tub of hydrofluoric acid, resulting in his death. Victor's brother George Peter, the patriarch of the Adattu family, one of the prominent crime families in Kochi, is devastated by the loss. Marco Jr, Peter's adopted brother who had been sent to Italy for safety, returns to India after learning about Victor's death. At Victor's memorial service at their local church, Marco vows to avenge Victor's death, declaring his intent to eliminate everyone involved in the heinous act, including Russell, who is present at the scene. Despite Peter's attempts to dissuade him from taking a path of violence, Marco remains resolute. Meanwhile, Tony Issac, Russell's father and the leader of the Isaac family, a gold smuggling syndicate, manipulates the situation to his advantage and strikes a deal with Peter involving gold biscuits and a ransom, all while plotting further treachery. During Peter's return from the deal, Isaac's henchman Devraj ambushes him in his car, revealing the conspiracy and fatally stabbing him. Peter survives, but is hospitalised, further enraging Marco. Peter informs Marco that Tony and Russell were responsible for Victor's death. As Marco sets out for vengeance, Russell reveals his true nature by severely injuring Marco and using a chainsaw to mutilate the left arm of Marco's right-hand man, Anwar. An enraged Marco retaliates, biting off Jahangir's ear, killing Russell's goons and severely injuring them with the same chainsaw. While preparing to kill Russell, Marco learns that Victor's pregnant wife, Isha, is being held captive by Tony. In exchange for her release, Tony demands the Adattu family's entire gold business operations to be transferred in his name. Marco captures and tortures Dev using phosgene gas. He confesses that Isha is at Tony's guesthouse before dying in an explosion. Marco storms the guesthouse, slaughtering Tony's henchmen brutally to rescue Isha. However, Tony deceives Marco, revealing that Isha is locked in the trunk of Russell's car. Marco and Anwar track Tony down to his farmhouse, where Tony reveals that he is bisexual and attempts to seduce them but Marco cuts off Tony's right hand using a katana and sends it to Russell, disguised as a suitcase containing company documents. In a final trap, Marco rigs Tony's chair with a detonator, which would explode when Tony is lifted off the chair. When the detonator is just about to explode, Tony is hoisted into the air, which triggers the detonator and leaves him mortally wounded. Russell stands helpless outside the warehouse and is unable to do anything but watch as Tony succumbs to his wounds, leading to his death. Meanwhile, Peter kills Tariq by hanging him. Desperate for revenge, Russell seeks help from his elder brother, Cyrus, who is a ruthless and psychotic butcher. They launch an attack on the Adattu mansion during Isha's labour, and begin slaughtering the family. Despite Peter and Marco's valiant efforts, Cyrus and Russell kill all the members of the family, including the children, Marco's fiancée-turned-wife, Maria, and Isha, before leaving with her newborn child while severely injuring Marco, Peter and his wife. Gravely injured, Marco and Peter are left to mourn their family's deaths. Peter urges Marco to avenge not only Victor, but the entire family. Marco adopts a striking and fearsome appearance and confronts Cyrus and Russell at their factory. Marco fights through their henchmen in a bloody showdown, where he kills Russell by ripping his rib cage using a crowbar and takes out his heart with his bare hand. In a climatic encounter with Cyrus, who holds the newborn child over a pool of acid, Marco decapitates him and rescues the child before pushing him into the acid. Marco completes his path of vengeance and leaves the factory with the child, while paying the ultimate price in the suffering and loss of his family. In a post-credit scene, which takes place some time after the film's events, Marco spends time with Victor's child in a beach until a platoon of cars arrive and suddenly take the child away. Cast [edit]- Unni Mukundan as Marco D'Peter \"Marco Jr.\" - Arnav Prajith as young Marco - Siddique as George D'Peter alias \"Adattu George\" - Jagadish as Tony Isaac - Kabir Duhan Singh as Cyrus Isaac - Nibras K.N. as young Cyrus - Abhimanyu Shammi Thilakan as Russell Isaac - Vihan Shankar Raj as young Russell - Anson Paul as Devaraj \"Dev\" - Ishan Shoukath as Victor D'Peter - Yukti Thareja as Maria Anna Paul \"Mary\" - Durva Thaker as Isha Joshy - Sreejith Ravi as Mathew Devassy - Lishoy as Adattu Francis - Mathew Varghese as Peter - Shaji Shahid Jemshed as Anwar - Ajit Koshy as Jahangir - Dinesh Prabhakar as CI Ashok - Arjun Nandhakumar as Tariq Rasool - Bashid Basheer as Wasim Rasool - Bindu Sanjeev as Elizabeth George - Sajitha Sreejith as Ancy Mathew - Bitto Davis as Roy Philip - Sonia Giri as Tony's wife[9] - Arun Sunny as Ronymon - Chithra Prasad as Chithra - Saneesh Nambiar as SI Shahul Hameed - Meera Nair as Sophie - Nassar as DYSP Nambiar - Raghu Chandran as City Police Commissioner - Ramesh Menon as James - Pravada Menon as Doctor - Dr. Reji as Sebastian - K. P. A. C. Lalitha as Mariyam D'Peter, Marco's foster mother and George's mother (photo presence) - Riyaz Khan as CI Imran Malik (deleted scene) Production [edit]Development [edit]In October 2023, Cubes Entertainments announced Marco in which Unni Mukundan will play the lead role, with the film written and directed by Haneef Adeni. Mukundan played a similar but antagonistic character of the same name in the 2019 film Mikhael starring Nivin Pauly.[10] The film was expected to commence in February 2024. The film is produced by Shareef Muhammed under his Cubes Entertainments banner.[11][12] In February 2024, it was reported that filming will commence in April 2024.[13] Ravi Basrur joined the project in March 2024 to compose the music for the film. Prior to this, he was earlier announced to be part of Prithviraj Sukumaran's period epic Kaaliyan.[14] On 28 April 2024, the filmmakers confirmed that the film will start shooting in the first week of May 2024.[15] The film has Chandru Selvaraj as the cinematographer, Shameer Muhammed as the editor, and Kalai Kingson as the action choreographer. On the teaser's launch, Shareef Muhammed assured that the film will not compromise its content, even though its teaser was edited for a much wider reach, and to comply with the CBFC's certification process for movie trailers.[16] The makers announced that the film would be released in the Hindi, Tamil, Telugu, and Kannada languages alongside its original Malayalam language.[17] Casting and filming [edit]Grandson of Thilakan and son of actor Shammi Thilakan, Abhimanyu was cast in his maiden Malayalam film.[18] Actors Siddique, Jagadish and Kabir Duhan Singh were signed for major roles.[19] Yukti Thareja, known for her appearance in the T-Series song \"Lut Gaye\" opposite Emraan Hashmi, made her debut in Malayalam cinema by joining the film on 20 May 2024, which was confirmed by the filmmakers via her Instagram account.[20] Debutante Durva Thaker joined the project earlier.[21] Riyaz Khan joined the cast in July 2024.[22] The first schedule was held in May 2024 in Munnar.[23] The second schedule was wrapped by July 2024 in Kochi.[24][25] The principal photography was wrapped by 28 August 2024 after nearly 100 days of shooting.[26][27] Music [edit]The film's music along with the background score was composed by Ravi Basrur.[28] The music rights of the film were acquired by Sony Music.[29] The first single, titled \"Blood\", was released on 22 November 2024.[30] A second version of the song, sung by Santhosh Venky, was released on 25 November 2024 due to criticism of the first version from the audience.[31] The second single titled \"Marpapa\" was released on 29 November 2024.[32] The film's original soundtrack was released on 21 December 2024, while a separate album containing the film's background score was released by Sony Music India on 27 December 2024.[33] Track listing [edit]Background score [edit]Release [edit]Theatrical [edit]Marco was released on 20 December 2024, coinciding with the Christmas weekend.[35][36] Apart from the original Malayalam language, it was released in the Telugu, Hindi, Tamil, and Kannada languages. The film received an A certification from the Central Board of Film Certification due to its extreme bloody violence.[37] For the same reason, Marco became the first Indian action film and fifth Indian film in general to receive an R21 rating by the IMDA in Singapore.[38][39] The film premiered at the Bucheon International Fantastic Film Festival in South Korea on 5 July 2025.[40][41][42] It also premiered in Germany at the Fantasy Filmfest in September 2025.[43] Home media [edit]The film was released on SonyLIV on 14 February 2025 in Malayalam along with dubbed versions in the Tamil, Telugu, and Kannada languages.[44][45] The Hindi-dubbed version began streaming on Amazon Prime Video on 27 February 2025.[46] Initially, an uncut version of the film was to be released on both streaming services, but after complaints were sent to the Ministry of Information and Broadcasting, the theatrical version got released on the platforms instead.[47] The film's French Blu-ray was released on 25 September 2025.[48][49] The film was physically released in Germany on 15 January 2026 (initially scheduled for an 11 December 2025 release)[50] on 4K Ultra HD, Blu-Ray, and DVD, alongside a limited and serialized 4K Ultra HD and Blu-Ray mediabook combo pack that includes a 24-page booklet and a removable cover. The mediabook release is sold in seven individual cover variants, with every single one being limited to 333 copies (except for the last one, which only has 222 copies). All the German physical media releases of the film have a German-language audio track and subtitles in addition to the film's original Malayalam-language audio track and English subtitles.[51] Controversies [edit]The film was subjected to attention and criticized by many personalities for its extreme violence and brutal content, saying that it influences real-life violence and involving violence against women and children.[52][53] The film was planned to have a television premiere, but it was blocked by the CBFC due to the film's graphic violence.[54] Alongside the cancellation of the film's planned TV premiere, appeals were also made by the regional censor board of India to remove the film from its OTT streaming services.[55] Reception [edit]Critical response [edit]Marco received positive reviews from critics, On the review aggregator website Rotten Tomatoes, 79% of 8 critics' reviews are positive, with an average rating of 6.7/10. It was praised for its cast performances (especially Unni Mukundan's), direction, screenplay, dialogues, making style, music, background scores, action sequences, and production values, with the film's plot and depictions of violence, especially those targeted towards women and children, receiving criticism. Sanjith Sridharan of OTTplay gave 3.5/5 stars and wrote \"Marco is the closest Malayalam film to a Prashanth Neel movie, not in terms of scale or story, but style. Unni Mukundan's performance gets the lion's share of credit for this too.\"[56] Janani K of India Today gave 3/5 stars for the Tamil version and wrote, \"The film will blow your mind off with its action pieces and its not for the faint-hearted\", concluding as \"Actor Unni Mukundan's exceptional performance enhanced the feel of Marco\".[57] Reviewing the Telugu version, Pratyusha Sista of Telangana Today stated that, \"the film is a must-watch for action lovers, if you're looking for a gripping weekend entertainer as the director takes a simple revenge story and crafts it into a top-notch thriller with his unique vision\".[58] Arun Antony of Deccan Herald gave 3/5 stars and wrote, \"'Marco' has everything it claims to be: bloody, violent, brutal and it holds back little in terms of onscreen violence, however, the action and stunts are fresh and enjoyable\".[59] ABP Live gave 3.5/5 stars and wrote, \"Technically the film sets a new standard in Indian cinema and it's a must-watch as the film maintains a thrilling pace with powerful action as well as brilliant direction\".[60] Aaliya Farzeen Ashraf of The Week gave 3/5 stars and wrote \"Marco caters to fans of stylized action and intense violence.\"[61] Shilpa Nair Anand of The Hindu wrote \"The movie scores on the technical aspects such as the stylised stunts, cinematography and background score; the writing, however, flounders.\"[62] Box office [edit]On its opening day, the film grossed ₹10.8 crore worldwide, being the fourth highest day-one grossing Malayalam film in 2024, and one of the highest opener in Malayalam cinema with ₹4.55 crore from the domestic market.[63][64] Marco became the highest-grossing A certified film of Malayalam cinema, surpassing Kammatipaadam (2016).[7] In its first three day weekend, the film grossed over ₹30 crore worldwide with ₹14.75 crore from Kerala.[65][66] In its first 4-days, it grossed around ₹40 crore worldwide with ₹18.15 crore from Kerala.[67] The film has grossed ₹25 crore in Kerala and around ₹50 crore worldwide in 7 days.[68] It grossed ₹56 crore worldwide in 8 days of its release.[69] As of 3 January 2025, the Hindi dubbed version became the highest grossing Malayalam dubbed film in the Hindi speaking region netting ₹5 crore surpassing The Goat Life (2024) and 2018 (2023).[70] In 17 days, the total worldwide gross collection stands at ₹91 crore, including ₹40 from Kerala, ₹20 crore from ROI and ₹31 crore from overseas.[71] The film crossed ₹100 crore globally on its 4th Sunday (23 days). As of 20 January 2025, the film grossed ₹104 crore worldwide.[72][73] Prequel [edit]The film's post-credits scene teased a sequel, which was confirmed by Haneef Adeni a few weeks after the release of the film, and it was expected to have more action and violence than its predecessor.[74] However, in June 2025, Unni Mukundan himself claimed that the sequel was shelved due to \"too much negativity\" surrounding the first film.[75] On July 2025, Cubes Entertainments clarified that discussions regarding the sequel are still ongoing. The studio stated that they hold full rights to the project and have no plans to transfer or sell them. However, no official announcement has been made regarding the film's production or release.[76][77] On September 2025, the producers officially registered the title for a prequel film, which is titled Lord Marco with the Kerala Film Chamber of Commerce, confirming that plans for a follow-up film had been revived after earlier reports of shelving.[78][79] Director Haneef Adeni, who helmed the original film, is confirmed to join the film, while lead actor Unni Mukundan has confirmed that he will not reprise the role. The film will be about the story of Lord Marco, who is the ancestor of the original film's protagonist, Marco D' Peter a.k.a Marco Jr. The film will be the prequel to Marco and will also serve as the third installment in the Mikhael Extended Universe after Mikhael and Marco. The prequel film will explore the events that took place before those films.[78] Shared universe [edit]The movie shares its universe directly with the 2019 film Mikhael, serving as a standalone spin-off to it. The third installment of the universe titled Lord Marco is confirmed by director Haneef Adeni and producer Shareef Muhammed and it will serve as the prequel to Marco. References [edit]- ^ \"Marco: Unni Mukundan's film to skip the trailer release; Plot and runtime revealed\". ottplay.com. Retrieved 16 December 2024. - ^ \"Marco Is Set To Feature Unni Mukundan In Lead Role With a Budget of 30 Crores\". Asianet News. 2 October 2023.[permanent dead link] - ^ \"ആ വില്ലന് ഇനി നായകന്! 30 കോടി ബജറ്റില് ഉണ്ണി മുകുന്ദന്റെ മാര്കോ വരുന്നു\". Asianet News. 2 October 2023. Archived from the original on 19 June 2024. Retrieved 19 June 2024. - ^ \"Year Ender 2024: Top 10 highest-grossing Mollywood movies at worldwide box office; Manjummel Boys emerges victorious\". January 2025. - ^ \"ആ വില്ലന് ഇനി നായകന്! 30 കോടി ബജറ്റില് ഉണ്ണി മുകുന്ദന്റെ മാര്കോ വരുന്നു\". Asianet News. 2 October 2023. - ^ \"Unni Mukundan's 'Marco' to release in Telugu on 1 January 2025\". The South First. 27 December 2024. Retrieved 22 February 2025. - ^ a b \"Marco box office collection Day 1: Unni Mukundan's film beats Dulquer Salmaan's Kammatipaadam\". OTTPlay. Retrieved 24 December 2024. - ^ \"Unni Mukundan's 'Marco' follows 'Baahubali' to South Korea, expanding Malayalam cinema's reach\". Archived from the original on 2 January 2025. Retrieved 2 January 2025. - ^ \"New Cast Additions For Unni Mukundan's Marco\". Times Now. 27 June 2024. Retrieved 24 December 2024. - ^ \"Marco: Shooting for the Unni Mukundan-starrer to begin soon\". ottplay.com. Archived from the original on 26 December 2024. Retrieved 24 December 2024. - ^ \"Unni Mukundan's 'Marco' set to go on floors in February 2024\". The Times of India. ISSN 0971-8257. Archived from the original on 26 December 2024. Retrieved 24 December 2024. - ^ \"First look poster of Unni Mukundan's 'Marco' out\". Mathrubhumi English. 16 June 2024. Archived from the original on 16 June 2024. Retrieved 16 June 2024. - ^ \"Unni Mukundan's 'Marco' to go on floors soon\". The Times of India. ISSN 0971-8257. Archived from the original on 26 December 2024. Retrieved 24 December 2024. - ^ Service, Express News (9 March 2024). \"Ravi Basrur joins Unni Mukundan's 'Marco'\". The New Indian Express. Archived from the original on 3 March 2024. Retrieved 24 December 2024. - ^ \"Unni Mukundan's 'Marco' to go on floors on May 3\". The Times of India. 29 April 2024. ISSN 0971-8257. Archived from the original on 15 May 2024. Retrieved 24 December 2024. - ^ \"Makers of 'Marco' announce teaser edits for wider reach but promises no cuts for full film\". The Times of India. 30 October 2024. Retrieved 9 January 2025. - ^ Service, Express News (4 May 2024). \"Unni Mukundan's 'Marco' begins\". The New Indian Express. Retrieved 24 December 2024. - ^ \"Legendary actor Thilakan's grandson to Debut in Unni Mukundan's Marco\". Times Now. 18 May 2024. Archived from the original on 19 June 2024. Retrieved 19 June 2024. - ^ \"Marco – Unni Mukundan dons new look for the first villain spin-off movie in Malayalam\". OTTPlay. Archived from the original on 22 September 2024. Retrieved 20 December 2024. - ^ \"'Lut Gaye' Fame Actress Yukti Thareja To Join Unni Mukundan's 'Marco'\". Times Now. 20 May 2024. Archived from the original on 19 June 2024. Retrieved 19 June 2024. - ^ \"Marco – The Unni Mukundan-starrer will have THIS Telugu actress as a female lead\". OTTPlay. Archived from the original on 25 June 2024. Retrieved 24 December 2024. - ^ \"Riyaz Khan joins Unni Mukundan's 'Marco' in 'Adich Keri Vaa' style\". The Times of India. 7 July 2024. ISSN 0971-8257. Retrieved 24 December 2024. - ^ \"Unni Mukundan wraps up the first schedule of 'Marco'\". The Times of India. 17 May 2024. Retrieved 17 May 2024. - ^ \"Second schedule of Unni Mukundan's Marco wraps up\". Cinema Express. 17 July 2024. Retrieved 17 July 2024. - ^ \"Unni Mukundan's Marco Completes Second Schedule Of Shoot\". Times Now. 18 July 2024. Archived from the original on 18 July 2024. Retrieved 18 July 2024. - ^ \"'Marco': Makers call it a wrap; say the Unni Mukundan's actioner will 'redefine action genre' in the Malayalam film industry - WATCH video\". The Times of India. 28 August 2024. Retrieved 28 August 2024. - ^ \"It is a wrap for Unni Mukundan's thriller, 'Marco'\". The South First. 29 August 2024. Archived from the original on 30 August 2024. Retrieved 29 August 2024. - ^ \"'KGF'-fame Ravi Basrur on board Unni Mukundan's 'Marco' as composer\". The Hindu. 2 March 2024. Archived from the original on 2 March 2024. Retrieved 2 March 2024. - ^ \"'ചോരയൊലിക്കുന്ന തലയോട്ടിയും ഹെഡ്ഫോണും'; മാര്ക്കോ'യുടെ മ്യൂസിക് റൈറ്റ്സ് സോണി മ്യൂസിക്കിന്\". Mathrubhumi (in Malayalam). 6 November 2024. Archived from the original on 11 November 2024. Retrieved 6 November 2024. - ^ \"First Single Titled Blood From Unni Mukundan's Marco Released!\". Times Now. 22 November 2024. Archived from the original on 22 November 2024. Retrieved 22 November 2024. - ^ \"'Marco' promo song revamped: 'KGF' singer Santhosh Venky replaces Dabzee after audience feedback\". The Times of India. 25 November 2024. Archived from the original on 26 November 2024. Retrieved 25 November 2024. - ^ \"Lyric Video Of The Banger 'Marpapa' Promo Song From Marco Released\". Times Now. 29 November 2024. Archived from the original on 2 December 2024. Retrieved 29 November 2024. - ^ Sony Music South (27 December 2024). Marco OST Jukebox | Unni Mukundan | Shareef Muhammed | Haneef Adeni | Ravi Basrur. Archived from the original on 28 December 2024. Retrieved 2 January 2025 – via YouTube. - ^ \"Marco (Original Background Score)\". Spotify. Retrieved 27 December 2024. - ^ \"Wow! Unni Mukundan's 'Marco' poster creates huge buzz on social media\". Kerala Kaumudi. 16 June 2024.[permanent dead link] - ^ \"Unni Mukundan's 'Marco' locks a release date\". The Hindu. 13 November 2024. Archived from the original on 14 November 2024. Retrieved 13 November 2024. - ^ \"Unni Mukundan's Marco clears censorship formalities\". Cinema Express. 16 December 2024. Archived from the original on 17 December 2024. Retrieved 16 December 2024. - ^ \"MARCO (2024)\". Infocomm Media Development Authority. Archived from the original on 28 June 2025. - ^ \"Marco Movie: 21 വയസിന് മുകളിലുള്ളവർക്ക് മാത്രം കാണാം; സിംഗപ്പൂരിൽ R21 റേറ്റിംഗ് നേടുന്ന ആദ്യ ഇന്ത്യൻ ആക്ഷൻ സിനിമയായി 'മാർക്കോ'\". Zee News Malayalam (in Malayalam). 31 December 2024. Archived from the original on 2 January 2025. Retrieved 2 January 2025. - ^ \"Screening Schedule\". Bucheon International Fantastic Film Festival. Archived from the original on 28 June 2025. - ^ \"Unni Mukundan-starrer Marco to have Korean premiere at BIFAN\". Cinema Express. Retrieved 16 June 2025. - ^ \"Marco | Adrenaline Ride | BIFAN\". Bucheon International Fantastic Film Festival. Archived from the original on 28 June 2025. - ^ \"Marco\". Fantasy Filmfest. Archived from the original on 27 September 2025. - ^ \"Marco OTT release: When and where to watch Unni Mukundan's gory thriller\". India Today. 31 January 2025. Retrieved 31 January 2025. - ^ \"Marco OTT release date confirmed! When and where to watch Unni Mukundan, Kabir Duhan Singh's violent action-thriller\". ottplay.com. Retrieved 31 January 2025. - ^ \"Marco Hindi OTT release: When and where to watch Unni Mukundan's action thriller\". The Times of India. 27 February 2025. Retrieved 27 February 2025. - ^ \"No Uncut Version For Marco's OTT Release; Makers Cite Multiple Complaints To Ministry Of Broadcasting As Reason\". Times Now. 13 February 2025. Retrieved 13 February 2025. - ^ \"Marco Blu-ray (France)\". Blu-ray Forum. Archived from the original on 10 July 2025. - ^ \"Marco\". Spectrum Films. Archived from the original on 10 July 2025. - ^ \"Marco 4K Blu-ray (Mediabook) (Germany)\". Blu-ray Forum. - ^ \"Brutale Action aus Indien: \"Marco\" ab 11.12. auf Ultra HD Blu-ray im Mediabook mit sieben Cover-Motiven - UPDATE\". BLURAY-DISC.DE. Archived from the original on 27 September 2025. - ^ \"Are Ranga, Marco and Young-hee behind murderous instincts of Kerala youth?\". Onmanorama. Retrieved 3 March 2025. - ^ \"From 'Pani' to 'Marco': Kerala debates impact of glamourisation of crimes in films\". Deccan Herald. Retrieved 27 February 2025. - ^ \"CBFC blocks Marco's TV release, writes to Centre to ban OTT screening\". Onmanorama. Retrieved 7 March 2025. - ^ \"Marco's TV release stopped by regional censor board, urges CBFC HQ's intervention to block streaming of Unni Mukundan film\". The Indian Express. 6 March 2025. Retrieved 6 March 2025. - ^ \"Marco movie review: Unni Mukundan's raging portrayal fuels this brutal no-holds-barred revenge thriller\". OTTplay. - ^ \"Marco review: Violence, action supersede story in Unni Mukundan's revenge thriller\". India Today. 3 January 2025. Archived from the original on 5 January 2025. Retrieved 9 January 2025. - ^ \"Movie review: 'Marco' is a high-octane action thriller worth every penny\". Telangana Today. 21 December 2024. Archived from the original on 21 December 2024. Retrieved 11 January 2025. - ^ \"'Marco' movie review: Flawed yet enjoyable action drama\". Deccan Herald. 28 December 2024. Archived from the original on 28 December 2024. Retrieved 11 January 2025. - ^ \"Marco Review: The Violent Drama Stands Out For Stylish Action And Unni Mukundan's Stellar Performance\". ABP News. 7 December 2024. Retrieved 11 January 2025. - ^ \"Marco' review: A bloody revenge drama that plays it safe\". The Week. - ^ Anand, Shilpa Nair (20 December 2024). \"'Marco' movie review: This stylish Unni Mukundan action thriller falters due to a weak script\". The Hindu. - ^ \"Marco | ആദ്യ ദിവസത്തിൽ മുടക്കുമുതലിന്റെ മൂന്നിലൊന്ന്; ഉണ്ണി മുകുന്ദന്റെ 'മാർക്കോ' ഒറ്റദിവസം നേടിയത് 10.8 കോടി\". News18 മലയാളം (in Malayalam). 21 December 2024. Archived from the original on 21 December 2024. Retrieved 25 December 2024. - ^ \"Marco Day 2 Kerala Box Office: Unni Mukundan's gory actioner is set for a BLOCKBUSTER Christmas with close to 5 crore on Saturday\". PINKVILLA. 21 December 2024. Archived from the original on 25 December 2024. Retrieved 25 December 2024. - ^ \"Kerala Box Office Weekend Update: Marco rocks, Rifle Club remains strong; All eyes on Barroz 3D\". PINKVILLA. 23 December 2024. Retrieved 25 December 2024. - ^ \"Marco Day 3 box office collection: Unni Mukundan film sees a huge spike in overseas and rest of India gross\". OTTPlay. Retrieved 23 December 2024. - ^ \"Marco Day 4 Kerala Box Office: Unni Mukundan's gory-actioner amasses an unbelievable Rs 4.15 crore on 1st Monday\". PINKVILLA. 24 December 2024. Archived from the original on 14 January 2025. Retrieved 14 January 2025. - ^ \"Marco Worldwide Box Office Update: Unni Mukundan's actioner crosses Rs 50 crore on day 7; targets to enter Rs 100 crore club\". Pinkvilla. 26 December 2024. Archived from the original on 26 December 2024. Retrieved 26 December 2024. - ^ \"Marco Day 8 Kerala Box Office: Unni Mukundan's Blockbuster closes in on mammoth Rs 30 crore\". PINKVILLA. 27 December 2024. Archived from the original on 14 January 2025. Retrieved 14 January 2025. - ^ \"Decoding 'Marco's Historic Success In North India: How A Malayalam Film Eclipsed 'Baby John' And Stunned The Box-Office\". The Hollywood Reporter India. Retrieved 5 January 2025. - ^ \"Marco 17 Days Worldwide Box Office Update: Unni Mukundan's blockbuster grosses Rs 91 crore; Enroute prestigious 100 crore club\". Pinkvilla. 6 January 2025. Archived from the original on 6 January 2025. Retrieved 6 January 2025. - ^ \"Marco Final Box Office Worldwide: Unni Mukundan's gory actioner set to wrap its theatrical run at Rs 104 crore; emerges a BLOCKBUSTER\". Pinkvilla. 20 January 2025. Archived from the original on 21 January 2025. Retrieved 20 January 2025. - ^ Sharma, Bhavana (26 January 2025). \"Marco OTT release: Unni Mukundhan's Marco film gets an OTT release date\". Deccan Chronicle. Retrieved 27 January 2025. - ^ \"When is Marco 2 coming? Director drops a hint. There could be two big surprises\". The Economic Times. 20 January 2025. ISSN 0013-0389. Retrieved 26 January 2025. - ^ \"Unni Mukundan Shelves Marco 2 Plans Due To 'Too Much Negativity'\". CNN-News18. Archived from the original on 1 July 2025. Retrieved 15 June 2025. - ^ \"ഉപേക്ഷിച്ചെന്ന് ഉണ്ണി മുകുന്ദൻ, ചർച്ചകൾ അവസാനിച്ചിട്ടില്ലെന്ന് നിർമാതാക്കൾ; 'മാർക്കോ 2' വരുമോ?\". Mathrubhumi (in Malayalam). 2 July 2025. Retrieved 2 July 2025. - ^ \"'Marco 2' not off the table yet, say makers—Despite Unni Mukundan's exit\". The Times of India. Archived from the original on 1 July 2025. Retrieved 1 July 2025. - ^ a b \"Shareef Muhammed and Haneef Adeni confirms that Mikhael Extended Universe' will never stop by Mikhael or Marco as the last film's prequel Lord Marco is in works. But Unni Mukundan's name is missing?\". The Times of India. 17 September 2025. Retrieved 18 September 2025. - ^ \"Makers register 'Lord Marco' sequel; Unni Mukundan not returning\". India Today. 18 September 2025. Retrieved 18 September 2025. External links [edit]- 2024 films - 2024 Indian films - 2020s gangster films - 2020s Malayalam-language films - 2024 action thriller films - 2024 crime action films - 2024 crime thriller films - Censored films - Films about murder - Films shot in Kerala - Films directed by Haneef Adeni - Film spinoffs - Indian action thriller films - Indian crime action films - Indian crime thriller films - Indian films about revenge - Indian gangster films - Indian neo-noir films - Films about brothers"
}