{
  "url": "https://texags.com/forums/5/topics/3582149",
  "title": "Texas A&M student dies in Austin hours after UT football tailgate | TexAgs",
  "text": "A Texas A&M student who traveled to Austin for the Texas vs. Texas A&M football rivalry game on Friday, November 28, died after a tailgate party, with public officials now investigating the incident. Brianna Aguilera, a Laredo native and Texas A&M student one year shy of graduating, was in town for the Black Friday matchup when she attended a tailgate in Austin, family members confirmed in a GoFundMe established in her memory. Loved ones added it remains unclear at this time what led up to her death in a West Campus student apartment complex. Stephanie Rodriguez, the mother of Texas A&M student Brianna Aguilera, told MySA she had concerns surrounding the nature of her daughter's death and potential foul play involved. The Austin Police Department confirmed with MySA that officers responded to 21 Rio Apartments, located at 2101 Rio Grande Street, in the university neighborhood around 12:47 a.m. on Saturday, November 29. APD said officers found an adult woman unresponsive at the apartment complex, with officials later confirming her death just before 1 a.m. Saturday. While the investigation remains ongoing, police did note there wasn't any indication of suspicious activity surrounding Aguilera's death. \"At this time, the incident is not being investigated as a homicide, and there are no indications of suspicious circumstances,\" APD added. \"The cause of death will be determined by the Travis County Medical Examiner's Office Texas A&M student Brianna Aguilera dies after Austin tailgate She is a sophomore per KBTX, but MySA says she is one year shy of graduating. Aggie sophomore dies after attending rivalry game tailgate This is a very tragic story, and the location of this tragedy is just 0.6 mile from where I live. I have lived in the Texan Tower on San Gabriel Street since July 2021 because my parents bought a Texan Tower condo unit in June 2021. RIP Briana Aguilera! Brianna Aguilera, a Laredo native and Texas A&M student one year shy of graduating, was in town for the Black Friday matchup when she attended a tailgate in Austin, family members confirmed in a GoFundMe established in her memory. Loved ones added it remains unclear at this time what led up to her death in a West Campus student apartment complex. Stephanie Rodriguez, the mother of Texas A&M student Brianna Aguilera, told MySA she had concerns surrounding the nature of her daughter's death and potential foul play involved. The Austin Police Department confirmed with MySA that officers responded to 21 Rio Apartments, located at 2101 Rio Grande Street, in the university neighborhood around 12:47 a.m. on Saturday, November 29. APD said officers found an adult woman unresponsive at the apartment complex, with officials later confirming her death just before 1 a.m. Saturday. While the investigation remains ongoing, police did note there wasn't any indication of suspicious activity surrounding Aguilera's death. \"At this time, the incident is not being investigated as a homicide, and there are no indications of suspicious circumstances,\" APD added. \"The cause of death will be determined by the Travis County Medical Examiner's Office Texas A&M student Brianna Aguilera dies after Austin tailgate She is a sophomore per KBTX, but MySA says she is one year shy of graduating. Aggie sophomore dies after attending rivalry game tailgate This is a very tragic story, and the location of this tragedy is just 0.6 mile from where I live. I have lived in the Texan Tower on San Gabriel Street since July 2021 because my parents bought a Texan Tower condo unit in June 2021. RIP Briana Aguilera!"
}