{
  "url": "https://play.google.com/store/apps/details?id=com.whatsapp&hl=en",
  "title": "WhatsApp Messenger - Apps on Google Play",
  "text": "WhatsApp from Meta is a FREE messaging and video calling app. It’s used by over 2B people in more than 180 countries. It’s simple, reliable, and private, so you can easily keep in touch with your friends and family. WhatsApp works across mobile and desktop even on slow connections, with no subscription fees*. Private messaging across the world Your personal messages and calls to friends and family are end-to-end encrypted. No one outside of your chats, not even WhatsApp, can read or listen to them. Simple and secure connections, right away All you need is your phone number, no user names or logins. You can quickly view your contacts who are on WhatsApp and start messaging. High quality voice and video calls Make secure video and voice calls with up to 32 people for free*. Your calls work across mobile devices using your phone’s Internet service, even on slow connections. Group chats to keep you in contact Stay in touch with your friends and family. End-to-end encrypted group chats let you share messages, photos, videos and documents across mobile and desktop. Stay connected in real time Share your location with only those in your individual or group chat, and stop sharing at any time. Or record a voice message to connect quickly. Share daily moments through Status Status allows you to share text, photos, video and GIF updates that disappear after 24 hours. You can choose to share status posts with all your contacts or just selected ones. Use WhatsApp on your Wear OS watch to continue conversations, reply to messages, and take calls - all from your wrist. And, leverage tiles and complications to easily access your chats and send voice messages. *Data charges may apply. Contact your provider for details. ______________________________________________________________ If you have any feedback or questions, please go to WhatsApp > Settings > Help > Contact Us. Terms of Service: https://www.whatsapp.com/legal/terms-of-service Learn more about messaging privately: https://www.whatsapp.com/privacy Learn more about WhatsApp safety: https://www.whatsapp.com/security Updated on Jan 30, 2026 Communication Data safety arrow_forward Safety starts with understanding how developers collect and share your data. Data privacy and security practices may vary based on your use, region, and age. The developer provided this information and may update it over time. Easy to use and just an amazing app to stay connected and share pictures and videos with everyone! EDIT: down to 1 star after update. Choosing photos to upload is horrible now! It doesn't show all my photos. The drop down menu to select the album sucks too. If I choose to see more, it only shows me 5 \"collections\" It used to be much easier before. I don't know why or how or who approved this but it sucks BAD. 20,998 people found this review helpful Ben M Flag inappropriate December 17, 2025 I rarely use whatsapp. mainly for video calls and i don't do that much. it's pretty good for it's basic use cases. but 90% of the time, i open it for two reasons. one they pushed a notification saying there's a status update, which is just noisy way to get me to open the app. seems like a dirty way to boost active user count. other is when some spam account adds everyone in the world to a group. they seem pretty good about blocking these but it happens. 1,299 people found this review helpful Austin Shelton Flag inappropriate January 13, 2026 The option for phone permissions allow you to select \"ask every time\" for microphone and camera. If you select these, the app does not allow you to use video call. You have to change it to always allow and then change it back to never allow after the call. Might as well say they want to secretly record your audio and video; your privacy concerns be damned. 505 people found this review helpful What’s new • You can now add a custom Member Tag to let everyone know your role in the group chat. Open the group chat, tap the group name and scroll to the members list. Tap Add member tag and type in your role to show people who you are or how you’re known in this group. These features will roll out over the coming weeks. Thanks for using WhatsApp!"
}