{
  "url": "https://babybel.com/frequently-asked-questions/",
  "title": "Frequently Asked Questions | Babybel® Cheese",
  "text": "Sorry to hear that! Call us at 1-800-272-1224 – we want to hear more about it. Just pull on the two tabs, peel off the wax casing and enjoy! Mini Babybel® is 100% real semisoft cheese goodness packed in a delicious, palm size snack. Learn more about our secret recipe here. Certified plant-based, non-GMO project verified, and certified vegan, Babybel® Plant-Based is a dairy-free cheese alternative with a soft, smooth, and creamy texture, that was developed to taste like Mozzarella. Babybel® Plant-Based is a dairy free cheese alternative made without milk. The smooth & creamy texture is replicated using coconut oil and each Babybel® offers a good source of calcium and Vitamin B12. Babybel® Plant-Based is made in the same facility as our dairy-based Babybel® products, but in a separate space dedicated to our plant-based products to ensure it has no exposure to milk or any of the other U.S. FDA Top 9 allergens. Sorry, but we do not sell or ship directly to consumers. However, you can find Mini Babybel at most national grocery retailers, mass retailers (such as Walmart or Target) and club retailers. You can find Mini Babybel at most national grocery retailers, mass retailers (such as Walmart or Target) and club retailers. Yes, we conform to the legal pasteurization requirements of the USDA and the FDA. Yes, our cheese is made with 100% real cow’s milk. We recommend enjoying our products by the date on the package. Mini Babybel® cheese should be refrigerated at all times when not being consumed. We advise that when taken on the go, cheese is safe unrefrigerated for 2-4 hours, and remaining cheese, if there is any, can then be safely returned to the fridge. Mini Babybel® cheese should be eaten right after you peel off the wax coating. That way air won’t dry out the cheese. Please do not freeze Mini Babybel® cheese, as it will affect the quality. No, our products are not certified kosher or halal. Yes, Mini Babybel® cheese is great for lacto-vegetarian diets. No rennet of animal origin is used in our products. We use a microbial enzyme to make our cheese. The wax meets FDA requirements for food-safe wax. We do not recommend eating it. Most products sold in the United States are made in our Kentucky and South Dakota plants. We also import some products from France. During the production process of Mini Babybel, we don’t use peanuts, tree nuts, egg, wheat, fish or shellfish. You can find all the ingredients and nutritional info about our yummy products right here. Babybel remains committed to delivering high quality, 100% real cheese goodness. In order to ensure we can continue to deliver the same goodness, we have made the decision to slightly reduce serving sizes of Babybel Original, Light, Gouda, and Mozzarella to maintain the same high quality and price for our consumers."
}