{
  "url": "https://www.verywellmind.com/what-is-love-2795343",
  "title": "What Love Is and How to Cultivate It",
  "text": "What Love Is and How to Cultivate It By Kendra Cherry, MSEd Kendra Cherry, MSEd Kendra Cherry, MS, is a psychosocial rehabilitation specialist, psychology educator, and author of the \"Everything Psychology Book.\" Learn about our editorial process Updated on December 01, 2025 Fact checked Verywell Mind content is rigorously reviewed by a team of qualified and experienced fact checkers. Fact checkers review articles for factual accuracy, relevance, and timeliness. We rely on the most current and reputable sources, which are cited in the text and listed at the bottom of each article. Content is fact checked after it has been edited and before publication. Learn more. by Emily Swaim Fact checked by Emily Swaim Emily Swaim is a board-certified science editor who has worked with top digital publishing brands like Voices for Biodiversity, Study.com, GoodTherapy, and Vox. Learn about our editorial process Table of Contents View All Table of Contents Meaning How to Tell Types of Love Influences Impact Tips for Cultivating Pitfalls History Love Quiz Close Key Takeaways Love is a complex blend of emotions, thoughts, and behaviors that are shaped by biology and life experiences.People show and experience love in different ways designed to foster connection, care, and mutual support.Knowing how love develops can help you build healthier, more fulfilling relationships. Love is often described as a powerful feeling. Psychologists also characterize it as a complex emotional and cognitive experience that is shaped by factors such as attachment, biology, and behavior. When someone asks, \"What is love?\" what they are asking is how these elements work together to create attraction, connection, and long-lasting bonds. By understanding love from a psychological perspective, you can learn more about how we build relationships, keep them strong, and maintain these connections over time. Verywell / Laura Porter What Love Really Means When it comes to love, some people would say it is one of the most important human emotions. Love is a set of emotions and behaviors characterized by intimacy, passion, and commitment. It involves care, closeness, protectiveness, attraction, affection, and trust. Many say it's not an emotion in the way we typically understand them, but an essential physiological drive. Love is a physiological motivation such as hunger, thirst, sleep, and sex drive. — PSYCHOLOGIST AND BIOLOGIST ENRIQUE BURUNAT There are countless songs, books, poems, and other works of art about love (you probably have one in mind as we speak!). Yet despite being one of the most studied behaviors, it is still the least understood. For example, researchers debate whether love is a biological or cultural phenomenon. How to Tell When You're In Love What are some of the signs of love? Researchers have made distinctions between feelings of liking and loving another person. According to psychologist Zick Rubin, romantic love is made up of three elements: Attachment: Needing to be with another person and desiring physical contact and approvalCaring: Valuing the other person's happiness and needs as much as your ownIntimacy: Sharing private thoughts, feelings, and desires with the other person Based on this view of romantic love, Rubin developed two questionnaires to measure these variables, known as Rubin's Scales of Liking and Loving. While people tend to view people they like as pleasant, love is marked by being devoted, possessive, and confiding in one another. Are There Different Types of Love? Yup—not all forms of love are the same, and psychologists have identified a number of different types of love that people may experience. These types of love include: Friendship: This type of love involves liking someone and sharing a certain degree of intimacy. Infatuation: This form of love often involves intense feelings of attraction without a sense of commitment; it often takes place early in a relationship and may deepen into a more lasting love. Passionate love: This type of love is marked by intense feelings of longing and attraction; it often involves an idealization of the other person and a need to maintain constant physical closeness. Compassionate/companionate love: This form of love is marked by trust, affection, intimacy, and commitment. Unrequited love: This form of love happens when one person loves another who does not return those feelings. Robert Sternberg's Triangular Theory of Love Specifically, psychologist Robert Sternberg developed his well-regarded triangular theory of love in the early 1980s. Much research has built upon his work and demonstrated its universality across cultures. Sternberg identified three components of love—intimacy, passion, and commitment—that interact to produce seven types of love. Sternberg's Triangular Theory of Love Type of Love Components Friendship Intimacy Infatuation Passion Empty Commitment Romantic Intimacy, passion Companionate Intimacy Fatuous Commitment, passion Consummate Intimacy, compassion, commitment How Culture and Biology Shape Love Love is most likely influenced by both biology and culture. Although hormones and biology are important, the way we express and experience love is also influenced by our own conceptions of love. Some researchers suggest that love is a basic human emotion just like happiness or anger, while others believe that it is a cultural phenomenon that arises partly due to social pressures and expectations. Research has found that romantic love exists in all cultures, which suggests that love has a strong biological component. It is a part of human nature to seek out and find love. However, culture can significantly affect how individuals think about, experience, and display romantic love. Is Love an Emotion? Psychologists, sociologists, and researchers disagree somewhat on the characterization of love. Many say it's not an emotion in the way we typically understand them, but an essential physiological drive. On the other hand, the American Psychological Association defines it as \"a complex emotion.\" Still, others draw a distinction between primary and secondary emotions and put love in the latter category, maintaining that it derives from a mix of primary emotions. How Love Affects Your Mental Health Love, attachment, and affection have an important impact on well-being and quality of life. Loving relationships have been linked to: Lower risk of heart diseaseDecreased risk of dying after a heart attackBetter health habitsIncreased longevityLower stress levelsLess depressionLower risk of diabetes Tips for Cultivating and Showing Love Lasting relationships are marked by deep levels of trust, commitment, and intimacy. Some things that you can do to help cultivate loving relationships include: Try loving-kindness meditation. Loving-kindness meditation (LKM) is a technique often used to promote self-acceptance and reduce stress, but it has also been shown to promote a variety of positive emotions and improve interpersonal relationships. LKM involves meditating on a person you love or care about, focusing on warm feelings and your desire for their well-being and happiness. Communicate. Everyone's needs are different. The best way to ensure that your needs and your loved one's needs are met is to talk about them. Helping another person feel loved involves communicating that love to them through words and deeds. Some ways to do this include showing that you care, making them feel special, telling them they are loved, and doing things for them. Tackle conflict in a healthy way. Never arguing is not necessarily a sign of a healthy relationship—more often than not, it means that people are avoiding an issue rather than discussing it. Rather than avoiding conflict, focus on hashing out issues in ways that are healthy in order to move a relationship forward in a positive way. How to Show Love to Another Person There is no single way to practice love. Every relationship is unique, and each person brings their own history and needs. Some things that you can do to show love to the people you care about include: Be willing to be vulnerable. Be willing to forgive. Do your best, and be willing to apologize when you make mistakes. Let them know that you care. Listen to what they have to say. Prioritize spending time with the other person. Reciprocate loving gestures and acts of kindness. Recognize and acknowledge their good qualities. Share things about yourself. Show affection. Make it unconditional. Showing love can have positive benefits on your own mental health. According to one study, how loved you feel is directly related to how much love you show to others. When Love Brings Negative Emotions As Shakespeare said, the course of love never did run smooth. Love can vary in intensity and can change over time. It is associated with a range of positive emotions, including happiness, excitement, life satisfaction, and euphoria, but it can also result in negative emotions such as jealousy and stress. No relationship is perfect, so there will always be problems, conflicts, misunderstandings, and disappointments that can lead to distress or heartbreak. Some of the potential pitfalls of experiencing love include: Anxiety Depression Increased stress Jealousy Obsessiveness Possessiveness Sadness Everyone is bound to experience at least some negative emotions associated with love. However, it can become problematic if those feelings outweigh the positives or start to interfere with either person's ability to function normally. Relationship counseling can be helpful when couples need support coping with miscommunication, stress, or emotional issues. How Our Understanding of Love Has Changed Love has long been a topic of interest for poets, writers, musicians, and artists, but only fairly recently has love become the subject of scientific investigation. In the past, the study of love was left to \"the creative writer to depict for us the necessary conditions for loving,\" according to Sigmund Freud. \"In consequence, it becomes inevitable that science should concern herself with the same materials whose treatment by artists has given enjoyment to mankind for thousands of years,\" he added. Research on love has grown tremendously since Freud's remarks. But early explorations into the nature and reasons for love drew considerable criticism. During the 1970s, U.S. Senator William Proxmire railed against researchers studying love and derided their work as a waste of taxpayer dollars. Despite early resistance, research has revealed the importance of love in both child development and adult health. Take the Love Quiz Our fast and free love quiz can help you determine if what you've got is the real deal or simply a temporary fling or infatuation. This love quiz was reviewed by Ivy Kwong, LMFT. Read more: Psychology Theories Social Psychology 14 Sources Verywell Mind uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. Burunat E. Love is not an emotion. Psychology. 2016;07(14):1883. doi:10.4236/psych.2016.714173 Karandashev V. A cultural perspective on romantic love. ORPC. 2015;5(4):1-21. doi:10.9707/2307-0919.1135 Rubin Z. Lovers and Other Strangers: The Development of Intimacy in Encounters and Relationships: Experimental studies of self-disclosure between strangers at bus stops and in airport departure lounges can provide clues about the development of intimate relationships. American Scientist. 1974;62(2):182-190. Langeslag SJ, van Strien JW. Regulation of romantic love feelings: Preconceptions, strategies, and feasibility. PLoS One. 2016;11(8):e0161087. doi:10.1371/journal.pone.0161087 Sorokowski P, Sorokowska A, Karwowski M, et al. Universality of the triangular theory of love: adaptation and psychometric properties of the triangular love scale in 25 countries. J Sex Res. 2021;58(1):106-115. doi:10.1080/00224499.2020.1787318 American Psychological Association. Love. Wong CW, Kwok CS, Narain A, et al. Marital status and risk of cardiovascular diseases: a systematic review and meta-analysis. Heart. 2018;104(23):1937‐1948. doi:10.1136/heartjnl-2018-313005 Horn AJ, Carter CS. Love and longevity: A social dependency hypothesis. Compr Psychoneuroendocrinol. 2021;8:100088. doi:10.1016/j.cpnec.2021.100088 Goodman RJ, Samek DR, Wilson S, Iacono WG, McGue M. Close relationships and depression: A developmental cascade approach. Dev Psychopathol. 2019;31(4):1451-1465. doi:10.1017/S0954579418001037 Roberson PNE, Fincham F. Is relationship quality linked to diabetes risk and management?: It depends on what you look at. Fam Syst Health. 2018;36(3):315-326. doi:10.1037/fsh0000336 He X, Shi W, Han X, Wang N, Zhang N, Wang X. The interventional effects of loving-kindness meditation on positive emotions and interpersonal interactions. Neuropsychiatr Dis Treat. 2015;11:1273‐1277. doi:10.2147/NDT.S79607 Williams L, Kim SH, Li Y, et al. How much we express love predicts how much we feel loved in daily life. PLoS One. 2025;20(7):e0323326. doi:10.1371/journal.pone.0323326 Freud S. The Freud Reader. New York: W. W. Norton & Company; 1995. Winston R, Chicot R. The importance of early bonding on the long-term mental health and resilience of children. London J Prim Care (Abingdon). 2016;8(1):12-14. doi:10.1080/17571472.2015.1133012 By Kendra Cherry, MSEd Kendra Cherry, MS, is a psychosocial rehabilitation specialist, psychology educator, and author of the \"Everything Psychology Book.\" See Our Editorial Process Meet Our Review Board Share Feedback Was this page helpful? Thanks for your feedback! What is your feedback? Helpful Report an Error Other Submit By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Cookies Settings Accept All Cookies"
}