{
  "url": "https://www.bakerdist.com/",
  "title": "Baker Distributing | Baker Distributing",
  "text": "Get Rewarded for Your Online Orders Earn points for every dollar of online purchases. The Baker Online Rewards program makes it easier than ever before to earn points when you purchase online. Points are redeemable for thousands of items. 5-Star Reviews of Baker Distributing Stores We owe much of our success and growth to persistent innovation and superior customer service. The feedback we receive from customers is something we greatly appreciate. Browse Our Product Lines Premium selection of residential & commercial equipment, parts and supplies for HVAC/R contractors. HVAC Quality, dependability and reliability in HVAC for over 50 years. Learn More Refrigeration Supermarket, grocery, restaurant and retail refrigeration solutions. Learn More Foodservice World-leading foodservice equipment solutions. Learn More Parts & Supplies Parts, supplies and accessories for installation & maintenance. Learn More Browse Top Brands from Leading Manufacturers Inventory available from industry leading manufacturers and top brands that are backed by exceptional warranties and consumer financing programs. Complete line of standard residential and smart home HVAC systems. Energy efficient, large refrigeration units for retail & warehouse. Proven reliability for commercial refrigeration applications. Find Contractor Tools & Technology Save time and money managing your orders, invoices and buyer accounts online. Check pricing, inventory availability and warranty information from any branch, at any time, nationwide from your mobile device. About Baker Distributing Company Baker Distributing Company is a wholesale distributor of HVAC, Foodservice, Commercial Refrigeration Equipment, Parts and Supplies. Since 1945, Baker Distributing Company has provided exceptional customer service and high quality HVAC/R and food service equipment, parts and supplies to customers all over the United States. Superior Service…Solid Solutions With more than 200 locations in 26 states, Baker Sales Centers offer a wide range of products for residential and commercial applications. Our knowledgeable counter and warehouse staff can provide product information and order assistance."
}