{
  "url": "https://www.britannica.com/on-this-day",
  "title": "On This Day - What Happened Today In History | Britannica",
  "text": "TODAY IN HISTORY February 4Featured Event 1938 Walt Disney's Snow White and the Seven Dwarfs is shown in theaters across the U.S. On this day in 1937, the animated feature film Snow White and the Seven Dwarfs came out in theaters nationwide. In a series of maneuvers that critics described as “Disney's folly,” producer Walt Disney mortgaged his house and sold his car in order to pay production costs. The movie, which cost $1.5 million ($36 million with inflation), was wildly successful and eventually became one of the highest-grossing of all time, showing that audiences were happy to watch full-length animated features. Read today's edition of Today in History > > PRNewsFoto/Walt Disney Studios Home Entertainment/AP Images Featured Biography Rosa Parks American civil rights activist 1973 Oscar De La Hoya American boxer 1959 Lawrence Taylor American football player 1947 Dan Quayle vice president of United States 1918 Ida Lupino American actress, director, and screenwriter 1913 Rosa Parks American civil rights activist More Events On This Day 2020 Politician Daniel arap Moi, who was Kenya's president for almost 25 years, died at age 95. He was noted for his pro-Western policies (which he carried forward from former Pres. Jomo Kenyatta), leading him to receive significant funds in development aid during the Cold War. Test your knowledge of African leaders William Campbell—The Chronicle Collection/Getty Images 2012 Florence Green, the last surviving veteran of World War I, died at age 110. Sort fact from fiction in our World War I quiz Chris Hill/British Ministry of Defence via AP Images 2004 The website Facebook was founded and launched by Harvard students Mark Zuckerberg, Eduardo Saverin, Dustin Moskovitz, and Chris Hughes as TheFacebook.com. The platform would later become the largest social network in the world. Read about Facebook's parent company Justin Sullivan—Getty Images News 2003 Yugoslavia officially changed its name to Serbia and Montenegro. Montenegro later declared its independence, splitting the territory into two separate countries. Take our quiz about European history Encyclopædia Britannica, Inc. 1974 Patty Hearst, heiress of the William Randolph Hearst newspaper empire, was kidnapped by members of the Symbionese Liberation Army. Hearst was allegedly brainwashed into participating in various organized crimes. Read more about how brainwashing works CSU Archive— Everett Collection Inc./age fotostock 1948 Ceylon (now Sri Lanka) gained independence from Great Britain, which had controlled the island (sometimes jointly with other European powers) since 1796. Listen to Sri Lanka's national anthem Encyclopædia Britannica, Inc. 1945 During the final stages of World War II, the Yalta Conference opened with Franklin D. Roosevelt, Winston Churchill, and Joseph Stalin meeting to plan the final defeat and occupation of Nazi Germany. AP Images 1938 Thornton Wilder's Our Town, a classic portrayal of small-town American life, made its Broadway debut. How much do you know about American writers? Brown Brothers 1932 The United States hosted its first Winter Olympic Games in Lake Placid, New York. Only 17 countries attended the games, and the organizers suffered huge financial losses. Take our obscure Olympic sports quiz © RDB—ullstein bild/Getty Images 1921 Feminist Betty Friedan, cofounder of the National Organization for Women and author of The Feminine Mystique (1963), was born. Take our quiz about female activists Smithsonian Institution 1906 Protestant theologian Dietrich Bonhoeffer was born in what is today Wrocław, Poland. Sort fact from fiction in our quiz about world religions © Jozef Sedmak/Shutterstock.com 1902 Charles Lindbergh, who was one of the best-known figures in aeronautical history, was born in Detroit, Michigan. He became famous for completing the first nonstop solo flight across the Atlantic Ocean. Watch a short video of Charles Lindbergh and his plane, the Spirit of Saint Louis Library of Congress, Washington, D.C. 1789 George Washington was elected to serve as the first U.S. president by a unanimous vote in the first electoral college. Test your knowledge of U.S. presidential elections Scala/Art Resource, New York 1787 Shays's Rebellion, an uprising in western Massachusetts in opposition to high taxes and stringent economic conditions, was defeated by the Springfield militia. The rebellion helped to influence the meeting of a Constitutional Convention. Take our quiz about plots and revolutions © John Bessa"
}