{
  "url": "https://questmix.com/bing-sporting-greats-quiz/",
  "title": "Bing Sporting Greats Quiz: 60 Questions and Answers - Questmix",
  "text": "Sports trivia gets the blood pumping almost as much as playing the games themselves. Nothing beats that rush when you know the answer before anyone else, or that moment of discovery when you learn something fascinating about your favorite athletes. Ready to test your sporting knowledge against some of the greatest competitors who ever lived? The following quiz covers legendary figures from across the sporting world – from tennis courts to football pitches, Olympic tracks to cricket fields. Some questions will feel like gentle warm-up exercises while others might leave you scratching your head. Take your time, trust your instincts, and see how many you can get right. All answers appear at the end, but no peeking until you’ve given each question your best shot! Bing Sporting Greats Quiz Questions Before jumping into the questions, grab a pen and paper to track your score. The answers to all questions can be found at the end of this section. Good luck! - Which boxer was known as “The Greatest”? A) Mike Tyson B) Muhammad Ali C) Joe Frazier D) George Foreman - How many Grand Slam singles titles did Serena Williams win in her career? A) 20 B) 23 C) 25 D) 28 - Which country has won the most FIFA World Cup tournaments? A) Germany B) Italy C) Argentina D) Brazil - Who holds the record for the most Olympic gold medals? A) Usain Bolt B) Carl Lewis C) Michael Phelps D) Larisa Latynina - Which NBA player scored 100 points in a single game? A) Michael Jordan B) Kobe Bryant C) Wilt Chamberlain D) LeBron James - Who won the first Wimbledon Ladies’ Singles title in the Open Era (1968)? A) Billie Jean King B) Margaret Court C) Ann Jones D) Virginia Wade - Which Formula 1 driver has won the most World Championships? A) Michael Schumacher B) Lewis Hamilton C) Sebastian Vettel D) Ayrton Senna - In cricket, who holds the record for the highest individual score in Test matches? A) Sachin Tendulkar B) Don Bradman C) Brian Lara D) Virat Kohli - Which team won the first Super Bowl in 1967? A) Green Bay Packers B) Kansas City Chiefs C) Dallas Cowboys D) Pittsburgh Steelers - Who is the all-time leading scorer in NHL history? A) Wayne Gretzky B) Gordie Howe C) Mario Lemieux D) Jaromir Jagr - Which tennis player has won the most Grand Slam men’s singles titles? A) Roger Federer B) Rafael Nadal C) Novak Djokovic D) Pete Sampras - Who broke Roger Bannister’s mile record in 1954? A) John Landy B) Herb Elliott C) Jim Ryun D) Peter Snell - Which female gymnast has won the most Olympic medals? A) Simone Biles B) Nadia Comaneci C) Larisa Latynina D) Shannon Miller - Who holds the men’s 100m world record? A) Carl Lewis B) Usain Bolt C) Tyson Gay D) Yohan Blake - Which golfer has won the most major championships? A) Tiger Woods B) Jack Nicklaus C) Ben Hogan D) Arnold Palmer - Who was the first female rider to win the Melbourne Cup? A) Michelle Payne B) Lisa Cropp C) Clare Lindop D) Kathy O’Hara - Which basketball player has the nickname “The Dream”? A) Michael Jordan B) Shaquille O’Neal C) Hakeem Olajuwon D) Magic Johnson - In which year did Pelé win his first FIFA World Cup with Brazil? A) 1958 B) 1962 C) 1966 D) 1970 - Who holds the record for most wickets in Test cricket? A) Shane Warne B) Anil Kumble C) James Anderson D) Muttiah Muralitharan - Which country won the first Cricket World Cup in 1975? A) Australia B) England C) India D) West Indies - Who was the first athlete to break the two-hour barrier in the marathon? A) Eliud Kipchoge B) Haile Gebrselassie C) Kenenisa Bekele D) Wilson Kipsang - Which female tennis player has won the most Grand Slam singles titles? A) Serena Williams B) Steffi Graf C) Martina Navratilova D) Margaret Court - In baseball, who holds the record for most career home runs? A) Babe Ruth B) Hank Aaron C) Barry Bonds D) Alex Rodriguez - Who won gold in the men’s 100m at the 1936 Berlin Olympics? A) Jesse Owens B) Carl Lewis C) Ralph Metcalfe D) Eddie Tolan - Which footballer has scored the most goals in FIFA World Cup history? A) Pelé B) Ronaldo Nazário C) Miroslav Klose D) Lionel Messi - Who was the first swimmer to win gold medals in five different Olympic Games? A) Michael Phelps B) Mark Spitz C) Ian Thorpe D) Dara Torres - Which horse won the Triple Crown in 2018, ending a 37-year drought? A) American Pharoah B) Justify C) Secretariat D) Seattle Slew - Who holds the record for most points in an NBA game? A) Kobe Bryant B) Michael Jordan C) Wilt Chamberlain D) LeBron James - Which boxer was nicknamed “Iron Mike”? A) Mike Tyson B) Evander Holyfield C) Lennox Lewis D) Joe Frazier - Who was the first gymnast to score a perfect 10 at the Olympics? A) Simone Biles B) Mary Lou Retton C) Nadia Comaneci D) Olga Korbut - Which cricket player has scored the most runs in Test matches? A) Sachin Tendulkar B) Ricky Ponting C) Brian Lara D) Jacques Kallis - Who has won the most Formula 1 races? A) Michael Schumacher B) Lewis Hamilton C) Sebastian Vettel D) Ayrton Senna - Which soccer player has won the most Ballon d’Or awards? A) Cristiano Ronaldo B) Lionel Messi C) Michel Platini D) Johan Cruyff - In golf, who has made the most holes-in-one on the PGA Tour? A) Tiger Woods B) Jack Nicklaus C) Arnold Palmer D) Hal Sutton - Who holds the record for most consecutive tennis Grand Slam singles titles? A) Steffi Graf B) Roger Federer C) Martina Navratilova D) Rod Laver - Which athlete won gold medals in both the Summer and Winter Olympics? A) Eddie Eagan B) Carl Lewis C) Clara Hughes D) Christa Luding-Rothenburger - Who was the first baseball player to have his number retired? A) Babe Ruth B) Lou Gehrig C) Jackie Robinson D) Ted Williams - Which cyclist has won the most Tour de France titles (excluding stripped titles)? A) Eddy Merckx B) Jacques Anquetil C) Bernard Hinault D) Miguel Indurain - Who is the youngest player to score in a FIFA World Cup final? A) Pelé B) Kylian Mbappé C) Ronaldo Nazário D) Diego Maradona - Which female athlete has won the most Olympic gold medals? A) Larisa Latynina B) Katie Ledecky C) Allyson Felix D) Jenny Thompson - Who was the first NBA player to score 30,000 career points? A) Michael Jordan B) Kareem Abdul-Jabbar C) Wilt Chamberlain D) Karl Malone - Which country has won the most Olympic medals in total? A) United States B) Soviet Union C) China D) Great Britain - Who holds the record for the fastest serve in tennis? A) Andy Roddick B) Roger Federer C) Sam Groth D) John Isner - Which hockey player scored the “miracle goal” for Canada in the 1972 Summit Series? A) Bobby Orr B) Wayne Gretzky C) Paul Henderson D) Gordie Howe - Who has won the most World Snooker Championships? A) Stephen Hendry B) Ronnie O’Sullivan C) Steve Davis D) Ray Reardon - Which athlete broke Bob Beamon’s long-standing long jump world record at the 1991 World Championships? A) Carl Lewis B) Mike Powell C) Ivan Pedroso D) Dwight Phillips - Who was the first woman to swim the English Channel? A) Gertrude Ederle B) Florence Chadwick C) Annette Kellermann D) Mercedes Gleitze - Which rugby team has won the most Rugby World Cup tournaments? A) New Zealand B) Australia C) South Africa D) England - Who was nicknamed “The Black Pearl” in soccer? A) Pelé B) Eusébio C) Didier Drogba D) George Weah - Which boxer holds the record for the longest undefeated streak? A) Floyd Mayweather Jr. B) Rocky Marciano C) Joe Calzaghe D) Ricardo Lopez - Who holds the record for most goals in an NHL season? A) Wayne Gretzky B) Mario Lemieux C) Brett Hull D) Alexander Ovechkin - Which female track and field athlete has won the most Olympic medals? A) Allyson Felix B) Merlene Ottey C) Jackie Joyner-Kersee D) Fanny Blankers-Koen - Who was the first baseball player to reach 3,000 hits and 500 home runs? A) Hank Aaron B) Willie Mays C) Babe Ruth D) Ted Williams - Which country has won the most Davis Cup titles in tennis? A) United States B) Australia C) Spain D) Great Britain - Who holds the record for most consecutive matches scored in soccer? A) Lionel Messi B) Cristiano Ronaldo C) Robert Lewandowski D) Gerd Müller - Which athlete is nicknamed “Lightning Bolt”? A) Usain Bolt B) Michael Johnson C) Carl Lewis D) Justin Gatlin - Who has won the most Indianapolis 500 races? A) A.J. Foyt B) Rick Mears C) Al Unser D) Helio Castroneves - Which female golfer has won the most major championships? A) Annika Sörenstam B) Patty Berg C) Babe Zaharias D) Mickey Wright - Who holds the record for most consecutive baseball games played? A) Lou Gehrig B) Cal Ripken Jr. C) Joe DiMaggio D) Pete Rose - Which basketball coach has won the most NCAA championships? A) Mike Krzyzewski B) John Wooden C) Adolph Rupp D) Pat Summitt Bing Sporting Greats Quiz Answers - B) Muhammad Ali - B) 23 - D) Brazil - C) Michael Phelps - C) Wilt Chamberlain - A) Billie Jean King - A) Michael Schumacher & B) Lewis Hamilton (tied at 7) - C) Brian Lara - A) Green Bay Packers - A) Wayne Gretzky - C) Novak Djokovic - A) John Landy - C) Larisa Latynina - B) Usain Bolt - B) Jack Nicklaus - A) Michelle Payne - C) Hakeem Olajuwon - A) 1958 - D) Muttiah Muralitharan - D) West Indies - A) Eliud Kipchoge - D) Margaret Court - C) Barry Bonds - A) Jesse Owens - C) Miroslav Klose - A) Michael Phelps - B) Justify - C) Wilt Chamberlain - A) Mike Tyson - C) Nadia Comaneci - A) Sachin Tendulkar - B) Lewis Hamilton - B) Lionel Messi - C) Arnold Palmer - D) Rod Laver - A) Eddie Eagan - B) Lou Gehrig - All tied at 5 wins: B) Jacques Anquetil, C) Bernard Hinault, and D) Miguel Indurain - A) Pelé - A) Larisa Latynina - B) Kareem Abdul-Jabbar - A) United States - C) Sam Groth - C) Paul Henderson - A) Stephen Hendry - B) Mike Powell - A) Gertrude Ederle - A) New Zealand & C) South Africa (tied with 4 each) - A) Pelé - D) Ricardo Lopez - A) Wayne Gretzky - A) Allyson Felix - B) Willie Mays - A) United States - C) Robert Lewandowski - A) Usain Bolt - All tied with 4 wins: A) A.J. Foyt, B) Rick Mears, C) Al Unser, and D) Helio Castroneves - B) Patty Berg - B) Cal Ripken Jr. - B) John Wooden How did you score? Tallying up your correct answers might leave you feeling like a sports genius or wanting to brush up on your athletic history. The beauty of sports trivia lies in how it connects fans across generations, letting you appreciate the giants whose records still stand today alongside current stars making their mark. Whether you aced this quiz or picked up some new facts along the way, the amazing achievements of these sporting legends show just how far human potential can stretch when fueled by dedication, talent, and competitive spirit."
}