{
  "url": "https://my.clevelandclinic.org/health/body/23016-thymus",
  "title": "Thymus: The Function of the Gland & Why it is Important",
  "text": "Your thymus is a small gland in the lymphatic system that makes and trains special white blood cells called T-cells. The T-cells help your immune system fight disease and infection. Your thymus gland produces most of your T-cells before birth. The rest are made in childhood and you’ll have all the T-cells you need for life by the time you hit puberty. Advertisement Cleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy The thymus is a small gland that’s part of your lymphatic system. Your lymphatic system is made up of a network of tissues, vessels and organs such as your tonsils, spleen and appendix. Your lymphatic system is a part of your immune system. It helps defend against infection and disease. Advertisement Cleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy The primary function of the thymus gland is to train special white blood cells called T-lymphocytes or T-cells. White blood cells (lymphocytes) travel from your bone marrow to your thymus. The lymphocytes mature and become specialized T-cells in your thymus. After the T-cells have matured, they enter your bloodstream. They travel to your lymph nodes (groups of cells) and other organs in your lymphatic system, where they help your immune system fight disease and infection. Your thymus gland is also part of your endocrine system. Your endocrine system makes and releases hormones that control the functions of your body. Your thymus produces and releases several hormones including: The thymus gland is most active during childhood. Your thymus actually starts making T-cells before you’re born. It keeps producing T-cells and you have all the T-cells you need by the time you reach puberty. After puberty, your thymus gland slowly starts to decrease in size and is replaced by fat. Advertisement The location of your thymus gland is in your upper chest behind your breastbone (sternum). It sits between your lungs in a part of your chest called the mediastinum. Your thymus is just in front of and above your heart. The thymus gland is pinkish-gray. It is made up of two irregularly shaped parts (lobes). The lobes have lots of small bumps called lobules on the surface. The thymus gland is quite big in babies and children. It reaches its biggest weight of about 1 ounce during puberty. After puberty, it begins to shrink, and in older adults, it’s rather small. Many conditions and disorders can affect your thymus gland. The issues range from genetic disorders present at birth to diseases most commonly seen in adults. These issues include: Some conditions can occur that are related to thymus cancer but aren’t directly caused by the thymus tumors. These conditions include: Other kinds of tumors can form in your thymus as well. These tumors include lymphoma and germ cell tumors. However, these aren’t considered thymoma or thymic carcinoma. The most common signs of thymus cancer include: The thymus gland is an important part of your immune system. It helps train the white blood cells that protect your immune system. Fortunately, most of your T-cells were produced before you were even born, and the rest were made during childhood and throughout puberty. Therefore, adults don’t really need a thymus. If a baby or child has to have their thymus removed, there can be potential health issues. Removal could lead to infections, autoimmune conditions, allergies and an increased risk of cancer. Advertisement Your thymus is a gland that helps protect your immune system. Your thyroid is a gland in the endocrine system. It produces hormones that control your growth and metabolism (how your body uses energy). Your thyroid is located in the front of your neck, below your voice box (larynx). You may not have even known it was there, but your thymus gland served an important function. As part of your lymphatic system, your thymus gland produced special white blood cells called T-cells that help your immune system. Most of your T-cells matured by the time you hit puberty, and they should help protect you against disease and infection for life. Rarely, conditions related to the thymus can occur. If you develop thymus pain or other signs of thymus cancer, talk to your healthcare provider. Advertisement Learn more about the Health Library and our editorial process. Cleveland Clinic's health articles are based on evidence-backed information and review by medical professionals to ensure accuracy, reliability, and up-to-date clinical standards. Cleveland Clinic's health articles are based on evidence-backed information and review by medical professionals to ensure accuracy, reliability, and up-to-date clinical standards. Hormonal conditions can be tricky to find and complicated to treat. The experts in endocrinology at Cleveland Clinic are here to provide the best care."
}