{
  "url": "https://www.seagramsgin.com/our-story/",
  "title": "Our Story | Seagram's Gin",
  "text": "Our Story About Us Since the very beginning, we’ve proudly made our gins in America. Our flagship Extra Dry Gin is a masterful balance of botanicals, among which are juniper berries, sweet and bitter orange, coriander and angelica. Inspired by the success of our award-winning Extra Dry, Seagram’s Gin became the first gin brand to innovate using flavored liqueurs combined with it. Our Twisted Gins lineup features lime, pineapple, peach, apple, red berry, melon and grape flavors, which have also earned top awards in the gin category. On every quality-made product, we display our core values of Integrity, Craftsmanship and Tradition, instilled by entrepreneur and brand founder Samuel Bronfman. Our heritage of premium quality and smooth flavor distinguish Seagram’s Gin from others. We think you can agree that our lineup makes Seagram’s Gin an essential for those whose personal satisfaction is exemplified by unique expression — just as Mr. Sam intended. America’s Gin. Your Gin. Seagram's Gin Standard Integrity Since 1939, the Seagram’s Gin crest represents a commitment to authenticity. The virtue of our spirit is inspired by many generations of those who have found unique expression in our award-winning gin. Seagram's Gin Standard Craftsmanship We’re famously known for our smooth flavor. That’s because Seagram’s Gin’s master distillers take pride in crafting every last drop that fills each bottle. Seagram's Gin Standard Tradition We take pride in our long-standing American heritage. Thanks to innovator and entrepreneur Samuel Bronfman, the power of our progression proves Seagram’s Gin is as modern as tomorrow. Our History Late 1800s The original Seagram's franchise began when Joseph E. Seagrams became sole owner of a distillery in Waterloo in 1883. The company became known as Joseph E. Seagram & Sons. 1920s In 1928, the story of the Seagram's spirits empire began with Samuel Bronfman when he acquired the Seagram's brand. Bronfman’s entrepreneurial character successfully guided the brand through the Prohibition Era’s challenging times. 1930s Always one to look ahead, Samuel Bronfman stockpiled whiskey in anticipation of the end of Prohibition in 1933. Following the end of Prohibition, Bronfman had his sights set on a new endeavor. Later that decade in 1939, Seagram's Gin, dubbed the \"Ancient Bottle,” officially hit the shelves. 1940s Regarded as a marketing genius, Samuel Bronfman promoted Seagram’s brands with aristocratic imagery in newspaper ads that broadly appealed to all cultures. During this time, the company expanded into the production of other liquors like rum and wine. Diversification continued through the next decade when Bronfman invested in oil companies. 1950s By this time, Seagram's was the leading spirits marketer in the United States. Samuel Bronfman appointed his son Edgar to company president in 1957. The Seagram’s empire continued to grow as additional distilleries and brands were added to its diverse portfolio. 1960s During the early part of the decade, our famed Extra Dry Gin hit the market. By the end of 1965, the company was operating in 119 countries and surpassed $1 billion in sales. Edgar Bronfman continued to pursue opportunities outside the liquor industry. Following an abiding interest in the film industry, he scooped up MGM Studios and acted as its chairman. 1970s In 1975, the company name changed to The Seagram Company Ltd. Edgar Bronfman became increasingly known for his local philanthropic work and political action. Meanwhile, the family business continued to appeal to its broad customer base with trendsetting ads. 1980s Diversification continued to drive much of Seagram’s investment strategy at this time. Meanwhile, Seagram’s Gin maintained its high level of quality as the perfect mixer for a range of cocktails. 1990s After Edgar Jr. succeeded his father as company head in the late 1980s, the young exec made bold moves, selling several mid-range brands to concentrate on premium labels. In addition, he made huge forays into entertainment, buying and selling stakes in Time Warner, Inc., Universal Pictures and major music labels. 2000s By 2000, Pernod Ricard, the world’s second largest spirits-selling company, took over most of the Seagram’s business. Their mission: Reinvigorate the gin’s following as a premium brand for forward-thinking generations of new customers. Today, Seagram’s Gin is still produced in the United States and continues to dominate its category as America’s leading gin brand."
}