{
  "url": "https://www.balconidolciaria.com/en/about-us/",
  "title": "About us - Balconi Dolciaria",
  "text": "About us The Balconi Way Our Mission We love to make everyday moments taste better. This is what unites and inspires us daily—for our clients, consumers, and colleagues alike. Our values Accountability We take responsibility and deliver on our promises.Agility We act proactively and flexibly, adapting swiftly to change.Discipline We stay focused on priorities and set high performance standards.TEAMWORK We are stronger together—combining energy, skills, and experience.Transparency We build trust through openness, honesty, and respect.Growth, Innovation & Sustainability As part of Valeo Foods Group, we are committed to building a sustainable future for our people, clients, communities, and the planet. We drive efforts to reduce environmental impact, invest in health and safety initiatives, enhance training and development, and nurture an inclusive workplace where everyone can thrive. We work closely with our supply chain partners to source sustainable ingredients and packaging, and actively support the communities in which we operate. Local Heart, Global Vision At Balconi, we think big. While we are rooted locally, as part of Valeo Foods we operate across major European and international markets. Our true value lies in the people who contribute daily to our success—no matter where they are. Joining Balconi means becoming part of a global community where ideas, cultures, and talents converge to create something unique. There are no limits to your growth here. Voices from our team Feedback from the Valeo Voice Survey 2025: Your talent matters and we cant wait to meet you. At Balconi, we believe in the power of people. Every day we work together to make ordinary moments special, guided by our values of Reliability, Agility, Focus, and Teamwork. If you’re seeking a dynamic environment where you can grow, collaborate, and make an impact, you’re in the right place. Let’s create something great together."
}