{
  "url": "https://www.flyertalk.com/forum/british-airways-british-airways-club/1604608-ba-trip-report-index.html",
  "title": "BA Trip Report Index - FlyerTalk Forums",
  "text": "Last edit by: Nimrod1965 This wiki and thread should only include trip reports where at least one BA operated flight or BA operated lounge is featured in the report. Please populate the wiki with trip reports posted this year, listed alphabetically by author. If you have more than one trip report to share, please list reports in date order of trip, starting with the latest at the top. Please include the author's name, title of report (as posted) and link to the report (on FlyerTalk). 2025 Nimrod1965 ORD-LHR FIRST Nimrod1965 LHR-ORD FIRST TPRUN LHR-BER CE TPRUN BER-LHR CE TPRUN First Class 777 LHR-BOS TPRUN First Class 777 BOS-LHR 2024 Trip Reports JapesUK BA Holidays 6 day tier point run JapesUK A.I. goes to Aberdeen JapesUK A trip to two continents - Istanbul JapesUK Back to Bucharest for a toothy treat JapesUK A Milan Day Trip T8191 Tottering to Crete T8191 More tottering by the old stick users TPRun Return flight from Corfu to LHR - Club Europe - May 2024 TPRun LHR to Prague - CE - Sept 2024 TPRun LHR - Munich - CE - Sept 2024 TPRun Munich - LHR - CE - Oct 2024 TPRun LHR-Delhi - Club World - Oct 2024 TPRun LHR to Istanbul - Club Europe - Nov 2024 TPRun LHR to Athens - Club Europe - Nov 2024 TPRun Athens to LHR - Club Europe - Nov 2024 TPRun DUB-LHR-JFK Nov 2024 TPRun JFK-LHR-DUB Dec 2024 2023 Trip Reports JapesUK A Christmas Escapade, Washington and my first first JapesUK A Stockholm Weekend JapesUK Brussels, no sprouts! A short hop for hops JapesUK Bucharest and back, again, and again, and again JapesUK Birmingham, Business, and Balti JapesUK A Budapest long weekend Spongthrush LCY to Billund Dornier 328Jet day trip T8191 JER to PHX via LAS and other disruptions T8191 CHQ-ing in to Rethymno TPRun BA296 8 Sept ORD-LHR A380 business class upper deck front half. TPRun B293 LHR-IAD 31 August. F on A380 Please populate the wiki with trip reports posted this year, listed alphabetically by author. If you have more than one trip report to share, please list reports in date order of trip, starting with the latest at the top. Please include the author's name, title of report (as posted) and link to the report (on FlyerTalk). 2025 Nimrod1965 ORD-LHR FIRST Nimrod1965 LHR-ORD FIRST TPRUN LHR-BER CE TPRUN BER-LHR CE TPRUN First Class 777 LHR-BOS TPRUN First Class 777 BOS-LHR 2024 Trip Reports JapesUK BA Holidays 6 day tier point run JapesUK A.I. goes to Aberdeen JapesUK A trip to two continents - Istanbul JapesUK Back to Bucharest for a toothy treat JapesUK A Milan Day Trip T8191 Tottering to Crete T8191 More tottering by the old stick users TPRun Return flight from Corfu to LHR - Club Europe - May 2024 TPRun LHR to Prague - CE - Sept 2024 TPRun LHR - Munich - CE - Sept 2024 TPRun Munich - LHR - CE - Oct 2024 TPRun LHR-Delhi - Club World - Oct 2024 TPRun LHR to Istanbul - Club Europe - Nov 2024 TPRun LHR to Athens - Club Europe - Nov 2024 TPRun Athens to LHR - Club Europe - Nov 2024 TPRun DUB-LHR-JFK Nov 2024 TPRun JFK-LHR-DUB Dec 2024 2023 Trip Reports JapesUK A Christmas Escapade, Washington and my first first JapesUK A Stockholm Weekend JapesUK Brussels, no sprouts! A short hop for hops JapesUK Bucharest and back, again, and again, and again JapesUK Birmingham, Business, and Balti JapesUK A Budapest long weekend Spongthrush LCY to Billund Dornier 328Jet day trip T8191 JER to PHX via LAS and other disruptions T8191 CHQ-ing in to Rethymno TPRun BA296 8 Sept ORD-LHR A380 business class upper deck front half. TPRun B293 LHR-IAD 31 August. F on A380 BA Trip Report Index #1 Original Poster Moderator: The British Airways Club, Iberia Club, Airport Lounges and Eco-conscious Travel Join Date: Jan 2003 Location: London, UK Posts: 22,556 BA Trip Report Index There has been an astonishing array of high quality reports to be found in the Trip Reports forum. Each report is an absolute treat to read and our BA travellers have been a very busy bunch this year. Here is list of reports posted from 2014 onward chronicling your BA travels: 2020 BA reports: Genius1’s A Postcard from Portugal via The Qantas London Lounge Genius1’s In the Footsteps of Film Stars: The InterContinental Carlton Cannes and the Riviera Schwann’s Flying after lockdown: LHR-AMS on the BA B787-8 in Euro Traveller! spymon’s Friday 13th Part 1: The Strike Before Christmas THEOBCMAN’s Club Europe (Club World) BA 787-8 LHR > ZRH T8191's https://www.flyertalk.com/forum/trip...-oh-there.html 2019 BA reports: gw76's Ba f lhr-iad Genius1's The British Airways A350 Club Suite Experience Genius1's In the Shadow of Concorde: The British Airways Premium Experience Revisited spymon’s Flying My First Inaugural - London to Ljubljana stu1985's A week in Cape Town - BA F to the Southern Hemisphere T8191's The Caribbean [again] with BA in Club World. T8191’s UK to Virginia again, BA in Business of course! T8191's Malta with BA (again) and a bit of inconvenience. 2018 BA reports: Carfield's British Airways's Lackluster London City JFK BA 1 April 2018 Genius1’s Views of Venice with British Airways golfmad's Above & Beyond, British Airways and Chase. Elton John concert Dallas December 2018 Honeymoon Flyer's Our big trip to Australia with a few fun stopovers ianwall's BA: Inaugrual Flight to Nashvile (ex-DUB) - 4th May 2018 KARFA's Madeira Funchal Trip - 17-19 March 2018 spymon’s Going through HEL whilst eloping to Japan via BA, QR, JAL and some trains! stu1985's Two studs do New York - BA First Class stu1985’s Winter trip to Vancouver (via LA) in First Class T8191's https://www.flyertalk.com/forum/trip...es-all-ba.html T8191's https://www.flyertalk.com/forum/trip...w-lhr-phx.html T8191's BA to The Western Cape - 3 Towns in 2 Weeks 2017 BA reports: CMK10's Ancient Empires: Turkey and Greece via Delta One and Open Skies Biz Bed CMK10's Christmas on the Continent: Brussels, Paris, Lyon and Luxembourg (BA C, LX C) doctoravios's Video trip report: BA LHR-DME, QR DME-HND, Hyatt Regency Hakone, JAL 1st class lounge dylanks's BA F with Family to Europe for Winter Break florens's Pre-Christmas Week-end Getaway to London florens's A Special Week-end in London: BA FT Simulator Outing florens's https://www.flyertalk.com/forum/trip...day-road-trip- Genius1's Ancient Athens via Ancient 767s - BA Club Europe and the InterContinental (w/pics) Genius1's https://www.flyertalk.com/forum/trip...ub-europe.html Genius1’s The FlAAgship Experience: Vancouver, Los Angeles and New York inc.CX/QF First lounges Genius1’s Operation Oahu: British Airways Club and American Airlines First Class to Hawaii Innocent Abroad’s ARN to TLV on BA including New CE Catering, The First Wing and Air Force One! KARFA's Innsbruck Day Trip [BA] - 2 December 2017 KARFA's Barra Day Trip [BE] - 1 July 2017 megaloman’s LIVE: Plane spotting trip to Hong Kong, Singapore and Thailand Sealink’s BA296, 10 AUG, LHR-ORD, First Class Sealink's BA116, 04 JUN, JFK-LHR, Club World Sealink’s BA177, 31 MAY, LHR-JFK, First Class Sealink’s YYZ-LHR, 01 JAN, BA First Spymon's A Points Powered Weekend In Prague Spymon's Too Many Birthdays: BA (J), Some Trains, Cable Cars and Lots of Good Food stu1985’s Escaping the cold Scottish summer - Iberia (and some BA) to Valencia and Madrid stu1985's 2 studs do Hawaii (via AMS, DUB, JFK, LAX and CDG for good measure on the way back!) T8191's An unusual hotel in Antigua T8191's Eating South Africa T8191’s Malta with BA in Club Europe T8191’s https://www.flyertalk.com/forum/trip...eeekonomy.html T8191's Aloha again, to OGG with BA & AA in the good seats. TheFlyingDoctor’s Destination: Unknown - picking flights at the airport by the roll of a die! TheFlyingDoctor’s Europe, South to North: Maspalomas, Gran Canaria to Longyearbyen/Pyramiden, Svalbard 2016 BA reports: Caciucco’s London to Moorea and back via Iguazu Falls, Easter Island and Macchu Picchu (BA J, F, chris1979's mini (most pics) TR: ex EU NYC, Vegas, Palm Springs and LA DaveNCL’s The Account Man Visits San Francisco for Easter - BA F/J dylanks’s https://www.flyertalk.com/forum/brit...-trip-ggl.html dylanks’s A trip of firsts: HKG and PEK on AA/CX F/J Gary999’s My first experience of BA Club Europe LGW-AMS-LGW Gary999’s LGW-JER-LGW My second taste of BA's Club Europe Gary999’s LHR-ORY-LHR My third Club Europe adventure Genius1’s https://www.flyertalk.com/forum/brit...al-report.html Genius1's https://www.flyertalk.com/forum/trip...ess-class.html golfmad’s Above & Beyond: Amazing Events Brought To You By British Airways & Chase Innocent Abroad’s My Own Private Odyssey - TLV-LHR-PHL-ITH on BA J/F/W (777s) and AA Y (Dash 8) Innocent Abroad’s An Innocent Abroad - UK/EU on BA/AB Jamier45’s Jamier45 visits the colony down under! Jermyn’s Transatlantic showdown AA J vs BA F (plus Splash Suite at Andaz 5th) lostinlondon’s Home for Thanksgiving - BA Club World LHR-IAD lostinlondon’s BA Club Europe LHR-MAD Feb 2016 lostinlondon’s BA Club Europe to Porto + Pics from Portugal megaloman's https://www.flyertalk.com/forum/brit...ight-year.html mikeyfly’s [LIVE] Weekend trip to Costa Rica in BA J & F mikeyfly’s https://www.flyertalk.com/forum/brit...789-first.html nickyjames's British Airways' newest aircraft - Club World to India on the 787-9 paul4040’s https://www.flyertalk.com/forum/brit...ull-works.html Sealink's LHR - GOT; 12 MAR, Club Europe Sealink's LGW - JER; 05 MAR, Club Europe Sealink's LHR - BIO; 06 Feb, Club Europe Sealink's LHR -KRK, 29 JAN 16: Economy Sealink’s Wic-edi-lcy; ba4066/8719; 28 feb Sealink's Mallorca then BA Palma - London City; Club Europe Sealink's LHR - HAJ, 01 APR, Club Europe Sealink's Hannover & Hameln then BA979 to Heathrow, Club Europe Spymon's High Speed Trains and Slow Food - Italy and France by Train and Plane stu1985’s A Brits take on the US Election - ABZ-OSL-LHR-JFK-LAX-SFO (SK, BA, AA) stu1985’s A long weekend in Ancient Athens - BA business class stu1985’s Safari in south Africa - BA: ABZ-LHR-JNB-CPT-PLZ-CPT-JNB-LHR-ABZ - BA Y,F,C stu1985’s A trip to Denmark's second city - Aarhus. BA: ABZ-LHR-GOT-AAR return T8191's TR: Older people travel too - JER-HNL again! T8191’s https://www.flyertalk.com/forum/trip...r-lgw-kin.html T8191’s AZ and AK with AA T8191’s BA in Business, JER-UK-IAD T1819's BA in Club World to the Western Cape Tiffywren's Philadelphia Freedom - BA0068, first time in CW. Tiffywren's Marrakech Express: LGW to RAK in Club Europe Tiffywren’s A Spring Break - Six Days, Six Countries, Twelve Flights 2015 BA reports: aks120’s RTW - BA, CX, QF, KL, MH J + IC & CP Hotels andset1191’s British Airways First Class, LHR-JFK BahrainLad’s British Airways Open Day 2015, Heathrow - inc. A350 prototype F-WWCF callenrandolph’s DUB-LHR-DUB on British Airways Club Europe chris1979’s Weekend in Hong Kong: BA First, Four Seasons and Hong Kong chris1979’s https://www.flyertalk.com/forum/brit...ssiemouth.html chris1979’s Thailand: Bangkok, Chiang Mai, Phuket - incl QR Business B787 & A380 and Amanpuri chris1979’s TR (live ish): FRA CDG LHR JFK CLT PUJ / PUJ PHL MAD BCN LGW CMK10’s https://www.flyertalk.com/forum/trip...aa-f-ib-c.html DaveNCL's The Life of a Travelling Account Man dylanks's BA/Eurostar 2 week business trip PHX-LHR-DUB-LHR-EDI-LCY-DUB-LHR-PHX dylanks's BA/US 2.5 week business trip PHX/LHR/MUC/ARN/DUB/BOS dylanks’s BA Nov2015 2 week business trip (PHX/LHR/DUB/LCY/BGO/STR/MUC) Flexible preferences's Video TR - British Airways First Class to San Francisco Genius1’s https://www.flyertalk.com/forum/trip...ce-w-pics.html Genius1's The City by the Bay via JFK - The BA and AA Premium Experience inc First and the A380 headingwest's Weekend in Helsinki - British Airways from Vienna HIDDY’s https://www.flyertalk.com/forum/trip...x-j-ba-ce.html jackr27’s https://www.flyertalk.com/forum/brit...-route-tr.html Jamier45's TR of my First TP run to HNL Jermyn’s Sun, Snow and Sushi - One Week, OneWorld F Round The World (BA F, AA F, JL F-J-Y) jewree’s BA286, First Class, SFO-LHR JimEddie's Another Tier Point/Milage Run to Hawaii [Semi Live] KARFA’s https://www.flyertalk.com/forum/trip...ne-2015-a.html LondonAndy’s British Airways Explore and Discover Day at LHR - 6 June 2015 lorelai’s British Airways A380 F LHR - SFO / LAX - LHR matthandy’s https://www.flyertalk.com/forum/trip...-w-hotels.html me2’s First Class LHR to Washington merlinwiz2k’s First trip report - 5 days in Tokyo (LHR-ARN//ARN-DOH-HND and back), BA Y, QR J MrMutton’s A weekend in Belfast on BA PantsFlyer’s BA Club DUB-LHR-LAX-LHR-DUB with a 3yr Old Prestwickuk’s Escape from the Pankot Palace! MAA to LHR October 2014 rxfleming and Filthy Monkey’s A Weekend in Orlando with Filthy Monkey and rxfleming (BA/AA Y/J/F Class) Sealink’s LCY-IOM, Eastern Airways for BA, 16 OCTOBER Sealink’s IOM-LCY, Eastern Airways for BA, 18 OCTOBER shefgab’s Hawaii Big Island for New Year. BA, AA, US in J & F shgroamer's DFW-AUH, DXB-LHR-DFW (with a diver to Iceland) in EY/BA F Spymon's What Better Way to Celebrate than a T3 Lounge Crawl (BA J/Y) Spymon's https://www.flyertalk.com/forum/trip...ekend-away.htm Spymon's Three Birthdays Featuring BA vs Easyjet, Lots of Food and Amazing Mountain Landscapes stu1985's A quick trip to Bilbao - with BA and Iberia stu1985’s 30th birthday trip...... ABZ-DUB-LHR-LAX-HNL-OGG-HNL-LIH-HNL-LAX-LHR-DUB-ABZ stu1985's A French wedding with a mix of BA and AF - ABZ-LHR-ORY-BVE-BOD-CDG-LHR-ABZ stu1985’s Another BA trip in Club Europe......to Lisbon! TheFlyingDoctor's LCY-SNN-JFK-YVR/LAX-LHR in BA and CX J, plus Vancouver to Los Angeles by train! TheFlyingDoctor’s British Airways 737 staff farewell flight T8191’s Not BA to the USA, via DUB (of course) T8191’s TR: JER-HNL with BA and AA by two Senior Citizens T8191's TR: Our first BA First, and our first visit to St Lucia 2014 BA reports: AndrewE’s BA F-Class A380 | LHR - HKG andset1191’s The Curse of British Airways Toilets, OneWorld Round the World in Business BahrainLad’s A business traveller's day in Frankfurt on BA BahrainLad’s British Airways Club Europe Business Class, London to Faro BahrainLad’s Video TR: London to Newark in British Airways First BAwjh93’s Trip Report: BA(F) LHR - JNB | BA(Y) JNB - WDH | BA(Y) VFA - JNB | BA(F) JNB - LHR billinghamn’s Live TR: MAN-LHR-BRU-LHR-JFK-MIA-SEA/SFO-LAX-JFK-LHR-BRU-LHR-MAN billinghamn’s Live TP Run: Hawaii and San Juan Double TP Run! billinghamn’s Live Trip Report: MAN-LHR-HEL Calchas’ Ibiza and Madrid (via Edinburgh) by train, tram and plane CHOPCHOP767’s BOS to BOM and back in J; LH v. BA chris1979’s https://www.flyertalk.com/forum/trip...s-ams-hnl.html Claret147’s Trip Report: LHR - AUH with BA in First + Fairmont Bab Al Bahr + Golf! CMK10’s Hungary Man. Spring Break in Budapest with the return in British Airways First Class corporate-wage-slave’s https://www.flyertalk.com/forum/trip...-oneworld.html courtster’s Another IB J TP Run.. LHR-ORY-JFK-SFO-LAX-LAS-LAX-JFK-ORY-LHR (All J AA, BA, EC) csutter’s Live TR: Boston, Toronto, New York - 9 flights in 9 days csutter’s Live TR: Boston, Toronto, New York - 9 flights in 9 days dat4life’s A Tale of Two Cities (AA New 77W J and Old J, AF J, BA Y, IB Y) dylank’s Trip Report: BA CW PHX-LHR-ZRH//FCO-LHR-PHX, with family and IRROPS dylank's https://www.flyertalk.com/forum/brit...rspective.html ellie_nz's BA Club World fun! A NY detour, Chicago and some Langham time! GDOCP's Mini TR: Boeing 747-400 on BA UK Domestic GLA-LHR Genius1’s Letters from Lisbon - British Airways Euro Traveller inc. lounges (w/pics) Genius1’s Dreamliner from Stockholm - British Airways Club World/Europe (w/pics) Genius1’s Business in Barcelona - British Airways Club Europe (w/pics) Jenzo’s BA787 CW LHR-EWR, a few days in NYC and D.C with Pictures jewree’s BA286, First Class, SFO-LHR Joely’s Japan - Toasty warm toilet seats a review (with a little bit of flying thrown in) Joely’s Mini TR - View from the back of a BA 787 KARFA’s https://www.flyertalk.com/forum/trip...er-2014-a.html KARFA’s Seattle, & NYC for 6hrs (LBA-LHR-ORY-LHR-SEA-JFK-ORY-LHR, BA Y&J, AA F, EC J) Dec '13 KARFA’s TR - Jersey for a weekend away (LGW-JER-LGW, BA J) - July 2013 KARFA’s https://www.flyertalk.com/forum/trip...k-y-jan14.html Kevincm’s The Last Push! 700TP to BA Gold with AA and Openskies in C! LondonAndy's A trip report to HNL - a lifetime dream and a Gold Card renewal louislitt’s LHR to LAX Y & Y+ BA A380 ma91pmh’s Best of British: BA New First to Heathrow from Washington DC matthandy’s Flyertalk BA Board Jersey Do 2014 matthandy’s A Luxury Weekend in Singapore – BA First SYD-SIN Return & The Fullerton Bay Hotel Moomba’s Planes, boats, buses, cars, and a train - Burma Revealed Moomba’s https://www.flyertalk.com/forum/trip...-oneworld.html MrandMrsJones’ Dubai to the Arctic: BA J, FI J, private KingAir and ski-equipped Twin Otter! obiterdictum’s // Under-age in America - LHR-SFO-PHX-FLG-PHX-LAS-LGW // obiterdictum’s // LHR - SIN // 10 days in Asia-lite // oneworld82’s LH New F (DFW-FRA) vs BA F (LHR-LAX) + French Riviera, Brussels, Luxembourg, and NYE Pat Jordan’s LHR-DUB (British Airways) Petrus’ Another go on BA1, the Banker Shuttle between London City and JFK Petrus’ Chasing the Big Win: MMX-ARN-FRA-LAX-PHX-SEA-YVR-SEA-LHR-ARN incl. LH F, US F, BA J.. rruaco’s Trip report - LHR BOS in CW (OpUp to F) rxfleming and Filthy Monkey’s Live TP: Maui for the Weekend (AA J/F, BA Y/J/F) Sixth Freedom’s Barcelona | BA Club Europe | a beautiful horizon | gargoyles | fully nude mermaids Spymom’s South India: Featuring BA F, 9W, 6E, SG and the Indian Railways (and lots of food!) stimpy’s My little World Cup story - Bad, Good, Great, Bad again stut’s Vanakkam and Ayubowan! London - Chennai - Colombo and back in BA J and UL Y stut’s An unglamorous TR to Andhra Pradesh and Tamil Nadu (BA/LB/SG Y/W) stu1985's An escape from British summer - BA Club Europe to Malta stu1985’s A long weekend in the Czech Republic - ABZ-LHR-PRG on BA TheFlyingDoctor’s https://www.flyertalk.com/forum/trip...en-hotels.html theLuxuryTravelExpert’s British Airways 747 Business Class from LHR to SFO (Upper Cabin) theLuxuryTravelExpert’s My second trip report: British Airways Club World LHR-PHX Tim_T’s Live (award) TR : 51.5 hours Travelreviewguy’s British Airways Club Europe Heathrow to Athens T8191’s https://www.flyertalk.com/forum/trip...r-lgw-mla.html T8191’s https://www.flyertalk.com/forum/brit...cw-novice.html vgang’s Weekend in Athens, Greece with BA and The Margi Hotel William Agius’ Air Serbia Delights, BA Disappointment, Easyjet Surprise and a bit of Tarom 2013 BA reports: https://www.flyertalk.com/forum/brit...directory.html Please feel free to use this thread as a noticeboard for all new BA reports. A link to this thread will be added to the forum dashboard. Apologies to those whose reports I've missed. Please post any errors or omissions and indeed new reports to this thread and we'll add them to the index as we go. Last edited by Prospero; Aug 7, 2020 at 1:09 pm Reason: updated to 8 Aug 2020 #5 Join Date: May 2009 Location: London Programs: BAEC Posts: 3,031 #9 Original Poster Moderator: The British Airways Club, Iberia Club, Airport Lounges and Eco-conscious Travel Join Date: Jan 2003 Location: London, UK Posts: 22,556 For the avoidance of doubt, from now on all trip reports should be posted in the Trip Reports forum. Guys, you're going to have to get used to browsing the TP forum for your regular digest of travel reports. The post traffic of BA forum is off the charts, at circa 20,300 posts per month. That near on equal to the monthly post traffic of the AA, UA, and DL forums combined. It's not a big ask at all, now is it? Prospero Moderator: BA forum It's not a big ask at all, now is it? Prospero Moderator: BA forum #10 Join Date: Mar 2008 Location: North West, UK Programs: BA GfL (GGL/CCR), Hilton Diamond Posts: 2,022 My Helsinki TR is also still in the BAEC forum. See here: http://www.flyertalk.com/forum/briti...er-easter.html #11 Join Date: Dec 2009 Location: Arizona Programs: BA (GGL G4L), AA (Gold), HH (Diamond); Marriott (Gold) Posts: 3,018 My other big trip report from this year might be fun, even though no BA flights were involved: http://www.flyertalk.com/forum/briti...rspective.html It was my first time flying CX J, so I did a TR from the perspective of a BA gold. Thanks Prospero for setting this up! Thanks Prospero for setting this up! #12 Join Date: Apr 2009 Programs: BA Gold, Hilton Honors Diamond, Mucci de buveur de gin Posts: 3,138 That's not your TR though billinghman - just your thread asking for tips! Your TR is in the TR forum - http://www.flyertalk.com/forum/trip-...n-lhr-hel.html but does need to be added above! Your TR is in the TR forum - http://www.flyertalk.com/forum/trip-...n-lhr-hel.html but does need to be added above! #13 Join Date: Mar 2008 Location: North West, UK Programs: BA GfL (GGL/CCR), Hilton Diamond Posts: 2,022 That's not your TR though billinghman - just your thread asking for tips! Your TR is in the TR forum - http://www.flyertalk.com/forum/trip-...n-lhr-hel.html but does need to be added above! Your TR is in the TR forum - http://www.flyertalk.com/forum/trip-...n-lhr-hel.html but does need to be added above! #15 Join Date: Oct 2004 Location: PDX Posts: 2,284 Here's another to add to the index, the one which got me following live runs: http://www.flyertalk.com/forum/trip-...ack-twice.html http://www.flyertalk.com/forum/trip-...ack-twice.html"
}