{
  "url": "https://www.amazon.com/Korovka-Chocolate-Cookies-Individual-Gourmet/dp/B08NY1613B",
  "title": "Amazon.com : Korovka Chocolate Wafer Cookies with Chocolate Glaze in Individual Wraps 8.8oz/250g Gourmet Imported Russian Candy Sweets Bars, Tender Cocoa Cream Filling : Grocery & Gourmet Food",
  "text": "Skip to Main content About this item About this item About this item Buying options Compare with similar items Videos Reviews Keyboard shortcuts Search alt + / Cart shift + alt + C Home shift + alt + H Orders shift + alt + O Add to cart shift + alt + K Show/Hide shortcuts shift + alt + Z To move between items, use your keyboard's up or down arrows. .us Delivering to Boca Raton 33433 Update location Grocery & Gourmet Food Select the department you want to search in All Departments Alexa Skills Amazon Autos Amazon Devices Amazon Fresh Amazon Global Store Amazon Haul Amazon One Medical Amazon Pharmacy Amazon Resale Appliances Apps & Games Arts, Crafts & Sewing Audible Books & Originals Automotive Parts & Accessories Baby Beauty & Personal Care Books CDs & Vinyl Cell Phones & Accessories Clothing, Shoes & Jewelry Women's Clothing, Shoes & Jewelry Men's Clothing, Shoes & Jewelry Girl's Clothing, Shoes & Jewelry Boy's Clothing, Shoes & Jewelry Baby Clothing, Shoes & Jewelry Collectibles & Fine Art Computers Credit and Payment Cards Digital Music Electronics Garden & Outdoor Gift Cards Grocery & Gourmet Food Handmade Health, Household & Baby Care Home & Business Services Home & Kitchen Industrial & Scientific Just for Prime Kindle Store Luggage & Travel Gear Luxury Stores Magazine Subscriptions Movies & TV Musical Instruments Office Products Pet Supplies Premium Beauty Prime Video Same-Day Store Smart Home Software Sports & Outdoors Subscribe & Save Subscription Boxes Tools & Home Improvement Toys & Games Under $10 Video Games Whole Foods Market Search Amazon EN Hello, sign in Account & Lists Returns & Orders 0 Cart All Amazon Haul Medical Care Amazon Basics Best Sellers Books Registry Prime Gift Cards Smart Home New Releases Today's Deals Groceries Customer Service Pharmacy Music Amazon Home Fashion Kindle Books Automotive Toys & Games Home Improvement Sports & Outdoors Baby Sell Grocery Deals Snacks Breakfast Warm Beverages Cold Beverages Cooking Staples Baby Food Candy & Chocolate Subscribe & Save International Foods SNAP-eligible Groceries $12.49 $ 12 . 49 $1.42 per ounce ( $1.42 $1.42 / ounce) FREE delivery Tuesday, February 10 . Details Or fastest delivery Saturday, February 7 . Details Delivering to Boca Raton 33433 - Update location Only 7 left in stock - order soon. Quantity: 1 2 3 4 5 6 7 Quantity: 1 $ $12.49 12 . 49 ( ) Includes selected options. Includes initial monthly payment and selected options. Details Price ( $ 12 . 49 x ) $ 12 . 49 Subtotal $ $12.49 12 . 49 Subtotal Initial payment breakdown Shipping cost, delivery date, and order total (including tax) shown at checkout. Add to cart Buy Now Enhancements you chose aren't available for this seller. Details To add the following enhancements to your purchase, choose a different seller. %cardName% ${cardName} not available for the seller you chose ${cardName} unavailable for quantities greater than ${maxQuantity}. Shipper / Seller Slide Kicks Slide Kicks Shipper / Seller Slide Kicks Returns Non-returnable due to Food safety reasons Non-returnable due to Food safety reasons This item is non-returnable due to potential safety risk as an ingestible product, but if the item arrives damaged or defective, you may request a refund or replacement through Your Orders by providing an image of the item and its defects. Read full return policy Payment Secure transaction Your transaction is secure We work hard to protect your security and privacy. Our payment security system encrypts your information during transmission. We don’t share your credit card details with third-party sellers, and we don’t sell your information to others. Learn more See more Add to List Added to Unable to add item to List. Please try again. Sorry, there was a problem. There was an error retrieving your Wish Lists. Please try again. Sorry, there was a problem. List unavailable. Other sellers on Amazon 2 options from $12.49 $ 12 . 49 & FREE Shipping Image Unavailable Image not available for Color: To view this video download Flash Player VIDEOS 360° VIEW IMAGES Korovka Chocolate Wafer Cookies with Chocolate Glaze in Individual Wraps 8.8oz/250g Gourmet Imported Russian Candy Sweets Bars, Tender Cocoa Cream Filling Visit the Korovka Store 4.6 4.6 out of 5 stars (80) Amazon's Choice highlights highly rated, well-priced products available to ship immediately. Amazon's Choice $12.49 $ 12 . 49 $1.42 per ounce ( $1.42 $1.42 / ounce) Brief content visible, double tap to read full content. Full content visible, double tap to read brief content. Flavor Name: Chocolate Size: 8.8 Ounce (Pack of 1) {\"desktop_buybox_group_1\":[{\"displayPrice\":\"$12.49\",\"priceAmount\":12.49,\"currencySymbol\":\"$\",\"integerValue\":\"12\",\"decimalSeparator\":\".\",\"fractionalValue\":\"49\",\"symbolPosition\":\"left\",\"hasSpace\":false,\"showFractionalPartIfEmpty\":true,\"offerListingId\":\"dTTuQstm3sISCfH%2FAYXNiDTFtlPZgnazE46aKDQISDNpSnvFTCOkyJDah85RclUsU4miL7NsVMojiP1Px%2FuDEMWLDbL0MhnWGdVvwcQpEvVwentF7OdIVwY4uHQ3ONqe1z7KoB70Irjfod33zKS8fNUz%2FzfIbk9HcbqFvVeX3rhn4pqkGwpdPQ%3D%3D\",\"locale\":\"en-US\",\"buyingOptionType\":\"NEW\",\"aapiBuyingOptionIndex\":0}]} Purchase options and add-ons Occasion Anniversary, Birthday, Wedding Flavor Chocolate Number of Items 1 Unit Count 8.8 Ounce Brand Korovka Report an issue with this product or seller Competitively priced item Amazon's Choice Amazon Brand, Aplenty Hazelnut Rolled Wafers, 5 Oz (Pack of 2) 5 Ounce (Pack of 2) 4.4 out of 5 stars (1198) $4.12 ($0.41/ounce) New & exclusive 12-packs Shop sparkling energy drinks | Shop now Your recently viewed items and featured recommendations Your recently viewed items and featured recommendations Back to top Get to Know Us Careers Amazon Newsletter About Amazon Accessibility Sustainability Press Center Investor Relations Amazon Devices Amazon Science Make Money with Us Sell on Amazon Sell apps on Amazon Supply to Amazon Protect & Build Your Brand Become an Affiliate Become a Delivery Driver Start a Package Delivery Business Advertise Your Products Self-Publish with Us Become an Amazon Hub Partner › See More Ways to Make Money Amazon Payment Products Amazon Visa Amazon Store Card Amazon Secured Card Amazon Business Card Shop with Points Credit Card Marketplace Reload Your Balance Gift Cards Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Recalls and Product Safety Alerts Information about the FTC Prime settlement Registry & Gift List Help English United States Amazon Music Stream millions of songs Amazon Ads Reach customers wherever they spend their time 6pm Score deals on fashion brands AbeBooks Books, art & collectibles ACX Audiobook Publishing Made Easy Sell on Amazon Start a Selling Account Veeqo Shipping Software Inventory Management Amazon Business Everything For Your Business Amazon Fresh Groceries & More Right To Your Door AmazonGlobal Ship Orders Internationally Home Services Experienced Pros Happiness Guarantee Amazon Web Services Scalable Cloud Computing Services Audible Listen to Books & Original Audio Performances Box Office Mojo Find Movie Box Office Data Goodreads Book reviews & recommendations IMDb Movies, TV & Celebrities IMDbPro Get Info Entertainment Professionals Need Kindle Direct Publishing Indie Digital & Print Publishing Made Easy Amazon Photos Unlimited Photo Storage Free With Prime Prime Video Direct Video Distribution Made Easy Shopbop Designer Fashion Brands Amazon Resale Great Deals on Quality Used Products Whole Foods Market America’s Healthiest Grocery Store Woot! Deals and Shenanigans Zappos Shoes & Clothing Ring Smart Home Security Systems eero WiFi Stream 4K Video in Every Room Blink Smart Security for Every Home Neighbors App Real-Time Crime & Safety Alerts Amazon Subscription Boxes Top subscription boxes – right to your door PillPack Pharmacy Simplified Amazon Renewed Refurbished tech you can trust Conditions of Use Privacy Notice Consumer Health Data Privacy Disclosure Your Ads Privacy Choices © 1996-2026, Amazon.com, Inc. or its affiliates"
}