{
  "url": "https://apps.apple.com/us/app/four-buy-now-pay-later/id1527063669",
  "title": "âFour | Buy Now, Pay Later App - App Store",
  "text": "Four | Buy Now, Pay Later Flexible Shopping & Payments Free FOUR MAKES ONLINE SHOPPING SIMPLE, FLEXIBLE, AND REWARDING. Buy now, pay later at hundreds of online retailers. Split your purchase into 4 easy paymentsâpaid every two weeksâso you can shop what you love while staying on budget. Manage every order in one shopping app and enjoy a faster, smoother checkout experience. Upgrade to Four+ for access to exclusive stores, special offers, and more ways to shop online. WHY SHOP WITH FOUR? â¢ PAY IN 4 INSTALLMENTS Split payments over time with clear schedules so you know exactly whatâs due and when. â¢ FLEXIBLE PAYMENT PLANS Stay on budget with predictable due dates and helpful payment reminders. â¢ ONE SHOPPING APP FOR EVERYTHING Browse partner stores, track orders, and manage your payment methods in one place. HOW FOUR WORKS 1. DOWNLOAD the Four shopping app and sign up in minutes. 2. SHOP ONLINE at your favorite Four partner retailers. 3. SELECT FOUR AT CHECKOUT to split your purchase into 4 payments. 4. PAY EVERY TWO WEEKS â your first payment today, the rest in 2-week intervals. WHY USERS CHOOSE FOUR â¢ Quick and easy sign-up process â¢ Access to hundreds of online shopping options â¢ Manage your installment plans and track spending â¢ Get notified before each payment is due â¢ Works with top online retailers for a seamless checkout DOWNLOAD FOUR TODAY and discover a better way to shop onlineâbuy now, pay later in 4 installments, and stay in control of your spending. Users must be 18 or older, a U.S. resident, and meet additional eligibility requirements. Not available in NM. By using the Four app, you agree to Fourâs User Agreement and Privacy Policy. https://www.paywithfour.com/legal/user-agreement https://www.paywithfour.com/legal/privacy-policy Bug fixes and improvements to make your shopping experience better than ever! The developer, Four Technologies, Inc, indicated that the appâs privacy practices may include handling of data as described below. For more information, see the developerâs privacy policy . Data Linked to You The following data may be collected and linked to your identity: - Purchases - Financial Info - Contact Info - User Content - Identifiers Data Not Linked to You The following data may be collected but it is not linked to your identity: - Usage Data - Diagnostics Accessibility The developer has not yet indicated which accessibility features this app supports. Learn More Information - Seller - Four Technologies, Inc. - Size - 96.5 MB - Category - Shopping - Compatibility Requires iOS 14.0 or later. - iPhone Requires iOS 14.0 or later. - iPad Requires iPadOS 14.0 or later. - iPod touch Requires iOS 14.0 or later. - Apple Vision Requires visionOS 1.0 or later. - Languages - English - Age Rating 4+ - 4+ - Contains Advertising - Copyright - Â© Four Technologies, Inc."
}