{
  "url": "https://www.thefactsite.com/day/today/",
  "title": "Facts & Events That Happened Today In History - The Fact Site",
  "text": "Today is Wednesday, February 4, 2026. It’s the 35th day of the year, and we’re on week 6. Every day is special for some reason, and today is no different! Here you’ll find some interesting facts & events that happened today in history, as well as The Fact Site’s Fact of the Day! Learn what special holiday falls on this day and how to celebrate it. You’ll also find out what famous people celebrate their birthdays today! We update this page daily, so if you have a few minutes spare, check out these events & facts that all help to make today a special day! Historical Events The world is full of things happening – all day, every day. But here are some notable events that happened today in history. These are just our highlighted events, but if you'd like to learn more about what happened on this day, you can check out the link below! Famous Birthdays Are you celebrating your birthday today? If so, you're not the only one! Here are a few famous people that were also born on this day. 1970 Hunter Biden American Lawyer Hunter Biden was born on February 4, 1970, in Delaware, USA. He is 56 years old today! 1990 Zach King American Internet Personality Zach King was born on February 4, 1990, in Oregon, USA. He is 36 years old today! 1948 Alice Cooper American Singer Alice Cooper was born on February 4, 1948, in Michigan, USA. He is 78 years old today! 1975 Natalie Imbruglia Australian-British Singer Natalie Imbruglia was born on February 4, 1975, in New South Wales, Australia. She is 51 years old today! Today's Special Holiday Every day has special holidays that are celebrated throughout the world, and today is no different! Here's one of today's special holidays you can participate in. United States National Homemade Soup Day A yummy bowl of soup works wonders on warming the body and mind - especially on a cold winter’s day. Well, today is Homemade Soup Day, so why not make a big bowl of the hot stuff to warm up the whole family? Shower Thoughts Don't you just love it when you're taking your morning shower, and that little voice in your head asks, \"how many balloons would it take to float a human?\" We all have these strange thoughts at random times - and here are our shower thoughts of the day. Fact Of The Day Check out our daily facts page for fresh, random facts updated every day!"
}