{
  "url": "https://www.cnn.com/2026/01/27/us/stella-carlson-alex-pretti-witness-video",
  "title": "Meet Stella Carlson, whose video of Alex Pretti’s killing contradicted initial claims | CNN",
  "text": "Stella Carlson was supposed to spend Saturday morning painting children’s faces at a church. It would have been a welcome contrast to the weekslong onslaught of federal immigration enforcement and protests that have overwhelmed her home in the Twin Cities. Being an active participant in her community is important for Carlson, and she had spent the last three weeks learning about mutual aid and participating in grassroots efforts to warn her neighbors of impending federal immigration action. The fatal shooting of Renee Good by an Immigration and Customs Enforcement officer earlier this month proved to Carlson and other Minnesotans that the potential for danger as an observer was not abstract. “I know every time I leave my vehicle or leave my house and I put that whistle around my neck, I know because of Renee Good, the risk,” she told CNN’s Anderson Cooper during an interview Tuesday. “I think we all knew after that happened, it is now at that point, and it could be any of us.” But she had no way of knowing that she would soon watch a man die — or that her video of that fatal incident would serve as a crucial counter to the Trump administration’s initial efforts to paint Alex Pretti as a wannabe assassin or domestic terrorist. On her way to work, and wearing a pink jacket that would become instantly recognizable from other videos of the incident, Carlson heard the sound of whistles that have become the ubiquitous warning of the arrival of immigration officers. She drove down Nicollet Avenue and saw what she described as a brawl in the street. She thought of Good, who was also driving her car when she was fatally shot. This was when she first noticed Pretti directing traffic. “It felt like somebody in my opinion, in my background, who was doing a risk assessment and found his place in this moment to be useful,” she said of Pretti. Carlson got out of her car and began recording. The video Carlson took showed that Pretti, who had a permit to carry a concealed pistol, never brandished his gun, as Department of Homeland Security Secretary Kristi Noem first claimed he did (Carlson said she didn’t even know Pretti had been armed until after he was shot, and wouldn’t have gotten so close if she had known). Nor did he approach law enforcement with the intent to assassinate them, as Stephen Miller, the architect of the White House’s immigration policy, also claimed. Instead, Carlson’s video showed that the 37-year-old ICU nurse who treated veterans spent his last moments trying to help a woman who had been knocked down. The video also showed that Pretti’s handgun had been removed from its holster by an officer seconds before he was pinned down and shot multiple times, including in his back. “I remember him arching his back and his head rolling back,” Carlson said. She had previously seen people die in hospice settings and said she knew by looking at Pretti that he was not going to make it. “I knew he was gone because I watched it,” she said. “And then they come over to try to perform some type of medical aid by ripping his clothes open with scissors, and then maneuvering his body around like a rag doll, only to discover that it could be because they wanted to count the bullet wounds to see how many they got, like he’s a deer.” Had she not experienced the way that her community has come together since federal law enforcement began surging in Minneapolis, Carlson said she does not know whether she would have stayed at the scene as long as she did. “If it wasn’t for the collective actions over the past three weeks, I don’t know if I would have been able to stay that long,” she said. “But I knew that this was a moment, and we all have to be brave and we all have to take risks, and we’re all going to be given moments to make that decision.” Carlson continued: “… And I’m grateful to myself and I’m grateful to anybody who was supportive to me after, to make sure I could get to safety and get that video uploaded to the right people.” Carlson’s video, and the ensuing outrage surrounding Pretti’s killing, placed the Trump administration under immense pressure that eventually led to the White House pulling Gregory Bovino, the Border Patrol official who had led the surge in Minneapolis and several other American cities, out of Minnesota. The administration was left scrambling to contain the bipartisan fallout both from the shooting itself, and from claims from top officials that Pretti had somehow invited his own death by legally carrying a firearm. By Tuesday, President Donald Trump said he would seek to “de-escalate” the situation in Minneapolis. Shortly after the shooting, Carlson recounted what she had witnessed in a sworn statement. But as of Tuesday, she said she had not been contacted by federal law enforcement. She has little confidence in a federal investigation into the shooting that killed Pretti. Instead, her faith, she said, is placed in “various representatives throughout our country who are trying to do the right thing and make sure that justice is served.”"
}