{
  "url": "https://www.allrecipes.com/what-is-brioche-bread-8634668",
  "title": "What Is Brioche Bread—And Why Is It So Soft and Delicious?",
  "text": "What Is Brioche Bread—And Why Is It So Soft and Delicious? Plus, does the dough actually have to chill overnight? By Hannah Klinger Hannah Klinger Hannah Klinger is a writer, editor, and content manager at Savory Magazine. She has a passion for helping home cooks build their confidence in the kitchen with hacks, how-tos, and guides to inspire them to try something new. She's contributed to America's Test Kitchen, Cooking Light, Food & Wine, EatingWell, and more. Allrecipes' editorial guidelines Published on April 17, 2024 Close Credit: Dotdash Meredith Food Studios Soft, rich, buttery brioche bread is what French toast dreams are made of: It slices beautifully, soaks up the eggy custard, and sears to a perfect golden brown in the pan. Brioche is also a game changer for sandwiches, taking a classic burger or turkey club and elevating it to a five-star level. So what makes this bread so special, and how hard is it to make at home? Ahead, we’re answering all of your best brioche questions so you can bake and enjoy this bread like a pro. What is Brioche Bread? Brioche, pronounced bree-YOH-sh, is a French-style bread that’s just about the opposite of the crusty baguettes you already know. Baguettes use just three ingredients—flour, water, and salt—and have a hard crust and chewy texture. Brioche is made from an enriched dough that uses eggs, sugar, and butter. These additional ingredients make the bread taste dense, soft, and sweet. The crumb (the pattern of holes in a slice of bread) is also much tighter (lots of small holes) in brioche than in a baguette (large, irregular holes). This makes brioche ideal for spreads and for soaking up a milk and egg mixture for French toast. The dough is also often fried for doughnuts or used for cinnamon rolls and monkey bread. Rich Garcia What is the Difference Between Brioche and Challah? Both brioche and challah use lots of eggs in their doughs, so they are referred to as enriched doughs. Challah traditionally does not include milk or butter to keep the bread pareve (or kosher for a non-dairy meal). Challah is also nearly always braided, whereas brioche loaves can take on any shape. How to Make Brioche You’ll find the full recipe for our foolproof brioche recipe, but here is a quick overview of the steps you’ll follow: Activate the yeast in warm water.Combine the yeast and water with the eggs, flour, and sugar. Knead until smooth and supple.Spread softened butter over the dough in stages, kneading after each addition to incorporate.Proof for one hour or until doubled in size (this relaxes the gluten and lets the yeast go to work).Refrigerate for several hours or overnight.Punch down the dough and shape it into loaves.Brush the brioche loaves with egg and bake. Chef John Why Brioche Needs an Overnight Chill One of the most important steps in making brioche bread is letting the dough rest in the refrigerator for several hours before the final proof and bake. This is so all the added butter in the dough can firm up; otherwise, it would melt and leak out in the oven. Don’t be tempted to rush the process in the freezer: If the dough is too cold, it will be hard to punch out the excess air and it will take longer to rise on your counter before baking. How to Use Brioche The most classic use for brioche bread is French toast. Keep it simple or go wild with some of our favorite variations, like this Almond French Toast or this Overnight Blueberry French Toast. Beyond breakfast, try brioche in desserts like bread pudding, or do as the Sicilians and make an ice cream sandwich with brioche and gelato. Go savory by using brioche as the base for open-faced sandwiches, like this bistro-worthy Croque Madame. You can also grill and top sliced brioche or toast cubed brioche for the best salad croutons you’ve ever had. Find more brioche inspiration with these recipes. How to Store Brioche Store brioche in an airtight resealable bag or container on your counter for up to five days. Press out as much air as possible, as breads with added fat like butter tend to go stale a bit faster than other breads. Explore more: Kitchen Tips All About Ingredients All About Grains Was this page helpful? Thanks for your feedback! Tell us why! Other Submit"
}