{
  "url": "https://en.wikipedia.org/wiki/Egg",
  "title": "Egg - Wikipedia",
  "text": "Egg An egg is an organic vessel grown by an animal to carry a possibly fertilized egg cell – a zygote. Within the vessel, an embryo is incubated until it has become an animal fetus that can survive on its own, at which point the animal hatches. Reproductive structures similar to the egg in other kingdoms are termed \"spores\", or in spermatophytes \"seeds\", or in gametophytes \"egg cells\". Most arthropods, vertebrates (excluding live-bearing mammals), and mollusks lay eggs, although some, such as scorpions, do not. Reptile eggs, bird eggs, and monotreme eggs are laid out of water and are surrounded by a protective shell, either flexible or inflexible. Eggs laid on land or in nests are usually kept within a warm and favorable temperature range while the embryo grows. When the embryo is adequately developed it hatches; i.e., breaks out of the egg's shell. Some embryos have a temporary egg tooth they use to crack, pip, or break the eggshell or covering. For people, eggs are a popular food item and they appear on menus worldwide. Eggs remain an important symbol in folklore and mythology, symbolizing life, healing, and rebirth. They are frequently the subject of decoration. Egg collecting has been popular in some cultures, although the practice is now banned in many jurisdictions. Chicken eggs are used in the production of vaccines for infectious diseases. Eggs of different animal groups The largest recorded egg is from a whale shark and was 30 cm × 14 cm × 9 cm (11.8 in × 5.5 in × 3.5 in) in size.[1] Whale shark eggs typically hatch within the mother. At 1.5 kg (3.3 lb) and up to 17.8 cm × 14 cm (7.0 in × 5.5 in), the ostrich egg is the largest egg of any living bird,[2]: 130 though the extinct elephant bird and some non-avian dinosaurs laid larger eggs. The bee hummingbird produces the smallest known bird egg, which measures between 6.35–11.4 millimetres (0.250–0.449 in) long and weighs half of a gram (around 0.02 oz).[2]: 132 Some eggs laid by reptiles and most fish, amphibians, insects, and other invertebrates can be even smaller. Several major groups of animals typically have readily distinguishable eggs. Fish and amphibian eggs The most common reproductive strategy for fish is known as oviparity,[10] in which the female lays undeveloped eggs that are externally fertilized by a male.[11] Typically large numbers of eggs are laid at one time (large fish are capable of producing over 100 million eggs in one spawning) and the eggs are then left to develop without parental care. When the larvae hatch from the egg, they often carry the remains of the yolk in a yolk sac which continues to nourish the larvae for a few days as they learn how to swim. Once the yolk is consumed, there is a critical point after which they must learn how to hunt and feed or they will die.[12] A few fish, notably the rays and most sharks use ovoviviparity in which the eggs are fertilized and develop internally. However, the larvae still grow inside the egg consuming the egg's yolk and without any direct nourishment from the mother. The mother then gives birth to relatively mature young. In certain instances, the physically most developed offspring will devour its smaller siblings for further nutrition while still within the mother's body. This is known as intrauterine cannibalism.[13][14] In certain scenarios, some fish such as the hammerhead shark and reef shark are viviparous, with the egg being fertilized and developed internally, but with the mother also providing direct nourishment.[15] The eggs of fish and amphibians (anamniotes) are jellylike.[17] Cartilaginous fish (sharks, skates, rays, chimaeras) eggs are fertilized internally and exhibit a wide variety of both internal and external embryonic development.[18] Most fish species spawn eggs that are fertilized externally, typically with the male inseminating the eggs after the female lays them.[11] These eggs do not have a shell and would dry out in the air. Even air-breathing amphibians lay their eggs in water,[17] or in protective foam as with the Coast foam-nest treefrog, Chiromantis xerampelina.[19] Amniote eggs and embryos Like amphibians, amniotes are air-breathing vertebrates, but they have complex eggs or embryos, including an amniotic membrane.[20] (The shelled egg is the source for the name Amniota.) The formation of this type of egg requires that conception take place internally, and the shell isolates the embryo development from the mother. Amniotes include reptiles (including dinosaurs and their descendants, birds) and mammals.[21] Reptile eggs are leathery for snakes and the majority of lizards, while turtles have a calcareous shell. These protective shells are able to survive in the air. They will absorb water from the environment, causing them to swell in size while the fetus is developing. Most reptile eggs are deposited on land, usually in a warm, moist environment, then left alone by the parents.[22] Initially, they are always white. For turtles, tuatara, and most lizards, the sex of the developing embryo is determined by the temperature of the surroundings, with the species determining which gender is favored at cool versus warm temperatures.[23] Not all reptiles lay eggs; some are viviparous (\"live birth\"). This adaptation may have allowed reptiles to inhabit new habitats, especially in colder climates.[24] Dinosaurs laid eggs, some of which have been preserved as petrified fossils. Soft-shelled dinosaur eggs are less likely to be preserved, so most of the recovered fossilized egg remains come from calcified eggshells.[25] Among mammals, early extinct species were found to lay eggs, and was probably the ancestral state.[21] Platypuses and two genera of echidna (spiny anteaters) are Australian monotremes, the only extant order of egg-laying mammal.[26] Marsupial and placental mammals do not lay eggs, but their unborn young do have the complex tissues that identify amniotes.[21] Bird eggs Bird eggs are laid by females and incubated for a time that varies according to the species;[27] normally a single young hatches from each egg. Twin yolk eggs have been observed in domestic fowl, but this results in low hatchability.[28] One case of twin geese has been observed to hatch from an elongated egg.[29] Average clutch sizes range from one (as in condors[30]) to about 17–24 (the grey partridge[31]). It is rare for a bird to lay eggs when not fertilized,[32] known as parthenogenesis. One exception is the domestic hen; it is not uncommon for pet owners to find their lone bird nesting on a clutch of unfertilized eggs,[33] which are sometimes called wind-eggs.[34] Shell Bird eggs have a hard shell made of calcium carbonate with a 5% organic matrix. This resilient external surface prevents desiccation of the contents, limits mechanical damage, and protects against microbes, all while allowing the exchange of gas with the surrounding atmosphere.[35] They vary in thickness from paper thin up to 2.7 mm in ostriches, and typically form 11%–15% of the egg's weight.[36] Bird eggshells are diverse in appearance and structure.[36] For example: - cormorant eggs are rough and chalky[37] - tinamou eggs are shiny[36] - duck eggs are oily and waterproof[36] - cassowary eggs are heavily pitted[36] - jacanas eggs appear lacquered[36] Tiny pores in bird eggshells allow the embryo to breathe; exchanging oxygen, carbon dioxide, and water with the environment. The pore distribution varies by species, with the pore size being inversely proportional to the incubation period.[38] The domestic hen's egg has around 7000 pores.[39] Some bird eggshells have a coating of vaterite spherules, which is a rare polymorph of calcium carbonate. In Greater Ani Crotophaga major this vaterite coating is thought to act as a shock absorber, protecting the calcite shell from fracture during incubation, such as colliding with other eggs in the nest.[40] Shape Bird egg shapes are ovoid and axisymmetrical in form, but vary by ellipticity and asymmetry depending on the bird species. Thus, the brown boobook species has a nearly spherical shell, the maleo egg is highly ellipsoidal, and the least sandpiper egg is much more conical. The shape is likely formed as the egg moves through the final part of the oviduct, being initially more spherical in form. Ellipticity is introduced by the egg being easier to stretch along the oviduct axis. The eggs of birds that have adapted for high-speed flight often have a more elliptical or asymmetrical form. Thus, one hypothesis is that long, pointy eggs are an incidental consequence of having a streamlined body typical of birds with strong flying abilities; flight narrows the oviduct, which changes the type of egg a bird can lay.[41][42] Cliff-nesting birds often have highly conical eggs. They are less likely to roll off, tending instead to roll around in a tight circle; this trait is likely to have arisen due to evolution via natural selection. In contrast, many hole-nesting birds have nearly spherical eggs.[43] Colours The default colour of avian eggs is the white of the calcium carbonate from which the shells are made, but some birds, mainly passerines, produce coloured eggs. The colour comes from pigments deposited on top of the calcium carbonate base; biliverdin and its zinc chelate, and bilirubin, give a green or blue ground colour, while protoporphyrin IX produces reds and browns as a ground colour or as spotting.[44][45][46] Shell colours are secreted by the same oviduct shell gland that generates the egg shell, and thus can be deposited throughout the shell. When a chalky covering is added, it is the final step in the process.[47] Non-passerines typically have white eggs,[48] except in some ground-nesting groups such as the Charadriiformes,[48] sandgrouse,[49] and common terns,[50] where camouflage is necessary, and some parasitic cuckoos which have to match the passerine host's egg.[51] Most passerines, in contrast, lay coloured eggs, even if there is no need of cryptic colours. However, some have suggested that the protoporphyrin markings on passerine eggs actually act to reduce brittleness by acting as a solid-state lubricant.[52] If there is insufficient calcium available in the local soil, the egg shell may be thin, especially in a circle around the broad end. Protoporphyrin speckling compensates for this, and increases inversely to the amount of calcium in the soil.[53] Later eggs in a clutch are more spotted than early ones as the female's pigment glands become depleted.[46] Within the common cuckoo lineage, the colour of individual eggs is genetically influenced, and appears to be inherited through the mother only. This suggests that the gene responsible for pigmentation is on the sex-determining W chromosome (female birds are WZ, males ZZ). However, egg colour in other species is most likely inherited from both parents.[54] For chickens, egg colour appears determined from the hen's genome, diet, and stress factors like disease.[55] With American robins, there is some evidence that the brightness of the egg colouration may influence male parental care of the nestlings.[56] Evolutionary factors can drive egg colouration, such as predation selecting for cryptic colouration, or colourful eggs possibly being used to coerce males into providing additional care during incubation – the blackmail hypothesis.[57] For avian species that play host to brood parasite eggs, selection pressure drives the host species to evolve distinctive egg colourations so that foreign eggs can be identified and rejected. Likewise, the brood parasite species evolve eggs that better mimic those of the host. The result is an egg colouration evolutionary arms race between the host and parasite.[58] In species such as the common guillemot, which nest in large groups, each female's eggs have very different markings, making it easier for females to identify their own eggs on the crowded cliff ledges on which they breed.[59] Yolks of birds' eggs are yellow from carotenoids, it is affected by their living conditions and diet.[44] Predation Many animals feed on eggs. For example, principal predators of the black oystercatcher's eggs include raccoons, skunk, mink, river and sea otters, gulls, crows and foxes.[60][61][62] The stoat (Mustela erminea) and long-tailed weasel (M. frenata) steal ducks' eggs.[63] Snakes of the genera Dasypeltis and Elachistodon specialize in eating eggs.[64] Brood parasitism occurs in birds when one species lays its eggs in the nest of another. This is an uncommon behavior, with 1% of bird species being obligate parasites.[58] In some cases, the host's eggs are removed or eaten by the female, or expelled by her chick.[65] Brood parasites include the cowbird, black-headed duck, cuckoo-finch, and three Old World cuckoo species.[58] Mammalian eggs The eggs of the egg-laying mammals (the platypus and the echidnas) are macrolecithal eggs very much like those of reptiles. The eggs of marsupials are likewise macrolecithal, but rather small, and develop inside the body of the female, but do not form a placenta. The young are born at a very early stage, and can be classified as a \"larva\" in the biological sense.[66] In placental mammals, there are two types of placenta: the yolk sac and the chorioallantoic. In humans, the initial nutrient source is a yolk sac placenta that is replaced by a chorioallantoic placenta at around four weeks. Around the eighth week, the yolk sac is absorbed into the umbilical cord.[67] Receiving nutrients from the mother, the fetus completes the development while inside the uterus. Invertebrate eggs Eggs are common among invertebrates, including insects, spiders,[68] mollusks,[69] and crustaceans.[70] Eggs deposited on land or in fresh water tend to have more yolk, which allows longer development in the egg before hatching. Eggs with little yolk hatch more rapidly into larval form that can seek out food. Some land invertebrates are viviparous, developing offspring within the body of the mother that are supplied nutrition by the host. Examples include the tsetse fly and some peripatus species.[71] Parental care does occur in some invertebrate species, although rarely by the male; the addition of paternal care usually doesn't provide sufficient evolutionary advantage for it to evolve with any frequency. A counter-example is the dung beetle, where the male and female cooperate to bury balls of dung where the female can lay her eggs. Examples of invertebrates that provide parental care include the treehopper and velvet spider. Female jumping spiders provide milk for their offspring.[72] Many insect species and other invertebrate taxa are capable of parthenogenesis, which is the production of offspring using an unfertilized egg. In the subterranean termite, the queen produces new queen eggs via parthenogenesis but the soldiers and workers are created via sexual reproduction.[73] Unisexual reproduction is uncommon in vertebrates, but has been observed in some fish, reptile, and amphibian taxa.[74] Evolution and structure All sexually reproducing life, including both plants and animals, produces gametes.[75] The male gamete cell, sperm, is usually motile whereas the female gamete cell, the ovum, is generally larger and sessile. The male and female gametes combine to produce the zygote cell.[76] In multicellular organisms, the zygote subsequently divides in an organised manner into smaller more specialised cells (Embryogenesis), so that this new individual develops into an embryo. In most animals, the embryo is the sessile initial stage of the individual life cycle, and is followed by the emergence (that is, the hatching) of a motile stage. The zygote or the ovum itself or the sessile organic vessel containing the developing embryo may be called the egg.[77] A 2011 proposal suggests that the phylotypic animal body plans originated in cell aggregates before the existence of an egg stage of development. Eggs, in this view, were later evolutionary innovations, selected for their role in ensuring genetic uniformity among the cells of incipient multicellular organisms.[78] The yolk component of the egg provides the nutrients needed for the growth of the embryo. More than half the proteins in egg yolk are phosphoglycoproteins, which are equivalent to milk proteins in mammals or storage proteins in plant seeds. The polypeptide vitellogenin (Vtg) is the major precursor of the lipoproteins and phosphoproteins that make up most of the protein content of yolk. It occurs in all egg-laying animals; the insect form is called vitellin. The synthesis of yolk protein components occurs in the liver.[79] In an amniote egg, the yolk is surrounded by a membranous yolk sac that attaches to the embryo.[9] The albumen, or egg white, is a clear liquid layer that surrounds the yolk. This material is hydrophilic and serves as a water reservoir for the embryo.[80] The predominant protein in egg whites is ovalbumin, forming more than half the proteins by mass. The role of this protein is unknown.[81] Ovomucoid, which makes up 11% of the albumen, is the primary egg allergen.[82] Formation The cycle of the egg's formation is started by the gamete ovum being released (ovulated) and egg formation being started. Within the oviduct, the albumen, shell membranes, and outer shell can then be applied.[83] The finished egg is then ovipositioned and eventual egg incubation can start. Scientific classifications Scientists often classify animal reproduction according to the degree of development that occurs before the new individuals are expelled from the adult body, and by the yolk which the egg provides to nourish the embryo.[84] Egg size and yolk Vertebrate eggs can be classified by the relative amount of yolk. Simple eggs with little yolk are called microlecithal, medium-sized eggs with some yolk are called mesolecithal, and large eggs with a large concentrated yolk are called macrolecithal.[7] This classification of eggs is based on the eggs of chordates, though the basic principle extends to the whole animal kingdom. Within the egg cell cytoplasm, a uniform distribution of yolk is termed isolecithal, while an uneven distribution is telolecithal. Mammal eggs are isolecithal with small amounts of yolk, while bird and reptile eggs are telolecithal.[85] Microlecithal Small eggs with little yolk are called microlecithal. The yolk is evenly distributed, so the cleavage of the egg cell cuts through and divides the egg into cells of fairly similar sizes. In sponges and cnidarians, the dividing eggs develop directly into a simple larva, rather like a morula with cilia. In cnidarians, this stage is called the planula, and either develops directly into the adult animals or forms new adult individuals through a process of budding.[86] Microlecithal eggs require minimal yolk mass. Such eggs are found in flatworms, roundworms, annelids, bivalves, echinoderms, the lancelet and in most marine arthropods.[87] In anatomically simple animals, such as cnidarians and flatworms, the fetal development can be quite short, and even microlecithal eggs can undergo direct development. These small eggs can be produced in large numbers. In animals with high egg mortality, microlecithal eggs are the norm, as in bivalves and marine arthropods. However, the latter are more complex anatomically than e.g. flatworms, and the small microlecithal eggs do not allow full development. Instead, the eggs hatch into larvae, which may be markedly different from the adult animal. In placental mammals, where the embryo is nourished by the mother throughout the whole fetal period, the egg possesses little if any yolk.[88] Mesolecithal Mesolecithal eggs have comparatively more yolk than the microlecithal eggs. The yolk is concentrated in one part of the egg (the vegetal pole), with the cell nucleus and most of the cytoplasm in the other (the animal pole). The cell cleavage is uneven, and mainly concentrated in the cytoplasma-rich animal pole.[3] The larger yolk content of the mesolecithal eggs allows for a longer fetal development. Comparatively anatomically simple animals will be able to go through the full development and leave the egg in a form reminiscent of the adult animal. This is the situation found in hagfish and some snails.[4][87] Animals with smaller size eggs or more advanced anatomy will still have a distinct larval stage, though the larva will be basically similar to the adult animal, as in lampreys, coelacanth and the salamanders.[3] Macrolecithal Eggs with a large yolk are called macrolecithal. The eggs are usually few in number, and the embryos have enough food to go through full fetal development in most groups.[7] Macrolecithal eggs are only found in selected representatives of two groups: Cephalopods and vertebrates.[7][89] Macrolecithal eggs go through a different type of development than other eggs. Due to the large size of the yolk, the cell division can not split up the yolk mass. The fetus instead develops as a plate-like structure on top of the yolk mass, and only envelopes it at a later stage.[7] A portion of the yolk mass is still present as an external or semi-external yolk sac at hatching in many groups. This form of fetal development is common in bony fish, even though their eggs can be quite small. Despite their macrolecithal structure, the small size of the eggs does not allow for direct development, and the eggs hatch to a larval stage (\"fry\"). In terrestrial animals with macrolecithal eggs, the large volume to surface ratio necessitates structures to aid in transport of oxygen and carbon dioxide, and for storage of waste products so that the embryo does not suffocate or get poisoned from its own waste while inside the egg, see amniote.[9] In addition to bony fish and cephalopods, macrolecithal eggs are found in cartilaginous fish, reptiles, birds and monotreme mammals.[3] The eggs of the coelacanths can reach a size of 9 cm (3.5 in) in diameter, and the young go through full development while in the uterus, living on the copious yolk.[90] Egg-laying reproduction Animals are commonly classified by their manner of reproduction, at the most general level distinguishing egg-laying (Latin. oviparous) from live-bearing (Latin. viviparous). French biologist Thierry Lodé proposed a classification scheme that further divides the reproduction types according to the development that occurs before the offspring are expelled from the adult's body:[91] - Ovuliparity means the female spawns unfertilized eggs (ova), which must then be externally fertilised. Ovuliparity is typical of bony fish, anurans, echinoderms, bivalves and cnidarians. Most aquatic organisms are ovuliparous. The term is derived from the diminutive meaning \"little egg\". - Oviparity is where fertilisation occurs internally and so the eggs laid by the female are zygotes (or newly developing embryos), often with important outer tissues added (for example, in a chicken egg, no part outside of the yolk originates with the zygote). Oviparity is typical of birds, reptiles, some cartilaginous fish and most arthropods. Terrestrial organisms are typically oviparous, with egg-casings that resist evaporation of moisture. - Ovo-viviparity is where the zygote is retained in the adult's body but there are no trophic (feeding) interactions. That is, the embryo still obtains all of its nutrients from inside the egg. Most live-bearing fish, amphibians or reptiles are actually ovoviviparous. Examples include the reptile Anguis fragilis, the sea horse (where zygotes are retained in the male's ventral \"marsupium\"), and the frogs Rhinoderma darwinii (where the eggs develop in the vocal sac) and Rheobatrachus (where the eggs develop in the stomach). - Histotrophic viviparity means embryos develop in the female's oviducts but obtain nutrients by consuming other ova, zygotes or sibling embryos (oophagy or adelphophagy). This intra-uterine cannibalism occurs in some sharks and in the black salamander Salamandra atra. Marsupials excrete a \"uterine milk\" supplementing the nourishment from the yolk sac.[92] - Hemotrophic viviparity is where nutrients are provided from the female's blood through a designated organ. This most commonly occurs through a placenta, found in most mammals. Similar structures are found in some sharks and in the lizard Pseudomoia pagenstecheri.[93][94] In some hylid frogs, the embryo is fed by the mother through specialized gills.[95] The term hemotrophic derives from the Latin for blood-feeding, contrasted with histotrophic for tissue-feeding.[96] Human use Food Eggs laid by many different species, including birds, reptiles, amphibians, and fish, have probably been eaten by people for millennia.[97] Popular choices for egg consumption are chicken, duck, roe, and caviar,[98] but by a wide margin the egg most often humanly consumed is the chicken egg, typically unfertilized.[99] Eggs and Kashrut According to the Kashrut, that is the set of Jewish dietary laws, kosher food may be consumed according to halakha (Jewish law). Eggs are considered pareve (neither meat nor dairy) despite being an animal product and can be mixed with either milk or kosher meat.[100] Vaccine manufacture Many vaccines for infectious diseases are produced in fertile chicken eggs.[101] The basis of this technology was the discovery in 1931 by Alice Miles Woodruff and Ernest William Goodpasture at Vanderbilt University that the rickettsia and viruses that cause a variety of diseases will grow in chicken embryos.[102] This enabled the development of vaccines against influenza, chicken pox, smallpox, yellow fever, typhus, Rocky mountain spotted fever and other diseases.[103] Culture Eggs are an important symbol in folklore and mythology, often representing life and rebirth, healing and protection, and sometimes featuring in creation myths.[104] Egg decoration is a common practice in many cultures worldwide. Christians view Easter eggs as symbolic of the resurrection of Jesus Christ.[105] Although a food item, raw eggs are sometimes thrown at houses, cars, or people. This act, known commonly as \"egging\" in the various English-speaking countries, is a minor form of vandalism and, therefore, usually a criminal offense and is capable of damaging property (egg whites can degrade certain types of vehicle paint) as well as potentially causing serious eye injury. On Halloween, for example, trick or treaters have been known to throw eggs (and sometimes flour) at property or people from whom they received nothing.[106] Eggs are also often thrown in protests, as they are inexpensive and nonlethal, yet very messy when broken.[107] Collecting Egg collecting was a popular hobby in some cultures, including European Australians. Traditionally, the embryo would be removed before a collector stored the egg shell.[108] Collecting eggs of wild birds is now banned by many jurisdictions, as the practice can threaten rare species. In the United Kingdom, the practice is prohibited by the Protection of Birds Act 1954 and Wildlife and Countryside Act 1981.[109] However, illegal collection and trading persists. Since the protection of wild bird eggs was regulated, early collections have come to the museums as curiosities. For example, the Australian Museum hosts a collection of about 20,000 registered clutches of eggs,[110] and the collection in Western Australia Museum has been archived in a gallery.[111] Scientists regard egg collections as a good natural-history data, as the details recorded in the collectors' notes have helped them to understand birds' nesting behaviors.[112] See also References - ^ \"Whale Shark – Cartilaginous Fish\". SeaWorld Parks & Entertainment. Archived from the original on 9 June 2014. Retrieved 27 June 2014. - ^ a b Khanna, D.R. (2005). Biology of Birds. New Delhi, India: Discovery Publishing House. ISBN 978-81-7141-933-3. Archived from the original on 10 May 2016. - ^ a b c d e f g Hildebrand, M.; Gonslow, G. (2001). Analysis of Vertebrate Structure (5th ed.). New York City: John Wiley & Sons, Inc. ISBN 978-0-471-29505-1. - ^ a b Gorbman, A. (June 1997). \"Hagfish development\". Zoological Science. 14 (3): 375–390. doi:10.2108/zsj.14.375. S2CID 198158310. - ^ Hardisty, M. W.; Potter, I. C. (1971). The Biology of Lampreys. Vol. 2 (1st ed.). New York, USA: Academic Press Inc. ISBN 0-12-324801-9. - ^ Compagno, Leonard J. V. (1984). Sharks of the World: An annotated and illustrated catalogue of shark species known to date. Food and Agriculture Organization of the United Nations. ISBN 92-5-104543-7. OCLC 156157504. - ^ a b c d e f g Romer, A. S.; Parsons, T. S. (1985). The Vertebrate Body (6th ed.). Philadelphia: Saunders. - ^ Peter, Scott (1997). Livebearing Fishes. Blacksburg, Virginia, USA: Tetra Press. p. 13. ISBN 1-56465-193-2. - ^ a b c Stewart, J. R. (1997). \"Morphology and evolution of the egg of oviparous amniotes\". In Sumida, S.; Martin, K. (eds.). Amniote Origins-Completing the Transition to Land. London: Academic Press. pp. 291–326. ISBN 978-0-08-052709-3. - ^ Schreiber, A. M. (2023). General and Comparative Endocrinology: An Integrative Approach. CRC Press. ISBN 978-1-000-91309-5. With the exception of mammals, oviparity is the most widely used mode of reproduction among vertebrates, occurring in over 97% of fish, 90% of amphibians, 85% of reptiles, and in 100% of birds. - ^ a b Diana, James S.; Höök, Tomas O. (2023). Biology and Ecology of Fishes (3rd ed.). John Wiley & Sons. pp. 297–298. ISBN 978-1-119-50574-7. - ^ Duffy-Anderson, Janet T.; Dreary, Alison L.; Juanes, Francie; Le Pape, Olivier (2024). \"The early life stages of marine fish\". In Cabral, Henrique; LePage, Mario; Lobry, Jeremy; Le Pape, Olivier (eds.). Ecology of Marine Fish. Elsevier. pp. 47–50. ISBN 978-0-323-99037-0. - ^ Rafferty, John P., ed. (2011). Meat Eaters: Raptors, Sharks, and Crocodiles. The Britannica Guide to Predators and Prey. The Rosen Publishing Group, Inc. p. 108. ISBN 978-1-61530-342-7. - ^ Patzner, Robert A. (2008). \"Reproductive Strategies of Fish\". In Rocha, Maria J.; Arukwe, Augustine; Kapoor, B. G. (eds.). Fish Reproduction. CRC Press. p. 324. ISBN 978-1-4398-4239-3. - ^ Stafford-Deitsch, Jeremy (1999). Red Sea Sharks. In depth divers' guide. Trident Press Ltd. ISBN 978-1-900724-36-4. - ^ Shu, Longfei; Suter, Marc J.-F.; Laurila, Anssi; Räsänen, Katja (November 2015). \"Mechanistic basis of adaptive maternal effects: egg jelly water balance mediates embryonic adaptation to acidity in Rana arvalis\". Oecologia. 179 (3): 617–628. Bibcode:2015Oecol.179..617S. doi:10.1007/s00442-015-3332-4. hdl:20.500.11850/101187. ISSN 1432-1939. PMID 25983113. S2CID 253976911. - ^ a b Bonnan, Matthew F. (2016). The Bare Bones: An Unconventional Evolutionary History of the Skeleton. Life of the Past. Indiana University Press. pp. 228–229. ISBN 978-0-253-01841-0. - ^ Smeets, W. J. A. J.; Nieuwenhuys, R.; Roberts, B. L. (2012). The Central Nervous System of Cartilaginous Fishes: Structure and Functional Correlations. Springer Science & Business Media. ISBN 978-3-642-68923-9. - ^ Dawkins, Richard (2004). The Ancestor's Tale: A Pilgrimage to the Dawn of Evolution. Mariner Book. Houghton Mifflin Harcourt. ISBN 978-0-618-61916-0. - ^ Packard, Mary J.; Seymour, Roger S. (1997). \"Evolution of the Amniote egg\". In Sumida, Stuart; Martin, Karen L. M. (eds.). Amniote Origins: Completing the Transition to Land. Elsevier. pp. 266–274. ISBN 978-0-08-052709-3. - ^ a b c Hayssen, Virginia; Orr, Teri J. (2017). Reproduction in Mammals: The Female Perspective. JHU Press. pp. 10–15. ISBN 978-1-4214-2316-6. - ^ Mader, Dougls R. (2005). \"Perinatology\". In Divers, Stephen J.; Mader, Douglas R. (eds.). Reptile Medicine and Surgery (2nd ed.). Elsevier Health Sciences. p. 366. ISBN 978-1-4160-6477-0. - ^ Jacobson, Elliott R.; Lilleywhite, Harvey B.; Blackburn, Daniel G. (2021). \"Overview of Biology, Anatomy, and Histology of Reptiles\". In Jacobson, Elliott; Garner, Michael (eds.). Diseases and Pathology of Reptiles. Vol. 1 (2nd ed.). CRC Press. ISBN 978-0-429-63295-2. - ^ Whittington, Camilla M.; Van Dyke, James U.; Liang, Stephanie Q. T.; Edwards, Scott V.; Shine, Richard; Thompson, Michael B.; Grueber, Catherine E. (June 2022). \"Understanding the evolution of viviparity using intraspecific variation in reproductive mode and transitional forms of pregnancy\". Biological Reviews. 97 (3): 1179–1192. doi:10.1111/brv.12836. PMC 9064913. PMID 35098647. - ^ Norell, Mark A.; Wiemann, Jasmina; Fabbri, Matteo; Yu, Congyu; Marsicano, Claudia A.; Moore-Nall, Anita; Varricchio, David J.; Pol, Diego; Zelenitsky, Darla K. (2020). \"The first dinosaur egg was soft\". Nature. 583 (7816): 406–410. Bibcode:2020Natur.583..406N. doi:10.1038/s41586-020-2412-8. PMID 32555457. - ^ Musser, A. M. (December 2003). \"Review of the monotreme fossil record and comparison of palaeontological and molecular data\". Comparative Biochemistry and Physiology Part A: Molecular & Integrative Physiology. 136 (4): 927–942. doi:10.1016/S1095-6433(03)00275-7. PMID 14667856. - ^ Rafey, Joy Shindler (2025). Jenkins, McKay (ed.). The Maryland Master Naturalist's Handbook. JHU Press. ISBN 978-1-4214-5159-6. - ^ Salamon, Attila; Kent, John P. (19 March 2020). \"The double-yolked egg: from the 'miracle of packaging' to nature's 'mistake'\". World's Poultry Science Journal. 76 (1): 18–33. doi:10.1080/00439339.2020.1729671. - ^ Damaziak, Krzysztof; Marzec, Agata; Wójcik, Wojciech; Horecka, Beata; Osiadacz, Mateusz; Riedel, Julia; Pstrokoński, Paweł; Mielnicki, Sebastian (July 2025). \"Elongated shape and unusual eggshell microstructure enable first confirmed hatching of avian twins\". Biology of Reproduction. 113 (1): 49–60. doi:10.1093/biolre/ioaf100. PMID 40302037. - ^ Restrepo-Cardona, Juan Sebastián; Narváez, Fabricio; Kohn, Sebastián; Pineida, Rubén; Vargas, Félix Hernán (2024). \"Life History of the Andean Condor in Ecuador\". Tropical Conservation Science. 17 19400829241238005: 1–8. doi:10.1177/19400829241238005. - ^ Putaala, Ahti; Hissa, Raimo (September 1998). \"Breeding dispersal and demography of wild and hand-reared grey partridges Perdix perdix in Finland\". Wildlife Biology. 4 (3): 137–145. Bibcode:1998WildB...4..137P. doi:10.2981/wlb.1998.016. - ^ Stark, Lizzie (2023). Egg: A Dozen Ovatures. W. W. Norton & Company. ISBN 978-0-393-53151-0. - ^ Acton, Q. Ashton, ed. (2012). Advances in Agriculture Research and Application (2011 ed.). ScholarlyEditions. p. 528. ISBN 978-1-4649-2119-3. - ^ Davis, Matthew K. (2023). Ancient and Modern Approaches to the Problem of Relativism: A Study of Husserl, Locke, and Plato. Recovering Political Philosophy. Springer Nature. ISBN 978-3-031-22304-4. - ^ Debiais-Thibaud, M.; Marin, F.; Marcellini, S. (2023). \"The evolution of biomineralization in metazoans\". Frontiers in Genetics. 13 1092695. doi:10.3389/fgene.2022.1092695. PMC 9848429. PMID 36685829. - ^ a b c d e f Gill, Frank B. (2007). Ornithology. Macmillan. ISBN 978-0-7167-4983-7. - ^ Chapman, Frank Michler (1919). Bird-life: A Guide to the Study of Our Common Birds. illustrated by Ernest Thompson Seton. D. Appleton and Company=1919. - ^ Coles, Brian H., ed. (2008). Essentials of Avian Medicine and Surgery. John Wiley & Sons. p. 203. ISBN 978-0-470-69156-4. - ^ \"The Parts of the Egg\". 4-H Virtual Farm. Archived from the original on 23 November 2016. - ^ Portugal, J. P.; Bowen, J.; Riehl, C. (2018). \"A rare mineral, vaterite, acts as a shock absorber in the eggshell of a communally nesting bird\" (PDF). Ibis. 160 (1): 173–178. doi:10.1111/ibi.12527. - ^ Stoddard, Mary Caswell; Yong, Ee Hou; Akkaynak, Derya; Sheard, Catherine; Tobias, Joseph A.; Mahadevan, L. (23 June 2017). \"Avian egg shape: Form, function, and evolution\". Science. 356 (6344): 1249–1254. Bibcode:2017Sci...356.1249S. doi:10.1126/science.aaj1945. hdl:10044/1/50092. PMID 28642430. S2CID 11962022. Retrieved 5 August 2025. - ^ Yong, Ed (22 June 2017). \"Why Are Bird Eggs Egg-Shaped? An Eggsplainer\". The Atlantic. Archived from the original on 24 June 2017. Retrieved 23 June 2017. - ^ Nishiyama, Yutaka (2012). \"The Mathematics of Egg Shape\" (PDF). International Journal of Pure and Applied Mathematics. 78 (5): 679–689. - ^ a b Rääbus, Carol (18 February 2018). \"The chemistry of eggshell colours\". ABC News. Australian Broadcasting Corporation. Retrieved 21 January 2023. - ^ Martínez, Ana; López-Rull, Isabel; Fargallo, Juan A. (23 August 2023). \"To Prevent Oxidative Stress, What about Protoporphyrin IX, Biliverdin, and Bilirubin?\". Antioxidants. 12 (9): 1662. doi:10.3390/antiox12091662. PMC 10525153. PMID 37759965. - ^ a b Kilner, R. M. (2006). \"The evolution of egg colour and patterning in birds\". Biological Reviews. 81 (3): 383–406. doi:10.1017/S1464793106007044. PMID 16740199. its colouring may be the non-adaptive consequence of pigment glands becoming depleted, or emptying themselves entirely with the completion of the clutch - ^ Leahy, Christopher W. (2021). Birdpedia: A Brief Compendium of Avian Lore. Pedia Books. Illustrated by Abby McBride. Princeton University Press. p. 87. ISBN 978-0-691-21823-6. - ^ a b Attard, Marie R. G.; Bowen, James; Portugal, Steven J. (12 July 2023). \"Surface texture heterogeneity in maculated bird eggshells\". Journal of the Royal Society Interface. 20 (204) 20230293. doi:10.1098/rsif.2023.0293. PMC 10336372. PMID 37434502. - ^ Maclean, C. L. (1985). \"Sandgrouse: models of adaptive compromise\". South African Journal of Wildlife Research. 15 (1): 1–6. Retrieved 5 August 2025. - ^ Minias, Piotr; Gómez, Jesús; Janiszewski, Tomasz (July 2024). \"All around the egg: consistency of spottiness and colouration across an avian eggshell\". Journal of Ornithology. 165 (3): 703–711. Bibcode:2024JOrni.165..703M. doi:10.1007/s10336-024-02162-3. - ^ Heinrich, Bernd (2010). The Nesting Season: Cuckoos, Cuckolds, and the Invention of Monogamy. Harvard University Press. p. 257. ISBN 978-0-674-04877-5. - ^ Solomon, S.E. (1987). \"Egg shell pigmentation\". In Wells, R.G.; Belyarin, C.G. (eds.). Egg Quality: Current Problems and Recent Advances. London: Butterworths. pp. 147–157. - ^ Gosler, Andrew G.; Higham, James P.; Reynolds, S. James (2005). \"Why are birds' eggs speckled?\". Ecology Letters. 8 (10): 1105–1113. Bibcode:2005EcolL...8.1105G. doi:10.1111/j.1461-0248.2005.00816.x. - ^ Fossøy, Frode; Sorenson, Michael D.; Liang, Wei; Ekrem, Torbjørn; Moksnes, Arne; Møller, Anders P.; Rutila, Jarkko; Røskaft, Eivin; Takasu, Fugo; Yang, Canchao; Stokke, Bård G. (January 2016). \"Ancient origin and maternal inheritance of blue cuckoo eggs\". Nature Communications. 7 10272. id. 10272. Bibcode:2016NatCo...710272F. doi:10.1038/ncomms10272. hdl:11250/2427283. PMC 4729921. PMID 26754355. - ^ Schattenberg, Paul (April 2025). \"Why are eggs different colors?\". AgriLife Today. Retrieved 8 August 2025. - ^ English, Philina A.; Montgomerie, Robert (May 2011). \"Robin's egg blue: does egg color influence male parental care?\". Behavioral Ecology and Sociobiology. 65 (5): 1029–1036. Bibcode:2011BEcoS..65.1029E. doi:10.1007/s00265-010-1107-9. JSTOR 41414064. - ^ Hanley, Daniel; Cassey, Phillip; Doucet, Stéphanie M. (2013). \"Parents, predators, parasites, and the evolution of eggshell colour in open nesting birds\". Evolutionary Ecology. 27 (3): 593–617. Bibcode:2013EvEco..27..593H. doi:10.1007/s10682-012-9619-6. - ^ a b c Stoddard, Mary Caswell; Hauber, Mark E. (5 July 2017). \"Colour, vision and coevolution in avian brood parasitism\". Philosophical Transactions of the Royal Society of London: B Biological Science. 372 (1724). doi:10.1098/rstb.2016.0339. PMC 5444060. PMID 28533456. 20160339. - ^ Hauber, Mark E.; Bond, Alexander L.; Kouwenberg, Amy-Lee; Robertson, Gregory J.; Hansen, Erpur S.; Holford, Mande; Dainson, Miri; Luro, Alec; Dale, James (April 2019). \"The chemical basis of a signal of individual identity: shell pigment concentrations track the unique appearance of Common Murre eggs\". Journal of the Royal Society Interface. 16 (153). doi:10.1098/rsif.2019.0115. PMC 6505551. PMID 309"
}