{
  "url": "https://play.google.com/store/apps/details?id=com.roblox.client&hl=en-US",
  "title": "Roblox - Apps on Google Play",
  "text": "ROBLOX – PLAY, CREATE, AND EXPLORE MILLIONS OF EXPERIENCES There’s something for everyone on Roblox. Whether you’re looking to explore, create, roleplay, compete, or hang out with friends, there's an endless amount of immersive experiences for you to discover. And even more are being made every day, all from a growing community of creators around the world. Already have a Roblox account? Log in with your existing account and start exploring some of the most popular experiences from the Roblox community today, including Grow a Garden, Adopt Me!, Dress to Impress, SpongeBob Tower Defense, Brookhaven RP, How to Train Your Dragon, and more. WHAT YOU CAN DO ON ROBLOX DISCOVER ENDLESS EXPERIENCES - Dive into adventures, role-playing games, simulators, obstacle courses, and more - Explore trending experiences and fun, new games daily - Compete in multiplayer battles, run your own business, or embark on epic quests CREATE YOUR OWN AVATAR - Customize your avatar with your favorite clothing, accessories, and hairstyles - Discover thousands of user-created avatar items in the Marketplace - Express yourself with unique animations and emotes EXPLORE TOGETHER—ANYTIME, ANYWHERE - Play on mobile, tablet, PC, console, and VR headsets - Hang out and play with friends in multiplayer games across any device CHAT AND PLAY WITH PEOPLE YOU KNOW - Join a Party and jump into experiences together - 13+ users can also chat via voice or text CREATE, BUILD, AND SHARE - Design games and virtual spaces using Roblox Studio on Windows or Mac - Publish and share your experiences with millions of players INDUSTRY-LEADING SAFETY AND CIVILITY - Advanced content filtering and moderation - Parental controls and account restrictions for younger players - Clear community guidelines promoting respectful interactions - Dedicated trust & safety teams working around the clock WHY MILLIONS PLAY AND CREATE ON ROBLOX - Immersive 3D multiplayer games and experiences - Safe, inclusive environments for everyone - A platform empowering anyone to become a creator - New content added daily by a global community CREATE YOUR OWN EXPERIENCES: https://www.roblox.com/develop SUPPORT: https://en.help.roblox.com/hc/en-us CONTACT: https://corp.roblox.com/contact/ PRIVACY POLICY: https://www.roblox.com/info/privacy PARENT’S GUIDE: https://corp.roblox.com/parents/ TERMS OF USE: https://en.help.roblox.com/hc/en-us/articles/115004647846 PLEASE NOTE: A network connection is required. Roblox works best over Wi-Fi."
}