{
  "url": "https://penntoday.upenn.edu/news/penn-dental-medicine-plant-based-oral-delivery-insulin-regulates-blood-sugar-levels-similar-natural-insulin",
  "title": "A plant-based, oral delivery of insulin regulates blood sugar levels similar to natural insulin | Penn Today",
  "text": "Insulin production has, for the last 50 or so years, come with some risks to the patient. Even so, the medication is lifesaving for the estimated 537 million adults living with diabetes worldwide, with that number expected to grow. Recent clinical studies show that injection via insulin pens can cause insulin to reach the bloodstream so quickly that hypoglycemia, or blood sugar levels that dip below the healthy range, may result. Automated insulin pumps can deliver precise insulin and minimize this risk but are expensive and available only to a small portion of diabetes patients around the world. Now, a plant-based, oral delivery of proinsulin could address these drawbacks, according to a new study published in the journal Biomaterials, led by Henry Daniell of Penn’s School of Dental Medicine. Although clinical insulin has been in use for several decades, it is missing one of the three peptides that occur in natural insulin. The Daniell lab created a plant-based insulin that contains all three peptides and can be ingested orally. The strength of plant cell walls protects insulin from acids and enzymes in a patient’s stomach before the material is broken down by gut microbes. Then, the released insulin is delivered to the liver via the gut-liver axis. Using diabetic mice, Daniell and his team found that their plant-based insulin regulated blood sugar within 15 minutes of ingestion very similarly to naturally secreted insulin. In comparison, mice treated with traditional insulin injections experienced rapidly decreased blood glucose levels leading to transient hypoglycemia. “The risk of hypoglycemia is one of the biggest disadvantages of the current delivery system and can even result in a coma. Our insulin, given orally, has all three proteins and is delivered right to the liver. It works just like natural insulin, which minimizes the risk of hypoglycemia,” Daniell says. Daniell has long researched uses for plant-grown proteins. In a study published in 2015, he led a team of researchers who, for the first time, demonstrated the commercial viability of producing a low-cost drug made from lettuce plants. In that paper, researchers used freeze-dried lettuce leaves to produce an effective drug for hemophilia patients. Daniell has also worked on plant-based medicines to treat pulmonary arterial hypertension, Alzheimer’s disease, polio, and dental plaque and created a plant-based gum that reduces the viral load of COVID-19 in saliva. To produce plant-based insulin, scientists identified human insulin genes and then used what Daniell calls a “gene gun” to blast the genes through the tough plant cell walls. The insulin genes are then integrated into the plant’s genome, in this case the lettuce genome. The resulting seeds permanently retained insulin genes, and subsequently grown lettuce was freeze dried, ground, and prepared for oral delivery following FDA regulatory guidelines. This process is vastly different from producing insulin in the traditional manner, which involves growing the hormone in bacteria or yeast cells, an expensive process requiring purification and a low temperature for transportation and storage. Daniell’s production method eliminates the need for expensive, complex laboratory equipment and results in a product that is shelf stable at room temperature. Daniell says, “We’ve seen news stories about vaccine doses being destroyed because some countries don't have the resources for cold storage throughout the process. It is an enormous cost. This kind of post-production cost is eliminated using our methods because we have shown repeatedly that the product is shelf-stable.” Going forward, Daniell plans to test plant-based insulin in canine and human subjects. “A lot of dogs have diabetes, and the owners have to be home to give insulin three times a day,” he says. “We’ve done canine studies in the past in dogs with hemophilia or heart disease, and we know how to mix the plant powder in their food and add some bacon flavor. They love it.” For people, plant-based delivery of medicines could dramatically alter treatment for diabetes and other diseases. “With this delivery system, we change the whole paradigm, not only for insulin,” Daniell says. “I grew up in a developing country and saw people die because they couldn’t afford drugs or vaccines. For me, affordability and global access to health care are the foundation for my work. And in this case we are making insulin more affordable while significantly improving it. Patients can get a superior drug at a lower cost.” Henry Daniell is vice chair and the W. D. Miller Professor in the Department of Basic and Translational Sciences in the University of Pennsylvania School of Dental Medicine. Daniell’s coauthors on this paper were Rahul Singh, postdoctoral fellow; Venkata Mangu, senior postdoctoral fellow; Smruti Nair, doctoral candidate in dental medicine; Geetanjali Wakade, postdoctoral fellow; and Nataliya Balashova, research assistant professor at Penn Dental. Daniell is a patentee in this field. Relevant information on patents and applications is available online. This study was supported by the National Institutes of Health, United States (Grant R01 HL 107904) and a Commonwealth of Pennsylvania, Department of Community and Economic Development grant. Credits Writer Lauren Rebecca Thacker"
}