{
  "url": "https://forums.rs-rot.net/t/8890/",
  "title": "UPDATED: Complete History (2004-2023). - Hall of Fame - Reign of Terror",
  "text": "Gkef Report post Posted January 6, 2009 Old and New Testaments written and compiled by Gkef; with thanks to Harry, Matt, Hotshot, Sean, Ldjlerik, Mike/And1, and Ali/N0v4 for contributing. Book of RoT compiled by Matt; with thanks to Brett, Edson, Karma, Nine, President, Savea, Rob and Ryan for contributing. Updated February 25th, 2024. ♰ Part 1: Old Testament ♰ Chapter I: Pre-History In 2004, a new concept and ideology arose within the RuneScape clan community – nMe, the first official no honor clan, was born, led by Deerslayer14, Owners1, and Hanky Boy. Many long-lasting members and future officials such as Tidusx 5, Andrewhol/Matty022, and Dragon Tonna would join soon after. The clan and the NH activities that they partook in were widely looked down upon by the entire clan community. nMe would eventually split into various successor clans. During this era, many future RoT officials would join the NH clan world such as Xx Hotshot X, Themario, Noobpkerbri, Insanecancer, and Black Hawk77. It was also during this era that the first clan named Reign of Terror was born. This clan experienced some success, however with the increased migration of top clans into the F2P wilderness, the P2P wilderness was left deserted, eventually leading to the clan's closure. In the spring of 2006, Hotshot approached Tidus about reopening Reign of Terror. Tidus agreed with no hesitation. Prominent names in the NH clan world, such as Devil Dante, 100Fightmage, Dragon Tonna, Saint Beast8, Gary1337, and Dmitriy93 joined as well. The clan grew quickly and instantly became a force in the P2P wilderness. It established a strong mage bank team which created new, never-before-seen tactics. It was during this era that Reign of Terror developed a historic P2P rivalry with Damage Incorporated, the top P2P clan in the game at the time. A month after the clan's opening, Dragon Tonna was promoted by Hotshot and Tidus as the third leader of the clan. In the meantime, a new NH clan had been formed – Most Wanted was founded in April of 2006, led by And1bbal22 and Grant502. The leadership team of MW consisted of many future RoT officials and legends, including Judgejod0, Rune Demon5, and Ldjlerik. Over the summer, the clan became more popular due to P2P events such as luring and EoH fights. Once the summer was over, however, the clan went into a slump. The majority of the clan was GMT-based, leaving the EST members without much to do at night. Furthermore, events such as luring became boring, leaving them yearning for larger scale P2P wars. In the middle of the summer, the second Reign of Terror clan had suddenly been closed. In August of 2006, many former RoT officials and members joined Violent Resolution, a clan recently created by the merge of Hostile and Awaken. One month later, Tidus and Hotshot decided to leave VR to reopen RoT. They secretly established new forums, and in early October the clan was opened to the public. Nearly all ex-RoT who had joined VR followed Tidus and Hotshot to the new reincarnation of the clan. Other VR members, such as Plazahitman, the future leader of RoT, also followed suit and joined RoT. Throughout the month of October, Reign of Terror and Most Wanted teamed up on several occasions, forming somewhat of an alliance. In early November, the idea of a merge sprung up. The original idea was the creation of one large NH clan named Axis Power, which would consist of members from RoT and MW, as well as VR members who would follow VR leader Stephen22288 out of the clan. Axis was never created because VR did not pull through; however, this did not stop RoT and MW from continuing their plans for a merge – a move which would forever change the clan world. Chapter II: The Merge On November 16, 2006, Most Wanted and Reign of Terror merged together to create the new Reign of Terror, led by Tidus, Hotshot, and And1bball22. The notion of a new NH clan being created was an old and overused one, and thus many people did not think the clan would survive. Even members of the clan were skeptical of the merge, because although members and officials of the two clans had some experience together, they did not really know each other on a personal level. Throughout the months of November and December, members arriving from MW easily integrated themselves into the clan. Due to its new-found large member base, RoT immediately made its presence felt in all aspects of the clan world. In P2P, RoT fought against top clans such as Damage Inc, Runescape Dinasty, and Violent Resolution, while also taking on smaller clans that teamed together, such as 3V0lution X, Golden Elites, and B0rn. During this time, RoT also got involved in the F2P crashing scene, developing controversial relations with clans such as Gladiatorz, Divine Forces, and Dark Slayers. The success of RoT continued into the new year.>>Roster Archive: January 2007 Chapter III: A New Brand of \"No Honor\" During the entire first half of 2007, three clans were in constant contention at the top of the P2P multi ladder: Reign of Terror, Damage Inc, and Aggression, a new clan led by 100Fightmage. Other clans continued to give RoT fights as well, such as 3v0lution X, The Stricken Cards, Golden Elites, and Wilderness Guardians. In F2P, RoT formed an alliance with Noobs Incorporated, a growing NH clan in the F2P clan scene. RoT also made deals with larger F2P teams to crash their opponents in exchange for protection. After RoT had taken advantage of them for quite some time, F2P clans started to fight back. Anti-crash teams became much more popular, and anti-NH communities were created that dedicated themselves to crashing RoT's P2P fights. RoT stayed true to its NH values and fought back even harder by coming up with new tactics of F2P crashing, getting spies into honor clans, and crashing clan support rallies and honor clan fun events. In the middle of the spring, And1bball22 left RoT to reopen MW, taking some ex-MW with him. The clan did not survive for long, however they did provide RoT with some decent P2P fights. In the meantime, Tidus and Themario both stepped down, leaving the clan with a huge void in the leadership team. Hotshot and Plazahitman took over as leaders, and Gkef and Ldjlerik were promoted to captain. At the end of the spring, a complete restructuring of the leadership ranks took place. Plazahitman took sole leadership of the clan, and a council was put into place consisting of Gkef, Ldjlerik, Hotshot, Gibs123, Rune Demon5, Themario, Judgejod0, And1bball22, Zack494 and 3 Hit Ko U. The moderating team consisted of Yachu, Holy Elf 20, and Insanecancer. Soon after, a schism in the leadership caused Hotshot, Tidus, And1bball22, and Gkef to temporarily leave RoT. All but Tidus would return to the clan within one week, and would soon after be reinstated in leadership positions. This temporary turbulence in leadership resulted in the promotions Spcmnspff86 and Black Hawk77 to the rank of council. Chapter IV: A Summer of Terror During the summer of 2007, RoT went into a bit of a decline. Members began playing different games such as Counter Strike and Age of Empires II. The P2P wilderness went into a decline as well; consequently, RoT ventured to other areas of the game, such as P2P single and F2P. To participate in P2P single, RoT created Team Penetration, led by Plazahitman, Ldjlerik, and Hero. They were an immediate success in fighting teams at Green Dragons such as L2K and Exiled. Low wilderness single PKing and single-to-multi luring became specialties of the clan throughout the summer.>>Roster Archive: June 2007 In F2P, a new era had come about, wherein the barriers between honor and NH clans dropped. Honor clans would crash each other's anti-crash events, and 1v1 battles were turned into full-fledged cluster fights. The sides were as follows for a few months: Divine Forces, Eternal Honour, Aggression, and Violent Resolution versus Corruption, Damage Inc, The Titans, Collision, and Echo of Silence. Reign of Terror and their allies Noobs Incorporated decided to team on the Corruption side for these fights. These fights continued to take place weekend after weekend, until they started to die off when the school year began. By the end of the summer, the schism in the clan world still existed; however, clans settled their scores one on one rather than with all their allies by their side. RoT and NI continued to crash in F2P until the end of the summer. Chapter V: A New Birth With the new school year came about a new clan. RoT lost their no honor ways, and were looking for a better future. RoT was quickly accepted as an honor clan by the clan community. They participated in anti-crashing events for clans. They broke off their alliance with NI and other NH clans. As a clan, RoT remained neutral towards the growing theme of alliances in the clan community. In P2P, RoT's long-standing P2P rivalries continued against AG and DI. What seemed like great times unfortunately came to an end – on December 9, 2007, Reign of Terror fought Damage Incorporated in what would be the last ever P2P fight in the original wilderness.>>Roster Archive: December 2007 Chapter VI: Bounty Hunter On December 10, 2007, Jagex removed player-killing in the wilderness, and implemented two new arenas into RuneScape: Bounty Hunter and Clan Wars. Although the move to the BH crater scared many, it still provided a viable option for a wilderness replacement, as it was a large enough arena and items were transferable upon death. Throughout the multi BH era, RoT's focus was mainly on the P2P side of the game, where they fought large clans such as Divine Forces and Runescape Dinasty, as well as their greatest rival, Damage Incorporated. RoT and DI fought several times a week for a few months straight. The victories constantly went back and forth. RoT members would return for hours on end to defeat their greatest rivals in history. During this era, the leadership ranks were once again restructured. Plazahitman remained as sole leader, And1bball22, Dreamofunity, and Ldjlerik formed the high council, while 3 Hit Ko U, Daveowns69, Ello Moto89, Gkef, Insanecancer, Nickydp33, Prinz Jao, and Yachu formed the council. At RoT’s last PK trip the multi BH crater, they pulled over 70 members and managed to clear DI, RSD, and LD from the crater with ease. On February 19, 2008, Jagex removed multi-combat from Bounty Hunter, and in effect removed any presence of dangerous multi. Chapter VII: Months of Despair The months in the middle of 2008 without any form of dangerous multi PvP were hard on both RoT and the entire clan community. Many members went into retirement, causing many clans to go into decline. Clan Wars offered only one type of arena, without any options to change rules. Clans rarely fought in P2P, and if they did they would request old school rules. In F2P, clans stuck with bland melee/binds fights only. All in all, this was a rough time for the majority of the clan world – memberlist sizes decreased, and rivalries that were once heated severely cooled off. In P2P Bounty Hunter, teams were on the rise, with Brutality, Infamous Pkers, and Frozen Fury all making a presence in the BH crater. As always in the history of P2P PvP, RoT and DI made a presence as well. RoT was the first clan to pull triple digit options in the new crater, something that was seen as a feat in this era. RoT would form an alliance with Brutality in the BH crater, allowing both clans to maintain a constant presence across various timezones. Together, RoT and Brutality would fight Damage Incorporated for hours on end, hoping to control the BH crater. RoT members continued attending BH events with Brutality until the team's death. On May 24, 2008, Silent Assassins was created, led by ex-RoT officials And1bball22 and Prinz Jao. This clan stole several others members from RoT, namely Nickydp33, Deeryl Omasi and There Is Two. During this time, 3 Hit Ko U & Yachu were promoted to high council, Pbmark, Darth Shaden, and Maleak were promoted to council, and Mattbrazil 2 was appointed as the new FA manager. RoT was at one of its all-time lows, reaching 50 members. Despite this slump, RoT still enjoyed P2P CWA victories against large clans such as Violent Resolution, Divine Forces, and Runescape Dinasty, and RoT members were still able to enjoy P2P BH alongside Brutality. After the death of Silent Assassins, some of RoT's older members began returning. With P2P becoming deserted once again, RoT set their sights on a new area – unfamiliar territory – F2P Clan Wars.>>Roster Archive: July 2008 On September 9, 2008, Jagex updated the Clan Wars arena, introducing returning as well as the option for dangerous fights. This update accelerated RoT's rebuild, as it encouraged members to participate in CWA events. RoT managed to defeat prominent names in the mid-sized F2P clan world, such as Dark Ascension, Rune Raiders, Adelais, Echo of Silence, and Collision. P2P CWA was mostly inactive, however RoT continued enjoying victories over DF and RSD during this era. During this time period, Plazahitman promoted two newer members, Boupbiganey and Dudezach, to the position of council, joining a leadership team of Gkef, Ldjlerik, Yachu, 3 Hit Ko U, Ice Tonkice, Insanecancer, Pbmark, and Maleak. The moderating team at this point in time consisted of Yugowarrior, Nickydp33, Svennekillen, Jacob7767, Deeryl Omasi and the FA manager was Mattbrazil 2. RoT was back on its feet – it had a steady member base and a constant flow of future applicants. The clan was prepared to enter a new era as the promise for more PvP content became a reality. Chapter VIII: Return of PvP & the Return of the Terror On October 15, 2008, Jagex released PvP worlds. Former and retired RoT members began returning to the clan, excited to experience a wilderness-like atmosphere once again. For the next few weeks, the clan world saw a huge spike in activity, with hundreds of people returning to the game. Various rivalries were reignited, with RoT & DI taking center stage in the P2P wilderness scene. The rivalry continued exactly where it left off in multi BH, with victories going back and forth between the two clans. Other clans, such as Aggression, The Stricken Cards, and 420 PKerz all returned to the game and fought RoT multiple times in the P2P wilderness. As weeks passed, the hype of PvP worlds decreased, and tensions died down between the big P2P clans. DI began focusing mainly on F2P, and with AG following them there, RoT was left as the sole active clan in the P2P wilderness. Members began losing interest in the game due to a lack of action, and consequently began going inactive. In order to ensure activity, Plazahitman removed the crashing rule in place, allowing RoT to enter the F2P clan scene. The next few weeks were reminiscent of the summer of 2007, with RoT pulling over 50 members to crash clan fights. Meanwhile, in P2P, RoT and TSC entered in a crash war with each other. Constant hunting of their trips and crashing of their fights resulted in their death in mid-December. Left without a home, many ex-TSC members decided to join RoT, including future RoT legends Battlescar45/Andrew and Nine151.>>Roster Archive: December 2008 Chapter IX: The Half-Year War At the end of the year, RoT and DI entered their first crash war against each other. This crash war would drag on into the new year and would last for the greater portion of 2009. During this time, RoT fought other clans in P2P, such as Kill Orgy, Divine Forces, Brutality, Red Dragon Knights, The British Crusaders, New Bloods, Border Patrol, and Runescape Dinasty. All fights involving either RoT or DI were heavily crashed by the other clan. Both DI and RoT's standards dropped over the course of the crash war, as neither clan wanted to back down from their enemy. P2P multi suffered from the crash war, with many clans fading into the background and eventually closing. For months, RoT's action revolved around the P2P clan scene, resulting in them rarely getting involved in F2P fights. Consequently, Plazahitman changes the rules of the clan, allowing members to join F2P clans while essentially turning RoT into a P2P team. Many officials and members decided to apply to Corruption, a top F2P clan at the time. However, after 48 hours, Plazahitman reversed his decision, bringing back nearly all of RoT's members. All ex-RoT that chose to remain in Corruption eventually returned to RoT. The RoT/DI crash war continued through the school year, and finally came to an end in June, when both clans agreed to a truce. Throughout the rest of the summer and fall, RoT continuously defeated DI in fights, securing the #1 P2P spot. By the end of summer, Plazahitman stepped down as leader after holding the rank for two years, handing over the reins of the clan to captains Mattbrazil 2 and X0x H0z X0x.>>Roster Archive: August 2009 Under the leadership of Matt and H0z, RoT continued fighting and defeating DI, boasting an impressive 5-0 record against them in the month of October. At the end of October, DI suddenly closed, putting an end to RoT's longest rivalry in history.>>Wilderness Archive: October 17, 2009: RoT vs. DI Chapter X: A New Enemy Appears In the midst of the RoT-DI rivalry, Brutality had returned to the game and began to grow rapidly. Around the time of DI's death, Brutality formed an anti-RoT alliance alongside Flames of Fury and Infliction in order to try and take down RoT in P2P. Throughout the months of November and December, RoT would take on and defeat all three clans multiple times. By the end of 2009, FoF & IF closed, leaving just Brutality to fight RoT.>>Roster Archive: January 2010 For the first half of 2010, Brutality held the #2 P2P rank and constantly tried to defeat RoT to achieve the #1 P2P rank. In the meantime, RoT entered into a crash war with Violent Resolution, the #1 F2P clan at the time. Brutality would be joined by their allies VR and Frozen Fury in their P2P fights against RoT, however RoT could not be dethroned. In May, Frozen Fury closed, causing many of their members to join Brutality. Throughout the next few weeks, Brutality would make constant pushes to try and defeat RoT. On May 14, RoT defeated Brutality while heavily outnumbered in an 11-hour fight, setting the record at the time for the longest P2P fight in history. Following this defeat, Brutality launched a large campaign to try and defeat RoT the following weekend. RoT responded by launching a campaign of their own, preparing themselves for what would be called the most important fight of the year. Both clans pulled over 120 people, with RoT achieving their highest pull in history. The battle itself was anticlimactic, with Brutality getting destroyed and calling off returning in a little over 90 minutes. In the following weeks, Brutality lost the majority of its members, and was never again able to put up a similar fight against RoT for the remainder of their history.>>Wilderness Archive: May 14, 2010: RoT vs. Brutality>>Wilderness Archive: May 23, 2010: RoT vs. Brutality For the remainder of the summer, RoT continued hitting all of Brutality's trips, forcing them to incredibly low pulls, and causing many of their members and officials to quit. In June, RoT and VR came to terms on a truce, ending their crash war and delivering another crushing blow to Brutality, who depended heavily on VR for shared members and aid. Brutality would be an insignificant force for the next year, and as such, RoT would remain #1 P2P until their closure. Chapter XI: The Pinnacle With the P2P wilderness now completely under control, RoT began a F2P campaign that would prove to be their greatest one to date. Victories were enjoyed against top F2P clans such as Corruption, Violent Resolution, Divine Forces, and Echo of Silence. Next, RoT defeated The Titans, the #2 F2P clan at the time. Only one clan stood between RoT and the #1 F2P rank – Runescape Dinasty. In early September, RSD relinquished their spot to RoT, first by forfeiting a Saturday fight, and then by losing a weekday fight only a few days later. For the first time in over five years, RuneScape had a clan at the top of both the F2P and P2P rankings, and that clan was Reign of Terror.>>Wilderness Archive: September 5, 2010: RoT vs. RSD>>Wilderness Archive: September 8, 2010: RoT vs. RSD For the next month, RoT continued dominating in both the F2P and P2P wilderness. RoT maintained the #1 F2P rank by fighting off the usual top clans, while also defeating newer competitors in P2P such as Ancient Fury, Higher Force, and Renegade. Moreover, RoT were crowned victors of the 2010 P2P Jagex Cup. Without any clan to truly threaten RoT's reign, the clan went on to being undefeated in over two months. On October 5, 2010, RoT celebrated their 4th birthday as a clan, at their highest point in their four years of existence. The Reign of Terror Hall of Fame was inaugurated on the same day, with fourteen retirees, members, and officials being inducted in celebration of RoT’s birthday.>>Roster Archive: October 2010 Chapter XII: Months of Chaos Throughout the month of October, RoT's status as the top clan in the game resulted in them coming under siege outside of the game. The clan became victims of cyber warfare attacks, which included DDoS attacks on RoT forums, TS servers, and members. Staring adversity in the face, RoT had no choice but to change focus from maintaining #1 to ensuring the clan's survival. The top contender for RoT’s #1 spot in F2P was Echo of Silence. In mid-October, RoT and EoS entered a crash war against each other, beginning the second official F2P crash war in RoT's history. Distracted by the crash war, both clans began to weaken, resulting in RSD reclaiming the #1 spot. For differing reasons, various clans joined the crash war. By the end of the month, The Titans, Divine Forces, and Corruption had joined forces with RoT, while EoS received help from Divine Kings and Violent Resolution. For the remainder of the year and into the New Year, all fights involving any of these clans would be heavily crashed. As the year came to an end, RoT continued to maintain its presence as the #1 P2P clan. Ancient Fury attempted to make a run at the #1 rank, however they were as unsuccessful as all who had tried before them. RoT ended the year by defeating top P2P clans such as RSD and AF in multiple RoT vs. World fights, featuring enemies from all eras including VR, Brutality, and Kill Orgy.>>Wilderness Archive: December 27, 2010: RoT vs. World Throughout the month of January, RoT continued to dominate VR and EoS in their crash war. By the middle of January, EoS had been without a victory in any form of PvP for over 50 days, and their memberlist size had dropped significantly. At this time, Jagex announced the return of the \"old wilderness\" to the game, prompting clan leaders to congregate and put an end to the crash war. On January 17, 2011, a truce was made ending the second crash war of this caliber in the history of the clan world. Chapter XIII: The Wilderness Returns On February 1, 2011, Jagex returned the wilderness to its original state. Without any real competition in P2P, RoT's main source of activity came from F2P, where they began their return to the wilderness with victories over top clans such as Corruption, Divine Forces, and Echo of Silence. Throughout the spring, RoT's rivalries with Kill Orgy and Brutality heated up, resulting in all three clans increasing pressure on their opponents. Eventually, all clans came to terms on a truce, putting an end to RoT's longest crash war to date. Thoughts that Brutality could challenge RoT for the #1 P2P rank after the crash war were quickly shot down, as RoT continued enjoying victories over their most prominent P2P opponent since the closure of DI. Left without any sort of challenge in P2P, RoT returned to the F2P clan scene, with hopes of repeating their historic performance of the previous summer. Chapter XIV: One More Time After a few quiet months in the F2P clan scene, RoT's comeback began with a single fight – a CWA fight against longtime rivals Violent Resolution. While VR managed to outnumber RoT at points by over 20 people, RoT managed to outperform and defeat VR in one of their best performances in history.>>Wilderness Archive: May 15, 2011: RoT vs. VR In the month of June, RoT's activity drastically increased, going out nearly every day for the entire month. In mid-June, RoT began a string of impressive victories in F2P by defeating Divine Forces in an uncapped fight, followed by victories in the subsequent days against Chivalry Legion, The Titans, and Echo of Silence. Following this streak, RoT had another amazing performance in a capped fight against Runescape Dinasty, the #1 F2P clan at the time. RoT matched their kill count and ended with nearly 100 people, drawing with the top clan. A few days later, 80 RoT defeated 115 VR in a 12-hour F2P fight, to which VR responded by threats of a crash war. RoT followed up this fighting by defeating VR in a 7-hour fight on VR's 5th birthday PK trip. RoT continued to hunt VR for the remainder of the summer, boasting a 7-1 record against them in the months of July and August.>>Wilderness Archive: July 20, 2011: RoT vs. VR In P2P, RoT continued to dominate and safely hold their #1 rank throughout the summer. P2P clans such as Frozen Fury and Kill Orgy tried to organize an anti-RoT alliance, however all clans that joined were easily dealt with. The summer also brought about some promotions in the clan; Grimstriper/Harry and Nine151 were promoted to the officer rank, joining a leadership core of H0z, Matt, Brian289, Dan|Two, Dakilla09/Erik, and Paco/Samuel. In addition, Jake and Ethan became the first senior moderators in the history of the clan, while Christy and Daniela joined the moderating team. As was the case with many great clans that came before them, RoT's lifespan could not be infinite. On August 30, 2011, Reign of Terror ceased operations as a RuneScape clan, ending the clan's nearly 5-year long run.>>Roster Archive: August 2011 (Ending ML) ♰ Part 2: New Testament ♰ Chapter XV: Resurrection In February of 2013, Jagex announced in a news post that they would potentially be releasing an \"old school\" version of the game in the near future. The subject was put to a poll, in which hundreds of thousands of players voted, displaying interest in this version of the game. With the prospect of the old game returning, RoT saw an opportunity to return as well. RoT's return to the game was well received by both former members and other players in the clan community hoping to join the clan. Matt and H0z returned to lead the clan, supported by a cast of RoT legends including 3 Hit Ko U, Brian289, Dakilla09/Erik, Dan|Two, Gkef, Insanecancer, Supercoke, Svennekillen, Yachu, and Zack494. The clan officially opened its doors to introductions from prospective members on February 24, two days following the release of the game. Within 48 hours, over 100 people displayed interest in joining the clan. Both officials and applicants of RoT immediately became immersed in the game. RoT's first fight in the new game was a planned non-returning war against Violent Resolution. RoT pulled 100 people to this fight, and despite fighting a VR squad of over 130, RoT dominated the fight consisting mostly of level 60's, ending with over 70 people remaining.>>Wilderness Archive: March 10, 2013: RoT vs. VR Throughout the month of March, RoT members participated in a combat training competition, which saw the clan's combat average rise to over level 80 by the month's end, an average significantly higher than that of the other top clans. At the end of the month, applicants began applying for permanent membership in the clan on an invite-only basis. Around the same time, the first leadership team of the clan was established – Matt and H0z would lead the clan, with 3 Hit Ko U, Brian289, Dan|Two, Erik, and Supercoke serving as captains.>>Roster Archive: March 2013 RoT's second major fight in OSRS would be a non-returning war against Damage Incorporated, who returned to OSRS at the same time as RoT. In a closer battle than the VR war, RoT pulled 95 people and defeated DI with only 40 people remaining.>>Wilderness Archive: March 28, 2013: RoT vs. DI Chapter XVI: Early Dominance Throughout the month of April, RoT members continued training hard, and as a clan most of their events consisted of fights against DI. Without any form of F2P PvP available, clans such as VR and DF were reluctant to hold events, leaving RoT without much variety in terms of opponents. The first planned fight allowing returning between the two clans took place on April 14, with RoT claiming victory after 30 minutes of fighting. In early May, F2P servers were released, revitalizing the clan world. With convincing victories over DF, VR, EoS, and DI, RoT established themselves as the #1 F2P clan in the game. At the ripe age of two months, RoT had already taken RuneScape by storm, establishing themselves as the top clan in all aspects of the game. For the next few months, RoT would continue asserting its dominance, defeating Damage Inc and Ancient Fury in P2P while taking on all the top clans in F2P. In May, Daniela, Harry, and Indoff were promoted to the rank of council in recognition of their hard work dating back to the release of OSRS. Throughout the summer, RoT went undefeated in both F2P and P2P. As no clan could truly compete with RoT on a 1v1 level, clans often teamed in order to attempt to beat RoT. At several fights in the summer, RoT managed to defeat DI, VR, and DF, the clans ranked #2 - #4 in the game, all at the same time.>>Wilderness Archive: June 20, 2013: RoT vs. DI + VR + DF At the end of the summer, H0z and Matt stepped down as leaders of the clan. They were replaced by RoT's most senior officials and two of RoT's oldest members, Brian289 and Erik. Harry and Indoff were promoted to the rank of captain, while two new members, Derek and Jaybird, joined the leadership team as well. The moderating team at this point in time consisted of Andrew, Jim Jim 15, and Nine151. The change in leadership truly marked the end of an era, as Matt and H0z had been the staples of the clan long before they took over as leaders. RoT members were both anxious and excited to enter a new era in the history of Reign of Terror. Chapter XVII: Hostilities & Warfare Throughout the month of September, tensions heated up between RoT and longtime rivals Violent Resolution. Over the course of the month, RoT would hit VR on multiple occasions, as well as infiltrate their clan with spies and leak their leader boards. On October 1, VR crashed RoT in a fight against DI, initiating a crash war between the two clans that would continue for years to come. RoT managed to defeat both clans in a 2v1 fight, and while RoT continued fighting and defeating clans daily, VR went without a win in the wilderness for the remainder of the month.>>Wilderness Archive: October 1, 2013: RoT vs. DI + VR In the months of October and November, Jagex held the first OSRS version of the Jagex Cup. RoT ended the tournament undefeated, winning five out of six championships after being disqualified from the F2P full-out category. During this era, RoT continued defeating top clans such as Damage Inc, Divine Forces, and Ancient Fury in the wilderness with ease, despite attempted interference by VR. In late November, Echo of Silence and Pure Hatred members mass-joined Violent Resolution. VR officials hoped this boost would help them build momentum, however inner-clan drama would soon begin to destroy the clan from the inside out. After seven consecutive losses to RoT, frustrated EoS and PH members would mass-leave, marking the beginning of a year-long slump for VR, throughout which multiple VR senior officials and members would spy on VR for RoT. Soon after, a new clan called Dynasty opened, composed mainly of former RSD, EoS, PH, and Genesis members. Again, VR would try to use them as allies to revitalize their clan, however RoT would easily defeat Dynasty and VR in their first 2v1 fight. Dynasty would fall apart and close soon after, again leaving VR stranded without an ally.>>Wilderness Archive: January 24, 2014: RoT vs. Dynasty + VR For the next few months, RoT would regularly take on clans in 2v1 and 3v1 battles. VR, unable to compete in fights of their own, would team with DI, DF, or various EoS remakes in order to try and take on RoT. This did not faze RoT, however, as they welcomed all challenges and went undefeated in all types of fights during this era. In March, Jagex released a wilderness rejuvenation update, drastically increasing the activity of the P2P wilderness. This would prove to be beneficial to RoT, who ushered in the updates with lengthy PK trips for weeks following their release. At the end of March, RoT took on and defeated DF, DI, and VR in a clean 3v1 fight. Following this loss, DI would cut ties with VR, leaving DF alone to care for their ailing allies.>>Wilderness Archive: March 23, 2014: RoT vs. DF + DI + VR For the next few months, RoT’s activity consisted mainly of fighting and defeating the alliance of DF, VR, and AF, in both F2P and P2P fights. Throughout this era, DI frequently sided with RoT, turning these fights into fairly competitive 3v2 clusters. In the 2014 edition of the Jagex Cup, RoT experienced mixed results – they defeated Damage Inc and Divine Forces en route to a sweep of the F2P cups, while being eliminated from contention in the P2P categories by Ancient Fury and Dynasty Elites. Despite this setback, RoT’s dominance in the wilderness was unaffected, where they routinely defeated DF and AF in F2P and P2P fights, respectively.>>Roster Archive: August 2014 In September of 2014, in response to the falling activity of the F2P wilderness, RoT struck a deal with DI and DF to give each other weekly fights in exchange for immunity from crashing as well as anti-crashing services. RoT defeated DI and DF multiple times during this era, however most weekends were spent chasing around VR while DI and DF engaged in battle. In the meantime, RoT continued exerting their dominance in the P2P wilderness, often defeating the newly formed alliance of Ancient Fury and Anonymous Community in 2v1 fights. By the end of the year, the clan world’s situation became relatively boring for RoT, a direct consequence of the inability of their main rivals, VR and AF, to provide meaningful competition. Fortunately for RoT, the new year would bring about a rejuvenated clan world, one that would reignite the fire in the spirits of all RoT members. Chapter XVIII: RoT vs. the World In January of 2015, Matt reprised his role as leader of RoT, joining Brian289, Erik, Brett, Derek, and Jared to form what would be the senior leadership team of the clan for the next 18 months. Meanwhile, hostilities began growing between RoT/DF and RoT/DI. This eventually led to DF and DI breaking ties with RoT and reforming their alliance with VR and AF. In RoT’s first fight against this mammoth alliance, they dismantled one clan at a time, ultimately becoming the first clan in RS history to simultaneously defeat clans ranked #2 through #5.>>Wilderness Archive: January 18, 2015: RoT vs. VR + DF + DI + AF For the next few months, RoT adopted various strategies to combat their four enemies. In some situations, they would focus on ruining their rivals’ fights, while in others, they would focus on clearing the anti-crashing clans, often forcing fighting clans to cease fighting each other and create 3v1 and 4v1 scenarios. During this era, RoT popularized the mace/spear method of PKing in the P2P wilderness, often hitting alliance clans and stealing their members’ valuable items. RoT also developed an extensive spy network, routinely exposing their enemies’ shortcomings through private forum and TS leaks. The summer of 2015 was one of the most eventful in RoT’s illustrious history. RoT engaged in campaigns against DF in F2P and AF in P2P, hitting them multiple times a week and leaving them both without victories for the entire summer. Former enemies of RoT, Echo of Silence and Brutality, both returned to RuneScape in the summer, and immediately joined anti-RoT forces to try to bring them down. F2P mainly consisted of two of DI, DF, EoS, and VR fighting, while the other two were tasked with trying to hold off RoT, while P2P fights mainly saw various combinations of AF, Brutality, and DI teaming against RoT with other members of the alliance crashing. At multiple occasions throughout the summer, RoT took on and defeated the entire alliance in both F2P and P2P.>>Wilderness Archive: August 9, 2015: RoT vs. VR + DF + DI + EoS Despite now having six clans against them, RoT remained the most powerful clan in the game, continuously defeating alliance clans throughout the summer. Having pretty much achieved it all, the next journey for RoT was unchartered territory for any clan throughout history – achieving notoriety beyond the clan world. ♰ Part 3: The Book of RoT ♰ Chapter XIX: Sweeping the Jagex Cup by: Matt As the Summer of 2015 drew to a close it was announced that Jagex would be hosting what we now know was the last Jagex Cup. This began what can only be described as the most intense phase of preparation RoT had ever seen, then or since. From the outset it was made clear that success in every category, constituting a clean sweep, was the only acceptable outcome. In the weeks following, RoT dedicated hundreds of hours to mandatory CWA practice in anticipation of what would be the biggest challenge the clan had ever faced. The tournament itself lasted 6 weeks, with most notable match-ups being the first round of the F2P All Out category against DF and the semi-final round of the P2P All Out category against AF, with the former being considered one of the greatest fights in RoT history. On January 17th, 2016, RoT won its twenty-fourth and final match of the Jagex Cup, remaining undefeated in all matches and completing its clean sweep of the six categories in the Jagex Cup (F2P All Out, F2P 30v30, P2P All Out, P2P 30v30, P2P 20v20, P2P 10v10). This marked the first and only instance of any clan achieving this milestone. Because of Jagex's broadcasting of the tournament, RoT rapidly grew in notoriety around this time. What had once been known by all in the clan world was now becoming a household name in the OSRS community. This would only be the beginning of what can best be described as our meteoric rise to fame. Chapter XX: Fame by: Matt In the early months of 2016, anti-RoT had mostly ceased activity as most of its component clans imploded or slumped in the face of embarrassing performances in the Jagex Cup. RoT began increasingly turning to DMM and PKing streamers for Wilderness events at a time when Twitch was first blowing up on OSRS. This would prove to be a recipe for stealing the spotlight as for months the clan was a daily feature on the likes of Ice Poseidon, B0aty and Pure Spam's streams. RoT increasingly became a topic of discussion on OSRS Subreddits and Discords and the subject of attention on Youtube. The clan continued to innovate, introducing the method of macing into the game in the Summer of 2016, which would permanently change the dynamic of PvP and allow RoT to leverage their spies as a way to demoralize their opponents by taking their plus-ones, a tactic that would become central to the clan's playbook in the following years. The Summer of 2016 saw a couple notable fights, namely the \"Sunday of All Sunday's\" which saw VR fall to 149 RoT, the highest pull in the clan's history. That was followed by what has become known as a surprise Jagex Cup rematch with AF that ended with RoT going 4-0 and would precipitate a series of events that would eventually lead in AF's closure a few months later Chapter XXI: Deadman by: Pres Released on October 29, 2015, Deadman Mode would fundamentally tra"
}