{
  "url": "https://en.wikipedia.org/wiki/Zephyrhills,_Florida",
  "title": "Zephyrhills, Florida - Wikipedia",
  "text": "Zephyrhills, Florida Zephyrhills is a city in Pasco County, Florida, United States. The population was counted at 17,194 in the 2020 census.[5] The city is the headquarters of the Zephyrhills bottled water company. The current mayor is Melonie Monson.[6] History [edit]Zephyrhills began as the town of Abbott on April 18, 1888, and consisted of 280.74 acres. It was briefly renamed Hegman from 1890 to 1892 until its name was reverted back to Abbott.[7] A voting district was established in 1893 followed by a post office in 1896. In 1909, Captain Howard B. Jeffries, a Civil War Union veteran from Pennsylvania, purchased 35,000 acres and created the Zephyrhills Colony Company with a plan to create a community for Civil War veterans.[8] In 1910 the town voted to change its name to Zephyrhills; it was incorporated in 1914.[9] In 1941, one resident reported that Zephyrhills had a sundown town policy forbidding Black people from living within the city limits.[10] The city created a historic district in 1999; in 2001 the Zephyrhills Historic District was nominated for and listed on the National Register of Historic Places.[9] A Founders Day celebration is held annually in March.[11] Geography [edit]Zephyrhills is known for its rolling topography, hence the name. Climate [edit]The climate in this area is characterized by hot, humid summers and warm, generally dry winters. According to the Köppen climate classification system, Zephyrhills has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.[12] Demographics [edit]As of the 2020 United States census, there were 17,194 people, 7,178 households, and 4,174 families residing in the city.[18] Of the total population in 2020, 4.4% were under 5 years old, 18.1% were under 18 years old, and 35.7% were 65 years and over. 54.9% of the population were female. There were 1,548 veterans living in the city and 8.0% were foreign born persons. In 2020, 89.8% of households had a computer and 81.6% of households had a broadband internet subscription. In 2020, 18.1% of the population under the age of 65 lived with a disability and 20.1% of that same population did not have health insurance. In 2020, the median household income was $36,799 and the per capita income was $21,848. 17.8% of the population lived below the poverty threshold. As of the 2010 United States census, there were 13,288 people, 5,977 households, and 3,643 families residing in the city.[19] Arts and culture [edit]Libraries [edit]The Zephyrhills Public Library was founded in 1912. The library is a part of the Pasco County Library Cooperative.[20] A new library was built in 2014.[citation needed] Museums [edit]The Zephyrhills Depot Museum originated with the 1989 purchase of the 1927 Atlantic Coast Line Depot from CSX Railroad by the City of Zephyrhills. The original depot was relocated 200 feet (61 m) west of its original location. The 2,700 square feet (250 m2) building was restored and opened in 1998. The Zephyrhills Museum of Military History is a renovated infirmary used in World War II at the Zephyrhills Municipal Airport.[21] The airport was used for training, and the infirmary is the only extant building from the war.[citation needed] Infrastructure [edit]Transport [edit]Major roads [edit]- US 301 (Fort King Highway/Gall Boulevard) is the main road through Zephyrhills running north and south through the city. - SR 39 (Paul S. Buchman Highway/Gall Boulevard) runs northwest and southeast from Plant City into US 301 in Zephyrhills, and joins US 301 as a \"hidden state road\". - CR 41 (Fort King Highway/Fort King Road) is an extension of SR 41, which is a hidden state road along US 301 from the Hillsborough County Line. - SR 54 (Fifth Avenue) is the main east–west road that runs through southern Pasco County, from US 19 near Holiday to US 301 in Zephyrhills. A County extension (CR 54/Eiland Boulevard) from the intersection of SR 54 and CR 579 to U.S. Route 98 in Branchborough also exists, and a western extension to CR 577 in Wesley Chapel is planned for construction. - SR 56 (State Road 56) is a 2002-built road between SR 54 and runs to US 301 south of Zephyrhills. - County Road 579 (Morris Bridge Road/Eiland Boulevard/Handcart Road) is a bi-county extension of State Road 579 that runs from northern Tampa, through the western edge of the city, to west of Dade City. County Road 54 overlaps CR 579 north of SR 54 until it branches off to the east. - County Road 535 (Chancey Road/Old Lakeland Highway) runs along the southern and eastern edge of the city and north into County Road 35 Alternate in Vitis. Public transportation [edit]Zephyrhills is served by Pasco County Public Transportation on routes #30, #33, and #54.[22] Airport [edit]The city is served by Zephyrhills Municipal Airport. It was also once served by the 1927-built Zephyrhills Depot on the Atlantic Coast Line, which is now the Zephyrhills Depot Museum at a city park near the airport. More than 70,000 skydives are performed annually on the airport at Skydive City, Inc., the largest woman-owned drop zone in the world, founded in 1990 by Joannie Murphy and Susan Perkins Stark. Railroads [edit]CSX Transportation's Yeoman Subdivision becomes the Wildwood Subdivision as they pass through the eastern parts of Zephyrhills.[23] Public safety [edit]The Zephyrhills Police Department consists of about 35 officers that cover the incorporated City of Zephyrhills.[24][25][26] In September 2020, Pasco County Fire Rescue took over all fire and rescue service responsibilities for the City of Zephyrhills.[27] Health care [edit]AdventHealth Zephyrhills is the only hospital.[28] Notable people [edit]- Domonic Brown, baseball player[29] - Dave Eiland, former Major League Baseball pitcher - Bobby Geudert, soccer player (died in Zephyrhills) - Prince Iaukea, pro wrestler (born Michael Hayner) - Ramiele Malubay, American Idol finalist (attended Zephyrhills High School until 2002) - Jessica Meuse, American Idol finalist, briefly lived in Zephyrhills - Tracy Negoshian, fashion designer - Stephen Perry, writer for the animated series ThunderCats and SilverHawks - Ryan Pickett, defensive tackle for the Green Bay Packers, graduated from Zephyrhills High School in 1998 - William D. Porter Navy officer; the USS \"William D. Porter\" was named after him. - Buzzie Reutimann, race car driver - David Reutimann, NASCAR Sprint Cup Series race winner and son of Buzzie Reutimann. - Carl Tanzler (aka Carl von Cosel), person who stole and preserved the corpse of Elena Milagro Hoyos See also [edit]References [edit]- ^ a b c U.S. Geological Survey Geographic Names Information System: Zephyrhills, Florida - ^ \"2020 U.S. Gazetteer Files\". United States Census Bureau. Archived from the original on March 18, 2021. Retrieved December 2, 2021. - ^ \"Population and Housing Unit Estimates\". United States Census Bureau. July 1, 2021. Archived from the original on July 11, 2022. Retrieved April 20, 2023. - ^ \"U.S. Census website\". United States Census Bureau. Archived from the original on December 27, 1996. Retrieved January 31, 2008. - ^ a b \"Census.gov Quick Facts Zephyrhills city, Florida\". Census.gov. Archived from the original on May 18, 2022. Retrieved April 20, 2023. - ^ \"Spina and Monson take election victories - Zephyrhills Free Press\". April 11, 2023. Archived from the original on April 18, 2023. Retrieved April 18, 2023. - ^ \"History of Pasco County, Florida\". Fivay.org. Archived from the original on May 29, 2024. Retrieved September 12, 2024. - ^ Blackstone, Lillian (March 23, 1952). \"Into Center of State\". St. Petersburg Times. p. 19. Archived from the original on February 3, 2016. Retrieved November 1, 2015. - ^ a b \"Historic Tour | Zephyrhills, FL\". Ci.Zephyrhills.fl.us. City of Zephyrhills. Archived from the original on April 11, 2020. Retrieved September 12, 2024. - ^ \"Down in Florida\". Marengo Republican-News. Marengo, Illinois. January 23, 1941. p. 1. Archived from the original on September 12, 2024. Retrieved March 3, 2019 – via Newspapers.com. 'Believe it or not, we have 'black-outs' here. Negroes are not allowed to live in the city. They must live either in the country or on the R.-R. right-of-way.' - ^ \"Founder's Day Parade - Zephyrhills\". American Folklife Center. Library of Congress. Archived from the original on April 17, 2010. - ^ \"Zephyrhills, Florida Köppen Climate Classification (Weatherbase)\". Weatherbase. Archived from the original on March 31, 2016. Retrieved September 19, 2017. - ^ \"Zipcode 33542\". www.plantmaps.com. Archived from the original on March 6, 2022. Retrieved March 6, 2022. - ^ \"Zephyrhills, Florida Climate\". www.bestplaces.net. Archived from the original on March 6, 2022. Retrieved March 6, 2022. - ^ \"Census of Population and Housing\". Census.gov. Archived from the original on April 26, 2015. Retrieved April 20, 2023. - ^ \"P2 HISPANIC OR LATINO, AND NOT HISPANIC OR LATINO BY RACE - 2010: DEC Redistricting Data (PL 94-171) - Zephyrhills city, Florida\". United States Census Bureau. Archived from the original on September 12, 2024. Retrieved November 26, 2023. - ^ \"P2 HISPANIC OR LATINO, AND NOT HISPANIC OR LATINO BY RACE - 2020: DEC Redistricting Data (PL 94-171) - Zephyrhills city, Florida\". United States Census Bureau. Archived from the original on September 12, 2024. Retrieved November 26, 2023. - ^ \"S1101 HOUSEHOLDS AND FAMILIES - 2020: Zephyrhills city, Florida\". United States Census Bureau. Archived from the original on September 12, 2024. Retrieved November 26, 2023. - ^ \"S1101 HOUSEHOLDS AND FAMILIES - 2010: Zephyrhills city, Florida\". United States Census Bureau. Archived from the original on September 12, 2024. Retrieved November 26, 2023. - ^ \"Zephyrhills Public Library\". www.pascolibraries.org. Retrieved May 11, 2025. - ^ \"Barracks Museum | Zephyrhills, FL\". www.ci.zephyrhills.fl.us. Retrieved May 11, 2025. - ^ \"Archived copy\". Archived from the original on July 24, 2013. Retrieved November 26, 2013. {{cite web}} : CS1 maint: archived copy as title (link) - ^ JACKSONVILLE DIVISION TIMETABLE NO. 4. CSX Transportation. 2005. pp. 179–183. - ^ \"Chief of Police | Zephyrhills, FL\". ci.zephyrhills.fl.us. City of Zephyrhills. Archived from the original on February 28, 2020. Retrieved February 28, 2020. - ^ \"Police Department | Zephyrhills, FL\". City of Zephyrhills. Archived from the original on February 28, 2020. Retrieved February 28, 2020. - ^ \"Zephyrhills Police Department\". City of Zephyrhills. Archived from the original on August 10, 2010. Retrieved July 31, 2010. - ^ Behrendt, Barbara (May 5, 2020). \"Pasco County Agrees to Take Over Fire and Rescue Services for Zephyrhills\". Tampa Bay Times. Archived from the original on March 16, 2024. Retrieved March 17, 2024. - ^ \"AdventHealth Zephyrhills launches upgraded EP Lab\". Hospital Management. June 2, 2025. Retrieved July 28, 2025. - ^ \"Domonic Brown Stats, Height, Weight, Position, Rookie Status & More\". Baseball-Reference.com. Retrieved September 1, 2025. Further reading [edit]- Harrison, Benjamin (1997). Undying Love - The Shocking True Story of a Passion That Defied Death. St. Martin's. ISBN 0-312-97802-2. - Trottman, Rosemary W. (1978). The History of Zephyrhills, 1821-1921. Vantage Press. ISBN 0-533-02882-5. - Wise, Madonna Jervis (2008). Tapestry-Zephyrhills: An Anthology of Its History Through Education. BookSurge Publishing. ISBN 978-1-4196-9640-4. - Wise, Madonna Jervis (2010). Zephyrhills (Images of America). Arcadia Publishing. ISBN 978-0-7385-6676-4."
}