{
  "url": "https://en.wikipedia.org/wiki/Altay_(tank)",
  "title": "Altay (tank) - Wikipedia",
  "text": "Altay (tank) Altay (Turkish for Red foal/colt) is a Turkish fourth generation[19][20][21] main battle tank designed by Otokar, based on the South Korean K2 Black Panther. It is produced by BMC with design assistance and technology transferring by Hyundai Rotem.[4] It is named in honor of Army General Fahrettin Altay who commanded the 5th Cavalry Corps in the final stage of the Turkish War of Independence.[22] Altay is combined with MKE made 55 calibre 120 mm main gun, Roketsan made advanced composite and reactive armor package along with Aselsan made electronics such as active protection, remote controlled weapon and fire control systems. The first batch will be produced using HD Hyundai Infracore engine and SNT Dynamics transmission, while the second batch will use BMC-made domestic powerpack.[15] Mass production officially began on 5 September 2025. It officially entered service on 28 October 2025.[23] History [edit]The National Tank Production Project (Turkish: MİTÜP – Milli Tank Üretimi Projesi) was an initiative developed in the mid-1990s to establish independent and robust infrastructure for the production, development and maintenance of main battle tanks used by the Turkish Armed Forces.[24][25] In order to improve the current technical capabilities of the Turkish defense industries and increase the amount of domestic contribution towards national defense, the Undersecreteriat for Defense Industries decided that a \"National Tank\" will serve as a catalyst for uniting certain Turkish defense companies around a common goal and for providing the Turkish military with extra firepower in the form of a modern tank. This is Turkey's first MBT development program since 1943, when prototypes of a Turkish national tank were produced in Kırıkkale,[26] but 1943's program never reached full-scale mass production. The Turkish Ministry of Defense allocated a budget of $1 billion for the development of the Altay.[27] Development [edit]The project was initiated with an agreement signed between Otokar and the Undersecretariat for Defense Industries of the Republic of Turkey on 30 March 2007, when the Defense Industries Executive Committee awarded a contract worth approximately $500 million to Otokar for the design, development and production of four prototypes of a national main battle tank. On July 29, 2008, Turkey and Hyundai Rotem signed a ₩500 billion (approximately US$540 million) design assistance and technology transfer contract for tank development. This contract consists of design assistance and technology transfer related to the development of systems, armor packages, and 120 mm guns necessary for the development of Altay tanks, and includes design assistance and technology transfer of Hyundai Rotem, Hyundai WIA, and Agency for Defense Development throughout the development process.[4] The first 3D image of the MBT was released to the public on 7 April 2010 during a press release by the Undersecreteriat for Defense Industries of the Republic of Turkey.[28] In 2012, Otokar General Manager Serdar Görgüç has announced that the company is considering the development of an electric engine for the Altay.[29] However, the electric engine probably no longer in consideration. The military electronics company Aselsan manufactures and integrates the Volkan III modular fire control system, command, control and information systems, while state-owned MKEK (Mechanical and Chemical Industries Corporation) produce MKE 120 mm tank gun. Another state company Roketsan produce an indigenous armor. The first prototype Altay was ready for use by the end of 2016.[30] Once the prototypes are produced and tested, the Undersecreteriat for Defense Industries of the Republic of Turkey will prepare and execute a separate order for the first lot of 250 tanks. A total of 1000 MBTs are planned to be produced in four separate lots of 250 units. Every delivered lot is expected to have additional upgrades.[31] Otokar completed all infrastructure planning and programming for mass production. Koç Holding Vice Chair and Otokar Chair Ali Koç said mass production was expected to start 18–22 months after their offer was accepted.[32] However, on 9 November 2018, Turkish Presidency of Defense Industries signed agreement with BMC for mass production of the tank.[3] In the process, BMC replaced Otokar as the main contractor and responsible for further developments.[citation needed] The production of Altay has been delayed since 2018, as the programme was relying on German 1,500 hp MTU engines and RENK transmissions,[33] because of the German federal arms embargo on Turkey due to their involvement in the Syrian Civil War.[34] Another request from Mitsubishi Heavy Industries was also declined.[35] However, BMC Power, a subsidiary of BMC, replaced MTU as engine subcontractor for 1,500 hp engine. BMC Power is the designer and manufacturer of the serial production BATU V12 1,500 hp engine.[36][37][38] On 10 March 2021, BMC announced that it plans to import a Korean power pack that combines Doosan Infracore (now HD Hyundai Infracore) DV27K engine and SNT Dynamics EST15K transmission and complete the performance test of the Altay tank according to Turkey's own standards as soon as possible.[39] On 11 August 2021, the South Korean Defense Acquisition Program Administration announced that it was looking for a Korean company to develop an improved SNT Dynamics EST15K transmission for use in Altay and K2 Black Panther.[40] On 7 October 2021, the South Korean Defense Acquisition Program Administration announced that it is looking for a Korean company to develop an indigenous Transmission control unit to replace the German Transmission control unit used in the SNT Dynamics EST15K transmission to export transmissions to Turkey.[41] On 22 October 2021, Kang Eun-ho, head of South Korea's Defense Acquisition Program Administration, said he had approved the export of Hyundai Doosan Infracore DV27K engines and SNT Dynamics EST15K transmissions to Turkey during a meeting with Turkish Foreign Minister Mevlüt Çavuşoğlu visiting South Korea.[42] At the Antalya Diplomacy Forum held on March 11, 2022, Ismail Demir, president of Turkish Defense Industries (SSB), revealed that he was testing Hyundai Doosan Infracore DV27K engine and SNT Dynamics EST15K transmission imported from South Korea and he said in May that he will be able to see a prototype of Altay that combines Korean engines and transmissions.[43] In August 2022, the durability test of the powerpack combined with the DV27K engine and EST15K transmission imported from South Korea is underway, and if the durability test succeeds, the first 250 Altay will be produced by integrating the Korean powerpack.[44] In his speech at the handover ceremony of the new generation of assault howitzers (MSB Arifiye Campus BMC Plant / Sakarya), President Erdogan said that two new Altay tanks will be manufactured in 2023.[45] On 30 January 2023, BMC signed a supply agreement with SNT Dynamics to purchase the EST15K transmission. The agreement includes a supply contract (approximately €68.926 million) to procure 90 transmissions by December 2027 and an option contract (approximately €130,900 million) to procure an additional 150 transmissions by December 2030.[46][47] In March 2023, BMC announced it planned to deliver two Altay tanks to the Turkish Armed Forces in April 2023 for field tests expected to last 1.5 to two years, with mass production planned for 2025. Given the number of changes to the project, the company is now referring to the tank as the \"Yeni Altay\" (New Altay).[48] Mass production officially began on 5 September 2025 with a dedicated factory, which is partially funded by Qatar, officially opened on 28 October 2025.[49][50] In February 2025, Haluk Görgün announced that deliveries of ALTAY tanks in the T1 configuration will begin as of 2025. 3 ALTAY T1 tanks will be delivered in 2025 (5 total delivered). These deliveries are expected to be made in August. 85 tanks in T1 configuration will be delivered, followed by 11 ALTAY tanks in 2026, 41 tanks in 2027 and then 30 tanks. The South Korean power group will be used in the first 40 ALTAY tanks, then the domestic power group will be used and the 1500 horsepower BATU will be used.[51][52] Design [edit]The tank benefits both from indigenously developed systems and from technologies of the K2 Black Panther, accorded by an agreement signed with South Korea.[4] The main armament of the tank is the 120 mm 55 caliber smoothbore gun, which is based on the CN08 120 mm gun of the K2 Black Panther, was redesigned by MKEK to remove the autoloader feature in exchange for higher reliability. The thermal sleeve of the gun barrel is equipped with a gun stabilizer configured with a static muzzle reference system (SMRS).{{Citation needed}} The armor package was modified based on the K2's Korean Special Armor Plate (KSAP),[12] but was redesigned by Roketsan for higher ballistic protection in the Altay and will include CBRN defense elements, to protect it from chemical, biological, radiological and nuclear weapons. Also there will be add-on reactive armor.{{Citation needed}} The planned maximum speed of the first batch is set at 65 kilometres per hour (40 mph), provided by an 1,500 hp (1,100 kW) engine and the MBTs will be able to function under 4 metres (13 ft) of water.{{Citation needed}} The first mass production tank will be powered by 1,500 hp (1,110 kW) DV27K engines and EST15K transmissions (6 forward, 3 reverse gears) designed by Hyundai Doosan Infracore (now HD Hyundai Infracore) and SNT Dynamics in South Korea.[15] whereas the latter batches may powered by an BMC Power BATU V12 12 cylinder V type 1,500 hp (1,100 kW) engine.[15] The suspension system adopts Hyundai Rotem's non-active in-arm suspension unit (ISU) and includes a track tension system that automatically adjusts the tension of the track.[16][53] For mass production of the suspension system, KUMA, a partner of Hyundai Rotem, is in charge.[54] ASELSAN made electronic systems produced within the scope of Altay Mass Production Project; Fire Control System, Electric Gun and Turret Engagement System, Command Control Communication and Information System, Driver Vision System, Laser Warning System, Remote Controlled Weapon System, Battlefield Recognition and Identification System, Close Range Surveillance System, AKKOR Active Protection System. HAVELSAN provides training and simulation for maintenance and training.[55][56] While moving at high speeds, to evade ATGM attacks, sudden braking and manoeuvering at severe angles are capabilities that were taken into consideration from early developmental stages. An isolated ammunition compartment (turret bustle) is designed to protect tank crew, alongside fire and explosion suppression systems that are to activate when hit or when the tank is involved in an accident. The tank is to be equipped with sensors for the detection of contaminated air from chemical, biological and nuclear weapons.[2] The tank also has hunter-killer engagement capability.[33] Prototypes [edit]On 29 April 2009, the Subsecretary for Defence Industries of Turkey, Murad Bayar has confirmed at the 9th IDEX International, Defense Industry Fair in Abu Dhabi, that the Turkish tank will be manufactured using only Turkish resources. He added that the research started last week and that he expected to create an authentic tank model specially designed for the needs of the Turkish Armed Forces within 3 years.[57] In September 2010, with approval of the tank subsystems and software by Undersecretariat for Defense Industries, Conceptual Design Phase of the Altay project has been completed. Thus, the project advanced to Detailed Design Phase scheduled to last 30.5 months. The scope of the Detailed Design Phase is to design and integrate interfaces for the selected tank subsystems.[57] On 15 October 2010, Otokar signed a contract with MTU and Renk for the supply of power pack. Also, On 15 December 2010, Defence Industry Executive Committee decided to start the development of national power pack.[58] On 10 May 2011, Aselsan was contracted by the Undersecretariat for Defense Industries to design and develop two Battlefield Target Identification Device (BTID) prototypes.[59] On 11 May 2011, the mock-up of the Altay was introduced to the public in IDEF2011.[60][61] On 18 October 2012, the first Altay was put on trials although lacking side skirts and using a mock-up turret to simulate a real turret.[62] On 16 November 2012, two pre-prototype types, named Altay MTR (Mobility Test Rig) and Altay FTR (Firepower Test Rig),[63] successfully passed initial acceptance tests, paving the way for serial production 2 years earlier than expected, with two more prototypes to be built by 2013 or 2014.[64][65][66] On 7 November 2016, MTR, FTR, PV1 and PV2 (Pilot Vehicle) prototypes made by Otokar were delivered to the Turkish Land Forces, and their acceptance tests were expected to finish in the last quarter of 2016 or early 2017.[63][67] Another prototype variant called Altay AHT (Asimetrik Harp Tankı - \"urban operations tank\") was showcased by Otokar at the IDEF'17 defense and aerospace show in Istanbul on May 9–12. The tank is equipped with a directional dozer blade.[68][69] In May 2019, the new developer BMC unveiled Altay's revised baseline serial production model, named T1, at the IDEF Defense Exhibition.[citation needed] On 23 April 2023, 2 T1 variant Altays were delivered to TAF for further evaluation and testing.[70] Contractors and subcontractors [edit]Subsequently, in accordance with the later Defense Industries Executive Committee ruling, approximately 200 subcontractors were selected.[3] Main ones are as follows: - Design and development: Otokar[2] - Design assistance and technology transfer: Hyundai Rotem[4] - Main contractor, manufacturer: BMC (replaced Otokar)[3] - Main smoothbore gun subcontractor: state owned MKEK[3] - Main smoothbore gun technology transfer: Hyundai WIA[4] - Rolled homogeneous armor (MIL-12560H): POSCO[71] - Armor package subcontractor: Roketsan[2] - Armor package technology transfer and supply of ceramic ballistic plates: Samyang Comtech[4][5] - Armor package design assistance: Poongsan Corporation[4] - Continuous track development and subcontractor: LS Mtron[72][73] - Hydropneumatic suspension system subcontractor: Hyundai Rotem[53] - Powerpack subcontractor (initial, canceled): MTU Engine[3] & Renk Transmission[3] - Powerpack subcontractor (first batch): HD Hyundai Infracore (engine)[15] and SNT Dynamics (transmission)[15] - Powerpack subcontractor (second batch): BMC Power[3] - Sub-systems subcontractor: Aselsan and HAVELSAN[3] Variants [edit]- Altay T0 – baseline prototype variant.[3] - Altay T1 - serial production variant with Korean powerpack[74] - Altay T2 – improved serial production variant with Turkish powerpack.[74] - Altay T3 – planned variant with unmanned turret.[74] - Engineering: Bridge Layer, Mine Clearing and Recovery Vehicle variants are planned.[75] Foreign interest [edit]- Azerbaijan - At IDEF-2013, the Azerbaijan Army expressed interest in Altay.[76] - Colombia - According to reports, a military envoy from Colombia was present at the 2010 press meeting hosted by the Undersecreteriat for Defense Industries of the Republic of Turkey to obtain more information about the tank.[28] - Saudi Arabia - In April 2013, officials of the Saudi Arabian Army reportedly became interested in Altay.[77] Also in 2025, it is reported that Turkey has been aiming to secure a $6 billion defense deal with Saudi Arabia which includes Altays.[78] - Oman - Otokar was invited to a bid for 77 Altays for a tender in Oman in August 2013.[79] - Pakistan - Pakistan has also shown interest in procuring the Altay for their armed forces in 2016.[77] - Qatar - In March 2019, a senior Turkish politician stated an order for 100 tanks was placed by Qatar.[80] Operators [edit]Current operators [edit]- Turkish Land Forces – 5 in active service. 250 ordered (85 in T1 & 165 in T2) with 750 more on option.[3] Future operators [edit]- Qatari Emiri Land Force – 100 ordered.[81] References [edit]- ^ \"ALTAY Tankı'nın Yeni Seri Üretim Tarihi Açıklandı\". 9 January 2023. - ^ a b c d \"Altay Tank\" (PDF). Roketsan.com.tr. Archived (PDF) from the original on 28 February 2013. Retrieved 28 February 2015. - ^ a b c d e f g h i j k l \"ALTAY\". TURKISH DEFENCE INDUSTRY PRODUCT CATALOGUE. Archived from the original on 9 August 2021. Retrieved 10 August 2021. - ^ a b c d e f g h Hyundai Rotem (31 July 2008). \"터키 전차개발 기술협력 계약 체결\". Hyundai Rotem. Archived from the original on 10 October 2021. Retrieved 10 October 2021. - ^ a b \"History\". Samyang Comtech. Archived from the original on 2 November 2025. Retrieved 2 November 2025. - ^ \"Altay tankı projesi için teklifler haftaya\". 11 January 2016. Archived from the original on 17 May 2016. Retrieved 20 April 2016. - ^ \"ALTAY'ın birim maliyeti çok mu yüksek? | SavunmaSanayiST\". 7 July 2019. - ^ \"Mass production of Turkish main battle tank Altay begins - Türkiye News\". 5 September 2025. - ^ \"İki adet yeni Altay Tankı, testleri için Kara Kuvvetleri Komutanlığı'na teslim edildi\". Defense Here. 23 April 2023. Retrieved 25 June 2023. - ^ \"Altay Main Battle Tank\". Army Technology. 15 June 2011. Archived from the original on 19 September 2012. Retrieved 28 February 2015. - ^ a b c \"Army Guide – Altay\". Army Guide. Retrieved 8 April 2014. [permanent dead link] - ^ a b \"Special Armor Plate for K1A1 Tank, K2 Tank, Altay Tank\". Samyang Comtech. Archived from the original on 2 September 2022. Retrieved 2 September 2022. - ^ \"AKKOR\" (PDF). Aselsan. Archived from the original (PDF) on 29 April 2020. Retrieved 10 August 2021. - ^ \"ALTAY WEAPON SYSTEM\". TURKISH DEFENCE INDUSTRY PRODUCT CATALOGUE. Archived from the original on 10 October 2021. Retrieved 10 August 2021. - ^ a b c d e f g h i \"Engine to power Turkey's long-awaited MBT Altay arrives from S. Korea\". Daily Sabah. 14 March 2022. Archived from the original on 16 March 2022. Retrieved 16 March 2022. - ^ a b \"ALTAY Ana Muharebe Tankı\". BMC Otomotiv. 2023. Archived from the original on 30 April 2024. Retrieved 30 April 2024. - ^ a b \"ALTAY\". BMC Otomotiv. 2023. Archived from the original on 4 January 2023. Retrieved 4 January 2023. - ^ \"TankAltayT1\". Wikimedia Commons (official info by BMC). 2 May 2019. Retrieved 11 August 2021. - ^ Episkopos, Mark (16 July 2021). \"Meet the Altay: How Turkey is Building a Fourth Generation Tank\". The National Interest. Retrieved 11 February 2024. - ^ \"Turkish Main Battle Tank Altay is Finally Entering Service - Technology Org\". 31 August 2025. - ^ \"Türkiye's Altay T1 Tank Enters Service: NATO's New Armored Power in the South\". 28 August 2025. - ^ \"Milli tank 'altay' için yola çıkıldı – Ekonomi Haberleri\". Radikal. 30 July 2008. Retrieved 28 February 2015. - ^ \"New-generation Altay tank enters Turkish army service\". 28 October 2025. - ^ Turkey's National Main Battle Tank Project (ALTAY) started with the ceremony held at Otokar factory otokar.com.tr 1 August 2008 Archived 8 April 2014 at the Wayback Machine - ^ \"ALTAY PROJECT; Undersecretariat for defence Industries\". Archived from the original on 22 July 2011. Retrieved 7 October 2010. - ^ \"Yarım kalan hayal gerçek oldu: İlk tankımızın 80 yıllık sırrı - Son Dakika Flaş Haberler\". 2 November 2025. - ^ \"Milli helikopterimiz parmak ısırtıyor\". En son haber. 28 January 2013. Archived from the original on 31 January 2013. Retrieved 28 February 2015. - ^ a b \"Otokar unveils the Altay MBT\". TR Defence. 7 April 2010. Archived from the original on 13 April 2010. Retrieved 28 February 2015. - ^ \"Otokar mulls making of domestic 'electric tank'\". Hurriyetdailynews.com. 15 April 2012. Archived from the original on 19 September 2015. Retrieved 28 February 2015. - ^ \"Milli Tank Altay'ın üretim serüveni\". Archived from the original on 20 September 2015. Retrieved 16 August 2015. - ^ \"ANKARA – Turkish main battle tank project aims to meet needs of Turkish Armed Forces (TSK)\". Archived from the original on 22 September 2007. Retrieved 21 November 2016. - ^ \"Koç awaits gov't approval to start mass production of domestic Turkish battle tank Altay\". hurriyetdaillynews.com. 10 November 2016. Archived from the original on 21 November 2016. Retrieved 21 November 2016. - ^ a b \"Altay - Prototype main battle tank\". Archived from the original on 4 September 2012. - ^ \"Turkey in talks with South Korea to salvage Altay tank program\". Defense News. 19 November 2020. - ^ \"Japan Decides Against Turkish-Azerbaijan Tank Deal | Eurasianet\". - ^ \"BMC Power\". - ^ \"V12 Project\". BMC Power. Retrieved 11 August 2021. - ^ \"Turkey Reports Successful Test of 'Homegrown' Tank Engine\". 7 May 2021. - ^ Kim Min-seok (10 March 2021). \"터키 차세대 전차 '알타이'에 '국산파워팩' 수출\". News1 Korea. Archived from the original on 16 March 2021. Retrieved 16 March 2021. - ^ Defense Acquisition Program Administration (11 August 2021). \"2021년 2차 무기체계 개조개발 지원사업 지원과제 및 주관기업 모집 공고\". Defense Agency for Technology and Quality. Archived from the original on 25 October 2021. Retrieved 25 October 2021. - ^ Defense Acquisition Program Administration (7 October 2021). \"「K2 전차 변속제어기 (TCU) 변속제어 소프트웨어 부품성능개량개발」 일반부품 국산화사업 주관기업 모집공고\". Defense Agency for Technology and Quality. Archived from the original on 25 October 2021. Retrieved 25 October 2021. - ^ Kim Seung-uk (22 October 2021). \"터키 전차에 국산 파워팩 탑재…터키 외무 \"수출 승인받아\"\". 연합뉴스. Yonhap News Agency. Archived from the original on 25 October 2021. Retrieved 25 October 2021. - ^ Kamer KURUNÇ (16 March 2022). \"South Korean Engine to Power Turkey's ALTAY Tank\". Turkish Defence News. Archived from the original on 15 March 2022. Retrieved 15 March 2022. - ^ Yusuf Emir Işık (11 August 2022). \"ALTAY tankı 2025'de milli güç grubuna sahip olacak\". Defenceturk. Archived from the original on 1 September 2022. Retrieved 1 September 2022. - ^ Ahmet Alemdar (9 January 2022). \"Mayıs'ta yeni ALTAY tankları üretim hattından çıkacak!\". Defence Turk. Archived from the original on 9 January 2023. Retrieved 9 January 2022. - ^ \"Altay전차용 자동변속기 구매공급 계약\". Financial Supervisory Service (South Korea). 30 January 2023. Archived from the original on 18 March 2023. Retrieved 18 March 2023. - ^ \"EST15K Automatic Transmission Order for ALTAY MBT\". Defence Turkey. February 2023. Archived from the original on 18 March 2023. Retrieved 18 March 2023. - ^ \"Yalçıntaş: \"Yeni ALTAY 23 Nisan'da TSK'ya teslim edilecek\"\" (in Turkish). 23 March 2023. Retrieved 23 March 2023. - ^ \"Savunma sanayiinde gurur günü: Altay tankı envantere giriyor\". 28 October 2025. - ^ \"Qatar financed 49% of Turkish tank factory\". Middle East Monitor. 2 July 2021. Retrieved 6 July 2021. - ^ \"ALTAY tankı için teslimat takvimi açıklandı: 250 adet tank geliyor\". DonanımHaber (in Turkish). 24 February 2025. Retrieved 24 February 2025. - ^ \"Türkiye's Altay tank to enter national inventory in 2025\". www.aa.com.tr. Retrieved 25 February 2025. - ^ a b Jędrzej Graf (2 July 2024). \"K2 w nowej odsłonie [WYWIAD]\". Defence24. Archived from the original on 2 July 2024. Retrieved 2 July 2024. - ^ \"방산 유압기기를 만드는 현대로템 협력사, 금아하이드파워\". hyundai-rotem. 30 November 2021. Retrieved 23 January 2026. - ^ \"Yeni Altay Tankı, ASELSAN teknolojileriyle donatıldı\". - ^ \"HAVELSAN develops advanced simulation systems for ALTAY Tank - Defensehere\". 31 October 2025. - ^ a b \"ATAK helicopter to be airborne before end of 2009\". Today's Zaman. Archived from the original on 6 May 2009. Retrieved 17 April 2010. - ^ \"HATA – SSB\". www.ssb.gov.tr. Archived from the original on 18 December 2010. - ^ \"Battlefield Identification Device\". Archived from the original on 31 March 2012. Retrieved 21 November 2016. - ^ \"Turkey introduces main battle tank Altay | Politics | Worldbulletin News\". Worldbulletin.net. 15 November 2012. Archived from the original on 1 July 2015. Retrieved 28 February 2015. - ^ \"ALTAY TANK MOCK-UP – IDEF 2011 ISTANBUL\". 13 May 2011. Archived from the original on 12 February 2017. Retrieved 28 February 2015 – via YouTube. - ^ \"Tank photograph\". Fbcdn-sphotos-e-a.akamaihd.net. Archived from the original (JPG) on 14 January 2015. Retrieved 28 February 2015. - ^ a b \"A century of the tank Mark 1 vs Altay\" (PDF). Otokar. 7 June 2015. Archived from the original (PDF) on 3 October 2015. Retrieved 3 October 2015. - ^ \"The First Prototypes of Altay Turkish National Main Battle Tank Demonstrated their Mobility\". Defence Turkey. November 2012. Archived from the original on 6 July 2022. Retrieved 6 July 2022. - ^ \"Turkey to reveal local tank ahead of deadline – ECONOMICS\". Hurriyetdailynews.com. 15 November 2012. Archived from the original on 17 November 2012. Retrieved 28 February 2015. - ^ \"Altay tank project moves Turkey up a league in defense\". En.trend.az. 16 November 2012. Archived from the original on 19 November 2012. Retrieved 28 February 2015. - ^ \"Karaaslan: üç prototipin testleri 2017'de tamamlanırsa Altay Tankı 2018'de üretilir\". c4defence.com. 7 November 2016. Archived from the original on 21 November 2016. Retrieved 21 November 2016. - ^ \"Otokar Unveiled Altay-AHT, Urban Operations Tank\". 19 May 2017. - ^ \"Turkish company Otokar reveals 'urban operation tank'\". 19 May 2017. - ^ \"Yeni Altay tankı hakkında tüm merak edilenler! - ShiftDelete.Net\". 23 March 2023. Retrieved 11 February 2024. - ^ \"포스코에도 BTS가 있다\". POSCO. 23 July 2025. Archived from the original on 17 July 2021. Retrieved 17 July 2021. - ^ \"LS DEFENSE EQUIPMENT\" (PDF). LS Mtron. Archived from the original (PDF) on 14 December 2025. Retrieved 14 December 2025. - ^ \"History\". LS Mtron. 2025. Archived from the original on 25 April 2025. Retrieved 25 April 2025. - ^ a b c Peter Suciu (27 February 2025). \"Turkey Is Building A Domestic Tank Arsenal\". The National Interest. - ^ \"ALTAY tankı şasesinden üç farklı araç geliştiriliyor\". 17 October 2023. - ^ \"Azərbaycan Türkiyədən \"Altay\" tankları ALACAQ\". - ^ a b \"Turkish Tank Sees Pakistani, Saudi Interest\". 19 June 2016. - ^ \"Turkey seeks $6 billion arms deal with Saudi Arabia: Report\". 27 January 2025. - ^ \"Report: Oman May Acquire German Leopard Tanks\". 13 November 2015. - ^ Herschelman, Kerry (19 March 2019). \"Qatar planning to buy Altay tanks\". Jane's 360. Washington, DC. Archived from the original on 19 March 2019. Retrieved 19 March 2019. - ^ \"Qatar Purchases Turkish Altay Battle Tanks\"."
}