{
  "url": "https://www.verywellhealth.com/delirium-5223127",
  "title": "Delirium: Definition, Causes, and What It Feels Like",
  "text": "What Does Delirium Feel Like? Signs and Causes By Laura Dorwart Updated on March 08, 2025 Medically reviewed by Steven Gans, MD Table of Contents View All Table of Contents Symptoms Causes Types Is It Dementia? Diagnosis Treatment Outlook When to Get Help Delirium is a sudden change in how a person thinks, making them feel confused or disoriented. It can feel like being in a dream where things don’t make sense, and it may be hard to focus, remember things, or recognize people. Delirium is common in hospitalized or seriously ill older adults but can also result from infections, surgery, medications, or substance withdrawal. It is a syndrome rather than a disease, meaning it is usually temporary and improves once the underlying cause is treated. SilviaJansen / Getty Images What Does Delirium Feel Like? Delirium causes sudden confusion and trouble thinking clearly. A person may have trouble paying attention, feel disoriented, or even see or hear things that aren’t really there (hallucinations). The most common symptoms of delirium include: Sudden confusion that starts within hours or days Trouble focusing, listening, or understanding information Seeming uninterested in what’s happening around them, almost \"zoned out\" Difficulty thinking clearly or remembering things Feeling very sleepy or lacking energy (lethargy) Not knowing where they are or what time it is (disorientation) Being extra sensitive to bright lights or loud noises Senses feeling \"off,\" like sounds or sights seeming strange (distorted perception) Hallucinations, such as feeling bugs on their skin or thinking objects are moving when they aren’t Strongly believing things that aren’t true (delusions), like thinking doctors or family members are trying to harm them Sudden mood changes, such as feeling extremely happy (euphoria), very nervous (anxiety), or restless and upset (agitation) Delirium symptoms usually come on suddenly and may come and go over the course of a day. It often happens while a person is in the hospital for another health issue, and health care providers or family members are often the first to notice the changes. How Common Is Delirium? Delirium tends to be common among older adults, especially in hospital settings. By some estimates, up to 30% of older hospitalized people experience delirium. What Causes It? While researchers aren't sure of the exact cause of delirium, it often happens when a person is already sick or recovering from a major illness or surgery. Scientists believe it may be linked to changes in brain chemistry, particularly a drop in acetylcholine, a chemical that helps with memory and attention. Other factors, like stress on the body, infections, or medication side effects, can also trigger delirium. People with these risk factors are more likely to develop delirium: Hospitalization, especially in the intensive care unit (ICU) Older age, particularly 80 and above Dehydration and malnutrition Dementia or Parkinson’s disease Infections, such as meningitis, sepsis, or urinary tract infections (UTIs) Organ failure, including kidney or liver failure Difficulty seeing or hearing, which can cause confusion Multiple medications, especially those with mental or emotional side effects Major surgery with anesthesia, such as open-heart surgery Hip fractures and other serious injuries Drug or alcohol intoxication or withdrawal, including delirium tremens Ventilator use or oxygen deprivation from lung disease, pneumonia, or opioid drugs Low blood sugar or other metabolic disorders Delirium is particularly common among people over 80. However, anyone can experience delirium, especially if they are using drugs or alcohol, have recently had surgery, or have a chronic or terminal illness. Types of Delirium There are three main types of delirium, which include: Hypoactive delirium: This is the most common type of delirium, but it can be hard to recognize. A person may seem very sleepy, move or speak slowly, and be unresponsive to others. Because it looks like exhaustion, providers and family members might mistake it for normal recovery after an illness or surgery. Hyperactive delirium: This type is easier to notice because the person may be restless, agitated, or aggressive. They might pace, have sudden mood swings, or refuse care because they believe something untrue (delusions). Some people also experience hallucinations, like seeing or hearing things that aren’t real. Mixed delirium: This involves symptoms of both hypoactive and hyperactive delirium. A person may switch between being extremely drowsy and being restless or agitated. The changes can happen quickly, making it unpredictable and harder to diagnose. COVID-related delirium may be considered a fourth type. It can be either hypoactive or hyperactive and is linked to severe COVID-19 cases. It often affects people on ventilators or those with low oxygen levels due to pneumonia or heart problems. The experience of being in the ICU and the illness itself can contribute to confusion and disorientation. What Is Delirium Tremens? Delirium tremens is a severe form of delirium caused by alcohol withdrawal. Symptoms typically appear within days of the last drink and can include confusion, tremors, mood swings, drowsiness, and dangerous changes in vital signs, like low blood pressure and fast heart rate. Delirium vs. Dementia Delirium and dementia can seem similar, but they are different conditions that require different care. Both can cause confusion, memory problems, agitation, and difficulty with speech, and some people may have both at the same time. Delirium may be an early warning sign of dementia, especially in older adults recovering from hospitalization. Some people who experience delirium go on to develop dementia, but delirium itself is a serious, temporary condition that needs urgent medical attention. The chart below highlights the key differences between delirium and dementia. Delirium Sudden onset; develops within hours or days Symptoms come and go; alert one moment, confused the next Can cause sudden changes in alertness Triggered by an underlying condition like infection, illness, surgery, or medications Often reversible with treatment Requires urgent medical attention May be an early sign of dementia Dementia Gradual onset; develops over months or years Symptoms persist and worsen over time Alertness is usually unaffected until later stages Caused by long-term brain disease Irreversible, but progression can sometimes be slowed Requires long-term care and management Increases risk of delirium, especially during hospitalization Diagnosis If you are experiencing signs of delirium, a healthcare provider can often make a diagnosis using close observation and simple tests to assess your awareness, thinking, and attention. For example, they may ask you to do some basic math, describe your surroundings, or spell a word. However, if the cause of delirium isn’t clear, a healthcare provider may order tests to identify underlying conditions that could be triggering delirium or similar symptoms. Tests may include: Urine and blood tests: These tests can check for infection, metabolic imbalances, liver function, and signs of drug intoxication. Electroencephalogram (EEG): This test records electrical activity in the brain. It can help detect seizure disorders, which can cause symptoms similar to delirium. Imaging tests: Imaging tests like a brain CT or MRI are usually not needed, but they can help detect signs of a minor stroke or brain inflammation, which may cause symptoms similar to delirium. Since many conditions share similar symptoms, the sudden onset of delirium helps distinguish it from other disorders that develop more gradually. Can Delirium Be Misdiagnosed? Some estimates suggest that up to two-thirds of cases of delirium in hospital settings are missed or misdiagnosed. Signs of delirium may sometimes be confused with symptoms of dementia, depression, or fatigue. How to Treat Delirium There is no single medication to cure delirium. Instead, treatment focuses on addressing the underlying cause and providing supportive care to ease symptoms. Approaches to treating delirium include: Treating the underlying cause: Fixing dehydration, infections, or medication side effects can often stop delirium. Creating a calm, familiar environment: Removing unnecessary medical equipment, adjusting lighting, and offering reassurance can reduce confusion and fear. Encouraging movement: Physical and occupational therapy help with mobility, prevent complications, and improve thinking skills. Supporting sleep and wake cycles: Keeping the room quiet and dark at night and using natural light during the day can improve sleep. Making sure they can see and hear well: Glasses and hearing aids help people stay aware of their surroundings. Keeping loved ones involved: Family and friends can provide comfort, help with orientation, and reduce agitation. Adjusting medications if needed: Healthcare providers may stop or change medications that worsen delirium. In severe cases, they may use short-term sedatives or antipsychotics to manage distressing hallucinations. Antipsychotic medication needs to be used cautiously when treating delirium, especially for people with dementia, because of possible side effects. Outlook and Prognosis Delirium is often short-lived and temporary. Symptoms of delirium usually appear over the course of a few hours or days. After the underlying cause is treated, delirium usually goes away within a few days or weeks. If not prevented or treated, delirium is associated with several health complications and other negative outcomes. The complications of delirium may include: Infections Skin problems, such as pressure sores Cognitive decline, including dementia Extended hospital stay Need for long-term institutional care Higher medical costs Lowered quality of life Emotional distress, both for the person and their loved ones Higher risk of death, both in the short-term and long-term If you or your loved one may have delirium, it’s important to assess and treat it right away to avoid future complications. When to See a Healthcare Provider If you notice any signs of delirium in yourself or a loved one, seek immediate medical care. Stay with the person until help has arrived, and make a note of what medications they’re taking, if possible. Reassure them that you’re by their side and help them stay relaxed. When you or your loved one is discharged from the hospital, talk to your healthcare provider about follow-up care and develop a plan to avoid delirium at home. Make sure that you know about any possible side effects of prescribed medicines. Summary Delirium is a sudden change in mental state that causes confusion, disorientation, memory problems, and trouble focusing. It can also involve fluctuating alertness, hallucinations, and changes in speech or movement. Delirium is most common in hospitalized older adults, especially in the ICU. It can result from severe illness, infection, alcohol withdrawal, dehydration, or recent surgery. Treatment focuses on addressing the underlying cause and creating a safe, calming environment, with medication used in severe cases. Read more: Health A-Z Brain & Nervous System Neurological Symptoms & Diagnosis 8 Sources Verywell Health uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. Johns Hopkins Medicine. Delirium. Johansson YA, Bergh I, Ericsson I, Sarenmalm EK. Delirium in older hospitalized patients-signs and actions: a retrospective patient record review. BMC Geriatr. 2018;18(1):43. doi:10.1186/s12877-018-0731-5 Royal College of Psychiatrists. Delirium. American Addiction Centers. Delirium tremens: symptoms, timeline & treatment. American Geriatrics Society. Delirium diagnosis and tests. American Geriatrics Society. Delirium care and treatment. Alzheimer's Society. Delirium. Grover S, Avasthi A. Clinical practice guidelines for management of delirium in elderly. Indian J Psychiatry. 2018;60(Suppl 3):S329-S340. doi:10.4103/0019-5545.224473 By Laura Dorwart Dr. Dorwart has a Ph.D. from UC San Diego and is a health journalist interested in mental health, pregnancy, and disability rights. See Our Editorial Process Meet Our Medical Expert Board Share Feedback Was this page helpful? Thanks for your feedback! What is your feedback? Helpful Report an Error Other Submit"
}