{
  "url": "https://icriforum.org/iucn-red-list-coralreef/",
  "title": "Over 40% of coral species face extinction – IUCN Red List | ICRI",
  "text": "Forty-four per cent of reef-building coral species globally are at risk of extinction, the IUCN Red List of Threatened Species(TM) reveals following a global assessment announced today at the ongoing COP29 UN climate conference in Azerbaijan. The conservation status of 892 warm-water reef-building coral species has now been reassessed for the IUCN Red List, and analysis shows that 44% are threatened. The threats to reef-building corals were last assessed for the IUCN Red List in 2008, and at that time one third were found to be threatened. “As world leaders gather at the UN climate conference in Baku, this global coral assessment vividly illustrates the severe impacts of our rapidly changing climate on life on Earth and drives home the severity of the consequences,” said IUCN Director General Dr Grethel Aguilar. “Healthy ecosystems like coral reefs are essential for human livelihoods—providing food, stabilising coastlines, and storing carbon. The protection of our biodiversity is not only vital for our well-being but crucial for our survival. Climate change remains the leading threat to reef-building corals and is devastating the natural systems we depend on. We must take bold, decisive action to cut greenhouse gas emissions if we are to secure a sustainable future for humanity.” Climate change is the main threat to reef-building coral species. The assessments considered the most recent status update of coral reefs from the Global Coral Reef Monitoring Network (GCRMN), alongside current and future threats, such as the projected increase in warming events and major bleaching events, using Intergovernmental Panel on Climate Change (IPCC) data for future warming scenarios. In addition to climate change and related severe bleaching events, corals are affected by other pervasive threats including pollution, agricultural runoff, disease and unsustainable fishing. For example, Staghorn coral (Acropora cervicornis) and Elkhorn coral (Acropora palmata) are two Critically Endangered species in the Caribbean that have experienced significant declines due to increased warming, water pollution, hurricanes and the severe impacts of coral diseases. “We need to drastically cut greenhouse gas emissions alongside action to address local threats if we want to give coral reefs a chance to survive,” said Beth Polidoro, IUCN Species Survival Commission Coral Red List Authority Coordinator and Associate Professor, School of Mathematical and Natural Sciences at Arizona State University. “By acting now, we can slow the pace of ocean warming and broaden the window of opportunity for corals to potentially adapt and survive in the long term. This is not just about preserving the spectacular beauty of coral reefs. Coral ecosystems also sustain coastal fishing communities, stabilise the shoreline and coastal habitats, and help remove carbon from the ocean, among other benefits.” The main solution to save corals from extinction is cutting greenhouse gas emissions, accompanied by actions to address other threats, to strengthen species’ resilience. The assessors also recommend more research into if and how corals can adapt to warmer waters, with evidence of limited adaptation so far. “We’ve known for decades that coral reefs are on the frontline of the global climate and biodiversity crises, and this new result only reconfirms this. Without relevant decisions from those with the power to change this trajectory, we will see the further loss of reefs, and progressive disappearance of coral species at larger and larger scales,” said Dr David Obura, Co-Chair of the IUCN SSC Coral Specialist Group. The majority of corals are found across the Indo-Pacific. The global assessment of reef- building corals includes 85 Atlantic coral species highlighted in a PLOS One journal article also published today. Atlantic coral species are particularly highly threatened due to annual severe bleaching events, pollution and the impacts of disease. Today’s global assessment covers all reef-building corals, which are found in shallow, warm water habitats and form the colourful reefs seen in tropical and sub-tropical ocean areas. Red List assessments of cold-water corals, which are found in colder, deeper waters around the world and do not depend on sunlight, are ongoing. Twenty-two species of cold-water coral out of a total of over 4,000 have been assessed so far. The main threats to these species include fishing activity, especially bottom trawling, deep sea mining, drilling for oil and gas, or laying of deep-sea cables. One example of a threatened deep-water coral is the White coral (Desmophyllum pertusum), which was assessed as Vulnerable. Future ocean acidification and warming oceans due to climate change are also a threat. “Marine species face threats from climate change and human activities, but the impact is sometimes hidden from view; the state of corals highlights this, and also shows how important it is to expand the Red List to include more ocean species,” said Professor Julia Sigwart, Head of Malacology at Senckenberg Research Institute and Museum, a Red List Partner. Built over tens of thousands of years, coral reefs are the most biodiverse of marine ecosystems. Climate change causes rising water temperatures and more intense solar radiation, which lead to coral bleaching and disease often resulting in mass coral mortality. Reef-building corals have a symbiotic relationship with algae called zooxanthellae, which give corals their vivid colours. Coral bleaching is the result of a stress response to increased water temperatures, whereby the algae are expelled from the tissues. Supporting Quotes “This Global Coral Assessment raises the alarm for urgent collective action to stop the decline of coral reefs worldwide. The MSC Foundation is proud to partner with the IUCN Coral Red List team, who have done an exceptional job collecting the most reliable data to assess and report on the status of the world’s reef-building corals,” said Daniela Picco, Executive Director of the MSC Foundation. “The IUCN Red List guides our Foundation in making science-based philanthropic decisions, for lasting and impactful conservation efforts that contribute to preserving our blue planet. It will continue to be a vital resource for our family-led foundation for generations.” “The latest global assessment brings troubling news for corals with more than 340 species now being considered at risk of extinction. Much work remains to be done to secure the future of these species and the vital reefs they form. An ocean without functioning coral reefs would be a bleak reality, highlighting the urgent need to find solutions to the climate crisis while simultaneously addressing today’s coral crisis,” said Professor David Smith, MSC Foundation Chief Science Advisor. “The IUCN report highlights two key coral species that have been central to our collaborative research focused on identifying resilient coral genotypes enhancing the efficiency—and, by extension, the success—of restoration efforts designed to rebuild critical coral ecosystems.” ICRI member the MSC Foundation provided support that made this Global Coral Assessment possible. Funding was also provided by National Geographic and Eurofins, and co-funding from the partners – CORDIO East Africa, Arizona State University, ZSL among others. The Global Coral Assessment was led by the IUCN SSC Coral Specialist Group, working with fellow Red List Partners including ICRI member Arizona State University and Senckenberg, as well as the Marine Biodiversity Assessment Unit at Old Dominion University and ICRI member Cordio East Africa. Over 160 experts from around the world have been involved in the Global Coral Assessment over the past decade. Source: Press release. This article is commenting on the global assessment published on the IUCN Red List of Threatened Species."
}