{
  "url": "https://support.microsoft.com/en-us/surface/surface-pro-7-features-and-specs-b21cbd38-6f47-42da-bbd2-c75ca02ea17a",
  "title": "Surface Pro 7+ features and specs - Microsoft Support",
  "text": "Surface Pro 7+ features and specs Applies To Discover the latest Surface Pro Get tablet-to-laptop flexibility in one powerful PC. With AI-accelerated Copilot+ PC experiences and all-day battery life, Surface Pro is built to keep you on the go. Get to know Surface Pro 7+ Surface Pro 7+ for Business is faster than ever and has improved battery life to help you get your work done. - Volume - Power button - Headset jack - Windows Hello facial-recognition camera - Front-facing camera - Studio Mics - USB-C port - USB-A port - Surface Connect port - SIM card tray (LTE Advanced models) or microSD card slot (Wi-Fi only models) - SSD door Surface Pro 7+ and Windows 10 Surface Pro 7+ comes with Windows 10 Pro edition (commercial customers). Not sure which version of Windows you have? See Which version of Windows operating system am I running? Note: You can upgrade your Surface Pro 7+ to Windows 11. For more info, see Windows 11 System Requirements. Charging your Surface You can charge your Surface using USB-C or Surface Connect. For more information, see How to charge Surface. Surface Pro 7+ with LTE Advanced Some models of Surface Pro 7+ support an LTE connection. To check if your Surface Pro 7+ supports a SIM card, here's what to do: - Place the screen of your Surface Pro 7+ on a table, then lift the kickstand. - On the left side of the Surface near the hinge, you'll see one of the following: - SIM tray The tray is inserted into the device and requires the SIM ejector tool to remove. - microSD card slot An exposed slot where you can slide a microSD card and click it into place. - Make it your own Learn more about the optional accessories that work with your Surface Pro 7+. Get the most out of your Surface Learn more about your Surface and customize it with the Surface app. To open it, select Start , enter Surface, and select it to open the app. If the app doesn't open, get it from the Microsoft Store. A more repairable device design Many components can be replaced by authorized service providers or skilled technicians — supporting a more repairable device design. Replacement components are available for out-of-warranty repair. Availability and service options may vary by product, market, and over time. To learn more, see Self-repair information for your Surface device. Surface Pro 7+ Technical specs * Sold separately. Surface Storage for more details. [2] Battery life varies significantly based on usage, network and feature configuration, signal strength, settings and other factors. See Surface Battery Performance for details. [1] System software and updates use significant storage space. Available storage is subject to change based on system software and updates and apps usage. 1 GB = 1 billion bytes. 1 TB = 1,000 GB. See- Surface Pro 7+ battery life: Up to 15 hours of battery life based on typical Surface device usage. Testing conducted by Microsoft in November 2020 (Surface Pro 7+ with Intel 11th Gen Intel® Core™ i5-1135G7 @ 2.40GHz , 256GB SSD, 8GB DRAM) using preproduction software and preproduction configurations of Surface Pro 7+. Testing consisted of full battery discharge with a mixture of active use and modern standby. The active use portion consists of (1) a web browsing test accessing 8 popular websites over multiple open tabs, (2) a productivity test utilizing Microsoft Word, PowerPoint, Excel and Outlook, and (3) a portion of time with the device in use with idle applications. Tested with Windows Version 10.0.19041.1(20H1) and Edge version 85.0.564.51. All settings were default except screen brightness was set to 150nits with Auto-Brightness disabled. Wi-Fi was connected to a network. Battery life varies significantly with settings, usage and other factors. - LTE battery life: Up to 13.5 hours of battery life based on typical Surface device usage. Testing conducted by Microsoft in November 2020 (Surface Pro 7+ with Intel 11th Gen Intel® Core™ i5-1135G7 @ 2.40GHz , 256GB SSD, 8GB DRAM) using preproduction software and preproduction configurations of Surface Pro 7+. Testing consisted of full battery discharge with a mixture of active use and modern standby. The active use portion consists of (1) a web browsing test accessing 8 popular websites over multiple open tabs, (2) a productivity test utilizing Microsoft Word, PowerPoint, Excel and Outlook, and (3) a portion of time with the device in use with idle applications. All settings were default except screen brightness was set to 150nits with Auto-Brightness disabled. LTE enabled and device connected to LTE Network. Wi-Fi and Bluetooth in battery mode. Battery life varies significantly with settings, usage and other factors. [3] Compatible with the Surface Pro Type Cover and Surface Pro Signature Type Cover only (sold separately).Eco profile. [9] For more information on EPEAT registration in other markets see the Eco profile. [4] Microsoft’s Limited Warranty is in addition to your consumer law rights. [5] Weight not including Type Cover. [7] Subscription required (sold separately). [8] Download the full"
}