{
  "url": "https://support.google.com/families/answer/7101025?hl=es-419",
  "title": "Cómo comenzar a usar Family Link - Ayuda de Google For Families",
  "text": "Puedes usar la app de Family Link para crearle una Cuenta de Google a tu hijo menor de 13 años (o la edad correspondiente en tu país). También puedes usar la app para agregar supervisión a una Cuenta de Google que él ya tenga. Importante: - Es posible que Family Link no esté disponible en todos los países o regiones. - Los iPhones, los iPads y las computadoras que no sean Chromebooks no se pueden supervisar con Family Link. - Las cuentas de Google Workspace for Education no se pueden administrar con Family Link. - La configuración de las aprobaciones de compras de Family Link solo se aplica a las compras realizadas a través del sistema de facturación de Google Play. Como padre o madre, puedes usar Family Link para hacer cosas como estas: - Cambiar algunos de los parámetros de configuración de la Cuenta de Google de tu hijo o hija - Administrar las apps de tu hijo o hija en dispositivos supervisados: Decide qué apps puede descargar o comprar, bloquea o permite apps y cámbiales los permisos - Administrar el tiempo de uso de tu hijo o hija en dispositivos supervisados: Establece una hora de dormir o límites de uso diario y consulta cuánto tiempo usa determinadas apps - Consultar la ubicación del dispositivo Android o Fitbit compatible de tu hijo o hija - Restringir el contenido para mayores de edad en Google Play Requisitos Cómo administrar la Cuenta de Google de tu hijo- Tener una Cuenta de Google (si no la tienes, puedes crearla sin cargo) - Ser mayor de 18 de años (o la edad correspondiente en tu país) - Un dispositivo Android (6.0 o superior), un iPhone o iPad (iOS 16 o superior) o una Chromebook que admita apps para Android para descargar la app de Family Link. También puedes administrar algunos parámetros de configuración en familylink.google.com - Vivir en el mismo país que tu hijo o hija Cómo configurar las funciones clave Cómo configurar límites de tiempo diarios por primera vez - Abre la app de Family Link . - En la esquina superior izquierda, selecciona a tu hijo o hija. - En la parte inferior izquierda, presiona Tiempo de uso Límites de tiempo. - Activa Límite diario. - Presiona Programa semanal. - Para la primera configuración, presiona Editar cada día. - Selecciona un día. - Ingresa a cuánto tiempo de uso se limita el dispositivo. - Para aplicar límites a todos los días de la semana, presiona Aplicar a todos los días de la semana Listo. Cómo cambiar el límite del día con el dispositivo de la madre o el padre Para ir a la configuración de la cuenta de tu hijo o hija que visitaste la última vez en la app de Family Link, presiona el siguiente botón: Cambiar los límites diariosCómo editar la programación del límite semanal con el dispositivo de la madre o el padre - En tu dispositivo, abre Family Link . - En la esquina superior izquierda, selecciona a tu hijo o hija. - En la parte inferior izquierda, presiona Tiempo de uso Límites de tiempo Programa semanal. - Para la primera configuración, presiona Editar cada día. - Selecciona un día. - Ingresa a cuánto tiempo de uso se limita el dispositivo. - Para aplicar límites a todos los días de la semana, presiona Aplicar a todos los días de la semana Listo. Cómo darle tiempo extra a tu hijo o hija Puedes permitir que tu hijo o hija pase más tiempo en su dispositivo durante el día sin cambiar el límite diario, el horario escolar ni el tiempo de descanso. Puedes agregar tiempo extra cuando el dispositivo Android de tu hijo o hija esté bloqueado o poco antes de que se bloquee. - Abre la app de Family Link . - En la esquina superior izquierda, selecciona a tu hijo o hija. - En la parte inferior izquierda, presiona Tiempo de uso . - Debajo del nombre del dispositivo de tu hijo o hija, presiona Tiempo extra . - Establece la cantidad de tiempo extra. - Para aumentar el tiempo extra, selecciona . - Para disminuir el tiempo extra, selecciona . - Para establecer una hora específica, presiona el número. - Presiona Listo. Con el dispositivo de tu hijo - En el dispositivo de tu hijo, abre Configuración . - En Android 8.1 (O) y versiones posteriores, presiona Bienestar digital y controles parentales. - En otras versiones de Android, presiona Google Controles parentales. - Para ver la configuración actual, presiona Límite diario. - Para editar la configuración de Límite diario, accede o usa tu código de acceso para padres a fin de verificar que eres el padre o la madre. Para ir a la configuración de la cuenta de tu hijo o hija que visitaste por última vez en la app de Family Link, presiona el siguiente botón: Bloquea o desbloquea una app en Family LinkLa app se bloqueará o desbloqueará en unos 5 minutos o cuando el dispositivo esté conectado a Internet. Si tu hijo o hija está usando la app en el momento en que la bloqueas, recibirá una advertencia de que le queda un minuto para terminar lo que esté haciendo antes de que se bloquee la app. La app se bloquea en todos los dispositivos Android o Chromebooks de tu hijo o hija. - Abre la app de Family Link . - Selecciona a tu hijo o hija. - En la parte inferior izquierda, presiona Tiempo de uso Límites de tiempo Límites para apps. - Revisa la lista de apps. Las apps bloqueadas se marcan como Bloqueadas . Las apps permitidas no tienen este ícono. - Sigue estos pasos para bloquear o permitir una app. - Para bloquear una app, haz lo siguiente: - Selecciona la app. - Presiona el botón de activación Permitida. - El estado de la app cambiará a Bloqueada . - Presiona Listo. - Para permitir una app, haz lo siguiente: - Selecciona la app. - Presiona el botón de activación Bloqueada. - El estado de la app cambiará a Permitida . - Presiona Listo. - Para bloquear una app, haz lo siguiente: Para ir a la configuración de la cuenta de tu hijo o hija que visitaste la última vez en la app de Family Link, presiona el siguiente botón: Cómo encontrar la ubicación de tu hijo o hijaSi eres madre o padre, puedes encontrar la ubicación del dispositivo Android de tu hijo o hija en la app de Family Link. - Abre la app de Family Link . - Presiona Ubicación. - Presiona Configurar ubicación. - Si tienes varios hijos o hijas, selecciona para cuáles quieres activar el uso compartido de la ubicación. - Presiona Activar. - Abre la app de Family Link . - Para cambiar de miembro de la familia, desliza el dedo en la esquina superior izquierda."
}