{
  "url": "https://www.flyertalk.com/forum/british-airways-british-airways-club/2138775-changing-frequent-flyer-numbers-after-booking.html",
  "title": "Changing Frequent Flyer Numbers after Booking - FlyerTalk Forums",
  "text": "Changing Frequent Flyer Numbers after Booking #1 Original Poster Join Date: Aug 2010 Location: London Programs: BA Silver, Sky Team Silver, Star Alliance Silver Posts: 160 Changing Frequent Flyer Numbers after Booking I have eight active bookings currently on British Airways, and have recently been informed that I will be transferred to the United States in July 2024. I have an American Airlines AAdvantage number, and would like to switch my current bookings (all of which were done on the BA website) to American Airlines. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. #2 FlyerTalk Evangelist Join Date: Dec 2003 Location: Not here; there! Programs: AA Lifetime Gold Posts: 34,560 I have eight active bookings currently on British Airways, and have recently been informed that I will be transferred to the United States in July 2024. I have an American Airlines AAdvantage number, and would like to switch my current bookings (all of which were done on the BA website) to American Airlines. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. What would your intended redemptions be from the U.S.? There are still some decent redemptions available with Avios on AA and AS nonstops within the Americas. And it might be easier for you to obtain/retain status with BAEC than AAdvantage -- depending on your flying patterns. Last edited by guv1976; Oct 18, 2023 at 4:05 pm #3 Join Date: Apr 2012 Location: STL Programs: AA Lifetime Platinum Posts: 594 Call BA or use the chat feature and ask them to change it. But remember that Avios can be very useful in the US for internal flights on AA and Alaska, and One World partners internationally. I find it very useful to have a stash of Avios and AA miles because sometimes there are better options with one over another. With that said as a US resident there are more opportunities to acquire BA miles than AA miles (after you have exhausted the Citi and Barclays credit card bonuses). Also as a BA silver/One World Sapphire (or higher) I think you get access to domestic AA lounges which you won’t if you qualify for One World Sapphire via AA. #4 Original Poster Join Date: Aug 2010 Location: London Programs: BA Silver, Sky Team Silver, Star Alliance Silver Posts: 160 It is possible, by using the \"Manage My Booking\" function at finnair.com -- or some other oneworld carrier websites -- to remove your BAEC number from all the bookings. Some people have then successfully added their AAdvantage numbers at the same site; others have just left the site after removing the BAEC number, and then gone to ba.com, pulled up the bookings (now devoid of any FFN), and added the AAdvantage number. #5 Join Date: Oct 2014 Location: Krakow Programs: BAEC Silver, Miles and More(FTL), IHG(Platinum), Accor, HHonors(Diamond), SPG, Hertz Five Star Posts: 9,102 I have eight active bookings currently on British Airways, and have recently been informed that I will be transferred to the United States in July 2024. I have an American Airlines AAdvantage number, and would like to switch my current bookings (all of which were done on the BA website) to American Airlines. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. I see no way to do this online.... or is there a way? Avios will be of little use to me a year from now. Thanks for any advice. #6 Join Date: May 2004 Location: London, UK Programs: The glamorous days of \"status\" are gone. Thanks, British Airways. Posts: 277 Depending upon your status and travel habits, this is a big point. OneWorld Sapphire with British Airways gets you access to AA lounges for all flights, including domestic U.S. ones. OneWorld Sapphire on American Airlines does not get you lounge access for domestic U.S. or other North America (Canada, Mexico, Bahamas, Bermuda, Caribbean) flights, only other international flights (Europe, Asia, South America). #7 Join Date: Sep 2002 Location: Thousand Oaks, Ca., USA Programs: AA Lifetime Plat; Bonvoy Titanium Lifetime Elite;Hyatt Globalist; HHonors Diamond; United Silver Posts: 9,822 Can I do this on a BA award booking out of my account? With my AA #, I\"m one world saphire. I tried adding myself to the friends and family list with my AA number, and it's on the list but won't appear on the drop down list of names With my AA #, I\"m one world saphire. I tried adding myself to the friends and family list with my AA number, and it's on the list but won't appear on the drop down list of names #8 Join Date: Feb 2006 Posts: 31 Thank you so much for this post! I was able to add my AA frequent flyer information on a BA awards flight on American. Finnair website allowed me to keep BA number and add AA additionally. Now my flight shows up when logging in on AA site and I'm hoping my luggage benefit with AA credit cards will also work. I was able to add my AA frequent flyer information on a BA awards flight on American. Finnair website allowed me to keep BA number and add AA additionally. Now my flight shows up when logging in on AA site and I'm hoping my luggage benefit with AA credit cards will also work. #9 Join Date: Sep 2006 Programs: AA Exec Plat, BA EC Blue, UA Premier, HH Diamond VIP, Hyatt Platinum Posts: 58 It Worked! Amazing! Going through Finnair for my BA booking to add an AA AAdvantage number WORKED! Truly incredible (and insane) that this is a work-around for BAs crappy website. Thank God for OneWorld! #10 Join Date: Jan 2005 Location: UK Programs: Mucci. And BA Silver previous awards - Gold 13, Silver 7, Bronze 4. Posts: 7,531 It is not just their website! I sometimes wonder how BA manages to run the airline at all with the rubbish IT capabilities they have. #11 Join Date: Feb 2009 Location: US Programs: Hyatt Globalist, Marriott Titanium, Hilton Diamond Posts: 25 Has anyone tried to use a BA PNR on Finnair or Qatar websites to manage booking recently? I have a BA award I booked a week ago that I still can't get into from either of those websites. Works to manage booking with a couple of other Oneworld partners, like Cathay and Royal Jordanian. But can't change FF numbers from those sites. #13 Join Date: Oct 2014 Location: UK Programs: Mucci Diamond Hairbrush Elite, BAC silver. EBG, AF Blue Posts: 4,882 I gave up a couple of weeks ago trying to add my LATAM number to a BA PNR via Finnair and Royal Jordanian (which worked before). So I ended up ringing LATAM to add my number. If you have an AA number or something I am sure you can also ring them to get it added if you can't manage it online. #14 Join Date: Oct 2017 Location: Cornwall Posts: 322 Has anyone tried to use a BA PNR on Finnair or Qatar websites to manage booking recently? I have a BA award I booked a week ago that I still can't get into from either of those websites. Works to manage booking with a couple of other Oneworld partners, like Cathay and Royal Jordanian. But can't change FF numbers from those sites. #15 Join Date: Feb 2009 Location: US Programs: Hyatt Globalist, Marriott Titanium, Hilton Diamond Posts: 25"
}