{
  "url": "https://www.liveeatlearn.com/list-of-vegetables/",
  "title": "List of Vegetables: 240 Vegetables From A to Z | Live Eat Learn",
  "text": "This post contains affiliate links. From asparagus to zucchini, we’re covering the most popular types of veggies from A to Z in this helpful list of vegetables! There are numerous types of vegetables, each with its own unique use and health properties. Explore them all in this comprehensive guide! Hey there, veggie aficionados and curious foodies! Get ready to take a fun-filled stroll down veggie lane with our ultimate guide vegetables! We’re talking everything from the everyday heroes of your salad bowl to the quirky characters you might not have met yet. Whether you’re a broccoli enthusiast or a curious cauliflower connoisseur, this veggie extravaganza will have you exploring the colorful and flavorful world of plant-based goodness. Resident Foodie I’m Sarah, a nutritionist and food scientist obsessed with veggies! I’ve developed thousands of veggie recipes over the years, and have come up with list slowly over time, so I thought I’d share it for you to browse! Table of Contents What Is A Vegetable? Botanically speaking, a vegetable is anything that is not a reproductive part of a plant-derived from a flower. Our list from A to Z does contain many botanically classified fruits (looking at you, avocado and zucchini). What other vegetables are are technically fruits? Tomatoes, squash, pumpkins, eggplant, cucumbers, peppers, to name a few. But for the context of this article, we’re including any “veggie” that would be used like a veggie. Types Of Vegetables These categories are not exhaustive, and some vegetables might fit into multiple classifications. - Root Vegetables: These are plants whose edible parts grow underground. Examples include carrots, potatoes, beets, radishes, and turnips. - Leafy Greens: Leafy vegetables are known for their tender leaves and high nutrient content. Spinach, kale, lettuce, and Swiss chard fall into this category. - Cruciferous Vegetables: These vegetables belong to the Brassicaceae family and are known for their cross-shaped flowers. Broccoli, cauliflower, Brussels sprouts, and cabbage are cruciferous veggies. - Allium Vegetables: Alliums have a distinctive aroma and include garlic, onions, leeks, and shallots. - Podded Vegetables: These are vegetables enclosed in a pod or shell. Examples are peas, beans, and lentils. - Stem Vegetables: Stem vegetables are plants whose edible parts are stems or stalks. Asparagus and celery are common examples. List of Veggies From A to Z Here is our A-Z list of vegetables. We haven’t included every vegetable on the planet (that would be a huge list), but this is enough to give you some delicious and healthy inspiration! A - Acorn Squash - Alfalfa Sprouts - All Blue Potato - Amaranth - Ambercup Squash - Anise - Artichoke - Arugula - Ash Gourd - Asparagus - Avocado - Adzuki Bean - Ahipa - Aonori - Arame - Arikara Squash - Arrowroot - Asian Greens - Ash Gourd - Azuki Bean B - Baby Boo Pumpkin - Bamboo Shoot - Banana Pepper - Banana Squash - Basil - Bean Sprout - Beet - Belgian Endive - Bell Pepper - Bintje Potato - Bitter Melon - Black Bean - Black-Eyed Pea - Black Radish - Black Salsify - Bok Choy - Boniato - Borage - Borlotti Bean - Boston Morrow Squash - Broad Beans - Broad-Leaf Arrowhead - Broccoflower - Broccoli - Broccolini - Brussels Sprout - Burdock Root - Butterhead Lettuce - Butter Bean - Butternut Squash C - Cabbage - Cannellini Bean - Caraway - Carnival Squash - Carrot - Cauliflower - Cayenne Pepper - Celeriac - Celery - Chamomile - Chard - Cheddar Cauliflower - Cherry Pepper - Chickpeas - Chili Pepper - Chives - Collard Greens - Coriander - Corms - Corn - Cucumber - Cymbopogon D - Daikon - Delicata - Dickinson Pumpkin - Dill E - Eddoe - Eggplant - Endive F We also published the comprehensive to guide Vegetables That Start With F where we provide photos, recipes, origins, and more on all of these. - Fat Hen - Fava Bean - Fayot Bean - Fennel - Fiddlehead - Field Cucumber - Fiorentino Tomato - Flat Beans - Flat Italian Onion - Flat White Boer Pumpkin - Flint Corn - Fluted Pumpkin - French Bean - French Sorrel - Frisée - Futsu Squash G - Garlic - Gem Squash - German Butterball Potato - Gigante Bean - Ginger - Gold rush Squash - Great Northern Bean - Green Bean H - Habanero Pepper - Honey Bear Squash - Honeynut Squash - Hot Pepper - Hubbard Squash J - Jalapeño - Japanese Sweet Potato - Jerusalem Artichoke - Jicama K - Kale - Kelp - Kidney Bean - Kohlrabi - Konjac L - Lavender - Leek - Lentil - Lettuce - Lima bean - Lumina Pumpkin M - Malanga - Mallow - Mangelwurzel - Mangetout - Marjoram - Miner’s Lettuce - Molokhia - Morels - Mung Bean - Mushroom - Mustard Greens N - Navy Bean - Nettle - New Potato - New Zealand Spinach O - Oak Leaf Lettuce - Okra - Onion - Orange Bell Pepper - Orange Tomato - Oregano P - Paprika - Parsnip - Pattypan Squash - Pea - Peanut - Pepper - Peruvian Purple Potato - Pie Pumpkin - Pinto Bean - Potato - Purple Asparagus - Purple Bell Pepper - Purple Brussels Sprout - Purple Cabbage - Purple Carrot - Purple Cauliflower - Purple Corn - Purple Kale - Purple Lettuce - Purple Majesty Potato - Purple Radish - Purple String Bean - Purple Tomato R - Radicchio - Radish - Red Bell Pepper - Red Bliss Potato - Red Cabbage - Red Carrot - Red Gold Potato - Red Kuri Squash - Red Onion - Red Russian Kale - Red Warty Thing Squash - Red Wing Onion - Rhubarb - Rosemary - Runner Bean - Russian Banana Potato - Rutabaga S - Salsify - Savoy Cabbage - Scallion - Shallot - Skirret - Snap Pea - Soybean - Spaghetti Squash - Spinach - Split Pea - Squash - Stokes Purple Sweet Potato - Sweet Corn - Sweet Potato T - Tabasco Pepper - Taro - Tat Soi - Thyme - Tomatillo - Tomato - Topinambur - Torpedo Onion - Turnip U - Ube - Udupi Mattu Gulla Eggplant. - Ulluco - Upland Cress - Urad Bean V - Velvet Bean - Vidalia Onion - Vivaldi Potato - Vitelotte Potato W - Wasabi - Water Chestnut - Watercress - Wax Bean - White 7 Pot Pepper - White Asparagus - White Bell Pepper - White Corn X - Xi Lan Hua - Xi Yang Ca - Xà Lách - Xanthosoma Sagittifolium - Xanthosoma Brasiliense Y - Yam - Yellow Onion - Yellow Summer Squash - Yellow Tomato - Yukon Gold Potato Z - Zephyr Squash - Zucchini Vegetables By Color Eat the colors of the rainbow with these lists of veggies organized by color. Red Vegetable List Need some red veggie ideas for a 4th of July or Christmas veggie tray? Look no further. We provide a lot more information and photos of these in our Comprehensive Guide to Red Vegetables. - Amaranth - Beet - Red Carrot - Cayenne Pepper - Cherry Pepper - Kidney Bean - Oak Leaf Lettuce - Radicchio - Radish - Red Bell Pepper - Red Bliss Potato - Red Cabbage - Red Gold Potato - Red Russian Kale - Red Kuri Squash - Red Onions - Red Warty Thing Squash - Rhubarb - Tomato Orange Vegetable List If you are planning a Halloween Veggie Tray or just want to add a splay of color to your culinary presentation, orange veggies are a great option. If you want to know more about each of these orange veggies, check out our Comprehensive Guide to Orange Vegetables. - Ambercup Squash - Carrot - Cheddar Cauliflower - Habanero Pepper - Honey Bear Squash - Hubbard Squash - Honeynut Squash - Jack-O-Lantern Pumpkin - Orange Bell Pepper - Orange Tomato - Pie Pumpkins - Red Kuri Squash - Sweet Potato - Yam Yellow Vegetable List Looking to add a splash of yellow to your cooking or veggie tray? We have you covered, and if you want to know more about all of these, or perhaps looking for a recipe for some of the most popular, we have that too. Go to Yellow Vegetables. - Acorn Squash - Banana Pepper - Banana Squash - Bell Pepper - Bintje Potato - Butternut Squash - Corn - Dickinson Pumpkin - Frisee - German Butterball Potato - Gold Rush Squash - Japanese Sweet Potato - Kennebec Potato - Pattypan Squash - Yellow Tomato - Russian Banana Potato - Spaghetti Squash - Wax Bean - Yellow Onion - Yellow Summer Squash - Yukon Gold Potato - Zephyr Squash Purple Vegetable List Can’t get your kids to eat their veggies? Try adding a touch of Purple, and if you want to know a lot more (or want a photo of each) go to our Purple Vegetable Guide. - All Blue Potato - Eggplant - Hubbard Squash - Peruvian Purple Potato - Purple Asparagus - Purple Bell Pepper - Purple Brussels Sprout - Purple Cabbage - Purple Carrot - Purple Cauliflower - Purple Corn - Purple Kale - Purple Lettuce - Purple Majesty Potato - Purple Radish - Purple String Bean - Purple Tomato - Radicchio - Red Wing Onion - Stokes Purple Sweet Potato - Torpedo Onion - Turnip - Vitelotte Potato White Vegetable List Looking for a unique veggie for a 4th of July veggie tray, or just something different? Here is a good list of white veggies. For much more on each of these check out our Complete Guide to White Vegetables. - Baby Boo Pumpkin - Cannellini Bean - Carnival Squash - Cauliflower - Fayot Bean - Gigante Bean - Great Northern Bean - Kohlrabi - Lumina Pumpkin - Mushroom - Onion - Parsnip - Potato - Soybean - Turnip - White 7 Pot Pepper - White Asparagus - White Bell Pepper - White Corn Vegetables By Season Eating by season? These lists of veggies are organized by when each vegetable is in season. Spring Vegetable List If you are looking for vegetables that are at their best (and most available) in the Spring, peruse our list of the world’s favorite spring veggies. For recipes, photos, and origin of each go to our Spring Vegetable Guide. - Artichoke - Arugula - Asparagus - Avocado - Basil - Broccoli - Cabbage - Carrot - Chives - Collard Greens - Fava Bean - Garlic - Leeks - Mushroom - Parsley - Peas - Radish - Rhubarb - Spinach - Turnips - Watercress Summer Vegetable List Need some ideas for veggies at their peak in the summer? This list may help. For information on when they are at their peak, some of our favorite summer veggie recipes, and a bit more check out The Ultimate Guide to Summer Vegetables. - Avocado - Basil - Bell Pepper - Broccoli - Carrot - Celery - Corn - Cucumber - Eggplant - Snap Pea - Green Bean - Hot Pepper - Mushroom - New Potato - Okra - Radish - Rhubarb - Tomatillo - Tomato - Yellow Squash - Zucchini"
}