{
  "url": "https://www.maryvilleforum.com/obituaries/charles-charlie-eugene-bowen/article_ee7a0f2c-01b3-11eb-9419-9b5d25baeacf.html",
  "title": "Charles “Charlie” Eugene Bowen | Obituaries | Maryville Forum",
  "text": "Charles “Charlie” Eugene Bowen 1948-2020 Charles Eugene “Charlie” Bowen, 72, of Maryville, Missouri, passed away unexpectedly on Sunday, September 27, 2020, in North Kansas City, Missouri. Charlie was born in Clarinda, Iowa, on February 12, 1948. His parents were Charles G. and Erma Jean (Walker) Bowen. They preceded him in death. He was also preceded by his sister, Donna Jean Bowen. He lived a short time in Clarinda, and then in Ravenwood, Missouri. He graduated from Northeast Nodaway High School, class on 1966. He took Bible School classes in Norfolk, Nebraska, and married many people in the area. He lived many years in Maryville. Charlie was the manager at Tightline UV Lures, Maryville. He had worked with his Dad at Bowen Body Shop, in Ravenwood. And he and Teresa had owned Looks Fitness Center in Maryville. He attended the Countryside Christian Church, Maryville. He was handy and a ‘jack-of-all-trades’. He had repaired cars in his home shop, and if you needed something, he either had it or knew where to get it. In 1989, Charlie and Teresa Lynn Key were united in marriage in Las Vegas, Nevada. Other survivors: son, Anthony (Danny) Bowen, Des Moines, Iowa, daughters: April McMahon, Kansas City, Missouri, Brandi (Noah) Bonde, Maryville, and Lonia Bowen, also of Maryville; three brothers: Lee (Charlotte) Bowen, Barnard, Missouri, Ray (Shelley) Bowen, Trimble, Missouri, and Jerry Bowen, Venice, Florida; five grandchildren, Will and Brody McMahon, Haven Bonde, and Max and Mila Bowen; and numerous nieces and nephews. Charlie has been cremated under the direction of the Bram Funeral Home, Maryville. Memorial graveside services will be at 1:30 p.m., Friday, October 2, 2020, at the Oak Hill Cemetery, Maryville, Missouri. In lieu of flowers, memorials are suggested to the family to help with final expenses."
}