{
  "url": "https://forums.qrz.com/index.php?threads/the-12-days-of-qrz-2025.973142/page-6",
  "title": "The 12 Days of QRZ ... 2025 | Page 6 | QRZ Forums",
  "text": "Just got on HF this year and am excited to participate in this. My only question is why is this contest 90 days long? I can’t speak for QRZ but for me it is about not just getting 12 contacts and the award it is for me about getting all the endorsements on all bands that means 12 confirmed contacts on each band easier said than done. secondly what better way for me to spend the winter It's not a contest at all - it's just a chance to earn a badge on your Bio page (or order a certificate if you so choose). Scores aren't compared user to user, and there's no ranking other than \"who got theirs first\" - anyone working every day of the event will be eligible for the badge/award on day 12. But as pointed out above, not everyone can be on the radio every day from December 1 to 12, so QRZ gave it until the end of February so everyone who wants to get the badge can do so. It's also fun to try to outdo your own prior-year effort and try for more bands and more modes to see if you can beat your own personal score from last year. It's just a fun event that many enjoy doing every year Dave W7UUU Are you looking for confirmed contacts same day on …. The 12 Days of QRZ I am calling CQ on All Bands in The General Portion of The Bands. Make a contact get the confirmation immediately. Guaranteed Hope to Catch You On The Air N3WVB / Chuck I enjoy this one, good fun and easy enough to achieve. It may also help me get the last three North America confirmations I need too! Are you New To The Hobby ? I thought it would be interesting to share this information. There have been many Ham's who have gone before you in this amazing hobby. Here are just a few that may surprise you ......... Entertainment and music Marlon Brando: The iconic actor was a licensed ham with the callsign FO5GJ. Joe Walsh: Guitarist for the Eagles holds the callsign WB6ACU. Chet Atkins: Legendary country musician who had the callsign WA4CZD and W4CGP. Tim Allen: The actor also holds a ham license. KK6OTD Art Bell: Host of \"Coast to Coast AM,\" he was a licensed operator with the callsign W6OBB. Ronnie Milsap: The country music singer was a member of the Gator Net crew. WB4KCG Jean Shepherd writer K2ORS Howard Hughes Billionaire Aviator W5CY Patty Loveless Country Music Star KD4WUJ Politics and royalty King Hussein of Jordan: A well-known ham with the callsign JY1. Juan Carlos: The former King of Spain was a licensed operator with the callsign EA0JC. King Bhumiphol Adulayadej of Thailand: Was known as HS1A. Carlos Saul Menem: Former President of Argentina held the callsign LU1SM. Barry Goldwater K7UGA US Senator From Arizona Technology and business David Packard: Co-founder of Hewlett-Packard was a ham with the callsign 9DRV. Arthur Collins: Founder of Collins Radio was known as W0CXX. Bob Heil: A pioneer in concert sound and equipment, he is known as K9EID. John Sculley: Former CEO of Apple Inc. and president of PepsiCo. Steve Wozniak is a Tech Genius , Inventor best known for co-founding Apple Computer Inc WV6VLY Frank Conrad Engineer Known For Creation of KDKA Radio 8XK Space and science Yuri Gagarin: The first human in space was a ham. Kalpana Chawla: Astronaut who died in the Columbia space shuttle disaster. Catherine Coleman: NASA astronaut and ISS commander. Emily Calandrelli: Known as the \"Space Gal,\" she is also a licensed amateur radio operator. Ofcourse not everyone is familiar with everyone on the above list. I can only say how fortunate I am to have worked a few of the above and to enjoy a Hobby that has such a diverse group of individuals. I will be active during The 12 Days of QRZ as I strive to keep Ham Radio Alive N3WVB THE GEM OF THE CARIBBEAN Hope to work you during The 12 Days of QRZ Calling CQ On All Bands N3WVB / CHUCK WORKING ALL BANDS Look For Me In The General Portions of The Bands Calling CQ SSB ONLY Logging Stations Instantly The 12 Days of QRZ Be Sure To Log Your Contacts On The Free and Easy To Use QRZ Log Book Making Winter More Enjoyable The 12 Days of QRZ Dec 1st 2025 - Feb 28th 2026 This is always a FUN one! I think a 90 day Award would be a good one to add!!! Get-R-Done! Thanks, Chuck, W2CSI"
}