{
  "url": "https://forums.qrz.com/index.php?threads/qrz-qso-confirmations-not-appearing-in-lotw.932626/",
  "title": "QRZ QSO confirmations not appearing in LOTW | QRZ Forums",
  "text": "Hello Everyone, I can import from LOTW to QRZ, and all LOTW QSO confirmations appear in the QRZ logbook. Going the other way - from QRZ to LOTW - none of my QRZ QSO confirmations appear in LOTW. Everything is set up correctly, and I receive no errors from the export to LOTW. Is there something magical that I need to do? Any ideas would be helpful. Thanks all! Greg Greg, since no two hams use the same logging programs or sites, the thing to do would be to go to LOTW and from the front page click on the \"Your Account\" tab, then \"Your Activity\". You can then verify that your log files are in the LOTW system. You will see a list of the files that you have up loaded and each file will have a little blue tab that says Result. Click on that tab and it will show you any QSL's that have resulted from your upload. After that, you can go to the \"Your QSO's\" tab and see any confirmations there also. If there are no QSL results in either place, then the only problems might be that the hams in question use QRZ but not LOTW or the other way around. That happens a lot. Not everyone uses the exact same logging programs or sites, and like @KP4SX said, LOTW does not accept confirmations from QRZ. We used to be able to export to LOTW and the qso line would change color and show a green check mark. Why can't we export now? I don't think so. You can export logs but confirmations only appear on LoTW if the other station confirmed on both sites. Okay there was a little confusion on the question. You KP4SX are correct. my question was to even send a new contact to LOTW. I have a new certificate and was having trouble getting it to upload on QRZ. I was finally able to make it work last night. Thanks. K9KLC, man i wish i could tell you. I read something on the forums and it worked. Not sure I remember which articular it was."
}