{
  "url": "https://www.investopedia.com/what-is-opensea-6362477",
  "title": "What Is OpenSea?",
  "text": "Table of Contents Expand Table of Contents What Is OpenSea? Understanding OpenSea How to Use OpenSea Connecting to OpenSea Searching for NFTs NFT Collection Features Buying NFTs Creating NFTs Selling NFTs Storing NFTs Securely FAQs The Bottom Line What Is OpenSea? By Tobi Opeyemi Amure Full Bio Tobi is a crypto writer at Investopedia. He aims to simplify the complex concepts of blockchain and cryptocurrencies for the masses. Learn about our editorial policies Updated August 30, 2024 Reviewed by Khadija Khartit Reviewed by Khadija Khartit Full Bio Khadija Khartit is a strategy, investment, and funding expert, and an educator of fintech and strategic finance in top universities. She has been an investor, entrepreneur, and advisor for more than 25 years. She is a FINRA Series 7, 63, and 66 license holder. Learn about our Financial Review Board Fact checked by Amanda Jackson Fact checked by Amanda Jackson Full Bio Amanda Jackson has expertise in personal finance, investing, and social services. She is a library professional, transcriptionist, editor, and fact-checker. Learn about our editorial policies Close What Is OpenSea? OpenSea is a non-fungible token (NFT) marketplace that offers users the ability to buy, sell, create, and trade NFTs. It is the largest NFT trading platform, with more than three million active users and a daily trading volume of about $4.5 million as of January 2024. Key Takeaways OpenSea is a non-fungible token (NFT) marketplace where users can buy, sell, or create NFTs. It is a non-custodial platform, allowing users full control and access to their cryptocurrency wallets. Users interact directly with each other to buy or sell NFTs individually or in bundles. Understanding OpenSea OpenSea prides itself on being the first and largest NFT platform to provide essential NFT services. Before it was created in 2017, there was no platform for users to trade different NFTs easily. OpenSea was created as a solution to allow users to trade crypto collectibles and other NFTs with one another. The desktop and mobile dashboards open with two prompts to explore NFTs or create a new crypto wallet. Or, if you already have a crypto wallet, you can connect it to the platform. You can explore the vast array of more than 2 million NFT collections or create your own. OpenSea supports various categories of NFTs, ranging from art, music, collectibles, virtual lands, sports assets, domain names, and utility NFTs like membership passes. You can easily identify the top and most trendy collections per category and narrow the results by periods of 24 hours, seven days, 30 days, or all-time. There’s also an option to select a particular blockchain you prefer to explore. How to Use OpenSea OpenSea offers an intuitive and beginner-friendly user interface, which makes it easy to use and navigate. First, connect a crypto wallet to OpenSea to be able to initiate a transaction. Your wallet is what you use to interact with the blockchain to make payments or receive deposits. Because OpenSea is noncustodial, when you connect your wallet to the platform, your NFTs are not stored on it; instead, they are sent to your wallet address. Here’s a list of crypto wallets that OpenSea supports: MetaMaskCoinbase Wallet (WalletLink)Trust WalletFortmatic/MagicBitskiBitgetCorePhantomSolflareGlowOpera Touch (mobile only)WalletConnectKaikas Connecting to OpenSea Whether your crypto wallet is MetaMask, Coinbase Wallet, or any of the others listed above, the process of connecting to OpenSea is the same. Visit OpenSea.io, navigate to the “Log In” section in the menu tab, and click on your wallet type. Your device will display a prompt where you are to input your public keys to connect to the platform. You must have some ether (ETH) to connect your wallet. After connecting to the platform, you can view all the NFTs that you own on your account page. You can trade or sell your NFTs in the marketplace at will. The profile section lets you input your username, bio, email address, images, and social links. Tip Keep the private keys to your crypto wallet in a secure place that’s easily accessible only to you. If you lose your passwords, you won’t be able to access your NFTs and other cryptocurrencies in your wallet. Searching for NFTs on OpenSea The “Explore” page is your gateway to browsing the wide range of NFTs available on OpenSea. You can explore collections by clicking on the category of interest or searching for a particular NFT you already know about. The page lights up with the top NFT collections, some with animated logos and others with distinct static logos. Popular collections like Bored Ape Yacht Club (and its variations) are among the entries in the “Trending” category. You can also search for NFTs on the “Stats” page. It contains more analytics features, including displaying the top NFTs in the last 24 hours by default. You can filter the results using category and blockchain, then further sort them by volume, time, price change, floor price, sales, unique owners, and items listed. You also can narrow your searches by setting your preferred price range for NFT collections, category, or blockchain and choosing between single or bundled items. NFT Collection Features After selecting an NFT collection, a new page opens with information about the NFT collection, including the creator's name, the number of items in the collection, total volume, floor price, and best offer. The page may also display links to NFT social media channels. You can navigate the \"Items\" section to browse the collection or explore the activity, offers, or analytics sections to get insights. This section contains five status filters—categories for sorting through various NFTs. These filters help you narrow your search for the perfect buy. They are: All: Displays all NFTs in the collection, helpful for browsing an entire collection to learn more about it.Listed: Shows the NFTs in the collection that are listed for saleOn Auction: Shows NFTs and their corresponding bidsNew: Distinguishes newly listed NFTs from older onesHas Offers: Lists any NFTs that have current offers on them How to Buy NFTs on OpenSea To buy NFTs on OpenSea, fund your wallet with ether (ETH) and convert it to wrapped ETH (WETH), an Ethereum token with improved interoperability. Most NFTs can be purchased using ETH, WETH, AVAX, USDC, KLAY, and DAI. OpenSea allows a few other tokens, but fiat currency is not accepted. To buy an NFT, use the search bar to find the NFT you like, using the wide range of filters available to zero in on the best option. After selecting your preferred NFT, choose either the \"Buy Now\" tab to buy the NFT at the displayed price or the \"Make Offer\" tab to propose your preferred price. A page will open for you to sign the transaction to complete your payment. If you make an offer, you must wait for the seller to accept or reject it. If your transaction is successful, your NFT will be sent to your wallet. You can view all the NFTs you bought in your profile's \"My Collections\" tab. How to Create NFTs on OpenSea You can create an NFT collection containing digital items like art pieces and music on OpenSea. Click the “Create” tab, and you’ll be redirected to the NFT item creation page, where you can add your NFT files with their names and description. Customize your NFT by adding properties, levels, stats, etc. Fast Fact The default blockchain on OpenSea is Ethereum, but you can mint your NFT on another blockchain. Click “Create” once you’ve finished customizing your NFTs, and your collection is ready for sale. How to Sell NFTs on OpenSea You can sell NFTs on OpenSea by selecting a single item or creating a bundle of different NFTs and listing them for sale. Navigate to your profile icon and choose the NFTs you want to list for sale from your wallet. On the Item page, there are two options on the top right: the “Edit” tab and the “Sell” tab. Click “Sell.” The listing page will open to display options on the price and type of sale you want to execute. The sale listings include fixed-price sales and timed-auction sales. Fixed-Price Sale In a fixed-price sale, you set a particular price for your NFT with an option to determine the sale duration. Timed-Auction Sale In this sale, you can either sell to the highest bidder, where the buyer with the highest bid wins and buys the NFT or sell with a declining price, where the price falls until someone makes a purchase. Important OpenSea does not currently support timed-auction sales on mobile or for ERC-1155 tokens with multiple owners. How to Store NFTs Securely on OpenSea News of fraudulent activities in the crypto market continues to pour in. Scammers are always targeting crypto users, whether it’s at a crypto exchange or an NFT marketplace. Here are seven tips to secure your NFTs on OpenSea. Do not share your secret recovery phrase with anyone, not even someone posing as an OpenSea support official. Ensure you’re linking to the official website, not one with a similar name but a different domain. Sometimes, the difference is easy to miss, so be careful to confirm the site before initiating a transaction. When your wallet is linked to a browser, avoid clicking on broken, unknown, and suspicious links to avoid getting hacked. Your passwords should be unique and different from the ones you use for other sites. Enable two-factor authentication (2FA) to shield yourself from potential attacks. Consider using a hardware wallet to store your NFTs for improved security. Do not download attachments from an OpenSea email. OpenSea does not send files to its users, so be cautious of phishing emails. What Are Non-Fungible Tokens (NFTs)? Non-fungible tokens (NFTs) are assets encrypted on a blockchain with unique codes and metadata that define and distinguish them from one another. NFTs are tokens (encrypted information) that are stored on a network. NFTs can represent various digital assets, including artwork, real estate, collectibles, music, photography, in-game assets, and avatars. What Is OpenSea Built on? OpenSea operates on an open-source Web3 marketplace it developed, called Seaport. What Is OpenSea for? OpenSea is a marketplace designed to bring NFT creators and fans together in one place. The company created a safe and easy-to-use interface that has become the most popular NFT market in the world. The Bottom Line OpenSea is the largest NFT marketplace, offering a channel for thousands of creators, traders, and buyers to interact. Users can produce, sell, or buy art, collectibles, real estate, in-game, and sports assets on the OpenSea listing page. Newer NFT platforms such as Rarible, LooksRare, Magic Eden, Binance NFT, and Nifty Gateway are becoming competitive against OpenSea. But as of January 2024, OpenSea remained the leading NFT marketplace with a market volume of more than $20 billion, and it is expected to retain a considerable market share in the future. The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency. Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. Dune.com. \"@rchen8|OpenSea.\" OpenSea. “Building an Open Digital Economy.” OpenSea. “Explore, Collect, and Sell NFTs.” OpenSea Help Center. “What Crypto Wallets Can I Use with OpenSea?” OpenSea. “Explore Collections.” OpenSea. “Collection Stats.” OpenSea. \"What Are the Key Terms To Know in NFTs and WEB3?\" OpenSea Help Center. “How Do I Create an NFT?” OpenSea Help Center. “How Do I Sell an NFT?” OpenSea Help Center. “How Do Timed Auctions Work?” OpenSea. “Important Update on Email Vendor Security Incident.” OpenSea. \"Launching Seaport & Saving the Community Millions in Fees.\" Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Read more Cryptocurrency Strategy & Education Partner Links Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace."
}