{
  "url": "https://westseattleblog.com/2025/12/west-seattle-saturday-admirals-winter-wonderland-plus-many-other-holiday-happenings-and-a-non-holiday-event-list-too/",
  "title": "West Seattle Blog… | WEST SEATTLE SATURDAY: Admiral’s Winter Wonderland plus many more holiday happenings, and a non-holiday event list too",
  "text": "(Friday’s sunset, photographed by Yvonne Frankovich) Happy Saturday! We present to you another two-part event list – first, seasonal happenings today/tonight, from the WSB West Seattle Holiday Guide: SELFIES WITH SANTA: 8:30 am-11 am Saturday and Sunday mornings in December, DIY photos with Santa at CAPERS Home (4525 California SW; WSB sponsor), donation requested for West Seattle Food Bank. VIVA HOLIDAY ART STUDIO TOUR ON VASHON: 10 am-5 pm both days this weekend – take a self-guided tour of Vashon artists’ studios. Info and locations at vivartists.com. (WSB sponsor) WESTWOOD ART STUDIO HOLIDAY ART SHOW & SALE: Group show and sale continues this weekend, 10 am-6 pm today, more info here. (9042 31st SW) WINTER WONDERLAND IN ADMIRAL: Presented by the Admiral Neighborhood Association, multiple venues, 11 am-2 pm: Join the Admiral Neighborhood Association (ANA) and our incredible Admiral business community as we spread some holiday cheer. Businesses throughout Admiral will be hosting festive family-friendly events/activities and offering specials during our third annual Winter Wonderland. Join the Daytime Disco Party with Santa at West Seattle Realty, sing your heart out with carolers from Admiral Church, and be on the lookout for the ANA penguin wandering the neighborhood! Find our map of participating locations here. Join the ANA as we celebrate our Admiral community while shopping small this winter! BUSKING IN THE JUNCTION: 11 am-1 pm today and next Saturday, local musicians will perform carols and winter-themed music, raising money for the West Seattle and White Center Food Banks, on KeyBank corner at California/Alaska. ARTIST POP-UP AT CAPERS HOME: 11 am-4 pm, you’ll find jewelry and ceramics artists today at CAPERS Home (4525 California SW; WSB sponsor). PET PHOTO BOOTH: Mud Bay in Admiral is hosting a holiday pet-photo booth 11 am-4 pm, free but nonprofit donation encouraged. (2611 California SW) UGLY SWEATER SOCIAL: Noon-3 pm at Ounces (3809 Delridge Way SW), including a 2 pm contest with prizes! PHOTOS WITH SANTA AT CURIOUS KID STUFF: Pics at Curious Kid Stuff‘s Santa Land, 1-3 pm. (4740 California SW) ALASKA JUNCTION SANTA PUB CRAWL: 4-10 pm, starting at Shadowland (California SW and SW Oregon). 21+. (Photo by Margaret – new holiday touches set up for Astra Lumina) ASTRA LUMINA: Celestially inspired light show on the grounds of the Seattle Chinese Garden at the north end of the South Seattle College (WSB sponsor) campus, times vary. Tickets and info here. WEST SEATTLE BIG BAND @ WS EAGLES: Second chance to see them in less than a week: WSBB will be the featured Saturday night dance band at the West Seattle Eagles on December 13th. A dinner of Baked Zita will be available for purchase at $15 prior to the show at 5:30 PM. First come, first served. All proceeds of the dinner will go to the Music Boosters at James Madison Middle School. Space is limited. No reservations will be taken for the meal. The evening of music starts at 7:00 PM with 3 sets concluding at 10:00 PM. Music will include some Christmas favorites as well as big band swing and jazz. There is no cover charge for the event, but a tip jar will be available with 100% of the proceeds of the evening going to the Madison instrumental music program. The event entrance is off the alley behind the Eagles Building at 4426 California Ave SW. JACKBOX HOLIDAY PARTY AT FOURTH EMERALD GAMES: Play games and support charity, starting at 5:30 pm. (4517 California SW, upstairs) SANTA AT MENASHE FAMILY LIGHTS: West Seattle’s brightest lights host Christmas’s jolliest old soul – with reindeer! 6-10 pm. (5605 Beach Drive SW) CHAMPAGNE EVENT #2: West Seattle Wine Cellars (6026 California SW) hosts another champagne event – this one at 6 pm – details and registration link here. BELLS OF THE SOUND: 7 pm concert with Puget Sound’s premier handbell choir at Tibbetts United Methodist Church (3940 41st SW) – “Let Your Heart Be Light” is this year’s theme. By donation, at the door. CHRISTMAS TREES: As noted here, every place that sells them in West Seattle is up and running! Scroll through the Holiday Guide any time for the list. And here are the non-holiday-season events for today, from the WSB West Seattle Event Calendar and inbox: SWEAT TESTING: 7:50 am at West Seattle Runner (2743 California SW; WSB sponsor) – preregister here. SATURDAY GROUP RUN: Also at West Seattle Runner (2743 California SW; WSB sponsor), regardless of whether you’re getting sweat testing, you can join the Saturday 8 am free group run! FREE! HEAVILY MEDITATED: Free 9 am community meditation at Inner Alchemy Sanctuary/Studio (3618 SW Alaska) – register here. STORY TIME WITH CRAFT ACTIVITY: 9:30 am at Highland Park Corner Store (7789 Highland Park Way SW), free. INTRODUCTORY WALK and WALKING FOR WELL-BEING: 9:30 am, walk a mile as a prelude to the 10 am well-being walk (or just show up for that one). Both start from 47th SW and Fauntleroy Way SW. SSC GARDEN CENTER: The Garden Center at South Seattle College (6000 16th SW, north end of campus), is open 10 am-3 pm – one more week until its holiday break! MORNING MUSIC AT THE COFFEEHOUSE: 10:30 am-noon at C & P Coffee (5612 California SW; WSB sponsor), Marco de Carvalho and Friends perform. Info about Marco’s music is here. FREE WRITING GROUP: In session again this week, 10:30 am, info in our calendar listing. FAMILY STORY TIME: 10:30 am at High Point Library. (3411 SW Raymond) GRIEFSHARE: Newest session continues, 10:30 am at Grace Church, no charge (10323 28th SW) FAMILY READING TIME: At Paper Boat Booksellers, 11 am family reading time. (4522 California SW; WSB sponsor) LOG HOUSE MUSEUM: The home of West Seattle’s history is open noon-4 pm on Saturdays. (61st SW and SW Stevens) VIETNAMESE CULTURAL CENTER: The center is open to visitors noon-3 pm, as explained here. (2236 SW Orchard) VISCON CELLARS TASTING ROOM/WINE BAR: Tasting room open for you to enjoy wine by the glass or bottle – 1-6 pm at Viscon Cellars (5910 California SW; WSB sponsor). NORTHWEST WINE ACADEMY TASTING ROOM, WINE BAR, STORE: On the north end of the South Seattle College (6000 16th SW; WSB sponsor) campus: The Northwest Wine Academy Tasting Room is OPEN Thursday-Saturday 1 pm-6 pm until December 20th! Back by popular demand: We are featuring our 2016-2019 varietals for a mix and match $62 case! Stop by for a tasting and a case for the holidays! Thank you for a beautiful year of supporting our students! Enjoy student-produced wines and affordable eats at the Northwest Wine Academy Tasting Room and Wine Bar at South Seattle College, with proceeds benefitting student learning and the Wine Studies Program. NWWA is located in the North Parking Lot at South Seattle College (6000 16th Ave SW) in the Puget Ridge neighborhood of West Seattle. FREE MASSAGE: 3-5 pm walk-in clinic offering short, specific massages at Nepenthe. (9447 35th SW) 2 ‘PENELOPE’ PERFORMANCES AT ARTSWEST: West Seattle’s playhouse offers something different this holiday season – the folk-pop musical “Penelope,” with a 3 pm matinée and 7:30 pm evening performance today/tonight; get tickets here. (4711 California SW) LIVE IN-STORE AT EASY STREET RECORDS: Stephanie Anne Johnson performs at Easy Street Records (4559 California SW), 7 pm, free, all ages. LIVE MUSIC AT MR. B’S: 7 pm, Angelina Adams at Mr. B’s Mead Center (9444 Delridge Way SW), no cover. REVELRY ROOM DJ: Saturday spinning starts at 9 pm – tonight it’s DSoul Focus FM at Revelry Room. (4547 California SW). KARAOKE AT TALARICO’S: Our Saturday list concludes with 10 pm karaoke at Talarico’s Pizzeria. (4718 California SW) Got a West Seattle event coming up? If community members are welcome, your event is welcome on our calendar! Please email info to westseattleblog@gmail.com – thank you!"
}