{
  "url": "https://support.google.com/admanager/answer/7084151?hl=en",
  "title": "Sign up for Ad Manager - Google Ad Manager Help",
  "text": "Google Ad Manager is an ad management platform for large publishers who have significant direct sales. Ad Manager provides granular controls and supports multiple ad exchanges and networks, including AdSense, Ad Exchange, third-party networks, and third-party exchanges. Ad Manager is for you if you need: - A central place to monetize all of your inventory types (websites, mobile apps, videos, or games) - To manage a significant amount of ad revenue that comes through direct deals from buyers - To use third-party networks to compete for ad inventory - More complex reports to gain granular insights If you want more automation and easy-to-implement ad solutions, AdSense might be a better fit for you. AdSense and Ad Manager publishers have access to the same premium advertisers and certified buyers. You can serve high-quality ads from both AdSense and Ad Manager. Learn more about how AdSense, and Ad Manager compare. Create a Google AdSense account You need a valid Google AdSense account to sign up for Ad Manager. If you don’t have a Google AdSense account already, create a new AdSense account. Sign up for Ad Manager Your Ad Manager account is permanently linked to your Google AdSense account. If you have more than one Google AdSense account, make sure you sign up for Ad Manager using the right one. - Go to admanager.google.com to sign up for an account. - Click Create account, then choose For myself or To manage my business. - Follow the prompts to complete the sign up. Note: You may need to speak with a Google representative to complete your account setup. After creating your account, go to admanager.google.com to sign in. If you're having trouble signing in, you can also troubleshoot access issues. Time zone and currency settings Before you do anything in your new Ad Manager account, make sure that the network settings are correct. Once you have created your first order, network time zone and currency are permanently set and cannot be changed. - Sign in to Google Ad Manager. - Click Admin, then Global settings, and then Network settings. - Review time zone and currency settings. These setting were configured when the Ad Manager network was created. They can be changed up until you create your first order. - If you've made changes, click Save. Next steps Your network is up and running. Here are a more articles to help you get started. You can search this help center for more help. You can also explore the support options available to you."
}