{
  "url": "https://barr-nunntruckingjobs.com/benefits",
  "title": "Barr-Nunn Truck Driver Benefits | Barr-Nunn Truck Driving Jobs",
  "text": "Example Here is a sample truck driving week that shows how practical mileage could impact your earnings Barr-Nunn Company Truck Drivers who meet certain safety criteria are eligible to receive a CSA Safety Bonus every 90 days. This equates to thousands of dollars per year for our truck drivers. To make it even better, Paid Time Off (PTO) is also earned with every bonus! This is one of the most popular components of our compensation program, and our truck drivers love it. Current CSA Safety Bonus amounts (company truck drivers eligible every 90 days) Solo Truck Drivers Team Truck Drivers Current On-Road Safety Bonus amounts (company truck drivers eligible every 90 days) Solo or Team Company Truck Drivers Please call Truck Driver Services & Recruiting at 888-999-7576 for additional information. Current Company Driver Anniversary Bonus amounts (company truck drivers are eligible once per year on the anniversary of their most recent hire date): Solo or Team Company Truck Driver Employees We offer options for health insurance with Blue Cross and Blue Shield as shown below*: Dental insurance is also available for $3.75/week single or $10.50/week family*. *rates are subject to change In addition, we offer the following to all company truck drivers: a) 100% up to 3% of eligible wages OR b) 100% up to $2,000 The match is contributed to the employee's retirement account annually, and requires participants be employed on the last day of the calendar year.* Company Truck Drivers are required to contribute to their 401(k) plan in order to receive the match from Barr-Nunn. New employees are eligible to participate in the 401(k) program after 90 days of employment. * All matches subject to vesting schedules. Truck Drivers who choose positions paid by the shift earn PTO annually on their anniversary. Example Here is an example chart of PTO that can be earned for a mileage-paid Solo Truck Driver. For a limited time, for each driver a Barr-Nunn driver refers to Barr-Nunn who is ultimately hired and hauls a load, you may be eligible to receive the following: 1) $1,000 per driver, payable after your referral successfully completes orientation and hauls their first load. 2) Opportunity for an extra CSA Safety Bonus and On Road Safety Bonus each time you earn one over the next 12 months. Barr-Nunn Company Truck Drivers have the opportunity to earn the bonus every 90 days, so you could receive up to 4 extra payouts of the bonus if you meet the safety requirements. This option is valid only if your referred driver continues to be employed at Barr-Nunn for an uninterrupted period at the time of potential payout. Current CSA Safety Bonus amounts (company truck drivers eligible every 90 days) Current On-Road Safety Bonus (company truck drivers eligible every 90 days) Referrals are a great way to earn supplemental income and put you in control of your own finances. Why not contribute to the growth of Barr-Nunn, and make money at the same time? Please call Truck Driver Services & Recruiting at 888-999-7576 for additional information. *Driver referrals must seat an additional truck to qualify for the referral bonus. Referring a second member of a team does not qualify. Please call Truck Driver Services & Recruiting at 888-999-7576 for additional information about any of our benefits. Corporate Home Page Contact Us Terms and Conditions of Use Privacy Policy Site Map © 2026, Barr-Nunn Transportation LLC"
}