{
  "url": "https://abcnews.go.com/International/wireStory/russia-ukraine-talks-scheduled-week-zelenskyy-129749243",
  "title": "Russian drone strike kills 15 in Dnipro as Zelenskyy says more talks next week - ABC News",
  "text": "Russian drone strike kills 15 in Dnipro as Zelenskyy says more talks next week A Russian drone strike on the Ukrainian city of Dnipro has killed at least 12 people, according to Ukrainian emergency services KYIV, Ukraine -- A Russian drone strike on the Ukrainian city of Dnipro hit a bus carrying mineworkers and killed at least a dozen people, Ukrainian authorities said Sunday, hours after President Volodymyr Zelenskyy announced that the next round of peace talks between Russian and Ukrainian delegations will take place on Wednesday and Thursday. The strike injured several more people and sparked a fire that was subsequently put out, according to the emergency services. DTEK, Ukraine’s largest private energy company, said it owned the bus and accused Russia of carrying out “a large-scale terrorist attack on DTEK mines in the Dnipropetrovsk region,” whose capital is Dnipro. “The epicenter of one of the attacks was a company bus transporting miners from the enterprise after a shift in the Dnipropetrovsk region,” the company said in a Telegram post. The strike came days after U.S. President Donald Trump said the Kremlin had agreed to temporarily halt the targeting of the Ukrainian capital and other cities, as the region suffers under freezing temperatures that have brought widespread hardship to Ukrainians. Ukrainian Energy Minister Denys Shmyhal on Sunday called the strike in Dnipro “a cynical and targeted attack on energy sector workers,\" and said it occured near the Ternivska mine east of the city. Hours earlier, Ukraine's emergency services reported that Russian attack drones injured six people at a maternity hospital in Zaporizhzhia, southern Ukraine, on Sunday morning. Meanwhile, envoys from Russia, Ukraine and the U.S. had been expected to meet Sunday in Abu Dhabi to continue negotiations aimed at ending Moscow’s all-out invasion of its neighbor. But on Sunday morning, Zelenskyy announced that they would take place next week instead. “We have just had a report from our negotiating team. The dates for the next trilateral meetings have been set: Feb. 4 and 5 in Abu Dhabi. Ukraine is ready for substantive talks, and we are interested in an outcome that will bring us closer to a real and dignified end to the war,” Zelenskyy said in a Telegram post. There was no immediate comment from U.S. or Russian officials. On Saturday afternoon, top Russian envoy Kirill Dmitriev said he had held a “constructive meeting with the U.S. peacemaking delegation” in Florida. Officials have so far revealed few details of the talks in Abu Dhabi, which are part of a yearlong effort by the Trump administration to steer the sides toward a peace deal and end almost four years of all-out war. While Ukrainian and Russian officials have agreed in principle with Washington’s calls for a compromise, Moscow and Kyiv differ deeply over what an agreement should look like. Popular Reads A central issue is whether Russia should keep or withdraw from areas of Ukraine its forces have occupied, especially Ukraine’s eastern industrial heartland called the Donbas, and whether it should get land there that it hasn’t yet captured. Earlier on Sunday, Russian attack drones struck a maternity hospital in southern Ukraine, the Ukrainian emergency service reported. In a Telegram post, it said the strike wounded three women in the hospital in Zaporizhzhia, and also sparked a fire in the gynecology reception area that was later extinguished. Regional administration head Ivan Fedorov later said the number of injured had risen to six. The Kremlin confirmed Friday it agreed to hold off striking Kyiv until Sunday, but refused to reveal any details, making it difficult for an independent assessment of whether the conciliatory step had indeed taken place. In the past week, Russia has struck energy assets in the southern Ukrainian city of Odesa and in Kharkiv in the northeast. It also hit the Kyiv region on Wednesday, killing two people and injuring four. Overnight into Sunday, Russia launched 90 attack drones, with 14 striking nine locations, Ukraine’s air force said in a Telegram post. A woman and a man were killed in an overnight drone strike in Dnipro, according to local administration head Oleksandr Hanzha. Russian shelling also hit central Kherson, a city in southern Ukraine, soon after 7 a.m., seriously wounding a 59-year-old woman, according to a Facebook post by the municipal military administration. Russia's Defense Ministry on Sunday morning said its forces had used operational-tactical aviation, attack drones, missile forces and artillery to strike transport infrastructure used by Ukrainian forces. In a separate post Sunday, it said that Russian air defenses shot down 21 Ukrainian drones flying over southwestern and western Russia. It did not mention any casualties or damage. ___ Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
}