{
  "url": "https://en.wikipedia.org/wiki/Bellini_(cocktail)",
  "title": "Bellini (cocktail) - Wikipedia",
  "text": "Bellini (cocktail) A Bellini is a cocktail made with Prosecco and peach purée or nectar. It originated in Venice, Italy. History [edit]The Bellini was invented sometime between 1934 and 1948[1][2] by Giuseppe Cipriani, founder of Harry's Bar in Venice, Italy. He named the drink the Bellini because its unique pink color reminded him of a painting by 15th-century Venetian artist Giovanni Bellini.[3] The drink started as a seasonal specialty at Harry's Bar.[3] Later, it also became popular at the bar's New York counterpart. After an entrepreneurial Frenchman set up a business to ship fresh white peach purée to both locations, it became a year-round favorite.[1] The Bellini is an IBA Official Cocktail. They also suggest a Puccini, replacing the peach purée with an equal amount of mandarin or tangerine juice; a Rossini, which uses strawberry purée; or a Tintoretto, which is made with pomegranate juice; or a Cipriani Bellini, named after the owner of the bar where the Bellini was invented (Harry’s Bar in Venice), this version emphasizes the use of fresh white peach purée and Prosecco. Preparation and serving [edit]The Bellini consists of puréed white peaches and Prosecco, an Italian sparkling wine. Marinating fresh peaches in wine is an Italian tradition.[1] Similar cocktails [edit]The Cuban Adalor cocktail is a drink calling for fresh peach smashed with a fork and topped with Champagne. It was published in a Cuban drink guide book in 1927.[4] See also [edit]References [edit]- ^ a b c \"3000 Drinks > Bellini\". ThatsTheSpirit.com. n.d. Archived from the original on July 23, 2012. Retrieved February 5, 2007. - ^ Jo' Pratt. Food – Recipes – Bellini cocktail. Undated. bbc.co.uk. Retrieved February 5, 2007. - ^ a b Sicard, Cheri. Featured Cocktail – Bellini Archived February 18, 2007, at the Wayback Machine. Undated. Fabulous Foods. Retrieved February 5, 2007. - ^ \"Cuba's Overlooked Role in Cocktail History\". punchdrink.com. Retrieved 4 March 2019."
}