{
  "url": "https://www.bbc.com/travel/article/20240123-the-dark-history-behind-madeiras-famous-levadas",
  "title": "The dark history behind Madeira's famous levadas",
  "text": "The dark history behind Madeira's famous levadas Fundamental to Madeiran identity, its 3,100km of aqueducts have proven to be more than a clever and functional feat of engineering to colonise an isolated island. Trudging through thick mud under heavy rain, I made my way along a narrow path, squeezing through twisted laurel trees. A rickety wire fence was the only thing preventing me from tumbling into the fog-filled Caldeirão Verde, a steep, impossibly green, tree-strewn valley hundreds of metres below. When I rounded the next bend, the heavy mist lifted and a thundering waterfall appeared out of nowhere, cascading from a cliff high above into a shallow pool as hikers on a bridge gawped in wonder. Located 560km off Africa's north-west coast, the Portuguese island of Madeira is full of dramatic hikes like the Levada do Caldeirão Verde, or PR9, that wind like veins through the island's picturesque landscape. What's unique about these trails is that they run alongside the island's slow-running levadas (man-made irrigation tunnels), providing awe-inspiring moments at every turn. These innovative water channels filter down from mountainous highlands into villages, towns and cities, providing not only handy navigation routes for hikers but water for cultivation, power and drinking. More impressively, they journey through some of Madeira's wildest forests, skirting vertiginous mountains that fall steeply into the North Atlantic Ocean. Madeira's vast levada network spans an impressive 3,100km on an island that measures just 55km long and 22km wide. It's thought the first levadas, which date back almost 600 years, were engineered by Portuguese settlers to provide water for drinking and agriculture (the word \"levada\" comes from the Portuguese verb \"to carry\"). These water tunnels, however, also allowed them to develop a lucrative sugar cane industry – the first sugar cane plant was built in 1425, only six years after the previously uninhabited island was officially discovered. However, the levada system has proven to be more than a clever and functional feat of engineering to colonise an isolated island. It has shaped Madeira's natural beauty, agronomy and culture, and is so intertwined in its past, present and future that a Unesco World Heritage stamp of approval is pending. \"With approximately six centuries of existence, the levadas – some ancient, others more recent – are part of the history of Madeira,\" said Susana Fontinha, who coordinated the Unesco candidacy. \"They are inseparable from the identity of Madeirans.\" While Madeira's levada system doesn't stand alone – Switzerland, the Canary Islands and Oman have used similar methods of transporting water – its location is distinctive. The island's volcanic topography emerges dramatically from the ocean, sprouting vast, immense mountain ranges, including its highest peak, Pico Ruivo, at around 1,860m. The woodland is so dense that when navigator Alvise Cadamosto arrived in the 15th Century, he remarked, \"there was not a foot of ground that was not entirely covered with great trees\". It's something João Gonçalves Zarco and Tristão Vaz Teixeira – two captains on vessels sponsored by Henry the Navigator had acknowledged earlier. The pair named the uninhabited island \"Ilha de Madeira\", Portuguese for \"the island of wood\", on discovering it in 1419. Along PR9, you can get a sense of the copious, untamed wilderness early settlers encountered. Almost every inch of the path is engulfed by trees, and around virtually every bend, you're confronted by flora and fauna: Madeiran heather, wild mountain uveira (blueberry) and ancient laurel trees. As I walked, I passed other hikers who exchanged smiles and warned of problematic areas along the trail. At one point, a group in front paused to inspect a mighty deluge of water blasting from the cliff above. Using an umbrella, I dispersed the flow to let them pass before doing the same. The island's first levadas, funded by wealthy Genoese backers, were to transport water to cultivate a cash crop: sugar cane. Madeira's fertile soil and year-round warm climate made for perfect growing conditions, and by the end of the 15th Century, Madeira had surpassed Cyprus as Europe's biggest exporter of sugar by 6:1. These first levadas were carved into basalt rock, predominantly on the island's south side. How the levada system works Water is collected from higher grounds and distributed through narrow channels around 50-60cm wide at a gradient of between 0.5 and 1%. Levadeiros (caretakers) are responsible for managing and maintaining the levadas but have also been known to mediate disagreements between landowners. While some local historians believe the levadas were created by agricultural workers using simple hand tools (pickaxes, hoes and rock hammers), others think enslaved people did much of the dangerous, backbreaking work. \"It's well established in Anglophonic literature that Canary Island and African slaves were used to build the first wave, or the first phase, of the levadas, which were fundamental to the sugar revolution,\" said Jason W Moore, author of Madeira, Sugar, & the Conquest of Nature in the \"First\" Sixteenth Century. He added that the system of using enslaved people for sugar production in Madeira became a blueprint for sugar mills in places such as Brazil and the Caribbean. \"Without Madeira, there would be no Christopher Columbus.\" Columbus famously went on to become a notorious sugar baron and brutal slave trader. But before that, he married the daughter of a wealthy sugar grower in Porto Santo, part of the Madeiran archipelago, where Moore believes he first \"learned of a world of slaving, shipping and sugar\". Because of the pride locals have for their levadas, it was difficult to find evidence, information or anyone willing to discuss the darker side of the levadas' history on the island. However, reading about Madeira's thriving sugar cane industry, it's impossible not imagine those who suffered at the hands of its early capitalists. Madeira's sugar industry peaked in 1506 when the island exported 2,500 tons of \"white gold\". However, by 1530, output had fallen by a staggering 90%, partly due to depleted energy resources such as wood. Throughout the 17th and 18th Centuries, the island's levadas became less vital – perhaps because of the island's newest industry, wine production, which didn't require as much water. But by the 19th Century, the levadas were again front and centre. In 1835, work started on the Levada Velha do Rabaçal – Madeira's first publicly funded levada. Later, secondary levadas provided water for land used to cultivate crops like yams, potatoes, beans and corn, improving nutrition on the island. On a hair-raising bus ride back from the hike, I spotted tapestries of these terraces, known as poios, blanketed across Madeira's mountainsides, looking every bit like the terraced rice fields of Southeast Asia. Today, however, the levadas are taking on yet another new role: changing the face of tourism in Madeira from being known as a sedate winter getaway for Brits in their golden years to an island destination for young thrill-seekers keen to be challenged by its hair-raising paths (it's recommended to hire a guide when hiking the island's more dangerous trails). Australian adventure influencer Jackson Groves put these lesser-known levadas on the map in 2021. Footage of him skirting hair-raising ridges, edging along cliffs with death-defying drops and dashing through waterfalls received tens of thousands of views on social media and put the levadas in the spotlight for a younger generation. While a new breed of travellers may be following Groves' lead, for local tour guide Lisa Camacho, the levadas serve as more than a vehicle to garner social media likes or get the adrenaline pumping. \"[The levadas] represent life,\" she said. \"They represent the struggle of my ancestors to conquer mountains and bring everyone water for their livelihood.\" Slowcomotion is a BBC Travel series that celebrates slow, self-propelled travel and invites readers to get outside and reconnect with the world in a safe and sustainable way. --- Join more than three million BBC Travel fans by liking us on Facebook, or follow us on Twitter and Instagram. If you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news delivered to your inbox every Friday."
}