{
  "url": "https://tr.tradingview.com/symbols/NASDAQ-AMZN/",
  "title": "Amazon Hisse Grafiği — NASDAQ:AMZN Hisse Fiyatı — TradingView",
  "text": "Bir sonraki rapor tarihi — Rapor dönemi — HBK beklenti — Gelir tahmini — 7,20 USD 59,25 B USD 637,96 B USD 9,69 B Amazon.com, Inc. hakkında Sektör Endüstri CEO Andrew R. Jassy Site Genel Merkez Seattle Kurulmuş 1994 Halka arz tarihi 15 May 1997 Tanımlayıcılar 3 ISIN US0231351067 Amazon.com, Inc., çevrimiçi perakende alışveriş hizmetlerinin sağlanmasıyla uğraşmaktadır. Aşağıdaki iş segmentleri aracılığıyla faaliyet göstermektedir: Kuzey Amerika, Uluslararası ve Amazon Web Hizmetleri (AWS). Kuzey Amerika segmenti, tüketici ürünlerinin perakende satışını ve amazon.com ve amazon.ca gibi Kuzey Amerika odaklı web siteleri aracılığıyla abonelikleri içerir. Uluslararası segment, uluslararası odaklı web siteleri aracılığıyla tüketici ürünleri ve aboneliklerin perakende satışını sunar. Amazon Web Hizmetleri segmenti, yeni kurulan şirketler, işletmeler, devlet kurumları ve akademik kurumlar için bilgi işlem, depolama, veritabanı ve AWS hizmet tekliflerinin küresel satışını içerir. Şirket, Temmuz 1994'te Jeffrey P. Bezos tarafından kuruldu ve merkezi Seattle, WA'da bulunuyor. İlgili hisseler Amazon 1 saatlik AnalizFiyat, Ichimoku bulutunun altında işlem görmekte ve bu durum düşüş trendinin devam ettiğini gösteriyor. Tenkan-Sen ve Kijun-Sen şu anda aşağıya doğru hareket ediyor ve bu da daha fazla düşüş sinyali veriyor. Bulutun üst kısmı kırmızı, alt kısmı yeşil olduğu için düşüş trendi güçlenmiş durumda. F Perakendenin Geleceği: Gelir Artışı, Tüketici Güveni ve AIYapay zeka perakende sektöründe en hızlı değişimi yaratacak alanlardan biri son yedi yılda albertsons kroger walmart ve costco gibi zincirlerin gelirleri yaklaşık yüzde kırk arttı. Amazon perakende ve teknoloji bölümü sebebiyle daha fazla arttı. Yapay zekanın devreye girmesi stok kontrolü kasa işle Amazon'un Yaklaşan Bilançosu ve Piyasa Analizi Merhaba arkadaşlar, bugün sizlerle Amazon (AMZN) hissesini masaya yatırıyoruz. 30 Ekim 2025'te, yani önümüzdeki hafta, Amazon'un üçüncü çeyrek bilançosu açıklanacak – bu, piyasalar için büyük bir olay çünkü şirketin performansı hem e-ticaret hem de bulut bilişim sektörlerini doğrudan etkiliyor. Bu a AMAZON HAFTALIK TEKNİK ANALİZA. Teknik Analiz 2023 Ocak ve Ekim aylarında oluşan fiyat hareketleri, yukarı yönlü bir trend (TREND1) oluşturmuştur. 2025 Ocak ayında gerçekleşen satışlarla bu trend kısa süreliğine kırılmış gibi görünse de, fiyat hareketi 144 haftalık üssel hareketli ortalamadan destek alarak yeni bir yükseliş ha Amazon 200 MA Üzeri Tutunmaya Çalışıyor, Hedef 250 mi?Amazon (AMZN), kritik bir karar bölgesinde satış baskısıyla karşılaşıyor. 215–225 dolar aralığı güçlü direnç bölgesi olarak izleniyor. 225 dolar üzerinde haftalık kapanışlarla kalıcılık sağlanabilirse, fiyatın 250 dolar seviyesine doğru yükselme potansiyeli artar. 200 dolar üzerindeki hareketlerin d AMZNAmazon'un operasyonel kâr marjları, geçmişte hem lojistik maliyetler hem de genişlemeye yönelik yatırımlar nedeniyle baskı altındaydı. Ancak AWS'nin yüksek marjları ve dijital reklam gelirlerinin artması, toplam kârlılığı destekliyor. Şirketin net kâr oranı, piyasa beklentilerini genellikle etkileye Amazon Hissesi Dipten Al Kar Toplayarak SatAmazon (AMZN) hissesi üzerinde 2020 yılından itibaren mum trendlerini takip ederek arka arkaya düşüşlerden sonra dipten alım, sonrasında ise arka arkaya belirli oranda yükselişlerde veya hedef kademeli %kar al seviyeslerinde satım yaparak oluşturduğumuz algoritmik trade stratejisinin detaylarını pay Tüm Fikirleri Gör Göstergelerin neye işaret ettiğinin özetlenmesi. Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Profesyonel derecelendirmelerin toplu görünümü. Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Nötr SatAl Güçlü satGüçlü al Güçlü satSatNötrAlGüçlü al Tekrarlanan trendleri belirlemek için bir sembolün önceki yıllardaki fiyat hareketlerini görüntüler. AMZN6237342 Amazon.com, Inc. 5.55% 20-NOV-2065Yield to maturity 5,79% Maturity date 20 Kas 2065 AMZN5396185 Amazon.com, Inc. 4.1% 13-APR-2062Yield to maturity 5,68% Maturity date 13 Nis 2062 AMZN6237344 Amazon.com, Inc. 5.45% 20-NOV-2055Yield to maturity 5,66% Maturity date 20 Kas 2055 AMZN5182960 Amazon.com, Inc. 3.25% 12-MAY-2061Yield to maturity 5,65% Maturity date 12 May 2061 AMZN4531868 Amazon.com, Inc. 4.25% 22-AUG-2057Yield to maturity 5,63% Maturity date 22 Ağu 2057 AMZN5182959 Amazon.com, Inc. 3.1% 12-MAY-2051Yield to maturity 5,60% Maturity date 12 May 2051 AMZN5396184 Amazon.com, Inc. 3.95% 13-APR-2052Yield to maturity 5,59% Maturity date 13 Nis 2052 AMZN4996700 Amazon.com, Inc. 2.5% 03-JUN-2050Yield to maturity 5,58% Maturity date 3 Haz 2050 AMZN4531866 Amazon.com, Inc. 4.05% 22-AUG-2047Yield to maturity 5,55% Maturity date 22 Ağu 2047 AMZN4996701 Amazon.com, Inc. 2.7% 03-JUN-2060Yield to maturity 5,49% Maturity date 3 Haz 2060 US23135AQ9 Amazon.com, Inc. 4.95% 05-DEC-2044Yield to maturity 5,33% Maturity date 5 Ara 2044 Tüm AMZN tahvillerini görün VTI Vanguard Total Stock Market ETFWeight 3,38% Market value 69,76 B USD VOO Vanguard S&P 500 ETFWeight 3,83% Market value 56,85 B USD IVV iShares Core S&P 500 ETFWeight 3,92% Market value 29,87 B USD SPY State Street SPDR S&P 500 ETFWeight 3,93% Market value 27,67 B USD QQQ Invesco QQQ Trust Series IWeight 4,93% Market value 20,06 B USD VUG Vanguard Growth ETFWeight 4,57% Market value 16,14 B USD IWF iShares Russell 1000 Growth ETFWeight 4,82% Market value 5,69 B USD XLY State Street Consumer Discretionary Select Sector SPDR ETFWeight 23,40% Market value 5,58 B USD 0A3D iShares Core S&P 500 UCITS ETFWeight 3,93% Market value 5,47 B USD GSPX iShares Core S&P 500 UCITS ETFWeight 3,93% Market value 5,47 B USD CSPX iShares Core S&P 500 UCITS ETFWeight 3,93% Market value 5,47 B USD Daha fazla BYF keşfedin Sıkça Sorulan Sorular AMZN mevcut fiyatı 232,99 USD — son 24 saatte −2,49% düştü. Amazon.com, Inc. hisse senedi fiyat performansını grafik üzerinde daha yakından izleyin. Borsaya bağlı olarak hisse senedi kodu değişebilir. Örneğin, NASDAQ borsasında Amazon.com, Inc. hisse senetleri AMZN sembolü altında işlem görür. AMZN hisse senedi bir önceki haftaya göre −5,55% oranında düştü, aylık değişim 1,68 % artışıdır, geçen yıl Amazon.com, Inc. −2,52 % düşüş göstermiştir. Analistlerin Amazon.com, Inc. gelecek fiyatı hakkındaki görüşlerini topladık: onlara göre, AMZN fiyatının maksimum tahmini 360,00 USD ve minimum tahmini 230,00 USD. AMZN grafiğini izleyin ve daha ayrıntılı bir Amazon.com, Inc. hisse senedi tahmini okuyun: analistlerin Amazon.com, Inc. hakkında ne düşündüğünü ve hisseleriyle ne yapmanızı önerdiğini görün. AMZN, 3 Kas 2025 tarihinde 258,60 USD fiyatıyla tüm zamanların en yüksek seviyesine ulaştı ve tüm zamanların en düşük seviyesi 0,07 USD olup 22 May 1997 tarihinde gerçekleşti. Daha fazla fiyat dinamiğini AMZN grafiğinde görüntüleyin. Diğer hisselerin en yüksek ve en düşük fiyatlarına ulaştığını görün. Diğer hisselerin en yüksek ve en düşük fiyatlarına ulaştığını görün. AMZN hisse senedi 3,04% volatil durumda ve 1,47 beta katsayısına sahiptir. Amazon.com, Inc. hisse senedi fiyatını grafik üzerinde takip edin ve en oynak hisse senetleri listesine göz atın — Amazon.com, Inc. orada mı? Bugün Amazon.com, Inc., 2,55 T piyasa değerine sahiptir ve geçen hafta boyunca 1,07% oranında artmıştır. Evet, Amazon.com, Inc. finansallarını yıllık ve üç aylık raporlarda doğrudan TradingView üzerinden takip edebilirsiniz. Amazon.com, Inc. bir sonraki kazanç raporunu şu tarihte yayınlayacak 5 Şub 2026. Yaklaşan etkinlikleri takip etmek için Kazanç Takvimi. Son çeyrek için AMZN kazançları hisse başına 1,95 USD iken, tahmin 1,57 USD olup 24,34% sürpriz ile sonuçlanmıştır. Gelecek çeyrek için tahmini kazanç hisse başına 1,97 USD şeklindedir. Daha fazla ayrıntı için Amazon.com, Inc. kazanç değerleri. Son çeyrek için Amazon.com, Inc. geliri 180,17 B USD tutarındadır, tahmin edilen 177,91 B USD rakamına rağmen. Gelecek çeyrekte gelirin 211,44 B USD değerine ulaşması beklenmektedir. Son çeyrek için AMZN net gelir 21,19 B USD iken, ondan önceki çeyrekte 18,16 B USD net gelir 16,64% değişim gösterdi. Resmin tamamını görmek için daha fazla Amazon.com, Inc. finansal istatistikleri takip edin. Hayır, AMZN hissedarlarına herhangi bir temettü ödemiyor. Ancak endişelenmeyin, sizin için yüksek temettü ödeyen hisse senetlerinin bir listesini hazırladık. Şirketin 5 Şub 2026 itibariyle 1,56 M çalışanı bulunmaktadır. en büyük çalışanlar sıralamamıza bakın — Amazon.com, Inc. bu listede mi? FAVÖK bir şirketin işletme performansını ölçer, büyümesi bir şirketin verimliliğinde bir iyileşme anlamına gelir. Amazon.com, Inc. FAVÖK 141,68 B USD, ve mevcut FAVÖK marjı ise 19,15%. Daha fazla istatistik için Amazon.com, Inc. mali̇ tablolar . Diğer hisse senetleri gibi, AMZN hisseleri de Nasdaq, Nyse, Euronext gibi borsalarda işlem görür ve bunları satın almanın en kolay yolu çevrimiçi bir hisse senedi komisyoncusudur. Bunu yapmak için bir hesap açmanız ve bir komisyoncunun prosedürlerini izlemeniz, ardından işleme başlamanız gerekir. Doğrudan TradingView grafiklerinden Amazon.com, Inc. hisse senedi işlemi yapabilirsiniz — aracı kurum'inizi seçin ve hesabınıza bağlanın. Hisse senetlerine yatırım yapmak kapsamlı bir araştırma gerektirir: Şirketin finansalları, ilgili haberler ve teknik analizi gibi mevcut tüm verileri dikkatlice incelemelisiniz. Yani Amazon.com, Inc. teknik analizi bugün satışı gösteriyor, ve 1 haftalık derecelendirmesi satın al değeridir. Piyasa koşulları değişmeye eğilimli olduğundan, biraz daha geleceğe bakmakta fayda var — 1 aylık derecelendirmeye göre Amazon.com, Inc. hisse senedi al sinyalini gösterir. Daha kapsamlı bir analiz için daha fazla Amazon.com, Inc. teknikler bölümüne bakın. Hala emin değilseniz, küratörlü izleme listelerimizde ilham aramayı deneyin. Hala emin değilseniz, küratörlü izleme listelerimizde ilham aramayı deneyin."
}