{
  "url": "https://www.horizonblue.com/shbp/plans/medical-plans/local-government-employee-plans/nj-direct-3",
  "title": "NJ DIRECT - SHBP/SEHBP",
  "text": "NJ DIRECT Check with your employer to find out if all these plans are available to you. All of our PPO plans include: - Care in network or out of network in New Jersey, nationwide and abroad - No need to select a Primary Care Physician (PCP) - No referrals necessary to see a specialist - Lower out-of-pocket costs when using the Horizon Managed Care Network or the BlueCard® PPO Network nationwide and Blue Cross Blue Shield Global® Core abroad NJ DIRECT is available to employees hired prior to 7/1/2019. NJ DIRECT2019 is available to new hires on or after 7/1/2019. NJ DIRECT HDLow and NJ DIRECT HDHigh are High Deductible Health Plans (HDHPs) that combine a high deductible health plan with a health savings account (HSA). Eligible preventive services are covered at 100% if in network and do not have a deductible. You are responsible for eligible medical and prescription expenses, up to the deductible. NJ DIRECT HDLow plan includes $300 Health Savings Account funding by employer. IN-NETWORK (IN): Service Area Available Nationwide IN-NETWORK (IN): Specialist Referral IN-NETWORK (IN): Deductible Deductible applies to all services that require a coinsurance. IN-NETWORK (IN): Coinsurance ¹On select services (durable medical equipment, prosthetics, orthotics, oxygen, private duty nursing, ambulance). ²Includes eligible prescription cost share. IN-NETWORK (IN): Total Out-of-Pocket Maximum (Copay+Deductible+Coinsurance) *Includes eligible prescription cost share. HEALTH CARE SERVICES: Horizon CareOnline (Telemedicine) Cost share may apply DIAGNOSTIC LABORATORY/RADIOLOGY/ADVANCED IMAGING Laboratory services must be rendered by one of the following preferred laboratory network providers (with certain specific exceptions as allowed by Horizon): EMERGENCY/URGENT MEDICAL SERVICES Lower copayment applies to children under 19 and physician referrals. OUT-OF-NETWORK (OON): Deductible Out-of-network cost basis: NJ DIRECT and NJ DIRECT2019: 175% of CMS (Centers for Medicare & Medicaid Services) fee schedule. 90th percentile of FAIR Health national for all other health plans with an out-of-network benefit. All plans with an out-of-network benefit also have specified dollar limits for out-of-network chiropractic ($35), physical therapy ($52) and acupuncture ($60). This document is for informational purposes only and does not constitute a binding agreement. The information provided by this document is not intended to replace or modify the terms, conditions, limitations and exclusions contained within health, dental or vision benefit plans issued or administered by Horizon BCBSNJ. In the event of a conflict between the information contained in this document and your plan documents, your plan documents shall control. Retirees: Please visit state.nj.us/treasury/pensions for information regarding available retiree plans. This is not a complete list of all covered services. Exclusions and limitations apply to some services. Visit state.nj.us/treasury/pensions/member-guidebooks.shtml for more information."
}