{
  "url": "https://support.microsoft.com/en-us/windows/pair-a-bluetooth-device-in-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
  "title": "Pair a Bluetooth device in Windows - Microsoft Support",
  "text": "Pair a Bluetooth device in Windows Applies To All kinds of Bluetooth devices can be paired with a Windows device including: - Keyboards and mice. - Phones. - Speakers and headphones. - Printers and scanners. - Many more types of devices. To pair a Bluetooth device with Windows, the Windows device needs to have Bluetooth. Most Windows devices already have Bluetooth built in. If a Windows device doesn't have Bluetooth, a USB Bluetooth adapter can be plugged into a USB port on the Windows device to add Bluetooth. Before starting, make sure that the Windows 11 device supports Bluetooth. For more info on how to check, see Fix Bluetooth problems in Windows. For help with adding non-Bluetooth devices, see Add a hardware device to a Windows device. Having trouble playing the video? Watch it on YouTube. After checking that the Windows device supports Bluetooth, Bluetooth needs to be turned on. Here's how: In Settings app: To turn on Bluetooth in the Settings app: - On the Windows device, select Start and then select Settings > Bluetooth & devices .Open Bluetooth & devices Or Select the following Bluetooth & devices shortcut: - In the Bluetooth & devices window, next to Bluetooth, make sure Bluetooth is switched On. In quick settings: To find the quick setting for Bluetooth: - Select the Network , Sound , or Battery icon next to the time and date. - Select the Bluetooth tile to toggle Bluetooth on and off. - If Bluetooth is turned off, the tile isn't highlighted and might say Off. - If Bluetooth is turned on, the tile is highlighted and either says Connected, Not connected, or shows the device it's connected to via Bluetooth. - Important: The Bluetooth action might need to be added if it isn't visible in quick settings. For more info, see Notifications and Do Not Disturb in Windows. - Turn on the Bluetooth device and make it discoverable. The way to make the Bluetooth device discoverable depends on the device. To learn how to make the Bluetooth device discoverable, check the device's documentation or visit the manufacturer's website. - On the Windows device, select the Network , Sound , or Battery icon next to the time and date on the taskbar. - Select the Manage Bluetooth devices chevron on the Bluetooth quick setting, then select the device under New devices. You might need to scroll through Your devices for New devices to become available. - Follow additional instructions if they appear, then select Done. When Bluetooth is turned on, the Bluetooth device and the Windows device automatically connect anytime the two devices are in range of each other. Tip: If the Bluetooth device isn't displayed in the list, the Bluetooth devices discovery setting might need to be set to Advanced. To learn how, see Fix Bluetooth problems in Windows. - Turn on the Bluetooth printer or scanner and make it discoverable. The way to make a Bluetooth printer or scanner discoverable depends on the device. To learn how to make the Bluetooth printer or scanner discoverable, check the device's documentation or visit the manufacturer's website. - On the Windows device, select Start and then select Settings > Bluetooth & devices > Printers & scanners .Open Bluetooth & Devices > Printers & scanners Or Select the following Bluetooth & devices > Printers & scanners shortcut: - In the Bluetooth & devices > Printers & scanners window, next to Add a printer or scanner, select the Add device button. - Windows searches for and then displays any local printers or scanners it finds. This process might take a few minutes. - Once the printers or scanners are found, select the Add device button next to the desired printer or scanner. If there are problems installing a printer or scanner, see either Fix printer problems or Install and use a scanner in Windows. Swift Pair in Windows allows a supported Bluetooth device to be quickly paired with a Windows device. If the Bluetooth device supports Swift Pair, a notification is displayed in Windows when: - The Bluetooth device is nearby. - It's in pairing mode and discoverable. - Turn on a Bluetooth device that supports Swift Pair and make it discoverable. The way to make the Bluetooth device discoverable depends on the device. To learn how to make the Bluetooth device discoverable, check the device's documentation or visit the manufacturer's website. - If it's the device's first time using Swift Pair, a notification appears asking to allow the use of Swift Pair. Select Yes to use Swift Pair. - When a notification appears that a new Bluetooth device was found, select Connect. Support for Windows 10 has ended on October 14, 2025 After October 14, 2025, Microsoft will no longer provide free software updates from Windows Update, technical assistance, or security fixes for Windows 10. Your PC will still work, but we recommend moving to Windows 11. Before starting, make sure that the Windows 10 device supports Bluetooth. For more info on how to check, see Fix Bluetooth problems in Windows 10. For help with adding non-Bluetooth devices, see Add a hardware device to a Windows device. After checking that the Windows device supports Bluetooth, Bluetooth needs to be turned on. Here's how: In Settings: To turn on Bluetooth in Settings: - On the Windows device, select Start and then select Settings > Devices .Open Bluetooth & other devices Or Select the following Bluetooth & other devices shortcut: - In the Bluetooth & other devices window, under Bluetooth, make sure Bluetooth is switched On. In action center: Action center ( or ) can be found next to the time and date on the taskbar. - On the taskbar, select the action center icon ( or ). - Select the Bluetooth tile to toggle Bluetooth on and off. If the Bluetooth tile isn't visible, select Expand above the tiles. - If Bluetooth is turned off, the tile isn't highlighted and might say Off. - If Bluetooth is turned on, the tile is highlighted and says Connected, Not connected, or shows the device it's connected to via Bluetooth. - If the Bluetooth tile isn't in action center even after selecting Expand, follow these steps to add it: - On the Windows device, select Start and then select Settings > System > Notifications & actions .Open Notifications & actions Or Select the following Notifications & actions shortcut: - In the Notifications & actions window, under Quick actions, select Edit your quick actions. - In the side pane that opens, select Add and then select Bluetooth . - If desired, arrange the newly added Bluetooth tile to its desired location. Note: For more info about how to change the apps and settings that appear in action center, see Change notification and quick settings in Windows. - Turn on the Bluetooth device and make it discoverable. The way to make the Bluetooth device discoverable depends on the device. To learn how to make the Bluetooth device discoverable, check the device's documentation or visit the manufacturer's website. - On the Windows device, select Start and then select Settings > Devices > Bluetooth & other devices .Open Bluetooth & other devices Or Select the following Bluetooth & other devices shortcut: - In the Bluetooth & other devices window, select Add Bluetooth or other device. - In the Add a device window that appears, select Bluetooth. - Windows populates the Add a device window with the currently discoverable Bluetooth devices. Select the desired Bluetooth device and follow any additional instructions if they appear. - Once the Bluetooth device is paired successfully, select the Done button. When Bluetooth is turned on, the Bluetooth device and the Windows device automatically connect anytime the two devices are in range of each other. Note: If the Bluetooth device isn't visible, see the article Fix Bluetooth problems in Windows to try to resolve the problem. - Turn on the Bluetooth printer or scanner and make it discoverable. The way to make the Bluetooth printer or scanner discoverable depends on the device. To learn how to make the Bluetooth printer or scanner discoverable, check the device's documentation or visit the manufacturer's website. - On the Windows device, select Start and then select Settings > Devices > Printers & scanners .Open Printers & scanners Or Select the following Printers & scanners shortcut: - In the Printers & scanners window, under Add printers or scanners, select the Add a printer or scanner . - Windows searches for and then displays any local printers or scanners it finds. This process might take a few minutes. - Once the printers or scanners are found, select the desired printer or scanner, and then select the Add device button. For installation issues with printers or scanners, see either Fix printer problems or Install and use a scanner in Windows 10. Swift Pair in Windows allows a supported Bluetooth device to be quickly paired with a Windows device. If the Bluetooth device supports Swift Pair, a notification is displayed in Windows when: - The Bluetooth device is nearby. - It's in pairing mode and discoverable. - Turn on the Bluetooth device that supports Swift Pair and make it discoverable. The way to make the Bluetooth device discoverable depends on the device. To learn how to make the Bluetooth device discoverable, check the device's documentation or visit the manufacturer's website. - If it's the device's first time using Swift Pair, a notification appears asking to allow the use of Swift Pair. Select Yes to use Swift Pair. - When a notification appears that a new Bluetooth device was found, select Connect. - After the Bluetooth device connects, select Close. Tip: If you're a small business owner looking for more information on how to get Microsoft 365 set up, visit Small business help & learning."
}