{
  "url": "https://en.wikipedia.org/wiki/Prince_(musician)",
  "title": "Prince (musician) - Wikipedia",
  "text": "Prince (musician) Prince Rogers Nelson (June 7, 1958 – April 21, 2016) was an American singer, songwriter, musician, dancer, and actor. Often credited as an influence on music and one of the greatest musicians of his era, he pioneered the Minneapolis sound and was influential in the evolution of various other genres of music.[7] Born and raised in Minneapolis, Minnesota, Prince signed a record deal with Warner Bros. Records at the age of 18, releasing his first album, For You, two years later. He went on to achieve critical success with his albums Dirty Mind (1980), Controversy (1981), and 1999 (1982). In 1984, Prince became the first singer to simultaneously have a number-one film, album and single in the United States, with Purple Rain, its soundtrack, and \"When Doves Cry\" respectively, the latter being the biggest hit single of the year. The album, recorded with his new backing band the Revolution, spent six consecutive months atop the United States Billboard 200 chart[8] and won the Academy Award for Best Original Song Score. After disbanding the Revolution, Prince released his first double LP in 1987, titled Sign o' the Times, widely lauded by critics as the greatest work of his career and one of the greatest records in music history. In 1993, in the midst of a contractual dispute with Warner Bros., Prince changed his stage name to the unpronounceable symbol , known to fans as the \"Love Symbol\".[a] After signing a contract with Arista Records in 1998, Prince reverted to his original name in 2000 and continued releasing albums, including the double Grammy Award winning Musicology (2004). He was a prolific musician who released 39 albums during his life, with a vast array of unreleased material.[9] On April 21, 2016, at the age of 57, Prince died after accidentally overdosing on counterfeit hydrocodone/paracetamol pills laced with fentanyl at his Paisley Park home and recording studio in Chanhassen, Minnesota. Prince has sold more than 100 million records worldwide, making him one of the best-selling music artists of all time. His awards include the Grammy President's Merit Award, the American Music Awards for Achievement and of Merit, the Billboard Icon Award, an Academy Award, and a Golden Globe Award. He was inducted into the Rock and Roll Hall of Fame in 2004, the Rhythm and Blues Music Hall of Fame in 2016, the Songwriters Hall of Fame in 2024, and twice into the Black Music & Entertainment Walk of Fame in 2022. Early life Prince Rogers Nelson was born at Mount Sinai Hospital in Minneapolis, Minnesota on June 7, 1958, to jazz singer Mattie Della (née Shaw) and pianist and songwriter John Lewis Nelson.[10][11] All four of his grandparents were from Louisiana.[12] The jazz drummer Louis Hayes was his paternal cousin.[13] Prince was named after his father's most popular stage name, Prince Rogers, which was used while performing with Della in a jazz group named the Prince Rogers Trio.[14] In 1991, Prince's father told A Current Affair that he named his son \"Prince\" because he wanted Prince \"to do everything I wanted to do\".[15] During his childhood, Prince was not fond of his name and used \"Skipper\" instead.[14][16][17] Prince said he was \"born epileptic\" and had seizures when he was young. He stated, \"My mother told me one day I walked in to her and said, 'Mom, I'm not going to be sick anymore,' and she said, 'Why?' and I said, 'Because an angel told me so.'\"[18] Prince's younger sister, Tyka, was born on May 18, 1960.[19][20] Both siblings developed a keen interest in music, which was encouraged by their father.[21] His parents were both members of the Seventh-day Adventist Church, a Protestant denomination.[22] In 2022, during a Minneapolis teachers' strike, Minneapolis–Saint Paul news station WCCO-TV was researching a previous teacher's strike in April 1970 and accidentally uncovered an interview they had done with Prince about that strike. Prince, who was 11 years old at the time, said about the strike, \"I think they should get a better education too cause, um, and I think they should get some more money cause they work, they be working extra hours for us and all that stuff.\" While he never identifies himself in the interview, it was confirmed to be him through interviews with a historian in Minneapolis, as well as by a former classmate who was a member of Prince's first band. The video is one of few videos from his childhood.[23] Prince wrote his first song, titled \"Funk Machine\", on his father's piano when he was seven years old.[21] When he was ten, his parents divorced. His mother remarried Hayward Baker, with whom she had a son named Omarr. Prince had a fraught relationship with Omarr, to the extent that it caused him to repeatedly switch homes, sometimes living with his father and sometimes with his mother and stepfather.[21][24] Baker took Prince to see James Brown in concert, with Prince crediting Baker with improving the family's finances. After a brief period of living with his father, who bought him his first guitar, Prince moved into the basement of the Anderson family, who were his neighbors, after his father threw him out.[25] He befriended the Andersons' son, André Cymone, who later collaborated with Prince.[26] Prince briefly attended Minneapolis's Bryant Junior High,[27] after which he moved to Central High School where he played football, basketball, and baseball. He played on Central's junior varsity basketball team, and continued to recreationally play basketball as an adult.[27][28] He was trained in classical ballet at the Minnesota Dance Theatre through the Urban Arts Program of Minneapolis Public Schools.[29] Prince became an advocate for dancers, and used his wealth to save the failing Joffrey Ballet in Chicago during the 1990s.[30][31] He met songwriter and producer Jimmy Jam in 1973 and impressed Jam with his musical talent, early mastery of a wide range of instruments, and work ethic.[32] Career 1975–1980: Beginnings and breakthrough In 1975, Pepe Willie, the husband of one of Prince's cousins, formed the band 94 East with Marcy Ingvoldstad and Kristie Lazenberry, hiring André Cymone and Prince to record tracks.[33][34] Willie wrote the songs, with Prince contributing guitar tracks, both of them co-writing the 94 East song, \"Just Another Sucker\".[35] The band recorded tracks which later appeared in the album Minneapolis Genius – The Historic 1977 Recordings.[35] In 1976, shortly after graduating from Central High School, Prince created a demo tape with producer Chris Moon, in Moon's Minneapolis studio.[36] Unable to secure a recording contract, Moon brought the tape to Owen Husney, a Minneapolis businessman. Husney signed Prince, then aged 19, to a management contract, and helped him create a demo at Sound 80 Studios in Minneapolis, with producer/engineer David Z.[37][38] The demo recording, along with a press kit produced at Husney's ad agency, resulted in interest from several record companies, including Warner Bros. Records, A&M Records, and Columbia Records.[39] With the help of Husney, Prince signed a recording contract with Warner Bros. Records in 1977.[40] The record company agreed to give Prince creative control for three albums and retain his publishing rights.[41][42] Husney and Prince then left Minneapolis and moved to Sausalito, California, where Prince's first album, For You, was recorded at Record Plant Studios. The album was mixed in Los Angeles and released on April 7, 1978.[43] According to the For You album notes, Prince wrote, produced, arranged, composed, and played all 27 instruments on the recording, except for the song \"Soft and Wet\", whose lyrics were co-written by Moon. The cost of recording the album was twice Prince's initial advance. Prince used the Prince's Music Co. to publish his songs. In the United States, \"Soft and Wet\" reached No. 12 on the Hot Soul Singles chart and No. 92 on the Billboard Hot 100. The song \"Just as Long as We’re Together\" reached No. 91 on the Hot Soul Singles chart.[44] Around this time, a side enterprise that Prince began to pursue involved a then-teenage singer Sue Ann Carwell, whose career as a solo artist he hoped to mold after hearing her talented performance on the Minneapolis R&B scene. However, Carwell resisted his suggestion that she use the name \"Susie Stone\".[45][46] Recordings he had been working on with her for a projected 1978 album, including \"I'm Saving It Up\", \"Make It Through the Storm\", \"Since We've Been Together\" and \"Wouldn't You Love To Love Me?\", went unreleased.[47][48] Carwell was subsequently signed by Warner Bros. Records.[47] In 1979, Prince created a band with André Cymone on bass, Dez Dickerson on guitar, Gayle Chapman and Doctor Fink on keyboards, and Bobby Z. on drums. Their first show was at the Capri Theater on January 5, 1979. Warner Bros. executives attended the show but decided that Prince and the band needed more time to develop his music.[49][page needed] In October 1979, Prince released the album Prince, which reached No. 4 on the Billboard Top R&B/Black Albums charts and No. 22 on the Billboard 200, and went platinum. It contained two R&B hits: \"Why You Wanna Treat Me So Bad?\" and \"I Wanna Be Your Lover\", which sold more than a million copies, and reached No. 11 on the Billboard Hot 100 and stayed at No. 1 for two weeks on the Hot Soul Singles chart. Prince performed both songs on January 26, 1980, on American Bandstand.[50] 1980–1983: Dirty Mind, Controversy and 1999 In 1980, Prince released the album Dirty Mind, which contained sexually explicit material, including the songs, \"Head\" and \"Sister\", and was described by Stephen Thomas Erlewine as a \"stunning, audacious amalgam of funk, new wave, R&B, and pop, fueled by grinningly salacious sex and the desire to shock\".[51] Recorded in Prince's studio, this album was certified gold, with the single \"Uptown\" reaching No. 5 on the Billboard Dance chart and No. 5 on the Hot Soul Singles chart. Prince was also the opening act for Rick James' 1980 Fire It Up tour.[52] In February 1981, Prince made his first appearance on Saturday Night Live, performing \"Partyup\". In October 1981, Prince released the album Controversy. He played several dates in support of it, as the first of three opening acts for the Rolling Stones, on their United States tour. In Los Angeles, Prince, who appeared in a trench coat and black bikini briefs, was forced off the stage after just three songs by audience members throwing trash at him.[53][54] The songs on Controversy were published by Controversy Music[55] – ASCAP, a practice he continued until the Emancipation album in 1996. Controversy also marked the introduction of Prince's use of abbreviated spelling, such as writing the words \"you\" as \"U\", \"to\" as \"2\", and \"for\" as \"4\"; by 2002, MTV News noted that \"now all of his titles, liner notes, and Web postings are written in his own shorthand spelling, as seen on 1999's Rave Un2 the Joy Fantastic, which featured 'Hot Wit U.'\"[56] In 1981, Prince formed a side project band called The Time. The band released four albums between 1981 and 1990, with Prince writing and performing most of the instrumentation and backing vocals—sometimes being credited under the pseudonyms \"Jamie Starr\" or \"The Starr Company\"—with lead vocals by Morris Day.[57][58] In late 1982, Prince released a double album, 1999, which sold more than four million copies.[59][60] The title track was a protest against nuclear proliferation and became Prince's first top 10 hit in countries outside the United States. Prince's \"Little Red Corvette\" was one of the first two videos by black artists—along with Michael Jackson's \"Billie Jean\"—played in heavy rotation on MTV, which had been perceived as against \"black music\" until CBS President Walter Yetnikoff threatened to pull all CBS videos.[61][62] Prince and Jackson had a competitive rivalry which lasted for many years.[63] The song \"Delirious\" also placed in the top ten on the Billboard Hot 100 chart. \"International Lover\" earned Prince his first Grammy Award nomination at the 26th Annual Grammy Awards.[64] 1984–1987: Purple Rain, Around the World in a Day and Parade Starting with the release of 1999, the backing band for Prince would be referred to as the Revolution.[65][66] The band's name was printed in reverse on the cover of 1999 inside the letter \"I\" of the word \"Prince\".[67] The band consisted of Lisa Coleman and Doctor Fink on keyboards, Bobby Z. on drums, Brown Mark on bass, and Dez Dickerson on guitar. Jill Jones, a backing singer, was also part of the lineup for the 1999 album and tour.[67] Following the tour, Dickerson left the group for religious reasons.[68] In the book Possessed: The Rise and Fall of Prince (2003), author Alex Hahn says that Dickerson was reluctant to sign a three-year contract and wanted to pursue other musical ventures. Dickerson was replaced by Coleman's friend Wendy Melvoin.[65] At first, the band was used sparsely in the studio, but this gradually changed during 1983.[67][68][69] According to his former manager Bob Cavallo, in the early 1980s, Prince required his management to obtain a deal for him to star in a major motion picture, even though his exposure at that point was limited to several pop and R&B hits, music videos and occasional TV performances. In 1984, this resulted in the hit film Purple Rain—which starred Prince and was loosely autobiographical—and the eponymous studio album, which was also the soundtrack to the film.[66] The Purple Rain album sold more than 13 million copies in the United States and spent 24 consecutive weeks at No. 1 on the Billboard 200 chart. The film won Prince an Academy Award for Best Original Song Score[70] and grossed more than $68 million in the US,[71][72] or $206 million in 2024 dollars.[73] It is regarded as one of the greatest musical films.[74][75] Songs from the film were hits on pop charts around the world; \"When Doves Cry\" and \"Let's Go Crazy\" reached No. 1 on the Billboard Hot 100, with the title track reaching No. 2.[76] At one point in 1984, Prince simultaneously had the No. 1 album, single, and film in the United States,[77] being the first singer to achieve this feat.[78] The Purple Rain album is ranked 8th in Rolling Stone's \"500 Greatest Albums of All Time\",[79] and is also included on the list of Time's All-Time 100 Albums.[80] The album also produced two of Prince's first three Grammy Awards earned at the 27th Annual Grammy Awards: Best Rock Performance by a Duo or Group with Vocal, and Best Score Soundtrack for Visual Media.[64] In 1984, pop artist Andy Warhol created the painting Orange Prince. Warhol was fascinated by Prince and ultimately created a total of twelve unique paintings of him in different colorways, all of which were kept in Warhol's personal collection.[81] Four of these paintings are now in the collection of The Andy Warhol Museum in Pittsburgh. In November 1984, Vanity Fair published Warhol's portrait to accompany the article Purple Fame[82] by Tristan Fox, and claimed that Warhol's silkscreen image of Prince with its pop colors captured the recording artist \"at the height of his powers\". After Tipper Gore heard her 11-year-old daughter Karenna listening to Prince's song \"Darling Nikki\", which gained wide notoriety for its sexual lyrics and a reference to masturbation, she founded the Parents Music Resource Center.[83] The center advocated the mandatory use of a warning label, now known as Parental Advisory, on the covers of records that have been judged to contain language or lyrical content unsuitable for minors. The recording industry later voluntarily complied with this request.[84] In 1985, Prince released Around the World in a Day, which held the No. 1 spot on the Billboard 200 for three weeks. From that album, the single \"Raspberry Beret\" reached No. 2 on the Billboard Hot 100, and \"Pop Life\" reached No. 7.[76] In 1986, his album Parade, the soundtrack for the movie Under the Cherry Moon released in the same year, reached No. 3 on the Billboard 200 and No. 2 on the R&B charts. The first single, \"Kiss\", with its video choreographed by Louis Falco, reached No. 1 on the Billboard Hot 100.[76] In the same year, the song \"Manic Monday\", written by Prince and recorded by the Bangles, reached No. 2 on the Hot 100 chart. Although the Parade album went platinum and sold two million copies,[85][86] the film received a Golden Raspberry Award for Worst Picture, tied with Howard the Duck, and Prince received Golden Raspberry Awards for Worst Director, Worst Actor, and Worst Original Song for the song \"Love or Money\".[87][88] Some critics later re-evaluated Under the Cherry Moon after Prince's death and declared it a cult classic, comparing it to films such as 8½, Casablanca and It Happened One Night.[89][90][91] In 1986, Prince began a series of live performances called the Parade Tour.[b] After the tour, Prince disbanded the Revolution and fired Wendy Melvoin and Lisa Coleman.[66] Brown Mark also quit the band, with only keyboardist Doctor Fink remaining. Following this, Miko Weaver, Atlanta Bliss, and Eric Leeds joined the band.[68] 1987–1989: Sign o' the Times and Lovesexy Before disbanding the Revolution, Prince was working on two separate projects, an album with The Revolution titled Dream Factory, and a solo album named Camille.[92] Unlike the three previous band albums, Dream Factory included input from the band members and featured songs with lead vocals by Wendy & Lisa.[92] The Camille project saw Prince create a new androgynous persona primarily singing in a sped-up, female-sounding voice. With the dismissal of the Revolution, Prince consolidated material from both shelved albums, along with other songs, into a three-LP album to be titled Crystal Ball.[93] Warner Bros. forced Prince to trim the triple album to a double album, releasing Sign o' the Times on March 31, 1987.[94] The album peaked at No. 6 on the Billboard 200 albums chart.[94] The first single, \"Sign o' the Times\", charted at No. 3 on the Hot 100.[95] The follow-up single, \"If I Was Your Girlfriend\", charted at No. 67 on the Hot 100 but reached No. 12 on R&B chart.[95] The third single, a duet with Sheena Easton, \"U Got the Look\", charted at No. 2 on the Hot 100 and No. 11 on the R&B chart,[95] and the final single, \"I Could Never Take the Place of Your Man\", charted at No. 10 on Hot 100 and No. 14 on the R&B chart.[95] It was named the top album of the year by the Pazz & Jop critics' poll and sold 3.2 million copies.[96] In Europe, it performed well, with Prince promoting the album with a lengthy tour. Putting together a new backing band from the remnants of the Revolution, Prince added bassist Levi Seacer Jr., keyboardist Boni Boyer, and dancer/choreographer Cat Glover[97] with drummer Sheila E.[98] and holdovers Miko Weaver, Doctor Fink, Eric Leeds, Atlanta Bliss, and the Bodyguards Wally Safford and Greg Brooks for the Sign o' the Times Tour.[99] The Sign o' the Times tour was a success overseas, with Warner Bros. and Prince's managers wanting to bring it to the United States to promote sales of the album.[100][101] Prince did not approve of a full United States tour, as he was ready to produce a new album.[100] As a compromise, the last two nights of the tour were filmed for release in movie theaters. The film quality was deemed subpar, and reshoots were performed at Prince's Paisley Park studios.[100] The film Sign o' the Times was released on November 20, 1987. The film got better reviews than Under the Cherry Moon, but its box-office receipts were minimal, and it quickly left theaters.[101] The next album intended for release was The Black Album.[102] More instrumental and funk- and R&B-themed than recent releases,[103] The Black Album also saw Prince experiment with hip hop on the songs \"Bob George\" and \"Dead on It\". Prince was set to release the album with a monochromatic black cover with only the catalog number printed, but after 500,000 copies had been pressed,[104] Prince had a spiritual epiphany that the album was \"evil\" and had it recalled.[105] Surviving vinyl copies of the album have sold for upwards of $10 thousand.[106] The Black Album was re-released in 1994. Prince went back in the studio for eight weeks and recorded Lovesexy. Released on May 10, 1988, Lovesexy serves as a spiritual opposite to the dark The Black Album.[107] Every song is a solo effort by Prince, except \"Eye No\", which was recorded with his backing band at the time. Lovesexy reached No. 11 on the Billboard 200 and No. 5 on the R&B albums chart.[108] The lead single, \"Alphabet St.\", peaked at No. 8 on the Hot 100 and No. 3 on the R&B chart,[94] selling 750,000 copies.[109] Prince again took his post-Revolution backing band, excluding the Bodyguards, on a three-leg, 84-show Lovesexy World Tour; although the shows were well-received by huge crowds, they failed to make a net profit due to the expensive sets and props.[110][111] 1989–1991: Batman and Graffiti Bridge In 1989, Prince appeared on Madonna's studio album Like a Prayer, co-writing and singing the duet \"Love Song\" and playing electric guitar without being credited on the songs \"Like a Prayer\", \"Keep It Together\", and \"Act of Contrition\". He also began work on several musical projects, including Rave Unto the Joy Fantastic and early drafts of his Graffiti Bridge film,[112][113] but both were put on hold when he was asked by Batman director Tim Burton to record several songs for the upcoming live-action adaptation. Prince went into the studio and produced an entire nine-track album that Warner Bros. released on June 20, 1989. Batman's soundtrack peaked at No. 1 on the Billboard 200,[114] selling 4.3 million copies.[115] The single \"Batdance\" topped the Billboard Hot 100 and R&B charts.[94] The single \"The Arms of Orion\", with Sheena Easton, charted at No. 36, and \"Partyman\" charted at No. 18 on the Hot 100 and at No. 5 on the R&B chart, while the love ballad \"Scandalous!\" went to No. 5 on the R&B chart.[94] Prince had to sign away all publishing rights to the songs on the album to Warner Bros. as part of the deal to do the soundtrack.[116] In 1990, Prince went back on tour with a revamped band for his back-to-basics Nude Tour. With the departures of Boni Boyer, Sheila E., the Horns, and Cat, Prince brought in keyboardist Rosie Gaines, drummer Michael Bland, and dancing trio the Game Boyz (Tony M., Kirky J., and Damon Dickson). The European and Japanese tour was a financial success with a short, greatest hits setlist.[117] In 1990, Prince finished production on his fourth film, Graffiti Bridge, and its soundtrack. Initially, Warner Bros. was reluctant to fund the film, but with Prince's assurances it would be a sequel to Purple Rain, as well as the involvement of the original members of the Time, the studio greenlit the project.[118] Released on August 20, 1990, the album reached No. 6 on the Billboard 200 and R&B albums chart.[119] The single \"Thieves in the Temple\" reached No. 6 on the Hot 100 and No. 1 on the R&B chart,[94] with \"Round and Round\" placing at No. 12 on the United States charts and No. 2 on the R&B charts. The song featured the teenage Tevin Campbell, who also had a role in the film, on lead vocals. The film, released on November 20, 1990, was a box-office flop, grossing $4.2 million.[120] Miko Weaver and Doctor Fink, the last remaining members of the Revolution, would leave Prince's band shortly after.[121] 1991–1996: Name change, Diamonds and Pearls and The Gold Experience 1991 began with a performance in Rock in Rio II,[122] marking the debut of Prince's new band, the New Power Generation. With guitarist Miko Weaver and long-time keyboardist Doctor Fink leaving, Prince added bass player Sonny T., keyboard player Tommy Barbarella, and a brass section known as the Hornheads to go along with Levi Seacer, who would be taking over on guitar, Rosie Gaines, Michael Bland, and the Game Boyz.[123] With significant input from his band members, Diamonds and Pearls was released on October 1, 1991. Reaching No. 3 on the Billboard 200 album chart,[124] Diamonds and Pearls saw four hit singles released in the United States. \"Gett Off\" peaked at No. 21 on the Hot 100 and No. 6 on the R&B charts, followed by \"Cream\", which gave Prince his fifth United States No. 1 single. The title track \"Diamonds and Pearls\" became the album's third single, reaching No. 3 on the Hot 100 and the top spot on the R&B charts. \"Money Don't Matter 2 Night\" peaked at No. 23 and No. 14 on the Hot 100 and R&B charts respectively.[125] Diamonds and Pearls would sell more than 2 million copies in the United States alone.[126] In 1992, following the success of Diamonds and Pearls, Prince renewed his contract with Warner Bros., agreeing to what was reportedly a $100 million deal to release six more albums with the label.[127] In October, Prince released his 14th studio album, named , being the second to feature the New Power Generation. It bore only an unpronounceable symbol on the cover, which would later be copyrighted as \"Love Symbol #2\", as its title;[128] the symbol was explained as being a combination of the symbols for male (♂) and female (♀). It was preceded by the releases of the singles \"Sexy MF\" and \"My Name Is Prince\", which reached No. 66 and No. 36 respectively on the Billboard Hot 100. The third single, \"7\" would peak at No. 7 on the Billboard Hot 100.[125] The album, later referred to as Love Symbol, peaked at No. 5 on the Billboard 200[129] and went on to sell 2.8 million copies worldwide, falling short of expectations.[130] In 1993, in rebellion against Warner Bros., which refused to release Prince's enormous backlog of music at a steady pace,[131][132] Prince formally adopted as his stage name.[128] To use the symbol in print media, Warner Bros. organized a mass mailing of floppy disks with a custom font.[133] At this time, Prince was often referred to as \"the Artist Formerly Known as Prince\" or \"the Artist\".[134] That same year, Warner Bros. released a greatest hits compilation with the three-disc The Hits/The B-Sides in 1993. The first two discs were also sold separately as The Hits 1 and The Hits 2. The collection features the majority of Prince's hit singles, and several previously hard-to-find recordings, including B-sides from across Prince's career and previously unreleased tracks such as the Revolution-recorded \"Power Fantastic\" and a live recording of \"Nothing Compares 2 U\" with Rosie Gaines. Two new songs, \"Pink Cashmere\" and \"Peach\", were chosen as promotional singles. In 1994, Warner Bros. allowed the single \"The Most Beautiful Girl in the World\" to be released via independent distributor Bellmark Records in February. The release reached No. 3 on the United States Billboard Hot 100 and No. 1 in many other countries. Prince began to release albums in quick succession as a means of releasing himself from his contractual obligations to Warner Bros. This led to the previously aborted Black Album being given a limited official release seven years after its initial recording. Prince pushed to have his next two albums, Come and The Gold Experience, released simultaneously. Warner Bros. accepted both albums, but delayed the release of The Gold Experience, fearing market saturation. In retaliation, Prince began making public appearances with \"slave\" written on his face.[54] The Gold Experience would not be released until September 1995. The album was not in print for a long period due to a plagiarism case relating to \"The Most Beautiful Girl in the World\", but the album was released on streaming platforms with Prince’s catalog in 2018, and reissued on CD and vinyl in 2022.[135] In 1996, the album Chaos and Disorder was released. Prince submitted another album titled The Vault: Old Friends 4 Sale to Warner Bros. that same year, completing his contract with the label. Although the album was not released until 1999, Warner Bros. agreed to release Prince from his contract now that he had delivered the promised number of albums to them.[citation needed] 1996–2000: Emancipation, Crystal Ball and Rave Un2 the Joy Fantastic Free of any further contractual obligations to Warner Bros., Prince attempted a major comeback later that year with the release of Emancipation, a 36-song, three-CD set, with each disc being exactly 60 minutes long. The album was released via his own label, named NPG Records, with distribution through EMI. Emancipation was certified Platinum by the RIAA. It is the first Prince record featuring covers of other artists' songs. Prince covered Joan Osborne's top ten hit song of 1995 \"One of Us\",[136] Thom Bell and Linda Creed's \"Betcha by Golly Wow!\",[137] James Allen Shamblin II and Michael Barry Reid's \"I Can't Make You Love Me\", [138] and Thom Bell and William Hart's \"La-La (Means I Love You)\".[139] Prince released Crystal Ball, a five-CD collection of unreleased material, in 1998. The distribution of this album was disorderly, with some fans pre-ordering the album on his website up to a year before it was shipped; these pre-orders were delivered months after the record had gone on sale in retail stores. The retail edition has only four discs, as it is missing the Kamasutra disc. There are also two different packaging editions for retail; one is a four-disc sized jewel case with a white cover and the Love Symbol in a colored circle, while the other contains all four discs in a round translucent snap jewel case. The discs are the same, as is the CD jacket. The Newpower Soul album was released three months later. His collaborations on Chaka Khan's Come 2 My House and Larry Graham's GCS2000, both released on the NPG label around the same time as Newpower Soul, were promoted by live appearances on Vibe with Sinbad and the NBC Today show's Summer Concert Series.[citation needed] In 1999, Prince once again signed with a major label, Arista Records, to release a new record, Rave Un2 the Joy Fantastic.[citation needed] The pay-per-view concert, Rave Un2 the Year 2000, was broadcast on December 31, 1999, and consisted of footage from the December 17 and 18 concerts of his 1999 tour. The concert featured appearances by guest musicians, including Lenny Kravitz, George Clinton, Jimmy Russell, and the Time. It was released to home video the following year.[121] 2000–2004: Internet releases and Musicology On May 16, 2000, Prince stopped using the Love Symbol as his name, since his publishing contract with Warner/Chappell had expired.[140] In a press conference, he stated that after being freed from undesirable relationships associated with the name \"Prince\", he would revert to using his real name. Nevertheless, Prince continued to use the symbol as a logo and on album artwork and to play a Love Symbol–shaped guitar.[citation needed] For several years following the release of Rave Un2 the Joy Fantastic, Prince primarily released new music through his Internet subscription service, NPGOnlineLtd.com, which later became NPGMusicClub.com.[141] The albums released during this period include remix album Rave In2 the Joy Fantastic and The Rainbow Children in 2001, One Nite Alone... in 2002, and Xpectation in 2003.[citation needed] In 2001, Warner Bros. released a second compilation album, The Very Best of Prince, containing most of his commercially successful singles from the 1980s. In 2002, Prince released his first live album, One Nite Alone... Live!, which features performances from the One Nite Alone...Tour. The three-CD box set also includes a disc of \"aftershow\" music entitled It Ain't Over!. During this time, Prince sought to engage more effectively with his fan base via the NPG Music Club, pre-concert sound checks, and at yearly \"celebrations\" at Paisley Park. Fans were invited into the studio for tours, interviews, discussions and music-listening sessions. Some of these fan discussions were filmed for an unreleased documentary, directed by Kevin Smith.[citation needed] On February 8, 2004, Prince appeared at the 46th Annual Grammy Awards with Beyoncé.[26][142] In a performance that opened the show, they performed a medley of \"Purple Rain\", \"Let's Go Crazy\", \"Baby I'm a Star\", and Beyoncé's \"Crazy in Love\".[143] The following month, Prince was inducted into the Rock and Roll Hall of Fame.[144] The award was presented to him by Alicia Keys along with Big Boi and André 3000 of OutKast.[145] As well as performing a trio of his own hits during the ceremony, Prince also participated in a tribute to fellow inductee George Harrison in a rendering of Harrison's \"While My Guitar Gently Weeps\", playing a two-minute guitar solo that ended the song.[146][147][148] He also performed the song \"Red House\" as \"Purple House\" on the album Power of Soul: A Tribute to Jimi Hendrix.[149] In April 2004, Prince released Musicology through a one-album agreement with Columbia. The album rose as high as the top five on some international charts (including the US, UK, Germany, and Australia). The United States chart success was assisted by the CDs being included as part of the concert ticket purchase, thereby qualifying each CD (as chart rules then stood) to count toward United States chart placement.[150] Three months later, Spin named him the greatest frontman of all time.[151] That same year, Rolling Stone magazine named Prince as the highest-earning musician in the world, with an annual income of $56.5 million,[152] largely due to his Musicology Tour, which Pollstar named as the top concert draw among musicians in the US. He played 96 concerts; the average ticket price for a show was US$61 (equivalent to $102 in 2024). Musicology went on to receive two Grammy wins, for Best Male R&B Vocal Performance for \"Call My Name\" and Best Traditional R&B Vocal Performance for the title track. Musicology was also nominated for Best R&B Song and Best R&B Album, and \"Cinnamon Girl\" was nominated for Best Male Pop Vocal Performance. Rolling Stone ranked Prince No. 27 on their list of the 100 Greatest Artists of All Time.[153] 2005–2007: Musicology In April 2005, Prince played guitar (along with En Vogue singing backing vocals) on Stevie Wonder's single \"So What the Fuss\", Wonder's first since 1999. In late 2005, Prince signed with Universal Music to release his album, 3121, on March 21, 2006. The first single was \"Te Amo Corazón\", the video for which was directed by actress Salma Hayek and filmed in Marrakesh, Morocco, featuring Argentine actress and singer Mía Maestro. The video for the second single, \"Black Sweat\", was nominated at the MTV VMAs for Best Cinematography. The immediate success of 3121 gave Prince his first No. 1 debut on the Billboard 200 with the album. To promote the new album, Prince was the musical guest on Saturday Night Live on February 4, 2006, 17 years after his last SNL appearance on the 15th-anniversary special, and nearly 25 years since his first appearance on a regular episode in 1981.[154] At the 2006 Webby Awards on June 12, Prince received a Webby Lifetime Achievement Award in recognition of his \"visionary use of the Internet to distribute music and connect with audiences\", exemplified by his decision to release his album Crystal Ball (1998) exclusively online.[155][156] In July 2006, weeks after winning a Webby Award, Prince shut down his NPG Music Club website, after more than five years of operation.[157][158] On the day of the music club's shutdown, a lawsuit was filed against Prince by the British company HM Publishing (owners of the Nature Publishing Group, also NPG). Despite these events occurring on the same day, Prince's attorney stated that the site did not close due to the trademark dispute.[157] Prince appeared at multiple award ceremonies in 2006: on February 15, he performed at the 2006 Brit Awards, along with Wendy & Lisa and Sheila E.,[159] and on June 27, Prince appeared at the 2006 BET Awards, where he was awarded Best Male R&B Artist. Prince performed a medley of Chaka Khan songs for Khan's BET Lifetime Achievement Award.[160] In November 2006, Prince was inducted into the UK Music Hall of Fame;[26] he appeared to collect his award but did not perform. Also in November 2006, Prince opened a nightclub called 3121, in Las Vegas at the Rio All Suite Hotel and Casino. He performed weekly on Friday and Saturday nights until April 2007, when his contract with the Rio ended.[161] On August 22, 2006, Prince released Ultimate Prince. The double-disc set contains one CD of previous hits, and another of extended versions and mixes of material that had largely only previously been available on vinyl record B-sides. That same year, Prince wrote and performed a song for the hit animated film Happy Feet (2006). The song – \"The Song of the Heart\" – appears on the film's soundtrack, which also features a cover of Prince's earlier hit \"Kiss\", sung by Nicole Kidman and Hugh Jackman. In January 2007, \"The Song of the Heart\" won a Golden Globe for Best Original Song.[162] 2007–2010: Super Bowl XLI show, Planet Earth and Lotusflower On February 4, 2007, Prince played at the Super Bowl XLI halftime show in Miami, on a large stage shaped like his symbol. The event was carried to 140 million television viewers, his biggest-ever audience.[163] His 12-minute performance in the rain began with an intro of the Queen song \"We Will Rock You\" and concluded with \"Purple Rain\".[164] In 2015, Billboard ranked it the greatest Super Bowl performance ever.[165] Prince played 21 concerts at the O2 Arena in London during the Earth Tour in mid-2007. Tickets for the 20,000-capacity venue were capped by Prince at £31.21 ($48.66). Featuring Maceo Parker in his band, Prince's residency at the O2 Arena was increased to 15 nights after all 140,000 tickets for the original seven sold out in 20 minutes,[166] before it was then further extended to 21 nights.[167] Prince performed with Sheila E. at the 2007 ALMA Awards. On June 28, 2007, the Mail on Sunday stated that it had made a deal to give Prince's new album, Planet Earth, away for free with the paper, making it the first place in the world to get the album. This move sparked controversy among music distributors and also led the UK arm of Prince's distributor, Sony BMG, to withdraw from distributing the album in UK stores.[168] The UK's largest high street music retailer, HMV, stocked the paper on release day due to the giveaway. On July 7, 2007, Prince returned to Minneapolis to perform three shows. He performed concerts at the Macy's Auditorium (to promote his new perfume \"3121\") on Nicollet Mall, the Target Center arena, and First Avenue.[169] It was the first time he had played at First Avenue (the club appeared in the film Purple Rain) since 1987.[170] From 2008, Prince was managed by UK-based Kiran Sharma.[171] On April 25, 2008, Prince performed on The Tonight Show with Jay Leno, where he debuted a new song, \"Turn Me Loose\". Days after, he headlined the 2008 Coachella Festival. Prince was paid more than $5 million for his performance at Coachella, according to Reuters.[172] Prince canceled a concert, planned at Dublin's Croke Park on June 16, 2008, at 10 days' notice. In October 2009 promoters MCD Productions went to court to sue him for €1.6 million to refund 55,126 tickets. Prince settled the case out of court in February 2010 for $2.95 million.[173][174] During the trial, it was said that Prince had been offered $22 million for seven concerts as part of a proposed 2008 European tour.[175] In October 2008, Prince released a live album entitled Indigo Nights, a collection of songs performed live at aftershows in the IndigO2. Prince premiered four songs from his new album on LA's Indie rock radio station Indie 103.1 on December 18, 2008.[176] The radio station's programmers Max Tolkoff and Mark Sovel had been invited to Prince's home to hear the new rock-oriented music. Prince gave them a CD with four songs to premiere on their radio station. The music debuted the next day on Jonesy's Jukebox, hosted by former Sex Pistol Steve J"
}