{
  "url": "https://ja.wikipedia.org/wiki/国家公務員倫理法",
  "title": "国家公務員倫理法 - Wikipedia",
  "text": "国家公務員倫理法 表示 国家公務員倫理法（こっかこうむいんりんりほう、平成11年8月13日法律第129号）は、国家公務員の倫理に関する法律である。 2000年（平成12年）に施行された。 概要 [編集]国家公務員が国民全体の奉仕者であって、その職務は国民から負託された公務であることに鑑み、国家公務員の職務に係る倫理の保持に資するため必要な措置を講ずることにより、職務の執行の公正さに対する国民の疑惑や不信を招くような行為の防止を図り、もって公務に対する国民の信頼を確保することを目的として制定された法律である。 第5条では、国家公務員倫理規程の制定の政令委任を規定する。 第10条に基づき、人事院に国家公務員倫理審査会が設置され、国家公務員倫理規程に関する意見の申出、国家公務員倫理法違反に係る懲戒基準の作成、公務員倫理に係る研修の総合的企画及び調整、贈与等の報告書、株取引等の報告書及び所得等の報告書の審査、国家公務員倫理法違反の疑いがある場合の調査及びその結果に基づく懲戒手続の実施などを行っている。 同審査会は会長及び委員4名で組織される。会長及び委員3人は両議院に同意を得て内閣が任命する。もう1人の委員は人事官の中から内閣が任命する。 2005年（平成17年）に、国家公務員倫理規程に関する一部改正があった[1]。 構成 [編集]- 第一章 総則（第1条―第4条） - 第二章 国家公務員倫理規程（第5条） - 第三章 贈与等の報告及び公開（第6条―第9条） - 第四章 国家公務員倫理審査会（第10条―第38条） - 第五章 倫理監督官（第39条） - 第六章 雑則（第40条―第46条） - 附則 備考 [編集]- 1999年、前年1998年の大蔵省のスキャンダル（ノーパンしゃぶしゃぶ事件こと「大蔵省接待汚職事件」）を契機として、国家公務員倫理法が公布制定されたが、元大蔵官僚高橋洋一は「当時の公務員の感覚では、接待で100万円を超えると収賄で逮捕されるが、それ以下ならまあ許されるという感覚だった」「相場は社会通念で変わりうる」「100万円未満はいいとなると、社会通念とずれるので、国家公務員倫理法が作られた」「5000円以上の利益供与があれば届け出ること（国家公務員倫理法第6条）、特に飲食では1万円以上を届け出るとされた（国家公務員倫理規程第8条）[注 1]。」等と述べている[2]。 - 2008年、いわゆる「居酒屋タクシー」が、贈収賄罪ないし国家公務員倫理規程に抵触するかが問題となった。 - 2021年2月、「東北新社役職員による総務省幹部接待問題」でも同種の問題が提起されている。さらに、総務省の谷脇康彦総務審議官や山田真貴子元総務審議官らがNTTからそれぞれ数十万円の供応接待を受けていたことが指摘されているが、前者は2018年以降の3年間、国家公務員倫理規程第8条に基づく届けが一度も無く、同規程が一部で有名無実化していた（「NTT役職員による総務省幹部接待問題」参照）[3]。 関連項目 [編集]- 国家公務員法 - 同法2条2項の一般職の国家公務員が、国家公務員倫理法の対象となる。また細則について人事院規則ないし規則に委任している。 - 接待等を発端とする汚職における贈収賄罪と国家公務員倫理法との関係 - 特別養護老人ホーム汚職事件 - 国家公務員倫理法以前に発生した贈収賄事件で、当該事件をきっかけに行われた事務次官等会議申合せに基づき、各省庁職員倫理規程（訓令）が制定された。しかしながら、訓令制定後にも下記の大蔵省接待汚職事件が発生したことから国家公務員倫理法の法制化が行われた[4]。 - 大蔵省接待汚職事件 - 同国家公務員倫理法制定のきっかけとなった刑法に規程する贈収賄罪に問われた事件。但し、同国家公務員倫理法は刑法とは別個の懲戒処分の規定である（懲戒処分#懲戒処分と刑罰参照）。 - 自衛隊員倫理法 - 裁判所職員臨時措置法 - 裁判官及び裁判所職員は特別職の国家公務員であるが、裁判所職員臨時措置法第10号により国家公務員倫理法を準用することとされている。 - 衆議院職員倫理規程、参議院職員倫理規程、国立国会図書館職員倫理規程[5] - 国会職員は特別職の国家公務員であるため、国家公務員倫理法の対象とならないが、同様に職業倫理を定める必要があるため、2000年に各議院議長決定で各倫理規程が定められた[6]。 - 国会職員の倫理の保持に関する法律案が野党議員によって142回国会（国家公務員倫理法案及び自衛隊員倫理法案の初回提出回）に提出されたが、144回国会で審議未了廃案となった。 - 地方公務員法 脚注 [編集]注釈 [編集]- ^ ex: 本省課長補佐級以上の公務員が自らの飲食料金を全額自腹で負担していたつもりでも、実際には相手事業者が総料金額を明示せずに5000円以上の費用分担をしていた場合には国家公務員倫理法第6条「贈与等の届出」違反に該当する。また、相手事業者が利害関係者であったことが後から判明した場合には、当該公務員は国家公務員倫理規程第3条1項六号「利害関係者から供応接待を受けること」とある「禁止行為」違反に該当してしまう（国家公務員倫理法・倫理規程の運用について 2002年9月 日本経団連社会本部【質疑応答】Q3・A3、Q5・A5を参照）。 ex: ゴルフは過去の不祥事でゴルフ接待が多々あったために禁止している。ただし、これにも例外がある（国家公務員倫理法・倫理規程の運用について 2002年9月 日本経団連社会本部【利害関係者との間で行ってはならないこと】16を参照）。 以下、国家公務員倫理規程からの抜粋。- （禁止行為） - （利害関係者と共に飲食をする場合の届出） - 第八条 職員は、自己の飲食に要する費用について利害関係者の負担によらないで利害関係者と共に飲食をする場合において、自己の飲食に要する費用が一万円を超えるときは、次に掲げる場合を除き、あらかじめ、倫理監督官が定める事項を倫理監督官に届け出なければならない。ただし、やむを得ない事情によりあらかじめ届け出ることができなかったときは、事後において速やかに当該事項を届け出なければならない。 一 多数の者が出席する立食パーティーにおいて、利害関係者と共に飲食をするとき。 二 私的な関係がある利害関係者と共に飲食をする場合であって、自己の飲食に要する費用について自己又は自己と私的な関係がある者であって利害関係者に該当しないものが負担するとき。 - 第八条 職員は、自己の飲食に要する費用について利害関係者の負担によらないで利害関係者と共に飲食をする場合において、自己の飲食に要する費用が一万円を超えるときは、次に掲げる場合を除き、あらかじめ、倫理監督官が定める事項を倫理監督官に届け出なければならない。ただし、やむを得ない事情によりあらかじめ届け出ることができなかったときは、事後において速やかに当該事項を届け出なければならない。 出典 [編集]- ^ 国家公務員倫理規程の改正の概要 人事院 - ^ 高橋洋一 (2021年2月25日). “高橋洋一の霞ヶ関ウォッチ 悪質「組織ぐるみ」の総務省接待 なぜ全額自腹にしなかったか悔やむだろう（一部記事引用）”. J-CASTニュース. J-CAST. 2021年3月3日閲覧。 - ^ 「菅＜首相＞最側近官僚にNTTが＜58万＞超絶接待」 週刊文春2021年3月11日号 p.26 - ^ 吉藤正道「公務員倫理法・倫理規程についての一考察」『慶應法学』第11号、慶應義塾大学大学院法務研究科、2008年12月、243-282頁、ISSN 18800750、NAID 120001256757、2023年3月24日閲覧。 - ^ “国立国会図書館職員倫理規程 (平成12年国立国会図書館規程第5号)”. 国立国会図書館 (2000年12月18日). 2023年3月24日閲覧。 - ^ 下井康史「紹介:行政法における公務員倫理法の位置づけ」『日本労働研究雑誌』第565号、独立行政法人労働政策研究・研修機構、2007年8月、47-53頁、ISSN 09163808、2023年3月24日閲覧。 外部リンク [編集]- 国家公務員倫理規程（平成12年政令第101号） 改正後の国家公務員倫理規程の全文 ※平成17年4月1日施行 - E-GOV版 国家公務員倫理法（平成11年法律第129号） - 法令リード版 国家公務員倫理法（平成11年法律第129号） - 国家公務員倫理審査会 - 人事院"
}