{
  "url": "https://en.m.wikipedia.org/wiki/European_Union",
  "title": "European Union - Wikipedia",
  "text": "European Union The European Union (EU) is a supranational political and economic union of 27 member states that are located primarily in Europe.[8][9] The union has a total area of 4,233,255 km2 (1,634,469 sq mi) and an estimated population of more than 450 million as of 2025. The EU is often described as a sui generis political entity combining characteristics of both a federation and a confederation.[10][11] Containing 5.5% of the world population in 2023,[12] EU member states generated a nominal gross domestic product (GDP) of around €17.935 trillion in 2024, accounting for approximately one sixth of global economic output.[13] Its cornerstone, the Customs Union, paved the way to establishing an internal single market based on standardised legal framework and legislation that applies in all member states in those matters, and only those matters, where the states have agreed to act as one. EU policies aim to ensure the free movement of people, goods, services and capital within the internal market;[14] enact legislation in justice and home affairs; and maintain common policies on trade,[15] agriculture,[16] fisheries, and regional development.[17] Passport controls have been abolished for travel within the Schengen Area.[18] The eurozone is a group composed of the 21 EU member states that have fully implemented the EU's economic and monetary union and use the euro currency. Through the Common Foreign and Security Policy, the union has developed a role in external relations and defence. It maintains permanent diplomatic missions throughout the world and represents itself at the United Nations, the World Trade Organization, the G7 and the G20. In 2012, the EU was awarded the Nobel Peace Prize. The EU was established, along with its citizenship, when the Maastricht Treaty came into force in 1993, and was incorporated as an international legal juridical person[clarification needed] upon entry into force of the Treaty of Lisbon in 2009.[19] Its beginnings can be traced to the Inner Six states (Belgium, France, Italy, Luxembourg, the Netherlands, and West Germany) at the start of modern European integration in 1948, and to the Western Union, the International Authority for the Ruhr, the European Coal and Steel Community, the European Economic Community and the European Atomic Energy Community, which were established by treaties. These increasingly amalgamated bodies grew, with their legal successor the EU, both in size through the accessions of a further 22 states from 1973 to 2013, and in power through acquisitions of policy areas. In 2020, the United Kingdom became the only member state to leave the EU; ten countries are aspiring or negotiating to join it. History Background: World Wars and aftermath Internationalism and visions of European unity had existed since well before the 19th century, but gained particularly as a reaction to World War I and its aftermath. In this light the first advances for the idea of European integration were made. In 1920 John Maynard Keynes proposed a European customs union for the struggling post-war European economies,[20] and in 1923 the oldest organisation for European integration, the Paneuropean Union was founded, led by Richard von Coudenhove-Kalergi, who later would found in June 1947 the European Parliamentary Union (EPU). Aristide Briand—who was Prime Minister of France, a follower of the Paneuropean Union, and Nobel Peace Prize laureate for the Locarno Treaties—delivered a widely recognised speech at the League of Nations in Geneva on 5 September 1929 for a federal Europe to secure Europe and settle the historic Franco-German enmity.[21][22] With large-scale war being waged in Europe once again in the 1930s and becoming World War II, the question of what to fight against and what for had to be agreed on. A first agreement was the Declaration of St James's Palace of 1941, when Europe's resistance gathered in London. This was expanded on by the 1941 Atlantic Charter, establishing the Allies and their common goals, inciting a new wave of global international institutions like the United Nations (founded 1945) or the Bretton Woods System (1944).[23] In 1943 at the Moscow Conference and Tehran Conference, plans to establish joint institutions for a post-war world and Europe increasingly became a part of the agenda. This led to a decision at the Yalta Conference in 1944 to form a European Advisory Commission, later replaced by the Council of Foreign Ministers and the Allied Control Council, following the German surrender and the Potsdam Agreement in 1945. By the end of the war, European integration became seen as an antidote to the extreme nationalism that had caused the war.[24] On 19 September 1946, in a much recognised speech, Winston Churchill, speaking at the University of Zürich, reiterated his calls since 1930 for a \"European Union\" and \"Council of Europe\", coincidentally[25] parallel[clarification needed] to the Hertenstein Congress of the Union of European Federalists,[26] one of the then founded and later constituent members of the European Movement. One month later, the French Union was installed by the new Fourth French Republic to direct the decolonisation of its colonies so that they would become parts of a European community.[27] By 1947, a growing rift between the western Allied Powers and the Soviet Union became evident as a result of the rigged 1947 Polish legislative election, which constituted an open breach of the Yalta Agreement. March of that year saw two important developments. First was the signing of the Treaty of Dunkirk between France and the United Kingdom. The treaty assured mutual assistance in the event of future military aggression against either nation. Though it officially named Germany as a threat, in reality the actual concern was for the Soviet Union. A few days later came the announcement of the Truman Doctrine which pledged American support for democracies to counter the Soviets. Initial years and the Paris Treaty (1948–1957) Immediately following the February 1948 coup d'état by the Communist Party of Czechoslovakia, the London Six-Power Conference was held, resulting in the Soviet boycott of the Allied Control Council and its incapacitation, an event marking the beginning of the Cold War. The year 1948 marked the beginning of the institutionalised modern European integration. In March 1948 the Treaty of Brussels was signed, establishing the Western Union (WU), followed by the International Authority for the Ruhr. Furthermore, the Organisation for European Economic Co-operation (OEEC), the predecessor of the OECD, was also founded in 1948 to manage the Marshall Plan, which led to the Soviets creating Comecon in response. The ensuing Hague Congress of May 1948 was a pivotal moment in European integration, as it led to the creation of the European Movement International, the College of Europe,[28] and most importantly to the foundation of the Council of Europe on 5 May 1949 (which is now Europe Day). The Council of Europe was one of the first institutions to bring the sovereign states of (then only Western) Europe together, raising great hopes and fevered debates in the following two years for further European integration.[citation needed] It has since been a broad forum to further cooperation and shared issues, achieving for example the European Convention on Human Rights in 1950. Essential for the actual birth of the institutions of the EU was the Schuman Declaration on 9 May 1950 (the day after the fifth Victory in Europe Day) and the decision by six nations (France, Belgium, Netherlands, Luxembourg, West Germany, and Italy) to follow Schuman and draft the Treaty of Paris. This treaty was created in 1952 the European Coal and Steel Community (ECSC), which was built on the International Authority for the Ruhr, installed by the Western Allies in 1949 to regulate the coal and steel industries of the Ruhr area in West Germany.[29] Backed by the Marshall Plan with large funds coming from the United States since 1948, the ECSC became a milestone organisation, enabling European economic development and integration and being the origin of the main institutions of the EU such as the European Commission and Parliament.[30] Founding fathers of the European Union understood that coal and steel were the two industries essential for waging war, and believed that by tying their national industries together, a future war between their nations became much less likely.[31] In parallel with Schuman, the Pleven Plan of 1951 tried but failed to tie the institutions of the developing European community under the European Political Community, which was to include the also proposed European Defence Community, an alternative to West Germany joining NATO which was established in 1949 under the Truman Doctrine. In 1954 the Modified Brussels Treaty transformed the Western Union into the Western European Union (WEU). West Germany eventually joined both the WEU and NATO in 1955, prompting the Soviet Union to form the Warsaw Pact in 1955 as an institutional framework for its military domination in the countries of Central and Eastern Europe. Assessing the progress of European integration the Messina Conference was held in 1955, ordering the Spaak report, which in 1956 recommended the next significant steps of European integration. Treaty of Rome (1958–1972) In 1957, Belgium, France, Italy, Luxembourg, the Netherlands, and West Germany signed the Treaty of Rome, which created the European Economic Community (EEC) and established a customs union.[32] They also signed another pact creating the European Atomic Energy Community (Euratom) for cooperation in developing nuclear power. Both treaties came into force in 1958.[31] Although the EEC and Euratom were created separately from the ECSC, they shared the same courts and the Common Assembly. The EEC was headed by Walter Hallstein (Hallstein Commission) and Euratom was headed by Louis Armand (Armand Commission) and then Étienne Hirsch (Hirsch Commission).[33][34] The OEEC was in turn reformed in 1961 into the Organisation for Economic Co-operation and Development (OECD) and its membership was extended to states outside of Europe, the United States and Canada. During the 1960s, tensions began to show, with France seeking to limit supranational power. Nevertheless, in 1965 an agreement was reached, and on 1 July 1967 the Merger Treaty created a single set of institutions for the three communities, which were collectively referred to as the European Communities.[35][36] Jean Rey presided over the first merged commission (Rey Commission).[37] First enlargement and European co-operation (1973–1993) In 1973, the communities were enlarged to include Denmark (including Greenland), Ireland, and the United Kingdom.[38] Norway had negotiated to join at the same time, but Norwegian voters rejected membership in a referendum. The Ostpolitik and the ensuing détente led to establishment of a first truly pan-European body, the Conference on Security and Co-operation in Europe (CSCE), predecessor of the modern Organization for Security and Co-operation in Europe (OSCE). In 1979, the first direct elections to the European Parliament were held.[39] Greece joined in 1981. In 1985, Greenland left the Communities, following a dispute over fishing rights. During the same year, the Schengen Agreement paved the way for the creation of open borders without passport controls between most member states and some non-member states.[40] In 1986, the Single European Act was signed. Portugal and Spain joined in 1986.[41] In 1990, after the fall of the Eastern Bloc, the former East Germany became part of the communities as part of a reunified Germany.[42] Treaties of Maastricht, Amsterdam and Nice (1993–2004) The European Union was formally established when the Maastricht Treaty—whose main architects were Horst Köhler,[43] Helmut Kohl and François Mitterrand—came into force on 1 November 1993.[19][44] The treaty also gave the name European Community to the EEC, even if it was referred to as such before the treaty. With further enlargement planned to include the former communist states of Central and Eastern Europe, as well as Cyprus and Malta, the Copenhagen criteria for candidate members to join the EU were agreed upon in June 1993. The expansion of the EU introduced a new level of complexity and discord.[45] In 1995, Austria, Finland, and Sweden joined the EU. In 2002, euro banknotes and coins replaced national currencies in 12 of the member states. Since then, the eurozone has increased to encompass 21 countries. The euro currency became the second-largest reserve currency in the world. In 2004, the EU saw its biggest enlargement to date when Cyprus, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia joined the union.[46] Treaty of Lisbon and Brexit (2004–present) In 2007, Bulgaria and Romania became EU members. Later that year, Slovenia adopted the euro,[46] followed by Cyprus and Malta in 2008, Slovakia in 2009, Estonia in 2011, Latvia in 2014, Lithuania in 2015, and Croatia in 2023. On 1 December 2009, the Lisbon Treaty entered into force and reformed many aspects of the EU. In particular, it changed the legal structure of the EU, merging the EU three pillars system into a single legal entity provisioned with a legal personality, created a permanent president of the European Council, the first of which was Herman Van Rompuy, and strengthened the position of the high representative of the union for foreign affairs and security policy.[47][48] In 2012, the EU received the Nobel Peace Prize for having \"contributed to the advancement of peace and reconciliation, democracy, and human rights in Europe\".[49][50] In 2013, Croatia became the 28th EU member.[51] From the beginning of the 2010s, the cohesion of the European Union has been tested by several issues, including the Euro area crisis, 2015 European migrant crisis, and Brexit.[52] A referendum in the UK on its membership of the European Union was held in 2016, with 51.9 per cent of participants voting to leave.[53] The UK formally notified the European Council of its decision to leave on 29 March 2017, initiating the formal withdrawal procedure for leaving the EU; following extensions to the process, the UK left the European Union on 31 January 2020, although most areas of EU law continued to apply to the UK for a transition period which lasted until 31 December 2020.[54] The early 2020s saw Denmark abolishing one of its three opt-outs and Croatia adopting the euro. After the economic crisis caused by the COVID-19 pandemic, the EU leaders agreed for the first time to create common debt to finance the European Recovery Program called Next Generation EU (NGEU).[55] On 24 February 2022, after massing on the borders of Ukraine, the Russian Armed Forces undertook an attempt for a full-scale invasion of Ukraine.[56][57] The European Union imposed heavy sanctions on Russia and agreed on a pooled military aid package to Ukraine for lethal weapons funded via the European Peace Facility off-budget instrument.[58] NGEU is a European Commission economic recovery package to support the EU member states to recover from the COVID-19 pandemic, in particular those that have been particularly hard hit. It is sometimes styled NextGenerationEU and Next Gen EU, and also called the European Union Recovery Instrument.[59] Agreed in principle by the European Council on 21 July 2020 and adopted on 14 December 2020, the instrument is worth €750 billion. NGEU will operate from 2021 to 2026,[60] and will be tied to the regular 2021–2027 budget of the EU's Multiannual Financial Framework (MFF). The comprehensive NGEU and MFF packages are projected to reach €1824.3 billion.[61] Preparing the EU for a new great enlargement is one of its political priorities, with the goal of achieving 35 member states by 2030. Institutional and budgetary reforms are being discussed in order for the EU to be ready for the new members.[62][63][64][65] Ahead of the elections in June 2024, the Russo-Ukrainian war led to inflation, lowering life level and created a possibility of strong changes in the elections.[66][67] In December 2025, it was leaked that the United States government would attempt to persuade \"Austria, Hungary, Italy, and Poland\" to depart the EU in a Brexit-type manner.[68] Timeline Since the end of World War II, most sovereign European countries have entered into treaties and thereby co-operated and harmonised policies (or pooled sovereignty) in an increasing number of areas, in the European integration project or the construction of Europe (French: la construction européenne). The following timeline outlines the legal inception of the European Union (EU)—the principal framework for this unification. The EU inherited many of its present organizations, institutions, and responsibilities from the European Communities (EC), which were founded in the 1950s in the spirit of the Schuman Declaration. - ^ a b c d e Although not EU treaties per se, these treaties affected the development of the EU defence arm, a main part of the CFSP. The Franco-British alliance established by the Dunkirk Treaty was de facto superseded by WU. The CFSP pillar was bolstered by some of the security structures that had been established within the remit of the 1955 Modified Brussels Treaty (MBT). The Brussels Treaty was terminated in 2011, consequently dissolving the WEU, as the mutual defence clause that the Lisbon Treaty provided for EU was considered to render the WEU superfluous. The EU thus de facto superseded the WEU. - ^ Plans to establish a European Political Community (EPC) were shelved following the French failure to ratify the Treaty establishing the European Defence Community (EDC). The EPC would have combined the ECSC and the EDC. - ^ The European Communities obtained common institutions and a shared legal personality (i.e. ability to e.g. sign treaties in their own right). - ^ The treaties of Maastricht and Rome form the EU's legal basis, and are also referred to as the Treaty on European Union (TEU) and the Treaty on the Functioning of the European Union (TFEU), respectively. They are amended by secondary treaties. - ^ Between the EU's founding in 1993 and consolidation in 2009, the union consisted of three pillars, the first of which were the European Communities. The other two pillars consisted of additional areas of cooperation that had been added to the EU's remit. - ^ The consolidation meant that the EU inherited the European Communities' legal personality and that the pillar system was abolished, resulting in the EU framework as such covering all policy areas. Executive/legislative power in each area was instead determined by a distribution of competencies between EU institutions and member states. This distribution, as well as treaty provisions for policy areas in which unanimity is required and qualified majority voting is possible, reflects the depth of EU integration as well as the EU's partly supranational and partly intergovernmental nature. Politics The European Union operates through a hybrid system of supranational and intergovernmental decision-making,[69][70] and according to the principle of conferral (which says that it should act only within the limits of the competences conferred on it by the treaties) and of subsidiarity (which says that it should act only where an objective cannot be sufficiently achieved by the member states acting alone). Laws made by the EU institutions are passed in a variety of forms.[71] Generally speaking, they can be classified into two groups: those which come into force without the necessity for national implementation measures (regulations) and those which specifically require national implementation measures (directives).[g] EU policy is in general promulgated by EU directives, which are then implemented in the domestic legislation of its member states, and EU regulations, which are immediately enforceable in all member states. Lobbying at the EU level by special interest groups is regulated to try to balance the aspirations of private initiatives with public interest decision-making process.[72] Member states Through successive enlargements, the EU and its predecessors have grown from the six founding states of the EEC to 27 members. Countries accede to the union by becoming a party to the founding treaties, thereby subjecting themselves to the privileges and obligations of EU membership. This entails a partial delegation of sovereignty to the institutions in return for representation within those institutions, a practice often referred to as \"pooling of sovereignty\".[73][74] In some policies, there are several member states that ally with strategic partners within the union. Examples of such alliances include the Baltic Assembly, the Benelux Union, the Bucharest Nine, the Craiova Group, the EU Med Group, the Lublin Triangle, the New Hanseatic League, the Three Seas Initiative, the Visegrád Group, and the Weimar Triangle. To become a member, a country must meet the Copenhagen criteria, defined at the 1993 meeting of the European Council in Copenhagen. These require a stable democracy that respects human rights and the rule of law; a functioning market economy; and the acceptance of the obligations of membership, including EU law. Evaluation of a country's fulfilment of the criteria is the responsibility of the European Council.[75] The four countries forming the European Free Trade Association (EFTA) are not EU members, but have partly committed to the EU's economy and regulations: Iceland, Liechtenstein and Norway, which are a part of the single market through the European Economic Area, and Switzerland, which has similar ties through bilateral treaties.[76][77] The relationships of the European microstates Andorra, Monaco, San Marino, and Vatican City include the use of the euro and other areas of co-operation.[78] Subdivisions Subdivisions of member-states are based on the Nomenclature of Territorial Units for Statistics (NUTS), a geocode standard for statistical purposes. The standard, adopted in 2003, is developed and regulated by the European Union, and thus only covers the member states of the EU in detail. The Nomenclature of Territorial Units for Statistics is instrumental in the European Union's Structural Funds and Cohesion Fund delivery mechanisms and for locating the area where goods and services subject to European public procurement legislation are to be delivered. Candidate countries There are nine countries that are recognised as candidates for membership: Albania, Bosnia and Herzegovina, Georgia, Moldova, Montenegro, North Macedonia, Serbia, Turkey, and Ukraine.[79][80][81][82][83] Norway, Switzerland and Iceland have submitted membership applications in the past, but subsequently frozen or withdrawn them.[84] Additionally Kosovo is officially recognised as a potential candidate,[79][85] and submitted a membership application.[86] Former members Article 50 of the Lisbon Treaty provides the basis for a member to leave the EU. Two territories have left the union: Greenland (an autonomous province of Denmark) withdrew in 1985;[87] the United Kingdom formally invoked Article 50 of the Consolidated Treaty on European Union in 2017, and became the only sovereign state to leave when it withdrew from the EU in 2020. Governance Member states retain in principle all powers except those that they have agreed collectively to delegate to the union as a whole, though the exact delimitation has on occasions become a subject of scholarly or legal disputes.[88][89] In certain fields, members have awarded exclusive competence and exclusive mandate to the union. These are areas in which member states have entirely renounced their own capacity to enact legislation. In other areas, the EU and its member states share the competence to legislate. While both can legislate, the member states can only legislate to the extent to which the EU has not. In other policy areas, the EU can only co-ordinate, support and supplement member state action but cannot enact legislation with the aim of harmonising national laws.[90] That a particular policy area falls into a certain category of competence is not necessarily indicative of what legislative procedure is used for enacting legislation within that policy area. Different legislative procedures are used within the same category of competence, and even with the same policy area. The distribution of competences in various policy areas between member states and the union is divided into the following three categories: - the customs union - the establishing of the competition rules necessary for the functioning of the internal market - monetary policy for the Member States whose currency is the euro - the conservation of marine biological resources under the common fisheries policy - Common Commercial Policy - conclusion of certain international agreements - the internal market - social policy, for the aspects defined in TFEU - economic, social and territorial cohesion - agriculture and fisheries, excluding the conservation of marine biological resources - environment - consumer protection - transport - trans-European networks - energy - the area of freedom, security and justice - common safety concerns in public health matters, for the aspects defined in TFEU - research, technological development and (outer) space - development cooperation, humanitarian aid - the coordination of economic, employment and social policies - common foreign, security and defence policies The European Union has seven principal decision-making bodies, its institutions: the European Parliament, the European Council, the Council of the European Union, the European Commission, the Court of Justice of the European Union, the European Central Bank and the European Court of Auditors. Competence in scrutinising and amending legislation is shared between the Council of the European Union and the European Parliament, while executive tasks are performed by the European Commission and in a limited capacity by the European Council (not to be confused with the aforementioned Council of the European Union). The monetary policy of the eurozone is determined by the European Central Bank. The interpretation and the application of EU law and the treaties are ensured by the Court of Justice of the European Union. The EU budget is scrutinised by the European Court of Auditors. There are also a number of ancillary bodies which advise the EU or operate in a specific area. Branches of power Executive branch The union's executive branch is organised as a directorial system, where the executive power is jointly exercised by several people. The executive branch consists of the European Council and European Commission. The European Council sets the broad political direction of the union. It convenes at least four times a year and comprises the president of the European Council (presently António Costa), the president of the European Commission and one representative per member state (either its head of state or head of government). The high representative of the union for foreign affairs and security policy (presently Kaja Kallas) also takes part in its meetings. Described by some as the union's \"supreme political leadership\",[92] it is actively involved in the negotiation of treaty changes and defines the EU's policy agenda and strategies. Its leadership role involves solving disputes between member states and the institutions, and to resolving any political crises or disagreements over controversial issues and policies. It acts as a \"collective head of state\" and ratifies important documents (for example, international agreements and treaties).[93] Tasks for the president of the European Council are ensuring the external representation of the EU,[94] driving consensus and resolving divergences among member states, both during meetings of the European Council and over the periods between them. The European Council should not be mistaken for the Council of Europe, an international organisation independent of the EU and based in Strasbourg. The European Commission acts both as the EU's executive arm, responsible for the day-to-day running of the EU, and also the legislative initiator, with the sole power to propose laws for debate.[95][96][97] The commission is 'guardian of the Treaties' and is responsible for their efficient operation and policing.[98] It has 27 European commissioners for different areas of policy, one from each member state, though commissioners are bound to represent the interests of the EU as a whole rather than their home state. The leader of the 27 is the president of the European Commission (presently Ursula von der Leyen for 2019–2024, reelected for the 2024–2029 term), proposed by the European Council, following and taking into account the result of the European elections, and is then elected by the European Parliament.[99] The President retains, as the leader responsible for the entire cabinet, the final say in accepting or rejecting a candidate submitted for a given portfolio by a member state, and oversees the commission's permanent civil service. After the President, the most prominent commissioner is the high representative of the union for foreign affairs and security policy, who is ex-officio a vice-president of the European Commission and is also chosen by the European Council.[100] The other 25 commissioners are subsequently appointed by the Council of the European Union in agreement with the nominated president. The 27 commissioners as a single body are subject to approval (or otherwise) by a vote of the European Parliament. All commissioners are first nominated by the government of the respective member state.[101] Legislative branch The council, as it is now simply called[102] (also called the Council of the European Union[103] and the \"Council of Ministers\", its former title),[104] forms one half of the EU's legislature. It consists of a representative from each member state's government and meets in different compositions depending on the policy area being addressed. Notwithstanding its different configurations, it is considered to be one single body. In addition to the legislative functions, members of the council also have executive responsibilities, such as the development of a Common Foreign and Security Policy and the coordination of broad economic policies within the union.[105] The Presidency of the council rotates between member states, with each holding it for six months. Beginning on 1 July 2025, the position is held by Denmark.[2] The European Parliament is one of three legislative institutions of the EU, which together with the Council of the European Union is tasked with amending and approving the European Commission's proposals. 705 members of the European Parliament (MEPs) are directly elected by EU citizens every five years on the basis of proportional representation. MEPs are elected on a national basis and they sit according to political groups rather than their nationality. Each country has a set number of seats and is divided into sub-national constituencies where this does not affect the proportional nature of the voting system.[106] In the ordinary legislative procedure, the European Commission proposes legislation, which requires the joint approval of the European Parliament and the Council of the European Union to pass. This process applies to nearly all areas, including the EU budget. The parliament is the final body to approve or reject the proposed membership of the commission, and can attempt motions of censure on the commission by appeal to the Court of Justice. The president of the European Parliament carries out the role of speaker in Parliament and represents it externally. The president and vice-presidents are elected by MEPs every two and a half years.[107] Judicial branch The judicial branch of the European Union is formally called the Court of Justice of the European Union (CJEU) and consists of two courts: the Court of Justice and the General Court.[108] The Court of Justice is the supreme court of the European Union in matters of European Union law. As a part of the CJEU, it is tasked with interpreting EU law and ensuring its uniform application across all EU member states under Article 263 of the Treaty of the Functioning of the European Union (TFEU). The Court was established in 1952, and is based in Luxembourg. It is composed of one judge per member state – currently 27 – although it normally hears cases in panels of three, five or fifteen judges. The Court has been led by president Koen Lenaerts since 2015. The CJEU is the highest court of the European Union in matters of Union law. Its case-law provides that EU law has supremacy over any national law that is inconsistent with EU law.[109] It is not possible to appeal against the decisions of national courts in the CJEU, but rather national courts refer questions of EU law to the CJEU (a preliminary reference). However, it is ultimately for the national court to apply the resulting interpretation (the preliminary ruling) to the facts of any given case. Although, only courts of final appeal are bound to refer a question of EU law when one is addressed. The treaties give the CJEU the power for consistent application of EU law across the EU as a whole. The court also acts as an administrative and constitutional court between the other EU institutions and the Member States and can annul or invalidate unlawful acts of EU institutions, bodies, offices and agencies. The General Court is a constituent court of the European Union. It hears actions taken against the institutions of the European Union by individuals and member states, although certain matters are reserved for the Court of Justice. Decisions of the General Court can be appealed to the Court of Justice, but only on a point of law. Prior to the coming into force of the Lisbon Treaty on 1 December 2009, it was known as the Court of First Instance. Since the amendments to the Statute of the CJEU in October 2024, the Court of Justice shares its jurisdiction over references for a preliminary ruling with the General Court.[110] The General Court is since then competent to handle preliminary references falling under one of the six following areas: the common system of value added tax; excise duties; the Customs Code; the tariff classification of goods under the Combined Nomenclature; compensation and assistance to passengers in the event of denied boarding or delay or cancellation of transport services; the scheme for greenhouse gas emission allowance trading.[111] Additional branches The European Central Bank (ECB) is one of the institutions of the monetary branch of the European Union, the prime component of the Eurosystem and the European System of Central Banks. It is one of the world's most important central banks. The ECB Governing Council makes monetary policy for the eurozone and the European Union, administers the foreign exchange reserves of EU member states, engages in foreign exchange operations, and defines the intermediate monetary objectives and key interest rate of the EU. The ECB Executive Board enforces the policies and decisions of the Governing Council, and may direct the national central banks when doing so. The ECB has the exclusive right to authorise the issuance of euro banknotes. Member states can issue euro coins, but the volume must be approved by the ECB beforehand. The bank also operates the T2 (RTGS) payments system. The European System of Central Banks (ESCB) consists of the ECB and the national central banks (NCBs) of all 27 member states of the European Union. The ESCB is not the monetary authority of the eurozone, because not all EU member states have joined the euro. The ESCB's objective is price stability throughout the European Union. Secondarily, the ESCB's goal is to improve monetary and financial cooperation between the Eurosystem and member states outside the eurozone. The European Court of Auditors (ECA) is the auditory branch of the European Union. It was established in 1975 in Luxembourg in order to improve EU financial management. It has 27 members (1 from each EU member-state) supported by approximately 800 civil servants. The European Personnel Selection Office (EPSO) is the EU's civil service recruitment body and operates its selection of candidates via generalist and specialist competitions. Each institution is then able to recruit staff from among the pool of candidates selected by EPSO. On average, EPSO receives around 60,000–70,000 applications a year with around 1,500–2,000 candidates recruited by the European Union institutions. The European Ombudsman is the ombudsman branch of the European Union that holds the institutions, bodies and agencies of the EU to account, and promotes good administration. The Ombudsman helps people, businesses and organisations facing problems with the EU administration by investigating complaints, as well as by proactively looking into broader systemic issues. The current Ombudsman is Emily O'Reilly. The European Public Prosecutor's Office (EPPO) is the prosecutory branch of the union with juridical personality, established under the Treaty of Lisbon between 23 of the 27 states of the EU following the method of enhanced cooperation. It is based in Kirchberg, Luxembourg City alongside the Court of Justice of the European Union and the European Court of Auditors Budget - Sustainable Growth/Natural Resources (38.6%) - Competitiveness for Growth and Jobs (13.1%) - Global Europe (6.10%) - Economic, Territorial and Social Cohesion (34.1%) - Administration (6.40%) - Security and Citizenship (1.70%) The European Union had an agreed budget of €170.6 billion in 2022. The EU had a long-term budget of €1,082.5 billion for the period 2014–2020, representing 1.02% of the EU-28's GNI. In 1960, the budget of the European Community was 0.03 per cent of GDP.[113] Of this, €54bn subsidised agriculture enterprise, €42bn was spent on transport, building and the environment, €16bn on education and research, €13bn on welfare, €20bn on foreign and defence policy, €2bn in finance, €2bn in energy, €1.5bn in communications, and €13bn in administration. In November 2020, two members of the union, Hungary and Poland, blocked approval to the EU's budget at a meeting in the Committee of Permanent Representatives (Coreper), citing a proposal that linked funding with adherence to the rule of law. The budget included a COVID-19 recovery fund of €750 billion.[114][115] The budget was finally approved by 12 December when Hungary and Poland withdrew their vetoes after further negotiations in the council and the European Council.[116] Bodies combatting fraud have also been established, including the European Anti-fraud Office and the European Public Prosecutor's Office. The latter is a decentralised independent body of the European Union (EU), established under the Treaty of Lisbon between 22 of the 27 states of the EU following the method of enhanced cooperation.[117] The European Public Prosecutor's Office investigate and prosecute fraud against the budget of the European Union and other crimes against the EU's financial interests including fraud concerning EU funds of over €10,000 and cross-border VAT fraud cases involving damages above €10 million. Law Constitutionally, the EU bears some resemblance to both a confederation and a federation,[118][119] but has not formally defined itself as either. (It does not have a formal constitution: its status is defined by the Treaty of European Union and the Treaty on the Functioning of the European Union). It is more integrated than a traditional confederation of states because the general level of government widely employs qualified majority voting in some decision-making among the member states, rather than relyin"
}