{
  "url": "https://screenrant.com/star-wars-9-death-star-destroyers-explained/",
  "title": "Star Wars 9's Death Star Destroyers Explained (Better Than The Movie)",
  "text": "Star Wars: The Rise of Skywalker saw a massive fleet of upgraded Star Destroyers, which were part of Palpatine’s big plan to destroy the Resistance and regain control of the galaxy, but what’s the deal with these new Star Destroyers? Are they really using Death Star technology? Expectations were high for Star Wars: The Rise of Skywalker as it’s the end of the Skywalker saga and it also teased a lot of exciting moments in its trailers, such as the return of Palpatine and a lot of Star Destroyers ready for battle. Sadly, the film felt short. Star Wars: The Rise of Skywalker focused on many things and ended up not fully developing most of them. The story followed the Resistance’s final stand against the First Order, Palpatine’s return, Kylo Ren’s inner fight between both sides of the Force (and eventual redemption), and Rey’s actual backstory and Jedi training – all of that while also adding a lot of fan service. It was a lot, and many things ended up not being properly explained, such as all those new and improved Star Destroyers. The Sith Eternal fleet consisted entirely of these and were used to fight against the Resistance in Exegol, and one of these warships was also used to destroy Kijimi, which has made many fans wonder if they were using Death Star technology or were the equivalent to a new Death Star. Luckily, there’s a companion book to the film that explains the Death Star Destroyers a lot better than the film did. Star Wars 9 Death Star Destroyers Explained Properly The book Star Wars: The Rise of Skywalker: The Visual Dictionary offers an actual explanation on what the Sith Eternal’s Star Destroyers are and whether or not they have something to do with the Death Star. These are the Xyston-class Star Destroyers, also known as the Sith Star Destroyer, and they are based on the Imperial-class design. These warships are “fitted with efficient automation systems to cut down on crew requirements” and each one has a reactor-fed axial superlaser, which has the ability to smash a planet from far orbit – as seen with the destruction of Kijimi. Even though these Star Destroyers have superior technology to the previous ones and carry “planet-devastating first-strike capabilities”, these are not described as Death Star technology, so they are different (albeit similar) characteristics. Still, and just like the Death Star, these warships had a weakness, and the Resistance found it: the axial superlaser. Even though this was capable of destroying a planet, the Resistance was able to destroy the entire vessel by targeting it, and that’s how the fleet was defeated even before it could leave Exegol. Like many other things in Star Wars: The Rise of Skywalker, the modernized Star Destroyers weren’t explored or developed properly, which is very disappointing as they were quite impressive."
}