{
  "url": "https://www.rusi.org/explore-our-research/publications/commentary/ukraine-european-vision-victory",
  "title": "Ukraine: A European Vision of Victory? | Royal United Services Institute",
  "text": "Europe has the capacity and opportunity to cripple Russia and significantly reduce the threat posed to the continent if its states can coordinate their efforts. But the window of opportunity is closing. American disengagement from Ukraine has prompted European leaders to reaffirm their commitment to supporting Kyiv and emphasise the high stakes for European security. Nevertheless, European capitals are pessimistic about what can be achieved without significant American backing. In the absence of a clear European theory of victory, policy remains aimed at delaying Ukraineâs defeat without a clear vision of what Europe should be trying to achieve. Yet a concerted effort by European states over the next year could lay the foundations for the enduring security of Europe; pushing Russia to a point where it will struggle to reconstitute its military sufficiently to threaten NATO for the foreseeable future. There is a closing window of opportunity within which a more dangerous future for the continent can be foreclosed. Europe Without a Buffer Zone The future that dominates planning within NATO is one in which Russia imposes an outcome on Kyiv, compromising Ukraineâs independence. Having withdrawn its forces from Ukraine to put them through large scale exercises, the Russians could have a minimum viable force to threaten European states in the context of US redeployments to the Indo-Pacific within two years. Rebuilding its officer corps given extensive losses will take up to seven years, over which time the Russian military will regenerate much of its frontline equipment, so that the severity of the threat that must be balanced by NATO increases with time. If Ukraine can hold on for another year, continuing to attrite Russian forces, however, then Russia may be pushed beyond its ability to readily recover If Ukraine can hold on for another year, continuing to attrite Russian forces, however, then Russia may be pushed beyond its ability to readily recover. Russia is already approaching the exhaustion of its stockpiled Soviet-era armoured vehicles by the end of 2025. In 2026 the Russian Army will have to replace losses by producing new equipment. Recruitment is currently at an all-time high in Russia with between 35,000-47,000 people joining the military per month, but the bonuses needed to induce enlistment have peaked, while much of the enthusiasm to join has been driven by a perception that the war will soon be over. To keep up recruitment, Russia is already looking beyond voluntary enlistment. Russia cannot further increase payments as the Kremlin has emphasised that it will not be spending more on defence. If the war looks to be protracting, it will struggle to keep up the rate of recruitment. In terms of both equipment and personnel, the key to Russiaâs ability to rebuild combat power is money, which is overwhelmingly generated through the oil and gas sector. Economic Hurdles for Russian Forces Russiaâs exposure to disruption of oil and gas exports is significant. With sanctions restricting Russiaâs ability to borrow on the international market, it cannot afford to run a sustained budget deficit. Following President Donald Trumpâs raft of tariff announcements, the price of oil dropped below $60 a barrel â the level against which Russiaâs budget is benchmarked â causing President Putin and his defence minister to emphasise in speeches that the military would need to work within their current means. Europe, however, has the capacity to significantly strain Russiaâs finances and thus the sustainability of the war. Most of Russiaâs oil exports are moved by sea, and over 60% of that traffic flows through the Baltic Sea where they must pass through Danish waters. Sanctioning vessels associated with this trade can cause them to be de-flagged and once de-flagged Denmark could ban them from transiting its waters. Russia would invariably seek to export oil via other ports, but limitations on available infrastructure would still see a significant decline in exports. This could be further reduced through the threat of secondary sanction to ports that receive and offload Russian oil. Russian oil represents a small fraction of these portsâ business. Russiaâs economy and thus its ability to sustain the war can be further degraded through Ukraineâs long-range precision strike campaign. Many of the sub-systems used in Ukraineâs manufacture of long-range weapons are European and Europe can invest to expand supply, enabling Ukraine to target a wider range of Russian infrastructure. Resourcing the strike campaign is in many ways a win-win scenario for Europe. If Russian air defences defeat the strikes, Russia burns through its stockpiles of surface to air missiles â thereby making the conventional deterrent offered by European air forces more credible â while if the strikes succeed, they both reduce Russian revenue and its capacity to build weaponry. These effects will take time to impact Russia, but if implemented with alacrity they would confront the Kremlin with hard policy trade-offs in 2026. It would, in short, provide the basis for bringing Russia to the table to negotiate, rather than simply playing at Potemkin peace-talks in which Russia restates its maximalists demands. Holding Ground to Buy Time All of this is only possible if Ukraine can hold. At present, the rate of Russian advance is accelerating and Russiaâs summer offensive is likely to put the Armed Forces of Ukraine under intense pressure. Nevertheless, most of the capabilities that Ukraine depends upon for its defence today â from drones to artillery and even aircraft â are not directly dependent upon the US. In the short-term Europe can cover most of Ukraineâs needs so long as it can purchase some critical weapons types from the US. However, in the medium-term Europe must address fundamental weaknesses in its defence industrial base. Investment in explosives and propellent production for instance is essential, as highlighted in the UKâs recent Strategic Defence Review. The good news is that this is critical to support Ukraine and to rebuild NATOâs conventional forces so investment in this area is not wasted irrespective of how the threat develops. The fact that US disengagement makes Europeâs security more precarious has seen understandable efforts across the continent over the past five months to try and engage with Donald Trump. This has softened some of the administration's more abrupt actions. But it has not altered the underlying trend that the US is going to pivot from Europe. It is time the continent crafts a vision for how it can underwrite its own security and put the steps in place to realise it. That vision begins in Ukraine. Â© RUSI, 2025. The views expressed in this Commentary are the authors', and do not represent those of RUSI or any other institution. For terms of use, see Website Terms and Conditions of Use. Have an idea for a Commentary you'd like to write for us? Send a short pitch to commentaries@rusi.org and we'll get back to you if it fits into our research interests. View full guidelines for contributors. WRITTEN BY Dr Jack Watling Senior Research Fellow, Land Warfare Military Sciences - Jim McLeanMedia Relations Manager+44 (0)7917 373 069JimMc@rusi.org"
}