{
  "url": "https://www.history.com/articles/judaism",
  "title": "Judaism: Founder, Beliefs, Sects, History & Holidays",
  "text": "Judaism Beliefs and Symbol Jewish people believe there is only one God who has established a covenant, or special agreement, with them. Their God communicates to believers through prophets and rewards good deeds while also punishing evil. Most Jews (with the exception of a few groups) believe that their Messiah hasn’t yet come—but will one day. Jewish people worship in holy places known as synagogues, and their spiritual leaders are called rabbis. The six-pointed Star of David is the symbol of Judaism. Founder of Judaism According to the Torah, God first revealed himself to a Hebrew man named Abraham, who became known as the founder of Judaism. Jews believe that God made a special covenant with Abraham and that he and his descendants were chosen people who would create a great nation. Abraham’s son Isaac and his grandson Jacob also became central figures in ancient Jewish history. Jacob took the name Israel, and his children and future generations became known as Israelites. More than 1,000 years after Abraham, the prophet Moses led the Israelites out of Egypt after being enslaved for hundreds of years. According to scriptures, God revealed his laws, known as the Ten Commandments, to Moses at Mount Sinai. Jewish Holy Books: Torah, Talmud and More The Jewish sacred text is called the Tanakh, which is also known as the Hebrew Bible. It includes the same books as the Old Testament in the Christian Bible, but they are placed in a slightly different order. The Torah—the first five books of the Tanakh—outlines laws for Jews to follow and explains the origins of the Jewish faith. It is sometimes referred to as the Pentateuch. Many other important Jewish manuscripts were composed in later years. These offered insights into how the Tanakh should be interpreted and documented oral laws that were previously not written down. Around A.D. 200, scholars compiled the Mishnah, a text that describes and explains the Jewish code of law that had been orally communicated up to that point. The first version of the Talmud, a collection of teachings and commentaries on Jewish law, was finalized around the third century A.D. The Talmud contains the Mishnah and another text known as the Gemara, which examines the Mishnah. The combined texts include the interpretations of thousands of rabbis and outline the importance of 613 commandments of Jewish law. A second version of the Talmud was completed during the fifth century. Judaism embraces several other written texts and commentaries. One example is the 13 Articles of Faith, which was written by the Jewish philosopher Maimonides. Jewish Sects: Orthodox, Conservative, Reform and More There are several sects in Judaism, which include: Orthodox Judaism: Orthodox Jews are typically known for their strict observance of traditional Jewish law and rituals. For instance, most believe Shabbat should not involve working, driving or handling money. Orthodox Judaism is a diverse sect that includes several subgroups, including Hasidic Jews. This form started in the 18th century in Eastern Europe and holds different values than traditional or ultra-Orthodox Judaism. Hasidic Jews emphasize a mystical experience with God that involves direct communion through prayer and worship. Chabad is a well-known Orthodox Jewish, Hasidic movement. Reform Judaism: Reform Judaism is considered a liberal sect that values ethical traditions over strict observance of Jewish laws. Followers promote progressive ideas and adaptation. Most of the Jews living in the United States follow Reform Judaic traditions. Conservative Judaism: Many people consider this form of Judaism somewhere in between Orthodox and Reform Judaism. Typically, conservative Jews honor the traditions of Judaism while allowing for some modernization."
}