{
  "url": "https://www.russianbrideguide.com/about_russia/regions/novgorodskaya_oblast.shtml",
  "title": "Information About Russian Region Novgorodskaya Oblast.",
  "text": "Novgorodskaya Oblast is situated in the northwestern part of the Russian (East European) plain. The oblast spreads from the west to the east to the distance of 385 km, and from the north to the south to 250 km. It borders upon Pskovskaya, Tverskaya, Leningradskaya and Vologodskaya Oblasts. The area of the region is 55,3 thousand sq. km. Due to the convenient geographical position it is connected with Moscow and Saint Petersburg. Through its territory the railway and highway Saint Petersburg - Moscow run. The oblast is rich in mineral and radon springs and therapeutic muds (the resort \"Staraya Russa\" is widely known since XIX century). But the basic wealth here is the forest. Even now woods occupy 42 % of the total area of the region. The population of Novgorodskaya Oblast (in 1995) is 744 thousand people. One of the leading directions of development of the city is tourism. Each year about 1 million tourists visit Novgorod. The climate of Novgorodskaya Oblast is moderate continental, similar to the maritime one. Precipitations vary from 540 to 750 mm. Numerous lowlands are occupied with lakes. Such lakes as Ilmen, Seliger, Veliye, Valdai and others attract tourists by their beauty and size. Present Novgorodskaya Oblast was formed on July 5, 1944. The area is 55,3 thousand sq. km. (0,32 % of the total area of the Russian Federation). Distance to Moscow is 606 km. The city includes 2 districts: Leninsky and Oktyabrsky. There are other towns such as Borovichi (1770) and Staraya Russa (1167) in Novgorodskaya Oblast. Earlier the region was a part of Leningradskaya Oblast. Since XVIII century the region was included into the St.-Petersburg province. In 1727 the Novgorod province (existed till 1927) was separated from the St.-Petersburg province. One of the basic features of this region is that it is the historical and cultural successor of Northern Russia, to be more precise, of the Novgorod Republic with its centre Veliky Novgorod. The republic covered almost the whole Russian North. As a legacy Novgorod acquired powerful folklore that has not been interrupted until now. The folklore of Novgorodskaya oblast and the variety of its genres keep researchers surprising. And it makes the picture encouraging. [ About Russia ] [ Listen to the national anthem of Russia ] [ The State flag ] [ The State emblem ] [ Power structure of Russia ] [ Regions of Russia ] [ Cities of Russia ] [ Nations of Russia ]"
}