{
  "url": "https://arstechnica.com/space/2026/02/unable-to-tame-hydrogen-leaks-nasa-delays-launch-of-artemis-ii-until-march/",
  "title": "Unable to tame hydrogen leaks, NASA delays launch of Artemis II until March - Ars Technica",
  "text": "The launch of NASA’s Artemis II mission, the first flight of astronauts to the Moon in more than 53 years, will have to wait another month after a fueling test Monday uncovered hydrogen leaks in the connection between the rocket and its launch platform at Kennedy Space Center in Florida. “Engineers pushed through several challenges during the two-day test and met many of the planned objectives,” NASA said in a statement following the conclusion of the mock countdown, or wet dress rehearsal (WDR), early Tuesday morning. “To allow teams to review data and conduct a second Wet Dress Rehearsal, NASA now will target March as the earliest possible launch opportunity for the flight test.” The practice countdown was designed to identify problems and provide NASA an opportunity to fix them before launch. Most importantly, the test revealed NASA still has not fully resolved recurring hydrogen leaks that delayed the launch of the unpiloted Artemis I test flight by several months in 2022. Artemis I finally launched successfully after engineers revised their hydrogen loading procedures to overcome the leak. Now, the second Space Launch System (SLS) rocket is on the cusp of launching a crew for the first time. The Artemis II mission will send four astronauts inside NASA’s Orion spacecraft on a loop around the far side of the Moon on the first crewed lunar flight since 1972, paving the way for future expeditions to land humans at the Moon’s south pole. Going into the countdown rehearsal, NASA officials hoped a smooth test would clear the way to launch the Artemis II mission as soon as Sunday, February 8. NASA has only a handful of launch opportunities for Artemis II each month, when the Moon is in the right location in its orbit to allow the Orion spacecraft to fly a so-called free return trajectory and come back to Earth for a safe reentry and splashdown."
}