{
  "url": "https://en.wikipedia.org/wiki/B.A.P_(South_Korean_band)",
  "title": "B.A.P (South Korean band) - Wikipedia",
  "text": "B.A.P (South Korean band) B.A.P (Korean: 비에이피; an acronym for Best Absolute Perfect), was a South Korean boy band that was created by TS Entertainment. The group, originally consisting of Yongguk, Himchan, Daehyun, Youngjae, Jong-up, and Zelo, debuted with the song \"Warrior\" in 2012. B.A.P quietly disbanded on February 18, 2019, following the group's contract expiration with TS Entertainment.[3] In 2024, the group officially reunited under the name Bang & Jung & Yoo & Moon (Korean: 방용국&정대현&유영재&문종업) to release their next album, Curtain Call in August. Members Zelo and Himchan did not take part in the comeback as a result of Zelo's military service and Himchan's sexual assault convictions.[4] History [edit]2011: Pre-debut [edit]Group leader[5] Yongguk was the first member to be introduced in 2011, featuring on labelmate Song Ji-eun's song \"Going Crazy\".[6] He also made a solo debut on August 12 with the single \"I Remember\", featuring Beast's Yang Yo-seob.[7] Himchan was the second member to be introduced to the public, as an MC for MTV Korea television program The Show.[8] On November 23, Zelo was introduced as the third member of the group through a collaboration with Yongguk as the group Bang&Zelo.[9][unreliable source?] The duo released the single \"Never Give Up\".[10][unreliable source?] 2012: Warrior, Power, No Mercy, Crash and Stop It [edit]In January 2012, the group starred in the reality program Ta-Dah, It's B.A.P, which aired on SBS MTV.[11] The show focused on how the six members play the role of aliens from a different planet who worked together to debut as B.A.P and invade Earth to help save their dying planet, Planet Mato.[11] On January 25, the group's debut single \"Warrior\" was released, with MTV Korea describing it as \"powerful and charismatic\".[12][13] Nancy Lee of Enews World noted that the group had set out to differentiate themselves from the \"pretty-boy\" male idol archetype prevalent in the K-pop music industry with their \"tough, bad boy image\".[14] On February 3, 2012, the corresponding EP Warrior entered Billboard's World Albums Chart at #10.[15] In South Korea, Warrior sold over 10,000 copies within just two days of release.[16] In March, the group released a follow-up single, \"Secret Love\",[17] and in April they made a comeback with the single \"Power\" and EP of the same name.[18][unreliable source?][19] Upon its release, Power sold out its initial batch of 30,000 copies[20][unreliable source?] and entered at #10 on the Billboard World Albums Charts. B.A.P's third EP, No Mercy, was released digitally on July 19 and physically on July 24. On August 30 the repackaged version of the EP, renamed Crash, was released. On October 23, B.A.P released their fourth single and EP, titled \"Stop It\". 2013: One Shot and Japanese debut [edit]In February 2013, the group began releasing material from their fifth EP, One Shot.[21][unreliable source?][22][unreliable source?] On February 21, the EP ranked No.1 on Billboard's World Albums chart.[23] In May, King Records, the Japanese record label that once signed Rain, signed B.A.P.[1] They released their first Japanese music video for \"Warrior\" on YouTube on September 13, and their album and single were officially released on October 9.[24] The group's sixth EP, Badman, was released on August 6 with the promotional singles \"Coffee Shop\", \"Hurricane\" and \"Badman\".[25][unreliable source?] 2014: First Sensibility, world tour, B.A.P Unplugged 2014 and lawsuit [edit]On February 3, 2014, B.A.P released their first full-length studio album First Sensibility, containing a total of thirteen tracks including the title track \"1004 (Angel)\".[26][unreliable source?] Upon its release, the album topped the Billboard World Albums Chart, proving the group's international popularity.[27] In Korea, First Sensibility also topped the Hanteo and Gaon monthly charts for February.[28][unreliable source?][29][unreliable source?] The group took their first music show win on Show Champion with \"1004 (Angel)\"[30][unreliable source?] and went on to take two more wins with the single. On April 3, B.A.P released their third Japanese single, \"No Mercy\", and ranked at #2 on Oricon's daily and weekly singles charts.[31][unreliable source?] Following promotions of \"1004 (Angel)\", the group commenced the B.A.P Live On Earth 2014 Continent Tour with a two-day concert in Seoul, with an estimated audience of 20,000 attendees.[32][unreliable source?] This was their second solo concert in Korea. The group went on to hold a total of 23 concerts in cities throughout the United States, Asia, Australia, and Europe during the tour.[33] Through the tour, they released the EP B.A.P Unplugged 2014. On August 11, they released their fourth Japanese single, \"Excuse Me\".[34][unreliable source?] On October 27, TS Entertainment announced that they had cancelled the South American portion of the concert tour, in order to give the group members time to rest.[35] On November 27, it was reported that the group had filed a lawsuit against their label to nullify their contract, claiming unfair working conditions and profit distribution, including statements claiming that of the US$9 million the group had earned over the three years, each member had been paid a total of US$18,000.[36] However, the following day, TS Entertainment issued a press release refuting the claims made, stating that there were \"neither such maltreatment to the artists nor unfair clauses in the contract\".[37] Their statements were challenged when B.A.P released another statement claiming lack of accountability and saying that they were considering filing for defamation of character.[38] 2015: Settlement with TS and Matrix [edit]On August 1, 2015, B.A.P. returned to TS Entertainment after both parties reached a settlement.[39][unreliable source?] They made their comeback with their eighth EP, Matrix, and the title track \"Young, Wild & Free\". The free showcase \"BAP 151115\" was held on November 15 at Dongdaemun Design Plaza[40][unreliable source?] and the music video for \"Young, Wild & Free\" was released the following day.[41][42][unreliable source?] On November 27, 2015, exactly one year after the lawsuit, they received a music show win for the single on Music Bank. 2016: Carnival, Put 'Em Up, Noir, and Fly High, Bang Yongguk's Hiatus [edit]In February, they released their fifth extended play, Carnival, containing six songs. In March, they released their first Japanese studio album, Best. Absolute. Perfect. The album contained thirteen songs. Three of them (\"New World\", \"Kingdom\", and \"Back in Time\") were original Japanese songs. Between April–July, B.A.P performed on their Live On Earth 2016 tour, including dates in the U.S., Canada, Mexico, Italy, Finland, Germany, Poland, Australia, New Zealand, the U.K., and Russia.[43][44] In August, they released the fifth single \"Put 'Em Up\". On October 25, 2016, TS Entertainment revealed that Yongguk will not be participating in the promotions for B.A.P's upcoming full-length album, Noir, due to anxiety disorders. In November, B.A.P returned with their second studio album, Noir along with the music video for title song \"Skydive\". With Noir, B.A.P reclaimed their title as the K-Pop act with the most No.1 Albums on Billboard's World Album chart.[45] Noir included standout track \"Confession\", a duet by rappers Bang Yongguk and Zelo set to a symphonic chorus that directly addressed their feelings during the lawsuit and subsequent hiatus. On November 18, the music video for their 6th Japanese single, Fly High was published on YouTube, while a physical release on December 7 included the song \"Fire Flame\" and a Japanese version of \"With You\".[citation needed] 2017–2019: Rose, Blue, Ego and departure from TS Entertainment [edit]In March 2017, B.A.P released their sixth single album, Rose. Yongguk returned from his four-month hiatus to join the rest of the group for promotions. The lead track, \"Wake Me Up\", was recognized by Billboard's Jeff Benjamin as the group's \"most personal and accomplished single yet\".[46] The EP focused on social issues, with the \"Wake Me Up\"[47] music video addressing mental health issues, whilst the first track \"Dystopia\" directly attacked the idea of living in any so-called utopias, disregarding them all as illusions. On June 28, 2017, the group's second Japanese studio album, Unlimited, was released. On September 5, 2017, B.A.P released their seventh single album, Blue, with \"Honeymoon\" serving as the title track.[48][unreliable source?] On December 13, 2017, B.A.P released their eighth single album, Ego, with \"Hands Up\" serving as the title track.[49][unreliable source?] On March 28, 2018, B.A.P released their third Japanese studio album, Massive. In 2018, members Yongguk and Zelo left the group after their contract with TS Entertainment expired on August 19 and December 2, respectively. On February 18, 2019, the remaining four members also left TS Entertainment.[50] However, member Jongup confirmed the possibility of reunion in the future.[51] 2024: Documentary and reunion [edit]On June 12, 2024, B.A.P announced a documentary titled \"Man on the Moon\". In the teaser, which included Bang Yong-guk, Moon Jong-up, Jung Dae-hyun and Yoo Young-jae, announced plans to reunite and release new music. It is unclear if Zelo will be involved in the comeback due to him undertaking his mandatory military service.[2] On July 2, MA Entertainment confirmed former B.A.P members Bang Yongguk, Jung Daehyun, Yoo Youngjae, and Moon Jongup would be returning as a team.[52] The album, Curtain Call, was released on August 8, with the group promoting under the name \"Bang & Jung & Yoo & Moon.\"[53] On November 28, MA Entertainment announced that the group would return with a winter album called Christmas With You.[54] On September 9, 2025, Daehyun stated in an interview that the members would go back to their own individual activities, and that a future reunion, while not impossible, would be difficult due to the members' separate contracts.[55] Artistry and influences [edit]During the group's debut, all of the members dyed their hair blonde.[56] The group's members have played a role in their image and musical direction, and commentators have noted a distinction between their \"tough, bad-boy\" image and other K-pop boy groups.[14] The group's leader Yongguk has previously made comments on the influence that African American musicians have had on him, citing 50 Cent, P. Diddy, Pharrell and other rappers as musical influences.[57] He played a role in the production of all the tracks on B.A.P's debut EP Warrior.[56][58][unreliable source?] In addition, group member Himchan is a multi-instrumentalist influenced by Korean traditional music.[59][60][unreliable source?] He plays a number of traditional instruments including daegeum, janggu, kkwaenggwari and jing in addition to more traditional instruments including guitar, piano, and violin.[60] All of the group's members are influenced by R&B musicians; Jongup has cited hip hop and dance music as influences and said that Chris Brown is one of his idols, while Zelo has said he looks up to will.i.am and Kanye West.[61] Daehyun cites Shin Yong-jae among his musical influences while Youngjae cites neo soul musicians as well as Musiq Soulchild and Jay Park.[62] B.A.P has been named a \"versatile group\" by MTV Korea,[13] with Yun Seong-yeol of Star News Korea lauding their charisma and on-stage performances, as well as Yongguk and Zelo's rapping and Daehyun and Youngjae's vocal abilities.[63] Members [edit]Former - Yongguk (용국; 2012–2018, 2024) - Himchan (힘찬; 2012–2019) - Daehyun (대현; 2012–2019, 2024) - Youngjae (영재; 2012–2019, 2024) - Jongup (종업; 2012–2019, 2024) - Zelo (젤로; 2012–2018) Timeline [edit]Discography [edit]Filmography [edit]Television [edit]Concerts and tours [edit]- B.A.P Live on Earth 2013 (2013) - B.A.P 1st Japan Tour Warrior Begins (2013) - B.A.P Live on Earth 2014 Continent Tour (2014) - B.A.P Live on Earth 2016 World Tour[64] (2016) - B.A.P 2nd Japan Tour Be.Act.Play (2017) - B.A.P 2017 World Tour Party Baby! (2017) - B.A.P 3rd Japan Tour Massive (2018) - B.A.P 2018 Live Limited (2018) - B.A.P Forever Tour (2018) Awards and nominations [edit]B.A.P has won 29 awards out of 38 nominations, including three MTV Europe Music Awards, two Japan Gold Disc Awards, three Gaon Chart Music Awards, and eight So-Loved Awards. Notes [edit]References [edit]- ^ a b \"B.A.P\". King Record Company. Archived from the original on October 5, 2018. Retrieved June 8, 2013. - ^ a b Chin, Carmen (June 13, 2024). \"B.A.P announce reunion and new music in new documentary teaser\". NME. Retrieved June 14, 2024. - ^ Im, Eun-byel (February 18, 2019). \"[K-talk] After 7 years, B.A.P disbands\". The Korea Herald. Archived from the original on February 18, 2019. Retrieved February 25, 2019. - ^ \"4인조 B.A.P 가시화…방용국·정대현·유영재·문종업, 내달 컴백\". Newsis. July 5, 2024. - ^ \"송지은 래퍼\" 방용국, 과거 힙합씬 활동사진 공개 '훈훈포스' [TS Entertainment reveals past photos of Ji Eun's rapper, Bang Yong Guk]. Newsen Power News (in Korean). Newsen. March 8, 2011. Archived from the original on March 15, 2011. Retrieved January 23, 2012. - ^ Kim, Eun-gu (March 4, 2011). \"민효린 섬뜩한 변신...송지은 '미친거니' 뮤비 완성도↑\". Edaily (in Korean). Archived from the original on July 24, 2021. Retrieved February 13, 2021. - ^ Hong, Jeong-won (August 9, 2011). '나는랩퍼다' 방용국, 첫 공식데뷔작 '트랜스포머' 자켓공개. Newsen (in Korean). Archived from the original on November 14, 2020. Retrieved November 9, 2020. - ^ \"'남자 시크릿' 방용국 이은 두번째 멤버 힘찬 공개\". OhmyStar (in Korean). August 24, 2011. Archived from the original on July 24, 2021. Retrieved February 13, 2021. - ^ \"TS Entertainment introduced Zelo, Bang Yong Guk's sub-unit partner\". 6Theory Media. Archived from the original on January 28, 2012. Retrieved January 23, 2012. - ^ \"Bang & Zelo release \"Never Give Up\" MV\". 6Theory Media. Archived from the original on January 3, 2012. Retrieved January 23, 2012. - ^ a b Hong, Lucia (January 26, 2012). \"New boy band B.A.P's debut documentary to air in 8 Asian countries\". 10asiae News. 10asiae (ⓒ 10아시아). Archived from the original on September 27, 2013. Retrieved February 28, 2012. - ^ \"2012-01-25\" 2012년 빛낼 아이돌 출격 임박..'신고 합니다!' (in Korean). Star News. January 25, 2012. Archived from the original on January 30, 2012. Retrieved January 26, 2012. - ^ a b Xu, Tina (January 25, 2012). \"B.A.P makes long awaited debut with 'Warrior'\". MTV Korea. Viacom International Inc. Archived from the original on January 30, 2012. Retrieved January 26, 2012. - ^ a b Lee, Nancy (January 26, 2012). \"B.A.P 'Warrior' Music Video Released\". enewsworld. CJ E&M. Archived from the original on January 2, 2013. Retrieved March 28, 2012. - ^ \"Billboard World Albums Chart (Week of February 12, 2012)\". Billboard. Prometheus Global Media. February 3, 2012. Archived from the original on September 16, 2015. Retrieved February 4, 2012. - ^ \"B.A.P, 데뷔 앨범 1만장 발매 이틀만에 '완판' [B.A.P's debut album 'Warrior' sells 10,000 copies in 2 days]\" (in Korean). TV Report. January 25, 2012. Archived from the original on January 30, 2012. Retrieved February 12, 2012. - ^ Suk, Monica (February 7, 2012). \"B.A.P to go on stage with follow-up song in March\". 10asiae News. 10asiae (ⓒ 10아시아). Archived from the original on September 27, 2013. Retrieved February 28, 2012. - ^ \"The 6 'Warriors' of B.A.P will be making a comeback next week!\". Allkpop. 6theory Media). April 16, 2012. Archived from the original on April 20, 2012. Retrieved April 16, 2012. - ^ Baek, Ji-eun (April 20, 2012). \"B.A.P, '파워' 티저 공개! 헤어변신 '봉인해제'\". Sports Chosun (in Korean). Archived from the original on April 27, 2021. Retrieved April 27, 2021. - ^ \"B.A.P. sells out their first batch of 30,000 copies\". Allkpop. May 3, 2012. Archived from the original on July 20, 2012. Retrieved March 10, 2016. - ^ \"B.A.P releases video teaser for \"One Shot\"\". Allkpop. February 7, 2013. Archived from the original on February 9, 2013. Retrieved February 7, 2013. - ^ \"B.A.P releases mini album + 7-minute long MV for \"One Shot\"\". Allkpop. February 11, 2013. Archived from the original on February 15, 2013. Retrieved February 11, 2013. - ^ \"World Music: Top World Albums Chart\". Billboard. March 2, 2013. Retrieved March 10, 2016. - ^ \"(B.A.P) Japan 1st single \"Warrior\" out October 9th\". King Records. July 26, 2013. Archived from the original on August 9, 2013. Retrieved July 26, 2013. - ^ \"B.A.P releases album cover + tracklist for 'BADMAN'\". Allkpop. July 28, 2013. Archived from the original on August 1, 2013. Retrieved July 29, 2013. - ^ \"BAP Ready For a Comeback With 1st Full-Length Album 'First Sensibility'\". KpopStarz. January 15, 2014. Archived from the original on January 18, 2014. Retrieved July 26, 2013. - ^ \"World Albums Chart\". Billboard. February 22, 2014. Retrieved April 22, 2021. - ^ jennywill (March 2, 2014). \"B.A.P's 'First Sensibility' tops Hanteo's February monthly chart\". Allkpop. Archived from the original on October 6, 2014. Retrieved July 19, 2014. - ^ GhostWriter (March 6, 2014). \"Gaon Chart releases chart rankings for the month of February 2014\". Allkpop. Archived from the original on August 16, 2014. Retrieved July 19, 2014. - ^ alim17 (February 12, 2014). \"B.A.P celebrate their first Music Show Victory on this week's 'Show Champion'\". Allkpop. Archived from the original on April 23, 2017. Retrieved July 19, 2014. {{cite news}} : CS1 maint: numeric names: authors list (link) - ^ Dianna Shin (April 3, 2014). \"B.A.P Japan Single, 'NO MERCY' Comes In Second On Oricon Daily Single Chart\". KpopStarz.com. Archived from the original on April 29, 2014. Retrieved August 7, 2014. - ^ \"B.A.P Bring in 20,000 Fans for Their 'BAP Live on Earth Seoul 2014'\". Allkpop. March 9, 2014. Archived from the original on October 6, 2014. Retrieved July 19, 2014. - ^ Benjamin, Jeff (March 13, 2014). \"B.A.P to Return Stateside for Four 'Live on Earth 2014' Tour Dates\". Billboard. Archived from the original on September 23, 2014. Retrieved November 9, 2014. - ^ \"B.A.P Releases 4th Japanese Single\". Allkpop. August 11, 2014. Archived from the original on August 11, 2014. Retrieved August 11, 2014. - ^ Hong, Grace Danbi (October 28, 2014). \"B.A.P Cancels South American Tour and Announces Temporary Rest Period\". CJ E&M enewsworld. Mwave. Archived from the original on October 28, 2014. Retrieved November 27, 2014. - ^ Kim, Hyung-woo; Hong, Grace Danbi (November 27, 2014). \"TS Entertainment Checking on B.A.P′s Lawsuit to Nullify Contract\". Newsen. Mwave. Archived from the original on November 30, 2014. Retrieved November 27, 2014. - ^ Ock, Hyun-ju (November 28, 2014). \"Star agency refutes B.A.P slave contract controversy\". Kpop Herald. Archived from the original on November 29, 2014. Retrieved November 28, 2014. - ^ \"[단독] B.A.P vs TS, 첫 변론기일 내년 2~3월 예정...답변서 제출 아직\". OBS News (in Korean). December 22, 2014. Archived from the original on December 24, 2014. Retrieved December 24, 2014. - ^ \"[BREAKING] B.A.P returns to TS Entertainment after long legal battle\". Allkpop. Archived from the original on January 8, 2018. Retrieved March 10, 2016. - ^ \"B.A.P gets ready to strike Seoul with epic live and free concert\". Koreaboo.com. October 4, 2015. Archived from the original on March 4, 2016. Retrieved March 10, 2016. - ^ \"B.A.P – Young, Wild & Free M/V\". YouTube. November 15, 2015. Archived from the original on April 22, 2017. Retrieved March 10, 2016. - ^ \"The kings are finally back! B.A.P are 'Young, Wild, & Free' in their 'MATRIX' album\". Allkpop. November 15, 2015. Archived from the original on March 4, 2016. Retrieved March 10, 2016. - ^ \"B.A.P Announces North America Dates for 2016 Live on Earth World Tour\". Fuse. Archived from the original on April 30, 2016. Retrieved May 9, 2016. - ^ Adrina (January 11, 2016). \"#LOE2016: B.A.P Announces Locations For Their 2016 \"Live On Earth\" World Tour\". Hype.my. Archived from the original on May 10, 2016. Retrieved May 9, 2016. - ^ Benjamin, Jeff (November 15, 2016). \"B.A.P Reclaim Title as K-Pop Act With Most No. 1s on World Albums With 'Noir'\". Billboard. Retrieved March 26, 2017. - ^ Benjamin, Jeff (March 13, 2017). \"Why B.A.P's 'Wake Me Up' Is the K-Pop Act's Most Personal & Accomplished Single Yet\". Billboard. Retrieved March 26, 2017. - ^ 1theK (원더케이) (March 6, 2017), [MV] B.A.P _ WAKE ME UP, archived from the original on October 12, 2017, retrieved August 3, 2017 {{citation}} : CS1 maint: numeric names: authors list (link) - ^ \"B.A.P Drops Another Beautiful Trailer For \"Honeymoon\"\". Soompi. Archived from the original on August 21, 2017. Retrieved August 21, 2017. - ^ Ventinilla, Jay (December 16, 2017). \"B.A.P Releases 8th Single Album, Ego!\". The Kraze Magazine. Archived from the original on December 19, 2017. Retrieved December 16, 2017. - ^ Im, Eun-byel (February 18, 2019). \"[K-talk] After 7 years, B.A.P disbands\". The Korea Herald. Archived from the original on February 18, 2019. Retrieved February 25, 2019. - ^ \"[단독인터뷰] B.A.P 종업 \"해체 아쉬워...언젠가 다시 모이고파\"\". Naver (in Korean). February 18, 2019. Archived from the original on July 16, 2019. Retrieved February 26, 2019. - ^ \"B.A.P to return with 4 members in August\". July 2, 2024. Retrieved July 3, 2024. - ^ \"4인조 B.A.P 가시화…방용국·정대현·유영재·문종업, 내달 컴백\". Newsis. July 5, 2024. - ^ \"Winter album announcement\". Instagram. November 28, 2024. - ^ \"정대현 \"B.A.P 방용국·유영재, 음방 놀러와…방정유문 컴백 기회 열려 있다\" [인터뷰 스포]\". Sports Today. November 2025. - ^ a b Hwang Mi-Hyeon (February 6, 2012). \"B.A.P \"지구정복! 결코 헛된 꿈이 아니랍니다\"[인터뷰\" [B.A.P is determined to conquer the world with their music]. Osen (in Korean). Intigram. Archived from the original on November 2, 2013. Retrieved March 31, 2012. - ^ \"Exclusive interview with Bang & Zelo!\". Daily Kpop News. Archived from the original on January 30, 2012. Retrieved February 1, 2012. - ^ \"B.A.P is determined to conquer the world with their music\". Allkpop. 6theory Media. February 2, 2012. Archived from the original on April 19, 2012. Retrieved March 30, 2012. - ^ Hwang Hyo-Jin (March 9, 2012). \"(INTERVIEW) B.A.P Bang Yong-guk, Him Chan\". 10asia. ⓒ 10아시아. Archived from the original on September 26, 2013. Retrieved March 28, 2012. - ^ a b \"B.A.P's Himchan revealed to be a graduate of top tier arts schools\". 6theory Media. Archived from the original on March 19, 2012. Retrieved March 11, 2012. - ^ Hwang Hyo-Jin (March 7, 2012). \"B.A.P – My name is 젤로, 종업\". 10asia News (in Korean). 10asiae. Archived from the original on September 25, 2013. Retrieved March 30, 2012. - ^ Hwang Hyo-Jin (March 7, 2012). \"B.A.P – My name is 영재, 대현\". 10asia News (in Korean). 10asiae. Archived from the original on September 26, 2013. Retrieved March 30, 2012. - ^ Yun Seong Yeol (February 16, 2012). \"New boy group B.A.P says, \"We want to conquer the earth!\" (Interview)\". Star News. STARNEWS. Archived from the original on November 2, 2013. Retrieved March 30, 2012. - ^ \"B.A.P, 5대륙 15개국 30회 월드투어 개최 (in Korean). Naver. January 10, 2016. Archived from the original on October 18, 2017. Retrieved January 10, 2016. - ^ Park, Mi-ae (January 22, 2015). \"[24th 서울가요대상]엑소, 2년 연속 대상 수상...역시 대세\" [[24th Seoul Music Awards] Exo won the grand prize for 2 years in a row...also trending] (in Korean). E Daily. Archived from the original on May 5, 2021. Retrieved January 25, 2022 – via Naver. - ^ \"So-Loved Awards 2013\". Korea Foundation for International Culture Exchange (in Korean). January 17, 2014. Archived from the original on April 23, 2022. Retrieved April 23, 2022. - ^ Gil, Hye-seong (December 10, 2012). \"빅뱅·2NE1, 유럽K팝어워즈 남녀그룹상..B.A.P, 신인상\" [Big Bang, 2NE1 wins Male and Female Group Award at Europe K-pop Awards ... BAP, Rookie of the Year Award]. Star News (in Korean). Archived from the original on April 23, 2022. Retrieved April 23, 2022 – via Naver. - ^ \"So-Loved Awards 2013\". Korea Foundation for International Culture Exchange (in Korean). January 17, 2014. Archived from the original on April 23, 2022. Retrieved April 23, 2022. - ^ \"So-Loved Awards 2014\". Korea Foundation for International Culture Exchange (in Korean). December 1, 2014. Archived from the original on April 23, 2022. Retrieved April 23, 2022. - ^ \"'소리바다' 엑소, 韓최초 5년연속 대상..트와이스는 음원퀸[종합]\". osen.mt.co.kr (in Korean). Osen. September 20, 2017. Archived from the original on June 12, 2018. Retrieved September 20, 2017. External links [edit]- Official website (in Korean) - Official website (in Japanese) - B.A.P (South Korean band) - Musical groups established in 2012 - K-pop music groups - South Korean dance music groups - South Korean boy bands - 2012 establishments in South Korea - King Records (Japan) artists - South Korean hip-hop groups - Melon Music Award winners - TS Entertainment artists - Musical groups reestablished in 2024"
}