{
  "url": "https://en.wikipedia.org/wiki/Martini_(cocktail)",
  "title": "Martini (cocktail) - Wikipedia",
  "text": "Martini (cocktail) The martini is a cocktail made with gin and vermouth and garnished with an olive, a lemon twist, or both. Over the years, the martini has become one of the best-known mixed alcoholic beverages. A common variation, the vodka martini, uses vodka instead of gin for the cocktail's base spirit. Preparation [edit]By 1922, the martini had reached its most recognizable form in which London dry gin and dry vermouth are combined at a ratio of 2:1, stirred in a mixing glass with ice cubes, with the optional addition of orange or aromatic bitters, and then strained into a chilled cocktail glass.[1] Over time, the generally expected garnish became the drinker's choice of a green olive or a twist of lemon peel. A dry martini in modern terminology is made with a dash or only a hint of vermouth.[2] Ordering a martini \"extra dry\" will result in even less or no vermouth added. In the Roaring Twenties, it became a common drink order. Over the course of the 20th century, the amount of vermouth steadily dropped. During the 1930s, the ratio was 3:1 (gin to vermouth), and during the 1940s, the ratio was 4:1. During the latter part of the 20th century, 5:1 or 6:1 dry martinis became considered the norm.[3] Drier variations can go to 8:1, 12:1, 15:1 (the \"Montgomery\", after British Field Marshal Bernard Montgomery's supposed penchant for attacking only when in possession of great numerical superiority).[4] In 1966, the American Standards Association (ASA) released K100.1-1966, \"Safety Code and Requirements for Dry Martinis\", a tongue-in-cheek account of how to make a \"standard\" dry martini.[5] The latest revision of this document, K100.1-1974, was published by American National Standards Institute (ANSI), the successor to ASA, though it is no longer an active standard.[6] Origins and mixology [edit]The exact origin of the martini is unclear. The name may derive from the Italian Martini brand of vermouth.[7] Another popular theory suggests it evolved from a cocktail called the Martinez served sometime in the early 1860s at the Occidental Hotel in San Francisco, which people frequented before taking an evening ferry to the nearby town of Martinez, California. Alternatively, residents of Martinez say a bartender in their town created the drink,[8][9] while another source indicates that the drink was named after the town. Indeed, a \"Martinez Cocktail\" was first described in Jerry Thomas's 1887 edition of his Bartender's Guide, How to Mix All Kinds of Plain and Fancy Drinks:[10] - Take 1 dash of Boker's Bitters - 2 dashes of Maraschino - 1 pony [1 fl oz] of Old Tom gin - 1 wine-glass [2 fl oz] of [sweet/Italian] vermouth - 2 small lumps of ice - Shake up thoroughly, and strain into a large cocktail glass. Put a quarter of a slice of lemon in the glass, and serve. If the guest prefers it very sweet, add two dashes of gum syrup. Other bartending guides of the late 19th century contained recipes for numerous cocktails similar to the modern-day martini.[11] For example, Harry Johnson's Bartenders' Manual (1888) listed a recipe for a \"Martini Cocktail\" that consisted in part of half a wine glass of Old Tom gin and a half a wine glass of vermouth.[12] - Fill the glass up with ice - 2 or 3 dashes of gum syrup - 2 or 3 dashes of bitters; (Boker's genuine only) - 1 dash of Curaçao - 1⁄2 wine glassful [1 fl oz] of Old Tom gin - 1⁄2 wine glassful [1 fl oz] of [sweet/Italian] vermouth - Stir up well with a spoon, strain it into a fancy cocktail glass, squeeze a piece of lemon peel on top, and serve. The \"Marguerite Cocktail\", first described in 1904, could be considered an early form of the dry martini, because it was a 2:1 mix of Plymouth dry gin and dry vermouth, with a dash of orange bitters.[13] In his 1907 bartenders' guide The World's Drinks And How To Mix Them, San Francisco mixologist William Boothby provided possibly the earliest recipe for a \"Dry Martini Cocktail\" not only resembling a modern-day martini in the ingredients, but also under that name.[14] Attributing it to one Charlie Shaw of Los Angeles, Boothby's book gave the recipe as follows: Dry Martini Cocktail, à la Charlie Shaw, Los Angeles, Cal. Into a mixing glass place: - Cracked ice - Two dashes orange bitters - Half a jigger of dry English gin (any good brand) - Half a jigger of French vermouth Stir until thoroughly chilled and strain into a stem cocktail glass, squeeze a piece of lemon peel over the top and serve with an olive. The first dry martini is sometimes linked to the name of a bartender who concocted the drink at the Knickerbocker Hotel in New York City in 1911 or 1912.[15] During Prohibition in the United States (1920–1933) the relative ease of illegal gin manufacture led to the martini's rise as the locally predominant cocktail. With the repeal of Prohibition, and the ready availability of quality gin, the drink became progressively drier. In the 1970s and 1980s, the martini came to be seen as old-fashioned and was replaced by more intricate cocktails and wine spritzers, but the mid-1990s saw a resurgence in the drink and numerous new versions.[2] Variations [edit]The traditional martini comes in a number of variations. A perfect martini uses equal amounts of sweet and dry vermouth.[16] A dry martini contains more gin. Some recipes advocate the elimination of vermouth altogether; the playwright Noël Coward is credited with the assertion that \"a perfect Martini should be made by filling a glass with gin, then waving it in the general direction of Italy.\"[17] Similarly, the Churchill martini supposedly favored by Winston Churchill uses no vermouth, and is prepared with gin straight from the freezer and a \"glance\" at a bottle of vermouth,[18] or a \"bow in the direction of France\".[19][20][a] Luis Buñuel used the dry martini as part of his creative process, regularly using it to sustain \"a reverie in a bar\". He offers his own recipe, involving Angostura bitters, in his memoir.[22] A wet martini contains more vermouth; a 50-50 martini uses equal amounts of gin and vermouth. An upside-down or reverse martini has more vermouth than gin.[23] A dirty martini contains a splash of olive brine or olive juice and is typically garnished with an olive.[24] An extra dirty martini typically contains twice the amount of olive brine or juice.[25] A direct martini or naked martini is a regular martini, but prepared by storing the gin in a freezer and then pouring the gin directly into the serving glass with the vermouth instead of stirring it with ice first. This method allows the drink to be served very cold but without the dilution that the traditional stirring method adds. This style of martini is mainly associated with and popularized by Dukes Hotel Bar in London.[26][27] A martini may also be served on the rocks—that is, with the ingredients poured over ice cubes and served in an old fashioned glass.[28] A Gibson is a standard dry martini garnished with cocktail onions instead of olives. The Yale Cocktail is a 6:1 martini with equal parts vermouth and either crème de violette or Creme Yvette, which impart a blue color, and Angostura bitters.[29] Vodka martini [edit]A vodka martini is a cocktail made with vodka and vermouth, a variation of a martini. A vodka martini is made by combining vodka, dry vermouth and ice in a cocktail shaker or mixing glass. The ingredients are chilled, either by stirring or shaking, then strained and served \"straight up\" (without ice) in a chilled cocktail glass. The drink may be garnished with an olive, a \"twist\" (a strip of lemon peel squeezed or twisted), capers, or cocktail onions (with the onion garnish specifically yielding a vodka Gibson).[30] Other meanings of the word [edit]A trend that started in the 1980s, was to use the term \"martini\" to refer to other mostly-hard-liquor cocktails such as Manhattan, Cosmopolitan, whose commonality with the original drink is the cocktail glass in which they are served. There is some debate as to whether or not these are true martinis. In a similar vein, there are \"dessert martinis\" that are not a drink, but are served in martini glasses. Some newer drinks include the word \"martini\" or the suffix \"-tini\" in the name (e.g., appletini, peach martini, chocolate martini, breakfast martini). These are so named because they are served in a cocktail glass. Generally containing vodka, they have little in common with the martini. A porn star martini is a variation of a vodka martini. The vodka is vanilla flavored, and is served with passion fruit juice, accompanied by a shot of Prosecco.[31] Popular variations [edit]- Bacon martini - Chocolate martini - Coconut cloud martini - Espresso martini[32] - China martini, which is actually a flavour variant of Amaro - French martini - Saketini - Vesper cocktail, also sometimes referenced as a Vesper martini Nicotini [edit]A nicotini is any alcoholic drink which includes nicotine as an ingredient. Its name is modeled after the word \"martini\" in the fashion of such drinks as the appletini. It often exudes an amber color.[33] In popular culture [edit]Martinis are often used in art to symbolise joy and closure.[34] - The fictional British Secret Service agent James Bond is famously known for ordering a \"vodka martini, shaken, not stirred\".[35] - The phrase first appears, yet without the specification for \"vodka\", in the fourth book of the Bond novel series by Ian Fleming in Diamonds Are Forever (1956), but the Bond character is not the one that says it.[36] - A variation of the phrase is uttered by the villain Dr. Julius No, in the first Bond film, Dr. No (1962), but again, Bond is not the character who says it.[36] - In Casino Royale, Fleming invented the Vesper martini, with gin, vodka, and Kina Lillet. - It was first uttered by the Bond character himself (Sean Connery), in its entirety, in the third Bond film, Goldfinger (1964).[36] - On the American television show I Dream of Jeannie, Jeannie makes vodka martini gush from a rock in the desert for Captain Nelson, calling it his \"favorite potion\" (though at the time he needed water). - The Australian writer Frank Moorhouse, (famous for creating complex female protagonists such as Edith in Dark Palace), was an uncompromising Martini enthusiast. His novels and short stories are often punctuated with extensive explanations of proper and improper ways to make a Martini. Moorhouse's book, Martini: A Memoir (2005), considers the cocktail as a way of being and a symbol for aspects of his own life. It also includes handy instructions for mixing the perfect Martini. - On the American sitcom M*A*S*H, the main character Benjamin \"Hawkeye\" Pierce has a gin distillery in his tent, which he uses to make martinis in almost every episode. - In the animated television series Family Guy, the dry martini is notably associated with Brian Griffin, the family’s anthropomorphic dog. Brian is frequently depicted drinking dry martinis, which have become a defining characteristic of his personality and a recurring element in the show. See also [edit]Explanatory notes [edit]References [edit]- ^ MacElhone, Harry (1922). Harry's ABC of Mixing Cocktails. Dean & Son. p. 67. Archived from the original (PDF) on 21 August 2020. Retrieved 13 July 2019. - ^ a b \"Shaken or Stirred? A Short History to Celebrate National Martini Day\". The Drink Nation. 19 June 2012. Retrieved 19 July 2012. - ^ \"Drink Recipes: How to Make a Dry Martini, Classic Cocktails\". Thirsty NYC. 6 February 2014. Archived from the original on 6 February 2014. Retrieved 6 February 2014. - ^ Taylor, John (19 October 1987). \"The Trouble With Harry's\". New York Magazine. p. 62. - ^ K100.1-1966 Safety Code and Requirements for Dry Martinis (PDF) (1966 ed.). American Standards Association. 31 August 1966. Archived from the original (PDF) on 11 March 2016. Retrieved 21 February 2016. - ^ K100.1-1974 Safety Code and Requirements for Dry Martinis (PDF) (1974 ed.). American National Standards Institute. 30 August 1974. Archived from the original (PDF) on 26 December 2015. Retrieved 21 February 2016. - ^ \"martini | Origin and meaning of martini by Online Etymology Dictionary\". www.etymonline.com. - ^ Taylor, David (2002). Martini. Silverback Books. p. 8. ISBN 978-1-930603-03-5. - ^ \"The Martini Story\". cityofmartinez.org. City of Martinez. Archived from the original on 31 July 2013. Retrieved 14 July 2013. - ^ Thomas's 1887 \"Martinez Cocktail\" recipe. - ^ Edmunds, Lowell (1998). Martini, Straight Up: The Classic American Cocktail. Johns Hopkins University Press. p. 81. ISBN 978-0-8018-7311-9. - ^ Johnson, Harry (1888). The New and Improved Illustrated Bartenders' Manual; Or: How to Mix Drinks of the Present Style. H. Johnson. p. 38. - ^ Thomas, Stuart (1904). Stuart's Fancy Drinks and How to Mix Them. Excelsior Publishing House. p. 132. - ^ Boothby, Wm (1907). The World's Drinks And How To Mix Them. p. 24. - ^ Gasnier, Vincent (2007). Drinks. DK Adult. p. 376. - ^ \"Making the Perfect Martini\". Archived from the original on 4 April 2015. Retrieved 29 January 2015. - ^ Jeffreys, Henry (5 June 2015). \"The Martini: the epitome of cocktail-hour refinement\". The Guardian. - ^ \"Churchill Martini Cocktail Recipe\". Difford's Guide. Retrieved 18 September 2021. - ^ Bullmore, Joe. \"The martini orders of five great gentlemen\". The Gentleman's Journal. Retrieved 18 September 2021. - ^ Wilson, Jason (21 March 2007). \"Sometimes, Respect Starts With a Pour Down the Drain\". Washington Post. Retrieved 18 September 2021. - ^ \"The \"Churchill Martini\" is Iconic. But is It a Myth?\". 28 September 2020. - ^ Buñuel, Luis (1982). Mon Dernier soupir [My Last Breath] (in French). - ^ Wells, Pete (10 September 2024). \"After Decades of Dry Martinis, It's Great to Go Wet\". The New York Times. - ^ Bloom, Dave (2003). The Complete Bartender's Guide. Carlton Books. p. 95. ISBN 1-84222-736-X. - ^ Babür-Winter, Oset (4 April 2023). \"Here's How to Make the Best Martini in NYC\". Food & Wine. Retrieved 27 April 2024. - ^ Difford, Simon (17 January 2024). \"The story and true history behind the Direct or Naked Martini\". Difford's Guide. Retrieved 17 January 2024. - ^ The Rake (March 2021). \"Ask The Rake: To All The Martinis I've Loved Before\". Retrieved 17 January 2024. - ^ Rombauer, Irma S. (1975). Joy of Cooking. p. 49. [The old-fashioned glass] is increasingly used these days [mid-1970s] by people who prefer their martini 'on the rocks' instead of 'up'—that is, in the rather more fussy and more precise cocktail-glass type of preparation. - ^ Hoefling, Brian D. (2021). The Cocktail Seminars. Abbeville Press. p. 3.11. ISBN 978-0-7892-1400-3. Its closest cousin is a Gibson before the onion goes in, while it's just gin and dry vermouth. The Yale takes a different path to get further aroma and requires no garnishes. - ^ \"How to Make a Vodka Martini\". Esquire. 19 February 2021. - ^ Abraham, Lena (12 October 2018). \"Porn Star Martinis\". Delish.com. Retrieved 29 August 2019. - ^ Cloak, Felicity (28 December 2016). \"How to make the perfect espresso martini\". The Guardian. London, England. Retrieved 27 January 2017. - ^ \"2003: The 3rd Annual Year In Ideas; Nicotini, The\". www.nytimes.com. The New York Times Magazine. Archived from the original on 27 May 2015. Retrieved 28 March 2024. - ^ Shteyngart, Gary (24 April 2024). \"A Martini Tour of New York City\". The New Yorker. Retrieved 26 July 2024. - ^ Cocktails a Complete Guide to Bartending with Over 500 Cocktail Recipes. Boston: MobileReference.com. 2007. ISBN 978-1605011042.[permanent dead link] - ^ a b c Allison, Keith (16 August 2016). \"Martini & Myth Part 3: Shaken, Not Stirred\". Retrieved 7 October 2016. External links [edit]- Media related to Martini (cocktail) at Wikimedia Commons"
}