{
  "url": "https://tristatehazmat.com/",
  "title": "CDL-A Hazmat Truck and Tanker Driver Jobs | Tri-State Hazmat",
  "text": "HAZMAT DRIVER CDL-A JOB OPENINGS AT TRI-STATE Join our team as a trucker and see all 48 states while earning up to $2,500 per driver per week. Our drivers are the most highly compensated across the industry. Become a member of our ELITE Tanker Fleet! Earn up to $100K PLUS Annual Bonus - often over $5000! Top pay, top respect... is there anything else? HAZMAT DRIVERS EARN MORE AT TRI-STATE Get paid what you're worth at Tri-State Trucking! In 2023, our drivers earned: - Out of our drivers with us a full year or longer: - 19% averaged over $100,000 - 48% averaged over $90,000 - 93% averaged over $75,000 107 total drivers have been with Tri-State for the company for one year or longer. READ REAL TRI-STATE DRIVER TESTIMONIALS TRI-STATE HAZMAT DRIVER EMPLOPYEE BENEFITS DRIVER BENEFITS - $1,750 Transition Bonus payable in the first two weeks - Specialized freight - Average Pay $1,700 - $2,700 Per Driver/Per Week COMPANY BENEFITS - 100% employer-paid health insurance option - Paid Vacation - Paid Weekly - Life & Supplemental Insurance - 401k Plan DRIVER REQUIREMENTS - HAZMAT Endorsement - Verifiable Class A CDL - 23 Years of Age or Older - Minimum of 1 year Recent OTR Experience All documents must be agreed to and signed by Tri-State Management prior to hire. HAZMAT-ENDORSED CDL-A DRIVERS START HERE Enter your details below and pre-qualify in 30 minutes. By submitting this form, I agree to the privacy policy. INDUSTRIES SERVED Commercial Explosives Market Sensitive Commodities Hazardous Waste Industry WHY DRIVE FOR TRI-STATE MOTOR TRANSIT? Our drivers are our #1 asset, and as such their equipment has to be the best! Our \"best in class\" equipment features the newest Kenworths, Volvos and Freightliners. Our entire fleet is outfitted with E-logs, refrigerators, APU, SiriusXM, as well as comfortable and spacious sleepers for driver comfort. More Hazmat Truck Driver Benefits: - Paid Vacation up to four weeks - Company match 401k - Seniority and Anniversary Bonuses - up to $10,000/year per Driver HAZMAT DRIVER JOB NEWS ABOUT TRI-STATE MOTOR TRANSIT Welcome to Tri-State Motor Transit (TSMT). We focus on treating our Drivers with the highest level of dignity and respect every single day. We strive to exceed all expectations for safety, security, and customer service. You can trust us to get the job done – THE RIGHT WAY. We are committed to providing our Independent Contractors the top revenue for their time and effort over the road."
}