{
  "url": "https://en.m.wikipedia.org/wiki/Uncle",
  "title": "Uncle - Wikipedia",
  "text": "Uncle An uncle is usually defined as a male relative who is a sibling of a parent or married to a sibling of a parent, as well as the parent of the cousins. Uncles who are related by birth are second-degree relatives. The female counterpart of an uncle is an aunt, and the reciprocal relationship is that of a nephew or niece. The word comes from Latin: avunculus, the diminutive of avus (grandfather), and is a family relationship within an extended or immediate family. [1] A popular colloquial term in English is Unc.[2] In some cultures and families, children may refer to the cousins of their parents as uncle (or aunt). It is also used as a title of respect for older relatives, neighbours, acquaintances, family friends, and even total strangers in some cultures, for example Aboriginal Australian elders. Using the term in this way is a form of fictive kinship. Any social institution where a special relationship exists between a man and his sisters' children is known as an avunculate (or avunculism or avuncularism).[3] This relationship can be formal or informal, depending on the society. Early anthropological research focused on the association between the avunculate and matrilineal descent, while later research has expanded to consider the avunculate in general society. Additional terms [edit]- A half-uncle is the half-brother of one's parent. - A maternal uncle is the brother of one's mother. - A paternal uncle is the brother of one's father. - An uncle-in-law is the uncle of one's spouse or the husband of an individual's aunt or uncle. - A parent's first cousin may be called a second uncle. - A great-uncle[4][5]/granduncle[6]/grand-uncle[7] is the brother of one's grandparent or an uncle of one's father or mother. Genetics and consanguinity [edit]Uncles by birth (brother of a parent) are related to their nieces and nephews on average by 25% (1750 centimorgans) though this can vary considerably.[8] As half-uncles are related through half brothers, they are related by average 12.5%. Non-consanguineous uncles (male spouse of a relative) are not related by blood. Cultural variations [edit]Arabic [edit]In Arabic, one's mother's brother is called Khal خال and the mother's sister is called Khalah خالة. On the father's side, one's father's brother is called Amm عم and the father's sister is called Ammah عمّة. Turkish [edit]In Turkish, one's mother's brother is called dayi, father's brother is amca, and aunt's husband is known as enişte. One's mother's sister is called \"teyze\". Father's sister is \"hala\". Uncle's wife is \"yenge\". Albanian, Slavic, and Persian [edit]In some cultures, like Albanian, Slavic, or Persian, no single inclusive term describing both a person's kinship to their parental male sibling or parental male in-law exists. Instead, there are specific terms describing a person's kinship to their mother's brother (dajë in Albanian, daiyee in Persian, wuj (diminutive: wujek) in Polish) or a person's kinship to their father's brother (xhajë in Albanian, amou in Persian, stryj (diminutive: stryjek) in Polish). An analogous differentiation exists using separate terms to describe a person's kinship to their mother's female sibling (teze in Albanian, khaleh in Persian, ciotka (diminutive: ciocia) in Polish), and a person's kinship to their father's female sibling, (hallë in Albanian, ammeh in Persian, stryjna (diminutive: stryjenka) in Polish). Furthermore, in Persian culture the terms used to describe a person's kinship to their maternal or paternal in-laws bear clear and unambiguous descriptions of that relationship, differentiating the parental in-laws from blood-relatives. For example, there is a specific term describing a person's kinship to the spouse of their paternal uncle (i.e. zan-amou, literally 'wife-of-' amou). This clarifies that kinship is to the spouse of the person's paternal male sibling, as opposed to a blood-relationship. Indigenous Australians [edit]Many Australian Aboriginal and Torres Strait Islander peoples address male respected senior members of the community, known as elders, as \"uncle\" (and women as \"aunty\") as a mark of seniority and respect, whether related or not,[9] such as Uncle Archie (Roach)[10] and Uncle Jack Charles.[11] South Asian [edit]In India, unambiguous names are used for various uncles such as one's father's brother chacha (or kaka). If the brother of one's father is older than one's father then he is called Tauji (or taya or bapuji). One's mother's brother is called Mama. A paternal aunt's husband is called Fufa (or Fuva) and a maternal aunt's husband is called Mausa (or Masa) in Hindi (or Gujarati). Likewise, in neighbouring Bangladesh (and Pakistan), mother's brother is also Mama (or Mamu) as well father's brother as Chacha. A paternal aunt's husband is Phupha and maternal aunt's husband is Khalu. Uncles in popular culture [edit]Due to the loving image of an old but wise and friendly uncle in many cultures the word has been used as a loving nickname for many people. In Tibetan mythology Akhu Tönpa (Uncle Tompa) is a familiar and well-beloved figure. The American national personification Uncle Sam serves as an allegorical fatherly figure to many Americans. Various children's TV hosts have used uncle as their nickname, including Walt Disney (Uncle Walt), Bob Davidse (Nonkel Bob, literally Uncle Bob), Edwin Rutten (who hosted a children's show named De Show van Ome Willem [The Show of Uncle Willem]). The Dutch poet Ome Ko also used uncle as part of his pseudonym. Rich, wise or otherwise eccentric uncles are also popular in works of fiction. Fictional uncles in comics [edit]- Nonkel Fillemon in Urbanus. - Nonkel Vital in De Kiekeboes. - Ome Arie, character in Sjors en Sjimmie. - Oncle Paul, the title character in a Belgian comics series. - Ben Parker, a.k.a. Uncle Ben, the uncle of Spider-Man. - Scrooge McDuck, a.k.a. Uncle Scrooge from the Donald Duck comics. - Uncle Choi by Hui Guan-man. - Uncle Phil in Mickey Finn.[12] Fictional uncles in novels [edit]- Uncle Oswald by Roald Dahl. - Uncle Remus by Joel Chandler Harris. - Uncle Tom by Harriet Beecher Stowe. - Uncle Vanya by Anton Chekhov. - Uncle Wiggily by Howard R. Garis. - Vernon Dursley a.k.a. \"Uncle Vernon\" The uncle by marriage of the protagonist of Harry Potter by J. K. Rowling Fictional uncles in films [edit]- Uncle Buck, played by John Candy in the 1989 eponymous film. - Uncle Fucker, character and song in South Park: Bigger, Longer & Uncut. Fictional uncles in TV series [edit]- Benjen Stark, in the television series Game of Thrones, referred to as \"Uncle Benjen\" by his nephew Jon Snow. - Corrado \"Junior\" Soprano, in the television series The Sopranos, referred to as \"Uncle June\" by his nephew Tony Soprano. - Charlie Harper, in the television series Two and a Half Men, referred to as \"Uncle Charlie\" by his nephew Jake Harper. - Jesse Katsopolis, in the television series Full House and Fuller House, referred to as \"Uncle Jesse\" by his three nieces DJ, Stephanie, and Michelle Tanner. - Philip Banks, a.k.a. Uncle Phil, the uncle-in-law of the titular character in The Fresh Prince of Bel-Air. - Charles O'Casey, also known as \"Uncle Charley\", a character in My Three Sons. - Uncle Deadly, a character in The Muppet Show. - Uncle Fester, the uncle of Wednesday and Pugsley Addams in The Addams Family. - Uncle Grandpa, a character in the eponymous TV series. - Uncle Iroh, a character in Avatar: The Last Airbender, always referred to as \"Uncle\" by his nephew Zuko - Uncle Leo, Jerry's maternal uncle in Seinfeld. - Uncle Jack, title character in a BBC children's TV series. - Uncle Max, a character in the eponymous TV series. - Uncle Ruckus, a character in the television series The Boondocks. No relation. - Grunkle Stan, a character in the television series Gravity Falls. The great-uncle of the main characters. - Uncle Arthur, a character in Bewitched. - Emperor Cloyd and Becky the Enchantress characters of Disenchantment, siblings of Dagmar, maternal uncles of Bean and grandsons to the late Queen Mariabeanie. - Uncle Albert, a character in the television series Only Fools and Horses, paternal great-uncle of Del and Rodney. Fictional uncles in advertising [edit]- Uncle Arthur, mascot of a Guinness stout. - Uncle Ben, mascot of a rice brand. Fictional uncles in music [edit]- Uncle Albert/Admiral Halsey, a 1971 song by Paul and Linda McCartney from the album Ram. See also [edit]References [edit]- ^ Straussman, Min (2021). \"Piblings & Niblings: Do You Know These Words for Aunts, Uncles, Nieces, & Nephews?\". dictionary.com. Retrieved 26 July 2021. - ^ \"Gen Z and Gen Alpha slang terms defined, from 'boujee' to 'unc'\". - ^ Barnard, Alan; Spencer, Jonathan (4 December 2009). The Routledge Encyclopedia of Social and Cultural Anthropology. Routledge. ISBN 9781135236403. - ^ \"Definition of great-uncle in English by Oxford Dictionaries\". oxforddictionaries.com. Archived from the original on 24 April 2019. Retrieved 24 April 2019. - ^ \"Google Ngram Viewer of relative versions of name\". Google Ngram. Retrieved 24 April 2019 – via Google Books. - ^ \"granduncle\". Collins English Dictionary. HarperCollins. OCLC 1120411289. Retrieved 24 April 2019. - ^ \"Definition of grand-uncle in English by Oxford Dictionaries\". oxforddictionaries.com. Archived from the original on 24 April 2019. Retrieved 24 April 2019. - ^ \"Centimorgan Relationship Calculator\". 19 October 2022. - ^ \"Communicating with Aboriginal and Torres Strait Islander Audiences\". Department of the Prime Minister and Cabinet (Australia). 23 February 2016. - ^ \"Archie Roach, Aboriginal musician, songwriter and artist, dead at 66 after 'a remarkable life'\". ABC News. Australian Broadcasting Corporation. 30 July 2022. Retrieved 16 September 2022. - ^ Browning, Daniel (14 September 2022). \"'I called him Uncle': Remembering iconic theatre great Uncle Jack Charles\". ABC News. Australian Broadcasting Corporation. Retrieved 16 September 2022. - ^ \"Lank Leonard\". lambiek.net. External links [edit]- The dictionary definition of uncle at Wiktionary - The dictionary definition of great-uncle at Wiktionary - The dictionary definition of granduncle at Wiktionary"
}