{
  "url": "https://flutrackers.com/forum/forum/local-regional-communities-and-organizations/cidrap/1020173-cidrap-news-briefs-september-30-2025",
  "title": "CIDRAP- NEWS BRIEFS September 30, 2025 - FluTrackers News and Information",
  "text": "https://www.cidrap.umn.edu/all-news FDA conditionally approves drug for prevention, treatment of New World screwworm in cattle News brief 57 minutes ago. Chris Dall, MA Topics New World Screwworm The US Food and Drug Administration (FDA) said today that it has conditionally approved a drug for the prevention and treatment of New World screwworm (NWS) larval infestations in cattle. The FDA said Dectomax-CA1 is eligible for conditional approval in cattle because it addresses an unmet animal health need, and demonstrating its effectiveness would require complex studies. FDA officials say they have determined the drug, which is already fully approved for treatment and control of certain parasites in cattle and swine, is safe and has a \"reasonable expectation\" of effectiveness against NWS. It's also conditionally approved for prevention of NWS reinfestation for 21 days. The move is the latest step by US health and agriculture officials to respond to the flesh-eating parasitic infection, which can cause cattle loss and has been creeping northward from Central America over the last several months. On September 22, Mexico confirmed a case of NWS in a cow located less than 70 miles from the US border. \"We understand the urgency with which America’s farmers and ranchers are asking for tools to fight New World screwworm,\" FDA Commissioner Marty Makary, MD, MPH, said in a press release. \"Today’s conditional approval—first in the U.S. for NWS—shows our dedication to rapidly advancing important animal medicines when they are needed most. We continue to work tirelessly to complete review of other NWS products to protect multiple animal species in the U.S.\" Re-emergence in Central America Carried by the Cochliomyia hominivorax fly, NWS fly larvae burrow into the flesh of cattle and other warm-blooded animals, causing severe wounds and death if untreated. The pest was eradicated in the United States in the 1960s. The re-emergence of NWS in Central America began in 2023. Concerned about the threat to the US livestock industry, the US Department of Agriculture in May suspended livestock imports at the US-Mexican border as part of its NWS response, then began a phased reopening in late June. The United States and Mexico have also been monitoring nearly 8,000 fly traps in Texas, Arizona, and New Mexico since July. Gavi-supported immunizations saved record lives in 2024 News brief 5 minutes ago. Lisa Schnirring Topics Childhood Vaccines Malaria Public Health In a progress report covering its activities in 2024, Gavi, the Vaccine Alliance, today reported that Gavi-supported vaccines saved a record 1.7 million lives, 400,000 more than in 2023. In a statement, the group also reported major progress in boosting vaccine campaigns in some of the countries experiencing some of the biggest humanitarian challenges. Beyond just public health benefits, the group estimated that Gavi-supported countries gained nearly $20 billion in economic benefits from having healthier populations, reducing healthcare costs, and boosting productivity. Since the group was established in 2000, Gavi said its immunization investments have generated $280 billion in economic benefits, which it said supports stability and growth. As a result, recipient countries have been able to assume more responsibility for their vaccine programs. For example, countries paid a record $255 million toward the cost of their own vaccines in 2024. Gavi’s other achievements for 2024 include the fastest vaccine rollout in the group’s history, with wide malaria vaccine deployment in 2024 protecting millions of children in Africa who represent 70% of the world’s disease burden. Gains and some declines in conflict nations Coverage for all Gavi-supported vaccines rose in 2024, including in fragile and conflict settings. Mali, Syria, and Haiti experienced major improvements in basic vaccine coverage. However, some countries struggling with humanitarian crises, such as Yemen and Sudan, saw major declines. Sania Nishtar, MD, PhD, Gavi’s chief executive officer, said, “Every person—no matter how hard to reach—should have access to the life-saving power of vaccines. That vision is both very simple and immensely complex to bring to life. The historic progress we have made towards this goal is thanks to incredible commitment from governments, health care workers and communities all over the world.” Quick takes: HIV drug introduced in Uganda, H5 flu vaccine guidance, new polio cases in 3 countries News brief Today at 3:41 p.m. Chris Dall, MA Topics HIV/AIDS Avian Influenza (Bird Flu) Polio Page County, Virginia, sees first case of CWD in white-tailed deer News brief Today at 1:57 p.m. Mary Van Beusekom, MS Topics Chronic Wasting Disease The Virginia Department of Wildlife Resources (DWR) has reported the first case of chronic wasting disease (CWD) in Page County. The white-tailed doe was reported in July after showing clinical signs of the fatal neurodegenerative disease. \"It is currently uncommon to see deer that appear sick as a result of CWD in Virginia,\" the DWR said in the news release. \"Infected animals may not exhibit any symptoms of CWD for 16 months to two years after exposure.\" 18 counties now CWD-positive Located in northern Virginia, Page County has been included in the state's Disease Management Area 2 for several years because it is close to other known cases of CWD. This detection won't lead to any regulatory changes, the DWR said. DWR Wildlife Veterinarian John Tracey, DVM, said, \"Page County has been one of those counties that has been somewhat difficult for us to get samples from. All the counties around it, especially to the north of it have the disease.\" Virginia first reported a case of CWD in Frederick County in 2009. With the Page County detection, 18 counties in the state are now CWD-positive. CWD, a slow and progressive disease caused by infectious misfolded proteins called prions, affects cervids such as deer, elk, and moose, spreading through cervid-to-cervid contact and environmental contamination. No vaccine or treatment is available. Although no human cases of CWD have been reported, health officials warn against eating the meat of infected animals and urge caution when handling the carcasses. ALL BRIEFS FDA conditionally approves drug for prevention, treatment of New World screwworm in cattle News brief 57 minutes ago. Chris Dall, MA Topics New World Screwworm The US Food and Drug Administration (FDA) said today that it has conditionally approved a drug for the prevention and treatment of New World screwworm (NWS) larval infestations in cattle. The FDA said Dectomax-CA1 is eligible for conditional approval in cattle because it addresses an unmet animal health need, and demonstrating its effectiveness would require complex studies. FDA officials say they have determined the drug, which is already fully approved for treatment and control of certain parasites in cattle and swine, is safe and has a \"reasonable expectation\" of effectiveness against NWS. It's also conditionally approved for prevention of NWS reinfestation for 21 days. The move is the latest step by US health and agriculture officials to respond to the flesh-eating parasitic infection, which can cause cattle loss and has been creeping northward from Central America over the last several months. On September 22, Mexico confirmed a case of NWS in a cow located less than 70 miles from the US border. \"We understand the urgency with which America’s farmers and ranchers are asking for tools to fight New World screwworm,\" FDA Commissioner Marty Makary, MD, MPH, said in a press release. \"Today’s conditional approval—first in the U.S. for NWS—shows our dedication to rapidly advancing important animal medicines when they are needed most. We continue to work tirelessly to complete review of other NWS products to protect multiple animal species in the U.S.\" Re-emergence in Central America Carried by the Cochliomyia hominivorax fly, NWS fly larvae burrow into the flesh of cattle and other warm-blooded animals, causing severe wounds and death if untreated. The pest was eradicated in the United States in the 1960s. The re-emergence of NWS in Central America began in 2023. Concerned about the threat to the US livestock industry, the US Department of Agriculture in May suspended livestock imports at the US-Mexican border as part of its NWS response, then began a phased reopening in late June. The United States and Mexico have also been monitoring nearly 8,000 fly traps in Texas, Arizona, and New Mexico since July. Gavi-supported immunizations saved record lives in 2024 News brief 5 minutes ago. Lisa Schnirring Topics Childhood Vaccines Malaria Public Health In a progress report covering its activities in 2024, Gavi, the Vaccine Alliance, today reported that Gavi-supported vaccines saved a record 1.7 million lives, 400,000 more than in 2023. In a statement, the group also reported major progress in boosting vaccine campaigns in some of the countries experiencing some of the biggest humanitarian challenges. Beyond just public health benefits, the group estimated that Gavi-supported countries gained nearly $20 billion in economic benefits from having healthier populations, reducing healthcare costs, and boosting productivity. Since the group was established in 2000, Gavi said its immunization investments have generated $280 billion in economic benefits, which it said supports stability and growth. As a result, recipient countries have been able to assume more responsibility for their vaccine programs. For example, countries paid a record $255 million toward the cost of their own vaccines in 2024. Gavi’s other achievements for 2024 include the fastest vaccine rollout in the group’s history, with wide malaria vaccine deployment in 2024 protecting millions of children in Africa who represent 70% of the world’s disease burden. Gains and some declines in conflict nations Coverage for all Gavi-supported vaccines rose in 2024, including in fragile and conflict settings. Mali, Syria, and Haiti experienced major improvements in basic vaccine coverage. However, some countries struggling with humanitarian crises, such as Yemen and Sudan, saw major declines. Sania Nishtar, MD, PhD, Gavi’s chief executive officer, said, “Every person—no matter how hard to reach—should have access to the life-saving power of vaccines. That vision is both very simple and immensely complex to bring to life. The historic progress we have made towards this goal is thanks to incredible commitment from governments, health care workers and communities all over the world.” Quick takes: HIV drug introduced in Uganda, H5 flu vaccine guidance, new polio cases in 3 countries News brief Today at 3:41 p.m. Chris Dall, MA Topics HIV/AIDS Avian Influenza (Bird Flu) Polio - The US State Department announced today that it will introduce the HIV-prevention drug lenacapavir in Uganda through the President's Emergency Plan for AIDS Relief (PEPFAR). Administered just twice a year by injection, lenacapavir is an HIV-1 capsid inhibitor that offers sustained and more convenient protection against HIV infection in at-risk populations. Randomized controlled trials have found that 99% of people on lenacapavir remain HIV negative. Uganda is one of 10 high-burden HIV countries where the drug will be distributed through PEPFAR. Drugmaker Gilead has agreed to provide the drug at cost and to provide their intellectual property to generic manufacturers. \"This exciting development will accelerate our progress toward ending HIV as a public health threat, building a healthier future for America, Uganda, and the world,\" Ambassador William Popp, MA, said in a press release from the US Embassy in Uganda. - At its most recent meeting, the World Health Organization's Strategic Advisory Group of Experts (SAGE) on Immunization recommended that countries consider issuing recommendations for targeted use of currently licensed A(H5) vaccines based on risk of exposure to avian flu. SAGE recommended targeting lab workers who handle H5 viruses, first responders in zoonotic flu outbreaks, health workers who evaluate and manage suspected or confirmed human cases, and people with ongoing contact with animals or their environments where animal and human infections have been reported. - Three countries reported new polio cases last week, according to the most recent update from the Global Polio Eradication Initiative. In Pakistan, two case of wild poliovirus type 1 (WPV1) with paralysis onsets of August 12 and 14 were reported from Khyber Pakhtunkhwa province, bringing the country's total number of WPV1 cases this year to 26. Angola reported three cases of circulating vaccine-derived poliovirus type 2 (cVDPV2) from Huila province, bringing its cVDPV2 total for 2025 to 11 cases. Nigeria has now seen 32 cVDPV2 cases this year after reporting 4 new cases from Kebbi, Sokoto, and Zamfara. Page County, Virginia, sees first case of CWD in white-tailed deer News brief Today at 1:57 p.m. Mary Van Beusekom, MS Topics Chronic Wasting Disease The Virginia Department of Wildlife Resources (DWR) has reported the first case of chronic wasting disease (CWD) in Page County. The white-tailed doe was reported in July after showing clinical signs of the fatal neurodegenerative disease. \"It is currently uncommon to see deer that appear sick as a result of CWD in Virginia,\" the DWR said in the news release. \"Infected animals may not exhibit any symptoms of CWD for 16 months to two years after exposure.\" 18 counties now CWD-positive Located in northern Virginia, Page County has been included in the state's Disease Management Area 2 for several years because it is close to other known cases of CWD. This detection won't lead to any regulatory changes, the DWR said. It is currently uncommon to see deer that appear sick as a result of CWD in Virginia. DWR Wildlife Veterinarian John Tracey, DVM, said, \"Page County has been one of those counties that has been somewhat difficult for us to get samples from. All the counties around it, especially to the north of it have the disease.\" Virginia first reported a case of CWD in Frederick County in 2009. With the Page County detection, 18 counties in the state are now CWD-positive. CWD, a slow and progressive disease caused by infectious misfolded proteins called prions, affects cervids such as deer, elk, and moose, spreading through cervid-to-cervid contact and environmental contamination. No vaccine or treatment is available. Although no human cases of CWD have been reported, health officials warn against eating the meat of infected animals and urge caution when handling the carcasses. ALL BRIEFS"
}