{
  "url": "https://littlemssam.tumblr.com/",
  "title": "LittleMsSam's Sims 4 Mods",
  "text": "Since EA did revert the patch shortly after the patch was online, it might be that I am not going to upload any updates today. We don’t know yet why they reverted the patch and even if they patch again today, I won’t have enough time to update & upload updates today. I do hope I will be able to upload any updates tomorrow. As always delete old Mods Files and the localthumbcache, when updating my Mods! — Eco Dishwasher Children should be able to autonomously fill the dishwasher after eating as well (which was locked for Teen+ by EA for some unknown reason) Foster Family Fixed an issue with the Caretaker option on Infants/Toddler to be able to add the Caretaker relationship to a Nanny not showing up on them. Improved Practical Spells Fixed an issue with Scruberoo causing LEs when used on some objects. Added support for Floralorial - using the spell on a plant will now also add the loot to plants around it in a radius of 25. More Servings Options - Ingredients Required Part Added two interactions to fridges for users without Cottage Living: “Buy special Groceries” - where you can by flour, sugar, white/red meat. “Temporarily disable Ingredients required” - lets you temporary disable the ingredients requirement feature in case some recipes need ingredients you don’t have like milk/eggs. The duration of hidden buff is 60 minutes and will be removed automatically after your sim cooked. Unlock/Lock Doors for chosen Sims Someone requested to add the Lock/Unlock All small Farm Animals to community lots as well, which I did now. Be aware though, the game will delete the animals usually when you leave the lot so you probably have to readd new ones each time you visit. Tuesday is patch day, and according of information from EA this patch will not be a laundry bug fixes patch only. It will make some changes related to family relationships and family tree. I recommend to prepare yourself for the patch: You should either remove all Mods and play a Mod free Savegame, or you should disable auto patching for your Game go to Origin > Application Settings > Automatic Game Updates (Under Client Update section) or EA App > Settings > Downloads > and switch off automatic game updates until all your must have Mods are updated/confirmed to be ok."
}