{
  "url": "https://www.ajc.com/",
  "title": "Atlanta news, Georgia news, Breaking news from The Atlanta Journal-Constitution - AJC.com",
  "text": "Now Playing Kava bars are changing Atlanta's drink scene. Here's what you need to know.Kava bars are changing Atlanta's drink scene. Here's what you need to know.Kava bars are changing Atlanta's drink scene. Here's what you need to know.Kava bars are changing Atlanta's drink scene. Here's what you need to know.Kava bars are changing Atlanta's drink scene. Here's what you need to know. Exclusive: Police body cam shows confusion at FBI raid of elections officeExclusive: Police body cam shows confusion at FBI raid of elections officeExclusive: Police body cam shows confusion at FBI raid of elections officeExclusive: Police body cam shows confusion at FBI raid of elections officeExclusive: Police body cam shows confusion at FBI raid of elections office Georgia’s youngest state lawmaker weighs in on students protesting ICEGeorgia’s youngest state lawmaker weighs in on students protesting ICEGeorgia’s youngest state lawmaker weighs in on students protesting ICEGeorgia’s youngest state lawmaker weighs in on students protesting ICEGeorgia’s youngest state lawmaker weighs in on students protesting ICE Inside the cozy new Atlanta music studio designed by Electric Lady architect Since April, artists including Cardi B, Ludacris and Davido have recorded at the studio, located in west Midtown. 38m agoFancy footwork is all in family for metro Atlanta brothers in ‘Riverdance’ Their parents, who toured in the Irish dance show, will cheer the Porter brothers when they perform at Fox Theatre this weekend. Meet RuPaw, Atlanta’s 2026 Puppy Bowl rep He now lives in Woodstock and is in the finals for favorite pup. Latest Headlines U.S. makes clear to asylum-seekers: We will not protect survivors of persecution People who are escaping persecution from other countries face an uphill battle to persuade judges that they need protection and should be allowed to stay in USA. 9 hours agoDespite 2020 election loss, Trump now uses government to engineer new result Both Democrats and Republicans have tried to discredit past election results instead of accepting the truth that maybe they were legitimately defeated. Feb 3, 2026Iran’s political prisoners are running out of time. Why it matters in Atlanta. This city’s history teaches that justice does not stop at borders. Human rights do not depend on nationality. 8 hours agoIt doesn’t add up. Georgia’s budget outlook is in trouble in the Trump Era. Georgia deserves leaders who are willing to face the numbers, tell the truth and fight for working families. Feb 3, 2026Photo PHOTOS: Snellville's Brookwood High School students rally and march against ICE In Georgia, hundreds of students have walked out of school to protest immigration crackdowns under the Trump administration. PHOTOS: Hawks lose at home to Rockets The Hawks fell to the Houston Rockets on Thursday, Jan. 29 at State Farm Arena. PHOTOS: Scenes from icy winter storm in Metro Atlanta The first wave of the ice storm in Georgia tapers off, but more to come as ice storm warning in effect, including in metro Atlanta."
}