{
  "url": "https://en.m.wikipedia.org/wiki/Mirinda",
  "title": "Mirinda - Wikipedia",
  "text": "Mirinda Mirinda (/məˈrɪndə/ mə-RIN-də) is a brand of soft drink that was created in Spain in 1959 and has been distributed globally by PepsiCo since 1970. Its name comes from the Esperanto translation of \"admirable\" or \"amazing\".[1] Mirinda is available in multiple formulations of flavour, carbonation and sweetener depending on the taste of individual markets. It is made in many different fruit varieties, but the orange flavour represents the majority of Mirinda sales worldwide following a major repositioning of the brand towards that flavour in the early 1990s.[citation needed] Mirinda is also branded under various other names around the world: Sukita (Brazil), Yedigün (Turkey), Slam (Italy until 2021), Frustyle (Russia since 2022), and Sol (some US states).[citation needed] History and markets [edit]Mirinda was first produced in Spain. American beverage company PepsiCo acquired the Mirinda brand in 1970[2] and markets it primarily outside the United States. It competes with The Coca-Cola Company's Fanta and Dr Pepper Snapple Group's Crush. It became available in the United States in late 2003 in bilingual packaging, and was sold at a reduced price, becoming a competitor against Coca-Cola's Fanta brand. Since 2005, Mirinda flavours have largely been sold under the Tropicana Twister Soda brand in the United States except in Guam, where Pepsi began selling it under the Mirinda brand in 2007 (replacing Chamorro Punch Orange).[citation needed] As of 1990, Mirinda had been a solid seller in Asian and South American markets.[3] The drink was also launched around 1991 in Australia.[3] KFC in Australia switched from the Coca-Cola to the Pepsi family of soft drinks. It then sold Mirinda Orange and Mirinda Lemon, before later changing to Sunkist and Solo when the Australian Pepsi bottler gained the rights to the Schweppes/Dr Pepper brands. In the 2010s and 2020s, Mirinda syrups were available at Big W department stores.[citation needed] Mirinda is no longer sold in New Zealand, replaced[when?] with the introduction of PepsiCo's new Mountain Dew range of similar flavours (Code Red, Live Wire, Pitch Black, Electro Shock and Passionfruit Frenzy).[citation needed] In Italy, it was sold under the brand Slam until 2021, when it was renamed.[citation needed] Advertising [edit]The \"Mirinda Craver\" ads produced by Jim Henson from 1975 to 1978 involved a monster called the Mirinda Craver (performed by Bob Payne and voiced by Allen Swift) craving the Mirinda drinks and doing anything to obtain one.[citation needed] A campaign between 1994 and 1996 used the tag-line \"The Taste is in Mirinda\" with the Blue Man Group. In some markets, including Mexico, the Blue Man Group campaign re-launched Mirinda away from a multi-flavour positioning to a brand solely focused on the orange flavour.[citation needed] Mirinda advertising campaigns have been handled by Pepsi's stable of creative agencies, including BBDO and J. Walter Thompson.[citation needed] Mirinda regularly introduces special movie-themed editions in Asia. Recent ones[when?] included Batman (blueberry) and Superman (fruit punch). Mirinda has also recently[when?] released a new flavour of drinks called Mirinda creme. They come in three flavours: mango, raspberry and lime.[citation needed] Flavors [edit]- Mirinda Orange - Mirinda Diet Orange - Mirinda Red Orange - Mirinda Lemon - Mirinda Apple - Mirinda Green Apple - Mirinda Grape - Mirinda Strawberry - Mirinda Raspberry - Mirinda Watermelon - Mirinda Watermelon Cantaloup - Mirinda Pear - Mirinda Peach - Mirinda Grapefruit - Mirinda Light Pink Grapefruit - Mirinda Litchi - Mirinda Banana - Mirinda Orange Banana - Mirinda Melon Sherbet - Mirinda Citrus - Mirinda Pineapple - Mirinda Punch - Mirinda Fruity - Mirinda Green Cream - Mirinda Vanilla - Mirinda Club Soda - Mirinda Green Fruit - Mirinda Tonic - Mirinda Sarsi - Mirinda Berry - Mirinda Root Beer - Mirinda Rootberry - Mirinda Raspberry - Mirinda Blackcurrant - Mirinda Hibiscus - Mirinda Guarana - Mirinda Free Guarana - Mirinda Tropical Fruit - Mirinda Pomegranate - Mirinda Passionfruit - Mirinda Tangeringe - Mirinda Cola Orange - Mirinda Tamarind - Mirinda Lemon - Mirinda Lemon Lime - Mirinda Lemon Lime Sherbet - Mirinda Orange Pineapple - Mirinda Orange Mango - Mirinda Masala Orange - Mirinda Oriental Papaya - Mirinda Skyberry - Mirinda Watermelon Berry - Mirinda Bitter Soda - Mirinda Mix It Apple Kiwi - Mirinda Mix It Strawberry Lychee - Mirinda Mix It Blueberry Orange - Mirinda Mix It Grape Melon - Mirinda Mix It Berries Watermelon - Mirinda Mix It Raspberry Lemon - Mirinda Mix It Passionfruit Pineapple - Mirinda Mix It Pear Pineappple See also [edit]References [edit]- ^ Ellemberg, Enrique (23 January 2005). \"89th Esperanto World Convention, Beijing, China. July 2004 (a01)\". Archived from the original on 26 February 2005. - ^ \"Produktseite \"Mirinda\"\" (in German). PepsiCo Deutschland. 2012. Archived from the original on 31 March 2012. Mirinda kommt ursprünglich aus Spanien und wurde 1970 in das PepsiCo-Markenportfolio integriert. Für alle die es orangig-erfrischend lieben ist Mirinda der perfekte Durstlöscher. (Mirinda came originally from Spain and was integrated into the PepsiCo brand portfolio in 1970. For everyone who loves refreshing oranges, Mirinda is the perfect thirst quencher.) - ^ a b Shoebridge, Neil (1990-03-16). \"NEW LEMONADE AIMS TO HELP BURST COKE'S BUBBLE\". Australian Financial Review. Retrieved 2025-09-13. External links [edit]- Media related to Mirinda at Wikimedia Commons"
}