{
  "url": "https://www.tvinsider.com/1243556/cnn-kaitlan-collins-attacked-by-trump/",
  "title": "CNN's Kaitlan Collins Fires Back After Trump Slams Her For 'Never Smiling'",
  "text": "CNN’s Kaitlan Collins Fires Back After Trump Slams Her For ‘Never Smiling’ What To Know - Donald Trump criticized CNN’s Kaitlan Collins during an Oval Office exchange. - He called her “the worst reporter” and attacked her for “never smiling” after she questioned him about the Epstein files. - Later in the day, Collins reacted to what the president said on her CNN show. Donald Trump‘s ongoing criticism of CNN’s Kaitlan Collins continued on Tuesday (February 3), when the president labeled her as “the worst reporter” and noted that she never “smiles.” The heated exchange took place in the Oval Office when Collins tried to ask Trump a question about the Jeffrey Epstein files. “What would you say to survivors…?” Collins began before the President cut her off. “You are so bad. You know, you are the worst reporter. No wonder… CNN has no ratings because of people like you,” Trump said. “She’s a young woman. I don’t think I’ve ever seen you smile. I’ve known you for 10 years. I don’t think I’ve ever seen a smile on your face.” As Collins tried to repeat her question, Trump interrupted again, saying, “You know why you’re not smiling? Because you know you’re not telling the truth, and you’re a very dishonest organization, and they should be ashamed of you.” Collins fired back by replaying the footage on Tuesday’s edition of The Source, where she said Trump’s reaction is telling for where his mind is at in regards to the Epsteins files. “He views things through the lens of how it affects him,” Collins said, per The Daily Beast. CNN contributor Kara Swisher, a guest on Tuesday’s show, told Collins, “I think you really got under his skin… so he decided to take personal attacks on you which were whatever, it was just ridiculous.” Swisher added, “I think you’re absolutely right to raise that question of what got released and what needs to be released, and now that we’re halfway there, we should do the whole thing.” CNN stood by Collins, saying a statement to The Wrap, “Kaitlan Collins is an exceptional journalist, reporting every day from the White House and the field with real depth and tenacity. She skillfully brings that reporting to the anchor chair and CNN platforms every day, which audiences around the world know they can trust.” Fellow CNN anchor Jake Tapper also defended Collins on X, writing, “Trump says it’s time for the country to move on from Epstein files, calls it a Democratic problem. @KaitlanCollins notes [Elon] Musk & [Howard] Lutnick are in the files, asks about criticisms by survivors. Trump insults her & criticizes her for not smiling enough. (Needless to say Kaitlan is a great reporter & person).” This isn’t the first time Trump has insulted Collins. Last February, when The Source anchor asked the President about his relationship with Vladimir Putin, he fired back, “I know [Biden is] a friend of yours. He’s a friend of CNN. That’s why nobody watches CNN anymore. Because they have no credibility.” In December, Trump ranted against Collins on Truth Social, calling her “stupid and nasty” for asking him about the cost of the new White House ballroom. The Source with Kaitlan Collins, Weeknights, 9/8c, CNN"
}