{
  "url": "http://health.wnylc.com/health/entry/29/",
  "title": "CASA Contact List - NYC - New York Health Access",
  "text": "The NYC Medicaid Home Care Services Program, which is part of the NYC Human Resources Administration Medical Insurance Community Services Administration (MICSA), also known as the Medicaid program, formerly was responsible for administration in NYC for three types of Medicaid \"personal care\" services -- home attendant, housekeeping, and Consumer Directed Personal Care Services. (CDPAP). - See this official HRA list of CASA offices, now only one in each borough. - See more contacts in the Home Care Services program here - See this HRA HOME CARE SERVICES PROGRAM (HCSP) contact list updated 9/9/2020 from HRA. The PDF at that links includes HRA MICSA Alert dated July 22, 2021 announcing a new email address for inquiries for HCSP - hcspinquiries@hra.nyc.gov. - In April 2025 HRA updated the FAX NUMBERS for the INTAKE UNIT at HCSP -- 718-230-0424 and 718-230-0841. Fax to this number: - submission of NY Independent Assessor (NYIA decision \"OUTCOME\" otfices for adult applicants, if NYIA denied MLTC enrollment and refers back to local districtt request HOUSEKEEPING services (limited to 8 hours/week - M11Qs for applicants under 18, - change requests on active cases, and - reauthorizations of CASA cases. - Until September 2012, anyone who needed any of these 3 types of home care services would apply to the \"CASA\" office based in each borough. The CASA offices processed both the Medicaid application and the request for home care. - As of November 2012, the main way for adults over age 21 who have MEDICARE to apply for Medicaid home care is to first apply for MEDICAID at: HRA--HCSP Central Medicaid Unit (new address Jan. 14, 2013) 785 Atlantic Avenue, 7th Floor Brooklyn, NY 11238 T: 929-221-0849 and then request an Independent Assessment from NYIAP and then enroll in a Managed Long Term Care plan. - Adults who do NOT have Medicare and are not yet enrolled in a Medicaid managed care plan; or - Adult Medicare beneficiaries who are enrolled in a hospice benefit, or - Adults who have waiver services through the Traumatic Brain Injury (TBI) or Nursing Home Transition & DIversion Waiver program, or are in the OPWDD waiver - Are under 21 years old, though those who are age 18-21 and don't have Medicare have the option of applying to the CASA offices or enrolling in a Managed Long Term Care plan, if their functional needs are extensive enough that they would otherwise qualify for nursing home care. See this article for tips on applying for Medicaid home attendant services (aka \"personal care assistance\") in New York City, for those who may still apply at the CASA offices -- everyone else must apply to a Managed Long Term Care Plan. t Please be courteous and exercise restraint when contacting staff on this list. If you have an issue to resolve, the best practice is to start calling at the bottom of the hierarchy. Only move up the chain of command to supervisors or managers if the junior staff are unable to resolve your issue. By showing respect to agency staff, we can ensure that they will remain responsive to inquiries from advocates, caregivers, and consumers. Thank you for understanding. This site provides general information only. This is not legal advice. You can only obtain legal advice from a lawyer. In addition, your use of this site does not create an attorney-client relationship. To contact a lawyer, visit http://lawhelp.org/ny. We make every effort to keep these materials and links up-to-date and in accordance with New York City, New York state and federal law. However, we do not guarantee the accuracy of this information."
}