{
  "url": "https://bbs.clutchfans.net/threads/clutchfans-game-thread-rockets-bucks-11-9-2025.327606/page-3",
  "title": "ClutchFans Game Thread: Rockets @ Bucks 11/9/2025 | Page 3 | ClutchFans",
  "text": "If his ball handling under pressure improves, his confidence will go much higher. He really shot the 3 ball well against the Spurs. Rockets could've withstood Brooks by adding KD and still been champs, but no FVV presents the same problems seen last season when he missed games. Fred was awesome in the playoffs too. This season looks 2nd round, CF at best. Rockets need a major PG upgrade or it's a wasted season. Super wasted with KD age. FVV was horrible in 2 games in the playoffs, good in 2 games, and mediocre in 3 games. Our offense was putrid last year. Offensive rebounds is the only thing that saved us. We are scoring more this year despite the lack of offensive rebounds as teams have adjusted to our 2 bigs offense and are killing our zone defense. This team is going to be fine on the offensive side of the ball and will be great on the defensive side if we quit playing zone so much. 27 pts / 58.0 FG% / 66.7 3PT% Those THREE games are good/mediocre?? Turnovers '24-'25 - 13.0 (21st) '25-'26 - 16.3 (4th) We did not discuss this enough during the game. I am not giving the Spurs one milligram of credit. They went bonkers on threes. that said, they done us a favor by demonstrating to us early in the season we need to up our game on how we respond to ball pressure. Yes... good/mediocre was an understatement Fred was good in the playoffs and awesome compared to __(PG)__ on the roster. I am not saying we need a pg upgrade yet. There is plenty more time to let the kids prove this one way or the other. That said, who wouldn’t want more Holidays in the new year? 2024 offense 114 2025 offense 123 TO’s need to improve, but they will when 3 new starters jell into their roles. Offense and TO’s are not the problem. Defense is the problem and specifically defensive rebounding caused by playing the two bigs lineup too much. SA had 56 second chance points. We had an exorbitant amount of TO’s led by Durant’s 8. We didn’t lose because of TO’s we lost because of a bunch of smaller sized guards and forwards getting an enormous amount of offensive rebounds. People blaming Reed for the loss are way off base. Ime was the culprit this game. I wouldn’t want to trade for Jrue’s contract. It will ruin our ability to hang onto Tari, Reed, Okogie in the years to come and would move Amen off ball which will unnecessarily delay his rise to stardom. He might even force a trade, if he is forced back into the dunker’s role. I hear you, just keep in mind this isn't the East. Put last year's Clippers in the East. Vegas odds reaching the Finals??.... In the West, first round L. Rockets are championship or bust with KD. He isn't getting younger. Agree. I was just making a point to those blaming our woes on a lack of a pg when we didn’t really have an effective PG last year on way to the #2 seed. Defense is our problem so far this season and specifically when we are running zone. Reed needs to improve his defense, but he is not why we lose when we lose. The reason is the two bigs lineup that forces us into zone. I kid you sometimes about some of your predictions, but we agree on a lot of stuff like Ime, FVV, and even KPJ back in the day. I think you really like to root for the underdog and Reed is an underdog because of his size. We just disagree on whether he is going to be a starting PG or not. I also wasn’t a big fan of the Cam trade, not because I think Cam is going to be great, but he was young enough to turn his career around and 2nd round picks are pretty useless. I would have rather have jettisoned Tate and Holiday if we needed the cap space. They offered him a contract but aren't willing to offer more than two years to keep flexibility in case Luka opts out in '28. https://www.msn.com/en-us/sports/nb...an-finney-smith-two-year-contract/ar-AA1HMovN"
}