{
  "url": "https://es.digitaltrends.com/celular/whatsapp-web-en-windows-y-mac/",
  "title": "Cómo utilizar WhatsApp Web en Windows y Mac - Digital Trends Español",
  "text": "Es una de las aplicaciones de comunicación en línea más populares del planeta, y cuenta con una versión de navegador (WhatsApp Web) y otra de escritorio (WhatsApp Desktop), es decir, una aplicación de sistema descargable –tanto para Mac como Windows– y una versión que se abre en el navegador. WhatsApp Web y WhatsApp Desktop funcionan como extensiones de tu cuenta móvil de WhatsApp, y todos los mensajes se sincronizan entre tu teléfono y tu computadora, para que pueda ver las conversaciones en cualquier dispositivo, independientemente de dónde se inicien. A continuación te guiaremos para que sepas cómo usar la aplicación de navegador de WhatsApp. El proceso y la interfaz son idénticos en iOS 15 e iOS 16. De manera similar, la interfaz de Android 13 es la misma que la versión anterior. Ya que andas por aquí, quizá te interesen estos consejos para proteger tu cuenta de WhatsApp, o esta guía de cómo eliminar mensajes enviados en WhatsApp. Cómo usar WhatsApp Web en iPhone Para iniciar WhatsApp Web, simplemente haz clic en la página web de Chrome, Firefox, Opera, Safari o Edge y escanea el código QR con la aplicación móvil WhatsApp desde tu celular. WhatsApp Web se inicia automáticamente en el navegador y permanece activo hasta que cierres la sesión en tu computadora o celular. Paso 1: En el navegador de tu computadora, navega hasta https://web.whatsapp.com. Paso 2: Inicia WhatsApp en tu iPhone. Paso 3: En el iPhone, selecciona Configuración > Dispositivos vinculados. Paso 4: Seleccione el botón Vincular un dispositivo. La vista de la cámara se abrirá en WhatsApp. Paso 5: Sostén tu teléfono enfocando el código en tu pantalla para emparejarlo. Solo enfoca: no es necesario que toques nada más. La página de WhatsApp en su navegador debería actualizarse inmediatamente para iniciar sesión en WhatsApp y mostrar su lista actual de chats. Cómo usar WhatsApp Web en Android Para teléfonos Android, estos son los pasos a seguir después de abrir el sitio web de WhatsApp en su computadora: Paso 1: En tu teléfono Android, inicia WhatsApp y selecciona los tres puntos en la parte superior derecha del panel de chat. Paso 2: Seleccione Dispositivos vinculados y luego seleccione Vincular un dispositivo. Paso 3: Sostén tu teléfono hacia el código QR en su computadora para emparejarlo. Paso 4: Tu cuenta de teléfono inteligente ahora está vinculada a la versión web de la aplicación. Paso 5: Desde allí, puedes ahora enviar y recibir mensajes desde el navegador de escritorio de tu computadora. Características web de WhatsApp Después de escanear el código QR, puedes observar tu lista de chat de WhatsApp en la página web. A la izquierda, accedes a los chats haciendo clic en un contacto y el historial de mensajes, si lo guardaste. En la parte superior izquierda de la página web, hay tres íconos disponibles: Estado, Nuevo chat y Menú, que ofrecen una lista de opciones anidadas. La opción Estado revela todos los estados publicados por tus contactos junto con la capacidad de responder desde el área de respuesta en la parte inferior del panel. Al hacer clic en Nuevo chat, se abre la lista de contactos en el lado izquierdo de la página. Desde aquí, puedes crear un o comenzar una conversación con los contactos que tienes guardados. El Menú desplegable de tres puntos te permite crear un nuevo grupo, cambiar información en tu perfil, buscar chats archivados, ver mensajes destacados, modificar configuraciones como notificaciones y fondos de pantalla de chat, o cerrar sesión. Enviando mensajes WhatsApp Web es tan fácil de usar como la aplicación móvil, y la interfaz te resultará familiar. Para enviar un mensaje desde el escritorio, haz clic en un chat existente o en el icono Nuevo chat y selecciona el contacto con el que deseas interactuar. En esta opción, tienes acceso a los chats anteriores, si están guardados, o también puedes ver la barra de mensajes en la parte inferior. Haz clic en la barra Escribe aquí un mensaje y comienza a chatear. Cuando hayas terminado el mensaje, presiona la tecla Enter en tu teclado para enviarlo o simplemente haz clic en el ícono Enviar. Si deseas incluir documentos, imágenes o grabaciones, adjunta los archivos desde tu escritorio y envíalos como lo harías con cualquier otro mensaje haciendo clic en Adjuntar, es el icono con forma de clip de papel en la parte superior del chat. Instala WhatsApp en tu computadora WhatsApp ofrece la opción de una aplicación de escritorio para Windows o Mac que puedes descargar directamente desde el sitio de WhatsApp. Se ve idéntico a la aplicación web. Después de descargar en Windows, sigue los pasos del instalador. En una Mac, arrastra el ícono de WhatsApp a tu carpeta de Aplicaciones. Inicia la aplicación de escritorio. Al igual que con la versión del navegador web, recibirás un mensaje para escanear un código QR de manera similar a la versión web. WhatsApp te mantiene conectado hasta que decidas cerrar sesión. Para cerrar sesión, regresa al menú de WhatsApp en tu celular y elige Cerrar sesión en todos los dispositivos, o en tu computadora tocando el icono de tres puntos en la parte superior de la conversación y eligiendo la opción Cerrar sesión."
}