{
  "url": "https://casa-nyc.org/",
  "title": "CASA-NYC – Advocating for Children and Youth in New York City Foster Care.",
  "text": "CASA-NYC’s mission is to ensure that young people involved in the NYC child welfare system have their needs met and rights protected and that children in foster care are moved quickly into safe, stable, nurturing and permanent homes—with their families of origin whenever possible. Who We Are CASA-NYC is a volunteer-based, non-profit organization established in 1979 and operating throughout the five boroughs of NYC. We are committed to facilitating family stability, equity, and justice for children, youth, and families referred to us by the family courts. Our staff is made up of licensed social workers, attorneys, and other professionals with expertise in helping youth and families navigate the maze of child welfare, courts, and other systems that have often failed them. Our staff recruits, trains and supports hundreds of New Yorkers to serve as volunteer advocates for children and youth through a social justice lens. CASA-NYC serves about 1,100 young people each year, but there are so many more who need our help. There are approximately 10,000 children and youth in foster care and tens of thousands more involved in family court proceedings. How our work is making an impact What drives us Our Values Child Safety & Well-Being The safety of the children we serve is our top priority. Their physical, emotional, and developmental well-being drives every aspect of our work. Family Stability Families who have experienced trauma and the tragedy of separation can heal when treated with dignity and respect. We facilitate reunification between children and their parents whenever safely possible, or we facilitate permanency with other relatives or adoptive family. Justice We advocate to ensure that families involved in the child welfare system are treated fairly and equitably at every stage of the process, have their rights protected, and receive the services and support to which they are entitled. Efficacy We are reliable, resourceful, and relentless problem solvers and work with a sense of urgency on behalf of the children and youth we serve. Collaboration We work to engage and partner with all people and organizations who play an important role in the life of the child or youth we serve, while identifying every available support. Equity & Anti-Racism Because structural racism is a primary force underlying family instability and child welfare system involvement, we strive to be an actively anti-racist organization and continuously advocate for equity for the children and families we serve. Join us for an evening of impact, insight, and inspiration at CASA-NYC’s Supper Club. Where: Tribeca Rooftop (10 Desbrosses Street, New York, NY) When: April 21, 2025 Volunteer Highlight Special Call for Volunteers in Staten Island Do you live, work, or have significant familiarity with Staten Island? CASA-NYC needs your help! Learn more about becoming a volunteer Advocate. Join Our Newsletter Receive periodic updates on the child welfare system, CASA-NYC programs, and how to get involved We never sell or share your personal information."
}