{
  "url": "https://forums.terraria.org/index.php?threads/terraria-state-of-the-game-june-2025.143573/",
  "title": "Terraria State of the Game - June 2025 | Terraria Community Forums",
  "text": "Greetings Terrarians! Happy summertime everyone! Well, at least in the Northern Hemisphere. All hands remain on deck in regards to Terraria development. To get the tough part out of the way first, we still do not have a release date to give out. Every day is one day closer, of course, but we are trying to remain overly cautious and conservative in regards to giving out any timing. We do not want to repeat the mistake of giving out a timing window and then have things change and it not be accurate. So, we must once again ask for your continued patience as we do the hard work that needs to be done in order to ensure a quality update for everyone. Short of pushing crunch time on the team (which we are not going to do), things are proceeding as fast as they can at this point. With that said, we have a few fun spoilers this month that we hope everyone will enjoy. So, without further ado... Let's see what is in store this month! STATE OF THE GAME - TABLE OF CONTENTS PC NEWS - RE-LOGIC TMODLOADER NEWS - TML TEAM CONSOLE & MOBILE NEWS - DR STUDIOS COMMUNITY NEWS NEW TRAPPINGS FOR HOME SWEET HOME... AND A LITTLE PALWORLD TEASER We have a pair of topics to cover in spoiler-land this month. First off, we have a handful of new furniture sets coming with the update - providing even more ways for players to customize their abode, arenas, and more. To give you a quick glimpse at what all goes into each of these sets, here is an advance look at the new Hallowed Furniture Set: I feel more regal somehow just for looking at it... We may show off a few more of these little additions if time allows - but we hope this at least gives you a sense for one small addition coming with Terraria 1.4.5. Check out all of the details surrounding this latest Palworld release by clicking the image above! You can pick up a copy of Palworld - and check out the latest news on the Palworld front via the link below: PALWORLD - OFFICIAL SITE --- WHAT ABOUT THE TERRARIA SIDE? This, of course, begs the obvious question of \"what about Palworld content coming to Terraria?\" We can confirm a few things on that front. One, there will be Palworld content in Terraria. Two, it will be a part of Terraria 1.4.5. Oh, wait, you wanted some actual details... well since you asked so nicely... Get some assistance with mining through Terraria with your new Pal Digtoise! We are working in secret to bring some of your favorite Pals to life in the world of Terraria! What other Pals might appear? What other Palworld content might you see? Who knows? STEAM WORKSHOP NEWS Countless Terraria texture packs and worlds await you in the Terraria Steam Workshop! You are missing out if you haven't taken the time to check out these amazing creations from the community. Click the banner above to check out the Terraria Workshop! WHAT ELSE IS GOING ON? Trying our very best to narrow in on that elusive launch window... As always, keep your bug reports coming via the handy bug report button below! Thanks again, Terrarians - we are as always blown away by your support! Back to Table of Contents On July 1st the monthly update release of tModLoader will go live. As always we are grateful for the massive amount of community participation in developing and testing new features each month. This month's release contains several notable features that mod makers can look forward to, such as loadout support for modded accessory slots new hooks for tile preview rendering. Users can use a new chat command to remove unloaded tiles in worlds that are from mods they are no longer using. Modders and users should also keep an eye out for our monthly Steam announcement on the 1st where a complete listing of bug fixes and API changes for this month's release will be shown. The in-game news button on the main menu will send you directly to the announcement once it is live. We look forward to seeing how mods make use of these new features. As always, if you are having issues of any sort, definitely don't hesitate to check out our FAQ on github or reach out to us at our Discord. tModLoader Steam Workshop - New Mods every Day! The TML Steam Workshop now has over 10,000 mods for you to enjoy! Coupled with the in-game mod browser, the TML Steam Workshop is a great way to explore what modded Terraria has to offer - check it out today by clicking the banner above! WHAT'S NEXT FOR TML? More features, continuing to evolve and grow what TML can do... and getting ready for 1.4.5. As always, you can keep track of the current progress and much more in real time at tModLoader/tModLoader (But note that the completion percentage doesn't mean anything, because issues and PRs don't have weights.) Developers who are willing to contribute may do so by doing PRs to the tModLoader/tModLoader branch. (See tModLoader/tModLoader) TMODLOADER ISSUES/BUGS The Re-Logic team does not directly develop TML, so bugs with TML are best reported via the links below. tModLoader - Play Terraria with Mods! https://tmodloader.net/discord Back to Table of Contents CONSOLE & MOBILE - DR STUDIOS As you saw in the spoiler above from our Re-Logic friends, new furniture sets are all the rage this season! We felt like we would be remiss if we did not get in on the furniture showcase as well... so enjoy Feywood! Inspired by the fairy logs that dot the landscape of Terraria, this set will help you get back to nature (though it won't help you find any treasure). Beyond that, it is another month of all hands on deck to get Terraria 1.4.5 across the finish line. So, wish us luck as we keep pressing forward! Hey, Listen! It's Feywood furniture! --- Until next time, Console & Mobile friends - thanks for all of your love and support! The team is feeling pretty good about console & mobile at this point, but we know that the bug reporting never stops! So, please, as you run into any issues, be sure to file a Bug Report via the links below! CONSOLE BUG REPORTS MOBILE BUG REPORTS Back to Table of Contents Here's the latest and greatest happenings on the Community side of things. Thanks as always for being the most engaged and awesome gaming Community ever! TERRARIA MERCHANDISE HUB The Terraria merchandise hub is where you can find all of the latest and greatest Terraria merchandise all year round - with new stuff arriving all of the time! Check out the latest merch drops as well as some classics and pick up that epic Terraria gift for a friend (or yourself!). Click the banner above to head to Terraria.org/store now! TERRARIA MERCHANDISE UPDATES TERRARIA - THE BOARD GAME UPDATE Chris here, lead developer at Paper Fort Games; I’m back with this month’s Terraria: The Board Game designer diary. Where did June go? The last few weeks have flown by here at Paper Fort HQ! In this month’s update we’ll be reflecting on a fantastic UKGE, taking you on a guided tour inside the Terraria: The Board Game box, telling you about some iconography improvements and providing the latest development news. If you missed the campaign but would like to get your hands on the game, don’t worry! Late pledges are now available by clicking the link below... Grab your pickaxes and let’s dig in! --- UKGE RECAP At the very end of May, the Paper Fort Games team travelled down to Birmingham for UK Games Expo. This year, over 40,000 people visited the show, the highest attendance in the history of the convention. As always, we had a wonderful time meeting Terraria fans, backers, and those attendees who were discovering the game for the first time. The booth was packed for the whole weekend; thank you to everybody who stopped by, played the game, collected a slime balloon or had a go at our beanbag toss - we had a blast! We had a bigger stand and more demos than ever before, and as a tiny team we needed to draft in some extra pairs of hands! We want to say a huge thank you to all the demo staff who helped us to make this a fun and memorable event for all involved! In last month’s update, we shared some pictures of pre-production component samples that arrived just in time for UKGE. At the show, colleagues from our manufacturing partner dropped off additional samples that they had kindly brought in their suitcases; after many hundreds of emails back and forth it was lovely to see the team in person again! We were running two demos of Terraria: The Board Game all day, every day of the convention; this provided the perfect opportunity to put these new components through their paces. We identified a couple of minor adjustments that needed to be made; these have already been implemented by the manufacturer (just one of the benefits of being able to chat about the components in person!). --- SAMPLE BOX TOUR For those of you who haven’t had a chance to see these new components in person, Chris has recorded a guided tour through our latest sample box, explaining how various components are organised, pointing out small but important changes that are being made and showing off some features that you won’t have seen yet… enjoy! --- GAMEPLAY VIDEO Speaking of videos, we’re currently finalising the logistics of filming our updated gameplay recording. In last month’s update, we asked what type of videos you’d like to see, and based on your comments, it sounds like a full playthrough is on the cards (no pun intended!). We’re very eager to share more of the game with those of you who haven’t had the chance to see it in person, and we’re excited at the possibility of being joined by a well-known Terraria fan… --- BIOME TILE ICONOGRAPHY UPDATE Previously, when blocks could be partially mined, we added a pip system to diggable blocks that indicated how many hits were required. Through playtesting, we’ve identified that these small pips can be hard to see, so they’ve been updated to match the chop icons on trees - a single, larger icon containing the dig value. It’s a small change, but a big improvement in terms of user experience. --- DEVELOPMENT NEWS So, what’s left to be done from a development point of view? BOSS CARDS As mentioned last month, as well as streamlining Boss behaviours and mechanics, we’ve been trying out a new idea that make a Boss’s spawned ally more than just another enemy token in the world. We’ve been testing a new idea whereby allies power up their Boss via a ‘buff’ card; the idea has been simplified and the boss cards redesigned so that the cards provide an interesting decision for players each turn (which buff do I place an ally token onto?) while also making the result of the buff easily visible in the usual flow of the Boss’s turn. These are examples of prototype boss cards currently undergoing testing – once they are finalised, art and graphic design will be updated to match the rest of the game, and the final cards will be foiled for that premium boss feel! RULEBOOK The rulebook is one of the most important parts of a board game, but also one of the most difficult to get right. We’re still working on the updated version, ensuring that it is as concise as possible while covering everything that players need to know. It’s a delicate balance; we’re getting close but a bit more work is required before we are happy with it. Rest assured that once it’s ready, we’ll be sharing it with you, along with a summary of what’s changed rules-wise over the past few months. Thanks for bearing with us! --- Next month, we’ll have final samples to show, we’ll be providing details about the shipping and fulfilment process, and we’ll hopefully have video content to show you! Remember; if you missed the campaign but would still like to get your hands on the game, late pledges are now available via the link below: Until next time! OTHER COMMUNITY NEWS TERRARIA MEDIA SPOTLIGHT The Terraria community is filled with incredible fan media. We love to browse Terraria associated social pages and check out the creative minds sharing wonderful creations. We wanted to spotlight some of the trending media that caught our attention this month. Please let us know if any of the shared media has a different original creator. (CLICK A GIVEN IMAGE TO HEAD OVER TO THE THREAD WHERE WE SAW IT) by Drawnbykrishna by Suinumi by 枭是猫头鹰的意思 (tytotytole) by @StarsAndStuff by @carnagemarvin by @TerrarianMitrilda by @CerealSunny by @Asternove by SnookyZun by Free-Relationship-22 by Immediate-Salary-899 by AkiTheFull by Frickandheck- by AEngel-777 by PikusM Until next time, Terrarians - we hope you have an amazing month, and we look forward to bringing you the latest and greatest next time! Back to Table of Contents Last edited:"
}