{
  "url": "https://www.thefreedictionary.com/produce",
  "title": "Produce - definition of produce by The Free Dictionary",
  "text": "produce Also found in: Thesaurus, Medical, Legal, Financial, Idioms, Encyclopedia, Wikipedia. pro·duce (prə-do͞os′, -dyo͞os′, prō-)v. pro·duced, pro·duc·ing, pro·duc·es v.tr. 1. To bring forth; yield: a plant that produces pink flowers. 2. a. To create by physical or mental effort: produce a tapestry; produce a poem. b. To manufacture: factories that produce cars and trucks. 3. To cause to occur or exist; give rise to: chemicals that produce a noxious vapor when mixed. 4. To bring forth; exhibit: reached into a pocket and produced a pack of matches; failed to produce an eyewitness to the crime. 5. To act or operate as producer for: produce a stage play; produce a video. 6. Mathematics To extend (an area or volume) or lengthen (a line). v.intr. 1. To make or yield products or a product: an apple tree that produces well. 2. To manufacture or create economic goods and services. n. (prŏd′o͞os, prō′do͞os) Farm products, especially fresh fruits and vegetables, considered as a group. [Middle English producen, to proceed, extend, from Latin prōdūcere, to extend, bring forth : prō-, forward; see pro-1 + dūcere, to lead; see deuk- in Indo-European roots.] pro·duc′i·ble, pro·duce′a·ble adj. Synonyms: produce, bear1, yield These verbs mean to bring forth as a product: a mine that produces gold; a seed that finally bore fruit; a plant that yields a medicinal oil. These verbs mean to bring forth as a product: a mine that produces gold; a seed that finally bore fruit; a plant that yields a medicinal oil. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. produce vb 1. to bring (something) into existence; yield 2. to bring forth (a product) by mental or physical effort; make: she produced a delicious dinner for us. 3. (tr) to give birth to 4. (Commerce) (tr) to manufacture (a commodity): this firm produces cartons. 5. (tr) to give rise to: her joke produced laughter. 6. (tr) to present to view: to produce evidence. 7. (Film) to bring before the public: he produced two plays and a film last year. 8. (Music, other) to conceive and create the overall sound of (a record) and supervise its arrangement, recording, and mixing 9. (Mathematics) (tr) geometry to extend (a line) n 10. anything that is produced; product 11. (Agriculture) agricultural products regarded collectively: farm produce. [C15: from Latin prōdūcere to bring forward, from pro-1 + dūcere to lead] proˈducible adj proˌduciˈbility n Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 pro•duce (v. prəˈdus, -ˈdyus; n. ˈprɒd us, -yus, ˈproʊ dus, -dyus)v. -duced, -duc•ing, n. v.t. 1. to cause to exist; give rise to: to produce steam. 2. to bring into existence by intellectual or creative ability: to produce a great painting. 3. to make or manufacture: to produce automobiles for export. 4. to give birth to; bear. 5. to furnish or supply; yield: a mine producing silver. 6. to present; exhibit: to produce one's credentials. 7. to bring (a play, movie, opera, etc.) before the public. 8. to extend or prolong, as a line. v.i. 9. to yield products, offspring, etc. n. 10. something that is produced; yield; product. 11. agricultural products collectively, esp. vegetables and fruits. prod•uce [1375–1425; late Middle English < Latin prōdūcere to lead or bring forward, extend, prolong, produce =prō- pro-1 + dūcere to lead] pro•duc′i•ble, adj. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. produce product1. 'produce' used as a verb Produce is usually a verb, pronounced /prə'djuːs/. To produce a result or effect means to cause it to happen. His comments produced an angry response. The talks failed to produce an agreement. To produce goods or food means to make or grow them, usually to be sold. The factory produces goods for export. They use all the available land to produce crops. 2. 'produce' used as a noun Food that is grown to be sold is called produce, pronounced /'prɒdjuːs/. She has a market stall selling organic produce. 3. 'product' Goods that are made and sold in large quantities are called products. Manufacturers spend huge sums of money advertising their products. Collins COBUILD English Usage © HarperCollins Publishers 1992, 2004, 2011, 2012 produce Past participle: produced Gerund: producing Collins English Verb Tables © HarperCollins Publishers 2011 ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. produce verb 1. cause, lead to, result in, effect, occasion, generate, trigger, make for, provoke, set off, induce, bring about, give rise to, engender The drug is known to produce side-effects. 2. make, build, create, develop, turn out, manufacture, construct, invent, assemble, put together, originate, fabricate, mass-produce The company produces circuitry for communications systems. 3. create, develop, write, turn out, compose, originate, churn out (informal) So far he has produced only one composition he deems suitable for performance. 4. yield, provide, grow, bear, give, supply, afford, render, furnish The plant produces sweet fruit with deep red flesh. 5. bring forth, bear, deliver, breed, give birth to, beget, bring into the world Some species of snake produce live young. 6. show, provide, present, advance, demonstrate, offer, come up with, exhibit, put forward, furnish, bring forward, set forth, bring to light They challenged him to produce evidence to support his allegations. noun 1. fruit and vegetables, goods, food, products, crops, yield, harvest, greengrocery (Brit.) I buy organic produce whenever possible. Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 produce verb3. To make as income or profit: 5. To create by forming, combining, or altering materials: 6. To cause to come into existence: Idiom: give birth to. The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations تَضَع، تَلِدمَنْتوج، غُلَّه،مَحْصوليُبْرِز، يُنْتِجيُخْرِج مَسْرَحِيَّهيُسَبِّب، يُحْدِث inscenovatprodukovatproduktrežírovatrodit producereproduktfødefrembringe tuottaatuotteetvalmistaaesittäätehdä proizvestiproducirati bemutatelõveszgyártkihozszínre hoz framleiîaframleiîslageta af sérleggja fram, sÿnaleiîa af sér 生産する 생산하다 atsivestiatvestigaminyspastatymasprodiuseris atnestiesdot ražuizgatavotizraisītproducēt produkovaťprodukt dajatidatiizdelekizdelovatipridelek producera ผลิต tạo ra produce A. [prəˈdjuːs] VT 1. (= yield) [+ coal, crop, electricity, sound] → producir; [+ milk] [farm] → producir; [cow] → dar; [+ interest] → rendir, producir; [+ profit, benefits] → producir, reportar the plant produces three harvests a year → la planta da tres cosechas al año friction produces heat → la fricción produce calor oil-producing countries → países mpl productores de petróleo the plant produces three harvests a year → la planta da tres cosechas al año friction produces heat → la fricción produce calor oil-producing countries → países mpl productores de petróleo 3. (= create) [+ novel] → escribir; [+ magazine] → publicar; [+ musical work] → componer she has produced consistently good work at school → su trabajo escolar siempre ha sido bueno he is the most creative novelist this century has produced → es el novelista más creativo que nos ha dado este siglo with this symphony he has produced a masterpiece → ha compuesto una obra maestra con esta sinfonía she has produced consistently good work at school → su trabajo escolar siempre ha sido bueno he is the most creative novelist this century has produced → es el novelista más creativo que nos ha dado este siglo with this symphony he has produced a masterpiece → ha compuesto una obra maestra con esta sinfonía 4. (= give birth to) [+ offspring] [animal] → parir; [woman] → tener, dar a luz a; [parents] → tener 5. (= bring out, supply) [+ gift, handkerchief, gun] → sacar; [+ ticket, documents, evidence, proof] → presentar; [+ argument] → dar, presentar; [+ witness] → nombrar; [+ meal] → preparar when challenged he produced a knife → cuando se le paró sacó una navaja when challenged he produced a knife → cuando se le paró sacó una navaja 6. (Cine, Theat) [+ film, play, show] → producir (TV, Rad) → realizar (Publishing) [+ magazine] → publicar (Mus) [+ record] → producir 7. (= cause) [+ symptoms] → producir, causar; [+ response] → provocar, producir it produced a sensation of drowsiness → producía or causaba una sensación de somnolencia the photographer used a special lens to produce that effect → el fotógrafo usó una lente especial para producir ese efecto by combining the two kinds of paint you can produce some interesting effects → combinando las dos clases de pintura puedes conseguir efectos interesantes you may find that just threatening this course of action will produce the desired effect → puedes encontrarte con que amenazar este procedimiento producirá el efecto deseado she is optimistic that his visit could produce results → piensa que su visita podría surtir efecto it produced a sensation of drowsiness → producía or causaba una sensación de somnolencia the photographer used a special lens to produce that effect → el fotógrafo usó una lente especial para producir ese efecto by combining the two kinds of paint you can produce some interesting effects → combinando las dos clases de pintura puedes conseguir efectos interesantes you may find that just threatening this course of action will produce the desired effect → puedes encontrarte con que amenazar este procedimiento producirá el efecto deseado she is optimistic that his visit could produce results → piensa que su visita podría surtir efecto 8. (Geom) [+ line, plane] → prolongar B. [prəˈdjuːs] VI C. [ˈprɒdjuːs] N (Agr) → productos mpl agrícolas, productos mpl del campo \"produce of Turkey\" → producto m de Turquía \"produce of more than one country\" → producto m elaborado en varios países see also dairy B see also farm D \"produce of Turkey\" → producto m de Turquía \"produce of more than one country\" → producto m elaborado en varios países see also dairy B see also farm D D. [ˈprɒdjuːs] CPD produce counter N (US) → mostrador m de verdura produce store N (US) → verdulería f produce store N (US) → verdulería f Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 produce [prəˈdjuːs] vt (= manufacture) [+ product, item] → produire [+ meal] → confectionner (= yield) [+ oil, gas, electricity] → produire (= cause) → produire The drug is known to produce side-effects → Le médicament est connu pour produire des effets secondaires. The drug is known to produce side-effects → Le médicament est connu pour produire des effets secondaires. (= make, create) [+ carbon dioxide, toxins, gases, antibodies] → produire to produce seed → produire des graines to produce seed → produire des graines (= offer) [+ evidence, argument] → produire (= show) [+ document] → produire [+ show, play, film, programme] → produire (= take out) (from bag, pocket) → sortir Collins English/French Electronic Resource. © HarperCollins Publishers 2005 produce n no pl (Agr) → Produkt (→ e pl), → Erzeugnis(se) nt(pl); Italian produce, produce of Italy → italienisches Erzeugnis; the produce of the soil → die Bodenprodukte or -erzeugnisse pl vt (= yield) → produzieren; (Ind) → produzieren, herstellen; electricity, energy, heat → erzeugen; crop → abwerfen; coal → fördern, produzieren; (= create) book, article, essay → schreiben; painting, sculpture → anfertigen; ideas, novel etc, masterpiece → hervorbringen; interest, return on capital → bringen, abwerfen; meal → machen, herstellen; the sort of environment that produces criminal types → das Milieu, das Kriminelle hervorbringt; to produce offspring → Junge bekommen; (hum: people) → Nachwuchs bekommen; to be well produced → gut gemacht sein; (goods also) → gut gearbeitet sein; hopefully he can produce the goods (fig inf) → hoffentlich bringt er es auch (inf) (= bring forward, show) gift, wallet etc → hervorholen (from, out of aus); pistol → ziehen (from, out of aus); proof, evidence → liefern, beibringen; results → liefern; effect → erzielen; witness → beibringen; ticket, documents → vorzeigen; she managed to produce something special for dinner → es gelang ihr, zum Abendessen etwas Besonderes auf den Tisch zu bringen; I can’t produce it out of thin air → ich kann es doch nicht aus dem Nichts hervorzaubern or aus dem Ärmel schütteln (inf); if we don’t produce results soon → wenn wir nicht bald Ergebnisse vorweisen können; he produced an incredible backhand → ihm gelang ein unglaublicher Rückhandschlag; he produced a sudden burst of speed → er rannte plötzlich kurz los (Math) line → verlängern vi (Theat) → das/ein Stück inszenieren; (Film) → den/einen Film produzieren (factory, mine) → produzieren; (land) → Ertrag bringen; (tree) → tragen; this cow hasn’t produced for years (produced calf) → diese Kuh hat jahrelang nicht mehr gekalbt; (produced milk) → diese Kuh hat jahrelang keine Milch mehr gegeben; when is she going to produce? (hum) → wann ist es denn so weit?; it’s about time that you produced (hum) → es wird bald Zeit, dass ihr mal an Nachwuchs denkt Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 produce [n ˈprɒdjuːs; vb prəˈdjuːs]2. vt a. (manufacture, gen) → produrre; (create, book, essay) → scrivere; (work of art) → fare; (meal) → preparare; (ideas, profit) → dare; (give birth to) → partorire b. (bring, show, gen) → tirar fuori; (tickets) → esibire, mostrare; (proof of identity) → produrre, fornire I can't suddenly produce £500! → da dove le tiro fuori 500 sterline? I can't suddenly produce £500! → da dove le tiro fuori 500 sterline? c. (film) → produrre; (play) → mettere in scena Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995 produce (prəˈdjuːs) verb1. to bring out. She produced a letter from her pocket. 2. to give birth to. A cow produces one or two calves a year. 3. to cause. His joke produced a shriek of laughter from the children. 4. to make or manufacture. The factory produces furniture. 5. to give or yield. The country produces enough food for the population. 6. to arrange and prepare (a theatre performance, film, television programme etc). The play was produced by Henry Dobson. (ˈprodjuːs) noun something that is produced, especially crops, eggs, milk etc from farms. agricultural/farm produce. proˈducer noun a person who produces a play, film, etc, but is usually not responsible for instructing the actors. product (ˈprodəkt) noun1. a result. The plan was the product of hours of thought. 2. something manufactured. The firm manufactures metal products. 3. the result of multiplying one number by another. The product of 9 and 2 is 18. proˈduction (-ˈdakʃən) noun1. the act or process of producing something. car-production; The production of the film cost a million dollars. 2. the amount produced, especially of manufactured goods. The new methods increased production. 3. a particular performance, or set of repeated performances, of a play etc. I prefer this production of `Hamlet' to the one I saw two years ago. proˈductive (-ˈdaktiv) adjective (negative unproductive) producing a lot; fruitful. productive land; Our discussion was not very productive. productivity (prodəkˈtivəti) noun the rate or efficiency of work especially in industrial production. Kernerman English Multilingual Dictionary © 2006-2013 K Dictionaries Ltd. produce → يُنْتِجُ vytvořit producere produzieren παράγω producir tuottaa produire proizvesti produrre 生産する 생산하다 produceren produsere wyprodukować produzir производить producera ผลิต üretmek tạo ra 生产Multilingual Translator © HarperCollins Publishers 2009 produce n. producto, esp. vegetales, frutas y legumbres; producción; v. producir, crear; causar. English-Spanish Medical Dictionary © Farlex 2012 produce vt producirEnglish-Spanish/Spanish-English Medical Dictionary Copyright © 2006 by The McGraw-Hill Companies, Inc. All rights reserved."
}