{
  "url": "https://forum.jami.net/t/jami-pour-le-debutant/2619",
  "title": "Jami, pour le débutant - Support en français (French) - Jami Forum",
  "text": "J’ai rédigé un texte pour expliquer les différences de fonctionnement de Jami par rapport aux logiciels de communication concurrents. Le fait que Jami utilise un modèle de communication P2P a des impacts sur son fonctionnement et peut causer des surprises aux nouveaux utilisateurs (et même aux habitués!). J’ai tenté d’expliquer les raisons de ces différences, afin de permettre à tout le monde de comprendre pourquoi Jami fonctionne de cette manière, et les conséquences de l’architecture P2P. Jami pour le débutant: https://cryptpad.fr/pad/#/2/pad/view/ChRPi1bwNmqJdqnayN3hbDlXspiaZaQzrW6Sb0SUAIA/ Merci de m’indiquer vos commentaires dans ce fil de discussion. À terme, ces explications pourraient se transformer en un billet de blogue pour populariser l’utilisation de Jami. 3 Likes Bonjour @pmetras Merci pour cette analyse pertinente et synthétique des particularités de Jami. Pour faire court, je doute que Jami puisse se “populariser” tant qu’il ne sera pas populaire … Il nous semble que l’architecture distribuée sur laquelle repose jami nécessite un plus grand nombre d’appareils connectés en permanence, afin d’offrir une qualité de service similaire aux services centralisés. Actuellement, seules quelques personnes conscientes des enjeux Éthiques du numérique, s’accrochent à jami comme à une bouée de sauvetage ET elles ne sont pas légion… Merci aux rares et précieux et persévérants participants du swarm/essaim Jami Entraide Utilisateurs créé par caféine (et orevlucanje). Quoi de mieux pour populariser jami que d’utiliser jami ? … Une question pour @lbogino et @sblin : Compte tenue des dernières évolutions de jami, pouvons nous envisager une nouvelle expérience de vidéo en essaim ? Jamicalement belle journée ou soirée à Tous merci pour la doc. Ce qui résonne totalement avec mon expérience, et qui est inattendu, est donc: la transmission des messages n’a lieu que si les correspondants sont simultanément en ligne. en effet Avec les systèmes de messagerie utilisant des serveurs centralisés, lorsqu’Annie envoie un message texte ou un fichier, celui-ci sera conservé au niveau du serveur, et Bécassine le recevra sur son équipement dès qu’elle se connectera au réseau. Avec Jami, ce n’est pas le cas et Bécassine pourra attendre longtemps avant de recevoir le message ou le fichier. […] Il faut réellement que tous les correspondants soient connectés pour que Jami distribue les messages correctement, parfois avec un léger délai. Je suppose que c’est toujours le cas (bien que je ne puisse pas encore tester la dernière version de Jami, faute d’un système un peu vieux). Je suivrais les nouvelles sur ce sujet avec particulièrement d’intérêt. Merci, Bonjour Si votre système est trop vieux mais votre matériel toujours ok , installez Linux Mint … Nous utilisons jami sur un macbookpro de 2011 MAIS avec un OS Linux Mint (ou une autre distribution de votre choix, mais pour nous la plus accessible pour des non connaisseurs d’informatique comme nous est cette distribution) ovari 5 D’expérience, la qualité de service de Jami est supérieure à celle des services centralisés et décentralisés. Le décalage est réduit, car les données ne transitent pas par les serveurs. From experience, Jami quality of service is better than centralized and decentralized services. There is less lag as data does not have to travel through servers."
}