{
  "url": "https://www.yoderscountrymarket.com/restaurant",
  "title": "Restaurant - Yoder's Country Market",
  "text": "We are now offering online take-out orders! Order on the Website | Order on the App Facilities Yoder’s Restaurant and Buffet supplies our customers with a casual dining atmosphere, while offering a variety of different foods to accommodate everyone’s appetite. We offer the buffet or the option to order off our menu. The restaurant, as well as entire shopping complex, is handicap accessible with plenty of convenient free parking and a smoke-free environment. Buffets Including Grill Station, Salad Bar and Dessert Bar! Our famous hot buffets includes broasted chicken plus other entrees, a variety of vegetables, Pennsylvania Dutch potato filling, REAL mashed potatoes, our famous corn fritters and homemade soup. - Breakfast Buffet (Monday – Saturday 6:00 a.m. to 10:30 a.m.) Featuring our eggs made to order, scrambled eggs, bacon, sausage, scrapple, creamed beef, biscuits, pancakes, french toast, baked oatmeal, toast, fresh fruit, donuts, pastries and More. - Lunch Buffet (Monday – Friday 11:00 a.m. to 3:00 p.m.) - Dinner Buffet (Monday-Thursday 4:00 p.m. to 7:00 p.m., Friday 4:00 p.m. to 8:00 p.m. Saturday from 11:00 a.m. to 8:00 p.m) - Sunday Brunch (10:00 a.m. - 2:00 p.m.) Salad and Dessert Bars Our salad and dessert bars feature over 40 different items including fresh fruit, an assortment of cakes and pies, as well as soft ice-cream with toppings. Private Rooms Private Rooms (Monday - Saturday 6:00 a.m. to 7:00 p.m.) are available for family events and bus groups. Please speak to a restaurant manager for reservations and availability of private rooms. (717)354-0129 See all our hours - https://www.yoderscountrymarket.com/stores/yoders-country-market Free Buffet on Your Birthday! Applies to Breakfast, Lunch, Dinner and Sunday Brunch. Here’s how it works: - 1 Free Birthday Buffet Meal is offered to a guest on the day of their birthday when 1 additional adult buffet meal, at full price, is purchased at the same time and in the same dining party. - Only 1 Free Meal per Birthday. - If your birthday falls on a Sunday you may redeem your free buffet on following Monday. - You may use your free meal on the day of your birthday only. If we are closed the day of your birthday, you may use the free meal on the next day that our restaurant is open for business. - This Program may not be used in conjunction with any other discount. - Everyone that wants to receive a Free Birthday Buffet MUST fill out a Birthday Card. - Valid ID must be presented to the Cashier at the time of purchase (Driver’s License, State Photo ID, Birth Certificate or Passport) - Not valid for menu items or take out meals. Senior Citizens 62 years of age and older please inform your waitress when you order to receive your 10% discount (void with any other discounts)."
}