{
  "url": "https://www.clinicaladvisor.com/features/gina-2025-asthma-update/",
  "title": "GINA 2025 Asthma Update: T2 Biomarkers & Young Children",
  "text": "The Global Initiative for Asthma (GINA) has issued the 2025 update to its Global Strategy for Asthma Management and Prevention report, as published on GINA’s website. The GINA 2025 asthma update includes key changes on a number of topics, including: - use of biomarkers of type 2 inflammation; - diagnosis and treatment of asthma and exacerbations in children aged 5 years and younger; - asthma diagnosis, treatment recommendations and severe exacerbation risk factors in adults and adolescents; and - the effects of extreme weather and climate change on patients with asthma. The 2025 update also includes revised versions of important charts, with revisions made to a figure guiding shared decision-making in inhaler choice; a table on treatment change options within asthma action plans; and the decision tree for severe asthma. Notably, GINA plans to publish the updated 2025 severe asthma decision tree as a short, stand-alone guide. Type 2 Biomarkers The 2025 GINA strategy report includes a new appendix with expanded information on the role of type 2 biomarkers — most notably blood eosinophil count (BEC) and fractional exhaled nitric oxide (FeNO) — in the diagnosis, assessment, and management of asthma. Additionally, more information on type 2 biomarkers has been included throughout the report. This expanded biomarker information includes criteria for defining high BEC and FeNO in adults and adolescents. General criteria provided for defining high BEC is a level that is greater or equal to the upper limit of normal for the given population, based on regional or national laboratory reference values. Among patients with severe asthma using high-dose inhaled corticosteroids (ICS), a BEC of at least 150/µL suggests type 2 inflammation, and a BEC of at least 300/µL is a typical threshold for type 2–targeted biologics. The criteria provided for defining high FeNO levels are as follows: FeNO greater than 50 ppb in individuals who are ICS-naïve; FeNO at least 25 ppb in individuals using medium-dose ICS; and FeNO at least 20 ppb in individuals using high-dose ICS. The report noted that BEC and FeNO levels should be interpreted with caution in clinical practice. Because clinicians need to be mindful of factors contributing to variability in BEC and FeNO, information on these factors has been added to the 2025 report. “This information may be highly relevant when clinicians are assessing a patient’s eligibility for Type-2 targeted biologic therapy in clinical practice; it also indicates that caution is needed when comparing a patient’s biomarker results with absolute thresholds in clinical practice,” the report authors noted. In patients with severe asthma who are being considered for type 2-directed biologics, BEC and FeNO should be measured at least 3 times if they are not initially above the target threshold, the report noted. Severe Exacerbations: Risk Factors Authors of the 2025 update noted that recent research on the Oxford Asthma Attack Risk Scale 2 (ORACLE2) supports GINA’s longstanding recommendation that “multiple factors, including type 2 biomarkers, should be considered in the assessment of patients’ risk of future exacerbations.” Uncontrolled asthma symptoms are among those exacerbation risk factors; for patients with few asthma symptoms, risk factors for exacerbations include overuse of short-acting beta2 agonist (SABA), inadequate ICS, comorbidities such as obesity and chronic rhinosinusitis, smoking and vaping (e-cigarette use), psychological and socioeconomic problems, poor lung function, increased BEC and FeNO, and exacerbation history. Other external and environmental factors such as air pollution may affect asthma exacerbations as well. Asthma in Young Children The 2025 report underwent extensive review by pediatricians on the GINA science committee. Diagnosis Importantly, the 2025 report includes clear and pragmatic guidance on diagnosing asthma in children aged 5 years and younger. The 3 main criteria are: (1) recurrent acute wheezing episodes; (2) no likely alternative cause for the respiratory symptoms; and (3) respiratory symptoms or signs showing a timely clinical response to the administration of asthma medications. All 3 criteria are required for diagnosing asthma in young children, according to the committee. Treatment A step-wise treatment approach is recommended in patients aged 5 years and younger. Treatment typically involves long-term, daily low-dose ICS to keep asthma well controlled, and reliever medications can be used for as-needed symptom relief. The recommended reliever among preschoolers with asthma is SABA as needed when symptoms occur, using a pressurized metered-dose inhaler (pMDI) with a mouthpiece or facemask as appropriate. When symptoms are not well controlled after 2 to 3 months on initial treatment with low-dose ICS, or if there are continued exacerbations, clinicians may consider doubling the low daily ICS dose plus as-needed SABA. If asthma symptoms are still not well controlled, the patient’s inhaler technique and medication adherence should be reassessed, along with environmental factors, and the patient can be referred to a specialist. Exacerbation Management For managing children aged 5 years and younger with worsening asthma and exacerbations in primary care or an acute care facility, the committee recommends assessing severity of the exacerbation while initiating the following treatment with bronchodilator and oxygen if needed: SABA, 4 to 6 puffs of salbutamol (albuterol) 100 mcg/actuation by pMDI with spacer or 2.5 mg by nebulizer, given once for mild exacerbations and every 20 minutes for 3 total doses during the first hour, if needed, for moderate or severe exacerbations; and oxygen, if needed, to maintain saturation at least 94%. As initial emergency department management within or after the initial hour of treatment, intravenous isotonic magnesium sulfate may be considered in those at least 2 years of age with severe exacerbations. Extreme Weather and Asthma Also new to this year’s GINA update is a brief section on extreme weather and asthma. “The increasing frequency and intensity of extreme weather events (including extreme heat, cold, rainfall, drought) poses a growing risk to…people with asthma,” the report authors stated. Climate change impacts asthma primarily in 2 ways: catastrophic weather events affect infrastructure and disrupt care for patients with asthma; and climate change also contributes to higher air pollution levels (eg, from wildfires), better survival of respiratory viruses, and increased allergens such as mold and pollen, which — along with extreme heat and cold — may worsen asthma morbidity. Recommended mitigation strategies include using face masks during wildfires and sheltering in temperature-controlled environments. Shared Decision-Making When making patient-level treatment decisions, shared decision-making should consider patient characteristics such as asthma phenotype or environmental exposures that predict the patient’s risk for exacerbations or other adverse outcomes or the likely response to treatment, as well as the patient’s goals or concerns and practical issues such as inhaler technique, adherence, medication access, and cost. Inhaler Choice Diagram Update The diagram on shared decision-making between health care provider and patients about inhaler choice has been clarified on the order of consideration of factors and stage at which a provider and patient may consider the environmental effect of inhaler choices. The initial step is to choose the right class of medication for the patient after considering exacerbation risk reduction, symptom control, and adverse effects. Next, check what inhalers are available for this medication class, and which of these the patient can use correctly. If more than one, then providers can consider other issues, including which inhaler has the lowest environmental impact. In these cases, the inhaler’s manufacturing, propellant (for pMDIs), and potential for recycling can be assessed. Updated Diagnostic Flowchart for Adults and Adolescents The diagnostic flowchart for asthma in adults and adolescents has been updated, with assessment of lung function continuing to be the first option for confirming a diagnosis. The flowchart now includes the limited role of biomarkers. The committee has replaced the phrase “variable expiratory airflow limitation” in the previous version with “variable expiratory airflow,” as airflow limitation may be present sometimes and not at other times in patients with untreated asthma. Severe Asthma Decision Tree Update The decision tree for severe asthma has been updated regarding investigations performed by specialists. Confirmation of a severe asthma diagnosis is now in stage 5 after the initial specialist evaluation, because in some cases the specialist may identify a patient who does not have asthma or whose symptoms are associated with a comorbidity. In addition, a section on type 2 biomarkers has been updated, including re-assessment of previously low BEC and/or FeNO if the clinical context has changed. Asthma Action Plan Medication Table Reorganized A table on medication options for written asthma action plans has been reorganized according to treatment track. Among patients who use conventional SABA-based treatment in track 2, SABA is increased for symptom relief, with modest evidence that doubling or quadrupling the maintenance ICS dose can decrease severe exacerbations. Patients using the anti-inflammatory reliever ICS-formoterol in track 1 should continue their usual maintenance dose and increase their as-needed doses incrementally to control inflammation and bronchoconstriction. No significant benefit has been shown for use of nebulized magnesium sulfate in adults and adolescents or children. 2-Track Treatment Diagram Update Because patients in low- and middle-income countries may have poor access to combination ICS-formoterol, the 2025 report has retained the 2-track treatment diagram regarding treatment recommendations for adults and adolescents. In track 1, use of ICS-formoterol as the reliever is associated with a decrease in the risk for exacerbations vs a SABA reliever and is simpler. For track 2, the guidance advises checking whether the patient is likely to adhere to daily controller treatment before considering a regimen with a SABA reliever. A new recommendation in track 2 involves step 4, in which a medium-to-high dose of ICS–long-acting beta2 agonist (LABA) has been changed to medium-dose ICS-LABA to minimize exposure to the adverse effects of high-dose ICS. ICS-LABA should be limited to 3 to 6 months, if possible, when needed, according to the report authors. In a section on low, medium, and high daily metered doses of ICS, daily doses of fluticasone furoate are reclassified as low-medium (100 mcg) and medium-high (200 mcg), owing to the difficulty in aligning doses with older molecules to avoid ambiguity about ICS-LABA noted in track 2, step 4. Updates on Add-On Treatments The committee also notes that referral of patients with difficult to treat asthma to an expert should not be delayed by trying different add-on treatments. Additionally, the list of nonrecommended bronchodilators now includes fenoterol because of its association with an increased risk of cardiovascular adverse effects and asthma mortality. GINA Science Committee: Process and Goals As with previous GINA reports, the 2025 report is based on a twice annual update of the evidence, which forms the basis for the recommendations made by the GINA Science Committee. The committee, which is comprised of leaders in adult and pediatric asthma research, performed a full-text review for 78 publications, of which 59 full-text publications were discussed at committee meetings. The Global Strategy for Asthma Management and Prevention report is intended for primary care practitioners, specialists, and allied health professionals with the goal of improving the management and prevention of asthma. As the committee noted in the newly released 2025 report, “Implementation of asthma management strategies may be carried out at a national, regional, or local level,” the committee stated. “Ideally, implementation should be a multidisciplinary effort involving many stakeholders and using cost-effective methods of knowledge translation.” Editor’s Note: This article was updated on August 19, 2025. An additional step was added to the “Inhaler Choice Diagram Update” section, and an error in the “Asthma in Young Children: Exacerbation Management” section was corrected, changing the nebulized albuterol dose for children aged 5 and younger from 0.25 mg to 2.5 mg. This article originally appeared on Pulmonology Advisor References: Global Initiative for Asthma. Global strategy for asthma management and prevention (2025 update). Updated May 7, 2025. Available at: https://ginasthma.org/2025-gina-strategy-report/"
}