{
  "url": "https://flutrackers.com/forum/forum/local-regional-communities-and-organizations/cidrap/1020719-cidrap-news-briefs-october-9-2025",
  "title": "CIDRAP- NEWS BRIEFS October 9, 2025 - FluTrackers News and Information",
  "text": "https://www.cidrap.umn.edu/all-news Trial results indicate Jynneos vaccine performs well in young children News brief 49 minutes ago. Chris Dall, MA Topics Mpox Smallpox Drugmaker Bavarian Nordic yesterday announced encouraging topline results from a clinical trial of its combined mpox/smallpox vaccine in young children. In a news release, the company said the immune response to the Jynneos (MVA-BN) vaccine in children aged 2 to 11 years, measured 2 weeks after the second dose, was non-inferior to that observed in adults. In children aged 2 to 5, the immune response was 2.5 times greater than observed in adults. The findings, which have not been peer-reviewed, are from a trial that examined the safety and immunogenicity of the two-dose vaccine in 227 children and 224 adults aged 18 to 50 years. The trial was conducted in locations in the Democratic Republic of the Congo and Uganda, two countries that have been at the epicenter of the mpox outbreak in Africa, and jointly funded by Bavarian Nordic and the Coalition for Epidemic Preparedness Innovations (CEPI). The vaccine was also well tolerated in children, with no unexpected safety signals reported. \"With the support from CEPI and local partners in Africa, we have now shown MVA-BN to be well-tolerated and to generate a robust and clinically relevant immune response in this population, bringing us one step closer to approval of our vaccine for children aged two to 11 years,\" said Bavarian Nordic President and CEO Paul Chaplin, PhD. Chaplin noted that though mpox vaccination efforts have improved in Africa, young children remain highly vulnerable to the disease. Jynneos is currently approved for use in individuals aged 12 and older. Bavarian Nordic said it will submit final trial data to the European Medicines Agency in 2026 to support an extension of approval for children aged 2 and above. Researchers: Live H5N1 avian flu can survive in raw-milk cheese for up to 6 months News brief Today at 1:09 p.m. Mary Van Beusekom, MS Topics Avian Influenza (Bird Flu) Infectious H5N1 avian influenza virus can persist in raw-milk cheeses while they are being made and for up to 120 days of aging, depending on the milk's acidity (pH) level, according to a report published yesterday in Nature Medicine. \"Highly pathogenic avian influenza H5N1 viruses have recently spread to dairy cattle, with high levels of virus detected in milk from affected animals, raising concern about the risk posed by unpasteurized dairy products consumed by humans,\" wrote the Cornell University–led research team. The investigators assessed H5N1 viral persistence in raw-milk cheeses made with milk acidified to pH levels of 6.6, 5.8, and 5.0 (the lower the pH, the higher the acidity) and spiked with H5N1 virus before cheese making. They validated their findings in commercial raw-milk cheeses inadvertently containing naturally contaminated raw milk and fed the raw milk and cheese to ferrets to evaluate virus infectivity. Current regulations insufficient for H5N1 Viral survival depended on the pH level of the raw milk, with infectious virus persisting throughout the cheese-making process and for up to 120 days of aging in cheeses made with raw milk at pH levels of 6.6 and 5.8 but not 5.0. The current regulation requiring 60-day aging of raw-milk cheese before marketing proves insufficient to achieve HPAI H5N1 virus inactivation and guarantee cheese safety. Of note, while ferrets fed H5N1 virus–contaminated raw milk became infected with H5N1, those fed raw-milk cheese or a cheese suspension didn't. The researchers said the lack of infection after cheese consumption may be attributable to the potentially higher oral infectious dose of H5N1 virus in solids versus liquids or ferrets' tendency to swallow small pieces of cheese whole, potentially limiting viral contact and exposure to the oropharynx. The lack of infection in ferrets fed cheese suspension can likely be attributed to lower infectious H5N1 virus levels in these samples. \"The current regulation requiring 60-day aging of raw-milk cheese before marketing proves insufficient to achieve HPAI H5N1 virus inactivation and guarantee cheese safety,\" the authors concluded. \"Implementing additional mitigation steps, such as testing of raw-milk bulk tanks or using milk pasteurization, thermization or acidification before cheese making, becomes crucial to ensure food safety.\" Quick takes: New measles cases in Utah, Ebola spread slows in DR Congo News brief Today at 1:02 p.m. Stephanie Soucheray, MA Topics Measles Ebola Viral Hemorrhagic Fever ALL BRIEFS Trial results indicate Jynneos vaccine performs well in young children News brief 49 minutes ago. Chris Dall, MA Topics Mpox Smallpox Drugmaker Bavarian Nordic yesterday announced encouraging topline results from a clinical trial of its combined mpox/smallpox vaccine in young children. In a news release, the company said the immune response to the Jynneos (MVA-BN) vaccine in children aged 2 to 11 years, measured 2 weeks after the second dose, was non-inferior to that observed in adults. In children aged 2 to 5, the immune response was 2.5 times greater than observed in adults. The findings, which have not been peer-reviewed, are from a trial that examined the safety and immunogenicity of the two-dose vaccine in 227 children and 224 adults aged 18 to 50 years. The trial was conducted in locations in the Democratic Republic of the Congo and Uganda, two countries that have been at the epicenter of the mpox outbreak in Africa, and jointly funded by Bavarian Nordic and the Coalition for Epidemic Preparedness Innovations (CEPI). The vaccine was also well tolerated in children, with no unexpected safety signals reported. \"With the support from CEPI and local partners in Africa, we have now shown MVA-BN to be well-tolerated and to generate a robust and clinically relevant immune response in this population, bringing us one step closer to approval of our vaccine for children aged two to 11 years,\" said Bavarian Nordic President and CEO Paul Chaplin, PhD. Chaplin noted that though mpox vaccination efforts have improved in Africa, young children remain highly vulnerable to the disease. Jynneos is currently approved for use in individuals aged 12 and older. Bavarian Nordic said it will submit final trial data to the European Medicines Agency in 2026 to support an extension of approval for children aged 2 and above. Researchers: Live H5N1 avian flu can survive in raw-milk cheese for up to 6 months News brief Today at 1:09 p.m. Mary Van Beusekom, MS Topics Avian Influenza (Bird Flu) Infectious H5N1 avian influenza virus can persist in raw-milk cheeses while they are being made and for up to 120 days of aging, depending on the milk's acidity (pH) level, according to a report published yesterday in Nature Medicine. \"Highly pathogenic avian influenza H5N1 viruses have recently spread to dairy cattle, with high levels of virus detected in milk from affected animals, raising concern about the risk posed by unpasteurized dairy products consumed by humans,\" wrote the Cornell University–led research team. The investigators assessed H5N1 viral persistence in raw-milk cheeses made with milk acidified to pH levels of 6.6, 5.8, and 5.0 (the lower the pH, the higher the acidity) and spiked with H5N1 virus before cheese making. They validated their findings in commercial raw-milk cheeses inadvertently containing naturally contaminated raw milk and fed the raw milk and cheese to ferrets to evaluate virus infectivity. Current regulations insufficient for H5N1 Viral survival depended on the pH level of the raw milk, with infectious virus persisting throughout the cheese-making process and for up to 120 days of aging in cheeses made with raw milk at pH levels of 6.6 and 5.8 but not 5.0. The current regulation requiring 60-day aging of raw-milk cheese before marketing proves insufficient to achieve HPAI H5N1 virus inactivation and guarantee cheese safety. Of note, while ferrets fed H5N1 virus–contaminated raw milk became infected with H5N1, those fed raw-milk cheese or a cheese suspension didn't. The researchers said the lack of infection after cheese consumption may be attributable to the potentially higher oral infectious dose of H5N1 virus in solids versus liquids or ferrets' tendency to swallow small pieces of cheese whole, potentially limiting viral contact and exposure to the oropharynx. The lack of infection in ferrets fed cheese suspension can likely be attributed to lower infectious H5N1 virus levels in these samples. \"The current regulation requiring 60-day aging of raw-milk cheese before marketing proves insufficient to achieve HPAI H5N1 virus inactivation and guarantee cheese safety,\" the authors concluded. \"Implementing additional mitigation steps, such as testing of raw-milk bulk tanks or using milk pasteurization, thermization or acidification before cheese making, becomes crucial to ensure food safety.\" Quick takes: New measles cases in Utah, Ebola spread slows in DR Congo News brief Today at 1:02 p.m. Stephanie Soucheray, MA Topics Measles Ebola Viral Hemorrhagic Fever - The Utah Department of Health and Human Services has announced 6 more measles cases, bringing the state's total to 53. All new cases are in the southwest region, which is the epicenter of measles activity in the state. Of the 53 measles patients, 6 have required hospitalization. All but one were unvaccinated or have unknown immunization status. - Today the World Health Organization (WHO) said there have been no new confirmed or probably Ebola cases reported in the Democratic Republic of the Congo. As of October 5, 10 days have passed with no new cases, suggesting transmission has slowed. There is one new death reported, however, in a 3-week-old baby who was previously listed as hospitalized for Ebola infection. The outbreak has had 64 confirmed or probable cases of Ebola, including 43 deaths. ALL BRIEFS"
}