{
  "url": "https://educationfreedom.texas.gov/",
  "title": "Home - Texas Education Freedom Accounts",
  "text": "Applications Open Feb. 4th! Families will be able to apply for Texas Education Freedom Accounts (TEFA) starting February 4 at 9:00 a.m. CT. Submit your application by 11:59 p.m. CT on March 17. This is not a first-come, first-served program. You can apply any time during the application window without affecting your child’s chances of receiving funding. Applications Open Feb. 4th! Families will be able to apply for Texas Education Freedom Accounts (TEFA) starting Feb. 4 at 9 a.m. Central Time. Submit your application by 11:59 CT on March 17. This is not a first-come, first-served program. You can apply any time during the application window without affecting your child’s chances of receiving funding. Find Participating TEFA Schools & Education Services Near You Our finder tool lets families quickly locate participating schools and education services in their area. Open the interactive map to start your search. New participants are added regularly! Introducing Texas Education Freedom Accounts In 2025, the Texas Legislature passed Senate Bill 2 and provided $1 billion in funding to create the Texas Education Freedom Accounts (TEFA) program and give parents greater freedom and flexibility in choosing the best educational environment for their children. The TEFA program, administered by the Texas Comptroller of Public Accounts, is expected to be the largest day-one school choice initiative in the nation. Through this program, parents who choose to enroll their children outside of the public school system – including a private school or homeschool – and are accepted into the program can use their child’s TEFA funds to pay for approved education-related expenses through the program marketplace. Helpful Resources Funding The award amounts for the 2026-27 school year will depend on the individual circumstances outlined below. The amount available to a participating child depends on the educational setting they choose. Private School Students A participating child who attends an approved private school or a pre-K or kindergarten program will receive 85% of the estimated statewide average amount of state and local funding per student in average daily attendance for the most recent school year, as calculated by the Texas Education Agency (TEA). TEA has set this amount at $10,474 for the 2026-27 school year. Private School Students with a Disability A participating child with a disability who is enrolled in an approved private school or in a pre-K or kindergarten program may be eligible to receive up to $30,000. To qualify, the child must have an individualized education program (IEP) that is on file with the Texas Education Agency by the end of the application period. The award amount is based on the funding that the child’s local school district would receive to provide services under the child’s IEP. All Other Participating Students A participating child who is homeschooled or is not enrolled in a public school or a pre-K or kindergarten program may be eligible to receive $2,000 annually. Prioritization Eligibility and Participation To be eligible, the parent must provide proof that the child: Is a citizen or national of the United States or lawfully admitted into the United States. Is eligible to attend a public school or open-enrollment charter school or be eligible to enroll in a public or open-enrollment charter school’s pre-K or kindergarten program. Resides in the state of Texas. If accepted into the program, the child will remain eligible to participate until the child graduates from high school, is no longer eligible to attend a Texas public school, charter school, or pre-K or kindergarten program, enrolls in a Texas public or charter school, or moves out of the state of Texas. Approved Expenses Approved education-related expenses include: Educational Services/Materials - Tuition and fees at a private school, higher education provider, online educational course or program, or program that provides training for an industry-based credential approved by the Texas Education Agency. - Textbooks or other instructional materials. - Required uniforms. - Fees for classes provided by school districts that do not qualify the child to be included in school’s average daily attendance. Other Approved Expenses - Academic assessment costs. - Private tutoring. - Transportation to/from approved providers. - Educational therapies not covered by any federal, state, or local government benefits (i.e, Medicaid). - Computer hardware or software (must not exceed 10 percent of the total amount transferred to the child’s account that year). - Meals provided by private school. Funds may not be used to pay a family member. Funds remaining at the end of the school year will roll over as long as the child remains in the TEFA program. Timeline Parent Application The application window runs February 4 – March 17, 2026. Notification of Funding Status Funding notifications will be sent to parents beginning in early April 2026. Private School Confirmation For private school students, parents will indicate the school where their student is enrolled. Private schools will confirm enrollment. Initial Funding July 1, 2026 – At least 25 percent of approved funding will be available in participant accounts. Additional Funding October 1, 2026 – At least 50 percent of approved funding will be available in participant accounts. April 1, 2027 – Remaining funding will be available in participant accounts. Frequently Asked Questions Schools Approved private schools, including approved providers of pre-K and kindergarten programs, may begin applying to participate in the Texas Education Freedom Accounts (TEFA) program on December 9, 2025. After that date, applications will be accepted on a rolling basis. To participate in the TEFA program, private schools must be located in Texas and meet the following eligibility requirements: - Be an accredited school recognized by the Texas Private School Accreditation Commission (TEPSAC) or an accreditor recognized by the Texas Education Agency. - Be a proven operator that has successfully run a campus for at least two years. - Administer a nationally norm-referenced assessment. A provider of a pre-K or kindergarten program must be located in Texas, licensed by, and be in good standing with, the Texas Department of Family and Protective Services, and: - Be accredited by a research-based, nationally recognized, and universally accessible accreditation system approved by the Commissioner of Education; - Be a Texas Rising Star Program provider with a three-star certification or higher; - Be a Texas School Ready! participant; - Have an existing partnership with a school district to provide a pre-k program not provided under Chapter 29, subchapter E-1 of the Texas Education Code; or - Be accredited by an organization that is recognized by the Texas Private School Accreditation Commission. Providers and Vendors TEFA program participants will have access to a range of educational products and services through the TEFA Marketplace. Children will have access to tutors, therapists, and teaching services; courses and programs offered by public schools, charter schools, institutions of higher education, or other instructional providers; and a wide range of instructional materials and technology products."
}