{
  "url": "https://www.san.org/before-you-go-travel-tips/",
  "title": "Travel Tips: Before You Go | San Diego International Airport",
  "text": "Prepare for a smooth journey with essential travel information designed to help you navigate to the airport with ease. The Airport is served by I-5 with connections to State Route 163, I-8 and I-15. Directions InfoAmtrak Intercity and COASTER commuter trains link communities and travelers. View DetailsRide services are available at the airport and catered to suit your needs. View DetailsShuttles available at a convenient time and location based on your needs. Learn MoreHelpful tips for a smooth, stress-free airport experience. Allow at least 2 hours before your flight. Real ID or qualified identification required for security clearance. Acceptable IdentificationExplore local dining and beverage options while experiencing San Diego’s vibrant art scene. Services and FacilitiesFind answers to the most frequently asked questions about San Diego International Airport. If you don’t see your question here—or elsewhere on our website—please reach out to us. We’re always happy to help. Terminal lots are located directly across from the Terminal buildings. The Cruise Ship Terminal is located approximately two miles east of SAN on N. Harbor Drive. Visit our Parking & Transportation pages for transit options. Parking at the airport is managed by SP+ Parking. For questions or assistance, you can reach SP+ Parking anytime, 24/7, at 619.291.2087. Parking lots are regularly patrolled by airport personnel. Curbside parking is never permitted at San Diego International Airport. Curb fronts are reserved for active loading and unloading only, and stopping times should be brief. This policy is in accordance with heightened security measures and is strictly enforced by airport personnel. Unattended vehicles and vehicles in “No Parking” areas will be ticketed and towed. When picking up arriving travelers, be aware that parking lots in front of the terminals is in high demand and can be expected to fill to capacity. Alternatively, those meeting and greeting visitors can park in the airport’s convenient cell phone lot to avoid circling on airport roadways. Parking for travelers with disabilities is available in all lots. Parking spaces for the disabled are available in these lots and the airport provides a wheelchair-accessible complimentary shuttle to the terminals. For additional information, call SP Plus at 619.291.2087. For current rates at our Airport parking lots, visit our Parking Page. Lost tickets will be charged at the maximum daily rate. Ground transportation at SAN can be obtained at the Transportation Plazas located in front of Terminal 1 and Terminal 2. Customer Service Representatives (under the blue umbrella) are located across the street from each respective terminal and are available for assistance. Public mass transit (bus) is also available. For further assistance ask a Volunteer Airport Ambassador located at the Information Desk in the baggage claim area of Terminal 1 or Terminal 2. For more information, visit our Parking & Transportation pages. To check the status of arriving and departing flights to/from SAN click here. To ensure the most accurate and timely information, contact your respective airline directly. For a listing of telephone numbers to airlines serving SAN, visit Flights: Airlines The San Diego County Regional Airport Authority is the owner and operator of the San Diego International Airport (SAN). Each airline operating at SAN is its own business enterprise. For destinations served from SAN, click here. For availability and pricing information, please contact the airlines directly. For telephone numbers of air carriers operating at SAN, click here. As a general rule, it is recommended to allow at least two hours for domestic travel, and three hours for international travel. For more specific guidance, please contact the airline directly. Click on Flights: Airlines. SAN is open 24 hours a day; however, departures only occur without penalty between 6:30 a.m. and 11:30 p.m. Each airline has its own operating hours, but typically ticket counters are staffed by 5:00 a.m. for check-in. For specific check-in information, please contact the airline directly. For a listing of airline telephone numbers, see our Airlines page San Diego International Airport is equipped with an Airline Support Building where belly cargo is processed. If you’ve had any items shipped to you through the airlines listed below, you will need to pick them up at the location specified. Cargo Locations Southwest Airlines Cargo 2995 North Harbor Drive, Suite 110, San Diego, CA 92101 Delta Airlines/Lufthansa Cargo 2955 North Harbor Drive, Suite 130, San Diego, CA 92101 United Airlines/PetSafe Cargo 2955 North Harbor Drive, Suite 120, San Diego, CA 92101 American Airlines/Alaska Airlines/Hawaiian Airlines/Sun Country Airlines Cargo 2995 North Harbor Drive, Suite 140, San Diego, CA 92101 By prior arrangement, unaccompanied minors may be met at the aircraft arrival gate by an airline representative. As another option, you may also contact your respective airline to make arrangements for a Gate Pass. Otherwise, the Information Desks, staffed by Volunteer Airport Ambassadors and located in each of the baggage claim areas of Terminal 1 and Terminal 2, are good locations to meet arriving passengers. For a listing of airline telephone numbers, refer to Flights: Airlines. Thank you for your interest in San Diego International Airport, operated by the San Diego County Regional Airport Authority. The Procurement Department maintains a list of suppliers interested in doing business with the Authority. Vendor registration must be completed for your business to be registered in the Authority’s Vendor Database. Register your business here. The Authority encourages open competition and conducts business in a fair and impartial manner. Contracts can be awarded on the basis of best value using predetermined evaluation criteria and weights. For additional information please call (619) 400-2540. For current rates at our Airport parking lots, visit our Parking Page. Lost tickets will be charged at the maximum daily rate. The Transportation Security Administration (TSA) governs regulations regarding items that may be transported aboard aircraft. For more information, visit our Security & Regulations page Foreign visitors to the United States frequently confuse the California state sales tax with the value-added tax (VAT). The state sales tax is a small tax on purchases or services, calculated at the time of purchase, which individual states assess and which the U.S. federal government neither determines nor receives. The VAT, on the other hand, is a national tax commonly applied in foreign countries that is included in the actual sales price rather than at the time of purchase. The United States does not have a VAT and the federal government cannot refund state sales taxes. State taxes are generally not charged to diplomats or employees of some international organizations who have been issued a tax-exemption card. This card must be presented at the time of purchase in order for sales taxes to be waived. For additional information, please visit the U.S. Customs website. The Federal Inspection Services International Arrival Terminal at SAN can be reached by calling (619) 230-8178. Other offices are available by pressing the appropriate number when prompted: U.S Customs and Border Protection Service U.S. Immigration and Naturalization Service U.S. Department of Agriculture U.S. Fish and Wildlife Service U.S. Public Health Service © 2026 San Diego County Regional Airport Authority. All rights reserved. 2025-06-24 DFW to SAN 3:14 PM Frontier #1425 Arriving at Gate 18"
}