{
  "url": "https://www.thefreedictionary.com/natural",
  "title": "Natural - definition of natural by The Free Dictionary",
  "text": "natural Also found in: Thesaurus, Medical, Legal, Financial, Acronyms, Idioms, Encyclopedia. Related to natural: natural language processing, Natural Disasters nat·u·ral (năch′ər-əl, năch′rəl)adj. 1. Present in or produced by nature: a natural pearl. 2. Of, relating to, or concerning nature: a natural environment. 3. Conforming to the usual or ordinary course of nature: a natural death. 4. a. Not acquired; inherent: Love of power is natural to some people. b. Having a particular character by nature: a natural leader. c. Biology Not produced or changed artificially; not conditioned: natural immunity; a natural reflex. 5. Characterized by spontaneity and freedom from artificiality, affectation, or inhibitions. See Synonyms at naive. 6. Not altered, treated, or disguised: natural coloring; natural produce. 7. Faithfully representing nature or life. 8. Expected and accepted: \"In Willie's mind marriage remained the natural and logical sequence to love\" (Duff Cooper). 9. Established by moral certainty or conviction: natural rights. 10. Being in a state regarded as primitive, uncivilized, or unregenerate. 11. a. Related genetically: the natural parents of the child. b. Born to parents who have never been married to each other: the natural son of the king. 12. Mathematics Of or relating to positive integers, sometimes including zero. 13. Music a. Not sharped or flatted. b. Having no sharps or flats. 14. Relating to hair that is allowed to remain in an unaltered state: \"Many tweets also attacked double standards that exist regarding black women's hair. Wearing extensions and weaves can be seen as traitorous or insecure, while wearing hair in a natural or traditionally African-inspired style ... can result in mocking criticism\" (Mary Emily O'Hara). n. 1. a. One having all the qualifications necessary for success: You are a natural for this job. b. One suited by nature for a certain purpose or function: She is a natural at mathematics. 2. Music a. The sign (♮) placed before a note to cancel a preceding sharp or flat. b. A note so affected. 3. A yellowish gray to pale orange yellow. 4. Games A combination in certain card and dice games that wins immediately. [Middle English, from Old French, from Latin nātūrālis, from nātūra, nature; see nature.] nat′u·ral·ness n. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. natural (ˈnætʃrəl; -tʃərəl)adj 1. of, existing in, or produced by nature: natural science; natural cliffs. 2. in accordance with human nature: it is only natural to want to be liked. 3. as is normal or to be expected; ordinary or logical: the natural course of events. 4. not acquired; innate: a natural gift for sport. 5. being so through innate qualities: a natural leader. 6. not supernatural or strange: natural phenomena. 7. not constrained or affected; genuine or spontaneous 8. (Dyeing) not artificially dyed or coloured: a natural blonde. 9. following or resembling nature or life; lifelike: she looked more natural without her make-up. 10. not affected by man or civilization; uncultivated; wild: in the natural state this animal is not ferocious. 11. being or made from organic material; not synthetic: a natural fibre like cotton. 12. illegitimate; born out of wedlock 13. not adopted but rather related by blood: her natural parents. 14. (Music, other) music a. not sharp or flat b. (postpositive) denoting a note that is neither sharp nor flat: B natural. 15. (Instruments) music of or relating to a trumpet, horn, etc, without valves or keys, on which only notes of the harmonic series of the keynote can be obtained 16. determined by inborn conviction: natural justice; natural rights. 17. (Card Games) cards a. (of a card) not a joker or wild card b. (of a canasta or sequence) containing no wild cards c. (of a bid in bridge) describing genuine values; not conventional 18. (Theology) based on the principles and findings of human reason and what is to be learned of God from nature rather than on revelation: natural religion. n 19. informal a person or thing regarded as certain to qualify for success, selection, etc: the horse was a natural for first place. 20. (Music, other) music a. Also called (US): cancel an accidental cancelling a previous sharp or flat. Usual symbol: ♮ 21. (Card Games) pontoon the combination of an ace with a ten or court card when dealt to a player as his or her first two cards 22. obsolete an imbecile; idiot ˈnaturalness n Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 nat•u•ral (ˈnætʃ ər əl, ˈnætʃ rəl)adj. 1. existing in or formed by nature: a natural bridge. 2. of or pertaining to nature: the natural world. 3. in a state of nature; uncultivated, as land. 4. having undergone little or no processing and containing no chemical additives: natural food. 5. having a physical existence, as opposed to one that is spiritual, intellectual, fictitious, etc. 6. belonging to the nature or essential constitution; inborn: natural ability. 7. being such because of one's inborn nature or abilities: a natural mathematician. 8. free from affectation or constraint: a natural manner. 9. in accordance with the nature of things; to be expected: a natural result. 10. in accordance with human nature. 11. based upon the innate moral feeling of humankind: natural justice. 12. happening in the usual course of things, without the intervention of accident, violence, etc.: a natural death. 13. illegitimate: a natural son. 14. related by blood rather than by adoption: one's natural parents. 15. based on what is learned from nature rather than on revelation: natural religion. 16. true to or closely imitating nature: a natural representation. 17. unenlightened or unregenerate: natural man. 18. Music. a. neither sharp nor flat. b. changed in pitch by the natural sign. 19. not treated, refined, etc.; in its original state: natural wood. 20. not tinted or colored; undyed. 21. having a pale tannish or grayish yellow color. n. 22. one that is or is likely to be suitable to or successful in an endeavor. 23. a. a white key on a piano, organ, or the like. b. the symbol ♮, placed before a note, canceling the effect of a previous sharp or flat. c. a note affected by the natural sign, or a tone thus represented. 24. a fool or idiot. 25. (in craps) a winning combination of 7 or 11 made on the first cast. 26. a natural substance or product. 27. an Afro hairstyle. nat′u•ral•ness, n. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. natural adjective 1. logical, normal, reasonable, valid, legitimate A period of depression is a natural response to bereavement. 2. normal, common, stock, standard, established, regular, usual, ordinary, typical, routine, everyday, accustomed, customary, commonplace, habitual, run-of-the-mill, unexceptional It's just not natural behaviour for a child of his age. normal strange, abnormal, irregular, out of the ordinary, untypical normal strange, abnormal, irregular, out of the ordinary, untypical 3. innate, native, characteristic, indigenous, inherent, instinctive, intuitive, congenital, inborn, immanent, in your blood, hard-wired, essential He has a natural flair for business. 4. unaffected, open, frank, genuine, spontaneous, candid, unpretentious, unsophisticated, dinkum (Austral & N.Z. informal), artless, ingenuous, real, simple, unstudied Jan's sister was as natural and friendly as the rest of the family. unaffected affected, assumed, artificial, unnatural, counterfeit, feigned, phoney or phony (informal), false unaffected affected, assumed, artificial, unnatural, counterfeit, feigned, phoney or phony (informal), false 5. pure, real, plain, raw, organic, crude, wholesome, whole, unrefined, unbleached, unprocessed, unpolished, unmixed, chemical-free, additive-free, pesticide-free He prefers to use high quality natural produce. pure processed, manufactured, synthetic, unnatural, false pure processed, manufactured, synthetic, unnatural, false Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 natural adjective1. Produced by nature; not artificial or manmade: Idiom: pure as the driven snow. 2. In a primitive state; not domesticated or cultivated; produced by nature: 3. Forming an essential element, as arising from the basic structure of an individual: 4. Devoid of any hypocrisy or pretense: 5. Free from guile, cunning, or deceit: 6. Unconstrained by rigid standards or ceremony: Informal: laid-back. 8. Accurately representing what is depicted or described: 9. Born to parents who are not married to each other: The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations شَخْص طيِّب بِطَبيعَتِهطَبيعيطَبيعي، عاديطَبيعي، فِطْري، مَولود مَعهطَبِيعِيٌّ přirozenýpřírodnívrozenýbez předznamenáníčlověk s přirozeným talentem medfødtnaturlignaturtalent natura luonnollinenluonnonmukainenluonnonvärinenluontainennormaali prirodan elõjegyzés nélkülinaturalistatermészetestermészeti eîlilegurmaîur meî meîfædda hæfileikameîfæddurnáttúrulegur, náttúru-óbreyttur tónn 当然の 자연의 bekarasgamtinės dujosgamtininkasgamtos ištekliaigamtos mokslai bekarsdabas-dabisksiedzimtsnemākslots bez predznamenaniaodrážkarodený majster naraven naturlig ธรรมชาติ tự nhiên natural [ˈnætʃrəl]A. ADJ 1. (= occurring naturally) [environment, substance, disaster, remedy] → natural she isn't a natural blonde → no es rubia natural he died of natural causes → murió de muerte natural the rest of his natural life → el resto de sus días see also die 1 she isn't a natural blonde → no es rubia natural he died of natural causes → murió de muerte natural the rest of his natural life → el resto de sus días see also die 1 2. (= understandable) [reaction, behaviour, feeling] → natural, normal; [mistake] → comprensible; [explanation] → lógico y natural it's a perfectly natural mistake to make → es un error totalmente comprensible there is a perfectly natural explanation → hay una explicación perfectamente lógica y natural it's only natural → es normal or natural it's only natural that she should be upset → es normal or natural que esté disgustada it's a perfectly natural mistake to make → es un error totalmente comprensible there is a perfectly natural explanation → hay una explicación perfectamente lógica y natural it's only natural → es normal or natural it's only natural that she should be upset → es normal or natural que esté disgustada 3. (= inborn) [ability, talent] → innato; [reaction, fear] → instintivo he had a natural flair for business → tenía un don innato para los negocios she is a natural leader/athlete → es una líder/atleta innata natural instinct → instinto m natural he had a natural flair for business → tenía un don innato para los negocios she is a natural leader/athlete → es una líder/atleta innata natural instinct → instinto m natural 4. (= relaxed, unforced) [person, manner, charm] → natural I was able to be very natural with him → con él pude ser yo mismo I was able to be very natural with him → con él pude ser yo mismo 5. (= biological) [father, mother, child] → biológico 6. (Mus) → natural B. N 1. (= person) she's a natural with computers → tiene un don innato para los ordenadores C. CPD natural childbirth N → parto m natural natural gas N → gas m natural natural history N → historia f natural natural law N → ley f natural natural number N (Math) → número m natural natural philosophy N → filosofía f natural natural resources NPL → recursos mpl naturales natural science N (uncount) → ciencias fpl naturales; (count) → ciencia f de la naturaleza natural selection N → selección f natural by natural selection → por selección natural natural wastage N (Brit) (Ind) bajas voluntarias de los empleados de una empresa, y cuyos puestos quedan sin cubrir the jobs will be lost through natural wastage → los puestos irán desapareciendo a medida que se produzcan bajas voluntarias natural gas N → gas m natural natural history N → historia f natural natural law N → ley f natural natural number N (Math) → número m natural natural philosophy N → filosofía f natural natural resources NPL → recursos mpl naturales natural science N (uncount) → ciencias fpl naturales; (count) → ciencia f de la naturaleza natural selection N → selección f natural by natural selection → por selección natural natural wastage N (Brit) (Ind) bajas voluntarias de los empleados de una empresa, y cuyos puestos quedan sin cubrir the jobs will be lost through natural wastage → los puestos irán desapareciendo a medida que se produzcan bajas voluntarias Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 natural [ˈnætʃərəl] adj [instinct, behaviour] → naturel(le) the insect's natural instinct to feed → l'instinct naturel des insectes qui les pousse à s'alimenter BUT l'instinct de nutrition des insectes. the insect's natural instinct to feed → l'instinct naturel des insectes qui les pousse à s'alimenter BUT l'instinct de nutrition des insectes. (= not man-made) [material] → naturel(le); [food] → naturel(le); [wonder] → naturel(le) natural causes, natural disaster (= normal) → naturel(le) it is natural to do sth It's natural to worry about one's children → C'est naturel de se faire du souci pour ses enfants. It is natural for us to want excitement → C'est naturel pour nous de rechercher les sensations fortes. It's the most natural thing in the world → C'est la chose la plus naturelle du monde. it is natural to do sth It's natural to worry about one's children → C'est naturel de se faire du souci pour ses enfants. It is natural for us to want excitement → C'est naturel pour nous de rechercher les sensations fortes. It's the most natural thing in the world → C'est la chose la plus naturelle du monde. (= reasonable) → naturel(le) to be only natural → être bien naturel She's upset, which is only natural → Elle est bouleversée, ce qui est bien naturel. to be only natural → être bien naturel She's upset, which is only natural → Elle est bouleversée, ce qui est bien naturel. [person, manner] → naturel(le) She's always so relaxed and natural → Elle est toujours si détendue et naturelle. She's always so relaxed and natural → Elle est toujours si détendue et naturelle. [musician, athlete] → né(e) Martin is a natural musician → Martin est un musicien né. He's a natural basketball player → C'est un basketteur né. Martin is a natural musician → Martin est un musicien né. He's a natural basketball player → C'est un basketteur né. [talent, aptitude] → naturel(le), inné(e) to have a natural flair for sth → avoir un sens inné de qch He had a natural flair for business → Il avait un sens inné des affaires. to have a natural aptitude for sth → avoir une aptitude naturelle pour qch Only a few people have a natural aptitude for maths → Seules quelques personnes ont une aptitude naturelle pour les maths. She has a natural talent for playing the piano → Elle a un talent naturel pour le piano. to have a natural flair for sth → avoir un sens inné de qch He had a natural flair for business → Il avait un sens inné des affaires. to have a natural aptitude for sth → avoir une aptitude naturelle pour qch Only a few people have a natural aptitude for maths → Seules quelques personnes ont une aptitude naturelle pour les maths. She has a natural talent for playing the piano → Elle a un talent naturel pour le piano. (by birth) [mother, father, sister, brother] → naturel(le) (MUSIC) B natural (= key) → si m naturel in B natural → en si naturelnatural causes npl to die of natural causes → mourir de mort naturellenatural childbirth n → accouchement m naturelnatural disaster n → catastrophe f naturelle a natural disaster like an earthquake → une catastrophe naturelle comme un tremblement de terrenatural gas n → gaz m naturelnatural history n → histoire f naturelle in B natural → en si naturelnatural causes npl to die of natural causes → mourir de mort naturellenatural childbirth n → accouchement m naturelnatural disaster n → catastrophe f naturelle a natural disaster like an earthquake → une catastrophe naturelle comme un tremblement de terrenatural gas n → gaz m naturelnatural history n → histoire f naturelle Collins English/French Electronic Resource. © HarperCollins Publishers 2005 natural adj → natürlich, Natur-; rights → naturgegeben; (= understandable) mistake → verständlich; natural phenomenon → Naturphänomen nt; it is (only) natural for you/him to think … → es ist nur natürlich, dass Sie denken/er denkt …; natural resources → Naturschätze pl; the natural world → die Natur; in its natural state → im Naturzustand; to die a natural death or of natural causes → eines natürlichen Todes sterben; death from natural causes (Jur) → Tod durch natürliche Ursachen; to be imprisoned for the rest of one’s natural life (Jur) → eine lebenslängliche Gefängnisstrafe verbüßen; a natural son of Utah → in Utah geboren (= chemical-free) food, hair colour → natürlich; natural cosmetics → Naturkosmetik f; natural remedy → Naturheilmittel nt; she is a natural blonde → sie ist von Natur aus blond, blond ist ihre natürliche Haarfarbe (= inborn) gift, ability, quality → angeboren; to have a natural talent for something → eine natürliche Begabung für etw haben; he is a natural artist/comedian → er ist der geborene Künstler/Komiker; it is natural for birds to fly → Vögel können von Natur aus fliegen; something comes natural to somebody → etw fällt jdm leicht (= unaffected) manner → natürlich, ungekünstelt; person, charm → natürlich; there was something not quite natural about her way of speaking → ihre Sprechweise hatte etwas Gekünsteltes (Math) number → natürlich n (Mus) (= symbol) → Auflösungszeichen nt; (= note) → Note f → ohne Vorzeichen; (= note with a natural symbol) → Note f → mit Auflösungszeichen; B natural → H, h; D natural → D, d; you played F sharp instead of F natural → Sie haben fis statt f gespielt ? also major, minor (inf: = person) → Naturtalent nt; he’s a natural for this part → diese Rolle ist ihm wie auf den Leib geschrieben (inf: = life) → Leben nt; I’ve never heard the like in all my natural → ich habe so was mein Lebtag noch nicht gehört (inf) (old: = idiot) → Einfaltspinsel m natural :natural-born natural childbirth natural disaster n → Naturkatastrophe f natural food n → naturbelassene Lebensmittel pl natural forces pl → Naturgewalten pl natural gas n → Erdgas nt natural history n → Naturkunde f; (concerning evolution) → Naturgeschichte f natural :natural justice n → Naturrecht nt natural landscape n → Naturlandschaft f natural laws pl → Naturgesetze pl natural :natural philosopher n → Naturphilosoph(in) m(f) natural philosophy n → Naturwissenschaft f, → Naturlehre f (old) natural science natural selection n → natürliche Auslese natural sign n (Mus) → Auflösungszeichen nt natural wastage n → natürliche Personalreduzierung; to make job cuts through natural → Personal durch natürliche Fluktuation abbauen natural wonder n → Naturwunder nt Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 natural [ˈnætʃr/əl]1. adj (gen) → naturale; (ability) → innato/a; (manner) → semplice death from natural causes (Law) → morte f per cause naturali he died a natural death → è morto di morte naturale in its natural state → allo stato naturale he never knew his natural parents → non ha mai conosciuto i suoi veri genitori it's natural to be tired after a long journey → è naturale essere stanchi dopo un lungo viaggio it seemed the natural thing to do → è sembrata la cosa più ovvia or più naturale da farsi it is natural that ... → è naturale che... + sub he's a natural painter → è un pittore nato C natural (Mus) → do naturale death from natural causes (Law) → morte f per cause naturali he died a natural death → è morto di morte naturale in its natural state → allo stato naturale he never knew his natural parents → non ha mai conosciuto i suoi veri genitori it's natural to be tired after a long journey → è naturale essere stanchi dopo un lungo viaggio it seemed the natural thing to do → è sembrata la cosa più ovvia or più naturale da farsi it is natural that ... → è naturale che... + sub he's a natural painter → è un pittore nato C natural (Mus) → do naturale Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995 natural (ˈnӕtʃərəl) adjective1. of or produced by nature, not made by men. Coal, oil etc are natural resources; Wild animals are happier in their natural state than in a zoo. 2. born in a person. natural beauty; He had a natural ability for music. 3. (of manner) simple, without pretence. a nice, natural smile. 4. normal; as one would expect. It's quite natural for a boy of his age to be interested in girls. 5. of a musical note, not sharp or flat. G natural is lower in pitch than G sharp. noun1. a person who is naturally good at something. 2. in music (a sign ( ) indicating) a note which is not to be played sharp or flat. ˈnaturalist noun a person who studies animal and plant life. ˈnaturally adverb1. of course; as one would expect. Naturally I didn't want to risk missing the train. 2. by nature; as a natural characteristic. She is naturally kind. 3. normally; in a relaxed way. Although he was nervous, he behaved quite naturally. natural gas gas suitable for burning, found underground or under the sea. natural history the study of plants and animals. natural resources sources of energy, wealth etc which occur naturally and are not made by man, eg coal, oil, forests etc. Kernerman English Multilingual Dictionary © 2006-2013 K Dictionaries Ltd. natural → طَبِيعِيٌّ přirozený naturlig natürlich φυσικός natural luonnollinen naturel prirodan naturale 当然の 자연의 natuurlijk naturlig naturalny natural естественный naturlig ธรรมชาติ doğal tự nhiên 自然的Multilingual Translator © HarperCollins Publishers 2009 natural a. natural; sencillo-a; ___ childbirth → parto ___; -lyadv. naturalmente. English-Spanish Medical Dictionary © Farlex 2012 natural adj naturalEnglish-Spanish/Spanish-English Medical Dictionary Copyright © 2006 by The McGraw-Hill Companies, Inc. All rights reserved."
}