{
  "url": "https://en.m.wikipedia.org/wiki/Love_Is_Blind_(franchise)",
  "title": "Love Is Blind (franchise) - Wikipedia",
  "text": "Love Is Blind (franchise) Love Is Blind is a reality television franchise on Netflix created by Chris Coelen.[1] It originated in the United States and has been reproduced in eleven countries around the world including Japan, Sweden and the United Kingdom. The show claims to be an experiment that tests whether love is blind, and if people can fall in love based on personality, rather than appearance. Contestants talk to each other in private pods for 10 days, and can only see each other after they've gotten engaged in the pods. After that period, they spend time together, including with friends and family, and decide whether to get married. Of the 120 couples formed across the different spin-offs of this show, 48 have said 'I do' at the altar. As of August 2025,[update] 27 of these couples are still together. This gives the show and its engaged matches a 40% success rate with respect to getting married and a 58% chance of staying together after that. Format [edit]The series follows an equal number of men and women hoping to find love. For 10 days, the men and women date each other in purpose-built \"pods\", small rooms where they can talk to each other by speaker but not see each other, except through a blue translucent barrier that allows no visual detail.[2][3] The cast members are initially paired in a speed-dating format, but later can choose to have longer dates.[4] The daters may extend a marriage proposal whenever they feel ready.[a] A couple meets face-to-face only after a marriage proposal is accepted. The engaged couples then head to a couples' retreat at a resort for one week.[5] During this trip, they spend time getting to know each other and have their first opportunity to be physically intimate. They also meet the other couples participating in the experiment.[6][7] This format of choosing among suitors without being able to see them has been compared to The Dating Game.[8][9][10] After the couples' retreat, the engaged couples move together into an apartment complex where they live for the final three weeks of the experiment.[5] At the apartments, they meet their partners' friends and families and learn more about their partners' lives, exploring issues such as finances, recreation, personal habits, and their ultimate primary residence. They also plan weddings to be held at the end of four weeks. During this wedding planning period, the women go wedding dress shopping and the men go suit shopping together, bringing a few friends or family members along. They also make choices such as the design and flavor of their wedding cake. At the altar, each participant decides whether to say \"I do\" and get legally married. Each season also has a reunion special released after the final episode. International versions [edit]The format created in United States has been adapted in several countries. Notes [edit]- ^ The men receive instructions to propose to the women, but Giannina and Damian proposed to each other in the first season.[citation needed] References [edit]- ^ Kinane, Ruth (February 14, 2020). \"Love Is Blind creator on what they didn't show — including even more proposals\". Entertainment Weekly. Retrieved February 16, 2020. - ^ Walsh, Charlotte (February 9, 2024). \"No, There Aren't Any Bathrooms in the Love Is Blind Pods\". Netflix. Archived from the original on February 12, 2022. Retrieved October 4, 2024. - ^ Allen, Kelly (October 2, 2024). \"11 Shocking Facts About the Love Is Blind Pods\". House Beautiful. Archived from the original on October 4, 2024. Retrieved October 4, 2024. - ^ \"All Your Questions About the 'Love Is Blind' Pods Answered\". Netflix. Archived from the original on February 12, 2022. Retrieved February 28, 2022. - ^ a b Chilton, Charlotte (September 28, 2023). \"Rules 'Love Is Blind' Cast Has To Follow\". Women's Health. Retrieved January 16, 2024. - ^ Rosenblatt, Kalhan (February 28, 2020). \"Netflix's 'Love Is Blind' brings the reality dating show into 2020\". NBC News. Retrieved February 17, 2021. - ^ Woerner, Meredith (February 15, 2020). \"How Netflix's New Reality Series 'Love Is Blind' Works\". Variety. Retrieved February 17, 2021. - ^ Jacobs, Julia; Stevens, Matt (April 15, 2023). \"Inside the Pods With 'Love Is Blind,' the Reality TV Juggernaut\". New York Times. Retrieved March 25, 2024. - ^ Perry, Whitney (March 4, 2022). \"All the 'Love Is Blind' Couples Who Are Still Together…and the Ones Who Aren't\". Glamour. Condé Nast. Retrieved March 25, 2024. - ^ Patterson, Troy. \"Love Is Blind\". The New Yorker. Retrieved March 25, 2024. - 2020 American television series debuts - 2020s American reality television series - American dating and relationship reality television series - American English-language television shows - Netflix original programming - Television series about marriage - Wedding television shows - Dating and relationship reality television series - Love Is Blind television series"
}