{
  "url": "https://support.google.com/maps/answer/3092445?hl=es&co=GENIE.Platform=Desktop",
  "title": "Buscar ubicaciones en Google Maps - Ordenador - Ayuda de Google Maps",
  "text": "Puedes buscar sitios y ubicaciones en Google Maps. Si inicias sesión en Google Maps, obtendrás resultados de búsqueda más detallados. Puedes encontrar rápidamente los sitios que ya hayas buscado y buscar contactos por el nombre. Buscar un sitio en Google Maps - Abre Google Maps en el ordenador. - Escribe una dirección o el nombre de un sitio. - Pulsa Intro o haz clic en Buscar . - Para filtrar los resultados de búsqueda, utiliza los menús desplegables situados debajo del cuadro de búsqueda. Ver todo el mapa Para ver todo el mapa y ocultar el panel lateral, haz clic en la flecha situada a la derecha del panel. Buscar una categoría de sitios en Google Maps - En tu ordenador, abre Google Maps. - Escribe lo que quieras en el cuadro de búsqueda (por ejemplo, restaurantes ).- Debajo del cuadro de búsqueda pueden aparecer resultados de búsqueda personalizados. - Elige un sitio para verlo en el mapa y obtener más información sobre él. En el ordenador: - Haz clic en el cuadro de búsqueda. - Coloca el cursor sobre una sugerencia de búsqueda. - Haz clic en Eliminar . En Android: - Toca el cuadro de búsqueda. - Mantén pulsada la sugerencia de búsqueda. - Toca Eliminar. En iPhone y iPad: - Toca el cuadro de búsqueda. - Desliza la sugerencia de búsqueda hacia la izquierda o hacia la derecha. Consejo: Gestiona todos tus datos y tu actividad desde Mi Actividad. Notas: - En los resultados de búsqueda se incluyen los sitios que has buscado anteriormente. Si has iniciado sesión, pero no ves ningún resultado de búsqueda personalizado, activa el ajuste Actividad en la Web y en Aplicaciones. - En la parte superior de la pantalla, usa los botones de categoría para ver las sugerencias de búsqueda. - Para ofrecer las mejores opciones, los botones de categoría cambian en función del medio de transporte. Por ejemplo, mientras conduces se te muestran opciones como \"Gasolineras\", \"Estaciones de recarga de VE\" y \"Hoteles\". Filtrar los resultados de búsqueda en Google Maps - Abre Google Maps en el ordenador. - Busca un tipo de empresa, restaurante o sitio. - Elige un filtro: - Precio: búsqueda basada en el coste del restaurante. - Horario: muestra los sitios que están abiertos en este momento. - Información del hotel: consulta fechas de entrada y su valoración por estrellas. Compartir los resultados de búsqueda en Google Maps - En tu ordenador, abre Google Maps. - Busca un tipo de sitio, como un restaurante , unatienda o unagasolinera . - En la parte superior de la lista de resultados, haz clic en Compartir . - Tienes las siguientes opciones: - Copiar el enlace. - Compartirlo a través de WhatsApp, X o Gmail. - Insertar un mapa. Consultar búsquedas recientes En la pestaña \"Recientes\", puedes consultar, guardar y compartir las búsquedas recientes. Para consultar las búsquedas recientes, sigue estos pasos: - En tu ordenador, ve a Google Maps. - En la parte izquierda, haz clic en Recientes . - Nota: En la parte superior de la pestaña \"Recientes\", Maps agrupa las búsquedas por ubicación geográfica. Para guardar búsquedas recientes en listas, sigue estos pasos: - En la parte izquierda, haz clic en Recientes . - Selecciona las búsquedas que quieras guardar. - En la parte inferior, haz clic en Guardar . - Para guardarlas en una lista que ya tengas, haz clic en ella. - Para guardarlas en una lista nueva, haz clic en Nueva lista. Para compartir búsquedas recientes, sigue estos pasos: - En la parte izquierda, haz clic en Recientes . - Selecciona las búsquedas que quieras compartir. - Para copiar las búsquedas en el portapapeles de tu ordenador, en la parte inferior, haz clic en Compartir . - Puedes pegar las búsquedas en un correo o en un documento. Notas: - Para inhabilitar la barra lateral, en la parte superior izquierda, haz clic en Menú y desactiva la opción Mostrar barra lateral. - Para eliminar una búsqueda reciente, coloca el cursor sobre la imagen y haz clic en Eliminar . Consejos para hacer búsquedas en Google Maps Estos son algunos ejemplos: - Empresas específicas: Starbucks . - Tipos de lugares: cafetería cerca de Central Park . - Búsquedas acotadas con una ciudad y su estado o provincia: tienda de alimentación en Alcorcón, Madrid . - Búsquedas acotadas con un código postal: gasolinera en 28008 . - Búsquedas por intersección: Gran Vía con Hortaleza, Madrid . - Dirección, ciudad, estado, país o aeropuerto: Torre Picasso, Plaza Pablo Ruiz Picasso, 1, 28020, Madrid, Aeropuerto de Madrid o Everest, Nepal . - Coordenadas de latitud y longitud: 41.40338, 2.17403 . - Amigos y otros contactos (debe haberse iniciado sesión): Pedro Ruiz . - Otros nombres de personas de tus Contactos de G Suite. Obtener tu código postal o más información sobre un sitio Para obtener más información sobre un sitio, realiza una de estas acciones: - Selecciona una minichincheta en el mapa. - Coloca una chincheta en el mapa. - Busca un sitio específico. Puedes obtener información sobre el sitio, como la dirección, el código postal, el horario de apertura, el número de teléfono, el sitio web y las valoraciones o reseñas. Nota: Para buscar la página web de un sitio, guardar un sitio o compartirlo y buscar indicaciones, puedes usar la función 3D Touch en iPhone 6s y modelos posteriores. Para activar esta función, ve a la aplicación Ajustes General Accesibilidad 3D Touch. A continuación, abre Google Maps y pulsa con fuerza un sitio. Cómo se muestran los resultados locales en Google Maps Sitios generales en el mapa Cuando los usuarios realizan búsquedas de empresas y sitios cercanos a su ubicación, se muestran resultados locales. Aparecen en varios sitios en Maps y en la Búsqueda. Por ejemplo, verás resultados locales si buscas \"restaurante italiano\" en tu dispositivo móvil. Google te muestra restaurantes cercanos que pueden interesarte. Varios factores, principalmente la relevancia, la distancia y la prominencia, influyen en los resultados locales. La combinación de estos factores permite encontrar los mejores resultados para las búsquedas. Por ejemplo, si lo que buscas es probable que esté en una empresa que está más lejos de ti, los algoritmos de Google podrían decidir clasificarlo mejor en los resultados locales. Más información sobre los resultados de búsquedas locales en GoogleNota: Los pagos de otras empresas no influyen en los resultados de Google Maps. El contenido de pago de Google Maps está etiquetado como tal. Sitios importantes para ti Puedes hacer búsquedas personalizadas en Google Maps. Estos son algunos ejemplos de fuentes de donde puede proceder esta información: Google Maps Los sitios personalizados que ves pueden proceder de: - Tus interacciones con sitios en el mapa, incluidos los mapas de Google que usas en otros sitios web - Tus búsquedas recientes, incluidas las búsquedas de indicaciones - Sitios que has guardado o marcado como favoritos en tu ordenador, teléfono o tablet - Sitios que tú o las personas de tus círculos habéis valorado o sobre los cuales habéis escrito reseñas - Las direcciones de tu casa y de tu trabajo, si las has configurado en Google Maps o en Mi tablón Otros productos de Google Los sitios personalizados que ves pueden proceder de: - Mapas personalizados, si tienes alguno en My Maps - Personas y sitios añadidos por ti a Contactos de Google, como Pizzeria Delfina Si no quieres ver sugerencias de búsqueda en Google Maps, actualiza tus preferencias en el resto de los productos de Google."
}