{
  "url": "https://strategywiki.org/wiki/The_7th_Saga",
  "title": "The 7th Saga — StrategyWiki | Strategy guide and game reference wiki",
  "text": "Elnard was developed and originally released in Japan, and later localized as The 7th Saga. It is a turn-based RPG for the Super Nintendo Entertainment System in the vein of the Dragon Quest series. Although developed and released in Japan, the original title of Elnard is in romaji (Roman alphabet) on both the title screen and the box. The Japanese transilteration エルナード was added on the box as a reading aid for the Japanese players. - U.S. box art. Story[edit | edit source] The player chooses one of seven playable characters, all of whom separately embark on a quest to locate seven magical runes. As the player progresses through the game from one town to the next, they will encounter the other six characters on multiple occasions. The player may partner with one of the other playable characters to fight as a team, and they may also fight against other playable characters for the runes. Gameplay[edit | edit source] The gameplay emphasizes dungeon exploration and combat due to the difficulty of the game. However, there is an abundance of worldbuilding: for example, elements of realistic international economy play an important role in the development of the story. Also, the game shows a rare example of time travel that can occur without the need for time paradoxes. Still, there are almost no scripted sequences or cutscenes, and most of the story is conveyed through simple \"sign post\" conversations with townspeople. The American version of the game has been criticized for poor translation, but this does not play a noticeable role on gameplay. Notable unique innovations include the use of a crystal ball \"radar\" that allows players to see enemies approaching their character in dungeons and in the overworld. This means that combat is not totally random, as players may theoretically avoid enemies, although enemies move extremely quickly and randomly, making combat difficult to avoid. The game also uses Mode 7 graphic effects to create the transition between exploration screen and battle screen. The game is particularly known for its unforgiving difficulty, largely due to the American release reducing the amount of attribute points the player character gains upon leveling up. These gains are not reduced for the player character's rivals, whose levels are based on the player character's, leading to practically unwinnable fights."
}