{
  "url": "https://www.for9a.com/learn/كيف-اكتب-رسالة-التغطية-Cover-Letter",
  "title": "كيف اكتب رسالة التغطية | Cover Letter",
  "text": "تُعرّف رسالة التغطية Cover Letter على أنها خطاب يُرسل في العادة مرفقًا مع السيرة الذاتية عند التقديم لوظيفة معيّنة وتُسمّى أحيانًا \"خطاب التقديم للوظيفة\". وهي تختلف بعض الشيء عن رسالة الدافع \"Motivation Letter\" التي تستخدم في العادة عند التقديم للفرص غير المدفوعة مثل التطوّع لدى المنظمات غير الربحية أو حين التقدّم للحصول على منحة دراسية على سبيل المثال. تعتبر عمليّة كتابة رسالة التغطية وتخصيصها لتلائم وظيفة معيّنة واحدة من أصعب التحديات أثناء عملية البحث عن عمل، والتقديم له. لذا أعدّت لكم منصّة تعلّم اليوم مقالاً شاملاً يتضمّن جميع الخطوات التي يتوجّب عليكم اتباعها لكتابة رسالة تغطية مهنية تضمن لكم الحصول على الوظيفة التي قدّمتم إليها، بالإضافة إلى عدّة نماذج يمكنكم تحميلها من هنا على أجهزتكم والتعديل عليها لتتناسب مع مهاراتكم والفرص التي تقدّمون لها. سنجيب في مقال اليوم عن أهمّ الأسئلة المتعلقة برسالة التغطية وتشمل: - ماهو الهدف من رسالة التغطية؟ - ماذا يجب أن أكتب في رسالة التغطية؟ - كيف أكتب رسالة تغطية مميزة من المقدّمة وحتى الخاتمة؟ - ما هو طول رسالة التغطية؟ ما هو الهدف من رسالة التغطية؟ الهدف من الأساسي من رسالة التغطية هو التعريف بمقدم الطلب وبيان السبب وراء تقدّمه لهذه الوظيفة بالذات. وبالتالي فالسيرة الذاتية لابدّ أن تكون دومًا مرفقة برسالة تغطية تدعمها وتوضّح بشكل أفضل الخبرات والإنجازات السابقة التي تمّ ذكرها في السيرة الذاتية والتي تجعل من مقدّم الطلب المرشّح الأفضل لهذه الوظيفة. تذكّر دومًا أنّه من المهم أن تخصّص لكلّ وظيفة تقدّم لها رسالة تغطية مناسبة توضّح فيها كيف ستسهم خبراتك السابقة في حلّ المشكلات الحالية لهذه الشركة أو المؤسسة بالذات التي قدّمت لها. ماذا يجب أن أكتب في رسالة التغطية؟ عند كتابة رسالة التغطية، لابدّ من الالتزام بأجزائها الأساسية المتعارف عليها، والتي تتضمّن مايلي: - الاسم والمعلومات الشخصية. - اسم الشركة/ المؤسسة التي تقدّم لها مع عنوانها. - تاريخ إنشاء الرسالة. - الجملة الافتتاحية والتي تبدأ بـ السيد/ ة المحترم/ة (أو ذكر اسم القسم من الشركة الذي تتقدّم للعمل فيه). - محتوى الرسالة، وسنتحدّث عنه بالتفصيل لاحقًا في هذا المقال. - الجملة الختامية: \"وتقبلوا فائق الاحترام\" أو باللغة الإنجليزية: \"Sincerely\"، وسنتحدّث عنها بتفصيل أكثر لاحقًا في المقال. - الاسم والتوقيع. كيف أكتب رسالة تغطية مميزة من المقدّمة وحتى الخاتمة؟ تذكّر دومًا أنّ رسالة التغطية تهدف إلى إضافة قيمة لسيرتك ذاتية، ممّا يعني أنّ نسخ إنجازاتك التي كتبتها في السيرة الذاتية ووضعها في رسالة التغطية ليس بالتأكيد الطريقة المثلى لكتابة هذه الرسالة، بل عليك من خلالها أن تضيف مزيدًا من التوضيح عن مهاراتك وخبراتك المذكورة في السيرة الذاتية. على سبيل المثال يمكنك أن تذكر مهارات الـ \"SEO\" في السيرة الذاتية وتشرح عنها بشكل أكثر تفصيلاً في رسالة التغطية. لنتعرّف إذن على كيفية كتابة رسالة التغطية من البداية وحتى الخاتمة! 1- كيف أكتب الجملة الافتتاحية في رسالة التغطية؟ هناك عدد من القواعد التي يتعيّن عليك أخذها بعين الاعتبار عند كتابة الجملة الافتتاحية في رسالة التغطية وهي كالتالي: - احرص على كتابة اسم المدير المسؤول عن التوظيف كاملاً مسبوقًا بلقبه المناسب: \".Mr\" أو \".Ms\"، على سبيل المثال: Mr. John Doe أو Ms. Jane Doe - في حال كنت مطّلعًا على ثقافة الشركة وعلى دراية بأنّ جوّها العام ليس رسميًا للغاية، فيمكنك في هذه الحالة ألاّ تكتب جملة افتتاحية رسمية. - في حال لم يتمّ ذكر اسم الشخص المسؤول عن التوظيف في إعلان الوظيفة، حاول أن تبحث عنه على موقع الشركة الرسمي، نظرًا لأن رسالتك يجب أن تكون موجّهة لشخص بعينه. - إذا لم تعثر سوى على أسماء المؤسسين والمدراء التنفيذيين للشركة على الموقع الرسمي لها، قم بتوجيه الخطاب للمدير المسؤول عن القسم الذي تقدّمت بطلبك الوظيفي إليه. هذه الخطوة ستظهر أنّك قد بذلت جهدك للعثور على الشخص المسؤول عن التوظيف في هذا الشاغر. - أمّا إذا لم تتمكّن من العثور على اسم أيّ شخص في الشركة (وهذا ممكن الحدوث في بعض الشركات التي تحرص على الحفاظ على سريّة موظفيها)، فحاول على الأقل أن تكتب جملة افتتاحية دقيقة قدر الإمكان تظهر من خلالها أنّك توجّه رسالتك إلى شخص أو مجموعة أشخاص معيّنين، على سبيل المثال: - \"Nurse Hiring Manager\" - \"Hiring Responsible\" - \"HR Department\" 2- كيف أكتب المقدمة في رسالة التغطية؟ من المهمّ أن تذكر في في مقدّمة رسالة التغطية أهمّ المهارات التي تملكها والتي تمّ ذكرها في إعلان التوظيف، لتظهر أنّك المرشح الأفضل لهذا الشاغر، حيث أن ذكر هذه المعلومات سيزوّد قارئ الرسالة بفكرة عامة عمّا سيأتي لاحقًا. في بعض الأحيان، قد يكون من المهمّ أن تذكر المصدر الذي سمعت منه عن هذه الوظيفة، وخاصّة في حال سمعت عنها من موظّف آخر في الشركة. ولا تنسَ أن تكتب بأسلوب لغوي قريب من أسلوب الشركة لتعطي انطباعًا بأنّك على اطّلاع بثقافة الشركة. وفيما يلي عدّة أمثلة للمقدمة في رسالة التغطية: مثال 1: مثال 2: مثال 3: 3- كيف أكتب محتوى رسالة التغطية؟ يضمّ المحتوى الأساسي لرسالة التغطية فقرة أو اثنتين، تظهر فيهما اهتمامك الصادق بهذه الوظيفة، وتشرح من خلالها كيف تتوافق خبراتك وتجاربك السابقة مع متطلّبات الوظيفة، ويمكنك هنا عرض أهم إنجازاتك السابقة في شكل نقاط كما هو موضّح الأمثلة التالية: مثال 1: مثال 2: هذا بالنسبة للفقرة الأولى، أما عن محتوى الفقرة الثانية، فيمكنك هنا أن تبيّن لقارئ الرسالة مدى اهتمامك بالحصول على هذه الوظيفة بالذات، وليس أيّ وظيفة أخرى، حاول أن تُشعر صاحب العمل بأنك ستستمع بالعمل معهم وبأن وظيفتك هذه ستروي شغفك. يمكنك فعل ذلك باتباع الخطوات الثلاث التالية: - ابدأ بالحديث عن مشروع مستقبلي للشركة أو المؤسسة التي تتقدّم للعمل فيها، أو مشروع قائم حاليًا. - وضّح سبب اهتمامك بهذا المشروع. - بيّن أن خبرتك ومهاراتك ستضمن نجاح هذا المشروع. ألقِ نظرة على نموذج للفقرة الثانية من رسالة التغطية، لشخص تقدّم لوظيفة \"مدير تسويق رقمي\": 4- كيف أكتب الخاتمة في رسالة التغطية؟ تتضمن الخاتمة في رسالة التغطية ثلاثة أهداف رئيسية: - إظهار الامتنان لقارئ الرسالة وشكره على وقته. - إظهار الاهتمام مرّة أخرى بالوظيفة. - الدعوة لاتخاذ إجراء معيّن. من المهمّ أن تنهي رسالة التغطية بفقرة مثيرة للاهتمام ومقنعة تترك لدى قارئ الرسالة انطباعًا بأنّك الشخص المناسب لهذه الوظيفة. ابتعد عن الجمل التي تظهر مدى رغبتك في الحصول على الوظيفة، وبدلاً من ذلك ركّز على القيمة والخدمات التي يمكنك أنت أن تقدّمها للشركة في حال حصلت على فرصة العمل هذه. مثال 1: مثال 2: ممتاز لم يتبقَ سوى الجملة الختامية في رسالة التغطية، وكونها خطابًا رسميًا، فيجب أن تختتمها بجملة رسمية أيضًا، إليك فيما يلي قائمة بأهم العبارات الرسمية التي يمكنك استخدامها: تجنّب استخدام عبارات أقلّ مهنية مثل: حتى تتأكّد من أن رسالتك جاهزة تمامًا، اطلّع على هذه القائمة بأهم الأمور التي عليك فعلها وتلك التي يجدر بك تجنّبها أثناء كتابة رسالة التغطية. ما يجب فعله: - كتابة الاسم الكامل، المسمّى الوظيفي، ومعلومات الاتصال. - جعل محتوى رسالة التغطية وشكلها العام متناسقًا مع السيرة الذاتية. - كتابة أهمّ المهارات والإنجازات التي تمّ تحقيقها. - إدراج جميع الأقسام الأساسية لرسالة التغطية: الجملة الافتتاحية، المقدّمة، المحتوى الرئيسي، والخاتمة. - التوازن في استخدام المسافات حيث لا يجب أن تكون كبيرة جدًا أو صغيرة جدًا. - الالتزام بطول الرسالة وهو صفحة واحدة كحدّ أقصى. - تدقيق الرسالة للتأكد من خلوّها من الأخطاء النحوية واللغوية. - التميز في كتابة الرسالة حيث يجب تخصيص رسالة لتتناسب مع الوظيفة التي تمّ التقديم لها. - ضرورة بيان السبب الذي يجعل المتقدّم المرشّح الأمثل لهذه الوظيفة. ما لا يجب فعله: - استخدام رسالة تغطية واحدة لكافة طلبات التقديم في مختلف الشركات. - الغموض واستخدام عبارات مثل: \"لمن يهمّه الأمر To whom it may concern\"، \"اسمي هو My name is\"، \"أكتب لكم لأعبر عن اهتمامي بـ... I am writing to express my interest\" ...الخ. - تكرار المعلومات الموجودة في السيرة الذاتية بدلاً من الحديث عنها بشكلّ مفصّل أكثر. - استخدام بريد إلكتروني غير رسمي، حيث يجب أن يضمّ بريدك الإلكتروني اسمك الكامل أو جزءًا منه. - كتابة رسالة طويلة تزيد عن صفحة واحدة. - إرفاق الصور والجداول والإنفوجرافيك في رسالة التغطية. نصائح أخيرة 1- اجعل رسالتك مختصرة وشاملة احرص دومًا على ألاّ تكتب قصّة حياتك في رسالة التغطية، فصاحب العمل سيقرأ المئات من السير الذاتية ورسائل التغطية ممّا يعني أنّ الرسائل الطويلة المليئة بالتكرار و التراكيب الركيكة والحشو الذي بلا معنى، لن تثير اهتمامه وسيستبعد كاتبها بمجرّد قراءة الأسطر الأولى. 2- كن متفرّدًا دائمًا وأبدًا وفي أيّ رسالة رسمية سواءً كانت رسالة تغطية، رسالة الدافع أو طلب تقديم وظيفي أو طلب تقديم لمنحة دراسية، اسعَ دومًا لأن تكون متميّزًا ومختلفًا. لا ضير من الاستعانة بالنماذج الجاهزة، لكن حاول في كلّ مرّة أن تضفي أمرًا خاصًّا بك وحدك، أظهر شخصيتك، اهتماماتك، شغفك في كلّ رسالة تكتبها ولا تعطِ مجالاً لقارئ الرسالة لأن يشعر بالملل. 3- استخدم لغة مهنية ابتعد عن اللغة العامية، أو الكلمات والتراكيب غير المهنية، فمن المهمّ أن يشعر صاحب العمل الذي يقرأ رسالتك بأنك تملك خبرة كافية تظهر حتى على أسلوبك في الكتابة، وهو أمر يعكس مهاراتك في المراسلات الرسمية. 4- دقّق رسالتك تبقى هذه النصيحة أهمّ نقطة دائمًا ولابدّ من تكرارها والتركيز عليها، نظرًا لأن الكثيرين يتجاهلونها أو ينسون مدى أهميتها وأثرها عند تقييم رسالة التغطية الخاصة بهم. اقرأ رسالتك دومًا بعد الانتهاء منها، تأكّد من سلامة اللغة وخلوّ النص من الأخطاء بأشكالها (نحوية، إملائية، لغوية...الخ)، واطلب من أحد معارفك أو أصدقائك أن يلقي نظرة أخيرة عليها قبل إرسالها. اقرأ المزيد: خمسة اسباب تحول بينك وبين الحصول على وظيفة اقرأ أيضًا: كل ما عليك معرفته عند كتابة السيرة الذاتية اقرأ أيضًا: كل ما تريد أن تعرفه عن المقابلات الوظيفية المراجع: novoresume"
}