{
  "url": "https://starwalk.space/en/news/mars-the-ultimate-guide",
  "title": "Mars Facts | What Does Mars Look Like | All About Mars | Mars Pictures",
  "text": "Explore the Red Planet: All the Must-Know Facts About Mars The red planet Mars has been known to humans since ancient times. It has been the target of dozens of space missions and will hopefully soon become the first planet astronauts will land on. In this article, we’ll tell you everything you need to know about Mars and answer the most common questions related to the Red Planet. We'll also highlight upcoming celestial events related to Mars. Use the Sky Tonight app to easily locate the Red Planet in the sky. Let’s get started! Contents - Mars Facts - How big is Mars? - Mars orbital period and rotation period - How far away is Mars? - Missions to Mars - What is Mars made of? - How many moons does Mars have? - What does Mars look like? - When and where is Mars visible in 2026? - Upcoming Events - F.A.Q. - Planet Mars: to sum up Mars Facts - Planet type: terrestrial - Radius: 3,396 km - Mass: 6.417 × 10^23 kg - Aphelion: 249.2 million km (154.9 million miles) - Perihelion: 206.6 million km (128.4 million miles) - Average distance from the Earth: 225 million km (140 million miles) - Surface temperature: −143 °C to 35 °C (-226 °F to 95 °F) - Solar day length: 24 h 39 m 35 s - Sidereal day length: 24 h 37 m 22 s - Year length: 686.98 Earth days - Age: 4.503 billion years - Named after: Roman god of war 5 fun facts about Mars - Mars can boast the largest volcano in the entire Solar System – Olympus Mons. With a height of 21 km, it stands about 2.5 times taller than Mount Everest. - Mars’ larger moon, Phobos, gradually gets closer to the planet at a rate of about 2 cm per year. In 50 million years, Phobos will either crash into Mars or disintegrate to form a ring around the Red Planet. - Billions of years ago, Mars looked very similar to the Earth. Large portions of the planet’s surface were covered with liquid water, and there may have been primitive life forms in the oceans. However, eventually, the Red Planet lost most of its atmosphere and dried up. - During the late 19th and early 20th centuries, many astronomers observed a network of canals on the Martian surface. Some believed them to be irrigation canals constructed by an alien civilization. However, it turned out to be an optical illusion. - Humanity is considering colonizing Mars. Elon Musk, the founder of SpaceX, has long stated his vision of building a self-sustaining city on Mars. NASA is also working on a mission to send people to Mars: the agency plans to first establish human presence on the Moon by the early 2030s and then land astronauts on Mars in the 2040s. Hopefully, these plans will come to reality one day! In the meantime, you can brush up on your knowledge of Mars with a quiz. How big is Mars? Mars is the second smallest planet in the Solar System – only Mercury is smaller. Let’s measure this planet and compare it to the Earth. Mars size Mars has a diameter of 6,792 km (4,220 miles); the planet’s circumference around the equator is 21,326 km (13,300 miles). Thus, if you’re moving at a speed of about 100 km per hour (62 miles per hour), it will take you about nine days to travel around the planet's equator. Is Mars bigger than the Earth? No, it’s not. The diameter of Mars is only about half of the Earth’s diameter, which is 12,742 km (7,917 miles). Also, Mars is only about two times bigger than our Moon, which is 3,474 km (2,158 miles) in diameter. Mars orbital period and rotation period Every planet in the Solar System has its own orbital period (that determines the length of year) and rotation period (that determines the length of a day-night cycle). Let’s take a look at how fast Mars revolves around the Sun and spins on its axis. How long is a year on Mars? As Mars is located farther away from the Sun than the Earth, it takes longer for the Red Planet to complete one orbit around the Sun. A year on Mars lasts for about 687 Earth days, which equals 1.88 Earth years. How long is a day on Mars? Mars rotates on its axis at almost the same speed as the Earth. For this reason, daily cycles on these two planets are quite similar. One Martian day (called a sol) lasts 24 hours 39 minutes, which is only 39 minutes longer than a day on the Earth. Does Mars have seasons? As you probably know, seasons are caused by the tilt of a planet’s axis of rotation. Mars’ axial tilt is very similar to the Earth’s: the Red Planet is tilted at 25.2°, while the Earth's axial tilt is about 23.5°. For this reason, Mars has four distinct seasons: spring, summer, fall, and winter. However, each season on Mars lasts about two times longer than on the Earth. That’s because it takes almost two Earth years for Mars to travel around the Sun once. How far away is Mars? Mars is the fourth planet from the Sun and one of the Earth’s two closest neighbors (the other one being Venus). How far is Mars from the Sun? Due to the high eccentricity of the Red Planet’s orbit, there’s a significant difference between Mars’ closest and farthest points from the Sun, which equal 206.6 million km (128.4 million miles) and 249.2 million km (154.9 million miles), respectively. On average, Mars is positioned 228 million km (142 million miles) away from our star, which equals 1.5 astronomical units. How far is Mars from the Earth? The distance between Mars and our planet is constantly changing. The farthest distance between Mars and the Earth equals 401 million km (249 million miles). The closest distance the two planets can get to each other is 54.6 million km (33.9 million miles). However, such a close approach never happened in recorded history. The closest approach between Mars and the Earth in almost 60,000 years occurred in 2003 when the two celestial bodies were 55.7 million km (34.6 million miles) away from each other. How long does it take to get to Mars? The duration of a trip to Mars depends on when it is taken. The best time to launch a spaceship to Mars is about three months before the Red Planet gets closest to the Earth. Such a moment happens about every two years, around Mars’ opposition. According to NASA, an average trip to Mars takes about nine months. The two fastest trips to Mars were taken by Mariner 6 (five months) and Mariner 7 (four months). However, these two spacecraft performed flybys of Mars and so didn’t need to slow down as orbiters, landers, and rovers do. The latest rover to land on Mars – Perseverance – reached the planet in about seven months. Missions to Mars As the Earth’s close neighbor, Mars has been the destination of numerous space missions. Since 1960, about 50 missions have been sent to the Red Planet, though only about half of them have been successful. Let’s take a look at the most significant ones. NASA’s Mariner 9 entered Mars’ orbit in 1971, becoming the first spacecraft to orbit another planet. Mariner 9 mapped 85% of the Martian surface and sent more than 7,000 images back to the Earth. The first human-made object to reach the Martian surface was the Soviet Union’s Mars 2, launched the same year as Mariner 9. Unfortunately, the speed at which Mars 2 approached the planet was too high; as a result, the descent system malfunctioned, and the spacecraft crashed into the Red Planet’s surface. The first spacecraft to successfully land on Mars was NASA’s Viking 1. This spacecraft operated on the planet from 1976 to 1982 and sent back more than 57,000 images. NASA’s Sojourner, which arrived on Mars in 1997 as part of the Pathfinder mission, became the first rover to operate on another planet. The Sojourner rover operated for 83 sols, making scientific measurements and taking pictures. NASA’s twin rovers Spirit and Opportunity reached the Red Planet in 2004. The rovers were tasked with studying the planet’s climatic history and looking for evidence of past water activity. Originally, the mission was planned to last 90 days. However, both rovers exceeded their planned mission lifetimes by many years: Spirit operated until 2010, and Opportunity stopped working only in 2018. In 2012, NASA’s rover Curiosity arrived at the Gale crater on Mars. The rover investigated the Martian climate and geology and found out that the planet once had conditions favorable for microbial life. Curiosity has been active on Mars for more than three thousand sols; as of 2021, the rover is still operational. In 2021, China successfully landed its first spacecraft on Mars as part of the Tianwen-1 mission. The rover named Zhurong became the first spacecraft not launched by NASA to operate on Mars. Also in 2021, NASA’s Perseverance rover landed on the Red Planet. Apart from the rover, a helicopter called Ingenuity also takes part in the mission. On April 19, 2021, Ingenuity performed the first-ever powered, controlled flight on another planet. What is Mars made of? Like the other three terrestrial planets (Mercury, Venus, and the Earth), Mars is a rocky celestial body. Let’s take a closer look at the planet’s physical peculiarities. How was Mars formed? Mars formed together with the other Solar System planets. About 4.5 billion years ago, a giant cloud of interstellar gas and dust collapsed under its own gravity and flattened into a protoplanetary disk. Mars and the other rocky planets formed in the inner part of this disk, while the gas giants settled in the outer regions of the young Solar System. Mars structure Mars has a central core, a mantle, and a crust. The Red Planet’s core is made of iron, nickel, and sulfur. It is surrounded by a rocky mantle and a crust made of iron, magnesium, aluminum, calcium, and potassium. Mars atmosphere The atmosphere of Mars is much thinner than the Earth’s. It is composed primarily of carbon dioxide (95%), while our planet’s atmosphere is rich in nitrogen and oxygen. Thus, humans would not be able to breathe on Mars. However, in April 2021, NASA’s rover Perseverance successfully converted a small portion of the Martian atmosphere into oxygen. In the future, this technology might be able to provide astronauts with breathable air. How many moons does Mars have? Mars has two moons: Phobos and Deimos. Both of them were discovered by American astronomer Asaph Hall in 1877. The moons of Mars are among the smallest moons in the Solar System: for reference, the Earth's Moon has a diameter more than 100 times greater than that of Phobos, the larger Martian moon. Like our Moon, Phobos and Deimos are tidally locked to their planet and always show only one side to it. What does Mars look like? Mars surface Mars' surface is primarily composed of basalt. The prevalence of iron oxide in the Martian soil gives the planet its distinct red color. The Red Planet has many surface features similar to our planet: valleys, deserts, mountains, and polar ice caps. There are even former river deltas that suggest that Mars was a watery planet in the past. What does Mars look like when observed from Earth? - When observed with the naked eye, Mars looks like a small, bright, reddish-orange dot. The planet doesn’t appear large enough to show any surface details. It looks similar to a bright star, though it stands out thanks to its color and steady light, as planets don’t twinkle as much as stars do. - Through binoculars, you will see Mars as a disk, though it's still small. It won't show much detail, but the disk shape becomes more apparent rather than looking like just a point of light. - In a telescope, Mars looks like a large disk. Depending on the size and magnification of the telescope, you can get a much more detailed view of the planet. Surface features like polar ice caps, dark markings, and even atmospheric activity can become visible. When and where is Mars visible in 2026? Since around October 2025, Mars has been getting increasingly closer to the Sun in the sky. So early 2026 isn’t great for viewing: Mars sits deep in the Sun’s glare and is nearly impossible to observe. After the solar conjunction in early January, Mars will slowly move away from the Sun, first appearing in the morning sky and later becoming visible in the evenings around February. Throughout the year, Mars will move across the background constellations from Sagittarius toward Leo. The planet will start to look better in a telescope in September 2026, as its apparent size increases. The best viewing will be in December 2026, when it becomes brighter and easier to see. The real prime time will come in February 2027, when Mars reaches opposition and appears even bigger and brighter. Upcoming Events February 16, 2026: Moon near Mars - Conjunction time: 17:41 GMT (12:41 ET) - Conjunction distance: 0°45' - Close approach time: 18:17 GMT (13:17 ET) - Close approach distance: 0°42' On February 16, the 1% illuminated Moon will be close to Mars (mag 1.1) in the sky. They will be positioned in the constellation Capricornus. Both objects will be too close to the Sun to be observable. As visible from Antarctica, the Moon even covers Mars, creating a lunar occultation of the planet. April 18, 2026: Mars in a small planetary alignment Before sunrise on April 18, skywatchers will get a chance to see a small planetary meet-up as Mars, Saturn, Mercury, and Neptune appear clustered in the same part of the morning sky. Saturn and Mercury will be the easiest to spot, while Mars remains relatively faint, and Neptune requires a telescope. Still, the group forms an attractive arrangement and offers a rare chance to catch four planets in one view. Learn more about the upcoming planetary alignments in our dedicated article. August 12, 2026: Mars in a large planetary alignment Before sunrise on August 12, six planets — Jupiter, Mercury, Mars, Uranus, Saturn, and Neptune — will line up across the sky in a wide morning alignment. Saturn and Neptune rise around midnight, Uranus follows a bit later, and Mars appears about an hour after that. Just before dawn, Jupiter and Mercury join in to complete the scene. The bright planets — Jupiter, Mars, Mercury, and Saturn — will be easy to spot with the naked eye, while Uranus and Neptune will require binoculars or a small telescope. Learn more about the upcoming planetary alignments in our dedicated article. November 14, 2026: Mars in a small planetary alignment Before dawn on November 14, a small planetary alignment will unfold in the morning sky. Mars and Jupiter rise first, about two hours after midnight. Venus and Mercury join them closer to sunrise, around three hours later, gathering the planets into a loose but attractive grouping low in the east. By this time of year, Mars will be noticeably brighter than it has been recently, making it easy to spot among the morning planets. Learn more about the upcoming planetary alignments in our dedicated article. February 19, 2027: Mars at opposition On February 19, 2027, Mars will reach opposition. Opposition is the moment when a planet lies directly opposite the Sun in the sky as seen from Earth — meaning it rises at sunset, stays up all night, and sets at sunrise. This is usually the best time to observe a planet, since it appears brighter and larger than at any other point in its cycle. During this opposition, Mars will shine at about –1.2 magnitude and show an apparent diameter of 13.8 arcseconds. It will be visible all night in the constellation Leo, offering excellent conditions for the naked-eye, binocular, and telescopic viewing. Oppositions of Mars don’t happen every year — the next one will occur on March 25, 2029, so seize your chance to see the Red Planet this year! We also have an article about oppositions of other planets and Solar System bodies, so feel free to explore more. F.A.Q. Is there water on Mars? Yes, there is water on Mars. Various missions and studies have confirmed the presence of water ice at the polar ice caps. Recent discoveries have also suggested that a large liquid water reservoir might exist below the planet’s surface. Additionally, there is evidence of liquid water in the past, with signs of ancient riverbeds, lake beds, and minerals that only form in the presence of water. In the search for extraterrestrial life, scientists pay special attention to worlds where water is present in one form or another, including Mars. Why is this the case, are other conditions for the origin of life possible, and where is humanity on its journey to find extraterrestrial life? Find out in our comprehensive infographic on life in the Universe. What is the gravity on Mars? The gravity on Mars is 62% lower than on the Earth. This means that a person who weighs 80 kg (176 lbs) on our planet would weigh only 30 kg (66 lbs) on Mars. Although it would be much easier for humans to walk on Mars, such low gravity can have other not-so-pleasant effects on hypothetical Mars colonists – like causing muscle deterioration and osteoporosis. What color is Mars? The predominant color of the Martian surface is red. It is explained by the prevalence of iron oxide – more commonly known as rust – in the planet’s soil. Other colors on Mars include golden, brown, and tan. What is the temperature on Mars? Overall, Mars is a very cold place. The average temperature on the Red Planet equals -62 °C (-81°F). However, according to Michael Mischna, a research scientist at NASA’s Jet Propulsion Laboratory, the air temperature on Mars wouldn’t feel the same as on the Earth. There’s little water vapor and few air molecules on Mars, so -70 °C (-100 °F) would feel like -34 °C (-30 °F). To better understand temperature conditions on Mars, check this infographic made by NASA. How many rovers are on Mars? As of 2026, there are two currently operating rovers on the Red Planet: Curiosity and Perseverance, both owned by NASA. Planet Mars: to sum up Mars is the fourth planet from the Sun and the seventh largest planet in the Solar System. With evidence suggesting that it once had flowing water, Mars holds many secrets waiting to be uncovered. As you gaze up at the night sky, don’t forget that this planet is not just a distant dot; it’s a world rich with history and potential. Download Sky Tonight to track Mars' position in the sky and be updated on all the astronomical events involving the Red Planet. Also, you’re welcome to watch our educational cartoon with fun facts about Mars. We wish you clear skies and happy observations! Explore the other Solar System planets We hope you enjoyed the article about Mars! You can also check out our articles about the other planets in the Solar System: - Mercury – the smallest and fastest planet; - Venus – the Earth’s evil twin; - Jupiter – the biggest planet; - Saturn – the “Lord of the Rings” (and moons!); - Uranus – the coldest planet; - Neptune – the farthest planet; - and Pluto, which was famously demoted from planet status (and the decision remains a hot topic in the astronomical community for almost 20 years). Learn more space facts Want to learn more facts about space? Then you'll love our quiz about the “most-est” objects in the Solar System! Find out which of them is the hottest or fastest, and where the tallest mountain and deepest canyon are located."
}