{
  "url": "https://www.scrippsnews.com/politics/immigration/dhs-pulling-700-immigration-enforcement-agents-from-minnesota-amid-tensions",
  "title": "DHS pulling 700 immigration enforcement agents from Minnesota amid tensions",
  "text": "Tom Homan, the Trump administration’s “border czar” now overseeing immigration enforcement in Minnesota, said Wednesday that 700 officers would be \"drawn down\" from the area, one week after announcing that immigration enforcement agents would be more targeted. It is unclear where those 700 agents will go. Although Homan says operations will be more targeted, anyone in the U.S. illegally will remain subject to deportation. \"I want to be clear, just because you prioritize public safety doesn't mean we forget about everybody else. We will continue to enforce the immigration laws in this country,\" he said. RELATED STORY | Minnesota prosecutor presses DOJ for all federal evidence in Renee Good's death Officials previously said there were nearly 3,000 agents in the Twin Cities region involved in immigration enforcement. Even with an estimated 2,300 agents, Immigration and Customs Enforcement, along with Customs and Border Patrol, will keep a significant force in the Twin Cities region. As Operation Metro Surge has included the detainment of a 5-year-old son of a man seeking asylum, several Minnesota school districts filed a lawsuit to block immigration enforcement near schools in the state. “Students can’t learn, and educators can’t teach, when there are armed, masked federal agents stationed within view of classroom windows, sometimes for days on end,” said Monica Byron, the president of Education Minnesota labor union. “ICE and Border Patrol need to stay away from our schools so students can go there safely each day to learn without fear, and so that our members can focus on teaching instead of constantly reacting to the shocking and unconstitutional actions of federal agents.” Minnesota Attorney General Keith Ellison called the drawdown a \"step in the right direction.\" \"Minnesota is still enduring the largest such surge in the history of our nation. It has left two Minnesotans dead. Countless more of our neighbors have been unlawfully detained, assaulted, harassed, and intimidated,\" he said. RELATED STORY | Haitian TPS holder leaves US family behind to avoid deportation limbo Homan took charge of immigration enforcement operations in Minnesota days after Customs and Border Patrol commander Greg Bovino was reassigned following the fatal shooting of Alex Pretti on Jan. 24. Pretti, a 37-year-old ICU nurse, was killed during an immigration enforcement operation in Minneapolis — the second fatal shooting involving federal agents in the city last month."
}