{
  "url": "https://pt.famousbirthdays.com/people/taylor-swift.html",
  "title": "Taylor Swift Idade, Vida Pessoal, Biografia | Famous Birthdays",
  "text": "Taylor Swift Aniversário Dezembro 13, 1989 Signo Sagitário Local de Nascimento West Reading, PA Idade 36 anos de idade #26 Mais Popular Sobre Cantora e compositora que aos 18 anos se tornou a artista solo mais nova a escrever e gravar uma música que atingiu o topo da parada country americana, com o single \"Our Song\". Ela lançou o seu quarto álbum country, \"Red\", em 2012, e o seu primeiro álbum pop, \"1989\", saiu no ano de 2014. Em 2017, o disco \"Reputation\" vendeu mais de 1 milhão de cópias em quatro dias. Desde então, ela fez outros diversos lançamentos, incluindo regravações de trabalhos antigos. Antes da Fama Ela foi criada em uma família presbiteriana e cavalgava nos cavalos e nos pôneis da família quando era criança. Ela começou a participar de peças de teatro musical aos nove anos e se mudou para Nashville aos 14. Durante alguns anos, morou dentro de uma fazenda de árvores de Natal. Trívia Ela ganhou muitos Grammy Awards, incluindo Álbum do Ano, em 2010, por \"Fearless\". Em 2023, seu patrimônio ultrapassou 1 bilhão de dólares. Ela foi eleita a Pessoa do Ano pela revista Time em 2023. Vida Pessoal Ela é filha de Scott e Andrea Swift e foi criada junto com o irmão Austin Swift. Ela tem três gatos: Meredith, Olivia e Benjamin. Ela já namorou várias celebridades, como Joe Jonas em 2008, Taylor Lautner e John Mayer em 2009, Jake Gyllenhaal em 2010, Conor Kennedy e Harry Styles em 2012 e Calvin Harris entre 2015 e 2016. Também namorou com o ator Tom Hiddleston por três meses em 2016 e com Joe Alwyn de 2016 até março de 2023. Teve um breve relacionamento com Matty Healy em 2023. Depois, iniciou um romance com o astro da NFL Travis Kelce e foi vista torcendo por ele no estádio em setembro de 2023. Em agosto de 2025, o casal anunciou o noivado. Ligações Ela teve um papel de destaque no filme Idas e Vindas do Amor, junto com Jessica Alba."
}