{
  "url": "https://www.google.com/intl/en_uk/chrome/",
  "title": "Google Chrome – Download the fast, secure browser from Google",
  "text": "- Prioritise performance Chrome is built for performance. Optimise your experience with features like Energy Saver and Memory Saver. - Stay on top of tabs Chrome has tools to help you manage the tabs you’re not quite ready to close. Group, label, and colour-code your tabs to stay organised and work faster. - Optimised for your device Chrome is built to work with your device across platforms. That means a smooth experience on whatever you're working with. - Automatic updates There’s a new Chrome update every four weeks, making it easy to have the newest features and a faster, safer browser. - Prioritise performance Chrome is built for performance. Optimise your experience with features like Energy Saver and Memory Saver. - Stay on top of tabs Chrome has tools to help you manage the tabs you’re not quite ready to close. Group, label, and colour-code your tabs to stay organised and work faster. - Optimised for your device Chrome is built to work with your device across platforms. That means a smooth experience on whatever you're working with. - Automatic updates There’s a new Chrome update every four weeks, making it easy to have the newest features and a faster, safer browser. - PASSWORD MANAGER Use strong passwords on every site. Chrome has Google Password Manager built in, which makes it simple to save, manage and protect your passwords online. It also helps you create stronger passwords for every account you use. - ENHANCED SAFE BROWSING Browse with the confidence that you're staying safer online. Chrome's Safe Browsing warns you about malware or phishing attacks. Turn on Enhanced Safe Browsing for even more safety protections. - SAFETY CHECK Check your safety level in real time with just one click. Chrome's Safety Check confirms the overall security and privacy of your browsing experience, including your saved passwords, extensions and settings. If something needs attention, Chrome will help you fix it. - PRIVACY GUIDE Keep your privacy under your control with easy-to-use settings. Chrome makes it easy to understand exactly what you’re sharing online and who you’re sharing it with. Simply use the Privacy Guide, a step-by-step tour of your privacy settings. Customise your Chrome Personalise your web browser with themes, dark mode and other options built just for you. Browse across devices Sign in to Chrome on any device to access your bookmarks, saved passwords and more. Save time with autofill Use Chrome to save addresses, passwords and more to quickly autofill your details. Customise your Chrome Personalise your web browser with themes, dark mode and other options built just for you. Browse across devices Sign in to Chrome on any device to access your bookmarks, saved passwords and more. Save time with autofill Use Chrome to save addresses, passwords and more to quickly autofill your details. Extend your experience From shopping and entertainment to productivity, find extensions to improve your experience in the Chrome Web Store. - Google AI Access AI superpowers while you browse. Google is integrating artificial intelligence to make our products more useful. We use AI for features like Search, Google Translate and more, and we’re innovating new technologies responsibly. - GOOGLE SEARCH The search bar that you love, built right in. Access a world of knowledge at your fingertips. Check the weather, solve maths equations and get instant search results, all contained inside your browser's address bar. - GOOGLE WORKSPACE Get things done, with or without Wi-Fi. Get things done in Gmail, Google Docs, Google Slides, Google Sheets, Google Translate and Google Drive, even without an Internet connection."
}