{
  "url": "https://www.tasteofhome.com/recipes/martini/",
  "title": "Martini Recipe: How to Make It",
  "text": "When making a cocktail as naked as a martini, every move counts. Here is how to make a martini recipe like a true bartender. A classic martini recipe makes one of the most popular and sophisticated cocktails. It sounds simple enough to make: shake up some ice, vodka or gin and vermouth; stir; strain; pop on an olive. But for a truly divine martini, the devil is in the details. Do martinis use gin or vodka? Either! Though gin is the traditional choice, vodka martinis are incredibly common. Since these spirits are all but naked in this James Bond signature, quality counts. At the liquor store, bypass the bottom-shelf varieties altogether and opt for a name-brand option. If you’re not an experienced mixologist, take a look at our vodka buying guide and gin buying guide for expert suggestions. What’s the best type of vermouth for a martini? That depends on if you’re making your martini with vodka or gin. Vodka martinis benefit from a vermouth with a bit of flair, so consider those with a stronger floral or citrus profile. Save the more subtle dry vermouth for gin martinis. That said, if there’s a particular vermouth you enjoy, go ahead and use it. It’s your martini, after all! What type of ice should I use in my martini? You might think it’s just ice, but believe it or not, ice is a crucial martini ingredient. Working behind the scenes, ice gets the martini nice and cold, but is absent from the final product. The goal here is to get the drink as cold as possible, but without watering it down. Avoid shaved and crushed ice varieties, as the small pieces will easily melt away into those warming spirits we know and love. Instead, opt for a cracked cube, big enough to hold its own but with more surface area for chilling than simple blocks from the tray. Martini Ingredients - Gin or vodka - 1/2 ounce dry vermouth - Ice cubes - Pimiento-stuffed olives Directions Step 1: Add ingredients and ice Add the spirit of your choice and the dry vermouth in a cocktail mixing glass. Then, fill the mixing glass three-fourths of the way with ice. Editor’s Note: For this martini, we went with a 6:1 ratio, but adjust that ratio to your tastebuds. Step 2: Stir the martini Keeping a bar spoon along the wall of the mixing glass, stir the martini for 30 seconds, or until some condensation has formed. This will mix and chill the ingredients without watering the cocktail down too much. Editor’s Note: Still want it shaken, not stirred? Add your spirit and vermouth to a cocktail shaker, rather than a cocktail mixer, along with plenty of ice. Then, shake the martini for about 30 seconds, or until condensation forms, and strain into a glass. Some bits of shattered ice may end up in your final product. Step 3: Strain the martini Place the strainer over the mixing glass and carefully pour the martini into a glass. You can use a traditional martini glass, or go old-school and use a coupe glass. Step 4: Garnish the martini Finally, of course, is the garnish. Drop in one, two or three green olives. You can go with pimiento-stuffed, garlic- stuffed or bleu cheese-stuffed olives. That’s not your only option though. Adding a slice of lemon peel gives your cocktail a bit of brightness. Or, you can top the martini with a pickled pearl onion, which would turn your martini into a Gibson. Martini Variations Once you know the basics behind a martini, you can get creative with fun flavors like a chocolate martini, lemon martini, coffee martini and much more. Take a look at more ways on how to customize your martini. Cheers! Martini Recipe Tips How much vermouth should I use in a martini recipe? The supporting role in the martini is vermouth, a wine-based spirit fortified with aromatic herbs like juniper, nutmeg, orange peel and coriander. This fortified spirit is also what gives the martini a few of its monikers: dry, set and extra wet refer to the amount of vermouth in the equation. Dry has the least vermouth (about a 6:1 vodka-to-vermouth ratio), wet has a 3:1 ratio and extra wet is equal parts vermouth and gin or vodka. But the options don’t stop there. In some people’s eyes, a more dynamic cocktail is a perfect martini: That means the martini contains equal parts dry and sweet vermouth, in addition to spirit. A martini without vermouth is simply straight gin or vodka with a garnish. You can order a martini with as little vermouth as possible, but it’ll still be in there, and it’s great no matter how much (or how little) you like. Remember, a dry martini still has a tiny bit of vermouth. How long does vermouth last? Once opened, vermouth keeps for only about three months in the refrigerator. Unless you’re shaking up dozens of drinks, choose a smaller bottle. What’s a dirty martini? A dirty martini is a standard martini that contains a bit of olive juice or brine. To make one, add a splash of olive juice or brine to the mixing glass before stirring the martini. Olive juice and brine are rather pungent, so add a little at a time. Some bartenders skip the vermouth when making a dirty martini. It’s up to you if you’d like to replace the vermouth with olive juice or not. Ingredients - Ice cubes - 3 ounces gin or vodka - 1/2 ounce dry vermouth - Pimiento-stuffed olives Directions - Fill a shaker three-fourths full with ice. Add gin and vermouth; cover and shake until condensation forms on outside of shaker. Strain into a chilled cocktail glass. Garnish with olives."
}