{
  "url": "https://www.britannica.com/topic/Jew-people",
  "title": "Jew | History, Beliefs, & Facts | Britannica",
  "text": "Jew News • Jew, any person whose religion is Judaism. In the broader sense of the term, a Jew is any person belonging to the worldwide group that constitutes, through descent or conversion, a continuation of the ancient Jewish people, who were themselves descendants of the Hebrews of the Bible (Old Testament). In ancient times, a Yĕhūdhī was originally a member of Judah—i.e., either of the tribe of Judah (one of the 12 tribes that took possession of the Promised Land) or of the subsequent Kingdom of Judah (in contrast to the rival Kingdom of Israel to the north). The Jewish people as a whole, initially called Hebrews (ʿIvrim), were known as Israelites (Yisreʾelim) from the time of their entrance into the Holy Land to the end of the Babylonian Exile (538 bce). Thereafter, the term Yĕhūdhī (Latin: Judaeus; French: Juif; German: Jude; and English: Jew) was used to signify all adherents of Judaism, because the survivors of the Exile (former inhabitants of the Kingdom of Judah) were the only Israelites who had retained their distinctive identity. (The 10 tribes of the northern kingdom of Israel had been dispersed after the Assyrian conquest of 721 bce and were gradually assimilated by other peoples.) The term Jew is thus derived through the Latin Judaeus and the Greek Ioudaios from the Hebrew Yĕhūdhī. The latter term is an adjective occurring only in the later parts of the Hebrew Bible and signifying a descendant of Yehudhah (Judah), the fourth son of Jacob, whose tribe, together with that of his half brother Benjamin, constituted the Kingdom of Judah. In the modern world, a definition of Jew that would be satisfactory to all is virtually impossible to construct, for it involves ethnic and religious issues that are both complex and controversial. In daily life, for example, those who consider themselves Jews are generally accepted as such by Jews and non-Jews alike, even though such persons may not observe religious practices. While all Jews agree that a child born of a Jewish mother is Jewish, Reform Judaism goes beyond Orthodox and Conservative Judaism in affirming that a child is Jewish if either one of the parents is a Jew. From a purely religious standpoint, Gentile converts to Judaism are accepted as Jewish in the fullest sense of the word. Under Israel’s Law of Return (1950) as amended in 1970, all non-Israeli Jews and Gentile converts to Judaism are entitled to settle in Israel and receive full Israeli citizenship. However, converts who wish to marry in Israel must demonstrate that they were converted under the supervision of an Orthodox rabbi approved by the country’s chief rabbinate, which is authorized to settle questions of personal status regarding marriage and divorce. The Supreme Court of Israel has made incursions into rabbinic interpretations of personal status. - Hebrew: - Yĕhūdhī or Yehudi - Key People: - Philip IV - Martin Buber - Isabella I - David Ben-Gurion - Hermann Göring Citizens of the State of Israel are called Israelis, a term carrying no ethnological or religious connotations."
}