{
  "url": "https://support.microsoft.com/en-us/office/filter-for-or-remove-duplicate-values-662c153f-cf21-4d7b-a5af-a9390648eb37",
  "title": "Filter for or remove duplicate values - Microsoft Support",
  "text": "Filtering for unique values and removing duplicate values are two closely related tasks because the displayed results are the same — a list of unique values. The difference, however, is important. When you filter for unique values, you temporarily hide duplicate values, but when you remove duplicate values, you permanently delete duplicate values. A duplicate value is one where all values in the row are an exact match of all values in another row. Duplicate values are determined by the value displayed in the cell and not necessarily the value stored in the cell. For example, if you have the same date value in different cells, one formatted as \"12/8/2017\" and the other as \"Dec 8, 2017\", the values are unique. It's a good idea to filter for or conditionally format unique values first to confirm that the results are what you want before removing duplicate values. Note: If the formula in the cells is different, but the values are the same, they are considered duplicates. For example, if cell A1 contains the formula =2-1 and cell A2 contains the formula =3-2, as long as the value is formatted the same, they are considered to be duplicate values. If the same value is formatted using different number formats, they are not considered duplicates. For example, if the value in cell A1 is formatted as 1.00 and the value in cell A2 is formatted as 1, they are not considered duplicates. Filter for unique values - Select the range of cells, or make sure that the active cell is in a table. - On the Data tab, in the Sort & Filter group, click Advanced. - Do one of the following: - Select the Unique records only check box, and then click OK. More options When you remove duplicate values, only the values in the selected range of cells or table are affected. Any other values outside the range of cells or table are not altered or moved. Because you are permanently deleting data, it's a good idea to copy the original range of cells or table to another sheet or workbook before removing duplicate values. Note: You cannot remove duplicate values from data that is outlined or that has subtotals. To remove duplicates, you must remove both the outline and the subtotals first. - Select the range of cells, or make sure that the active cell is in a table. - On the Data tab, in the Data Tools group, click Remove Duplicates. - Select one or more of the check boxes, which refer to columns in the table, and then click Remove Duplicates. Tip: If the range of cells or table contains many columns and you want to only select a few columns, clear the Select All check box and select only the columns that you want. You can apply conditional formatting to unique or duplicate values so that they can be seen easily. Color coding duplicate data, for example, can help you locate and, if necessary, remove that data. - Select one or more cells in a range, table, or PivotTable report. - On the Home tab, in the Styles group, click Conditional Formatting, point to Highlight Cells Rules, and then click Duplicate Values. - Select the options that you want in the New Formatting Rule dialog box, and then click OK. You can create a rule to color code unique or duplicate data in your sheet. This is especially helpful when your data includes multiple sets of duplicate values. - Select one or more cells in a range, table, or PivotTable report. - On the Home tab, in the Styles group, click Conditional Formatting, and then click New Rule. - In the Style list, choose Classic, and then in the Format only top or bottom ranked values list, choose Format only unique or duplicate values. - In the values in the selected range list, choose either unique or duplicate. - In the Format with list, select an option for how you want the unique or duplicate values to be formatted. You can edit an existing rule and modify it to apply conditional formatting to unique or duplicate data. - Select one or more cells in a range, table, or PivotTable report. - On the Home tab, in the Styles group, click Conditional Formatting, and then click Manage Rules. - Make sure that the appropriate sheet or table is selected in the Show formatting rules for list. - Select the rule, and then click Edit Rule. - Select the options that you want, and then click OK."
}