{
  "url": "https://en.wikipedia.org/wiki/Microsoft_campus",
  "title": "Microsoft campus - Wikipedia",
  "text": "Microsoft campus The Microsoft campus is the corporate headquarters of Microsoft Corporation, located in Redmond, Washington, United States, a part of the Seattle metropolitan area. Microsoft initially moved onto the grounds of the campus on February 26, 1986, shortly before going public on March 13. The headquarters has undergone multiple expansions since its establishment and is presently estimated to encompass over 8 million square feet (740,000 m2) of office space and has over 50,000 employees.[3] As of November 2018, the campus holds 83 buildings.[4][5] Additional offices in the Eastside suburbs of Seattle are located in Bellevue and Issaquah. Building 92 on the campus contains a visitor center (with interactive exhibits) and a store that is open to the public. History [edit]Microsoft chose to move its headquarters from Bellevue to nearby Redmond in January 1985, selecting a 29-acre (12 ha) plot of land that would be developed by Wright Runstad & Company.[6] Construction began on August 9, and Microsoft moved into the $25 million facility on February 26, 1986, several weeks before the company's initial public offering.[7][8] The move generated some concerns about increased traffic congestion on the unfinished State Route 520 freeway between Bellevue and Redmond;[9] a new freeway interchange at Northeast 40th Street would later be built in 2000 to service the campus, after lobbying and partial funding from Microsoft.[10][11] The initial campus was situated on a 30-acre (12 ha) lot with six buildings and was able to accommodate 800 employees, growing to 1,400 by 1988.[12] The site was once home to chicken farms in the 1920s that were ultimately demolished.[13] The campus was originally leased to Microsoft from the Teachers Insurance and Annuity Association, a pension fund manager, until it was bought back in 1992.[14] The original buildings were given sequential numbers, except for 7, due to a delay in permitting that became indefinite.[13] A pond between the original buildings was nicknamed \"Lake Bill\" for Bill Gates and was used for post-project celebrations, namely, managers being thrown in after a successful launch.[13] The first major expansion of the campus came in 1992, bringing the total amount of office space to 1.7 million square feet (160,000 m2) across 260 acres (110 ha) of land. Microsoft also announced its intention to contain most of its future growth within Redmond, while retaining some offices in Downtown Bellevue and its Factoria district.[15] Hundreds of rabbits were spread around the Redmond campus in the late 1990s.[16] A moratorium on development was implemented by the city government of Redmond, which prevented further campus expansion. In 2001, Microsoft announced plans for a satellite campus in Issaquah for 12,000 workers, but later reduced its scope. An expansion in Redmond was considered after options in Seattle's South Lake Union neighborhood were rejected.[17] In January 2006, Microsoft announced the purchase of Safeco's Redmond campus after the company had begun consolidating its offices at the Safeco Tower in Seattle's University District a year earlier.[18] The following month, Microsoft announced that it intended to expand its Redmond campus by 1,100,000 square feet (100,000 m2) for $1 billion and said that this would create space for between 7,000 and 15,000 new employees over the following three years.[19] The campus expansion also included more prominent branding and additional recreation areas.[20] In 2009, a shopping mall called \"The Commons\" was completed on the campus, bringing 1.4 million square feet (130,000 m2) of retail space as well as restaurants, a soccer field, and a pub to the West Campus.[21] A set of treehouses was built on the campus in 2017 by American treehouse builder Pete Nelson, as well as an elevated outdoor lounge named the Crow's Nest.[22][23] East Campus redevelopment [edit]In September 2015, The Seattle Times reported that Microsoft had hired architecture firm Skidmore, Owings & Merrill to begin a multibillion-dollar redesign of the Redmond campus, using an additional 1.4 million square feet (130,000 m2) permitted by an agreement with the City of Redmond.[2] The City of Redmond had also approved a rezone in February that year to raise the height limit for buildings on the campus from six stories to ten.[24] In November 2017, Microsoft unveiled plans to demolish 12 buildings on the older East Campus and replace them with 18 new buildings, housing 8,000 additional employees and raising the total number of buildings on the campus to 131.[25] The newer buildings would be arranged like an urban neighborhood, centered around a 2-acre (0.81 ha) open space with sports fields (including a cricket pitch), retail space, and hiking trails.[26][27][28] Demolition of the original buildings, including all of the original X-shaped offices built in the 1980s, began in January 2019 and was completed that September.[29][30] The expanded campus, scheduled to be completed in 2025, will have 17 office buildings and four floors of underground parking with capacity for 6,500 vehicles. The garage sits below a pedestrianized environment between the buildings, which are part of five \"villages\".[31][32] A 1,100-foot (340 m) pedestrian bridge connects the new campus buildings to the Redmond Technology light rail station and the West Campus area.[33] A set of 875 wells to harness geothermal energy will provide heating and cooling to buildings on the campus through 220 miles (350 km) of water pipes that comprise a geoexchange system.[34] Transportation [edit]The campus is located on both sides of the State Route 520 freeway, which connects it to the cities of Bellevue and Seattle, as well as downtown Redmond. The two sides of the campus are connected by a series of pedestrian and vehicle overpasses that cross State Route 520.[35] Microsoft partially covered the cost for an overpass over the freeway at NE 36th Street to relieve congestion on other cross-streets in the area.[36] Two more pedestrian bridges were jointly funded by Microsoft, the city government, and Sound Transit to connect the campus's light rail stations.[35][37] The campus is served by Seattle-area buses operated by Sound Transit and King County Metro that serve stops on State Route 520 and a central hub at Redmond Technology station. The RapidRide B Line also runs through the campus, connecting to downtown Bellevue and Redmond.[38] The Overlake Transit Center opened in 2002 and was replaced by the new Redmond Technology station, which opened on April 27, 2024, to serve Link light rail trains on the 2 Line.[39][40][41] For employees, Microsoft also operates a private commuter bus service called Connector that provides express service from the Redmond campus to neighborhoods in Seattle, the Eastside, and Snohomish County.[42][43] The company also runs a shuttle bus service, called the \"Shuttle Connect\", between buildings on the campus.[44] Microsoft had proposed its own bus service as early as 1998 to augment existing public transit routes that serve the campus.[45] The service launched in September 2007 and grew into a network of 19 routes within two years; the buses have on-board Wi-Fi and are operated by MV Transportation.[42] The shuttles were targeted in early 2014 as a symbol of gentrification in a similar fashion to the San Francisco tech bus protests that same year.[46][47][48] The Connector system is allowed to use King County Metro bus stops in Seattle as part of a permit system for corporate shuttles established by the city government in 2017.[49][50] References [edit]- ^ \"Facts About Microsoft\". - ^ a b Yu, Hui-yong; Bass, Dina (September 4, 2015). \"Microsoft considers multibillion-dollar overhaul to Redmond campus\". The Seattle Times. Retrieved September 8, 2015. - ^ \"Facts About Microsoft\". Microsoft. Retrieved July 21, 2015. - ^ \"Microsoft Redmond Campus Fact Sheet\" (PDF). Microsoft. November 2018. Retrieved December 10, 2019. - ^ \"Microsoft Redmond Main Campus Map & Buildings\". Microsoft. Retrieved December 10, 2019. - ^ \"Microsoft Corp. to move its headquarters to Redmond\". The Seattle Times. January 15, 1985. p. B2. - ^ Buck, Richard (March 9, 1986). \"Computer Memory Explored Conference reveals just how many are interested in the technology\". The Seattle Times. p. D6. - ^ Summerford, Tina (April 16, 2009). \"The History of Microsoft - 1985\". Channel 9. Microsoft. Retrieved July 11, 2016. - ^ Casey, Carolyn (November 28, 1984). \"Firm appears headed for site in Redmond\". The Seattle Times. p. F1. - ^ Whitely, Peyton (October 5, 2000). \"Hwy. 520 ramps expected to ease Redmond commute\". The Seattle Times. p. B1. - ^ Ervin, Keith (March 7, 1996). \"And now...the Microsoft Inerchange: Company uses clout to determine 520 exit\". The Seattle Times. p. B1. - ^ Lalonde, James E. (January 28, 1988). \"Microsoft deals with pressure: Heavy demand, not enough room\". The Seattle Times. p. E2. - ^ a b c Lerman, Rachel (November 30, 2017). \"Microsoft's campus redevelopment: What's staying, what's being torn down\". The Seattle Times. Retrieved November 10, 2018. - ^ Williams, Scott (January 8, 1992). \"4 original headquarters buildings and land repurchased by Microsoft\". The Seattle Times. Retrieved July 15, 2016. - ^ \"Microsoft will not expand beyond Redmond campus\". The Seattle Times. December 2, 1992. Retrieved July 15, 2016. - ^ \"Bunny roundup completed\". Kitsap Sun. Associated Press. April 3, 1999. Retrieved March 31, 2019. - ^ King, Harriet (May 4, 2005). \"After Looking Elsewhere, Microsoft Will Expand at Home\". The New York Times. Retrieved May 26, 2024. - ^ Bishop, Todd (January 19, 2006). \"Microsoft agrees to buy former Safeco site in Redmond\". Business Journals. Retrieved January 15, 2008. - ^ Dudley, Brier (February 9, 2006). \"Microsoft speeding up plans for huge campus redevelopment\". The Seattle Times. Retrieved January 15, 2008. - ^ Romano, Benjamin (November 11, 2007). \"Microsoft campus expands, transforms, inside and out\". The Seattle Times. Archived from the original on November 12, 2007. Retrieved May 7, 2020. - ^ Chan, Sharon Pian (April 20, 2009). \"Microsoft workers get their very own mall, The Commons, on corporate campus\". The Seattle Times. Retrieved July 21, 2015. - ^ Schlosser, Kurt (October 16, 2017). \"Microsoft's new treehouse meeting spaces take advantage of nature around its sprawling campus\". Geekwire. Archived from the original on October 18, 2017. Retrieved May 7, 2023. - ^ Singer-Velush, Natalie. \"Meet me in the trees: new outdoor meeting spaces help employees reap the benefits of nature\". Microsoft. Archived from the original on April 28, 2023. Retrieved May 7, 2023. - ^ Day, Matt (December 28, 2015). \"Microsoft's next Redmond expansion expected to go vertical\". The Seattle Times. Retrieved December 28, 2015. - ^ Jenkins, Aric (November 29, 2017). \"Microsoft Will Demolish Its Campus to Build a Mini-City\". Fortune. Retrieved November 29, 2017. - ^ Soper, Taylor (December 8, 2017). \"Microsoft plans world-class cricket pitch at Redmond HQ, in first for major U.S. tech campus\". GeekWire. Retrieved August 17, 2019. - ^ Wingfield, Nick (November 29, 2017). \"Microsoft to Expand Campus, as Amazon Looks Elsewhere\". The New York Times. Retrieved November 29, 2017. - ^ Bass, Dina (November 28, 2017). \"Microsoft Plans Multibillion-Dollar Campus Overhaul, Adding Open Spaces\". Bloomberg News. Retrieved November 29, 2017. - ^ Lerman, Rachel (November 10, 2018). \"Microsoft alumni play one last game of hallway putt-putt before demolition\". The Seattle Times. Retrieved November 10, 2018. - ^ Novet, Jordan (January 8, 2019). \"Microsoft begins demolishing buildings in Redmond campus remodel\". CNBC. Retrieved January 9, 2019. - ^ \"Microsoft East Campus Modernization shortlisted for international honor\". Seattle Daily Journal of Commerce. June 4, 2024. Retrieved June 5, 2024. - ^ Merten, Paxtyn (October 1, 2019). \"Microsoft HQ adds underground parking, self-driving car drop-offs and transit-connected pedestrian bridge\". Puget Sound Business Journal. Retrieved October 2, 2019. - ^ Miller, Brian (March 19, 2021). \"Microsoft reports progress on sustainable Redmond HQ makeover\". Seattle Daily Journal of Commerce. Retrieved March 20, 2021. - ^ Lystra, Tony (March 19, 2021). \"Microsoft's new Redmond utility plant to use earth's heat to slash energy use\". Puget Sound Business Journal. Retrieved March 20, 2021. - ^ a b Lindblom, Mike (January 26, 2024). \"New walk-bike bridge debugs access to Microsoft and light rail\". The Seattle Times. Retrieved March 24, 2024. - ^ \"Stimulus money goes for a bridge to Microsoft\". The Seattle Times. March 14, 2009. Retrieved July 21, 2015. - ^ Ervin, Keith (November 26, 2013). \"Microsoft pitches in on bridge over Overlake Transit Center\". The Seattle Times. Retrieved July 21, 2015. - ^ \"Overlake Transit Center Boarding Locations\". King County Metro. Retrieved July 21, 2015. - ^ Lindblom, Mike; Brooks, Diane (February 2, 2002). \"Modern transit centers for riders in Everett, Redmond to debut Monday\". The Seattle Times. Retrieved July 15, 2016. - ^ Oxley, Dyer (February 15, 2024). \"Get ready, Eastside. Light rail is finally coming to Bellevue in April\". KUOW. Retrieved March 24, 2024. - ^ Sires, Cameron (April 27, 2024). \"Long-awaited Bellevue-to-Redmond light rail line opens for riders\". Bellevue Reporter. Retrieved June 18, 2025. - ^ a b Long, Katherine (April 19, 2009). \"Microsoft Connector: 19 routes, 53 buses later\". The Seattle Times. Retrieved March 24, 2024. - ^ \"The Connector Fact Sheet\". Microsoft. September 6, 2007. Retrieved December 12, 2015. - ^ \"Fostering Alternative Ways to Commute at Microsoft\". Microsoft. Archived from the original on May 1, 2008. Retrieved July 21, 2015. - ^ Roe, Amy (September 25, 2007). \"Climb on board the Microsoft bus\". The Seattle Times. Retrieved March 24, 2024. - ^ Bishop, Todd (February 10, 2014). \"Activists block Microsoft shuttles in Seattle, in anti-gentrification protest\". GeekWire. Retrieved December 12, 2015. - ^ Grande, Alison (February 10, 2014). \"Microsoft Connector shuttles targeted by protestors\". KIRO-TV. Retrieved December 12, 2015. - ^ Wingfield, Nick (February 10, 2014). \"Seattle Gets Its Own Tech Bus Protest\". The New York Times. Retrieved December 12, 2015. - ^ Lee, Jessica (April 30, 2017). \"A first-of-its-kind program: Microsoft, Seattle Children's shuttles are now using Metro stops\". The Seattle Times. Retrieved March 24, 2024. - ^ Carder, Justin (September 19, 2022). \"Seattle shaping plan to permanently share its bus stops with corporate shuttles at $5K a pop\". Capitol Hill Seattle Blog. Retrieved March 24, 2024."
}