{
  "url": "https://ichd-3.org/",
  "title": "The International Classification of Headache Disorders - ICHD-3",
  "text": "The International Classification of Headache Disorders 3rd edition On behalf of the Classification Committee of The International Headache Society I am proud to present the third edition of the International Classification of Headache Disorders (ICHD-3). This follows the publication of ICHD-3 beta in 2013. The idea behind the beta version was to promote more field testing before presentation of the final ICHD-3, and this has worked well. There have been excellent field-testing studies published, in migraine with aura, cluster headache, idiopathic intracranial hypertension and trigeminal neuralgia among others. It was, for example, documented that the Appendix criteria for A1.2 Migraine with aura were superior to the criteria for 1.2 Migraine with aura in the main body of ICHD-3 beta, better distinguishing this disorder from transient ischemic attacks. Field testing of the novel associated features in criterion C1 for 3.1 Cluster headache, facial flushing and aural fullness, revealed that they did not add to diagnostic discrimination. Consequently, these symptoms are included only in the Appendix of ICHD-3, where they invite further study. These are examples of the evidence-based process of disease classification that now underpins all future changes to the International Classification of Headache Disorders. A contributing reason for the beta version was, as we thought, so that ICHD-3 could when published include the codes of the International Classification of Diseases, 11th edition (ICD-11), from the World Health Organization (WHO). We expected that ICD-11 would be finished in 2016, but unfortunately there have been long and unexpected delays so that the final codes are still not available. We therefore have to publish ICHD-3 without them. ICHD-3 is published as the first issue of Cephalalgia in 2018, exactly 30 years after the first edition of the International Classification of Headache Disorders, ICHD-I as we now call it. This first version was based primarily upon the opinions of experts, but proved nevertheless to be largely valid. ICHD-II, published in 2004, included a number of changes prompted partly by new evidence and partly by revised opinions of experts. New scientific evidence played a relatively greater role in the changes made in ICHD-3 beta, and all the further changes included in ICHD-3 are based on such evidence. Thus headache classification is now and will in the future be driven entirely by research. A long journey that started in 2010 has ended with the publication of ICHD-3, but the present committee has still much to do for a couple of years. ICHD-3 beta was translated into many languages, and these translations need updating before ICHD-3 can be published in those languages. Hopefully many additional translations will be published so that ICHD-3 becomes available in all major and even in many minor languages. An electronic version of ICHD-3 beta already developed under the leadership of Professor Hartmut Göbel has been updated to ICHD-3. A case book is planned in a collaboration between Professors Morris Levin and Jes Olesen. Finally, a cross-walk between ICHD-3 and WHO’s ICD-11 will be made by Professors Timothy Steiner and Jes Olesen as soon as the codes for ICD-11 become available. What then is the future of headache classification? Classification must in principle be a conservative discipline. When major changes are made to a classification, all previous studies using those parts of the classification that are changed must be revisited. Drug trials according to previous diagnostic criteria must, for example, be repeated if diagnostic criteria undergo major changes, because patients falling under the new diagnosis will be different from those falling under the previous diagnosis. My hope is that the active field testing and scientific analysis that have been done for ICHD-3 will continue, allowing future changes to be entirely evidence-based. Following the tradition, it will be 10-15 years before ICHD-4, but a number of field-testing studies will be produced in the meantime. Modified ICHD-II diagnostic criteria for 1.3 Chronic migraine were published in Cephalalgia; the Classification Committee endorsed these changes, asking for their immediate use even though they were not integrated into the International Classification of Headache Disorders until ICHD-3 beta appeared years later. A future headache classification committee should similarly be able to endorse and support the adoption of new or revised diagnostic criteria before publishing ICHD-4 when they are substantiated by good field-testing studies published in Cephalalgia. ICHD-I took headache classification from being one of the worst-classified neurological diseases to being the best. We have kept this momentum for 30 years, and the superiority of our classification became evident recently during the committee work in Geneva on the neurological section of ICD-11. No other discipline within neurology has such a systematic classification with explicit diagnostic criteria for every disease entity. I sincerely hope that this tradition can be upheld in the future, and that headache can continue to lead the way in the classification of neurological diseases. Jes Olesen Chairman Headache Classification Committee International Headache Society Preface for ICHD-3 website ICHD-3 is now available in digital format. The ICHD-3 website makes it very easy to understand and follow the precise organisation and content of the current classification, making the practical application in the clinical field and in research simpler than ever before. The three main chapters and the appendix are listed in the main menu. The respective diagnoses can be viewed and selected in the text area after choosing a main heading. Using the text, the menu and the search function, answers to specific questions in clinical practice can be researched quickly. The ICHD-3 online service enables fast digital access to all information of the international headache classification. The ICHD-3 beta version continues to be available digitally and can be seen for comparison purposes. Currently available translations of ICHD-3 and ICHD-3 beta can be viewed in the downloads section. The information about classification and diagnosis of headaches is supplemented by original documents and accompanying materials including lecture presentations and media library. The digital media centre about classification and diagnosis of headaches will be continuously expanded. The first computer was invented during 1936-1938, long before an international headache classification existed. The first edition of the International Headache Classification was published in 1988. The very first website that went online was published in 1990 almost at the same time. While ICHD-1 did not become available digitally, the website for ICHD-2 was launched for the first time in 2006. In recent years, there has been a tremendous advance of digital media in medicine. The use of mobile smartphones and tablets has become a standard in all areas of medicine. Many different operating systems and display formats are available. For ICHD-3 we have chosen a platform that responsively adjusts to the different devices and display formats. The web address can be directly added to the home screen of the particular device and thereby opened and used just like a native app. The links demonstrate, how digital ICHD-3 can be added to iOS or Android home screen. The website also provides a “reader mode”, a one-tap solution for reading web pages formatted for easy reading. After loading the ICHD-3 website page in the Safari browser for example, click the Reader button at the left end of the address bar. Likewise, reader mode is also available in other up-to-date mobile browsers. My sincere thanks go to Professor Jes Olesen, chairman of Headache Classification Committee of the International Headache Society and the members of the committee for delegating the task to develop this digital version. I would also like to thank the committee members who helped in creating this ICHD-3 online service. Hartmut Göbel Chairman ICHD-Website Committee"
}