{
  "url": "https://pt.wikipedia.org/wiki/Regiões_do_centro_histórico_de_Roma",
  "title": "Regiões do centro histórico de Roma – Wikipédia, a enciclopédia livre",
  "text": "Regiões do centro histórico de Roma Rione (em italiano: rione; pl. rioni) é uma divisão administrativa tradicional da cidade de Roma. O termo é utilizado na cidade desde o século XIV.[1] A palavra vem do latim \"regio\" (pl. \"regiones\") que na Idade Média se tornou \"rejones\" e daí \"rione\". Atualmente, todos os riones de Roma estão localizados no Municipio I da cidade. Roma Antiga [editar | editar código]De acordo com a tradição, Sérvio Túlio, o sexto rei de Roma, primeiro dividiu a cidade em quatro regiões (regiones em latim). Na reorganização que se seguiu ao colapso da República Romana, o primeiro imperador de Roma, Augusto, criou as tradicionais 14 regiões de Roma, um arranjo que permaneceu durante toda a era imperial, como atestado pelos Catálogos Regionais (Curiosum et Notitia Urbis Romae), do século IV, que numera e data cada uma delas. Todas exceto a Transtiberim (moderno Trastevere) ficavam na margem esquerda do Tibre. Eram elas: I - Porta Capena – Porta Capena II - Celimôncio – Caelimontium III - Ísis e Serápis – Isis et Serapis IV - Templo da Paz – Templum Pacis V - Esquílias – Esquiliae VI - Alta Semita – Alta Semita VII - Via Lata – Via Lata VIII - Fórum Romano – Forum Romanum IX - Circo Flamínio – Circus Flaminius X - Palatino – Palatium XI - Circo Máximo – Circus Maximus XI - Piscina Pública – Piscina Publica XIII - Aventino – Aventinus XIV - Transtiberim – Transtiberim Idade Média [editar | editar código]Depois da queda do Império Romano do Ocidente e o declínio subsequente da cidade de Roma, a população caiu e e a divisão nas regiões se perdeu. No século XII, uma divisão em 12 partes começou a ser utilizada extra-oficialmente, baseada no costume da população. Mesmo se as áreas fossem diferentes das antigas, os nomes eram os mesmos das regiões da Roma Antiga. Nesta época, \"regio\" em latim transformou-se em \"rione\" na linguagem popular. Os limites dos riones tornaram-se mais definitivos e foram oficializados no século XIII com o acréscimo de mais um, totalizando 13, o número que permaneceu até o século XVI. Porém, as fronteiras era incertas. O administrador de cada rione era conhecido como \"caporione\" (\"chefe do rione\"). Idade Moderna e Contemporânea [editar | editar código]Durante o Renascimento ocorreu uma profunda reorganização e expansão da cidade, o que resultou numa delimitação clara das fronteiras de cada rione. Em 1586, o papa Sixto V acrescentou mais um aos 13 riones existentes, o Borgo, que até então vinha sendo administrado separadamente da cidade de Roma. A situação, graças ao lento crescimento populacional da cidade, não se alterou até o século XIX. Em 1744, o papa Bento XIV, por causa de frequentes problemas de comunicação, decidiu replanejar a divisão administrativa de Roma, deixando a administração da cidade a cargo do conde Bernardini. As placas de mármore nas fronteiras de cada rione, muitas ainda existentes, foram instaladas no mesmo ano nas fachadas das casas que ficavam nos limites. Em 1798. durante a República Romana, houve uma racionalização da divisão administrativa da cidade, criando doze riones (com os nomes modernos entre parênteses): - Termas (parte de Monti); - Suburra (parte de Monti); - Quirinal (Trevi); - Píncio (Colonna); - Marte (Campo de Marte); - Bruto (Ponte); - Pompeu (Regola e Parione); - Flamínio (Sant'Eustachio); - Panteão (Pigna e Sant'Angelo); - Capitólio (Campitelli e Ripa); - Janículo (Trastevere); - Vaticano (Borgo); Logo depois, durante a ocupação napoleônica de Roma, Roma foi dividida em oito partes, chamadas de \"Giustizie\": - Monti; - Trevi; - Colonna e Campo de Marte; - Ponte e Borgo; - Parione e Regola; - Sant'Eustachio e Pigna; - Campitelli, Sant'Angelo e Ripa; - Trastevere. Na mesma época, os franceses afixaram em cada rua uma placa com seu nome e a área a qual ela pertencia. Hoje [editar | editar código]Depois da queda de Napoleão, não houve mudanças significativas na organização da cidade até a transformação de Roma na capital da nova Itália unificada. As necessidades de uma nova capital provocaram uma grande urbanização e um crescimento populacional, tanto no interior da Muralha Aureliana quanto fora dela. Em 1874, existiam 15 riones, com o acréscimo do Esquilino, criado com parte do rione Monti. No começo do século XX, alguns dos riones maiores foram também divididos e as primeiras áreas fora da Muralha Aureliana passaram a ser consideradas parte da cidade. Em 1921, o número de riones subiu para 22. Prati foi o último a ser criado e é o único fora da muralha de Urbano VIII. A última reforma, válida ainda hoje, foi feita em 1972: Roma foi dividida em 20 circunscrições (circoscrizioni), rebatizadas depois de municípios (municipi), um dos quais seria depois formalizado como a cidade de Fiumicino, e 20 riones que, juntos, passaram a formar o Centro Histórico, englobados todos no Município I. Até 2013, os dois remanescentes, Borgo e Prati, pertenciam ao Município XVII, mas foram incorporados ao Município I na mesma época. A lista completa dos riones modernos, na ordem que foram numerados, é a seguinte: 1 - Monti, que engloba os montes Quirinal e Viminal 2 - Trevi, também parte do monte Quirinal 3 - Colonna, que engloba o monte Píncio 4 - Campo Marzio, parte do antigo Campo de Marte 5 - Ponte, parte do antigo Campo de Marte 6 - Parione, parte do antigo Campo de Marte 7 - Regola, parte do antigo Campo de Marte 8 - Sant'Eustachio, parte do antigo Campo de Marte 9 - Pigna, parte do antigo Campo de Marte 10 - Campitelli, que engloba os montes Capitolino e Palatino 11 - Sant'Angelo, parte do antigo Campo de Marte 12 - Ripa, que engloba o monte Aventino 13 - Trastevere, do outro lado do Tibre, abrangendo com a chamada \"oitava colina de Roma\", o Janículo 14 - Borgo, também do outro lado do Tibre, vizinho do Vaticano, que não é parte da Itália 15 - Esquilino, que engloba o monte Esquilino 16 - Ludovisi 17 - Sallustiano 18 - Castro Pretorio 19 - Celio, que engloba o monte Célio 20 - Testaccio 21 - San Saba 22 - Prati Brasões dos riones modernos de Roma [editar | editar código]Ver também [editar | editar código]Referências Bibliografia [editar | editar código]- Castagnoli, Ferdinando; Cecchelli, Carlo; Giovannoni, Gustavo; Zocca, Mario (1958). Topografia e urbanistica di Roma (em italiano). Bologna: Cappelli - «Rioni di Roma» (em italiano). Rome SQPR - «Rioni of Rome» (em inglês). Rome Art Lover - «Rioni de Roma, com estradário, mapas e nomes» (em italiano). Info Roma"
}