{
  "url": "https://support.microsoft.com/pt-br/windows/restaurar-o-computador-0ef73740-b927-549b-b7c9-e6f2b48d275e",
  "title": "Restaurar o computador - Suporte da Microsoft",
  "text": "Restaurar o computador Aplica-se a O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. A reposição do PC no Windows é uma funcionalidade avançada que lhe permite restaurar o seu dispositivo para o estado original, o que pode ser útil quer esteja a ter problemas de desempenho, problemas de software ou simplesmente queira começar de novo. Esta funcionalidade foi concebida para ser compatível com o utilizador e fornece várias opções que se adequam a diferentes necessidades. Opções de reposição Eis uma lista de opções ao repor o PC: Observação: A funcionalidade de eliminação de dados destina-se aos consumidores e não cumpre as normas de eliminação de dados governamentais e da indústria. Passos de reposição Pode repor o PC quando tiver sessão iniciada no Windows ou a partir do Ambiente de Recuperação do Windows (Windows RE). Importante: Durante o processo de reposição, é possível que o ecrã possa ficar preto durante um longo período de tempo (ocasionalmente mais de 15 minutos) e que o seu dispositivo possa tentar reiniciar-se sozinho. Tentar reiniciar manualmente o dispositivo durante este processo pode fazer com que a reposição falhe. Selecione a opção mais adequada às suas necessidades: - Na aplicação Definições no seu dispositivo Windows, selecione Sistema > Recuperação ou utilize o seguinte atalho:Abrir definições de Recuperação Observação: No Windows 10, pode aceder a partir do Update & Security > Recovery - Selecione Repor PC - Escolha uma das opções e/ou definições na tabela de opções de reposição Observação: Se encriptou o seu dispositivo, precisará da sua chave BitLocker para concluir esta tarefa. Se não souber qual é a sua chave BitLocker, consulte Localizar a chave de recuperação BitLocker. - Uma vez no Windows RE, selecione Resolução de problemas > Repor este PC > Restauro do Sistema - Escolha uma das opções e/ou definições na tabela de opções de reposição"
}