{
  "url": "https://www.medicaredforall.com/physician-1841279486-michael-gallina-dpm-bradenton",
  "title": "Michael Gallina DPM in Bradenton, Florida - Podiatry",
  "text": "Michael Gallina DPM has Podiatry as his primary medical specialty. Their primary office is: 701 Manatee Ave W in Bradenton, Florida. There are 2 additional office locations for Michael Gallina DPM that can be viewed towards the end of their profile. They're a part of the: Arcadia Medical Associates Pa medical group which has around 21 members. You can call their office at 941-748-3065 to schedule an appointment. They also accept the Medicare-approved amount as payment in full. They attended Sorry, his university is not listed and graduated in 1997 (around 29 years of experience). They are not listed as doing telehealth appointments, but this may have changed. It can't hurt to call and check. If anything it may encourage them to make them available if they are not currently. Michael Gallina DPM Arcadia Medical Associates Pa 701 Manatee Ave W Bradenton, Florida 34205 941-748-3065 Phone: 941-748-3065 Enter a starting address: Medical School: Sorry, his university is not listed Graduation Year: 1997 The Primary Medical Specialty for Michael Gallina DPM is listed as: Podiatry Credentials: DPM Additional Credentials: Approximate Years of Experience: 29 PAC (PECOS ID)#: 0042124828 NPI #: 1841279486 NPI Created On: 0000-00-00 NPI Last Updated Listed as: 0000-00-00 Primary Taxonomy Code: 213ES0103X License Number: PO3070 Listed Gender: Male Forms of insurance accepted by include, but are not limited to: They are listed as accepting new patients. Languages spoken by staff include: English. Services and Procedures include: 1. Arcadia Medical Associates Pa 425 Nursing Home Dr Arcadia, FL 34266 Group Members: 21 Phone: 941-748-3065 Enter a starting address: 2. Arcadia Medical Associates Pa 435 Commercial Ct Venice, FL 34292 Group Members: 21 Phone: 941-748-3065 Enter a starting address: 300 Riverside Dr E Bradenton, FL Mcr Health Inc 8614 E State Rd Bradenton, FL 6050 State Rd 70 Bradenton, FL 1800 Cortez Rd W Bradenton, FL Cortez Foot And Ankle Specialists P.a. 1611 53rd Ave W Bradenton, FL West Coast Podiatry Center, Inc. 3003 26th St W Bradenton, FL Sammy And Divincenzo, Pa 425 Nursing Home Dr Arcadia Fl 34266-3839 Arcadia Medical Associates Pa Internal Medicine 425 Nursing Home Dr Arcadia Fl 34266-3839 Arcadia Medical Associates Pa Cardiovascular Disease (cardiology) 425 Nursing Home Dr Arcadia Fl 34266-3839 Arcadia Medical Associates Pa Gastroenterology 435 Commercial Ct Venice Fl 34292-1658 Arcadia Medical Associates Pa Gastroenterology 701 Manatee Ave W Bradenton Fl 34205-8624 Arcadia Medical Associates Pa Endocrinology 2415 University Pkwy Sarasota Fl 34243-2809 Arcadia Medical Associates Pa Endocrinology View all 21 members of Arcadia Medical Associates Pa medical group"
}