{
  "url": "https://www.georgiancollege.ca/blog/newsroom/georgian-and-meta-collaborate-on-intelligent-tutoring-system-using-ai/",
  "title": "Georgian College and Meta collaborate on intelligent tutoring system using AI - Georgian College",
  "text": "Georgian College and Meta collaborate on intelligent tutoring system using AI Jan. 21, 2025 Imagine a personal mentor in the form of smart glasses connected to AI that can help you study throughout your entire college experience, or using a virtual reality (VR) headset to walk through a real-life scenario of what you just learned in class. That’s what’s in store for Georgian College students through a new, cutting-edge collaboration with Meta. Georgian is among the first Canadian colleges to team up with global technology giant Meta to advance the development of Intelligent Tutoring Systems (ITS) using Generative AI (GenAI) and extended reality (XR). At the forefront of innovative, hands-on learning, Georgian is using Meta’s Llama 3 platform, one of the world’s leading open source artificial intelligence (AI) large language models, to develop an intuitive AI tutor. The first courses in development are anatomy and physiology, with plans to expand to more programs. Georgian has a long standing relationship with Meta, and has earned a reputation as an innovative and future-focused postsecondary institution through its unique and immersive programming. Meta provided Ray-Ban Meta glasses and financial support as part of a three-year collaboration. Now, through Georgian’s Research, Innovation and Entrepreneurship department and the Centre for Teaching and Learning, staff, faculty and students, led by Rob Theriault, Immersive Technology Manager, are developing three distinct phases of the project. In phase 1, students will use the smart glasses with a forward-facing camera coupled with AI and computer vision to study and learn concepts for their courses. For example, a student studying anatomy can ask the AI to identify organs on an anatomical model and how they function. The AI draws on datasets from the course outline, syllabus, an open source textbook specified by the course professor and other open source datasets that have been vetted for validity and reliability. In phase 2, students can use an augmented reality (AR) headset coupled with AI to ask further questions about course material they wish to understand better. In response, the platform can provide visual personalized material, such as animated graphs within the student’s field of view. Finally, in phase 3, students might ask a question that requires an auditory, visual and tactile experience. The AI might suggest that the student don their VR headset to view computer-generated 3D content created in real time. For example, an animated patient on a ventilator in the intensive care unit appears and the student can have a conversation with the AI about the patient’s clinical presentation. They would also be able to pick up a stethoscope to listen to the patient’s chest. All of this combined, helps better prepare students for what they’ll encounter in the workforce. “This uniquely adaptive, interactive learning platform promises to push students through all levels of learning, from basic recall to higher-order analytical skills,” said Rob Theriault. “We’re very excited to embark on this multi-year applied research project to discover and develop Intelligent Tutoring Systems which will ultimately transform the way students learn and the way learning is assessed.” The Georgian research team for this project consists of students, faculty and staff, including Clinton D’Almeida, Swaroop Sanjeev Ingavale, Laleh Khodaparast , Sanjeev Kumar, Dr. Sean Madorin, Sweta Jitendra Pandit, Dr. Mira Ray, Andrea Vargas, Dacorie Smith, Yash Solanki, Rob Theriault, Alina Viju, and Brunilda Xhaferllari. Learn more about Research, Innovation and Entrepreneurship at Georgian."
}