{
  "url": "https://www.dictionary.com/browse/north",
  "title": "NORTH Definition & Meaning | Dictionary.com",
  "text": "north 1 Americannoun - a cardinal point of the compass, lying in the plane of the meridian and to the left of a person facing the rising sun. N - the direction in which this point lies. - (usually initial capital letter) a region or territory situated in this direction. - the North, the northern area of the United States, especially the states that fought to preserve the Union in the Civil War, lying to the north of the Ohio River, and usually including Missouri and Maryland. - (initial capital letter) North Country. - the north wind. adjective - in, toward, or facing, the north. the north gate. - directed or proceeding toward the north. a north course. - coming from the north. a north wind. - (usually initial capital letter) designating the northern part of a region, nation, country, etc.. North Atlantic. adverb noun - Christopher, pen name of John Wilson. - Frederick, 2nd Earl of Guilford Lord North, 1732–92, British statesman: prime minister 1770–82. - Sir Thomas, 1535?–1601?, English translator. noun - one of the four cardinal points of the compass, at 0° or 360°, that is 90° from east and west and 180° from south - the direction along a meridian towards the North Pole - the direction in which a compass needle points; magnetic north - (often capital) any area lying in or towards the north - cards (usually capital) the player or position at the table corresponding to north on the compass adjective - situated in, moving towards, or facing the north - (esp of the wind) from the north adverb - in, to, or towards the north - archaic (of the wind) from the north noun - the northern area of England, generally regarded as reaching approximately the southern boundaries of Yorkshire and Lancashire - (in the US) the area approximately north of Maryland and the Ohio River, esp those states north of the Mason-Dixon Line that were known as the Free States during the Civil War - the northern part of North America, esp the area consisting of Alaska, the Yukon, the Northwest Territories, and Nunavut; the North Country - the countries of the world that are economically and technically advanced - poetic the north wind adjective noun - Frederick, 2nd Earl of Guildford, called Lord North. 1732–92, British statesman; prime minister (1770–82), dominated by George III. He was held responsible for the loss of the American colonies - Sir Thomas. ?1535–?1601, English translator of Plutarch's Lives (1579), which was the chief source of Shakespeare's Roman plays Etymology Origin of north before 900; Middle English, Old English, cognate with Dutch noord, German Nord, Old Norse northr Example Sentences Examples are provided to illustrate real-world usage of words in context. Any opinions expressed do not reflect the views of Dictionary.com. In regions north of the Antarctic Polar Front -- a boundary where cold Antarctic waters meet warmer waters to the north -- that dust helped fertilize algae. From Science Daily Zhang later moved north and was eventually named commander of the Shenyang Military Region. From Barron's On Tuesday, north of Virginia's capital Richmond, Louella Glessner stood on a mound of plowed snow, flowers in hand, hoping the robed monks and their mission might somehow begin to heal America's toxic divisions. From Barron's When authorities were initially called to Nancy Guthrie’s desert home a few miles north of Tucson on Sunday, they immediately found what officials described as suspicious and concerning circumstances. From Los Angeles Times This despite San Francisco being 40 miles north of Levi’s Stadium, where the game will be played, while San Jose is next door. Definitions and idiom definitions from Dictionary.com Unabridged, based on the Random House Unabridged Dictionary, © Random House, Inc. 2023 Idioms from The American Heritage® Idioms Dictionary copyright © 2002, 2001, 1995 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company."
}