{
  "url": "https://en.m.wikipedia.org/wiki/Vaishnavism",
  "title": "Vaishnavism - Wikipedia",
  "text": "Vaishnavism Vaishnavism (Sanskrit: वैष्णवसम्प्रदायः, romanised: Vaiṣṇavasampradāyaḥ), also called Vishnuism, is one of the major Hindu religious traditions, that considers Vishnu as the supreme being leading all other Hindu deities, that is, Mahavishnu.[1][2] It is one of the major Hindu denominations along with Shaivism, Shaktism, and Smartism.[3] Its followers are called Vaishnavites or Vaishnavas (IAST: Vaiṣṇava), and it includes sub-sects like Krishnaism and Ramaism, which consider Krishna and Rama as the supreme beings respectively.[4][5] The ancient emergence of Vaishnavism is unclear, and broadly hypothesised as a fusion of various regional non-Vedic religions with worship of Vishnu. Those popular non-Vedic theistic traditions, particularly the Bhagavata cults of Vāsudeva-Krishna[6][7] and Gopala-Krishna,[6][8] as well as Narayana,[9] developed in the 7th to 4th century BCE,[6][10] and were identified with the Vedic God Vishnu in the early centuries CE, and finalised as Vaishnavism,[6][11][12] when it developed the avatar doctrine, wherein the various non-Vedic deities are revered as distinct incarnations of the supreme God Vishnu. Narayana, Hari, Rama, Krishna, Kalki, Perumal, Shrinathji, Vithoba, Venkateswara, Guruvayurappan, Ranganatha, Jagannath, Badrinath and Muktinath are revered as forms or avatars of Vishnu, all seen as different aspects of the same supreme being.[13][14][15] The Vaishnavite tradition is known for the loving devotion to an avatar of Vishnu (often Krishna), and as such was key to the spread of the Bhakti movement in the Indian subcontinent in the 2nd millennium CE.[16][17] It has four Vedanta—schools of numerous denominations (sampradaya): the medieval-era Vishishtadvaita school of Ramanuja, the Dvaita school of Madhvacharya, the Dvaitadvaita school of Nimbarkacharya, and the Shuddhadvaita of Vallabhacharya.[18][19] There are also several other Vishnu-traditions. Ramananda (14th century) created a Rama-oriented movement, now the largest monastic group in Asia.[20][21] Key texts in Vaishnavism include the Vedas, the Upanishads, the Bhagavad Gita, the Pancharatra (Agama) texts, Naalayira Divya Prabhandham, and the Bhagavata Purana.[22][23][24][25] According to a 2020 estimate by The World Religion Database (WRD), hosted at Boston University's Institute on Culture, Religion and World Affairs (CURA), Vaishnavism is the largest Hindu sect, constituting about 399 million Hindus.[26] History Origins Northern India The ancient emergence of Vaishnavism is unclear, with evidence inconsistent and scanty.[32] In the Rg Veda Vishnu is \"a benevolent, solar deity,\"[33][34] who is mentioned in just a few hymns,[34][35] and rose to prominence mid-first century BCE.[33][34][note 1] Syncretism of various local traditions and deities (Vasudeva-Krishna, Narayana, Krishna-Golpa) with Vishnu resulted in Vaishnavism.[11][12][5][39] According to Bhandarkar, Vaishnavism formed in the Purnaic period through the identification of Vishnu with Narayana and with Vasudeva-Krishna, following his elevation as the \"Supreme Spirit\". He suggests, like other older publications, that this elevation appears linked to reverence for Vishnu's \"third step\" or for his \"highest place\" (paramam pada), described in the Rg Veda as being \"seen by the wise\" and later reinterpreted in Katha Upanishad as the soul's final goal.[38][note 1] Yet, according to Jan Gonda, this interpretation is insufficient to explain the ascendance of Vishnu in post-Vedic times.[40] Gonda argues that the Vedic poets did not give a complete description of his qualities, and that he may have had a greater appeal among the Aryan and non-Aryan \"masses\" of the early Vedic times than reflected in the Vedas.[41] Gonda concludes that, for the Vedic people, the complex powers which were experienced as \"the presence an the activity of a divine personality called Visnu may [...] best be described as the 'idea' of universal penetration or pervasiveness, as the axis mundi and otherwise, of the omnipresence of a mighty and beneficent energy, in which all beings abide\".[42] According to Dandekar, what is understood today as Vaishnavism did not originate in Vedism, but emerged from the merger of several popular theistic traditions after the decline of Brahmanism at the end of the Vedic period, shortly before the second urbanisation of northern India, in the 7th to 4th century BCE.[note 2] According to Dandekar, Vaishnavism initially formed as Vasudevism around Vāsudeva, a deified leader of the Vrishnis, and one of the Vrishni heroes.[6] Later, Vāsudeva was amalgamated with Krishna \"the deified tribal hero and religious leader of the Yadavas\",[6][7] to form the merged deity Bhagavan Vāsudeva-Krishna,[6] due to the close relation between the tribes of the Vrishnis and the Yadavas.[6] This was followed by a merger with the cult of Gopala-Krishna of the cowherd community of the Abhıras[6] in the 4th century CE.[8] The character of Gopala Krishna is often considered to be non-Vedic.[43] According to Dandekar, such mergers positioned Krishnaism between the heterodox sramana movement and the orthodox Vedic religion.[6] The \"Greater Krsnaism\", states Dandekar, then adopted the Rigvedic Vishnu as Supreme deity to appeal to orthodox elements.[6] According to Klostermaier, Vaishnavism originates in the last centuries BCE and the early centuries CE, with the cult of the heroic Vāsudeva, a leading member of the Vrishni heroes, which was then later amalgamated with Krishna, hero of the Yadavas, and still several centuries later with the \"divine child\" Bala Krishna of the Gopala traditions.[note 3] According to Klostermaier, \"In some books Krishna is presented as the founder and first teacher of the Bhagavata religion.\"[44] According to Dalal, \"The term Bhagavata seems to have developed from the concept of the Vedic deity Bhaga, and initially it seems to have been a monotheistic sect, independent of the Brahmanical pantheon.\"[45] The development of the Krishna-traditions was followed by a syncretism of these non-Vedic traditions with the Mahabharata canon, thus affiliating itself with Vedism in order to become acceptable to the orthodox establishment. The Vishnu of the Rig Veda was assimilated into non-Vedic Krishnaism and became the equivalent of the Supreme God.[7] The appearance of Krishna as one of the Avatars of Vishnu dates to the period of the Sanskrit epics in the early centuries CE. The Bhagavad Gita—initially, a Krishnaite scripture, according to Friedhelm Hardy—was incorporated into the Mahabharata as a key text of Krishnaism.[4][46] Finally, the Narayana worshippers were also included, which further brahmanized Vaishnavism.[47] The Nara-Narayana worshippers may have originated in Badari, a northern ridge of the Hindu Kush, and was absorbed into the Vedic orthodoxy as Purusa Narayana.[47] Purusa Narayana may have later been turned into Arjuna and Krsna.[47] In the late Vedic texts (~1000 to 500 BCE), the concept of a metaphysical Brahman grew in prominence. The Vaishnavism tradition considered Vishnu to be identical to Brahman, just like Shaivism and Shaktism consider Shiva and Devi to be Brahman respectively.[48] This complex history is reflected in the two main early denominations of Vishnavism: the Bhagavats, worshipping Vāsudeva-Krishna[49] and follow Brahmanic Vaishnavism, and the Pacaratrins, who regarded Narayana as their founder and follow the Tantric Vaishnavism.[47][50] Southern India S. Krishnaswami Aiyangar states that the Vaishnava Alvars lived in the first half of the 12th century with their works flourishing about the time of the revival of Brahminism and Hinduism in the north and speculates that Vaishnavism might have spread to the south as early as the first century CE.[51] Secular literature also ascribes the tradition in the south to the 3rd century CE. U. V. Swaminatha Iyer, a scholar of Tamil literature, published the Paripatal (Sangam period), which contains seven poems in praise of Vishnu, including references to Krishna and Balarama. Aiyangar notes an invasion of the south by the Mauryas in some of the older poems of the Sangam, suggesting that opposition to northern conquest may have an element of religion, with orthodox Brahmanism resisting the spread of Buddhism under Ashoka. Tamil literature of this period also records the settlement of Brahman colonies in the south, and exhibit considerable Brahmanical influence.[52] The Pallava dynasty of Tamilakam patronised Vaishnavism. Mahendra Varman built shrines both of Vishnu and Shiva, several of his cave-temples exhibiting shrines to Brahma, Vishnu, and Shiva. In the age of the Pallava domination, which followed immediately, both Vaishnavism and Shaivism flourished, fighting the insurgent Buddhists and Jains.[53] The Pallavas were also the first of various dynasties that offered land and wealth to the Venkatesvara temple at Tirumala, which would soon become the most revered religious site of South India.[citation needed] The Sri Vaishnava acharya Ramanuja is credited with the conversion of the Hoysala king Vishnuvardhana (originally called Bittideva) from Jainism to Vaishnavism, consolidating the faith in Karnataka.[54] The Chalukyas and their rivals of the Pallavas appear to have employed Vaishnavism as an assertion of divine kingship, one of them proclaiming themselves as terrestrial emanations of Vishnu while the other promptly adopted Shaivism as their favoured tradition, neither of them offering much importance to the other's deity.[55] The Sri Vaishnava sampradaya of Ramanuja would hold sway in the south, the Vadakalai denomination subscribing to Vedanta philosophy and the Tenkalai adhering to regional liturgies known as Prabandham.[56] According to Hardy,[note 4] there is evidence of early \"southern Krishnaism\", despite the tendency to allocate the Krishna-traditions to the Northern traditions.[57] South Indian texts, including the Manimekalai and the Cilappatikaram, show close parallel with the Sanskrit traditions of Krishna and his gopi companions, later widespread in North Indian text and imagery.[59] Hardy argues that the Sanskrit Bhagavata Purana is essentially a Sanskrit \"translation\" of the bhakti of the Tamil alvars.[60] Devotion to the southern Indian Mal (Perumal) may be an early form of Krishnaism, since Mal appears as a divine figure, largely like Krishna with some elements of Vishnu.[61] The Alvars, whose name can be translated \"immersed\", were devotees of Perumal. They codified the Vaishnava canon of the south with their most significant liturgy, the Naalayira Divya Prabandham, traced to the 10th century as a compilation by Nathamuni.[62] Their poems show a pronounced orientation to the Vaishnava, and often Krishna, side of Mal. But they do not make the distinction between Krishna and Vishnu on the basis of the concept of the avatars.[61] Yet, according to Hardy, the term \"Mayonism\" should be used instead of \"Krishnaism\" when referring to Mal or Mayon.[57] The early Alvars glorified Vishnu bhakti, but also expressed sympathy for Shiva bhakti, sometimes even describing Shiva and Vishnu as one, although they do recognise their united form as Vishnu.[63] Gupta era Most of the Gupta kings, beginning with Chandragupta II (Vikramaditya) (375–413 CE) were known as Parama Bhagavatas or Bhagavata Vaishnavas.[65][47] But following the Huna invasions, especially those of the Alchon Huns circa 500 CE, the Gupta Empire declined and fragmented, ultimately collapsing completely, with the effect of discrediting Vaishnavism, the religion it had been so ardently promoting.[66] The newly arising regional powers in central and northern India, such as the Aulikaras, the Maukharis, the Maitrakas, the Kalacuris or the Vardhanas preferred adopting Saivism instead, giving a strong impetus to the development of the worship of Shiva, and its ideology of power.[66] Vaisnavism remained strong mainly in the territories which had not been affected by these events: South India and Kashmir.[66] Early medieval period After the Gupta age, Krishnaism became a major current of Vaishnavism,[44] and Vaishnavism developed into various sects and subsects, most of them emphasising bhakti, which was strongly influenced by south Indian religiosity.[47] Modern scholarship places Nimbarkacharya (c.7th century CE) in this period; he propounded Radha-Krishna worship and his doctrine later came to be known as Dvaita-advaita.[67] Vaishnavism in the 10th century started to employ Vedanta-arguments, possibly continuing an older tradition of Vishnu-oriented Vedanta predating Advaita Vedanta. Many of the early Vaishnava scholars such as Nathamuni, Yamunacharya and Ramanuja, contested Adi Shankara's Advaita, instead emphasising devotion (bhakti) to Vishnu.[68][69] Vaishnavism flourished in predominantly Shaivite Tamil Nadu during the seventh to tenth centuries CE with the twelve Alvars, saints who spread the sect to the common people with their devotional hymns. The temples that the Alvars visited or founded are now known as Divya Desams. Their poems in praise of Vishnu and Krishna in the Tamil language are collectively known as Naalayira Divya Prabandha (4000 divine verses).[70][71] Later medieval period The Bhakti movement of late medieval Hinduism started in the 7th century, but rapidly expanded after the 12th century.[72] It was supported by the Puranic literature such as the Bhagavata Purana, poetic works, as well as many scholarly bhasyas and samhitas.[73][74][75] This period saw the growth of Vaishnava sampradayas (denominations or communities) under the influence of scholars such as Ramanuja, Nimbarka, Madhva and Vallabha.[76] Bhakti poets or teachers such as Manavala Mamunigal, Namdev, Ramananda, Sankardev, Surdas, Tulsidas, Eknath, Tyagaraja, Chaitanya Mahaprabhu and many others influenced the expansion of Vaishnavism. Mirabai was also part of this movement.[77][78][79] These scholars rejected Shankara's doctrines of Advaita Vedanta, particularly Ramanuja in the 12th century, and Vedanta Desika and Madhva in the 13th century, building their theology on the devotional tradition of the Alvars (Sri Vaishnavas).[80] In North and Eastern India, Vaishnavism gave rise to various late Medieval movements such as Ramananda in the 14th century, Sankaradeva in the 15th and Vallabha and Chaitanya in the 16th century. Historically, it was Chaitanya Mahaprabhu who founded congregational chanting of holy names of Krishna in the early 16th century after becoming a sannyasi.[81] Modern times During the 20th century, Vaishnavism spread from India and is now practised in many places around the globe, including North America, Europe, Africa, Russia and South America. A pioneer of Vaishnavite mission to the West was sannyasi Baba Premananda Bharati (1858–1914), the author of the first full-length treatment of Bengali Vaishnavism in English, Sree Krishna—the Lord of Love. He founded the \"Krishna Samaj\" society in New York City in 1902 and a temple in Los Angeles.[82] The global status of Vaishnavism is largely due to the growth of the ISKCON movement, founded by A. C. Bhaktivedanta Swami Prabhupada in 1966.[83][84][85] Beliefs Theism with many varieties Vaishnavism is centred on the devotion of Vishnu and his avatars. According to Schweig, it can be \"characterized as a polymorphic monotheism, i.e. a theology that recognises many forms (ananta rupa) of the one, single unitary divinity,\" since there are many forms of one original deity, with Vishnu taking many forms.[86] In contrast, Okita states that the different denominations within Vaishnavism are best described as theism, pantheism and panentheism.[87] The Vaishnava sampradaya started by Madhvacharya is a monotheistic tradition in which Vishnu (Krishna) is omnipotent, omniscient and omnibenevolent.[88] The Sri Vaishnavism sampradaya associated with Ramanuja also has monotheistic elements, but differs in several ways, such as goddess Lakshmi and god Vishnu are considered inseparable and equal divinities.[89] According to some scholars, Sri Vaishnavism emphasises panentheism, and not monotheism, with a theology of \"transcendence and immanence\",[90][91] in which God interpenetrates everything in the universe, and empirical reality is God's body.[92][93] The Vaishnava sampradaya associated with Vallabhacharya is a form of pantheism, in contrast with other Vaishnavism traditions.[94] According to Schweig, the Gaudiya Vaishnava tradition of Chaitanya is closer to a \"polymorphic bi-monotheism\" because both goddess Radha and god Krishna are simultaneously regarded as supreme.[95] Vaishnavism includes the doctrine of avatar (divine incarnation), wherein Vishnu incarnates numerous times, in different forms, to restore cosmic order.[96][97][98] These avatars include Narayana, Vasudeva, Rama, and Krishna; with each associated tradition regarding one of them as supreme.[99] Vishnuism and Krishnaism The term \"Krishnaism\" (Kṛṣṇaism) has been used by scholars to describe a large group of independent traditions (sampradayas) within Vaishnavism that regard Krishna as the Supreme God, while \"Vishnuism\" may be used for sects that focus on Vishnu and see Krishna as an Avatar rather than a transcended Supreme Being.[100][5] While most Vaishnava traditions recognise Krishna as an avatar of Vishnu, only Krishna-centred traditions identify the Supreme Being (Svayam Bhagavan, Brahman, the source of the Trimurti) with Krishna and his forms (Radha Krishna, Vithoba and others). This is its difference from such groups as Ramaism, Radhaism, Sitaism, etc.[4][101] Vishnu In Vishnu-centred sects, Vishnu (Narayana) is regarded as the one supreme God. Texts such as the Epics and Puranas describe Vishnu as the source of many incarnations (avatars), through which his supremacy is expressed. Other deities such as Shiva, Ganesha, Surya, or Durga are acknowledged, but are understood as subordinate.[102] To the devotees of Sri Vaishnava Sampradaya, \"Lord Vishnu is the Supreme Being and the foundation of all existence.\"[103] Lakshmi, his consort, is described to act as the mediatrix between Vishnu and his devotees, intervening to offer her grace and forgiveness.[102][104] According to Vedanta Desika, the divine couple Lakshmi Narayana pervade and transcend the universe, which is described to be their body. They are described to support all life, both material and spiritual.[105] In this theology, Lakshmi is conceived as the supreme mother and Narayana as the supreme father of creation.[106] Krishna In the Krishna-centred Vaishnavism traditions, such as the Nimbarka Sampradaya (the first Krishnaite Sampradaya attributed to Nimbarka), Ekasarana Dharma, Gaudiya Vaishnavism, Mahanubhava, Rudra Sampradaya (Pushtimarg), Vaishnava-Sahajiya, and Warkari, Krishna is worshipped as the One Supreme form of God and source of all avatars, Svayam Bhagavan.[4][108] Krishnaism is often also called Bhagavatism—perhaps the earliest Krishnite movement centred on Krishna-Vasudeva (about 2nd century BCE).[49] The Bhagavata Purana asserts Krishna as \"Bhagavan Himself,\" and subordinates to itself all other forms: Vishnu, Narayana, Purusha, Ishvara, Hari, Vasudeva, Janardana etc.[109] Krishna is often described as dark-skinned and depicted as a young cowherd boy playing a flute or as a youthful prince giving philosophical direction and guidance, as in the Bhagavad Gita.[110] His stories appear across a wide range of Hindu traditions, where it is believed that God appears to his devoted worshippers in many different forms, depending on their particular desires.[111][112] Radha Krishna Radha Krishna is the combination of both the feminine as well as the masculine aspects of God. Krishna is often referred as Svayam bhagavan in Gaudiya Vaishnavism theology and Radha is Krishna's internal potency and supreme beloved.[113] With Krishna, Radha is acknowledged as the supreme goddess, for it is said that she controls Krishna with her love.[114] It is believed that Krishna enchants the world, but Radha enchants even him. Therefore, she is the supreme goddess of all.[115][116] Radha and Krishna are avatars of Lakshmi and Vishnu respectively. In the region of India called Braj, Radha and Krishna are worshipped together, and their separation cannot even be conceived. And, some communities ascribe more devotional significance to Radha.[117] While there are much earlier references to the worship of this form of God, it is since Jayadeva wrote the poem Gita Govinda in the twelfth century CE, that the topic of the spiritual love affair between the divine Krishna and his consort Radha, became a theme celebrated throughout India.[118] It is believed that Krishna has left the \"circle\" of the rasa dance to search for Radha. The Chaitanya school believes that the name and identity of Radha are both revealed and concealed in the verse describing this incident in Bhagavata Purana.[119] It is also believed that Radha is not just one cowherd maiden, but is the origin of all the gopis, or divine personalities that participate in the rasa dance.[120] Avatars According to The Bhagavata Purana, there are twenty-two avatars of Vishnu, including Rama and Krishna. The Dashavatara is a later concept.[47] Vyuhas The Pancaratrins follow the vyuhas doctrine, which says that God has four manifestations (vyuhas), namely Vasudeva, Samkarsana, Pradyumna, and Aniruddha. These four manifestations represent \"the Highest Self, the individual self, mind, and egoism.\"[47] Restoration of dharma Vaishnavism theology has developed the concept of avatar (incarnation) around Vishnu as the preserver or sustainer. His avataras, asserts Vaishnavism, descend to empower the good and fight evil, thereby restoring dharma. This is reflected in the passages of the ancient Bhagavad Gita as:[121][122] Whenever righteousness wanes and unrighteousness increases I send myself forth. For the protection of the good and for the destruction of evil, and for the establishment of righteousness, I come into being age after age. In Vaishnava theology, such as is presented in the Bhagavata Purana and the Pancaratra, whenever the cosmos is in crisis, typically because the evil has grown stronger and has thrown the cosmos out of its balance, an avatar of Vishnu appears in a material form, to destroy evil and its sources, and restore the cosmic balance between the everpresent forces of good and evil.[121][98] The most known and celebrated avatars of Vishnu, within the Vaishnavism traditions of Hinduism, are Krishna, Rama, Narayana and Vasudeva. These names have extensive literature associated with them; each has its own characteristics, legends, and associated arts.[121] The Mahabharata, for example, includes Krishna, while the Ramayana includes Rama.[14] Texts The Vedas, the Upanishads, the Bhagavad Gita, and the Agamas are the scriptural sources of Vaishnavism.[25][125][126] The Bhagavata Purana is a revered and widely celebrated text, parts of which, a few scholars such as Dominic Goodall, include as a scripture.[125] Other important texts in the tradition include the Mahabharata and the Ramayana, as well as texts by various sampradayas (denominations within Vaishnavism). In many Vaishnava traditions, Krishna is accepted as a teacher whose teachings are in the Bhagavad Gita and the Bhagavata Purana.[44][note 3] Scriptures Vedas and Upanishads Vaishnavism, just like all Hindu traditions, considers the Vedas as the scriptural authority.[127][128] All traditions within Vaishnavism consider the Brahmanas, the Aranyakas and the Upanishads embedded within the four Vedas as Sruti, while Smritis, which include all the epics, the Puranas and its Samhitas, states Mariasusai Dhavamony, are considered as \"exegetical or expository literature\" of the Vedic texts.[128] The Vedanta schools of Hindu philosophy, which interpreted the Upanishads and the Brahma Sutra, provided the philosophical foundations of Vaishnavism. Due to the ancient and archaic language of the Vedic texts, interpretations varied among different schools, leading to differences between the denominations (sampradayas) of Vaishnavism.[129] These interpretations have created different traditions within Vaishnavism, from dualistic (Dvaita) Vedanta of Madhvacharya,[130] to nondualistic (Advaita) Vedanta of Madhusudana Sarasvati.[131] Axiology in a Vaishnava Upanishad The charity or gift is the armour in the world, All beings live on the gift of the other, Through gifts strangers become friends, Through gifts, they ward off difficulties, On gifts and giving, everything rests, That is why charity is the highest. Vaishnava Upanishads Along with the reverence and exegetical analysis of the ancient Principal Upanishads, Vaishnava-inspired scholars authored 14 Vishnu avatar-focussed Upanishads that are called the Vaishnava Upanishads.[134] These are considered part of 95 minor Upanishads in the Muktikā Upanishadic corpus of Hindu literature.[134][135] The earliest among these were likely composed in 1st millennium BCE, while the last ones in the late medieval era.[136][137][138] All of the Vaishnava Upanishads either directly reference and quote from the ancient Principal Upanishads or incorporate some ideas found in them; most cited texts include the Brihadaranyaka Upanishad, Chandogya Upanishad, Katha Upanishad, Isha Upanishad, Mundaka Upanishad, Taittiriya Upanishad and others.[139][140] In some cases, they cite fragments from the Brahmana and Aranyaka layers of the Rigveda and the Yajurveda.[139] The Vaishnava Upanishads present diverse ideas, ranging from bhakti-style theistic themes to a synthesis of Vaishnava ideas with Advaitic, Yoga, Shaiva and Shakti themes.[139][141] Bhagavad Gita The Bhagavad Gita is a central text in Vaishnavism, and especially in the context of Krishna.[156][157][158] The Bhagavad Gita is an important scripture not only within Vaishnavism, but also to other traditions of Hinduism.[159][160] It is one of three important texts of the Vedanta school of Hindu philosophy, and has been central to all Vaishnavism sampradayas.[159][161] The Bhagavad Gita is a dialogue between Krishna and Arjuna, and presents Bhakti, Jnana and Karma yoga as alternate ways to spiritual liberation, with the choice left to the individual.[159] The text discusses dharma, and its pursuit as duty without craving for fruits of one's actions, as a form of spiritual path to liberation.[162] The text, state Clooney and Stewart, succinctly summarises the foundations of Vaishnava theology that the entire universe exists within Vishnu, and all aspects of life and living is not only a divine order but divinity itself.[163] Bhakti, in Bhagavad Gita, is an act of sharing, and a deeply personal awareness of spirituality within and without.[163] The Bhagavad Gita is a summary of the classical Upanishads and Vedic philosophy, and closely associated with the Bhagavata and related traditions of Vaishnavism.[164][165] The text has been commented upon and integrated into diverse Vaishnava denominations, such as by the medieval era Madhvacharya's Dvaita Vedanta school and Ramanuja's Vishishtadvaita Vedanta school, as well as 20th century Vaishnava movements such as the Hare Krishna movement by His Divine Grace A. C. Bhaktivedanta Swami Prabhupada.[166] Vaishnava Agamas The Pancaratra Samhitas (literally, five nights) is a genre of texts where Vishnu is presented as Narayana and Vasudeva, and this genre of Vaishnava texts is also known as the Vaishnava Agamas.[23][24] Its doctrines are found embedded in the stories within the Narayaniya section of the Mahabharata.[167] Narayana is presented as the ultimate unchanging truth and reality (Brahman), who pervades the entirety of the universe and is asserted to be the preceptor of all religions.[167][168] The Pancaratra texts present the Vyuhas theory of avatars to explain how the absolute reality (Brahman) manifests into material form of ever changing reality (Vishnu avatar).[167][169] Vasudeva, state the Pancaratra texts, goes through a series of emanations, where new avatars of him appear. This theory of avatar formation syncretically integrates the theories of evolution of matter and life developed by the Samkhya school of Hindu philosophy.[170][169] These texts also present cosmology, methods of worship, tantra, Yoga and principles behind the design and building of Vaishnava temples (Mandira nirmana).[170][171][172] These texts have guided religiosity and temple ceremonies in many Vaishnava communities, particularly in South India.[170] The Pancaratra Samhitas are tantric in emphasis, and at the foundation of tantric Vaishnava traditions such as the Sri Vaishnava tradition.[173][174] They complement and compete with the vedic Vaishnava traditions such as the Bhagavata tradition, which emphasise the more ancient Vedic texts, ritual grammar and procedures.[173][172] While the practices vary, the philosophy of Pancaratra is primarily derived from the Upanishads, its ideas synthesise Vedic concepts and incorporate Vedic teachings.[175][176] The three most studied texts of this genre of Vaishnava religious texts are Paushkara Samhita, Sattvata Samhita and Jayakhya Samhita.[170][177] The other important Pancaratra texts include the Lakshmi Tantra and Ahirbudhnya Samhita.[24][178] Scholars place the start of this genre of texts to about the 7th or 8th century CE, and later.[170][179] Other texts Mahabharata and Ramayana The two Indian epics, the Mahabharata and the Ramayana present Vaishnava philosophy and culture embedded in legends and dialogues.[180] The epics are considered the fifth Veda in Hindu culture.[181] The Ramayana describes the story of Rama, an avatara of Vishnu, and is taken as a history of the 'ideal king', based on the principles of dharma, morality and ethics.[182] Rama's wife Sita, his brother Lakshman, with his devotee and follower Hanuman all play key roles within the Vaishnava tradition as examples of Vaishnava etiquette and behaviour. Ravana, the evil king and villain of the epic, is presented as an epitome of adharma, playing the opposite role of how not to behave.[183] The Mahabharata is centred around Krishna, presents him as the avatar of transcendental supreme being.[184] The epic details the story of a war between good and evil, each side represented by two families of cousins with wealth and power, one depicted as driven by virtues and values while other by vice and deception, with Krishna playing pivotal role in the drama.[185] The philosophical highlight of the work is the Bhagavad Gita.[186][127] Puranas The Puranas are an important source of entertaining narratives and histories, states Mahony, that are embedded with \"philosophical, theological and mystical modes of experience and expression\" as well as reflective \"moral and soteriological instructions\".[189] More broadly, the Puranic literature is encyclopedic,[190][191] and it includes diverse topics such as cosmogony, cosmology, genealogies of gods, goddesses, kings, heroes, sages, and demigods, folk tales, travel guides and pilgrimages,[192] temples, medicine, astronomy, grammar, mineralogy, humor, love stories, as well as theology and philosophy.[193][194][195] The Puranas were a living genre of texts because they were routinely revised,[196] their content is highly inconsistent across the Puranas, and each Purana has survived in numerous manuscripts which are themselves inconsistent.[197][198] The Hindu Puranas are anonymous texts and likely the work of many authors over the centuries.[197][198] Of the 18 Mahapuranas (great Puranas), many have titles based on one of the avatars of Vishnu. However, quite many of these are actually, in large part, Shiva-related Puranas, likely because these texts were revised over their history.[199] Some were revised into Vaishnava treatises, such as the Brahma Vaivarta Purana, which originated as a Puranic text dedicated to the Surya (Sun god). Textual cross referencing evidence suggests that in or after 15th/16th century CE, it went through a series of major revisions, and almost all extant manuscripts of Brahma Vaivarta Purana are now Vaishnava (Krishna) bhakti oriented.[200] Of the extant manuscripts, the main Vaishnava Puranas are Bhagavata Purana, Vishnu Purana, Nāradeya Purana, Garuda Purana, Vayu Purana and Varaha Purana.[201] The Brahmanda Purana is notable for the Adhyatma-ramayana, a Rama-focussed embedded text in it, which philosophically attempts to synthesise Bhakti in god Rama with Shaktism and Advaita Vedanta.[202][203][204] While an avatar of Vishnu is the main focus of the Puranas of Vaishnavism, these texts also include chapters that revere Shiva, Shakti (goddess power), Brahma and a pantheon of Hindu deities.[205][206][207] The philosophy and teachings of the Vaishnava Puranas are bhakti oriented (often Krishna, but Rama features in some), but they show an absence of a \"narrow, sectarian spirit\". To its bhakti ideas, these texts show a synthesis of Samkhya, Yoga and Advaita Vedanta ideas.[208][209][210] In Gaudiya Vaishnava, Vallabha Sampradaya and Nimbarka sampradaya, Krishna is believed to be a transcendent, Supreme Being and source of all avatars in the Bhagavata Purana.[211] The text describes modes of loving devotion to Krishna, wherein his devotees constantly think about him, feel grief and longing when Krishna is called away on a heroic mission.[212] Practices Bhakti The Bhakti movement originated among Vaishnavas of South India during the 7th-century CE,[214] spread northwards from Tamil Nadu through Karnataka and Maharashtra towards the end of 13th-century,[215] and gained wide acceptance by the fifteenth-century throughout India during an era of political uncertainty and Hindu-Islam conflicts.[216][217][218] The Alvars, which literally means \"those immersed in God\", were Vaishnava poet-saints who sang praises of Vishnu as they travelled from one place to another.[219] They established temple sites such as Srirangam, and spread ideas about Vaishnavism. Their poems, compiled as Divya Prabhandham, developed into an influential scripture for the Vaishnavas. The Bhagavata Purana's references to the South Indian Alvar saints, along with its emphasis on bhakti, have led many scholars to give it South Indian origins, though some scholars question whether this evidence excludes the possibility that bhakti movement had parallel developments in other parts of India.[220][221] Vaishnava bhakti practices involve loving devotion to a Vishnu avatar (often Krishna), an emotional connection, a longing and continuous feeling of presence.[222] All aspects of life and living is not only a divine order but divinity itself in Vaishnava bhakti.[163] Community practices such as singing songs together (kirtan or bhajan ), praising or ecstatically celebrating the presence of god together, usually inside temples, but sometimes in open public are part of varying Vaishnava practices.[223] Early Vaishnava practices noted by Patanjali also included festive gatherings in temples with musical instruments.[224] Other practical methods includes devotional practices such as chanting mantras (japa), performing rituals, and engaging in acts of service (seva) within the community.[225] These help Vaishnavas socialise and form a community identity.[226] Tilaka Vaishnavas mark their foreheads with tilaka made up of Chandana, either as a daily ritual, or on special occasions. The different Vaishnava sampradayas each have their own distinctive style of tilaka, which depicts the siddhanta of their particular lineage. The general tilaka pattern is of a parabolic shape resembling the letter U or two or more connected vertical lines on and another optional line on the nose resembling the letter Y, in which the two parallel lines represent the Lotus feet of Krishna and the bottom part on the nose represents the tulsi leaf.[230][231] Initiation In tantric traditions of Vaishnavism, during the initiation (diksha) given by a guru under whom they are trained to understand Vaishnava practices, the initiates accept Vishnu as supreme. At the time of initiation, the disciple is traditionally given a specific mantra, which the disciple will repeat, either out loud or within the mind, as an act of worship to Vishnu or one of his avatars. The practice of repetitive prayer is known as japa. In the Gaudiya Vaishnava group, one who performs an act of worship with the name of Vishnu or Krishna can be considered a Vaishnava by practice, \"Who chants the holy name of Krishna just once may be considered a Vaishnava.\"[232] Pilgrimage sites Important sites of pilgrimage for Vaishnavas include Guruvayur Temple, Srirangam, Kanchipuram, Vrindavan, Mathura, Ayodhya, Tirupati, Pandharpur (Vitthal), Puri (Jaggannath), Nira Narsingpur (Narasimha), Mayapur, Nathdwara, Dwarka, Udipi (Karnataka), Shree Govindajee Temple (Imphal), Govind Dev Ji Temple (Jaipur) and Muktinath.[233][234] Holy places Vrindavana is considered to be a holy place by several traditions of Krishnaism. It is a centre of Krishna worship and the area includes places like Govardhana and Gokula associated with Krishna from time immemorial. Many millions of bhaktas or devotees of Krishna visit these places of pilgrimage every year and participate in a number of festivals that relate to the scenes from Krishna's life on Earth.[44][note 5] On the other hand, Goloka is considered the eternal abode of Krishna, Svayam bhagavan according to some Vaishnava schools, including Gaudiya Vaishnavism and the Swaminarayan Sampradaya. The scriptural basis for this is taken in Brahma Samhita and Bhagavata Purana.[235] Traditions The Vaishnavism traditions may be grouped within four sampradayas, each exemplified by a specific Vedic personality. They have been associated with a specific founder, providing the following scheme: Sri Sampradaya (Ramanuja), Brahma Sampradaya (Madhvacharya),[236] Rudra Sampradaya (Vishnuswami, Vallabhacharya),[237] Kumaras Sampradaya (Nimbarka).[238][note 6] These four sampradayas emerged in early centuries of the 2nd millennium CE, by the 14th century, influencing and sanctioning the Bhakti movement.[76] The philosophical systems of Vaishnava sampradayas range from qualified monistic Vishishtadvaita of Ramanuja, to theistic Dvaita of Madhvacharya, to pure nondualistic Shuddhadvaita of Vallabhacharya. They all revere an avatar of Vishnu, but have varying theories on the relationship between the soul (jiva) and Brahman,[189][241] on the nature of changing and unchanging reality, methods of worship, as well as on spiritual liberation for the householder stage of life versus sannyasa (renunciation) stage.[18][19] Beyond the four major sampradayas, the situation is more complicated,[242] with the Vaikhanasas being much older[243] than those four sampradayas, and a number of additional traditions and sects which originated later,[244] or aligned themselves with one of those four sampradayas.[239] Krishna sampradayas continued to be founded late into late medieval and during the Mughal Empire era, such as the Radha Vallabh Sampradaya, Haridasa, Gaudiya and others.[245] Traditions List Early traditions Bhagavats The Bhagavats were the early worshippers of Krishna, the followers of Bhagavat, the Lord, in the person of Krishna, Vasudeva, Vishnu or Bhagavan.[253] The term bhagavata may have denoted a general religious tradition or attitude of theistic worship which prevailed until the 11th century, and not a specific sect,[243][254] and is best known as a designation for Vishnu-devotees.[254] The earliest scriptural evidence of Vaishnava bhagavats is an inscription from 115 BCE, in which Heliodoros, ambassador of the Greco-Bactrian king Amtalikita, says that he is a bhagavata of Vasudeva.[255] It was supported by the Guptas, suggesting a widespread appeal, in contrast to specific sects.[253] Pancaratra The Pāñcarātra is the tradition of Narayana-worship.[167] The term pāñcarātra means \"five nights,\" from pañca, \"five,\"and rātra, \"nights"
}