{
  "url": "https://fermacorp.com/",
  "title": "FERMA Corporation - World Class Engineering & Demolition",
  "text": "FERMA Corporation is an innovative Demolition and Environmental Contractor serving all of California. Our management team has 100+ years of combined experience in planning, managing, and executing the most complex, large-scale demolition, environmental remediation, asset recovery, and hazardous material abatement projects in the public and private sector. Established in 1963, FERMA Corporation provides our clients with the knowledge, expertise, certification, and resources to complete each project safely and proficiently. Our demolition and environmental remediation services include hazardous material abatement and remediation, demolition, dismantling, deconstruction, site preparation, asset recovery, and disaster relief. To accomplish this, we employ over 400 core team members and maintain a large fleet of heavy equipment with specialized attachments. FERMA Corporation provides comprehensive demolition services for governmental entities and NGOs. Our track record is unparalleled in completing projects on time, within budget, and without incidents regardless of the complexity or size of the operations. Our estimating and engineering team has a broad range of experience. We apply that practical knowledge to design precise plans to meet your needs. We begin with thorough project assessments and develop precise specifications that best meet the needs of each unique activity. In every phase, we strive to exceed our client’s expectations. “I extend an extra thank you to the FERMA family. You guys really are a Class-A operation. All your crews made it a priority to work safe and be open to suggestions… The great attitudes and commitment to safety are what helped make this project so successful. We performed some very technical and tricky demolition maneuvers out here with no incidents…. I definitely look forward to working with you again.” “I wanted to personally say Thank You for all you have done… Demolition has gone smoothly and without any major issues. Thank You!! Well done FERMA team! We could not have done this without you ALL. We appreciate everyone’s dedication to the demolition.”"
}