{
  "url": "https://www.hobbylobby.com/home-decor-frames/mirrors-wall-decor/wall-art/c/3-109-1053",
  "title": "Wall Art | Canvas Prints & Framed Art | Hobby Lobby",
  "text": "Southwestern Flowers Framed Canvas Wall Decor price: $46.99Field Of Daisies Wood Wall Decor price: $24.99White Flower Metal Wall Decor price: $19.99Distressed Paint Bouquet Canvas Wall Decor price: $36.99Fallen Roses Canvas Wall Decor price: $25.99Lakeside View Wood Wall Decor price: $54.99Vintage Castle Canvas Wall Decor price: $91.99White Flowers By The Barn Framed Wall Decor price: $64.99Fallen Roses Canvas Wall Decor price: $14.99Painted Landscape Framed Wall Decor price: $24.99Comforting Horses Canvas Wall Decor price: $49.99Ink Drawn Flowers Framed Wall Decor price: $32.99 Wall Art, Decor & Canvas Art Prints Complement the look of your room theme with wall art from Hobby Lobby. Use black and neutral tones to create a modern arrangement in your living room or dining room. Modern wall art is filled with geometric patterns and minimal shapes, while a boho theme consists of wall baskets and natural elements. Elevate Your Space’s Aesthetic With Complementary Pieces Display your boho wall art in the sun room or in your living room for a look filled with texture and interesting colors. Farmhouse wall art can be used to pair modern and vintage themes to give your kitchen a look. Use greens and blues to bring out a softer feel, or use metal accent pieces to showcase a modern industrial theme. Pair rustic wall art and landscape wall art for a coordinated arrangement that will look great in any season! Enhance the look of your kid’s room by pairing wall decor featuring Pokemon and Minecraft with animal wall art. Use your little one’s favorite character or super hero to create a fun theme. Spider-Man wall art or Star Wars wall art will do the trick! Retro wall art and flower wall art will make a totally rad combination for your teen’s room. Stylize your bathroom with nautical wall art or French country wall art to continue your theme into different parts of the house. We Have Wall Art For Any Theme Add in other wall accents such as frames and mirrors to create a gallery wall in your entryway or bedroom. Moody and abstract wall art will create a visually exciting look with a combination of colors and textures that will surely enhance the look of any space. We carry a large variety of canvas wall art that will fit any theme or color combination. Use framed art and themed wall art to show your personal style. Whether you like a minimal or eclectic theme, Hobby Lobby has wall art for you! Frequently Asked Questions Does Hobby Lobby sell wall art? Yes! Hobby Lobby sells a variety of wall art, including paintings, tapestries, metal posters, and more. Shop our wide selection to find wall decor that will fit your space’s aesthetic, whether it is farmhouse, modern, vintage, or another decor style. How to hang wall art without nails? You can hang lightweight wall art with command strips, command hooks, or washi tape. These options may not work if your art is too large or heavy. How to hang wall art? First, determine where you want to hang your art and identify the attached hanging hardware. Then, mark the spot you want to hang your piece. Finally, use nails, screws, or command strips to mount it on the wall. You can make sure your piece is correctly positioned using a level. What is the correct size for wall art? The 2/3 rule is a general guideline for sizing wall art. It states that artwork should fill around 2/3 of the empty wall space it is on. Alternatively, the piece should measure about 2/3 the width of the furniture it is displayed above. This rule applies to individual artwork and to multiple art pieces displayed together. How much is too much wall art? To prevent a wall from looking cluttered, be sure to leave blank spaces between art pieces. Generally, keeping art at around eye level and covering no more than sixty percent of a wall will keep your space looking well-ordered."
}