{
  "url": "https://dictionary.cambridge.org/dictionary/english/no",
  "title": "NO | English meaning - Cambridge Dictionary",
  "text": "no determiner uk /nəʊ/ us /noʊ/A1 not any; not one; not a: - I see no reason for us to depart from our usual practice. - I certainly have no desire to have children. - The opposition party have been in such disorder for so long that they pose no real threat to the present government. - I can see no useful purpose in continuing this conversation. - She repeated that she had no intention of standing for president. - across-the-board - anything - anything and everything - aught - bazillion - fat - lock - lock, stock, and barrel idiom - matter - more/greater/bigger etc. than the sum of its parts idiom - net zero - nil - shit - sod all - sold - something - squat - summat - the lot of them, you, it - zero You can also find related words, phrases, and synonyms in the topics: Grammar no adverb uk /nəʊ/ us /noʊ/no adverb (NEGATIVE ANSWER) no adverb (NOT) B1 not; not any: - He's in no condition to drive home. - It's an issue we'll have to confront at some point, no matter how unpleasant it is. - She could no longer contain her anger and shouted at him uncontrollably. - Now aged 42, he is no longer considered a serious contender for the title. - His work is no longer protected by copyright. - amirite - devil - extent - how about...? idiom - how, what, why, etc. on earth... idiom - how-to - question tag - trick - what is someone/something like? idiom - what's something in aid of? idiom - what's that (all) about (then)? idiom - what's the score? idiom - what/where/how/why the devil idiom - when - whenever - where - wherefore - which - why - world Compare - a sure thing idiom - affirmation - affirmatively - ain't - betcha - bit - course - didn't - does a bear/do bears shit in the woods? idiom - far - hardly - means - nah - opposed - self-negating - slight - sure - wasn't - weren't - you bet idiom You can also find related words, phrases, and synonyms in the topics:"
}