{
  "url": "https://forum.wordreference.com/threads/if-you-prefer-preferred-id-be-happy-to-pick-you-up.2708677/",
  "title": "If you prefer/preferred, I'd be happy to pick you up | WordReference Forums",
  "text": "Hi, Amber. I came in late, so in this post I'm going to address only your first question, as in #1 above. I would not use the \"-ed\" form that you are calling the past tense (instead of past tense, I would say that it's a remnant of the subjunctive mood in English). I might even say that the \"-ed\" form is a hypercorrection. Let's see if I can explain why. There is a formula for a two-clause conditional sentence whose structure is \"If A, then B\"—in which A is a contrary-to-fact clause in the subjunctive, and B is in the conditional (meaning that it is formed with \"would\"). I guess this is what you experts call the \"second conditional\". For example, \"If I had a million dollars [contrary to fact: it's understood that I do not have the $$], I would give you half of it.\" (It's easy to offer when it's unreal. ) The form of the subjunctive is almost always identical to that of the past tense (\"I had a million dollars [yesterday]\", \" If I had a million dollars [I would give...]\"; \"I saw a ghost\", \" If I saw a ghost\"). I think the only place where it differs from the past tense is in the verb \"to be\": \"I was rich\", \" If I were rich\". Now to your sentence: In \"I'd be happy to pick you up\", the \" 'd\" is certainly a contraction for \"would\". So it seems to fit the formula \"If A, then [conditional] B\", as above, where A calls for the subjunctive \"-ed\" form. But the problem is that the if-clause is not contrary to fact. We are not saying \"If you preferred [= in the hypothetical case that you preferred, but I know you do not prefer]\". It's not the same as saying \"If you didn't have a car [but I know you do have a car; in that contrary-to-fact, hypothetical case that you didn't have one...], I would be glad to pick you up.\" So, you might ask, if it's not \"If [contrary-to-fact subjunctive], then [conditional with 'would']\", what is the contracted \"would\" doing in the sentence? My answer: I think \"I'd be glad to\" has become such a formula in itself—meaning \"I am willing to\" or \"I am prepared to\"—that its \"would\" no longer can be interpreted as a conditional. It is certainly not dependent on having an expressed \"if\" condition. \"I'd be happy to hold your umbrella\" means simply \"I hereby offer to hold your umbrella\"—unconditionally. This was a challenging question. I hope I have explained my view clearly. I agree with london in #2, that \"I'll be happy to...\" might be better, simply because it eliminates the question of \"would\". But people do say \"I'd be happy to...\" (and it's not conditional). To bennymix's final question in #7, I would say \"If you prefer\" implies \"I don't know whether you prefer\" (which I think fits the situation of the dialog), but \"If you preferr ed\" implies \"I know you don't prefer; in the counterfactual (hypothetical) situation where you did prefer, I would offer...\""
}