{
  "url": "https://mychart.mountsinai.org/mychart/signup",
  "title": "MyMountSinai - Sign Up",
  "text": "Sign Up Patient information We need some information from you in order to grant you a MyMountSinai account. Once you are approved, you will be taken to a web page where you can choose your MyMountSinai username and password. Please note that MyMountSinai Self Signup is only available for current Mount Sinai patients that are 18 years of age or older. Please add donotreply@mountsinai.org to your safe senders list in order to receive MyMountSinai notifications in your email. Indicates a required field Follow these steps to sign up for a MyMountSinai account. - Enter your personal information. - Verify your contact information. - Choose a username and password. If you have any questions, please contact us at 1-855-343-3470. Follow these steps to sign up for a MyMountSinai account. - Enter your personal information. - Verify your identity. - Choose a username and password. If you have any questions, please contact us at 1-855-343-3470. We need some information from you in order to grant you a MyMountSinai account. Once you are approved, you will be taken to a web page where you can choose your MyMountSinai username and password. Please note that MyMountSinai Self Signup is only available for current Mount Sinai patients that are 18 years of age or older. Please add donotreply@mountsinai.org to your safe senders list in order to receive MyMountSinai notifications in your email. Indicates a required field Complete the missing information below to finish signing up for a MyMountSinai account. If you have any questions, please contact us at 1-855-343-3470. In order to grant you a MyMountSinai account, we will verify your identity using questions from a third-party verification system. Once verified, you will be able to create your MyMountSinai account. If you have any questions, please contact your clinic. We are checking with a third-party system to verify your identity. This may take several seconds. In order to grant you a MyMountSinai account, we will verify your identity using questions from a third-party verification system. Once verified, you will be able to create your MyMountSinai account. If you have any questions, please contact your clinic. Unable to Verify Your Identity We are unable to verify your identity using the information provided. Please telephone your Provider's office to inquire about obtaining a MyChart activation code. Unable to Verify Your Identity We are unable to verify your identity using the information provided. Please telephone your Provider's office to inquire about obtaining a MyChart activation code. In order to grant you a MyMountSinai account, we will verify your identity using questions from a third-party verification system. Once verified, you will be able to create your MyMountSinai account. If you have any questions, please contact your clinic. These questions are generated by a third-party system to verify your identity. How would you like to verify your identity? You can use a third-party verification system to verify your identity now and save time at the clinic later.Select Skip third-party verification to verify your identity at your next appointment. You'll still need to confirm your contact information using a one-time code on the next page. You will be redirected in a few seconds."
}