{
  "url": "https://play.google.com/store/apps/details?id=org.scratch&hl=en-US",
  "title": "Scratch - Apps on Google Play",
  "text": "Joel Bunyan - Flag inappropriate - Show review history Had a few accounts in the past, they all got deleted. No explanation, nothing. I followed community guidelines, had a safe password, yet it still happened. I tired logging back into them but it either said \"this password is false\" or \"this account has been deleted\" and I never deleted it. All of my projects are now gone forever, can never get them back. If this happens another time I will not being using Scratch ever again. I wish I could give it a good review, it is a great app besides that. 449 people found this review helpful Harvey - Flag inappropriate - Show review history Computer user. Really good for 2D games and maybe top down scrolling RPG games. A suggestion though, would love a 3D game creator. I know people have made 3D games, but they're really complicated and smaller than what they could be. I know this was probably intended for learning, but just having a 3D creator would be awesome. This could work with stuff like camera angles, 1st and 3rd person views like that. Maybe some extra blocks could do, camera, chunk generator, and a 3D modeling screen. 705 people found this review helpful A Google user - Flag inappropriate - Show review history It's a great app, convenient and fun to mess around while on the go or without access to the website, but it's so dang hard to touch or edit costumes on a phone with my fingers. I hope you'll fix this soon, because I wanna keep using the mobile app! Edit: Well, I guess it makes sense it's for tablets and such, it's a good app then because you'd be using mouse and keyboard anyways! 4,657 people found this review helpful Scratch Foundation March 9, 2020 Thanks for your suggestion. This version of Scratch is designed for tablets and chromebooks, not phones. Phones are not compatible and should be prevented from installing by the Play store."
}