{
  "url": "https://techcommunity.microsoft.com/category/content_management/blog/spblog",
  "title": "Microsoft SharePoint Blog | Microsoft Community Hub",
  "text": "Recent Blogs The way work gets done continues to evolve. Across organizations, everyday tasks are moving beyond manual handoffs toward intelligent, connected workflows where AI helps coordinate activity and ... Jan 29, 20263.6KViews 2likes 1Comment For nearly 25 years, SharePoint has powered how organizations connect, collaborate, and manage knowledge at scale. Today, more than a billion people rely on SharePoint every month to store content, s... Jan 14, 20263.2KViews 6likes 0Comments If you’ve ever found yourself asking Copilot the same questions about the same set of files - project plans, meeting notes, specs, decks - you’re going to love Agents in OneDrive. Dec 15, 20252.4KViews 2likes 2Comments 2 MIN READ In the AI era, long-term content is no longer just a compliance overhead – it’s a strategic asset. From completed project sites in SharePoint to legacy records, organizations are increasingly require... Dec 11, 20251.1KViews 3likes 0Comments We are excited to share a new episode on our partner showcase series focused on SharePoint in Microsoft 365. In this post, we focus on Lightning Tools which is providing a set of additional feat... Dec 09, 2025908Views 1like 0Comments We are excited to share a new episode on our partner showcase series focused on SharePoint in Microsoft 365. In this post, we focus on Ichicraft - Personalized dashboards for Microsoft 365. Nov 26, 2025895Views 1like 0Comments Content Security Policy (CSP) is a critical browser security feature designed to protect web applications. SharePoint Online is rolling out CSP enforcement for all tenants starting March 1, 2026... Nov 25, 20255.9KViews 1like 28Comments Dentsu, a global leader in media and creative services, faced mounting challenges in managing the exponential growth of digital assets across its organization. With creativity and collaboration at th... Nov 18, 2025281Views 0likes 0Comments Microsoft Ignite is where innovation meets impact, and this year, SharePoint is front and center leading the next wave of digital and agentic transformation. With over 1,800 tenants already embracing... Nov 18, 202517KViews 5likes 5Comments At Microsoft Ignite 2025 today, we’re excited to announce innovations that empower customers to get ready to deploy Copilot with SharePoint Advanced Management (SAM) capabilities natively in Microsof... Nov 18, 20254.1KViews 3likes 0Comments Resources Tags - developer243 Topics - product updates190 Topics - the intrazone132 Topics - tips & tricks115 Topics - intelligent intranet93 Topics - announcements79 Topics - sharepoint71 Topics - Document Processing56 Topics - apis55 Topics - PnP51 Topics"
}