{
  "url": "https://en.wikipedia.org/wiki/Boogie-woogie",
  "title": "Boogie-woogie - Wikipedia",
  "text": "Boogie-woogie Boogie-woogie also known as boogie is a genre of blues music that became popular during the late 1920s, but already developed in African-American communities since the 1870s.[1] It was eventually extended from piano to piano duo and trio, guitar, big band, country and western, and gospel. While standard blues traditionally expresses a variety of emotions, boogie-woogie is mainly dance music[2] (although not usually played for the competitive dance known as boogie-woogie, a term of convenience in that sport). The genre had a significant influence on rhythm and blues and rock and roll. In Texas a piano style arose known as \"fast western,\" often credited as the origin of boogie-woogie. The basic boogie-woogie rhythm, which was an outgrowth of ragtime and rural blues, intentionally evoked the rhythmic clacking of steam locomotives throughout the Deep South.[3] Musical scholars and researchers claim that African American piano players would travel up and down the turpentine camps and entertain workers after a long hard day with upbeat blues within bars. This is where boogie-woogie piano music was further refined and variegated.[4] Boogie-woogie waned in popularity in the 1930s, but enjoyed a resurgence and its greatest acclaim in the 1940s, reaching audiences around the world. Among its most famous acts was the \"Boogie-Woogie Trio\" of Pete Johnson, Albert Ammons, and Meade \"Lux\" Lewis. Other popular boogie-woogie pianists of this peak era were Maurice Rocco and Freddie Slack. There were also many very notable women boogie-woogie pianists during this time, including Hadda Brooks, Winifred Atwell, Martha Davis, and Hazel Scott, as well as in later years, such as Katie Webster. Musical features [edit]Boogie-woogie is characterized by a regular left-hand bass figure, which is transposed following the chord changes. Boogie-woogie is not strictly a solo piano style; it can accompany singers and be featured in orchestras and small combos. It is sometimes called \"eight to the bar\", as much of it is written in common time (4 4) time using eighth notes (quavers) (see time signature). The chord progressions are typically based on I–IV–V–I (with many formal variations of it, such as I/i–IV/iv–v/I, as well as chords that lead into these ones). For the most part, boogie-woogie tunes are twelve-bar blues, although the style has been applied to popular songs such as \"Swanee River\" and hymns such as \"Just a Closer Walk with Thee\". Typical boogie-woogie bassline: History [edit]1870s–1930s [edit]Several African terms have been suggested as having some interesting linguistic precursors to \"boogie\": Among them are the: - Hausa word \"Boog\", and - Mandingo word \"Booga\" (both of which mean \"to beat\", as in beating a drum) - West African word \"Bogi\" (which means \"to dance\")[5] - Bantu term \"Mbuki Mvuki\" (Mbuki: \"to take off in flight\"; Mvuki: \"to dance wildly, as if to shake off one's clothes\").[6] The African origin of these terms is consistent with the African-American origin of the music. In sheet music literature prior to 1900, there are at least three examples of the word \"boogie\" in music titles in the archives of the Library of Congress.[7] In 1901, \"Hoogie Boogie\" appeared in the title of published sheet music, the first known instance where a redoubling of the word \"Boogie\" occurs in the title of published music. (In 1880, \"The Boogie Man\" had occurred as the title of published music.) The first use of \"Boogie\" in a recording title appears to be a \"blue cylinder\" recording made by Edison of the \"American Quartet\" performing \"That Syncopated Boogie Boo\" in 1913.[8] The Oxford English Dictionary states that the word is a reduplication of boogie, which was used for \"rent parties\" as early as 1913. \"Boogie\" next occurs in the title of Wilbur Sweatman's April 1917 recording of \"Boogie Rag\". None of these sheet music or audio recording examples contain the musical elements that would identify them as boogie-woogie. The 1919 recordings (two takes) of \"Weary Blues\" by the Louisiana Five contained the same boogie-woogie bass figure as appears in the 1915 \"Weary Blues\" sheet music by Artie Matthews. Tennison has recognized these 1919 recordings as the earliest sound recordings which contain a boogie-woogie bass figure. Blind Lemon Jefferson used the term \"Booga Rooga\" to refer to a guitar bass figure that he used in \"Match Box Blues\".[9] Jefferson may have heard the term from Huddie \"Lead Belly\" Ledbetter, who played frequently with Jefferson. Lead Belly, who was born in Mooringsport, Louisiana, and grew up in Harrison County, Texas, in the community of Leigh, said he first heard boogie-woogie piano in the Caddo Lake area of northeast Texas in 1899.[10] He said it influenced his guitar-playing. Lead Belly also said he heard boogie-woogie piano in the Fannin Street district of Shreveport, Louisiana. Some of the players he heard were Dave Alexander, who recorded for Decca in 1937 as Black Ivory King,[11] and a piano player called Pine Top (not Pine Top Smith, who was not born until 1904, but possibly Pine Top Williams or Pine Top Hill).[10][12] Lead Belly was among the first guitar-players to adapt the rolling bass of boogie-woogie piano. Texas, as the state of origin, became reinforced by Jelly Roll Morton, who said he heard the boogie piano style there early in the 20th century, as did Leadbelly and Bunk Johnson, according to Rosetta Reitz.[13] The first time the modern-day spelling of \"boogie-woogie\" was used in a title of a published audio recording of music appears to be Pine Top Smith's December 1928 recording titled \"Pine Top's Boogie Woogie\", a song whose lyrics contain dance instructions to \"boogie-woogie\".[14] The earliest documented inquiries into the geographical origin of boogie-woogie occurred in the late 1930s when oral histories from the oldest living Americans of both African and European descent revealed a broad consensus that boogie-woogie piano was first played in Texas in the early 1870s. Additional citations place the origins of boogie-woogie in the Piney Woods of northeast Texas. The first Negroes who played what is called boogie-woogie, or house-rent music, and attracted attention in city slums where other Negroes held jam sessions, were from Texas. And all the Old-time Texans, black or white, are agreed that boogie piano players were first heard in the lumber and turpentine camps, where nobody was at home at all. The style dates from the early 1870s.[1] — Elliot Paul, That Crazy American Music (1957) \"Fast Western\" connection to Marshall and Harrison County, Texas [edit]Max Harrison (in the book Jazz edited by Hentoff and McCarthy in 1959) and Mack McCormick (in the liner notes to his Treasury of Field Recordings, Vol. 2) concluded that \"Fast Western\" was the first term by which boogie-woogie was known. He stated that \"in Houston, Dallas, and Galveston—all Negro piano players played that way. This style was often referred to as a 'fast western' or 'fast blues' as differentiated from the 'slow blues' of New Orleans and St. Louis. At these gatherings the ragtime and blues boys could easily tell from what section of the country a man came, even going so far as to name the town, by his interpretation of a piece.\"[15] According to Tennison, when he interviewed Lee Ree Sullivan in Texarkana in 1986, Sullivan told him that he was familiar with \"Fast Western\" and \"Fast Texas\" as terms to refer to boogie-woogie in general, but not to denote the use of any specific bass figure used in boogie-woogie. Sullivan said that \"Fast Western\" and \"Fast Texas\" were terms that derived from the Texas Western Railroad Company of Harrison County.[16] The company was chartered on February 16, 1852, and changed its name to \"Southern Pacific\" in 1856. It built its first track from Marshall, Texas, to Swansons Landing, Texas, at Caddo Lake in 1857.[17] (This Texas-based \"Southern Pacific\" was not connected to the more well known Southern Pacific originating in San Francisco, California.) The Southern Pacific of Texas was bought by the newly formed Texas and Pacific Railway on March 21, 1872.[18] Although the Texas Western Railroad Company changed its name to Southern Pacific, Sullivan said the name \"Texas Western\" stuck among the slaves who constructed the railroad.[16] Railroad connection to Marshall and Harrison County, Texas [edit]A key to identifying the geographical area in which boogie-woogie originated is understanding the relationship of boogie-woogie music with the steam railroad, both in the sense of how the music might have been influenced by sounds associated with the arrival of steam locomotives as well as the cultural impact the sudden emergence of the railroad might have had. The railroad did not arrive in northeast Texas as an extension of track from existing lines from the north or the east. Rather, the first railroad locomotives and iron rails were brought to northeast Texas via steamboats from New Orleans via the Mississippi and Red Rivers and Caddo Lake to Swansons Landing, located on the Louisiana–Texas state line. Beginning with the formation of the Texas Western Railroad Company in Marshall, Texas, through the subsequent establishment in 1871 of the Texas and Pacific Railway company, which located its headquarters and shops there, Marshall was the only railroad hub in the Piney Woods of northeast Texas at the time the music developed. The sudden appearance of steam locomotives and the building of mainline tracks and tap lines to serve logging operations was pivotal to the creation of the music in terms of its sound and rhythm. It was also crucial to the rapid migration of the musical style from the rural barrel house camps to the cities and towns served by the Texas and Pacific Railway Company. Although the neighboring states of Arkansas, Louisiana, and Missouri would also produce boogie-woogie players and their boogie-woogie tunes, and despite the fact that Chicago would become known as the center for this music through such pianists as Jimmy Yancey, Albert Ammons, and Meade Lux Lewis, Texas was home to an environment that fostered creation of boogie-style: the lumber, cattle, turpentine, and oil industries, all served by an expanding railway system from the northern corner of East Texas to the Gulf Coast and from the Louisiana border to Dallas and West Texas.[19] Alan Lomax wrote: Anonymous black musicians, longing to grab a train and ride away from their troubles, incorporated the rhythms of the steam locomotive and the moan of their whistles into the new dance music they were playing in jukes and dance halls. Boogie-woogie forever changed piano playing, as ham-handed black piano players transformed the instrument into a polyrhythmic railroad train.[20] In the 1986 television broadcast of Britain's The South Bank Show about boogie-woogie, music historian Paul Oliver noted: Now the conductors were used to the logging camp pianists clamoring aboard, telling them a few stories, jumping off the train, getting into another logging camp, and playing again for eight hours, barrel house. In this way the music got around—all through Texas—and eventually, of course, out of Texas. Now when this new form of piano music came from Texas, it moved out towards Louisiana. It was brought by people like George W. Thomas, an early pianist who was already living in New Orleans by about 1910 and writing New Orleans Hop Scop Blues\", which really has some of the characteristics of the music that we came to know as Boogie.[5] Paul Oliver also wrote that George W. Thomas \"composed the theme of the New Orleans Hop Scop Blues—in spite of its title—based on the blues he had heard played by the pianists of East Texas.\"[21] On February 12, 2007, Oliver confirmed to John Tennison that it was Sippie Wallace who told Oliver that performances by East Texas pianists had formed the basis for George Thomas's \"Hop Scop Blues\".[22] Texas and Pacific Railway stops associated with names for boogie-woogie left-hand bass lines [edit]Early generation boogie-woogie players recognized basic boogie-woogie bass lines by geographical locations with which they associated them. Lee Ree Sullivan identified a number of these left hand bass lines for Tennison in 1986.[16] From the primitive to the complex, those identifications indicate that the most primitive form of the music was associated with Marshall, Texas—and that the left-hand bass lines grew more complex as the distance from Marshall increased. The most primitive of these left hand bass lines is the one that was called \"the Marshall\". It is a simple, four-beats-to-the-bar figure. The second-most primitive bass-line, called \"the Jefferson\", is also four-beats-to-the-bar, but goes down in pitch on the last note in each four-note cycle. It has been suggested that this downturn in pitch reveals a possible New Orleans influence. Jefferson, Texas, about 17 miles north of Marshall, was the westernmost port of a steamboat route that connected to New Orleans via Caddo Lake, the Red River, and the Mississippi River.[23] The remaining bass lines rise in complexity with distance from Marshall, Texas as one would expect variations and innovations would occur as the territory in which the music has been introduced expands. Marshall and Harrison County, Texas, and the origin of boogie-woogie [edit]In January 2010, John Tennison summarized his research into the origins of boogie-woogie with the conclusion that Marshall, Texas is \"the municipality whose boundaries are most likely to encompass or be closest to the point on the map which is the geographic center of gravity for all instances of Boogie Woogie performance between 1870 and 1880\". Tennison states: Given the account of Elliot Paul, and given that Lead Belly witnessed boogie-woogie in 1899 in the Arklatex; and given the North to South migration of the Thomas family; and given the Texas & Pacific headquarters in Marshall in the early 1870s; and given that Harrison County had the largest slave population in the state of Texas; and given the fact that the best-documented and largest-scale turpentine camps in Texas did not occur until after 1900 in Southeast Texas, it is most probable that boogie-woogie spread from Northeast to Southeast Texas, rather than from Southeast to Northeast Texas, or by having developed diffusely with an even density over all of the Piney Woods of East Texas. It would not be surprising if there was as yet undiscovered evidence of the earliest boogie-woogie performances buried (metaphorically or literally) in Northeast Texas. On May 13, 2010, the Marshall City Commission enacted an official declaration naming Marshall as the \"birthplace\" of boogie-woogie music, and embarked on a program to encourage additional historical research and to stimulate interest in and appreciation for the early African-American culture in northeast Texas that played a vital role in creating boogie-woogie music.[24] \"Birthplace of Boogie Woogie\" was registered by the Marshall Convention and Visitors on June 21, 2011. Development of modern boogie-woogie [edit]A song titled \"Tin Roof Blues\" was published in 1923 by the Clarence Williams Publishing Company. Compositional credit is given to Richard M. Jones. The Jones composition uses a boogie bass in the introduction with some variation throughout. In February 1923, Joseph Samuels' Tampa Blue Jazz Band recorded the George W. Thomas number \"The Fives\" for Okeh Records, considered the first example of jazz band boogie-woogie. Jimmy Blythe's recording of \"Chicago Stomps\" from April 1924 is sometimes called the first complete boogie-woogie piano solo record. The first boogie-woogie hit was \"Pinetop's Boogie Woogie\" by Pinetop Smith, recorded in 1928 and first released in 1929. Smith's record was the first boogie-woogie recording to be a commercial hit, and helped establish \"boogie-woogie\" as the name of the style. It was closely followed by another example of pure boogie-woogie, \"Honky Tonk Train Blues\" by Meade Lux Lewis, recorded by Paramount Records (1927), first released in March 1930. The performance emulated a railroad trip, perhaps lending credence to the \"train theory\". 1930s to 1940s: Carnegie Hall and swing [edit]Boogie-woogie gained further public attention in 1938, thanks to the From Spirituals to Swing concert in Carnegie Hall promoted by record producer John Hammond.[2] The concert featured Big Joe Turner and Pete Johnson performing Turner's tribute to Johnson, \"Roll 'Em Pete\", as well as Meade Lux Lewis performing \"Honky Tonk Train Blues\" and Albert Ammons playing \"Swanee River Boogie\". \"Roll 'Em Pete\" is now considered to be an early rock and roll song. These three pianists, with Turner, took up residence in the Café Society night club in New York City where they were popular with the sophisticated set. They often played in combinations of two and even three pianos, creating a richly textured piano performance. After the Carnegie Hall concert, it was only natural for swing bands to incorporate the boogie-woogie beat into some of their music. Tommy Dorsey's band recorded an updated version of \"Pine Top's Boogie Woogie\" in 1938, which (as \"Boogie Woogie\") became a hit in 1943 and 1945,[25] and was to become the swing era's second best seller, only second to Glenn Miller's \"In the Mood\". In 1939, at the suggestion of Columbia Records producer John Hammond, Harry James recorded the singles \"Boo-Woo\" and \"Woo-Woo\" with Pete Johnson and Albert Ammons.[26] Also from 1939, the Will Bradley orchestra had a string of boogie hits such as the original versions of \"Beat Me Daddy (Eight To The Bar)\" and \"Down the Road a Piece\", both 1940, and \"Scrub Me Mamma with a Boogie Beat\", in 1941. That same year, The Andrews Sisters had a top 10 hit single with their recording of \"Boogie Woogie Bugle Boy\". The popularity of the Carnegie Hall concert meant work for many of the fellow boogie players and also led to the adaptation of boogie-woogie sounds to many other forms of music. Tommy Dorsey's band had a hit with \"T.D.'s Boogie Woogie\" as arranged by Sy Oliver, and soon there were boogie-woogie songs, recorded and printed, of many different stripes. These included most famously, in the big-band genre, the ubiquitous \"Boogie Woogie Bugle Boy\", which was revamped by Christina Aguilera as her 2006 hit, \"Candyman\".[27] Derivative forms [edit]The boogie-woogie fad lasted from the late 1930s into the early 1950s,[28] and made a major contribution to the development of jump blues and ultimately to rock and roll, epitomized by Fats Domino, Little Richard and Jerry Lee Lewis. Louis Jordan is a famous jump blues musician. Boogie-woogie is still to be heard in clubs and on records throughout Europe and North America. Big Joe Duskin displayed on his 1979 album, Cincinnati Stomp, a command of piano blues and boogie-woogie, which he had absorbed at first hand in the 1940s from Albert Ammons and Pete Johnson.[29] The trickle of what was initially called hillbilly boogie, or Okie boogie (later to be renamed country boogie), became a flood beginning around late 1945. One notable country boogie song from this period was the Delmore Brothers' \"Freight Train Boogie\". More representative examples can be found in some of the songs of Western swing pioneer Bob Wills. The hillbilly boogie period lasted into the 1950s, the last recordings of this era were made by Tennessee Ernie Ford with Cliffie Stone and his orchestra with the guitar duo Jimmy Bryant and Speedy West. Bill Haley and the Saddlemen recorded \"Sundown Boogie\" in 1952, which once again featured the guitar playing the boogie-woogie rhythm. Boogie-woogie continued in country music through the end of the 20th century. The Charlie Daniels Band (whose earlier tune \"The South's Gonna Do It Again\" uses boogie-woogie influences) released \"Boogie Woogie Fiddle Country Blues\" in 1988, and three years later in 1991 Brooks & Dunn had a hit with \"Boot Scootin' Boogie\".[30] In addition, some tradition-minded country artists, such as Asleep at the Wheel, Merle Haggard, and George Strait, incorporated boogie-woogie in their recordings. In the many styles of blues, especially Chicago blues and (more recently) West Coast blues, some pianists and guitarists were influenced by, and employed, the traditional boogie-woogie styles. Some of the earliest and most influential were Big Maceo Merriweather and Sunnyland Slim. Otis Spann and Pinetop Perkins, two of the best-known blues pianists, are boogie-woogie influenced, with the latter taking both his name and signature tune from Pinetop Smith. In Western classical music, the composer Conlon Nancarrow was also influenced by boogie-woogie, as many of his early works for player piano demonstrate. \"A Wonderful Time Up There\" is a boogie-woogie gospel song. In 1943, Morton Gould composed \"Boogie-Woogie Etude\" for classical pianist José Iturbi, who premiered and recorded it that year. Povel Ramel's first hit in 1944 was \"Johanssons boogie-woogie-vals\" where he mixed boogie-woogie with waltz. Twenty-first-century commentators have also noted the characteristics of boogie-woogie in the third variation of the second movement of Ludwig van Beethoven's Piano Sonata No. 32, written between 1821 and 1822—60 years prior to creation of the genre.[31] Boogie-Woogie Within Art: Piet Mondrian is one of many European artists who had moved to New York in 1940 to escape World War II. He was introduced to boogie-woogie music one of his first nights in New York and immediately fell in love with it, along with the city itself. Soon after he started to incorporate a little boogie-woogie into his paintings. Mondrian's appreciation grew for boogie-woogie when he started aligning his goals with the goals of it, 'the destruction of melody is the destruction of natural appearance and the construction through continuous opposition is dynamic rhythm.'[32] See also [edit]References [edit]- ^ a b Paul, Elliot, That Crazy American Music (1957), Chapter 10, p. 229. - ^ a b Du Noyer, Paul (2003). The Illustrated Encyclopedia of Music (1st ed.). Fulham, London: Flame Tree Publishing. p. 165. ISBN 1-904041-96-5. - ^ \"History of Boogie-Woogie\". Timeline of African American Music. Retrieved 2025-10-19. - ^ \"Everything You Need to Know About Boogie Woogie Piano\". MusicGurus. Retrieved 2025-10-19. - ^ a b The South Bank Show (UK television series), episode on Boogie Woogie, 1986, with commentary by Paul Oliver. - ^ They Have a Word for It: A Lighthearted Lexicon of Untranslatable Words and Phrases, by Howard Rheingold, Published 2000 by Sarabande Books. - ^ Liner Notes (p. 20), written by Jean-Christophe Averty, for CD album, Original Boogie Woogie by Claude Bolling, 1968, Universal Music S.A.S., France. - ^ \"CONTENTdm Collection : Item Viewer\". Digilib.syr.edu. Retrieved 2016-10-05. - ^ Price, Sammy, What Do They Want? (autobiography), 1990, University of Illinois Press. - ^ a b Borneman, Ernest, Chapter 2. \"Boogie Woogie\" (pp. 13–40), in Sinclair Traill and The Hon Gerald Lascelles (eds), Just Jazz, published 1957 for Peter Davies Ltd by The Windmill Press, Kingswood, Surrey, England - ^ Tomko, Gene (2020). Encyclopedia of Louisiana Musicians: Jazz, Blues, Cajun, Creole, Zydeco, Swamp Pop, and Gospel. Baton Rouge: Louisiana State University Press. p. 270. ISBN 9780807169322. - ^ Russell, Ross, \"Illuminating The Leadbelly Legend\", Down Beat, August 6, 1970, Vol. 37, No. 15 - ^ Liner Notes by Rosetta Reitz for Album: Boogie Blues: Women Sing and Play Boogie Woogie, 1983, Rosetta Records, New York. - ^ \"Home : Oxford English Dictionary\". www.oed.com. Retrieved 2020-01-17. - ^ Campbell, E. Simms Campbell, Jazzmen: The Story of Hot Jazz Told in the Lives of the Men Who Created It, 1939, Chapter 4: \"Blues\", pp. 112–113. - ^ a b c Interview with Lee Ree Sullivan, Boogie Woogie pianist, 1986, Texarkana, AR-TX, by John Tennison and Alfred Tennison, Jr. - ^ \"TEXAS WESTERN RAILROAD | The Handbook of Texas Online| Texas State Historical Association (TSHA)\". Tshaonline.org. Retrieved 2016-10-05. - ^ Werner, George C. \"Texas Western Railroad\". Handbook of Texas Online. Texas State Historical Association. Retrieved 6 April 2021. - ^ David Oliphant, Texan Jazz, University of Texas Press, 1996, p. 75. - ^ Alan Lomax, Chapter 4, \"Lonesome Whistles\", p. 170, The Land Where the Blues Began, New York: The New Press, 1993. - ^ Oliver, Paul, The Story of the Blues, London, 1969, p. 85. - ^ Interview with Paul Oliver by John Tennison, February 12, 2007. - ^ \"JEFFERSON, TX (MARION COUNTY)\". The Handbook of Texas Online. Texas State Historical Association (TSHA). Retrieved 2016-10-05. - ^ Lee Hancock, Dallas Morning News, June 18, 2010. - ^ Gilliland, John (1994). Pop Chronicles the 40s: The Lively Story of Pop Music in the 40s (audiobook). ISBN 978-1-55935-147-8. OCLC 31611854. Tape 2, side A. - ^ Levinson, Peter (1999). Trumpet Blues - The Life of Harry James. Oxford University Press. p. 60. ISBN 0-19-514239-X. - ^ \"Christina Aguilera - Candyman (Official Music Video)\". YouTube. 7 November 2009. Archived from the original on 2021-11-17. Retrieved March 31, 2021. - ^ Palmer, Robert, Deep Blues, 1981, p. 130. - ^ Russell, Tony (1997). The Blues: From Robert Johnson to Robert Cray. Dubai: Carlton Books Limited. p. 108. ISBN 1-85868-255-X. - ^ \"Brand New Man by Brooks & Dunn\". Cmt.com. 1991-01-01. Archived from the original on February 22, 2004. Retrieved 2016-10-05. - ^ Denk, Jeremy (2012). Ligeti/Beethoven (booklet). Jeremy Denk. Nonesuch Records. - ^ \"Piet Mondrian. Broadway Boogie Woogie. 1942–43 | MoMA\". The Museum of Modern Art. Retrieved 2025-10-19. Further reading [edit]- Silvester, Peter (2009) [1988]. The Story of Boogie-Woogie: A Left Hand Like God (Revised ed.). Lanham, Md.: The Scarecrow Press. ISBN 978-0-8108-6924-0. OCLC 979685923. External links [edit]- Media related to Boogie woogie at Wikimedia Commons"
}