{
  "url": "https://www.thefreedictionary.com/good",
  "title": "Good - definition of good by The Free Dictionary",
  "text": "good Also found in: Thesaurus, Medical, Legal, Financial, Acronyms, Idioms, Encyclopedia, Wikipedia. Related to good: Good to Go good (go͝od)adj. bet·ter (bĕt′ər), best (bĕst) 1. Being positive or desirable in nature; not bad or poor: a good experience; good news from the hospital. 2. a. Having the qualities that are desirable or distinguishing in a particular thing: a good exterior paint; a good joke. b. Serving the desired purpose or end; suitable: Is this a good dress for the party? 3. a. Not spoiled or ruined: The milk is still good. b. In excellent condition; sound: a good tooth. 4. a. Superior to the average; satisfactory: a good student. b. Used formerly to refer to the US Government grade of meat higher than standard and lower than choice. 5. a. Of high quality: good books. b. Discriminating: good taste. 6. a. Of moral excellence; upright: a good person. b. Benevolent; kind: a good soul; a good heart. c. Loyal; staunch: a good Republican. d. Well-behaved; obedient: a good child. e. Socially correct; proper: good manners. 7. Worthy of respect; honorable: ruined the family's good name. 8. Attractive; handsome: good looks. 9. Beneficial to health; salutary: a good night's rest. 10. Competent; skilled: a good machinist. 11. Complete; thorough: a good workout. 12. a. Reliable; sure: a good investment. b. Valid or true: a good reason. c. Genuine; real: a good dollar bill. 13. a. In effect; operative: a warranty good for two years; a driver's license that is still good. b. Ready or able for a specified or assumed activity: I'm good for another round of golf. 14. a. Able to pay or contribute: Is she good for the money that you lent her? b. Able to elicit a specified reaction: He is always good for a laugh. 15. a. Ample; substantial: a good income. b. Bountiful: a good table. 16. Full: It is a good mile from here. 17. a. Pleasant; enjoyable: had a good time at the party. b. Propitious; favorable: good weather; a good omen. 18. Sports a. Landing within bounds or within a particular area of a court and therefore in play: The first serve was wide, but the second was good. b. Passing between the uprights of the goal and therefore scoring, as a field goal in football. 19. Used to form exclamatory phrases expressing surprise or dismay: Good heavens! Good grief! n. 1. a. Something that is good. b. A good, valuable, or useful part or aspect. 2. Welfare; benefit: for the common good. 3. Goodness; virtue: There is much good to be found in people. 4. a. A product that is bought and sold: frozen goods. b. goods Portable personal property. c. (used with a sing. or pl. verb) Fabric; material. 5. goods Slang Incriminating information or evidence: tried to get the goods on the crook. adv. Informal Idioms: Well. as good as Practically; nearly: as good as new. but good Informal Used as an intensive: The pipe started to leak but good. for good Permanently; forever: I'm moving to Europe for good. good and Informal Very; thoroughly: I'll do it when I'm good and ready. no good Informal 1. Worthless. 2. Futile; useless: It's no good arguing with them. to the good 1. For the best; advantageous. 2. In an advantageous financial position: ended up to the good. Usage Note: In standard usage, good is an adjective, and the only verbs it should be used with are linking verbs such as be, seem, or appear: The future looks good. The soup tastes good. It should not be used as an adverb with other verbs: The car runs well (not good). Thus, The dress fits well and looks good. See Usage Note at well2. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. good (ɡʊd)adj, better or best 1. having admirable, pleasing, superior, or positive qualities; not negative, bad, or mediocre: a good idea; a good teacher. 2. a. morally excellent or admirable; virtuous; righteous: a good man. b. (as collective noun; preceded by the): the good. 3. suitable or efficient for a purpose: a good secretary; a good winter coat. 4. beneficial or advantageous: vegetables are good for you. 5. not ruined or decayed; sound or whole: the meat is still good. 6. kindly, generous, or approving: you are good to him. 7. right or acceptable: your qualifications are good for the job. 8. rich and fertile: good land. 9. valid or genuine: I would not do this without good reason. 10. honourable or held in high esteem: a good family. 11. commercially or financially secure, sound, or safe: good securities; a good investment. 12. (Banking & Finance) (of a draft) drawn for a stated sum 13. (Banking & Finance) (of debts) expected to be fully paid 14. clever, competent, or talented: he's good at science. 15. obedient or well-behaved: a good dog. 16. reliable, safe, or recommended: a good make of clothes. 17. affording material pleasure or indulgence: the good things in life; the good life. 18. having a well-proportioned, beautiful, or generally fine appearance: a good figure; a good complexion. 19. complete; full: I took a good look round the house. 20. propitious; opportune: a good time to ask the manager for a rise. 21. satisfying or gratifying: a good rest. 22. comfortable: did you have a good night?. 23. newest or of the best quality: to keep the good plates for important guests. 24. fairly large, extensive, or long: a good distance away. 25. sufficient; ample: we have a good supply of food. 26. (Cookery) US (of meat) of the third government grade, above standard and below choice 27. serious or intellectual: good music. 28. used in a traditional description: the good ship 'America'. 29. used in polite or patronizing phrases or to express anger (often intended ironically): how is your good lady?; look here, my good man!. 30. a good one a. an unbelievable assertion b. a very funny joke 31. as good as virtually; practically: it's as good as finished. 32. as good as gold excellent; very good indeed 33. be as good as to be so good as to would you please 34. come good to recover and perform well after a bad start or setback 35. good and informal (intensifier): good and mad. 36. (intensifier; used in mild oaths): good grief!; good heavens!. interj an exclamation of approval, agreement, pleasure, etc n 37. moral or material advantage or use; benefit or profit: for the good of our workers; what is the good of worrying?. 38. positive moral qualities; goodness; virtue; righteousness; piety 39. (sometimes capital) moral qualities seen as a single abstract entity: we must pursue the Good. 40. a good thing 41. (Economics) economics a commodity or service that satisfies a human need 42. for good for good and all for ever; permanently: I have left them for good. 43. make good a. to recompense or repair damage or injury b. to be successful c. to demonstrate or prove the truth of (a statement or accusation) d. to secure and retain (a position) e. to effect or fulfil (something intended or promised) 44. good on you good for you well done, well said, etc: a term of congratulation 45. get any good of get some good of a. to handle to good effect: I never got any good of this machine. b. to understand properly: I could never get any good of him. c. to receive cooperation from [Old English gōd; related to Old Norse gōthr, Old High German guot good] ˈgoodish adj Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 good (gʊd)adj. bet•ter, best, n., interj., adv. adj. 1. morally excellent; virtuous; righteous: a good man. 2. satisfactory in quality, quantity, or degree: a good teacher; good health. 3. of high quality; excellent: to wear good jewelry. 4. right; proper; fit: It is good that you are here. 5. well-behaved: a good child. 6. kind or friendly: to do a good deed. 7. honorable or worthy: a good name. 8. educated and refined: a good background. 9. financially sound: His credit is good. 10. genuine; not counterfeit: a good quarter. 11. sound or valid: good judgment. 12. healthful; beneficial: Fresh fruit is good for you. 13. in excellent condition; healthy: good teeth. 14. not spoiled or tainted; edible. 15. favorable; propitious: good news. 16. cheerful; amiable: in good spirits. 17. free of distress or pain; comfortable: a patient in good condition. 18. agreeable; enjoyable: Have a good time. 19. attractive: She has a good figure. 20. (of the complexion) smooth; free from blemish. 21. close; warm: She's a good friend. 22. sufficient or ample: a good supply. 23. advantageous; satisfactory for the purpose: a good day for fishing. 24. competent or skillful; clever: good at arithmetic. 25. skillfully done: a really good job. 26. conforming to rules of grammar, usage, etc.; correct: good English. 27. socially proper: good manners. 28. comparatively new or of relatively fine quality or condition: good clothes. 29. full: a good day's journey away. 30. fairly large: a good amount. 31. free from precipitation or cloudiness: good weather. 32. fertile; rich: good soil. 33. loyal: a good Democrat. 34. (of a return or service in tennis, handball, etc.) landing within the limits of a court or section of a court. 35. (of the surface of a racetrack) drying after a rain so as to be still slightly sticky. 36. designating the grade of meat, esp. lamb or veal, below choice. 37. favorably regarded (used as an epithet): the good ship Syrena. n. 38. profit or advantage; benefit: What good will that do? 39. excellence or merit; kindness: to do good. 40. virtue: to be a power for good. 41. goods, a. possessions, esp. movable effects or personal property. b. Sometimes, good. articles of trade; merchandise: linen goods. c. Informal. what has been promised or is expected: to deliver the goods. d. Informal. evidence of guilt, as stolen articles: caught with the goods. 42. the good, interj. a. the ideal of goodness or morality. b. good things or persons collectively. 43. (used as an expression of approval or satisfaction): Good! Now we can all go home. adv. 44. Informal. well. Idioms: 1. for good, finally and permanently; forever. 2. good and, very (used as an intensifier): The coffee is good and hot. 3. good for, a. certain to repay (money owed). b. the equivalent in value of: This pass is good for two free seats. c. serviceable or useful for (a specified length of time or distance). 4. to the good, a. generally advantageous. b. richer in profit or gain: Afterwards, we were several thousand dollars to the good. [before 900; Middle English; Old English gōd, c. Old Frisian, Old Saxon gōd, Old High German guot, Old Norse gōthr, Gothic goths] good′ish, adj. syn: See property. usage: The use of good as an adverb, esp. after forms of do, is common only in informal speech: He did good on the test. In formal speech or edited writing the adverb well is used instead: He did well on the test. The adjective good is standard after linking verbs like taste, smell, look, feel, be, and seem: Everything tastes good. You're looking good today. When used after look or feel, good may refer to spirits as well as health. well as an adjective used after look, feel, or other linking verbs often refers to good health: You're looking well; we missed you while you were in the hospital. See also bad1. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. good well1. 'good' Something that is good is pleasant, acceptable, or satisfactory. The comparative form of good is better. The superlative form is best. Your French is better than mine. This is the best cake I've ever eaten. 2. 'well' Good is never an adverb. If you want to say that something is done to a high standard or to a great extent, you use well, not 'good'. She speaks English well. I don't know him very well. See well The comparative form of well is better. The superlative form is best. I changed seats so I could see better. Use the method that works best for you. See better Collins COBUILD English Usage © HarperCollins Publishers 1992, 2004, 2011, 2012 ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. good adjective 1. excellent, great, fine, pleasing, capital, choice, crucial (slang), acceptable, pleasant, worthy, first-class, divine, splendid, satisfactory, superb, enjoyable, awesome (slang), dope (slang), world-class, admirable, agreeable, super (informal), pleasurable, wicked (slang), bad (slang), first-rate, tiptop, bitchin' (U.S. slang) You should read this book - it's really good. excellent bad, boring, awful, dull, inadequate, unpleasant, rotten, pathetic, tedious, disagreeable excellent bad, boring, awful, dull, inadequate, unpleasant, rotten, pathetic, tedious, disagreeable 2. fine, excellent, superior, first-class, first-rate, choice He enjoys good food and fine wine. fine terrible, inferior, lousy, bad quality fine terrible, inferior, lousy, bad quality 3. proficient, able, skilled, capable, expert, talented, efficient, clever, accomplished, reliable, first-class, satisfactory, competent, thorough, tasty (Brit. informal), adept, first-rate, adroit, dexterous He is very good at his job. proficient bad, useless, pathetic, incompetent, inefficient, unsatisfactory, unskilled proficient bad, useless, pathetic, incompetent, inefficient, unsatisfactory, unskilled 4. positive, beneficial, favourable, advantageous, auspicious, propitious Biotechnology should be good news for developing countries. positive negative, inauspicious, unpropitious, unfavourable, disadvantageous positive negative, inauspicious, unpropitious, unfavourable, disadvantageous 5. sensible, useful, wise, valuable, suitable, worthwhile, constructive, shrewd, prudent, sound, commendable, judicious, well-thought-out, well-reasoned They thought it was a good idea to make some offenders do community service. 6. desirable, pleasing, positive, productive, satisfying, beneficial, constructive, gratifying, advantageous I think it's good that some people are going. 8. profitable, fair, reasonable, adequate, lucrative I got a good price for the house. 9. beneficial, useful, healthy, helpful, favourable, wholesome, advantageous, salutary, salubrious Rain water was once considered to be good for the complexion. beneficial damaging, harmful, detrimental, injurious beneficial damaging, harmful, detrimental, injurious 10. honourable, moral, worthy, ethical, upright, admirable, honest, righteous, exemplary, right, virtuous, trustworthy, altruistic, praiseworthy, estimable The president is a good man. honourable bad, base, evil, corrupt, improper, immoral, dishonest, sinful, dishonourable honourable bad, base, evil, corrupt, improper, immoral, dishonest, sinful, dishonourable 11. well-behaved, seemly, mannerly, proper, polite, orderly, obedient, dutiful, decorous, well-mannered The children have been very good all day. well-behaved rude, naughty, mischievous, ill-mannered well-behaved rude, naughty, mischievous, ill-mannered 12. kind, kindly, friendly, obliging, charitable, humane, gracious, benevolent, merciful, beneficent, well-disposed, kind-hearted It's very good of you to help out at such short notice. kind mean (informal), cruel, vicious, selfish, wicked, unkind kind mean (informal), cruel, vicious, selfish, wicked, unkind 14. true, real, genuine, proper, reliable, dependable, sound, trustworthy, dinkum (Austral & N.Z. informal) She's been a good friend to me over the years. 15. full, long, whole, complete, entire, solid, extensive The film lasts a good two and a half hours. full short, scant full short, scant 16. considerable, large, substantial, sufficient, adequate, ample A good number of people agree with me. 17. valid, convincing, compelling, legitimate, authentic, persuasive, sound, bona fide Can you think of one good reason why I should tell you? valid false, invalid, fraudulent, phoney valid false, invalid, fraudulent, phoney 18. best, newest, special, finest, nicest, smartest, fancy, most valuable, most precious Try not to get paint on your good clothes. 19. sunny, clear, fair, bright, calm, mild, clement, balmy, cloudless If the weather's good tomorrow, we'll go for a picnic. 20. edible, untainted, uncorrupted, eatable, fit to eat Is this fish still good, or has it gone off? edible off, bad, decayed, rotten, mouldy edible off, bad, decayed, rotten, mouldy 21. convenient, timely, fitting, fit, appropriate, suitable, well-timed, opportune Is this a good time for us to discuss our plans? convenient inappropriate, unfitting, unsuitable, inconvenient, unbefitting convenient inappropriate, unfitting, unsuitable, inconvenient, unbefitting noun 1. benefit, interest, gain, advantage, use, service, profit, welfare, behalf, usefulness, wellbeing I'm only doing all this for your own good. benefit harm, loss, disadvantage, detriment, ill-fortune benefit harm, loss, disadvantage, detriment, ill-fortune 2. virtue, goodness, righteousness, worth, merit, excellence, morality, probity, rectitude, uprightness Good and evil may co-exist within one family. virtue evil, corruption, cruelty, dishonesty, wickedness, immorality, meanness, badness, baseness virtue evil, corruption, cruelty, dishonesty, wickedness, immorality, meanness, badness, baseness for good permanently, finally, for ever, once and for all, irrevocably, never to return, sine die (Latin) A few shots of this drug cleared up the disease for good. in good part good-naturedly, well, cheerfully, amiably, indulgently, tolerantly, without offence He took their teasing in good part. make good make it (informal), succeed, do well, flourish, be successful, prosper, arrive (informal), make the grade (informal), turn out well, make your mark (informal), do all right for yourself (informal) Both men are poor boys who have made good. make good on something achieve, keep, effect, complete, perform, realise, carry out, fulfil, accomplish, execute, discharge, bring to completion He was confident they would make good on their pledges. Quotations \"Mostly, we are good when it makes sense. A good society is one that makes sense of being good\" [Ian McEwan Enduring Love] \"Being good is just a matter of temperament in the end\" [Iris Murdoch The Nice and the Good] \"No one can be good for long if goodness is not in demand\" [Bertolt Brecht The Good Woman of Setzuan] \"`For your own good' is a persuasive argument that will eventually make a man agree to his own destruction\" [Janet Frame Faces in the Water] \"Mostly, we are good when it makes sense. A good society is one that makes sense of being good\" [Ian McEwan Enduring Love] \"Being good is just a matter of temperament in the end\" [Iris Murdoch The Nice and the Good] \"No one can be good for long if goodness is not in demand\" [Bertolt Brecht The Good Woman of Setzuan] \"`For your own good' is a persuasive argument that will eventually make a man agree to his own destruction\" [Janet Frame Faces in the Water] Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 good adjective2. To one's liking: 3. Suited to one's end or purpose: 4. In excellent condition: 5. Well above average: 6. Affording benefit: 8. Not counterfeit or copied: 9. Notably above average in amount, size, or scope: Informal: tidy. 11. Indicative of future success or full of promise: 12. Beyond reproach: 13. Having or marked by uprightness in principle and action: Informal: straight-shooting. Idiom: on the up-and-up. 14. Characterized by kindness and concern for others: 1. Something that contributes to or increases one's well-being: 2. The quality or state of being morally sound: 3. A product or products bought and sold in commerce.Used in plural: 4. One's portable property.Used in plural: belonging (often used in plural), effect (used in plural), lares and penates, personal effects, personal property, possession (used in plural), property, thing (often used in plural). Informal: stuff. The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations إيجابي، اسْتِحْسانيالخَيْربصحَّةٍ جَيِّدَهتَعبير استِحْسانجَيِّد добро dobrýhodnýdobrolaskavýprospěšný godgodesødsundvel hyväkivakunnollinenmukavaterveellinen अच्छेअच्छाअच्छीउत्तमभले dobardobroukusanzdrav jójólszámottevõszívjóság baik góðgóðurgóîurgóîur, hæfurgóîur, hollur うまい良い行儀のよい 모범적인잘 하는좋은 bonabonumbonus ačiū Dievuibeprasmiškabeprasmiškasdėl Dievo meilės!Didysis penktadienis labspatīkamslabvēlīgslaipnsnoderīgs binebun dobroprospešný doberdobrokoristenodličnougoden dobroukusnozdravo bragodgodhetgottsnäll เก่งดีประพฤติดี tốttuyệtgiỏihay good [gʊd]A. ADJECTIVE (better (compar) (best (superl))) When good is part of a set combination, eg in a good temper, a good deal of, good heavens, look up the noun. The commonest translation of good is bueno, which must be shortened to buen before a masculine singular noun. 1. (= satisfactory) 1.1. → bueno a good book → un buen libro at the end of the day, it's a good investment → a fin de cuentas es una buena inversión she was a good wife and mother → era una buena esposa y madre she has a good figure → tiene buen tipo I'm not saying it's a good thing or a bad thing → no digo que sea una cosa buena, ni mala it's good to be aware of the views of intelligent people → es bueno conocer los puntos de vista de la gente inteligente the paella was very good → la paella estaba muy buena his hearing is good → del oído está bien, el oído lo tiene bien a good book → un buen libro at the end of the day, it's a good investment → a fin de cuentas es una buena inversión Note that bueno/buena precede the noun in general comments where there is no attempt to compare or rank the person or thing involved: if he set his mind to it, he could be a very good painter → si se lo propusiera podría ser muy buen pintorshe was a good wife and mother → era una buena esposa y madre she has a good figure → tiene buen tipo Bueno/buena follow the noun when there is implied or explicit comparison: we could make a list of good teachers → podríamos hacer una lista de profesores buenosI'm not saying it's a good thing or a bad thing → no digo que sea una cosa buena, ni mala Use ser rather than estar with bueno when translating to be good, unless describing food: the idea is a good one → la idea es buenait's good to be aware of the views of intelligent people → es bueno conocer los puntos de vista de la gente inteligente the paella was very good → la paella estaba muy buena Use estar with the adverb bien to give a general comment on a situation: you've written a book, which is good → has escrito un libro, lo que está bienhis hearing is good → del oído está bien, el oído lo tiene bien 1.2. she's good at maths → se le dan bien las matemáticas, es buena en matemáticas she's good at singing → canta bien she's good at putting people at their ease → tiene la capacidad de hacer que la gente se sienta relajada that's good enough for me → eso me basta it's just not good enough! → ¡esto no se puede consentir! 40% of candidates are not good enough to pass → el 40% de los candidatos no dan el nivel or la talla para aprobar to feel good → sentirse bien I started to feel good about myself again → empecé a recuperar mi autoestima or la moral I don't feel very good about that (= I'm rather ashamed) → me da bastante vergüenza we've never had it so good! > → ¡nunca nos ha ido tan bien!, ¡jamás lo hemos tenido tan fácil! how good is her eyesight? → ¿qué tal está de la vista? you're looking good → ¡qué guapa estás! things are looking good → las cosas van bien, la cosa tiene buena pinta you look good in that → eso te sienta or te va bien you can have too much of a good thing → lo mucho cansa (y lo poco agrada) it's too good to be true → no puede ser, es demasiado bueno para ser cierto he sounds too good to be true! → ¡algún defecto tiene que tener! she's good with cats → entiende bien a los gatos, sabe manejarse bien con los gatos see also good B4 see also manner 4.1 see also mood 2 A see also time A5 she's good at maths → se le dan bien las matemáticas, es buena en matemáticas she's good at singing → canta bien she's good at putting people at their ease → tiene la capacidad de hacer que la gente se sienta relajada that's good enough for me → eso me basta it's just not good enough! → ¡esto no se puede consentir! 40% of candidates are not good enough to pass → el 40% de los candidatos no dan el nivel or la talla para aprobar to feel good → sentirse bien I started to feel good about myself again → empecé a recuperar mi autoestima or la moral I don't feel very good about that (= I'm rather ashamed) → me da bastante vergüenza we've never had it so good! > → ¡nunca nos ha ido tan bien!, ¡jamás lo hemos tenido tan fácil! how good is her eyesight? → ¿qué tal está de la vista? you're looking good → ¡qué guapa estás! things are looking good → las cosas van bien, la cosa tiene buena pinta you look good in that → eso te sienta or te va bien you can have too much of a good thing → lo mucho cansa (y lo poco agrada) it's too good to be true → no puede ser, es demasiado bueno para ser cierto he sounds too good to be true! → ¡algún defecto tiene que tener! she's good with cats → entiende bien a los gatos, sabe manejarse bien con los gatos see also good B4 see also manner 4.1 see also mood 2 A see also time A5 2. (= of high quality) always use good ingredients → utilice siempre ingredientes de calidad or los mejores ingredientes it's made of good leather → está hecho con cuero del bueno it's made of good leather → está hecho con cuero del bueno 3. (= pleasant) [holiday, day] → bueno, agradable; [weather, news] → bueno it was as good as a holiday → aquello fue como unas vacaciones have a good journey! → ¡buen viaje! how good it is to know that ...! → ¡cuánto me alegro de saber que ...! it's good to see you → me alegro de verte, gusto en verte (LAm) it's good to be here → da gusto estar aquí have a good trip! → ¡buen viaje! see also alive 1 see also life A3 it was as good as a holiday → aquello fue como unas vacaciones have a good journey! → ¡buen viaje! how good it is to know that ...! → ¡cuánto me alegro de saber que ...! it's good to see you → me alegro de verte, gusto en verte (LAm) it's good to be here → da gusto estar aquí have a good trip! → ¡buen viaje! see also alive 1 see also life A3 4. (= beneficial, wholesome) [food] → bueno, sano; [air] → puro, sano it's good for burns → es bueno para las quemaduras it's good for you or your health → te hace bien spirits are not good for me → los licores no me sientan bien he eats more than is good for him → come más de lo que le conviene all this excitement isn't good for me! → ¡a mí todas estas emociones no me vienen or sientan nada bien! it's good for the soul! (hum) → ¡ennoblece el espíritu!, ¡te enriquece (como persona)! if you know what's good for you you'll say yes → por la cuenta que te tiene dirás que sí some children know more than is good for them → algunos niños son demasiado listos or saben demasiado it's good for burns → es bueno para las quemaduras it's good for you or your health → te hace bien spirits are not good for me → los licores no me sientan bien he eats more than is good for him → come más de lo que le conviene all this excitement isn't good for me! → ¡a mí todas estas emociones no me vienen or sientan nada bien! it's good for the soul! (hum) → ¡ennoblece el espíritu!, ¡te enriquece (como persona)! if you know what's good for you you'll say yes → por la cuenta que te tiene dirás que sí some children know more than is good for them → algunos niños son demasiado listos or saben demasiado 5. (= favourable) [moment, chance] → bueno it's a good chance to sort things out → es una buena oportunidad de or para arreglar las cosas I tried to find something good to say about him → traté de encontrar algo bueno que decir de él it would be a good thing or idea to ask him → no estaría mal or no sería mala idea preguntárselo this is as good a time as any to do it → es tan buen momento como cualquier otro para hacerlo it's a good chance to sort things out → es una buena oportunidad de or para arreglar las cosas I tried to find something good to say about him → traté de encontrar algo bueno que decir de él it would be a good thing or idea to ask him → no estaría mal or no sería mala idea preguntárselo this is as good a time as any to do it → es tan buen momento como cualquier otro para hacerlo 6. (= useful) the only good chair → la única silla que está bien, la única silla servible or sana to be good for (doing) sth → servir para (hacer) algo it'll be good for some years → durará todavía algunos años he's good for ten years yet → tiene todavía por delante diez años de vida John's good for a few hundred pounds → John seguramente puede prestarnos unos cientos de libras I'm good for another mile → todavía puedo aguantar otra milla más the ticket is good for three months → el billete es válido or valedero para tres meses he's good for nothing → es un inútil, es completamente inútil to be good for (doing) sth → servir para (hacer) algo it'll be good for some years → durará todavía algunos años he's good for ten years yet → tiene todavía por delante diez años de vida John's good for a few hundred pounds → John seguramente puede prestarnos unos cientos de libras I'm good for another mile → todavía puedo aguantar otra milla más the ticket is good for three months → el billete es válido or valedero para tres meses he's good for nothing → es un inútil, es completamente inútil 7. (= sound, valid) [excuse] → bueno unless you have a good excuse → a menos que tengas una buena excusa for no good reason → sin motivo alguno he is a good risk (financially) → concederle crédito es un riesgo asumible, se le puede prestar dinero see also word A1 unless you have a good excuse → a menos que tengas una buena excusa for no good reason → sin motivo alguno he is a good risk (financially) → concederle crédito es un riesgo asumible, se le puede prestar dinero see also word A1 8. (= kind) that's very good of you → es usted muy amable, ¡qué amable (de su parte)! he was so good as to come with me → tuvo la amabilidad de acompañarme please would you be so good as to help me down with my case? → ¿me hace el favor de bajarme la maleta?, ¿tendría la bondad de bajarme la maleta? (more frm) would you be so good as to sign here? → ¿me hace el favor de firmar aquí? he's a good sort → es buena persona or gente he was good to me → fue muy bueno or amable conmigo, se portó bien conmigo see also nature A2 that's very good of you → es usted muy amable, ¡qué amable (de su parte)! he was so good as to come with me → tuvo la amabilidad de acompañarme please would you be so good as to help me down with my case? → ¿me hace el favor de bajarme la maleta?, ¿tendría la bondad de bajarme la maleta? (more frm) would you be so good as to sign here? → ¿me hace el favor de firmar aquí? he's a good sort → es buena persona or gente he was good to me → fue muy bueno or amable conmigo, se portó bien conmigo see also nature A2 9. (= well-behaved) [child] → bueno be good! (morally) → ¡sé bueno!; (in behaviour) → ¡pórtate bien!; (at this moment) → ¡estáte formal! to be as good as gold → portarse como un ángel or santo be good! (morally) → ¡sé bueno!; (in behaviour) → ¡pórtate bien!; (at this moment) → ¡estáte formal! to be as good as gold → portarse como un ángel or santo 10. (= upright, virtuous) → bueno he's a good man → es una buena persona, es un buen hombre I think I'm as good as him → yo me considero tan buena persona como él the twelve good men and true → los doce hombres justos yes, my good man → sí, mi querido amigo send us a photo of your good self (frm) → tenga a bien enviarnos una foto suya she's too good for him → ella es más de lo que él se merece see also lady A5 he's a good man → es una buena persona, es un buen hombre I think I'm as good as him → yo me considero tan buena persona como él the twelve good men and true → los doce hombres justos yes, my good man → sí, mi querido amigo send us a photo of your good self (frm) → tenga a bien enviarnos una foto suya she's too good for him → ella es más de lo que él se merece see also lady A5 11. (= close) → bueno he's a good friend of mine → es un buen amigo mío my good friend Fernando → mi buen or querido amigo Fernando he's a good friend of mine → es un buen amigo mío my good friend Fernando → mi buen or querido amigo Fernando 12. (= middle-class, respectable) to live at a good address → vivir en una buena zona or en un buen barrio he's got no money but he's of good family → no tiene dinero pero es or viene de buena familia to live at a good address → vivir en una buena zona or en un buen barrio he's got no money but he's of good family → no tiene dinero pero es or viene de buena familia 14. (= considerable) [supply, number] → bueno we were kept waiting for a good hour/thirty minutes → nos tuvieron esperando una hora/media hora larga, nos tuvieron esperando por lo menos una hora/media hora a good three hours → tres horas largas a good 10km → 10kms largos a good £10 → lo menos 10 libras a good many or few people → bastante gente we were kept waiting for a good hour/thirty minutes → nos tuvieron esperando una hora/media hora larga, nos tuvieron esperando por lo menos una hora/media hora a good three hours → tres horas largas a good 10km → 10kms largos a good £10 → lo menos 10 libras a good many or few people → bastante gente 15. (= thorough) [scolding] → bueno to have a good cry → llorar a lágrima viva, llorar a moco tendido to have a good laugh → reírse mucho to take a good look (at sth) → mirar bien (algo) to have a good wash → lavarse bien to have a good cry → llorar a lágrima viva, llorar a moco tendido to have a good laugh → reírse mucho to take a good look (at sth) → mirar bien (algo) to have a good wash → lavarse bien 16. the good ship Domino → el (buque) Domino 17. (in greetings) good afternoon/evening → buenas tardes good morning → buenos días good night → buenas noches with every good wish, with all good wishes (in letter) → saludos, un fuerte abrazo Robert sends (his) good wishes → Robert manda recuerdos good afternoon/evening → buenas tardes good morning → buenos días good night → buenas noches with every good wish, with all good wishes (in letter) → saludos, un fuerte abrazo Robert sends (his) good wishes → Robert manda recuerdos 18. (in exclamations) good! → ¡muy bien! (that's) good! → ¡qué bien!, ¡qué bueno! (LAm) very good, sir → sí, señor good for YOU! → ¡bien hecho!; (= congratulations) → ¡enhorabuena! good one! (= well done, well said) → ¡muy bien!, ¡sí señor! see also old A5, A6 (that's) good! → ¡qué bien!, ¡qué bueno! (LAm) very good, sir → sí, señor good for YOU! → ¡bien hecho!; (= congratulations) → ¡enhorabuena! good one! (= well done, well said) → ¡muy bien!, ¡sí señor! see also old A5, A6 19. (in other set expressions) as good as it's as good as new → está como nuevo I'll soon be as good as new → pronto estaré como nuevo the job is as good as done → el trabajo puede darse por acabado it's as good as lost → puede darse por perdido they're as good as beaten → pueden darse por vencidos as good as saying → tanto como decir ... she as good as told me so → poco menos que me lo dijo he as good as called me a liar → me llamó poco menos que mentiroso to come good things will come good eventually → todo se arreglará al final good and ... good and hot → bien calentito good and strong → bien fuerte I'll do it when I'm good and ready → lo haré cuando a mí me parezca to hold good → valer (for para) the same advice holds good for us → el mismo consejo vale para nosotros it's a good job (it's a) good job he came! → ¡menos mal que ha venido! see also make A3, A10, B see also riddance, thing A2 as good as it's as good as new → está como nuevo I'll soon be as good as new → pronto estaré como nuevo the job is as good as done → el trabajo puede darse por acabado it's as good as lost → puede darse por perdido they're as good as beaten → pueden darse por vencidos as good as saying → tanto como decir ... she as good as told me so → poco menos que me lo dijo he as good as called me a liar → me llamó poco menos que mentiroso to come good things will come good eventually → todo se arreglará al final good and ... good and hot → bien calentito good and strong → bien fuerte I'll do it when I'm good and ready → lo haré cuando a mí me parezca to hold good → valer (for para) the same advice holds good for us → el mismo consejo vale para nosotros it's a good job (it's a) good job he came! → ¡menos mal que ha venido! see also make A3, A10, B see also riddance, thing A2 B. ADVERB 1. (as intensifier) → bien a good strong stick → un palo bien fuerte a good long walk → un paseo bien largo, un buen paseo to give as good as one gets → pagar con la misma moneda, devolver golpe por golpe good and proper they were beaten good and proper → les dieron una buena paliza they were cheated good and proper → les timaron bien timados, les timaron con todas las de la ley a good strong stick → un palo bien fuerte a good long walk → un paseo bien largo, un buen paseo to give as good as one gets → pagar con la misma moneda, devolver golpe por golpe good and proper they were beaten good and proper → les dieron una buena paliza they were cheated good and proper → les timaron bien timados, les timaron con todas las de la ley C. NOUN 1. (= virtuousness) → el bien to do good → hacer (el) bien good and evil → el bien y el mal he is a power for good → su influencia es muy buena or beneficiosa, hace mucho bien for good or ill → para bien o para mal there's some good in him → tiene algo bueno to be up to no good → estar tramando algo to do good → hacer (el) bien good and evil → el bien y el mal he is a power for good → su influencia es muy buena or beneficiosa, hace mucho bien for good or ill → para bien o para mal there's some good in him → tiene algo bueno to be up to no good → estar tramando algo 2. (= advantage, benefit) → bien m the common good → el bien común if it's any good to you → si te sirve de algo a rest will do you some good → un descanso te sentará bien the sea air does you good → el aire del mar le hace or sienta a uno bien a (fat) lot of good that will do you! → ¡menudo provecho te va a traer! much good may it do you! → ¡no creo que te sirva de mucho!, ¡para lo que te va a servir! it does my heart good to see him → verlo me alegra la existencia for your own good → por tu propio bien for the good of the country → por el bien del país to be in good with sb → estar a bien con algn that's all to the good! → ¡menos mal! what good will that do you? → ¿y eso de qué te va a servir? what's the good of worrying? → ¿de qué sirve or para qué preocuparse? the common good → el bien común if it's any good to you → si te sirve de algo a rest will do you some good → un descanso te sentará bien the sea air does you good → el aire del mar le hace or sienta a uno bien a (fat) lot of good that will do you! → ¡menudo provecho te va a traer! much good may it do you! → ¡no creo que te sirva de mucho!, ¡para lo que te va a servir! it does my heart good to see him → verlo me alegra la existencia for your own good → por tu propio bien for the good of the country → por el bien del país to be in good with sb → estar a bien con algn that's all to the good! → ¡menos mal! what good will that do you? → ¿y eso de qué te va a servir? what's the good of worrying? → ¿de qué sirve or para qué preocuparse? 3. (= people of virtue) the good → los buenos 4. (in set expressions) any good is he any good? [worker, singer etc] → ¿qué tal lo hace?, ¿lo hace bien? is this any good? → ¿sirve esto? is she any good at cooking? → ¿qué tal cocina?, ¿cocina bien"
}