{
  "url": "https://zh.wikipedia.org/wiki/周生生",
  "title": "周生生 - 维基百科，自由的百科全书",
  "text": "周生生 外观 周生生集團國際有限公司（Chow Sang Sang Holdings International Limited，港交所：0116），以其簡稱「周生生」，主要在大中華從事黃金珠寶銷售。周生生起源於1934年在中國廣州市開展的同名金行業務。創辦人取名喻意「周而復始，生生不息」，同時亦包含了他的姓氏。 介紹 [编辑]周生生於1973年成為香港首家上市的黃金珠寶公司，其股票編號是116。周生生集團主席兼集團總經理是周永成先生，為第三代掌舵人之一。 截止2024年12月31日止，周生生集團共有958家分店，各地員工總數超過11,000人。周生生集團2024年營業額為21,176百萬港元。[1] 在香港及澳門，尚有以「粵港澳湛周生生」為名的金店，它們與周生生集團完全沒有業務關連。 企業歷史 [编辑]- 1934年，由先當老師後從醫再務商的順德人周芳譜先生於廣州西關十七甫創立。在1930至1940年代，周生生先後於廣州長堤大馬路（粵），香港中環何東行（港），澳門新馬路（澳）及湛江市赤坎中興街（湛）等地開設分店，獲得分行遍布「粵港澳湛」的稱謂。 - 1938年，廣州淪陷，周芳譜攜同家眷遷往澳門，並在該地經營生意。 周芳譜與正室生有三個兒子，分別是禹初、冠岳及少明，跟妾侍也有三個兒子，名君令、君廉及君任。周芳譜在生時已安排好，將港、澳及湛江等地業務分給兩房人打理，並在1946年訂立遺囑，訂明子孫及後人可沿用「周生生」這名字經營，但不得將名字出售及容許外人加入。 - 1941年，周芳譜將店鋪交與各兒子分別經營。周君令、君廉及君任三兄弟領得澳門店。 - 1948年，三兄弟在香港旺角上海街開設分店，正式進駐香港。 - 1957年，三兄弟成立周生生金行有限公司，後改名為周生生珠寶金行有限公司。 - 1971年，改名為「周生生珠寶金行有限公司」。 - 1973年，周生生在香港上市（股票編號116），為香港第一家上市的珠寶業公司。 - 1979年，周生生大厦落成。 - 1982年，周芳譜正室的一房兒子周少明成立「粵港澳湛周生生珠寶金行有限公司」，但與周生生集團無業務關連。 - 1986年，周生生成立周生生證券有限公司，向個人客戶提供股票及期貨買賣服務。 - 1990年： - 成立周生生貴金屬化驗所，為第一家商營機構獲得香港政府工業署屬下香港實驗所認可計劃的黃金成色檢定資格。 - 成立企業禮品服務隊伍，為商業機構提供企業禮品訂造服務。 - 1994年， 創立「點睛品」品牌，貨品款式、裝修陳設均採用不同意念及設計，旨在打造帶領潮流而又溫馨的品牌。 - 1998年，旗下周生生珠寶金行有限公司取得ISO 9002國際品質證書，為珠寶業內首間獲此證書的機構。 - 2000年，設立「周生生證券投資網338.net」，提供網上自動落盤服務。 - 2001年，「周生生網上珠寶店」投入服務。 - 2004年： - 取得香港迪士尼樂園內「小鎮珠寶店」的經營權。 - 於中港台分店推出米奇老鼠及其他迪士尼主題產品。 - 2005年： - 取得全球最大鑽坯供應集團De Beers旗下DTC的鑽石配貨商資格，可以直接購進鑽石毛坯。 - 點睛品進駐澳門市場。 - 獲「香港社會服務聯會」頒發2004/05年度「商界展關懷」標誌。 - 2006年，採用全新「周生生珠寶」商標，「周生生集團」則沿用橢圓形商標。 - 2007年，成立「周生生鑽石（上海）有限公司」，並登記成為上海鑽石交易所會員。 - 2009年，設立首家中國旗艦店，位於北京三里屯，面積600平方米，樓高三層。 - 2009年，成立珍珠品牌 La Pelle。 - 2012年，美鑽品牌 「全愛鑽」開展。 - 2013年，周生生順德工業園正式投入生產。廠房佔地28,000平方米，設計高度結合節能、減排及綠化環境的環保理念，並引入最先進的生產設備。 - 2014年，周生生順德化驗所經中國合格評定國家認可委員會（CNAS）評定，成為CNAS認可實驗室。 - 2018年，周生生與曾與多個國際時裝、化妝品品牌及名人合作和設計插畫的香港著名時尚插畫師Mickco合作，創造了一個擁有多面時尚態度的新角色──Cassie[2]。 - 2021年： - 周生生結束「周生生證券」業務，周生生證券共有六間分行，分布在康怡、佐敦、九龍城、旺角、荃灣及元朗。[3] - 榮獲由《哈佛商業評論》及 SAP 主辦的「2021【鼎革獎】數字化轉型先鋒榜」年度企業獎，以表揚本集團實現數字化轉型、全渠道策略及通過科技追求提升顧客體驗。 - 2022年，全球第一所 V&A 聯乘周生生珠寶概念店於香港 K11 MUSEA 開幕。 - 2024年 - 成為首家獲科學基礎目標倡議組織（Science Based Target initiative，SBTi）批核近期減碳目標的大中華區珠寶公司，致力將全球氣溫升幅控制在《巴黎協定》設定的1.5°C以內。 - 周生生慶祝成立90周年。[4] 參考 [编辑]- ^ 《業績》周生生(00116.HK)全年純利8.06億元跌20.5% 末期息派36仙 - ^ 周生生聯乘時尚插畫師Mickco帶來全新面孔—Cassie. Ming's. [2018-01-13]. （原始内容存档于2018-01-13）. - ^ 周生生結束「周生生證券」 涉6間分行. 明報. 2021-01-29 [2021-11-21]. （原始内容存档于2022-04-09）. - ^ 周生生90周年「共生無盡」珠寶故事展 見證YuYu系列璀璨登場！ 原文網址: 周生生90周年「共生無盡」珠寶故事展 見證YuYu系列璀璨登場！. HK01. 已忽略未知参数 |香港01 https://www.hk01.com/article/1058119?utm_source= (帮助)"
}