{
  "url": "https://support.google.com/maps/answer/144339?hl=pt-BR&co=GENIE.Platform=Desktop",
  "title": "Ver rotas e mostrar trajetos no Google Maps - Computador - Ajuda do Google Maps",
  "text": "Importante: para sua segurança e a de outras pessoas, preste atenção ao que está acontecendo ao seu redor ao usar as rotas no Google Maps. Em caso de dúvida, siga o código de trânsito e confirme a sinalização da via ou do caminho em que você está. Você pode ver rotas de carro, transporte público, a pé, transporte por aplicativo, bicicleta, voo ou motocicleta no Google Maps. - Se houver vários trajetos, o melhor para seu destino será destacado em azul, e os outros ficarão em cinza. - Algumas rotas no Google Maps estão em processo de desenvolvimento, e a disponibilidade delas é limitada. Ver rotas no Google Maps - No computador, abra o Google Maps. - Clique em Rotas . - Insira o ponto de partida e o destino. - Clique nos pontos do mapa, digite um endereço ou adicione o nome de um lugar. - Escolha seu meio de transporte. - Para conferir rotas de carro, clique em Carro . - Para conferir rotas de transporte público, clique em Transporte público . - Para conferir rotas a pé, clique em A pé . - Para conferir rotas de bicicleta, clique em Bicicleta . - Para conferir as opções de voo, clique em Avião . Dica: para escolher outro trajeto em qualquer meio de transporte, selecione-o no mapa. O tempo estimado da viagem de cada trajeto é exibido no mapa. Você pode ver rotas para diferentes meios de transporte no Google Maps. Saiba mais sobre as diferenças de recursos e disponibilidade entre cada um deles: Carro: - Os trajetos de carro são projetados para serem seguidos usando esse meio de transporte e podem levar a vias exclusivas para esses veículos. Quando andar de bicicleta motorizada ou motocicleta com menos de 125 cc, ative as opções Evitar pedágios e Evitar rodovias. - Se quiser alterar um trajeto de carro, clique em um ponto do trajeto, mantenha pressionado e arraste-o até um novo ponto no mapa. Transporte público: - Nem todas as cidades têm rotas de transporte público no Google Maps. Para que você veja essas rotas, a empresa de transporte público local precisa adicionar as informações do trajeto ao Google Maps. A pé: - Ao caminhar, você pode receber rotas a pé detalhadas para chegar ao seu destino. Bicicleta: - Ao pedalar, você poderá usar os trajetos de bicicleta se eles estiverem disponíveis no seu país ou região. Avião: - Em pesquisas por trajetos de transporte público ou voos, as rotas com vários destinos ou pontos de referência não estão disponíveis. - Saiba como pesquisar voos. Adicionar vários destinos no Google Maps É possível ver rotas para vários destinos com todos os meios de transporte, exceto transporte público ou voo. - No computador, abra o Google Maps. - Clique em Rotas . - Adicione um ponto de partida e um destino. - Para editar o ponto de partida, clique em Seu local na parte de cima. - Abaixo dos destinos inseridos, clique em Adicionar destino . - Para adicionar uma parada, escolha outro destino. - Você pode adicionar até nove paradas, incluindo o destino final. - Para conferir rotas, clique em um trajeto. Dica: você pode pesquisar lugares ao longo do trajeto. Mudar a ordem das suas paradas no Google Maps - Encontre o destino que você quer mover. - Arraste esse destino. Visualizar rotas no Street View no Google Maps Importante: para ter acesso a rotas no Street View, clique em Rotas . Em seguida, insira o ponto de partida e o destino. - No seu computador, abaixo do trajeto desejado, clique em Detalhes. - Para mostrar rotas mais detalhadas, clique em Abrir . - Aponte para uma etapa na rota. - Se o Street View estiver disponível, uma foto de visualização vai aparecer. - Para acessar a etapa desejada no Street View, clique na foto. - Para abrir outras etapas do trajeto no Street View, clique em Etapa anterior ou Próxima etapa na caixa do canto inferior esquerdo. - Para sair da visualização, no canto superior direito, clique em Fechar . Personalizar seu trajeto no Google Maps Evitar pedágios e rodovias- No computador, abra o Google Maps. - Clique em Rotas . - Insira o ponto de partida e o destino. - Clique nos pontos do mapa, digite um endereço ou adicione o nome de um lugar. - Escolha Opções. - Marque a caixa ao lado de \"Pedágios\" ou \"Rodovias\". Para encontrar o melhor trajeto com base no trânsito estimado e nos horários do transporte público, mude a data ou o horário da sua viagem. Isso funciona apenas para trajetos com um destino. - No computador, abra o Google Maps. - Defina a rota. - Depois de ver suas rotas, clique em Sair agora. - Para alterar as datas ou os horários da viagem, selecione Saída às ou Chegada às. Quando você insere um destino no Google Maps, mostramos como chegar lá usando diferentes meios de transporte, como carro, bicicleta ou a pé. As opções de transporte exibidas são classificadas com base na combinação de fatores objetivos criados para ajudar você a encontrar informações úteis e relevantes. Esses fatores podem incluir a duração, a distância, o preço, sua preferência ou a relevância dos meios de transporte para a consulta. Geralmente, os fatores mais importantes são sua preferência de meio de transporte, a duração da viagem e, às vezes, o preço. Quando disponíveis, também mostramos outros serviços de mobilidade, como transporte público, aluguel de scooter ou bicicleta e serviços de transporte por aplicativo. Esses serviços de mobilidade são fornecidos por terceiros que disponibilizaram dados de transporte publicamente ou têm um contrato de parceria com o Google. As parcerias ou relações comerciais que temos com provedores de serviços de transporte não influenciam a classificação desses serviços."
}