{
  "url": "https://support.google.com/chrome/answer/95346?hl=sk&co=GENIE.Platform=Desktop",
  "title": "Stiahnutie a inštalácia prehliadača Google Chrome - Počítač - Google Chrome Pomocník",
  "text": "Webový prehliadač Chrome si môžete stiahnuť a nainštalovať bez peňažného poplatku a môžete pomocou neho prehliadať internet. Ako nainštalovať Chrome Dôležité: Pred stiahnutím skontrolujte, či Chrome podporuje váš operačný systém a spĺňate všetky ďalšie systémové požiadavky. Windows- Stiahnite si v počítači inštalačný súbor. - Ak chcete súbor nainštalovať, postupujte podľa pokynov na obrazovke. - Ak sa zobrazí správa „Chcete spustiť tento súbor?“, vyberte Spustiť. - Ak sa zobrazí „Chcete tejto aplikácii povoliť vykonávať zmeny v zariadení?“, vyberte Áno. - Otvorte Chrome. - V systéme Windows 10 alebo novšom sa po dokončení inštalácie otvorí okno Chromu. Potom môžete nastaviť Chrome ako predvolený prehliadač. Tip: Ak ste používali iný prehliadač, napríklad Firefox, môžete importovať svoje nastavenia do Chromu. Inštalácia Chromu v režime offline Ak máte problémy so stiahnutím Chromu v počítači so systémom Windows, použite alternatívny odkaz a stiahnite Chrome v inom počítači. - Stiahnite si v počítači inštalátor Chromu pre iný počítač. - Dole na stránke v sekcii Skupina zariadení Chrome vyberte Iné platformy. - Vyberte operačný systém zariadenia, v ktorom chcete Chrome nainštalovať. - Stiahnite súbor. - Preneste súbor do počítača, v ktorom chcete nainštalovať Chrome. - Nainštalujte podľa pokynov na obrazovke. - Stiahnite si v počítači inštalačný súbor. - Otvorte súbor googlechrome.dmg. - V okne, ktoré sa otvorí, vyhľadajte Chrome. - Presuňte Chrome myšou do priečinka Aplikácie. - Možno budete musieť zadať heslo správcu. - Ak nemôžete zadať heslo správcu, presuňte Chrome do umiestnenia, pre ktoré máte úplné povolenia, napríklad na pracovnú plochu. Tip: Ak chcete po inštalácii inštalačné súbory vyčistiť, v bočnom paneli nástroja Finder vedľa položky Chrome vyberte Vysunúť . Nainštalujte Chrome a použite softvér, pomocou ktorého inštalujete programy do počítača. Musíte zadať heslo správcovského účtu. - Stiahnite si v počítači inštalačný súbor. - Ak chcete balíček otvoriť, vyberte OK Inštalovať balíček. Chrome je pridaný do správcu softvéru, aby bol vždy aktuálny. Kontrola systémových požiadaviek na používanie Chromu WindowsAk chcete používať Chrome v systéme Windows s procesorom Intel alebo ARM, potrebujete: - Procesor Intel: - systém Windows 10 a novší, - procesor Intel Pentium 4 alebo novší s podporou súpravy SSE3. - Procesor ARM: systém Windows 11 a novší. Ak chcete používať Chrome v Macu, musíte mať systém macOS 12 Monterey alebo novší. Ak chcete používať Chrom v systéme Linux potrebujete: - 64‑bitový operačný systém Ubuntu 18.04 alebo novší, Debian 10 alebo novší, openSUSE 15.5 alebo novší, prípadne Fedora Linux 39 alebo novší, - Procesor Intel Pentium 4 alebo novší s podporou súpravy SSE3."
}