{
  "url": "https://goldprice.org/gold-price-usa.html",
  "title": "Current Gold Price in USA - USD Gold Prices",
  "text": "Gold Price USA (US Dollars) Conversion : 1 troy ounce = 31.1034768 grams US Dollars 24 Hour Spot Gold and Silver Price US Dollars Gold Price History Charts To learn about our gold price data Gold Price USA The United States of America is the world’s largest economy. The nation is comprised of 50 states, a federal district and several self-governing territories that form a federal republic. The U.S. covers a land area of about 3.8 million square miles, and has a population of approximately 325 million people. The country is one of the globe’s largest in terms of both size and population. The U.S. capital is the city of Washington D.C., and the largest city in the nation is New York City. English is the official language of the U.S. and the government is a federal presidential constitutional republic. The U.S. declared its independence on July 4th, 1776. The U.S. Dollar is the official currency of the United States. The dollar can be subdivided into 100 smaller units of currency called cents, and the paper currency is made up of Federal Reserve Notes that are denominated in dollars. The U.S. Dollar is the world’s primary reserve currency, and it is the most widely used for international transactions. The dollar is used by numerous other countries as well, and its value is recognized all over the globe. The dollar is widely traded in global currency markets, and is often viewed as a safe haven asset during times of economic or geopolitical stress. The U.S. currency is issued and controlled by the nation’s central bank, known as the Federal Reserve System. The central bank is often referred to as the Federal Reserve or simply the Fed for short. The Federal Reserve Act created the central bank in 1913, and was established to exert central control over the monetary system. The Fed is headquartered in the nation’s capital of Washington D.C. The central bank has three primary directives for monetary policy per its mandate that includes maximizing employment, price stability and moderation of long-term interest rates. The duties of the Fed have expanded over the years to cover other areas as well such as bank regulation and maintaining stability of the financial system. The United States Mint produces circulation coinage for the U.S. , but it does not produce paper money. The Mint was established in Philadelphia in 1792, and today there are four active coin-minting locations including Philadelphia, Denver, West Point and San Francisco. The U.S. Mint also produces a variety of bullion and collectible coins. One of the mint’s most popular coins is the world-renowned American Gold Eagle coin. This coin is one of the biggest sellers in the world, and features the iconic design of Lady Liberty, designed by Augustus Saint-Gaudens. The one ounce weight contains one troy ounce of 91.67 percent fine gold. The coin carries a face value of $50, and is considered good, legal tender. They are available in both bullion as well as proof versions. The American Gold Eagle is also available in fractional weights, making them relatively more affordable for investors on a tight budget. These coins are also eligible for inclusion in an IRA account, making them an excellent choice for long-term investors."
}