{
  "url": "https://nineplanets.org/introduction-and-faq/",
  "title": "Introduction to the planets of our solar system",
  "text": "The Nine Planets is a collection of information about our Solar System intended for a general audience with little technical background. No special expertise or knowledge is needed; all technical and astronomical terms and proper names are defined in the glossary. The bulk of this material should be familiar to planetary scientists and astronomers but they may find a few interesting tidbits, too. This site consists of about 100 pages, one page for each major body in the Solar System. Each page has: - a large picture of its object and usually several smaller thumbnail images (all linked to their full-size originals) - some scientific and historical facts about it, - if the object has satellites then its page has a table of data on them and links to their pages, - links to more images and information about the object elsewhere on the Web, and - a list of open issues for which we as yet have no answers. To truly justify the title of “Multimedia Tour”, I’ve also included: - short sound clips from Holst‘s The Planets (about 10 seconds or 180k each) for seven of the planets; - sound clips of my mellifluous voice pronouncing some of the more unusual names; - links to “movies” of a few objects. There are also a few miscellaneous pages: on planetary science spacecraft, the glossary, a list of some of the planetary images available elsewhere on the Net, some bits of history, several pages of data and a special plea for your support of the space program. The pages of this document are organized in a hierarchy based on the primary-satellite relationship. In addition, there are many hyperlinks enabling the interactive viewer to jump around and view the pages in many ways. If you “get lost” you can always jump back to the table of contents by clicking the NinePlanets icon at the bottom left of each page. And many pages have a Google search box where you can search for keywords in this site (or the whole web). At the bottom of each page is a set of links to other related pages. To visit the next body in an ordered traversal of the solar system choose the link immediately to the right of the name of the current page. You can also go back to the previous page, the “parent” page, the table of contents or to the detailed data page. I’ve chosen ten of the most interesting bodies and linked them into an Express Tour. If you don’t have time for the full tour, don’t miss these. And if you want to read offline or just explore in more depth, visit The Nine Planets Bookstore or the “Hardcopy” links found at the right side of some pages. Frequently Asked Questions Q: May I use your pictures for my class project? A: Yes. For other uses, please see my copyright page. Q: May I make a link to your site? A: Yes. You may make links to the whole site or any of the individual pages. Q: I want to see all this for myself. What kind of telescope should I buy? A: The best advice for new amateur astronomers is to find your local amateur astronomy club. They will have lots of scopes you can look thru and lots of knowledgeable people you can talk to. Here’s some more info and here’s a description of my telescopes and other goodies. All the planets and many of the larger moons can be seen with a modest telescope but it takes a little effort. (And the results don’t look like NASA’s; if they did, then we wouldn’t need NASA, after all 🙂 Q: When will the planets next line up? Will there be a disaster? A: Never. It can’t happen. And even if it did it would be no problem. The planets are too small to have a significant gravitational effect on the Earth. See the following for more information: Harmonic Con(game)vergence Phil Plait’s Bad Astronomy: Review: Tomb Raider Planets Alignments in 2000 – Griffith Observatory Planets Alignments: Fact or Fiction? An excellent article from the National Solar Observatory Q: Is there a tenth planet (Planet X)? Will it destroy the Earth? A: Maybe. No. It may turn out that some distant objects in the Kuiper Belt will eventually be classified as planets. But it’s not likely that any of them are particularly large as Planet X was supposed to be (more the size of Neptune). For more interesting stories about this topic see the Hypothetical Planets page by Paul Schlyter. Q: What about this tenth planet I’ve been hearing about since late 2005? A: The newly discovered Kuiper Belt object Eris (previously known as 2003UB313) is now classified as a “dwarf planet”, not a regular planet. Q: Is Pluto really a planet? A: No. The official arbiter of such questions is the IAU and they have decided that Pluto should be classified as a dwarf planet, a category distinct from regular planets. There are good arguments on both sides of this issue, however at this point it’s probably better to get on with the science and end this controversy about classification. Q: What’s the definition of “planet”, anyway? A: The recently adopted IAU resolution states that “planets” and other bodies in our Solar System be defined into three distinct categories in the following way: - A “planet” is a celestial body that (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, and (c) has cleared the neighbourhood around its orbit. - A “dwarf planet” is a celestial body that (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape2 , (c) has not cleared the neighbourhood around its orbit, and (d) is not a satellite. - All other objects3 except satellites orbiting the Sun shall be referred to collectively as “Small Solar-System Bodies”. So by this official definition there are exactly eight “planets”: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus and Neptune. Ceres, Pluto, and Eris (2003UB313) are now classificed as “dwarf planets”. A potentially large number of additional objects may fall into this category in the near future. Q: Where can I buy calendars, large prints and posters with astronomical images? A: Try online stores of The Planetary Society or the Astronomical Society of the Pacific. Q: What’s the mnemonic for remembering the order of the planets? A: Sadly, the old favorites no longer work: “My very excellent mother just sent us nine pizzas.” “Most voters earn money just showing up near polls!” “Mary’s violet eyes make Johnny stay up nights. Period” “My Very Easy Method Just Speeds Up Naming Planets.” Now that there are only officially eight planets: “My very easy method just seems useless now.” “My very excellent mother just sent us nachos.” Q: What does the “e” in some of your numbers mean? A: “times ten to the power”. So “1.2e3” means “1.2 times ten to the power 3” or “1200”. Or you can think of it as moving the decimal place to the right the number of digits after the “e”. You can see why we use this notation when the number after the “e” is large: “1.23e18” means “1230000000000000000”. Q: What’s the bright thing I’m seeing in the sky? A: The easiest way to figure out questions like this is with a “planetarium program”. There are lots of good ones. Some of are are fancy and expensive and intended for serious amateur astronomers; some are free; almost all will answer the basic questions. My favorite is Starry Night (for both Mac and PC). Q: How far away from Earth is Mars (or some other planet) right now? A: That is difficult to answer without a computer. You cannot simply subtract the average distance from the Sun of the two planets since it’s only at one special time when they’re both in a line with the Sun. Fortunately, most “planetarium programs” will do the trick. Q: How do you know that the world is so old? A: There are many lines of evidence all converging on an age for the whole universe of 13.7 billion years and 4.6 billion years for our solar system and the Earth. A detailed answer is beyond the scope of this FAQ. There’s a nice introduction at http://www.astrosociety.org/education/publications/tnl/56/ . Q: Why are the planets round? A: Think about what it would mean if a planet were not round (spherical). That would mean that some places on the surface are farther from the center than others (ie there would be mountains). As we know mountains do exist on the planets. But even the largest ones must be small compared to the radius of the planet (the height of tallest mountain in the solar system, Olympus Mons on Mars, is less than 1% of Mars’s radius). Why? Because if it were very much taller the rocks at the bottom would not be strong enough to hold it up. They would bend like plastic. Rock is simply not strong enough to support a mountain that is large compared to a planet. But on a smaller body, like some of the smaller moons and asteroids, the force of gravity is much weaker and so rock can support relatively large “mountains”. Q: Why do all the planets orbit in (approximately) the same plane? A: Because the Sun and the planets were originally condensed out of a spinning nebula of gas and dust. As it collapsed, the cloud flattened into a disk with the Sun at the center and the planets formed farther out. But why did all the dust (and gas, the vast majority of the mass) end up in a plane? Because if you start with a rotating irregular blob, which is the usual case, then collisions between the particles tend to average out the motions of the particles. Thus the motions perpendicular to the spin equator get zeroed out and the motions parallel to it get averaged to the general rotation rate. Q: Who discovered Jupiter (Saturn, Mars, Mercury, Venus)? A: Lots of people. Jupiter (and the other “classical” planets) have been known since before the beginning of history. This is not surprising since they are so bright and easy to see and so obviously different from the stars (since they move). See my chronology page for more recent discoveries. Q: Does our solar system have a name? Does our moon have a name? Does our sun have a name? A: No. No. No. Sorry. They should. But they don’t. At least not in English. There are, of course, many words used to refer to the Sun and the Moon in other languages. “Sol” and “Luna” are often thought of as proper names but they’re really Latin, not English. So far there hasn’t been a need for anything more. Maybe when we start living on other places besides the Earth…. Q: What’s the deal with astrology? A: It’s simply nonsense, a way to separate fools from their money. (The worst thing you can do to an astronomer is to call him an astrologer.) To be fair, in the past astrology was a legitimate field of study. Some of the great men of science, in particular Johannes Kepler, were astrologers. But in modern times we have come to realize that the basic idea of astrology, that the positions of the planets influence life on Earth, is not true. But due to the vagaries of history some astrological terminology (ie the names of the constellations) has survived in astronomy and in popular culture (“What’s your sign?”). Q: What about UFOs? A: There’s a huge amount written and talked about but don’t believe everything you read. I have never seen any credible evidence for UFOs. Q: My question isn’t here … A: If it’s a question about terminology, check the glossary. Other Solar System Info There are many other collections of information about the Solar System available on the World Wide Web: - Views of The Solar System, by Calvin J. Hamilton - Solar System Scope – Great new project for viewing the solar system - The Nine Planets – For Kids, a version of this site tailored for younger audiences - Kids Astronomy, another nice astronomy site for a younger audience - Universe Today – Space news from around the Internet, updated every weekday. - StarChild, A learning center for young astronomers - Welcome to the Planets from Jet Propulsion Laboratory; direct from “the source” - Exploring the Planets from the National Air and Space Museum - The Solar System by Ken Edgett of Arizona State University - Sol Station - Regional Planetary Image Facility at the Smithsonian Institution, Washington DC - The Solar System from the Royal Greenwich Observatory - National Space Science Data Center Photo Gallery (“NSSDC”) and a variety of information at the Planetary Sciences home page - Virtual Solar System from the National Geographic Society - NASA’s Planetary Science Research Discoveries, readable but peer-reviewed articles on current research - Planetary Tour Guide compiled by Gordon Johnston of NASA HQ. - Browse the Solar System from USGS - StarDate Guide To The Solar System from McDonald Observatory - Planets and the Solar System, a resource list from SEDS - Browse the Solar System (mostly data) from USGS Flagstaff - Updates to Jay Pasachoff’s textbook - Class notes by Nick Strobel of Bakersfield College - Class notes by Joseph Cain of Florida State University - Our Solar System from NASA - Solar System Live, the Interactive Orrery of the Web. - The Celestial Times — where to find the planets for the current month - NASA’s Twelve Year Planetary Ephemeris provides detailed and accurate geocentric positions - Planetary Remote Sensing (part of the awesome Remote Sensing Tutorial by Nicholas M. Short Sr.) - Planetary Tour Guide - Windows to the Universe, from the University of Michigan (very nice) - A Space Library, simulated views of the solar system, maps and more (from JPL) Most of the inline pictures here come from these sources. Without their efforts and the efforts of all the scientists and engineers at NASA and JPL this website would not be possible. Other Astronomical Pages - Bad Astronomy, many popular misconceptions clarified by Phil Plait - Astronomy educational resources from the ASP - Astronomy Activities - Astronomy Timeline - Earth & Sky, daily radio talk about astronomy - Astronomy Unbound, an electronic text - The Web Nebulae, a look at some of the most visually interesting objects outside the Solar System - The Messier Catalog from SEDS - Images of the Messier objects from the Digitized Sky Survey - The Constellations and their Stars by Chris Dolan - Space Physics Textbook - ExInEd page (nifty Hypercard Electronic PictureBooks) from Space Telescope Science Institute - Amazing Space - Earth & Sky, transcripts from the popular radio show - The Planets and Their Children-A Blockbook of Medieval Popular Astrology - The Basics of Spaceflight from JPL; includes a nice general astronomy tutorial - Encyclopedia Mythica Where to go next The full tour continues with the Overview (or if you’re in a hurry take the Express Tour)."
}