{
  "url": "https://rarediseases.org/",
  "title": "National Organization for Rare Disorders | NORD",
  "text": "Advancing Rare Disease Research with General Population Cohorts Published January 21, 2026 NORD advances practical, meaningful, and enduring change so people with rare diseases can live their fullest and best lives. Every day, we elevate care, advance research, and drive policy in a purposeful and holistic manner to lift up the rare disease community. Get help with access to medication, diagnostics, caregivers support, and other needs. Get supportLearn more about 1,200 rare diseases through our comprehensive database. Search nowNORD® Rare Disease Centers of Excellence are diagnosing and treating thousands of rare disease patients. Learn MoreAssist researchers throughout the world better understand and treat rare diseases by enrolling in our registry and sharing your experiences. Get involvedAdults living with rare disease and caregivers share their lived experiences to help drive positive change Participate TodayDiscover how your rare experiences can help researchers and lead to a brighter future. Learn MoreYou or a loved one has received a diagnosis. Now what? Gaining knowledge, connecting with advocacy organizations, and learning about treatment at places like the Centers for Excellence are the next steps. Published January 21, 2026 Published January 6, 2026 Published December 18, 2025 Published December 16, 2025 Published December 8, 2025 When: February 7 @ 11:00 am - February 25 @ 6:00 pm When: February 7 @ 1:00 pm - February 7 @ 2:30 pm When: February 10 @ 2:00 pm - February 10 @ 3:00 pm We help inform and advocate for legislation and policies that reflect the needs of rare disease patients and their families. We provide information about rare diseases, patient organizations and other resources. We also promote awareness of rare diseases among physicians and other medical professionals. We pioneered Patient Assistance Programs in 1987. Today, NORD programs include free drug, co-pay and premium assistance, travel/lodging assistance for clinical trials, expanded or emergency access, and more. Disease-specific patient organizations are crucial partners in our mission to serve rare disease patients and their families. That’s why we provide capacity building and mentorship services to start-up and established organizations. Our grant programs have resulted in numerous published advances and at least two FDA-approved therapies. NORD believes in the power of collaboration. It is the foundation upon which NORD was built. NORD works with partners in the patient community, government, academia, and industry who share the ultimate goal of identifying, treating, and curing rare diseases. In addition to the partnerships listed below, NORD works with many national partners to achieve its advocacy goals. The mission of NORD is to improve the health and well-being of people with rare diseases by driving advances in care, research and policy. NORD helps drive more effective government policies by elevating the voice of the rare disease community. Patient advocacy organizations play a vital role in helping people with rare diseases live their best and fullest lives. We can help you find one or even start your own. Please complete this form to access the requested resource."
}