{
  "url": "https://www.worldometers.info/time/new-delhi-india/",
  "title": "Time in New Delhi, India (LIVE)",
  "text": "Thursday, February 5, 2026 Currently, time in New Delhi is 10 hours and 30 minutes ahead of your location (Pompano Beach) New Delhi does not observe Daylight Saving Time, meaning clocks are never changed during the year. UTC (Coordinated Universal Time) is the worldâs primary time standard. All time zones are defined by how many hours they are ahead of (+) or behind (â) UTC. In many places, this offset changes twice a year because of Daylight Saving Time (DST). Some locations do not change their clocks. For example, New Delhi stays at UTC+5:30 year-round. UTC is computed by the Bureau International des Poids et Mesures (BIPM) using data from about 450 atomic clocks in 85 national laboratories worldwide. UTC offsets are unambiguous. Time zone abbreviations like âESTâ or âCSTâ are not, because they are used in multiple unrelated regions. For example: For most everyday purposes, GMT and UTC are the same, since both represent UTC+0. The difference is technical: Daylight Saving Time (DST) is when clocks are moved forward by one hour in spring (\"spring forward\") and moved back by one hour in fall (\"fall back\"). The purpose is to extend evening daylight. During DST, a location may use a different time zone name and a different UTC offset. Not all places observe DST. Some regions, such as most of Arizona and Hawaii in the United States, stay on the same time all year. For example, New Delhi stays on India Standard Time (IST, UTC+5:30) all year and does not switch for DST. No. The clock stays the same all year, and the UTC offset does not change. New Delhi is in the India Standard Time (IT). IANA (Internet Assigned Numbers Authority) time zone identifiers are the official, permanent names used by computers to handle time correctly, including DST rules. They use the format Continent/City, such as America/New_York or Europe/London . These identifiers ensure that devices automatically use the correct offset and DST transitions for each region. The IANA time zone identifier for New Delhi is Asia/Kolkata ."
}