{
  "url": "https://omviajesyrelatos.com/curiosidades-sobre-los-templos-de-angkor-en-camboya-misterios/",
  "title": "Curiosidades y misterios sobre los templos de Angkor (Camboya)",
  "text": "CURIOSIDADES Y MISTERIOS DE ANGKOR (CAMBOYA) «Siempre tengan un templo en su mira» (Tomás, V) Angkor Wat está ubicado en Siem Reap, Camboya: Es el complejo religioso más grande del mundo y es Patrimonio de la Humanidad por la UNESCO. Los míticos Templos de Angkor están llenos de curiosidades y misterios fascinantes: ¿Quieres conocer algunos de ellos?. 1. ANGKOR ES LA REPRESENTACIÓN EN LA TIERRA DEL UNIVERSO HINDÚ: LA PRINCINCIPAL CURIOSIDAD QUE DEBES CONOCER SOBRE ANGKOR El templo de Angkor Wat es una representación en piedra del universo cosmológico hindú y esconde grandes misterios. Son cinco grandes torres, con una torre central que representa al monte Meru y los cinco picos de esta montaña sagrada donde, según la mitología hindú, al igual que en el gran templo sagrado de Prambanan en la isla de Java (Indonesia), se encuentra el centro del universo cósmico en el que reside Shiva y sus divinidades. 2. CURIOSAMENTE ANGKOR ES EL RECINTO RELIGIOSO MÁS GRANDE DEL MUNDO Angkor posee dimensiones extraordinarias: Consta de tres recintos rectangulares concéntricos. El recinto interior está formado por cinco torres en forma de loto, que alcanzan una altura de 65 metros en su torre central. Es el mayor complejo religioso jamás construido, por delante de los Templos de Luxor y Karnak en Egipto y está considerado como uno de los tesoros arqueológicos más importantes del mundo. 3. 108, EL NÚMERO SAGRADO DE ANGKOR: UNA DE LAS CURIOSIDADES MÁS SORPRENDENTES DE ANGKOR Grábate bien esta cifra porque la verás por todas partes cuando visites los templos de Angkor: En total hay 108 torres, en forma de capullo de loto: 108 es el número sagrado en la filosofía yóguica, ligado a tradiciones orientales como el Budismo, el Hinduismo y el Jainismo, desde tiempos ancestrales. - El número 108 es un número que veremos repetido en numerosas ocasiones a lo largo de los templos de Angkor, como ya lo vimos en el magnífico templo de Borobudur en la isla de Java, con una estupa principal en la que hay 108 budas mirando cada punto cardinal del monumento. - El mágico número 108 se fue repitiendo a lo largo de nuestro recorrido por los templos de Angkor: curiosamente la distancia entre la tierra y la luna es 108 veces el diámetro de la luna y la distancia entre la tierra y el sol es 108 veces el diámetro del sol. - Tampoco es casualidad que existan 108 diosas en la mitología hindú, ni que se contabilicen 108 canales de energía en el cuerpo humano. - En el budismo chino y en la filosofía taoísta existen 108 santos (budas) o Arhants, es por ello que en estas corrientes filosóficas el último día del año, y a media noche, se hace sonar una campana 108 veces para ahuyentar a los malos espíritus. - A muchos de los templos de Angkor se accede por una escalinata formada por 108 peldaños, o de dos tramos de 54, o tres de 36: Los templos de Angkor están llenos de enigmas y simbolismos fascinantes. 4. LAS APSARAS O NINFAS DIVINAS Y SU CURIOSO SIGNIFICADO A lo largo de los templos de Angkor veremos más de 2000 figuras de ninfas divinas, de nombre Apsarás: Las apsarás eran ninfas acuáticas de la mitología hindú y aparecen de forma constante en los maravillosos bajo-relieves que decoran paredes y torres de los Templos de Angkor. Describen las mágicas leyendas hindúes: las eternas danzantes, que proporcionarían el mayor de los placeres sexuales a los valerosos guerreros que alcanzaran los cielos. En la religión védica (la primera religión conocida de la India, previa al hinduismo) el dios guerrero Indra era la divinidad principal de los textos védicos, pero luego fue desbancado de su puesto por Brahmá y especialmente por Visnú . Bajo sus instrucciones de Indra, las apsarás seducían a mortales, reyes y sabios, a quienes Indra consideraba amenazantes por su poder. RECOMENDADO: CURIOSIDADES SORPRENDENTES SOBRE INDONESIA 5. ANGKOR ES UN MARCADOR ASTRONÓMICO: LA CURIOSIDAD MÁS ASOMBROSA Los Templos de Angkor, según muchos arqueólogos, están alineados con la constelación de Draco (del Dragón), del mismo modo que las Pirámides de Egipto lo hacen con la constelación de Orión. Los templos de Angkor Wat son una alegoría del cielo en la tierra: En sintonía con el sol y la luna, los bajo-relieves, según los últimos estudios, sorprendentemente, parecen funcionar como un marcador para los días entre solsticios de invierno y verano, al igual que el prehistórico Stonehenge en Inglaterra. En 1976, varios científicos estadounidenses daban a conocer, a través de un revelador artículo publicado en la revista Science, unas revelaciones asombrosas sobre los templos de Angkor Wat. Los sacerdotes y astrónomos camboyanos emplearon en la construcción del recinto de Angkor Wat una medida conocida como el “codo camboyano”, cuya longitud equivale a 0,43545 metros. Asombrosamente, los muros exteriores del recinto de Angkor Wat, tienen una longitud doce veces 365,24 codos, es decir, la duración exacta del año solar. Y por si fuera poco, los ejes norte-sur y este-oeste del recinto interior que alberga la torre central, arroja una cifra casi idéntica: 365,37 codos: la duración del ciclo solar anual: Un descubrimiento, sin duda, sorprendente. Como ves, visitar los templos de Angkor puede ser una experiencia increíble y lo es todavía más, cuando se conocen algunos misterios, leyendas y curiosidades sobre esta magnífica construcción. Los templos de Angkor son fascinantes desde el primer momento en que se visitan: Anótalos como uno de los viajes que hay que hacer al menos, una vez en la vida: Te encantarán. - Inspiración viajera: Guía completa para visitar los Templos de Angkor en Camboya - Guía de viaje: Guía para viajar a Camboya - Lugares: Qué ver en Camboya - Curiosidades: Curiosidades y misterios sobre los Templos de Angkor - Top 10 Siem Reap: 10 Cosas chulas que hacer en Siem Reap - Templos: Guía para visitar Bayon, el Templo de las mil caras de Angkor - Templos: Preah Khan: Guía completa para visitar el Templo de la Espada Sagrada en Angkor - Templos: Ta Prohm: Guía para visitar el fascinante templo de Tomb Raider en Camboya - Templos desconocidos: Guía para visitar Beng Mealea: El Templo escondido en las junglas de Camboya Felices viajes. SI TE HA GUSTADO EL ARTÍCULO SOBRE LAS CURIOSIDADES DE ANGKOR, PUEDES GUARDARLO EN PINTEREST"
}