{
  "url": "https://flyertalk.com/articles/british-airways-unveils-new-first-class-seating.html",
  "title": "British Airways Unveils New First Class Seating – FlyerTalk - The world's most popular frequent flyer community",
  "text": "British Airways Unveils New First Class Seating The flag carrier announced the vision for their new premium cabin on Monday, November 25, 2024. New First Class Designed to Invoke Feelings of Luxury Hotel The airline worked with a number of designers and providers across the United Kingdom and Ireland to design the new first class cabin. The goal is to give flyers the experience of a luxury hotel in the sky. Entering the suite, flyers will notice the ultra-wide seat at 36.5 inches, which converts to a 79-inch bed. The seat is adjusted within the “cocooned 60-inch curved wall for ultimate privacy.” The natural curves are inspired by Speedbird’s Concorde wings, creating a natural flow to the space. Instead of stowing items in an overhead bin, flyers will be treated to a personal closet space inside the suite. Carry-on luggage and coats fit easily in the space, giving travelers an easier way to relax as they board the aircraft. For those flyers traveling together, booking the interior suites can be converted into one large space by lowering the divider. With large stowable tables, the travelers can enjoy “buddy dining” when it comes to enjoying mealtime. Flyers can enjoy their favorite movies and shows on a 32-inch in-flight entertainment screen. To compliment the experience, guests can also choose from several different mood lighting options, including scenes of ranging from “cinema” to “dining.” The new suite is expected to debut in mid-2026, starting with the airline’s retrofit of their Airbus A380 aircraft. It is part of the carrier’s multi-billion dollar transformation scheme, which includes improving the short-haul passenger experience, adding free wi-fi messaging, and refreshing airport lounges. Share your thoughts on the new British Airways First Class cabin on the FlyerTalk forums. All images courtesy: British Airways"
}