{
  "url": "https://finance.yahoo.com/quote/JNUG/",
  "title": "Direxion Daily Junior Gold Miners Index Bull 2X Shares (JNUG) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "Direxion Daily Junior Gold Miners Index Bull 2X Shares (JNUG) - Previous Close 256.75 - Open 271.53 - Bid 257.63 x 50000 - Ask 261.00 x 40000 - Day's Range 238.50 - 270.98 - 52 Week Range 43.17 - 363.00 - Volume 311,889 - Avg. Volume 325,467 - Net Assets 576.37M - NAV 256.58 - PE Ratio (TTM) 28.48 - Yield 1.04% - YTD Daily Total Return 24.31% - Beta (5Y Monthly) 1.03 - Expense Ratio (net) 1.02% The index tracks the performance of domestic and foreign, including developing and emerging, small- and mid-capitalization companies that are involved in the gold and silver mining industry. The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and exchange-traded funds (\"ETFs\") that track the index, that, in combination, provide 2X daily leveraged exposure to the index, consistent with the fund's investment objective. It is non-diversified. Direxion Funds Fund Family Trading--Leveraged Equity Fund Category 576.37M Net Assets 2013-10-03 Inception Date Performance Overview: JNUG View MoreTrailing returns as of 2/3/2026. Category is Trading--Leveraged Equity. People Also Watch Holdings: JNUG View MoreTop 1 Holdings (35.17% of Total Assets) Sector Weightings Recent News: JNUG View MoreResearch Reports: JNUG View MoreRaising target price Barrick Gold engages in the production and sale of gold, including exploration, development, mining, and processing and operates in 18 countries. Barrick was founded in 1983 and is based in Toronto. RatingPrice TargetThe S&P 500 has rebounded from its recent slide and logged yet another very The S&P 500 has rebounded from its recent slide and logged yet another very minor all-time high (ATH). Despite the plethora of eye-catching headlines, volatility remains muted -- with the VIX mostly stuck in the 14% to 22% range going back to April 2025. The width of the daily Bollinger Bands has been tight going back to May 2025 and those bands also are now very tight on a weekly basis. Since the November slide in stocks, price has compressed and we have printed higher lows and very minor price highs. Tight price action can be equated to holding a ball under water. And we all know what happens when you let go of that ball. Perhaps this earnings season will be the catalyst for a big move of some type and, for now, we are leaning towards an upside breakout. Freeport-McMoRan Earnings: Stronger Copper and Gold Prices More than Offset Lower Grasberg Volumes Freeport-McMoRan owns stakes in 10 copper mines, led by its 49% ownership of the Grasberg copper and gold operations in Indonesia, 55% of the Cerro Verde mine in Peru, and 72% of Morenci in Arizona. It sold around 1.1 million metric tons of copper (its share) in 2025, making it the one of the world’s largest copper miners by volume. It also sold about 530,000 ounces of gold, mostly from Grasberg, and 74 million pounds of molybdenum. It had about 25 years of copper reserves at the end of December 2025. We expect it to sell about 1.3 million metric tons of copper and 610,000 ounces of gold midcycle in 2030. RatingPrice TargetRaising target price to $20.00 HECLA MINING CO has an Investment Rating of HOLD; a target price of $20.000000; an Industry Subrating of Medium; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High. RatingPrice Target"
}