{
  "url": "https://support.google.com/a/users/answer/9300311?hl=en",
  "title": "Create your first document in Google Docs - Google Workspace Learning Center",
  "text": "On this page Create or import a document Create and name your document You can also: At the top of the page, click Untitled document and enter a new title. Import and convert an existing document Converting your file from another program creates a copy of your original file in a Docs, Sheets, or Slides format. You can then edit the file in your browser. If you have existing files, you can import and convert them to Docs, Sheets, or Slides. - Go to Drive. - Click NewFile Upload. - Choose the file you want to import from your computer to add it to Drive. - In the Upload complete window, click Show file location . - Right-click the file and select Open withGoogle Docs/Sheets/Slides. Have a Microsoft file? If you've already stored Microsoft files in Drive, you can also update them without converting them. Update a document Add or edit text Just click in the page and start typing. Format your document Depending on what you want to change, choose an option: - To customize margins, page color, and orientation, click FilePage setup. - To customize text, images, tables, and more, use the toolbar options. Note: Some options only appear for certain types of content, such as tables or images. Add pictures, links, tables, and more The Insert menu lets you add different features to your document. Here are the highlights: Image—Insert an image from your computer, the web, Drive, and more. Table—Select the number of columns and rows to create a table. Drawing—Create shapes, pictures, and diagrams right in your document. Link—Add a link to another page or to a header or bookmark in the same document. Bookmark—Add shortcuts to specific places within your document. Table of contents—Create an auto-generated table of contents that links to each heading in your document that has a heading style applied. Print your document from Chrome browser - On your computer, open a document in Google Docs. - Click File Print. - In the window that opens, choose your print settings. - Click Print. Use Gemini to create & update content You can use this feature only if your organization supports it. For help, contact your administrator. Google Workspace with Gemini is available when your Google account language is set to an English dialect. Additionally, some features are available in Spanish and Portuguese. Learn more about language availability. Use Google Workspace with Gemini to create placeholder content you can refine and update. - On your computer, open a Google Doc file. - In the document, click where you want to write. - On the left, click Help me write . - Enter a prompt that contains your instructions. For example: Imagine you are the lead on a project. Write an update to your executive leadership team on [Project X]. Include the current status for each business function and next steps. Use a formal, brief tone. - Click Create. - Review the response. - (Optional) Click Refine then choose how you want Gemini to change the content. - When you're finished, click Insert. Google, Google Workspace, and related marks and logos are trademarks of Google LLC. All other company and product names are trademarks of the companies with which they are associated."
}