{
  "url": "https://www.36kr.com/p/2944425372212100",
  "title": "特朗普带火的安克创新，上半年赚了8个亿 | 焦点分析-36氪",
  "text": "特朗普带火的安克创新，上半年赚了8个亿 | 焦点分析 文｜张子怡 编辑｜袁斯来 驶离“浅海”领域的第二年，安克创新正在找回其增长锚点。 安克创新于近期发布的2024年半年报显示，公司实现营业总收入96.48亿元，同比增长36.55%；实现归属上市公司股东的净利润8.72亿元，同比增长6.36%。 具体到收入结构来看，安克创新的充电类储能产品占营收半壁江山，达49.75亿元，同比增长在所有业务中也最快，达42.81%。公司称，充电类产品是公司最早推出的产品品类，也是公司持续突破、不断抓住市场机会的重要发展领域。 有趣的是，四年前，安克创新有意摘掉「充电宝一哥」的帽子，在营收近百亿的阶段，提出“浅海战略”——通过更多细分品类的扩张，晋级为一家更重量级的公司。此后两年间，安克创新从1600人扩张到4000人，陆续成立储能、割草机器人、3D打印等总计27个产品团队。 理想伟大，现实残酷。以“浅海战略”扩张的安克创新并没有收获其想要的成绩，于2022年陆续关掉10个产品团队，重新加固其「充电」标签，并在在已有品类中深耕，停止扩充品类。 安克创新业务重新聚焦，既有内部战略调整的缘故，也有外部世界的变迁。 跨境电商行业不再像过去一般依赖于单一平台（亚马逊），随着“出海四小龙”在海外的狂飙猛进，跨境电商企业面临更多的平台选择，势必要付出更大的投入、卷入更激烈的竞争。 安克的财报数据证明了它做出正确的选择。在动荡和残酷的电商行业，它已经为自己筑好足够深厚的城墙。 01 聚焦业务之后 安克创新在国内最近一次的大范围“出圈”是因为特朗普， 8月13日，马斯克与特朗普进行的一场直播对话中，特朗普使用的充电宝被观众发现是安克创新所生产。 特朗普使用的是Anker MagGo系列产品。该型号充电宝在京东商城有售，价格为399元，在亚马逊的售价则为89.99美元，合约人民币646元。 可以看出，安克创新产品的单价水平不低，定位偏向中高端，京东与亚马逊定价的差异水平也能证明其产品在海外的竞争能力。 相比较而言，绿联科技的充电类产品单价持续走低，仅在47元左右；品胜电子22年充电类产品的平均单价在79元左右。 得益于中高客单价的定位，安克创新的毛利率水平在业内一直属于领先的水平。安克创新不同于其他3C配件的另一特点是其在研发上的持续加大投入，并且会投资其产业上游企业，一方面让其产品保持创新能力，另一方面也在整合供应链的过程中降低其成本。 图片来源华泰研究 华创证券分析发现，近两年产品成本对于公司毛利率的提升贡献较大。尤其在2023年海运费用回落阶段，安克的运输成本并未同步下行，使得其对毛利的优化贡献相对有限，这与市场的直观感受存在偏差。 图片来源华创证券 运输成本未同步下行的阶段，毛利率的优化来自于其产品成本。 氮化镓技术在充电领域的应用仍在迭代升级。当前较为主流的技术路线是将分立式(discrete)方案转向集成式(integrity)氮化镓解决方案，缩小设计体积的同时优化整体成本。而安克参投的行业龙头Navitas曾在22年9月率先发布GaNSense半桥氮化镓功率芯片， 华创证券发现，安克采用集成氮化镓解决方案有效降低产品成本。23年安克推出的全氮化镓充电器(67W 2C1A)在零部件数量、电路元件以及产品体积上明显优于22年的同类产品(65W 2C1A)。伴随产品设计方面的持续降本，公司供应链效率或得到进一步提升。 过去，安克创新在不同领域持续的投入，让有限资源的被动摊薄，间接影响业务的整体增长。改变战略之后，聚焦核心品类，对安克创新的好处是能即持续将资源投入在单一赛道中，获得更丰富的回报。 02 应对渠道变化 今年上半年，安克创新销售费用的增幅达到近三年来最高点。安克创新半年报显示，上半年销售费用为21.15亿元，同比增长40.56%。 安克创新解释称，随着业务增长，销售宣传推广费用、销售平台费用、以及销售人员薪酬费用增加所致。 销售费用的大增的背后是竞争激烈的跨境电商行业，不同于过去亚马逊的一家独大，中国跨境电商平台的出海让入局者增多的同时，对品牌卖家而言是挑战也是机会。 安克创新在加入新的跨境电商平台方面，动作相当积极，也有一定成效。 EchoTik数据显示，安克创新在美国有两家本土小店，分别是品牌旗舰店AnkerUS，该小店主要热销产品为便携式充电宝、户外电源、通用配件、投影仪等；另一家店Anker Innovation主要销售数码3C类的副线产品，比如蓝牙耳机等。旗舰店AnkerUS自2023年9月入驻TikTok Shop以来，总销量超过33万件，预估GMV近1050万美元。 安克创新在TikTok近30天动销的65件商品中，通用配件类目商品占主导地位。从出单商品价格分布来看，单价100美元以内的商品销量最高。其次为100-200美元单价商品。高价市场仍有较大的发展空间。 如果只看安克创新在TikTok上的GMV和产品销售单价，还无法和亚马逊相提并论。 但显然安克很舍得投入。数位TikTok卖家告诉36氪：“TikTok做电商业务，需要花费大量费用，包括寻找达人的带货费用、视频的投流费用，今年加入的卖家越来越多后，投流费用越来越贵。” 这也侧面能说明，在Tiktok Shop上获得不错成绩的安克创新，大概率为其花费不少。 当然，对于安克创新这类大品牌而言，新兴的跨境电商平台欢迎之余也会给予一定支持。 去年，SHEIN美国站上线后，安克创新成为首批入驻品牌之一。加入SHEIN的安克创新在当时的产品销售定价同亚马逊保持一致。并且有报道称，SHEIN会在入驻前三个月内免销售佣金，后续全品类销售费率为10%，低于亚马逊的费用水平。 今年上半年，线上渠道对安克创新的营收贡献超六成，且在持续上升，亚马逊在这其中占比则超五成，有下降趋势。平台与卖家的关系既是相辅相成，也有相互牵制之感。过度依赖单一平台对于品牌而言也是危险。 过去，安克创新为了避免对亚马逊平台依赖过深，发展独立站和线下渠道都十分积极。然而自去年开始，安克创新在线下渠道的发展速度放缓。 安克创新对于该问题曾回答投资人称：“全球电商渗透率持续提升，线上渠道相对增速更快。此外，公司也在逐步调整线下渠道策略，积极聚焦长期高质量发展，与此相对应，公司2023年线下渠道毛利率同比提升6.91个百分点。” 显然，跨境电商平台的增多给了安克创新持续发展线上渠道的底气。 作为头部大卖，安克创新会抓住新平台崛起的红利。在和亚马逊绑定多年后，安克创新有自己的焦虑。 它不会拒绝新机会。"
}