{
  "url": "https://en.wikipedia.org/wiki/House_(TV_series)",
  "title": "House (TV series) - Wikipedia",
  "text": "House (TV series) House (also known as House, M.D.) is an American medical drama television series created by David Shore for Fox. It originally aired for eight seasons from November 16, 2004 to May 21, 2012. It features the life of Dr. Gregory House (Hugh Laurie), an unconventional, misanthropic, cynical medical genius who, despite his dependence on pain medication, successfully leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital (PPTH) in New Jersey. House often clashes with his fellow physicians, including his own diagnostic team, because many of his hypotheses about patients' illnesses are based on subtle or controversial insights, and his flouting of hospital rules and procedures frequently leads him into conflict with his boss, hospital administrator and Dean of Medicine Dr. Lisa Cuddy (Lisa Edelstein). House's only true friend is Dr. James Wilson (Robert Sean Leonard), head of the Department of Oncology. During the first three seasons, House's diagnostic team consists of Dr. Robert Chase (Jesse Spencer), Dr. Allison Cameron (Jennifer Morrison), and Dr. Eric Foreman (Omar Epps). At the end of the third season, this team disbands. Rejoined by Foreman, House gradually selects three new team members: Dr. Remy \"Thirteen\" Hadley (Olivia Wilde), Dr. Chris Taub (Peter Jacobson), and Dr. Lawrence Kutner (Kal Penn). Chase and Cameron continue to appear occasionally in different roles at the hospital. Kutner dies late in season five; early in season six, Cameron departs the hospital, and Chase returns to the diagnostic team. Thirteen takes a leave of absence for most of season seven, and her position is filled by medical student Martha M. Masters (Amber Tamblyn). Cuddy and Masters depart before season eight; Foreman becomes the new Dean of Medicine, while Dr. Jessica Adams (Odette Annable) and Dr. Chi Park (Lo Mutuc) join House's team. The premise of House originated with Paul Attanasio, while Shore was responsible for conceiving the titular character. The series' executive producers included Shore, Attanasio, Attanasio's business partner Katie Jacobs, and film director Bryan Singer. It was filmed largely in a neighborhood and business district in Los Angeles County's Westside called Century City. The series was produced by Attanasio and Jacobs' Heel and Toe Films, Shore's Shore Z Productions, Singer's Bad Hat Harry Productions, and Universal Television. House was among the top 10 series in the United States from its second through fourth seasons. Distributed to 71 countries, it was the most-watched TV program in the world in 2008.[3] It received numerous awards, including five Primetime Emmy Awards, two Golden Globe Awards, a Peabody Award, and nine People's Choice Awards. On February 8, 2012, Fox announced that the eighth season, then in progress, would be its last.[4] The series finale aired on May 21, 2012, following an hour-long retrospective. Production [edit]Conception [edit]In 2004, David Shore and Paul Attanasio, along with Attanasio's business partner Katie Jacobs, pitched the series (untitled at the time) to Fox as a CSI-style medical detective program,[5] a hospital whodunit in which the doctors investigated symptoms and their causes;[6] the main character would be loosely based on Arthur Conan Doyle's \"Sherlock Holmes\".[7] Attanasio was inspired to develop a medical procedural drama by The New York Times Magazine column \"Diagnosis\", written by physician Lisa Sanders, who is an attending physician at Yale–New Haven Hospital (YNHH); the fictitious Princeton–Plainsboro Teaching Hospital (PPTH, not to be confused with the University Medical Center of Princeton at Plainsboro) is modeled after this teaching institution.[8] Fox bought the series, although the network's then-president, Gail Berman, told the creative team, \"I want a medical show, but I don't want to see white coats going down the hallway.\"[9] Jacobs has said that this stipulation was one of many influences leading to the show's ultimate form.[9] We knew the network was looking for procedurals, and Paul [Attanasio] came up with this medical idea that was like a cop procedural. The suspects were the germs. But I quickly began to realize that we needed that character element. I mean, germs don't have motives. After Fox picked up the show, it acquired the working title Chasing Zebras, Circling the Drain[11] (\"zebra\" is medical slang for an unusual or obscure diagnosis, while \"circling the drain\" refers to terminal cases, patients in an irreversible decline).[12] The original premise of the show was of a team of doctors working together trying to \"diagnose the undiagnosable\".[13] Shore felt it was important to have an interesting central character who could examine patients' personal characteristics and diagnose their ailments by figuring out their secrets and lies.[13] As Shore and the creative team explored the character's possibilities, the program concept became less of procedure and more focused upon the lead role.[14] The character was named \"House\", which was adopted as the show's title as well.[11] Shore developed the characters further and wrote the script for the pilot episode.[5] Bryan Singer, who directed the pilot episode and had significant input in casting the primary roles, has said that the \"title of the pilot was 'Everybody Lies', and that's the premise of the show\".[14] Shore has said that the central storylines of several early episodes were based on the work of Berton Roueché, a staff writer for The New Yorker between 1944 and 1994, who specialized in features about unusual medical cases.[6] Shore traced the concept for the titular character to his experience as a patient at a teaching hospital.[15] He recalled, \"I knew, as soon as I left the room, they would be mocking me relentlessly [for my cluelessness] and I thought that it would be interesting to see a character who actually did that before they left the room.\"[16] A central part of the show's premise was that the main character would be disabled in some way.[17] The original idea was for House to use a wheelchair, but Fox rejected this. Jacobs later expressed her gratitude for the network's insistence that the character be reimagined—putting him on his feet added a crucial physical dimension.[14] The writers ultimately chose to give House a damaged leg arising from an incorrect diagnosis, which requires him to use a cane and causes him pain that leads to a narcotic dependency.[17] References to Sherlock Holmes [edit]References to fictional detective Sherlock Holmes appear throughout the series.[18][19] Shore explained that he was always a Holmes fan and found the character's indifference to his clients unique.[16] The resemblance is evident in House's reliance on inductive reasoning[18] and psychology, even where it might not seem obviously applicable,[12] and his reluctance to accept cases he finds uninteresting.[20] House's investigatory method is to eliminate diagnoses logically as they are proved impossible; Holmes uses a similar method.[11] Both characters play instruments (House plays the piano, the guitar, and the harmonica; Holmes, the violin) and take drugs (House is dependent on Vicodin; Holmes uses cocaine recreationally).[18] House's relationship with Dr. James Wilson echoes that between Holmes and his confidant, Doctor Watson.[11] Robert Sean Leonard, who portrays Wilson, said that House and his character were originally intended to work together much as Holmes and Watson do; in his view, House's diagnostic team has assumed that aspect of the Watson role.[21] Shore said that House's name itself is meant as \"a subtle homage\" to Holmes.[11][22] House's address is 221B Baker Street, a direct reference to Holmes's street address.[12] Wilson's address is also 221B.[23] Individual episodes of the series contain additional references to the Sherlock Holmes tales. The main patient in the pilot episode is named Rebecca Adler after Irene Adler, a character in the first Holmes short story, \"A Scandal in Bohemia\".[24] In the season two finale, House is shot by a crazed gunman credited as \"Moriarty\", the name of Holmes's nemesis.[25] In the season four episode \"It's a Wonderful Lie\", House receives a \"second-edition Conan Doyle\" as a Christmas gift.[26] In the season five episode \"The Itch\", House is seen picking up his keys and Vicodin from the top of a copy of Conan Doyle's The Memoirs of Sherlock Holmes.[27] In another season five episode, \"Joy to the World\", House, in an attempt to fool his team, uses a book by Joseph Bell, Conan Doyle's inspiration for Sherlock Holmes.[11] The volume had been given to him the previous Christmas by Wilson, who included the message \"Greg, made me think of you.\" Before acknowledging that he gave the book to House, Wilson tells two of the team members that its source was a patient, Irene Adler.[28] Season 7 episode 3 includes a young adult boyhood detective book series written by the patient, whose final unpublished volume concludes with an ambiguous ending for the main character, reminiscent of \"The Final Problem\". The series finale also pays homage to Holmes's apparent death in \"The Final Problem\", the 1893 story with which Conan Doyle originally intended to conclude the Holmes chronicles.[29] Production team [edit]House was a co-production of Heel and Toe Films, Shore Z Productions, and Bad Hat Harry Productions in association with Universal Network Television for Fox.[30] Paul Attanasio and Katie Jacobs, the heads of Heel and Toe Films; David Shore, the head of Shore Z Productions; and Bryan Singer, the head of Bad Hat Harry Productions, were executive producers of the series for its entirety.[15] Lawrence Kaplow, Peter Blake, and Thomas L. Moran joined the staff as writers at the beginning of the first season after the making of the pilot episode. Writers Doris Egan, Sara Hess, Russel Friend, and Garrett Lerner joined the team at the start of season two. Friend and Lerner, who are business partners, had been offered positions when the series launched, but turned the opportunity down. After observing the show's success, they accepted when Jacobs offered them jobs again the following year.[31] Writers Eli Attie and Sean Whitesell joined the show at the start of season four; Attie would stay on the show's writing staff through the series finale, which he co-wrote. From the beginning of season four, Moran, Friend, and Lerner were credited as executive producers on the series, joining Attanasio, Jacobs, Shore, and Singer.[30] Hugh Laurie was credited as an executive producer for the second[32] and third[33] episodes of season five.[citation needed] Shore was House's showrunner.[34] Through the end of the sixth season, more than two dozen writers had contributed to the series. The most prolific were Kaplow (18 episodes), Blake (17), Shore (16), Friend (16), Lerner (16), Moran (14), and Egan (13). The show's most prolific directors through its first six seasons were Deran Sarafian (22 episodes), who was not involved in season six, and Greg Yaitanes (17). Of the more than three dozen other directors who have worked on the series, only David Straiton directed as many as 10 episodes through the sixth season. Hugh Laurie directed the 17th episode of season six, \"Lockdown\".[35] Elan Soltes was the visual effects supervisor since the show began.[36] Lisa Sanders, an assistant clinical professor of medicine at the Yale School of Medicine, was a technical advisor to the series. She writes the \"Diagnosis\" column that inspired House's premise.[37] According to Shore, \"[T]hree different doctors ... check everything we do\".[38] Bobbin Bergstrom, a registered nurse, was the series' on-set medical advisor.[38] Casting [edit]At first, the producers were looking for a \"quintessentially American person\" to play the role of House.[39] Bryan Singer in particular felt there was no way he was going to hire a non-American actor for the role.[13] At the time of the casting session, actor Hugh Laurie was in Namibia filming the movie Flight of the Phoenix. He assembled an audition tape in a hotel bathroom, the only place with enough light,[39] and apologized for its appearance[40] (which Singer compared to a \"bin Laden video\").[41] Laurie improvised, using an umbrella for a cane. Singer was very impressed by his performance and commented on how well the \"American actor\" was able to grasp the character.[13][42] Singer was not aware that Laurie was English, due to his American accent. Laurie credits the accent to \"a misspent youth [watching] too much TV and too many movies\".[39] Although locally better-known actors such as Denis Leary, David Cross, Rob Morrow, and Patrick Dempsey were considered for the part, Shore, Jacobs, and Attanasio were as impressed as Singer and cast Laurie as House.[43] It wasn't a massive move when I first considered [doing House]. What usually happens is you do a pilot and of the very few picked up, only about a quarter go to a second year. So I thought I'll have three fun weeks. I never dreamed I'd be here three and a half years later. Laurie later revealed that he initially thought the show's central character was Dr. James Wilson. He assumed that House was a supporting part, due to the nature of the character, until he received the full script of the pilot episode.[45] Laurie, the son of medical doctor Ran Laurie, said he felt guilty for \"being paid more to become a fake version of [his] own father\".[39] From the start of season three, he was being paid $275,000 to $300,000 per episode, as much as three times what he had previously been making on the series.[46] Laurie was earning around $400,000 per episode by the fifth season,[47] and $700,000 per episode for the final season, making him one of the highest-paid actors on network television.[48][49] Robert Sean Leonard had received the script for the CBS show Numb3rs as well as that for House.[50] Leonard thought the Numb3rs script was \"kind of cool\" and planned to audition for the show.[50] However, he decided that the character he was up for, Charlie Eppes, was in too many scenes; he later observed, \"The less I work, the happier I am\".[50] He believed that his House audition was not particularly good, but that his lengthy friendship with Singer helped win him the part of Dr. Wilson.[50] Singer had enjoyed Lisa Edelstein's portrayal of a high-priced call girl putting herself through law school on The West Wing, and sent her a copy of the pilot script.[51] Edelstein was attracted to the quality of the writing and her character's \"snappy dialogue\" with House, and was cast as Dr. Lisa Cuddy.[51] Australian actor Jesse Spencer's agent suggested that he audition for the role of Dr. Robert Chase. Spencer believed the program would be similar in style to General Hospital but changed his mind after reading the scripts.[52] After he was cast, he persuaded the producers to turn the character into an Australian.[53] Patrick Dempsey also auditioned for the part of Chase; he later became known for his portrayal of Dr. Derek Shepherd on Grey's Anatomy.[54] Omar Epps, who plays Dr. Eric Foreman, was inspired by his earlier portrayal of a troubled intern on the NBC medical drama ER;[55] his character was given the name \"Eric Foreman\" despite the fact that Fox was still airing That '70s Show when House premiered and had the similarly named Eric Forman as that series' main protagonist. (The two series overlapped on Fox's schedule for two seasons, though Topher Grace left That '70s Show at the end of its 7th season and House's first, only returning for that show's series finale.) Jennifer Morrison felt that her audition for the part of Dr. Allison Cameron was a complete disaster.[56] However, before her audition, Singer had watched some of her performances, including on Dawson's Creek, and already wanted to cast her in the role.[56] Morrison left the show when her character was written out in the middle of season six.[57] At the end of season three, House dismisses Chase, while Foreman and Cameron resign.[58] After an episode in which he \"borrows\" a janitor whom he calls \"Dr. Buffer\" to assist in a diagnosis, House must then recruit a new diagnostic team, for which he identifies seven finalists. The producers originally planned to recruit two new full-time actors, with Foreman, who returns in season four's fifth episode, bringing the team back up to three members; ultimately, the decision was made to add three new regular cast members.[59] Along with Epps, actors Morrison and Spencer remained in the cast, as their characters moved on to new assignments. During production, the show's writers dismissed a single candidate per episode; as a result, said Jacobs, neither the producers nor the cast knew who was going to be hired until the last minute.[60] In the season's ninth episode, House's new team is revealed: Foreman is joined by doctors Lawrence Kutner (Kal Penn),[61] Chris Taub (Peter Jacobson),[62] and Remy \"Thirteen\" Hadley (Olivia Wilde).[63] The candidates rejected by House did not return to the show, with the exception of the last one cut: Amber Volakis (Anne Dudek), who appeared in a recurring role for the rest of season four as Wilson's girlfriend,[64] a recurring role in season five as a hallucination of House's, returning as such in the series finale.[65] While Penn and Wilde had higher profiles than the actors who played the other finalists, Jacobs said they went through an identical audition process and stayed with the show based on the writers' interest in their characters.[60] Kutner was written out of the series in episode 20 of season 5 after Penn took a position in the Obama White House Office of Public Engagement and Intergovernmental Affairs.[66] The contracts of Edelstein, Epps, and Leonard expired at the end of season seven. As a cost-cutting measure, the three actors were asked to accept reduced salaries. Epps and Leonard came to terms with the producers, but Edelstein did not, and in May 2011, it was announced that she would not be returning for the show's eighth season.[67] Filming style and locations [edit]House is often filmed using the \"walk and talk\" filming technique,[9][20] popularized on television by series such as St. Elsewhere, ER, Sports Night, and The West Wing.[68] The technique involves the use of tracking shots, showing two or more characters walking between locations while talking.[68] Executive producer Katie Jacobs said that the show frequently uses the technique because \"when you put a scene on the move, it's a ... way of creating an urgency and an intensity\".[9] She noted the significance of \"the fact that Hugh Laurie spans 6'2\" and is taller than everybody else because it certainly makes those walk-and-talks pop\".[9] Nancy Franklin of The New Yorker described the show's \"cool, Fantastic Voyage–like special effects of patients' innards. I'll bet you didn't know that when your kidneys shut down they sound like bubble wrap popping.\"[69] \"Cameras and special effects travel not only down the throat\" of one patient, another critic observed, \"but up her nose and inside her brain and leg\".[70] Instead of relying primarily on computer-generated imagery, the interior body shots tend to involve miniature effects and motion control photography.[36] Many of the sets are dressed with a variety of unscripted props that allow Laurie to physically improvise, revealing aspects of his character and the story.[9] The pilot episode was filmed in Vancouver; primary photography for all subsequent episodes took place on the Fox lot in Century City, Los Angeles.[38] Bryan Singer chose the university near his hometown, West Windsor, New Jersey, as the show's fictional setting.[15] Princeton University's Frist Campus Center[e] is the source of the aerial views of Princeton–Plainsboro Teaching Hospital seen in the series.[72] Some filming took place at the University of Southern California for the season-three episode \"Half-Wit\", which guest-starred Dave Matthews and Kurtwood Smith.[73] Part of House's sixth season was filmed at the abandoned Greystone Park Psychiatric Hospital, in Parsippany-Troy Hills, New Jersey, as the fictional Mayfield Psychiatric Hospital.[74] Title sequence [edit]The opening sequence begins with an MRI of a head with an image of the boxed \"H\" from the logo (the international symbol for hospital) in the foreground. This is then overlaid with an image of Dr. House's face taken from the pilot episode with the show's full title appearing across his face. House's head then fades and the show's title is underlined and has the \"M.D.\" appear next to it, producing the entire logo of the show. This was the full extent of the title sequence in the pilot episode.[75] All subsequent episodes contain a longer sequence including the names of the six featured cast members and creator David Shore. Laurie's name appears first, followed by the names of the five other featured cast members in alphabetical order (Edelstein, Epps, Leonard, Morrison, and Spencer), then Shore.[76] After the show's title fades, an aerial view of PPTH (actually various Princeton University buildings, primarily Frist Campus Center)[72] is followed by a series of images accompanying each member's name; most are shown next to, or superimposed upon, illustrations of human anatomy. Laurie's name appears next to a model of a human head with the brain exposed; Edelstein's name appears next to a visual effects–produced graphic of an angiogram of the heart. Epps's name is superimposed upon a rib cage X-ray; Leonard's name appears on a drawing of the two hemispheres of the brain.[76] The producers originally wanted to include an image of a cane and an image of a Vicodin bottle, but Fox objected. Morrison's title card was thus lacking an image; an aerial shot of rowers on Princeton University's Lake Carnegie was finally agreed upon to accompany her name.[77] Spencer's name appears next to an old-fashioned anatomical drawing of a spine. Between the presentations of Spencer and Shore's names is a scene of House and his three original team members walking down one of the hospital's hallways.[76] Jacobs said that most of the backgrounds have no specific meaning; however, the final image—the text \"created by David Shore\" superimposed upon a human neck—connotes that Shore is \"the brain of the show\".[77] The sequence was nominated for a Primetime Emmy Award for Outstanding Main Title Design in 2005.[78] The title sequence continued to credit Spencer and Morrison, even when their characters were reduced to background roles during seasons four and five, and Morrison even after hers was written out. A new opening sequence was introduced in season seven to accommodate the changes in the cast, removing Morrison's name and including Jacobson's and Wilde's. It was updated in season eight, removing Edelstein's and Wilde's names and adding Annable's and Yi's.[79][80] The series' original opening theme, as heard in the United States, comprises instrumental portions of \"Teardrop\" by Massive Attack.[81] The piece was used in part because of the distinct tempo which roughly mimics the sound of a beating human heart.[82] An acoustic version of \"Teardrop\", with guitar and vocals by José González, is heard as background music during the season-four finale.[83] Because of rights issues, broadcasts in many European countries changed the first season opening to an original piece of music by Scott Donaldson and Richard Nolan. From the second season onward, a new intro composed by Jason Derlatka and Jon Ehrlich was used instead.[84] Series overview [edit]Anytime you try to summarize a show in one word, you sound like an ass. It's about truth. Gregory House, M.D., often construed as a misanthropic medical genius,[86] heads a team of diagnosticians at the Princeton–Plainsboro Teaching Hospital in New Jersey.[75] The series is structured around a central plot with some supporting secondary stories and narratives that cross over seasons. Most episodes revolve around the diagnosis of a primary patient and start with a cold open set outside the hospital, showing events ending with the onset of the patient's symptoms.[20] The typical episode follows the team in their attempts to diagnose and treat the patient's illness,[81][87] which often fail until the patient's condition is critical.[81] They usually treat only patients whom other doctors have not accurately diagnosed,[72] and House routinely rejects cases he does not find interesting.[20] Typically, the patient is misdiagnosed at least once which usually causes further complications, but the nature of the complications often provides new evidence which helps them diagnose the patient correctly.[20] House often tends to arrive at the correct diagnosis seemingly out of the blue, often inspired by a passing remark made by another character.[87] Diagnoses range from relatively common to very rare diseases.[88] The team faces many diagnostic difficulties from patients' concealment of symptoms, circumstances, or personal histories, so House frequently proclaims during the team's deliberations, \"The patient is lying\", or mutters \"Everybody lies\"; such an assumption guides House's decisions and diagnoses[12] and makes housebreaking a routine tactic. Because many of his hypotheses are based on epiphanies or controversial insights, he often has trouble obtaining permission for medical procedures he considers necessary from his superior, who in all but the final season is hospital administrator Dr. Lisa Cuddy.[89] This is especially the case when the proposed procedures involve a high degree of risk or are ethically questionable. Frequent disagreements occur between House and his team,[90] especially Dr. Allison Cameron, whose standards of medical ethics are more conservative than those of the other characters.[81] Like all of the hospital's doctors, House is required to treat patients in the facility's walk-in clinic.[75][91] His grudging fulfillment of this duty, or his creative methods of avoiding it, constitute a recurring subplot, which often serves as the series' comic relief.[81][92] During clinic duty, House confounds patients with unwelcome observations into their personal lives, eccentric prescriptions, and unorthodox treatments.[75] However, after seeming to be inattentive to their complaints, he regularly impresses them with rapid and accurate diagnoses.[18] Analogies with some of the simple cases in the clinic occasionally inspire insights that help solve the team's case.[20][93] It's not a show about addiction, but you can't throw something like this into the mix and not expect it to be noticed and commented on. There have been references to the amount of his consumption increasing over time. It's becoming less and less useful a tool for dealing with his pain, and it's something we're going to continue to deal with, continue to explore. A significant plot element is House's use of Vicodin to manage pain, caused by an infarction in the quadriceps muscle of his right leg five years before the show's first season, which also forces him to use a cane.[95] In the first-season's 11th episode \"Detox\", House admits he is addicted to Vicodin but says he does not have a problem because the pills \"let me do my job, and they take away my pain\".[f] His addiction has led his colleagues Cuddy and Dr. James Wilson to encourage him to go to drug rehabilitation several times.[97] When he has no access to Vicodin or experiences unusually intense pain, he occasionally self-medicates with other narcotic analgesics such as morphine,[98] oxycodone,[99] and methadone.[100] House also frequently drinks liquor when he is not on medical duty and classifies himself as a \"big drinker\".[101] Toward the end of season five, House begins to hallucinate; after eliminating other possible diagnoses, Wilson and he determine that his Vicodin addiction is the most likely cause.[102] House goes into denial about this for a brief time, but at the close of the season finale, he commits himself to Mayfield Psychiatric Hospital.[103] In the following season's debut episode, House leaves Mayfield with his addiction under control.[104] However, about a year and a half later, in season seven's 15th episode, \"Bombshells\", House reacts to the news that Cuddy possibly has kidney cancer by taking Vicodin,[105] and he returns to his addiction.[106] Cast and characters [edit]Main characters [edit]Throughout House's run, six of the main actors have received star billing. All of them play doctors who work at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey.[75] Dr. Gregory House (Hugh Laurie), the title character, was educated at Johns Hopkins University and heads the Department of Diagnostic Medicine.[109] House describes himself as \"a board-certified diagnostician with a double specialty of infectious disease and nephrology\".[110] Dr. James Wilson (Robert Sean Leonard), House's one true friend, is the head of the Department of Oncology.[111] Dr. Lisa Cuddy (Lisa Edelstein), an endocrinologist,[112] is House's boss, as she is the hospital's dean of medicine and chief administrator.[113] House has a complex relationship with Cuddy, and their interactions often involve a high degree of innuendo and sexual tension.[114] In the sixth episode of season five, \"Joy\", they kiss for the first time.[115] Their physical relationship does not progress any further during the fifth season; in the season five finale, House believes he and Cuddy had sex, but this is a hallucination brought on by House's Vicodin addiction.[103] In the finale of season six, Cuddy tells House she loves him. They kiss and agree to try being a couple.[116] Throughout season seven, House and Cuddy try to make their relationship work, but Cuddy eventually breaks it off because of House's addiction. House struggles to deal with this and, in the season-seven finale, drives his car into Cuddy's living room in anger. As Lisa Edelstein left the show before season eight, after this incident Cuddy leaves the hospital and House never sees her again. House's original team of diagnosticians consists of Dr. Eric Foreman (Omar Epps), a neurologist; Dr. Robert Chase (Jesse Spencer), an intensivist; and Dr. Allison Cameron (Jennifer Morrison), an immunologist.[113] In the season-three episode \"Family\", Foreman announces his resignation, telling House, \"I don't want to turn into you\".[g] During the season finale, House tells Chase that he has either learned everything he can, or nothing at all, and dismisses him from the team. Cameron, who has developed an affection for Chase, soon resigns.[58] This leaves House without a team for the season-four premiere.[118] In the seventh episode of season two, \"Hunting\", Cameron and Chase have a one-night stand.[119] In the middle of season three, they initiate a sexual relationship that Cameron insists be casual;[112] when Chase declares that he \"wants more\", Cameron ends the affair.[120] By the end of the season, however, Cameron recognizes that she has romantic feelings for Chase and they begin a serious relationship.[58] After leaving the diagnostic team, they assume different roles at PPTH, Cameron as a senior attending physician in the emergency room[h] and Chase as a surgeon.[101] They become engaged in the season-five episode \"Saviors\" (the episode immediately following Kutner's suicide)[65] and are married in the season finale.[121] When Chase rejoins House's team in season six, Cameron leaves her husband and the hospital in \"Teamwork\", the season's eighth episode.[122] She returns as a guest character in \"Lockdown\", nine episodes later.[123] Under orders from Cuddy to recruit a new team, House considers 40 doctors.[101] Season four's early episodes focus on his selection process, structured as a reality TV–style elimination contest[101] (Jacobs referred to it as a \"version of Survivor\").[124] House assigns each applicant a number between one and 40, and pares them down to seven finalists.[125] He assesses their performance in diagnostic cases, assisted by Foreman, who returns to the department after his dismissal from another hospital for House-like behavior.[125][126][127] While Foreman's return means only two slots are open, House tricks Cuddy into allowing him to hire three new assistants.[128] He ultimately selects Dr. Chris Taub (Peter Jacobson), a former plastic surgeon; Dr. Lawrence Kutner (Kal Penn), a sports medicine specialist; and Dr. Remy \"Thirteen\" Hadley (Olivia Wilde), an internist (nicknamed for her number in the elimination contest).[128][129] In the season finale, Thirteen discovers she has, as she had long dreaded, inherited Huntington's disease, which is incurable, from her mother.[83] In the 11th episode of season five, \"Joy to the World\", Foreman and Thirteen engage in a passionate kiss.[28] Thirteen is at first reluctant to start a relationship with Foreman, but the two eventually begin dating and are still together at the end of the season.[103] They break up early in season six. In the 20th episode of season five, \"Simple Explanation\", Kutner is found dead in his apartment with a gunshot wound to the head. Because Kutner left no note, House suspects foul play, though the death is accepted by the other characters as a suicide.[130] Early in season seven, Thirteen takes an unexplained leave of absence. Cuddy orders House to fill her position with another woman,[131] but eventually makes the choice for him: medical student Dr. Martha M. Masters (Amber Tamblyn), who makes her first appearance in the season's sixth episode.[132] Thirteen returns in \"The Dig\"—the season's 18th episode and the show's 150th—in which the reason for her absence is revealed: she was in prison for six months for having helped euthanize her brother, who was suffering from advanced Huntington's.[133] While Jacobson and Wilde play central characters (as did Penn), they did not receive star billing until season seven. They were credited as \"Also Starring\", with their names appearing after the opening sequence.[134] In season seven, Jacobson and Wilde received star billing; new regular cast member Tamblyn did not.[135] Recurring characters [edit]The first six seasons of House each included one or more recurring featured characters, who appear in multiple-episode story arcs.[136] In season one, Edward Vogler (Chi McBride), the billionaire owner of a pharmaceutical company, appears in five episodes.[137] He donates $100 million to PPTH in return for chairing its board.[138] Vogler represented an attempt to introduce a villain, a move urged by Fox. By the time the Vogler episodes began to air, the show had become a hit and the character was soon dropped.[137] David Shore said the concept of a villainous boss was not really viable for the series: \"It's called House. The audience knows he'll never get fired.\"[12] Stacy Warner (Sela Ward), House's ex-girlfriend,[139] appears in the final two episodes of the first season, and seven episodes of season two.[12] She wants House to treat her husband, Mark Warner (Currie Graham), whom House diagnoses with acute intermittent porphyria in the season-one finale.[139] Stacy and House grow close again, but House eventually tells Stacy to go back to Mark, which devastates her.[140] Michael Tritter (David Morse), a police detective, appears in several season-three episodes. He tries to extract an apology from House, who left Tritter in an examination room with a rectal thermometer in his anus.[141] House refuses to apologize and Tritter arrests him on charges of narcotics possession, trying to mentally break him into a confession by applying pressure on his medical colleagues. When the case reaches court, Cuddy perjures herself for House and the case is dismissed. The judge reprimands Tritter for pursuing House to excess, and tells House that she thinks he \"has better friends than he deserves\", referring to Cuddy's 11th-hour testimony on his behalf. House is sentenced to one night in jail for contempt of court and completes his rehabilitation with the help of smuggled Vicodin.[97] The candidates for House's new diagnostics team are season four's primary recurring characters.[142] In addition to the three who are chosen, the other four finalists are Jeffrey Cole (Edi Gathegi), a medical geneticist;[143] Travis Brennan (Andy Comeau), an epidemiologist;[142] Henry Dobson (Carmen Argenziano), a former medical school admissions officer;[101] and Amber Volakis (Anne Dudek), an interventional radiologist whom House nicknames \"Cutthroat Bitch\".[129][144] Each of the four departs the show after elimination, except for Volakis, who appears throughout the season, having started a relationship with Wilson.[145][146] In the two-part season finale, Volakis attempts to shepherd a drunken House home when Wilson is unavailable. They are involved in a bus crash, which leads to her death.[83][147] She reappears in a recurring role late in season five, and again in the season eight series finale, as hallucinations by House.[65] Private investigator Lucas Douglas (Michael Weston), a character inspired in part by Shore's love of The Rockford Files, appears in three episodes of season five.[148][149] House initially hires Douglas to spy on Wilson, who has ended their friendship after Volakis's death (the friendship is subsequently rekindled). House later pays Douglas to look into the private lives of his team members and Cuddy.[150] If the character had been accepted by the audience, plans existed to feature him as the lead in a spin-off show.[151][152] In September 2008, Shore spoke to Entertainment Weekly about his vision for the character: \"I don't want to do just another medical show. What does excite me in terms of writing is the choices people make and the nature of right and wrong... and a private investigator can approach that question much more readily than a doctor can.\"[153] There was no show featuring Douglas on the fall 2009 network television schedule.[154] He returns to House in season six as Cuddy's boyfriend.[155] They are briefly engaged until Cuddy breaks it off, realizing that she is in love with House.[156] Episodes [edit]Reception [edit]Critical reception [edit]House received largely positive reviews on its debut;[165] the series was considered a bright spot amid Fox's schedule, which at the time was largely filled with reality shows.[166] Season one holds a Metacritic score of 75 out of 100, based on 30 reviews, indicating \"generally favorable\" reviews.[167] Matt Roush of TV Guide said that the program was an \"uncommon cure for the common medical drama\".[168] New York Daily News critic David Bianculli applauded the \"high caliber of acting and script\".[70] The Onion's \"A.V. Club\" approvingly described it as the \"nastiest\" black comedy from FOX since 1996's short-lived Profit.[169] New York's John Leonard called the series \"medical TV at its most satisfying and basic\",[170] while The Boston Globe's Matthew Gilbert appreciated that the show did not attempt to hide the flaws of the characters to assuage viewers' fears about \"HMO factories\".[171] Variety's Brian Lowry, less impressed, wrote that the show relied on \"by-the-numbers storytelling, albeit in a glossy package\".[172] Tim Goodman of the San Francisco Chronicle described it as \"mediocre\" and unoriginal.[173] Mikhail Varshavski, a Russian-American Osteopathic Doctor, reviewed the medical content of House on his YouTube channel. According to Varshavski, the medical information presented on the show was usually fundamentally accurate though often highly exaggerated for dramatic effect, but he described Gregory House's tendency to quickly use invasive tests and procedures as outside the medical mainstream.[174][175][176] General critical reaction to the character of Gregory House was particularly positive.[165][177] Tom Shales of The Washington Post called him \"the most electrifying new main character to hit television in years\".[178] Th"
}