{
  "url": "https://en.wikipedia.org/wiki/Main_Page",
  "title": "Wikipedia, the free encyclopedia",
  "text": "Main Page From today's featured article The saxaul sparrow (Passer ammodendri) is a passerine bird of the sparrow family Passeridae, found in parts of Central Asia. At 14–16 cm (5.5–6.3 in) and 25–32 g (0.88–1.13 oz), it is among the larger sparrows. Both sexes have plumage ranging from dull grey to sandy brown, and pale brown legs. The female has a less boldly coloured plumage and bill, lacking the pattern of black stripes on the male's head. The head markings of both sexes make the saxaul sparrow distinctive, and unlikely to be confused with any other bird. Vocalisations include a comparatively soft and musical chirping call, a song, and a flight call. Its distribution falls into six probably disjunct areas across Central Asia, from central Turkmenistan to northern Gansu in China. A bird of deserts, the saxaul sparrow favours areas with shrubs such as the saxaul, near rivers and oases. Although it has lost parts of its range to habitat destruction caused by agriculture, it is not seriously threatened by human activities. (Full article...) Did you know ... - ... that the Oceanic Steamship Company (advertisement pictured) beat a rival company in a trans-Pacific race, bought the rival's ships, and added them to its own fleet? - ... that the play Sagittarius Ponderosa by MJ Kaufman recreates the scent of a tree as part of the performance? - ... that Thea Ehre performed nude at the 2021 Porn Film Festival Vienna? - ... that Gerta Hüttl-Folter became interested in Russian culture after staying with Maria Razumovsky's family while homeless? - ... that the author of Five Bullets was unaware for a year that Fear and Fury was also being written about the same 1984 shooting, and for the same publishing house? - ... that a church in Colorado merged with another congregation, was sold, became a nightclub, and then was bought by an offshoot of the merged congregation? - ... that volumes of one writer's journalism were variously described as \"prattling pieces\", delivering \"a snigger a minute\", and having a \"souffle touch\"? - ... that American football player Taco Dowler is the twin of a football player who was called \"Burrito\"? - ... that the cover artworks for Metallica's Load and Reload were created by mixing blood with semen and urine, respectively? In the news - Laura Fernández Delgado (pictured) is elected as the president of Costa Rica. - Clashes between the Balochistan Liberation Army and the armed forces in several districts of Balochistan, Pakistan, leave at least 225 people dead. - A winter storm causes widespread damage across North America and leaves more than 140 people dead. - Vietnam's communist party congress re-elects Tô Lâm as general secretary, the most powerful position in the one-party state. On this day February 5: Constitution Day in Mexico (1917) - 1783 – The first of five strong earthquakes hit the region of Calabria on the Italian Peninsula, killing more than 32,000 people over a period of nearly two months. - 1869 – Prospectors in Moliagul, Australia, discovered the largest alluvial gold nugget ever found, known as the Welcome Stranger. - 1923 – Australian cricketer Bill Ponsford made 429 runs to break the world record for the highest first-class score. - 1985 – Punic Wars: The mayors of Carthage and Rome signed a symbolic peace treaty to officially end the Third Punic War, 2,134 years after it began. - 2008 – Eighty-seven tornadoes occurred over the course of the Super Tuesday tornado outbreak across multiple U.S. states, causing 56 deaths and over $1 billion in damage. - Shunzhi Emperor (d. 1661) - Thomas Carlyle (d. 1881) - Colin Robert Chase (b. 1935) - Margaret Oakley Dayhoff (d. 1983) Today's featured picture Other areas of Wikipedia - Community portal – The central hub for editors, with resources, links, tasks, and announcements. - Village pump – Forum for discussions about Wikipedia itself, including policies and technical issues. - Site news – Sources of news about Wikipedia and the broader Wikimedia movement. - Teahouse – Ask basic questions about using or editing Wikipedia. - Help desk – Ask questions about using or editing Wikipedia. - Reference desk – Ask research questions about encyclopedic topics. - Content portals – A unique way to navigate the encyclopedia. Wikipedia's sister projects Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation, a non-profit organization that also hosts a range of other volunteer projects: - Commons Free media repository - MediaWiki Wiki software development - Meta-Wiki Wikimedia project coordination - Wikibooks Free textbooks and manuals - Wikidata Free knowledge base - Wikinews Free-content news - Wikiquote Collection of quotations - Wikisource Free-content library - Wikispecies Directory of species - Wikiversity Free learning tools - Wikivoyage Free travel guide - Wiktionary Dictionary and thesaurus Wikipedia languages This Wikipedia is written in English. Many other Wikipedias are available; some of the largest are listed below. - 1,000,000+ articles - 250,000+ articles - 50,000+ articles"
}