{
  "url": "https://en.m.wikipedia.org/wiki/Astoria,_Oregon",
  "title": "Astoria, Oregon - Wikipedia",
  "text": "Astoria, Oregon Astoria is a port city in and the county seat of Clatsop County, Oregon, United States. The population was 10,181 at the 2020 census.[7] Founded in 1811, Astoria is the oldest city in the state and was the first permanent American settlement west of the Rocky Mountains.[8] (The Presidio of San Diego and Mission San Diego de Alcalá, founded in 1769, formed the first European settlement in what is now California.) The county is the northwest corner of Oregon, and Astoria is located on the south shore of the Columbia River, near where the river flows into the Pacific Ocean. The city is named for John Jacob Astor, an investor and entrepreneur from New York City, whose American Fur Company founded Fort Astoria at the site and established a monopoly in the fur trade in the early 19th century. Astoria was incorporated by the Oregon Legislative Assembly on October 20, 1876.[2] The city has a deepwater port, operated by the Port of Astoria, and lies across Youngs Bay from Astoria Regional Airport in Warrenton. The city is the headquarters of the Columbia River Bar Pilots, which helps vessels navigate the Columbia Bar at the mouth of the Columbia River.[9] Astoria is at the western end of U.S. Route 30 and is served by U.S. Route 101, which travels across the Columbia River on the Astoria–Megler Bridge to neighboring Washington. History [edit]Prehistoric settlements [edit]The present area of Astoria was inhabited by a large, prehistoric Native American trade system of the Columbia Plateau.[10][11] 19th century [edit]The Lewis and Clark Expedition spent the winter of 1805–1806 at Fort Clatsop, a small log structure southwest of modern-day Astoria. The expedition had hoped a ship would come by that could take them back east, but instead, they endured a torturous winter of rain and cold. They later returned overland and by internal rivers, the way they had traveled west.[12] During archeological excavations in Astoria and Fort Clatsop in 2012, trading items from American settlers with Native Americans were found, including Austrian glass beads and falconry bells. Today, the fort has been recreated and is part of Lewis and Clark National Historical Park.[13] In 1811, British explorer David Thompson, the first person known to have navigated the entire length of the Columbia River, reached the partially constructed Fort Astoria near the mouth of the river. He arrived two months after the Pacific Fur Company's ship, the Tonquin.[14] The fort constructed by the Tonquin party established Astoria as a U.S., rather than a British, settlement[14] and became a vital post for American exploration of the continent. It was later used as an American claim in the Oregon boundary dispute with European nations. The Pacific Fur Company, a subsidiary of John Jacob Astor's American Fur Company, was created to begin fur trading in the Oregon Country.[15] During the War of 1812, in 1813, the company's officers sold its assets to their Canadian rivals, the North West Company, which renamed the site Fort George. The fur trade remained under British control until U.S. pioneers following the Oregon Trail began filtering into the town in the mid-1840s. The Treaty of 1818 established joint U.S. – British occupancy of the Oregon Country.[16][17] Washington Irving, a prominent American writer with a European reputation, was approached by John Jacob Astor to mythologize the three-year reign of his Pacific Fur Company. Astoria (1835), written while Irving was Astor's guest, promoted the importance of the region in the American psyche.[18] In Irving's words, the fur traders were \"Sinbads of the wilderness\", and their venture was a staging point for the spread of American economic power into both the continental interior and outward in Pacific trade.[19] In 1846, the Oregon Treaty divided the mainland at the 49th parallel north, making Astoria officially part of the United States.[20] As the Oregon Territory grew and became increasingly more colonized by Americans, Astoria likewise grew as a port city near the mouth of the great river that provided the easiest access to the interior. The first U.S. post office west of the Rocky Mountains was established in Astoria in 1847[21] and official state incorporation in 1876.[2] Astoria attracted a host of immigrants beginning in the late 19th century: Nordic settlers, primarily Swedes, Swedish-speaking Finns, and Chinese soon became larger parts of the population. The Nordic settlers mostly lived in Uniontown, near the present-day end of the Astoria–Megler Bridge, and took fishing jobs; the Chinese tended to do cannery work, and usually lived either downtown or in bunkhouses near the canneries. By the late 1800s, 22% of Astoria's population was Chinese.[22][23][24] Astoria also had a significant population of Indians, especially Sikhs from Punjab; the Ghadar Party, a political movement among Indians on the West Coast of the U.S. and Canada to overthrow British rule in India, was officially founded on July 15, 1913, in Astoria.[25] 20th and 21st centuries [edit]In 1883, and again in 1922, downtown Astoria was devastated by fire, partly because the buildings were constructed mostly of wood, a readily available material. The buildings were entirely raised off the marshy ground on wooden pilings. Even after the first fire, the same building format was used. In the second fire, flames spread quickly again, and the collapsing streets took out the water system. Frantic citizens resorted to dynamite, blowing up entire buildings to create fire stops.[26][27] Astoria has served as a port of entry for over a century and remains the trading center for the lower Columbia basin. In the early 1900s, the Callendar Navigation Company was an important transportation and maritime concern based in the city.[28] It has long since been eclipsed in importance by Portland, Oregon, and Seattle, Washington, as economic hubs on the coast of the Pacific Northwest. Astoria's economy centered on fishing, fish processing, and lumber. In 1945, about 30 canneries could be found along the Columbia River. In the early 20th century, the North Pacific Brewing Company contributed substantially to the economic well-being of the town.[29] Before 1902, the company was owned by John Kopp, who sold the firm to a group of five men, one of whom was Charles Robinson, who became the company's president in 1907.[30][31] The main plant for the brewery was located on East Exchange Street.[32] As the Pacific salmon resource diminished, canneries were closed. In 1974, the Bumble Bee Seafoods corporation moved its headquarters out of Astoria and gradually reduced its presence until closing its last Astoria cannery in 1980.[33] The lumber industry likewise declined in the late 20th century. Astoria Plywood Mill, the city's largest employer, closed in 1989. The Burlington Northern and Santa Fe Railway discontinued service to Astoria in 1996, as it did not provide a large enough market.[34] From 1921 to 1966, a ferry route across the Columbia River connected Astoria with Pacific County, Washington. In 1966, the Astoria–Megler Bridge was opened. The bridge completed U.S. Route 101 and linked Astoria with Washington on the opposite shore of the Columbia, replacing the ferry service.[35] Today, tourism, Astoria's growing art scene, and light manufacturing are the main economic activities of the city. Logging and fishing persist, but at a fraction of their former levels.[36] Since 1982 it has been a port of call for cruise ships, after the city and port authority spent $10 million in pier improvements to accommodate these larger ships.[37] To avoid Mexican ports of call during the swine flu outbreak of 2009, many cruises were rerouted to include Astoria. The floating residential community MS The World visited Astoria in June 2009.[38] The town's seasonal sport fishing tourism has been active for several decades.[39][40][41] Visitors attracted by heritage tourism and the historic elements of the city have supplanted fishing in the economy. Since the early 21st century, the microbrewery/brewpub scene[42] and a weekly street market[43] have helped popularize the area as a destination. In addition to the replicated Fort Clatsop, another point of interest is the Astoria Column, a tower 125 feet (38 m) high, built atop Coxcomb Hill above the town. Its inner circular staircase allows visitors to climb to see a panoramic view of the town, the surrounding lands, and the Columbia flowing into the Pacific. The tower was built in 1926. Financing was provided by the Great Northern Railway, seeking to encourage tourists, and Vincent Astor, a great-grandson of John Jacob Astor, in commemoration of the city's role in the family's business history and the region's early history.[44][45] Since 1998, artistically inclined fishermen and women from Alaska and the Pacific Northwest have traveled to Astoria for the Fisher Poets Gathering, where poets and singers tell their tales to honor the fishing industry and lifestyle.[46] Another popular annual event is the Dark Arts Festival, which features music, art, dance, and demonstrations of craft such as blacksmithing and glassblowing, in combination with offerings of a large array of dark craft brews. Dark Arts Festival began as a small gathering at a community arts space. Now Fort George Brewery hosts the event, which draws hundreds of visitors and tour buses from Seattle.[47] Astoria is the western terminus of the TransAmerica Bicycle Trail, a 4,250-mile (6,840 km) coast-to-coast bicycle touring route created in 1976 by the Adventure Cycling Association.[48] At least two United States Coast Guard cutters: the David Duren and Elm, are homeported in Astoria.[49][50] Geography [edit]According to the United States Census Bureau, the city has a total area of 10.11 square miles (26.18 km2), of which 3.95 square miles (10.23 km2) are covered by water.[51] Climate [edit]Astoria lies within the Mediterranean climate zone (Köppen Csb), with cool winters and mild summers, although short heat waves can occur. Rainfall is most abundant in late fall and winter and is lightest in July and August, averaging about 67 inches (1,700 mm) of rain each year.[52] Snowfall is relatively rare, averaging under 5 inches (13 cm) a year and frequently having none.[53] Nevertheless, when conditions are ripe, significant snowfalls can occur. Astoria's monthly average humidity is always over 80% throughout the year, with average monthly humidity reaching a high of 84% from November to March, with a low of 81% during May.[54] The average relative humidity in Astoria is 89% in the morning and 73% in the afternoon.[55] Annually, an average of only 4.2 afternoons have temperatures reaching 80 °F (26.7 °C) or higher, and 90 °F or 32.2 °C readings are rare. Normally, only one or two nights per year occur when the temperature remains at or above 60 °F or 15.6 °C.[56] An average of 31 mornings have minimum temperatures at or below the freezing mark. The record high temperature was 101 °F (38.3 °C) on July 1, 1942, and June 27, 2021. The record low temperature was 6 °F (−14.4 °C) on December 8, 1972, and on December 21, 1990. Even with such a cold record low, afternoons usually remain mild in winter. On average, the coldest daytime high is 36 °F (2 °C) whereas the lowest daytime maximum on record is 19 °F (−7 °C).[57] Even during brief heat spikes, nights remain cool. The warmest overnight low is 63 °F (17 °C) set in May 2008.[57] Nights close to that record are common with the normally warmest night of the year being at 61 °F (16 °C).[57] On average, 191 days have measurable precipitation. The wettest \"water year\", defined as October 1 through September 30 of the next year, was from 1915 to 1916 with 108.04 in (2,744 mm) and the driest from 2000 to 2001 with 44.50 in (1,130 mm). The most rainfall in one month was 36.07 inches (916.2 mm) in December 1933, and the most in 24 hours was 5.56 inches (141.2 mm) on November 25, 1998.[57] The most snowfall in one month was 26.9 in (68 cm) in January 1950,[58][59] and the most snow in 24 hours was 12.5 in (32 cm) on December 11, 1922.[57] Demographics [edit]2020 census [edit]As of the 2020 census, Astoria had a population of 10,181. The median age was 43.0 years. 17.0% of residents were under the age of 18 and 23.0% of residents were 65 years of age or older. For every 100 females there were 95.9 males, and for every 100 females age 18 and over there were 94.0 males age 18 and over.[66] As of the 2020 census, 99.5% of residents lived in urban areas, while 0.5% lived in rural areas.[67] As of the 2020 census, there were 4,728 households in Astoria, of which 21.5% had children under the age of 18 living in them. Of all households, 36.7% were married-couple households, 22.6% were households with a male householder and no spouse or partner present, and 31.6% were households with a female householder and no spouse or partner present. About 38.3% of all households were made up of individuals and 17.9% had someone living alone who was 65 years of age or older.[66] As of the 2020 census, there were 5,266 housing units, of which 10.2% were vacant. Among occupied housing units, 47.8% were owner-occupied and 52.2% were renter-occupied. The homeowner vacancy rate was 2.0% and the rental vacancy rate was 4.8%.[66] 2010 census [edit]As of the 2010 census,[69] 9,477 people, 4,288 households, and 2,274 families were residing in the city. The population density was 1,538.5 inhabitants per square mile (594.0/km2). The 4,980 housing units had an average density of 808.4 per square mile (312.1/km2). The racial makeup of the city was 89.2% White, 0.6% African American, 1.1% Native American, 1.8% Asian, 0.1% Pacific Islander, 3.9% from other races, and 3.3% from two or more races. Hispanics or Latinos of any race were 9.8% of the population. Of the 4,288 households, 24.6% had children under 18 living with them, 37.9% were married couples living together, 10.8% had a female householder with no husband present, 4.3% had a male householder with no wife present, and 47.0% were not families. About 38.8% of all households were made up of individuals, and 15.1% had someone living alone who was 65 or older. The average household size was 2.15, and the average family size was 2.86. The median age in the city was 41.9 years; 20.3% of residents were under 18; 8.6% were between 18 and 24; 24.3% were from 25 to 44; 29.9% were from 45 to 64; and 17.1% were 65 or older. The gender makeup of the city was 48.4% male and 51.6% female. Arts and culture [edit]Museums and other points of interest [edit]- Astoria Riverwalk with Astoria Riverfront Trolley, Uniontown Neighborhood, Columbia River Maritime Museum, Uppertown Firefighters Museum and Pier 39 Astoria - The Astoria Column (the highest point in Astoria) with nearby Cathedral Tree Trail - Heritage Museum, located in the Old City Hall - Fort Astoria, Fort George Brewery - Astor Building, Liberty Theater - Museum of Whimsy, Astoria Sunday Market, Garden of Surging Waves, Astoria City Hall - Oregon Film Museum, Flavel House - Astoria Regional Airport with CGAS Astoria - Fort Stevens, Clatsop Spit, Fort Clatsop and Youngs River Falls Shanghaied in Astoria is a musical about Astoria's history that has been performed in Astoria every year since 1984.[70] Government [edit]Astoria operates under a council–manager form of city government. Voters elect four councilors by ward and a mayor, who each serve four-year terms.[71] The mayor and council appoint a city manager to conduct the ordinary business of the city.[71] The current mayor is Sean Fitzpatrick, who took office in January 2023. His predecessor, Bruce Jones, served from 2019 to 2022. Education [edit]The Astoria School District has four primary and secondary schools, including Astoria High School. Clatsop Community College is the city's two-year college. The city also has a library and many parks with historical significance, plus the second oldest Job Corps facility (Tongue Point Job Corps) in the nation. Tongue Point Job Corps center is the only such location in the country which provides seamanship training.[72] Media [edit]The Astorian (formerly The Daily Astorian) is the main newspaper serving Astoria. It was established 154 years ago, in 1873,[73] and has been in continuous publication since that time.[74] The Coast River Business Journal is a monthly business magazine covering Astoria, Clatsop County, and the Northwest Oregon coast. It, along with The Astorian, is part of the EO Media Group (formerly the East Oregonian Publishing Company) family of Oregon and Washington newspapers.[75] The local NPR station is KMUN 91.9, and KAST 1370 is a local news-talk radio station. Filming location [edit]The early 1960s television series Route 66 filmed the episode entitled \"One Tiger to a Hill\"[76] in Astoria; it was broadcast on September 21, 1962. In recent popular culture, Astoria is most famous for being the setting of the 1985 film The Goonies, which was filmed on location in the city. Other notable movies filmed in Astoria include Short Circuit, The Black Stallion, Kindergarten Cop, Free Willy, Free Willy 2: The Adventure Home, Teenage Mutant Ninja Turtles III, Benji the Hunted, Come See the Paradise, The Ring Two, Into the Wild, The Guardian and Green Room.[77][78][79][80] Infrastructure [edit]Transportation [edit]Astoria is at the intersection of U.S. Route 101, the primary coastal highway in Oregon, and U.S. Route 30, which follows the Columbia River inland to Portland and into Eastern Oregon.[81] The 4.1-mile (6.6 km) Astoria–Megler Bridge carries U.S. Route 101 across the Columbia River into neighboring Washington state. It opened in 1966 and carries an average of 7,000 vehicles per day.[82] Public transit service within the city is provided by the Sunset Empire Transportation District, which was established in 1993 by the county government.[83] It also operates intercity service that connects to neighboring parts of Northwestern Oregon; other intercity connections include the Pacific Transit System, which runs a bus from Astoria to Ilwaco, Washington.[84] The Port of Astoria was established in 1910 and operates cargo and recreational facilities on the Columbia River. It also manages the Astoria Regional Airport in Warrenton, which opened in 1935 and is also used by Coast Guard Air Station Astoria.[85] Passenger service from Astoria Regional Airport to Portland International Airport was briefly operated by SeaPort Airlines until it ceased service in 2011.[86] Notable people [edit]- Bobby Anet, college basketball guard who helped guide the University of Oregon to win the inaugural NCAA Division I men's basketball tournament championship in 1938–1939 attended Astoria High school[87] - Alexander G. Barry, American attorney Republican member of the Oregon House of Representatives - Jona Bechtolt, Grammy nominated electronic musician and multimedia artist raised in Astoria - Del Bjork, a professional American football offensive lineman in the National Football League (NFL). He played two seasons for the Chicago Bears (1937–1938) - Brian Bruney, Major League Baseball relief pitcher[88] - Honey Lee Cottrell, Photographer, filmmaker, LGBTQ activist born in Astoria[89] - Marie Dorion, the only female member of an overland expedition sent by the Pacific Fur Company to Fort Astoria in 1810[90] - George Flavel, maritime pilot and businessman - Charles William Fulton, lawyer and Oregon senator - Grouper, American ambient musician (Elizabeth Anne Harris) - Jerry Gustafson, football player[91] - Darrell Hanson, American politician in the state of Iowa - Michael Hurley, American singer/songwriter[92] - Duane Jarvis, American guitarist and singer/songwriter - Wally Johansen, a college basketball guard who played for the University of Oregon when it won the inaugural NCAA Division I men's basketball tournament championship in 1938–1939 - Consuelo Kanaga, a photographer and writer who became well known for her photographs of African-Americans - Augustus C. Kinney, a physician and scientist, was a leading expert on tuberculosis - Kenneth Koe, chemist of Chinese descent, helped develop sertraline, which was branded and sold as Zoloft - Carl W. Leick, a German born architect who moved to Astoria. His Astoria designs include the Captain George Flavel House, the Clatsop County Courthouse, and the Grace Episcopal Church[93] - Rosa Lemberg, a Namibian-born Finnish American teacher, choral conductor and socialist[94] - Armand Lohikoski, American born – Finnish movie director and writer - Robert Lundeen, American businessperson, most notable for his association with the College of Engineering at Oregon State University (OSU) and Tektronix Inc.[95] - Ranald MacDonald, first man to teach the English language in Japan and one of the interpreters between the Tokugawa shogunate and Commodore Perry when the latter made his trips to Japan on behalf of the U.S. government in the early 1850s - Holly Madison, Playboy model and one of Hugh Hefner's ex-girlfriends,[96] born in Astoria, but left before her second birthday - Donald Malarkey, World War II U.S. Army soldier of the 101st Airborne Division who was portrayed in the television series Band of Brothers[97] - Petra Mathers, a German-born American writer and illustrator of children's picture books - George H. Merryman, a doctor who made house calls by horse and buggy then later built the first modern hospital in Klamath Falls. Served in both the Oregon House of Representatives & Oregon Senate - Royal Nebeker, American painter and print maker. Lived and worked in Astoria for 30 years - Gene Nelson, American dancer, actor, screenwriter, and director, starred as Will Parker in Oklahoma! (1955) - Albin W. Norblad, Attorney in the U.S. state of Oregon, and a judge of the Oregon Circuit Court for the 3rd judicial district - Kerttu Nuorteva, A Soviet intelligence agent during World War II. Daughter of Santeri Nuorteva - Santeri Nuorteva, Finnish socialist politician and journalist, who edited Toveri (\"The Comrade\") in Astoria in 1912–1913[98] Father of Kerttu Nuorteva - Maila Nurmi, a.k.a. 1950s TV horror hostess Vampira and co-star of Ed Wood's Plan 9 from Outer Space attended Astoria High School in the late 1930s[99] - Mike Pecarovich, American college football coach, lawyer, and actor - Allan Pomeroy, mayor of Seattle from 1952 to 1956[100] - Jordan Poyer, NFL football player, raised in Astoria and played for Astoria teams[101] - Ken Raymond, an expert in bioinorganic and coordination chemistry - Arnie Sundberg, American weightlifter who competed in the 1932 Summer Olympics - Wilbur Ternyik, American civic leader who has been characterized as a founding father of coastal planning. Mayor of Florence, Oregon - Willis Van Dusen, businessman and mayor of Astoria from 1991 through 2014 - Gary Wilhelms, American politician who was a member of the Oregon House of Representatives - Stanley Paul Young, American biologist[102] - Eric Zener, American photorealist artist best known for figure paintings of lone subjects, often in or about swimming pools In popular culture [edit]Actor Clark Gable is claimed to have begun his career at the Astoria Theatre in 1922.[103] Leroy E. \"Ed\" Parsons, called the \"Father of Cable Television\", developed one of the first community antenna television stations (CATV) in the United States in Astoria starting in 1948.[104] The fourth album of the pop punk band The Ataris was titled So Long, Astoria as an allusion to The Goonies. A song of the same title is the album's first track. The album's back cover features news clippings from Astoria, including a picture of the port's water tower from a 2002 article on its demolition.[105] The pop punk band Marianas Trench has an album titled Astoria. The band states the album was inspired by 1980s fantasy and adventure films, and The Goonies in particular. That film inspired the title, as it was set in Astoria, the album's artwork, as well as the title of their accompanying US tour (Hey You Guys!!).[106] The film Green Room prominently featured Astoria and the areas surrounding Portland.[107] Two U.S. Navy cruisers were named USS Astoria: A New Orleans-class heavy cruiser (CA-34) and a Cleveland class light cruiser (CL-90). The former was lost in the Pacific Ocean in combat at the Battle of Savo Island in August 1942, during World War II,[108] and the latter was scrapped in 1971 after being removed from active duty in 1949.[109] Sister cities [edit]Astoria has one sister city,[110] as designated by Sister Cities International: - Walldorf, Germany, which is the birthplace of Astoria's namesake, John Jacob Astor, who was born in Walldorf near Heidelberg on July 17, 1763. The sistercityship was founded on Astor's 200th birthday in 1963 in Walldorf by Walldorf's mayor Wilhelm Willinger and Astoria's mayor Harry Steinbock.[111] See also [edit]- Astoria Regional Airport - The Clatsop tribe of Native Americans - Columbia Memorial Hospital - National Register of Historic Places listings in Clatsop County, Oregon — 44 Astoria structures and districts listed (2020) - Socialist Party of Oregon § The Finnish Socialists of Astoria - Western Workmen's Co-operative Publishing Company Notes [edit]- ^ Mean monthly maxima and minima (i.e. the highest and lowest temperature readings during an entire month or year) calculated based on data at said location from 1991 to 2020. References [edit]- ^ \"City of Astoria Mayor\". City of Astoria. Retrieved September 21, 2025. - ^ a b c Leeds, W. H. (1899). \"Special Laws\". The State of Oregon General and Special Laws and Joint Resolutions and Memorials Enacted and Adopted by the Twentieth Regular Session of the Legislative Assembly. Salem, Oregon: State Printer: 747. - ^ \"ArcGIS REST Services Directory\". United States Census Bureau. Retrieved October 12, 2022. - ^ a b \"Census Population API\". United States Census Bureau. Retrieved October 12, 2022. - ^ a b U.S. Geological Survey Geographic Names Information System: Astoria, Oregon - ^ \"U.S. Census website\". United States Census Bureau. Retrieved January 31, 2008. - ^ \"U.S. Census Bureau QuickFacts: Astoria city, Oregon\". www.census.gov. Retrieved January 25, 2023. - ^ Lescroart 2009, p. 981. - ^ Thron Riggs. \"Columbia River Bar Pilots\". The Oregon Encyclopedia. Retrieved September 21, 2025. - ^ Rebecca Sedlak (August 2, 2012). \"First archaeological dig 'scratches the surface' of Fort Astoria’s history\". The Daily Astorian. Retrieved April 29, 2021. - ^ Galm, Jerry R., (1989), Prehistoric Trade and Exchange in the Columbia Plateau, Paper presented at the 42nd Annual Northwest Anthropological Conference, Spokane, Washington. Retrieved April 29, 2021. - ^ William Clark; Meriwether Lewis (2015). The Journals of Lewis and Clark, 1804–1806 (Library of Alexandria ed.). Library of Alexandria. ISBN 978-1-613-10310-4. - ^ \"History & Culture: Places: Fort Clatsop – \"The National Park Service maintains a replica fort within the Lewis and Clark National Historical Park that is believed to sit on or near the site of the original fort.\"\". National Park Service / U.S. Department of the Interior. Retrieved May 12, 2016. - ^ a b Meinig 1995, pp. 37–38, 50. - ^ Ronda, James (1995). Astoria & Empire. Lincoln, Nebraska: University of Nebraska Press. ISBN 0-8032-3896-7. - ^ United States Department of State (November 1, 2007). Treaties In Force: A List of Treaties and Other International Agreements of the United States in Force on November 1, 2007. Section 1: Bilateral Treaties (PDF). Compiled by the Treaty Affairs Staff, Office of the Legal Adviser, U.S. Department of State. (2007 ed.). Washington, DC. p. 320. Archived (PDF) from the original on October 9, 2022. {{cite book}} : CS1 maint: location missing publisher (link) - ^ Lauterpacht 2004, p. 8. - ^ In his introduction to the rambling work, Irving reports that Astor explicitly \"expressed a regret that the true nature and extent of his enterprizeand its national character and importance had never been understood.\" - ^ Collections of the Kansas State Historical Society, Volume 9. Kansas State Historical Society. 1906. p. 105. - ^ \"Convention of Commerce between His Majesty and the United States of America.—Signed at London, 20th October 1818\". Canado-American Treaties. Université de Montréal. 2000. Archived from the original on April 11, 2009. Retrieved March 27, 2006. - ^ \"Oregon Territorials – Oregon Sesquicentennial exhibit online version.pdf\" (PDF). Pacific Northwest Postal History Society. 2009. Archived from the original (PDF) on February 20, 2015. Retrieved November 11, 2014. - ^ \"The Swedes of Oregon\". - ^ Chelsea Gorrow (April 16, 2012). \"Astoria Embraces Chinese Legacy\". The Daily Astorian. - ^ American Swedish Historical Museum: Yearbook 1946. American Swedish Hist Museum. ISBN 9781437950021. - ^ Ogden, Johanna (Summer 2012). \"Ghadar, Historical Silences, and Notions of Belonging: Early 1900s Punjabis of the Columbia River\". Oregon Historical Quarterly. 113 (2): 164–197 (34 pages). doi:10.5403/oregonhistq.113.2.0164. JSTOR 10.5403/oregonhistq.113.2.0164. S2CID 164468099. - ^ Terry, John (December 25, 2010). \"Infernos leave historic marks on Astoria's waterfront\". The Oregonian/OregonLive. - ^ Dresbeck, Rachel (July 15, 2015). \"Chapter 3 – Port Town in Flames – The Astoria Fire – 1922\". Oregon Disasters: True Stories of Tragedy and Survival. Rowman & Littlefield. ISBN 9781493013197. - ^ \"Callendar Navigation Co.\", Morning Astorian (schedule), vol. 59, no. 177, Astoria OR: J.S. Dellinger Co., p. 6, col.3, May 9, 1905 - ^ \"Report of Committee on Manufacturies\". The Morning Astorian. May 22, 1906. p. 5. Retrieved May 21, 2022 – via Newspapers.com. \"Ethics and Business\". The Morning Astorian. May 22, 1906. p. 2. Retrieved May 21, 2022 – via Newspapers.com. - ^ \"Emil Schimpff Ends His Life\". The Times-Tribune. Scranton, Pennsylvania. February 17, 1903. p. 4. Retrieved May 21, 2022 – via Newspapers.com. - ^ Hankel, Evelyn G. (Fall 1989). \"Early Astonian Breweries\". CUMTUX. 9 (4): 21 – via Internet Archive. - ^ \"Working and Repairing\". The Morning Astorian. March 28, 1908. p. 5. Retrieved May 21, 2022 – via Newspapers.com. - ^ \"3\". South Tongue Point Land Exchange and Marine Industrial Park Development Project, Clatsop County: Environmental Impact Statement. US Dept of Interior: Fish & Wildlife Service. 1992. p. 53. Retrieved November 21, 2021. - ^ Anderson, John Gottberg (June 21, 2015). \"Going \"Goonie\" in Astoria\". Bend Bulletin. - ^ Smith 1989, p. 299. - ^ \"Report: Astoria tops West Coast fishing ports\". Associated Press. October 29, 2014. Archived from the original on August 8, 2016. Retrieved May 31, 2016. - ^ Neal, LeeAnn (April 30, 2011). \"Cruise ship season to see double the visits\". The Astorian. - ^ Muldoon, Katy (May 14, 2009). \"Swine flu sends cruise ship, tourism dollars to Astoria\". The Oregonian/OregonLive. - ^ Edward Stratton (August 11, 2015). \"Keeping fishing fever in check\". The Daily Astorian. Retrieved May 30, 2016. - ^ Bill Monroe (August 8, 2015). \"Early success at Buoy 10 promises good fall season ahead for salmon fishing\". The Oregonian/OregonLive. Retrieved May 30, 2016. - ^ Andrew McKean (August 2015). \"The Bite: Salmon Fishing the Columbia River\". Outdoor Life. Retrieved May 30, 2016. - ^ Edward Stratton (May 24, 2016). \"Sour beer to join Astoria's impressive brewing lineup\". The Daily Astorian. Retrieved May 30, 2016. - ^ \"Astoria Sunday Market – Astoria, OR\". National Farmers Market Directory. Retrieved May 30, 2016. - ^ \"Astoria Column, Coxcomb Hill\". Spokesman-Review. Spokane, Washington. Associated Press. July 13, 1926. p. 7. - ^ \"The Column at Astoria\". Eugene Guard. Oregon. July 24, 1926. p. 4. - ^ Sharon Boorstin (June 2005). \"Rhyme or Cut Bait When these fisher poets gather, nobody brags about the verse that got away\". Smithsonian Magazine. - ^ Colin Murphey (February 17, 2019). \"Festival of Dark Arts\". The Daily Astorian. - ^ \"TransAmerica Trail Summary\". Adventure Cycling Association. Archived from the original on January 12, 2013. Retrieved December 26, 2012. - ^ Edward Stratton (September 16, 2015). \"New commander takes Steadfast's helm\". EO Media Group / chinookobserver. Retrieved May 12, 2016. - ^ \"Coast Guard accepts 56th fast response cutter, to be homeported in Astoria, Oregon\". Latest Acquisition News. United States Coast Guard. Retrieved January 16, 2025. - ^ \"US Gazetteer files 2010\". United States Census Bureau. Archived from the original on January 12, 2012. Retrieved December 21, 2012. - ^ \"Climate of Clatsop County\". Oregon State University. Archived from the original on July 30, 2016. Retrieved April 22, 2016. - ^ \"not found\" (PDF). www.ncei.noaa.gov. 2002. Retrieved January 9, 2025. - ^ Aladin. \"Astoria, OR - Climate & Monthly weather forecast\". Weather U.S. Retrieved January 25, 2023. - ^ \"Average Relative Humidity – Morning (M), Afternoon (A)\" (PDF). Comparative Climatic Data for the United States Through 2012. National Oceanic and Atmospheric Administration. 2013. Archived from the original (PDF) on July 18, 2014. - ^ \"Station Name: OR ASTORIA RGNL AP\". National Oceanic and Atmospheric Administration. Archived from the original on October 14, 2020. Retrieved June 13, 2013. - ^ a b c d e f \"NOWData – NOAA Online Weather Data\". National Oceanic and Atmospheric Administration. Retrieved April 18, 2018. - ^ \"Astoria, Oregon (350324)\". Western Regional Climate Center. Retrieved December 31, 2013. - ^ \"Astoria WSO Airport, Oregon (350328)\". Western Regional Climate Center. Retrieved December 31, 2013. - ^ \"U.S. Climate Normals Quick Access – Station: Astoria RGNL AP, OR (1991–2020)\". National Oceanic and Atmospheric Administration. Archived from the original on September 6, 2023. Retrieved December 30, 2022. - ^ \"U.S. Climate Normals Quick Access – Station: Astoria Regional Airport, OR (1981–2010)\". National Oceanic and Atmospheric Administration. Archived from the original on September 6, 2023. Retrieved December 30, 2022. - ^ \"WMO climate normals for ASTORIA/CLATSOP, OR 1961–1990\". National Oceanic and Atmospheric Administration. Archived from the original on September 6, 2023. Retrieved September 6, 2023. - ^ \"2010 Census profiles: Oregon cities alphabetically A-C\" (PDF). Portland State University Population Research Center. Archived from the original (PDF) on March 3, 2016. Retrieved June 12, 2011. - ^ Moffat, Riley. Population History of Western U.S. Cities & Towns, 1850–1990. Lanham: Scarecrow, 1996, 206. - ^ \"Subcounty population estimates: Oregon 2000–2007\". United States Census Bureau, Population Division. March 18, 2009. Archived from the original (CSV) on July 9, 2009. Retrieved May 3, 2009. - ^ a b c \"2020 Decennial Census Demographic Profile (DP1)\". United States Census Bureau. 2021. Retrieved January 28, 2026. - ^ \"2020 Decennial Census Demographic and Housing Characteristics (DHC)\". United States Census Bureau. 2023. Retrieved January 28, 2026. - ^ \"2020 Decennial Census Redistricting Data (Public Law 94-171)\". United States Census Bureau. 2021. Retrieved January 28, 2026. - ^ \"U.S. Census website\". United States Census Bureau. Retrieved December 21, 2012. - ^ \"Shanghaied in Astoria Announces 2017 Showdates\". coastexplorermagazine.com. May 12, 2017. Retrieved April 17, 2018. - ^ a b \"City Council\". City of Astoria. Retrieved December 22, 2015. - ^ \"Seamanship | Job Corps\". jobcorps.gov. Retrieved May 31, 2022. - ^ Newspapers Published in Oregon Oregon Blue Book. Retrieved July 22, 2012. - ^ \"Oregon Newspaper Publishers Century Roster\" (PDF). Oregon Publisher. The Oregon Newspaper Publishers Association. June 2012. p. 7. Archived from the original (PDF) on June 19, 2012. Retrieved November 25, 2014. - ^ \"Coast River Business Journal – About Us\". Archived from the original on September 28, 2016. Retrieved May 30, 2016. - ^ \"One Tiger to a Hill\". IMDb. September 21, 1962. - ^ Sonja Stewart (May 16, 2011). \"Visit Your Favorite Family Movie Locations in Astoria, Oregon\". Parenting Squad. Retrieved March 3, 2014. - ^ \"Movies filmed in Astoria Oregon\". Astoria Oregon. Retrieved March 3, 2014. - ^ Ryan S. (a.k.a. Spoodawg) (July 8, 2010). \"Guest blogger: How did I spend my vacation? Visiting 'Goonies' filming locations!\". USA Today. Retrieved March 3, 2014. - ^ \"Filmed in Oregon 1908–2012\" (PDF). Oregon Governor's Office of Film & Television. Archived from the original (PDF) on August 14, 2014. Retrieved April 17, 2018. - ^ Oregon Official State Map (PDF) (Map). Oregon Department of Transportation. April 2023. Astoria and Coos Bay–North Bend insets. Retrieved May 11, 2025. - ^ Read, Richard (December 27, 2015). \"Astoria-Megler Bridge straddles 4 miles, guides ship pilots, withstands gusts: 'Spanning Oregon'\". The Oregonian. Retrieved May 11, 2025. - ^ Stratton, Edward (December 4, 2017). \"Clatsop, Columbia transit networks look at linking\". The Astorian. Retrieved May 11, 2025. - ^ Houghton, Katheryn (December 31, 2015). \"Bus funds wheel rural people together\". The Astorian. Retrieved May 11, 2025. - ^ \"Port History\". Port of Astoria. Retrieved May 11, 2025. - ^ Tobias, Lori (January 4, 2012). \"SeaPort Airlines raises concerns in some communities, hopes in others\". The Oregonian. Retrieved May 11, 2025. - ^ [1] AHS Hall of Fame - ^ \"Brian Bruney Stats\". Baseball Almanac. Retrieved December 31, 2013. - ^ Laird, Cynthia (October 1, 2015). \"Photographer Honey Lee Cottrell dies\". The Bay Area Reporter. Retrieved August 5, 2018. - ^ Lynn, Capi (April 5, 2005). \"She Should Be As Famous As Sacagawea\". Statesman Journal. Salem, Oregon. Archived from the original on February 3, 2013. Retrieved October 24, 2008. - ^ \"Jerry F. Gustafson\". fanbase.com. Archived from the original on August 12, 2014. Retrieved August 9, 2014. - ^ Brinkman, Brian R. (May 11, 2011). \"Wading in cerebrospinal fluid with Cass McCombs, Frank Fairfield and Michael Hurley\". Oregon Music News. Archived from the original on January 2, 2014. Retrieved December 31, 2013. - ^ \"National Register of Historic Places Nomination and Registration Forms: Mukilteo Light Station\". National Park Service. October 21, 1977. Retrieved June 8, 2015. - ^ Rosemont, Franklin (2003). Joe Hill: The IWW & The Making of a Revolutionary Working Class Counterculture. Chicago, Illinois: Charles H Kerr. ISBN 978-088-28626-4-4. - ^ \"Lundeen Made Lasting Impact at Oregon State\". Retrieved May 11, 2016. - ^ TMZ.com (October 7, 2008). \"Holly to Hugh: Hef Off\". Retrieved October 7, 2008. - ^ NW Spotlight (November 11, 2011). \"Veterans Day tribute to an Oregon hero: Don Malarkey\". OregonCatalyst. Retrieved December 31, 2013. - ^ Paul George Hummasti, Finnish Radicals in Astoria, Oregon, 1904–1940: A Study in Immigrant Socialism. New York: Arno Press, 1979; p. 44. - ^ \"Vampira: The haunting of Astoria High School\". The Daily Astorian. October 31, 2008. Archived from the original on January 1, 2014. Retrieved December 31, 2013. - ^ \"Mayors, 1948 – Present\". Seattle Municipal Archives. - ^ Reed, Tom (December 13, 2013). \"Small-town Jordan Poyer hopes to make it big time with the Cleveland Browns as a defensive back\". - ^ \"Biography\". Smithsonian Institution Archives. Retrieved June 19, 2013. - ^ \"Astoria Theatre Sign\". March 18, 2007. - ^ John, Finn J.D. (September 19, 2011). \"Astoria man set out to do something nice for his wife, ended up inventing cable TV\". Offbeat Oregon History. Retrieved December 31, 2013. - ^ KATIE KARPOWICZ. \"The Ataris Hop on the Nostalgia Boat, Bring 'So Long, Astoria' Tour To Chicago\". Gothamist LLC. Archived from the original on March 5, 2016. Retrieved May 13, 2016. - ^ Jane, Lauraa (September 15, 2015). \"Marianas Trench To Release New Album 'Astoria'\". Highlight Magazine. Retrieved January 4, 2018. - ^ \"Green Room (2015) - Filming & production - IMDb\". IMDB. Retrieved September 9, 2024. - ^ Joe James Custer (1944). Through the Perilous Night: The Astoria's Last Battle. The Macmillan Co"
}