{
  "url": "https://www.learnreligions.com/samuel-last-of-the-judges-701161",
  "title": "Who Was Samuel in the Bible?",
  "text": "Abrahamic / Middle Eastern Christianity The Old Testament Who Was Samuel in the Bible? Print Jesse presents his sons to Samuel, by James Tissot. Culture Club / Contributor / Getty Images Christianity The Old Testament Christianity Origins The Bible The New Testament Practical Tools for Christians Christian Life For Teens Christian Prayers Weddings Inspirational Bible Devotions Denominations of Christianity Christian Holidays Christian Entertainment Key Terms in Christianity Catholicism Latter Day Saints View More By Jack Zavada Jack Zavada Christianity Expert M.A., English Composition, Illinois State University B.S., English Literature, Illinois State University Jack Zavada is a writer who covers the Bible, theology, and other Christianity topics. He is the author \"Hope for Hurting Singles: A Christian Guide to Overcoming Life's Challenges.\" Learn about our Editorial Process Updated on June 18, 2024 In the Bible, Samuel was a man chosen for God, from his miraculous birth until his death. He served in several important positions during his life, earning God's favor because he knew how to obey. Samuel was a contemporary of King Saul and King David. His parents Elkanah and Hannah dedicated him to the Lord, giving the child to the priest Eli to be raised in the temple. In Acts 3:20 Samuel is portrayed as the last of the judges and the first of the prophets. Few people in the Bible were as obedient to God as Samuel. Samuel Known for: As a prophet and judge over Israel, Samuel was instrumental in the establishment of Israel's monarchy. God chose him to anoint and counsel Israel’s kings.Bible References: Samuel is mentioned in 1 Samuel 1-28; Psalm 99:6; Jeremiah 15:1; Acts 3:24, 13:20; and Hebrews 11:32.Father: ElkanahMother: HannahSons: Joel, AbijahHometown: Ramah of Benjamin, located in the hill country of Ephraim.Occupation: Priest, judge, prophet, \"seer,\" and called of God to anoint kings. Samuel's Story in the Bible Samuel was a Levite from the descendants of Kohath. He was one of the few biblical characters to have a detailed birth narrative. Early Life and Ministry His story in the Bible began with a barren woman, Hannah, praying to God for a child. The Bible says \"The Lord remembered her,\" and she became pregnant. She named the baby Samuel, which in Hebrew means \"the Lord hears\" or \"the name of God.\" When the boy was weaned, Hannah presented him to God at Shiloh, in the care of Eli the high priest. As a child, Samuel served at the Tabernacle, ministering to God with the priest Eli. He was a faithful young servant who had God's favor. One night God spoke to Samuel while he was sleeping, and the boy mistook the Lord's voice for Eli's. This happened three times until the old priest realized God was speaking to Samuel. Samuel Becomes a Prophet and Anoints Kings Samuel grew in wisdom and became a prophet. Following a great Philistine victory over the Israelites, Samuel became a judge and rallied the nation against the Philistines at Mizpah. He established his house at Ramah, riding a circuit to various cities where he settled the people's disputes. Unfortunately, Samuel's sons, Joel and Abijah, who had been delegated to follow him as judges, were corrupt, so the people demanded a king. Samuel listened to God and anointed the first king of Israel, a tall, handsome Benjaminite named Saul. Death and Legacy In his farewell speech, the aged Samuel warned the people to give up idols and serve the true God. He told them if they and King Saul disobeyed, God would sweep them away. But Saul did disobey, offering a sacrifice himself instead of waiting for God's priest, Samuel, to do it. Again Saul disobeyed God in a battle with the Amalekites, sparing the enemy's king and the best of their livestock when Samuel had ordered Saul to destroy everything. God was so grieved that he rejected Saul and chose another king. Samuel went to Bethlehem and anointed the young shepherd David, son of Jesse. Thus began a years-long ordeal as the jealous Saul chased David through the hills, trying to kill him. Samuel made yet another appearance to Saul—after Samuel had died. Saul visited a medium, the witch of Endor, ordering her to bring up the spirit of Samuel, on the eve of a great battle. In 1 Samuel 28:16-19, that apparition told Saul he would lose the battle, along with his life and the lives of his two sons. In all of the Old Testament, few people were as obedient to God as Samuel. He was honored as an uncompromising servant in the \"Hall of Faith\" in Hebrews 11. Character Strengths of Samuel in the Bible Samuel was an honest and fair judge, dispensing God's law impartially. As a prophet, he exhorted Israel to turn from idolatry and serve God alone. Despite his personal misgivings, he led Israel from the system of judges to its first monarchy. Samuel loved God and obeyed without question. His integrity prevented him from taking advantage of his authority. His first loyalty was to God, regardless of what the people or king thought of him. Weaknesses While Samuel was spotless in his own life, he did not raise his sons to follow his example. They took bribes and were dishonest rulers. Lessons From Samuel's Life Obedience and respect are the best ways to show love to God. While the people of his time were destroyed by their selfishness, Samuel stood out as a man of honor. Samuel shows how one can avoid the corruption of the world by placing God first. Key Bible Verses 1 Samuel 2:26 And the boy Samuel continued to grow in stature and in favor with the Lord and with people. (NIV) 1 Samuel 3:19-21The LORD was with Samuel as he grew up, and he let none of Samuel's words fall to the ground. And all Israel from Dan to Beersheba recognized that Samuel was attested as a prophet of the LORD. The LORD continued to appear at Shiloh, and there he revealed himself to Samuel through his word. (NIV) 1 Samuel 15:22-23Does the LORD delight in burnt offerings and sacrifices as much as in obeying the LORD? To obey is better than sacrifice, and to heed is better than the fat of rams... (NIV) 1 Samuel 16:7But the LORD said to Samuel, \"Do not consider his appearance or his height, for I have rejected him. The LORD does not look at the things people look at. People look at the outward appearance, but the LORD looks at the heart.\" (NIV) Cite this Article Format mla apa chicago Your Citation Zavada, Jack. \"Who Was Samuel in the Bible?\" Learn Religions, Jun. 18, 2024, learnreligions.com/samuel-last-of-the-judges-701161. Zavada, Jack. (2024, June 18). Who Was Samuel in the Bible? Retrieved from https://www.learnreligions.com/samuel-last-of-the-judges-701161 Zavada, Jack. \"Who Was Samuel in the Bible?\" Learn Religions. https://www.learnreligions.com/samuel-last-of-the-judges-701161 (accessed February 4, 2026). copy citation"
}