{
  "url": "https://sports.yahoo.com/nfl/article/vikings-fire-gm-kwesi-adofo-mensah-after-4-seasons-174644176.html",
  "title": "Vikings fire GM Kwesi Adofo-Mensah after 4 seasons - Yahoo Sports",
  "text": "Vikings fire GM Kwesi Adofo-Mensah after 4 seasons The Minnesota Vikings fired general manager Kwesi Adofo-Mensah after four seasons, the team announced Friday. Vikings owners Mark and Zygi Wilf put out a statement Friday saying that it was in \"the best interest of the team\" to move on from Adofo-Mensah and that executive vice president of football operations Rob Brzezinski will lead the operations group through the 2026 NFL Draft. Following the conclusion of the draft, there will be a search for a new GM. According to The Athletic's Alec Lewis, this decision was not expected, and while there had been \"tension\" around the organization recently, firing the GM came out of nowhere. Adofo-Mensah signed a multi-year extension to stay in Minnesota in May. \"This is a critical offseason. Ultimately, we felt the change was necessary in football operations and did not feel comfortable going forward into this offseason with the current leadership,\" Mark Wilf told reporters on Friday. \"It's not about any one decision or move. We looked at the situation cumulatively. We just didn't feel confident going through the entirety of the offseason, an additional draft, with this structure. We have an urgency to create a winning football team and establish sustainable success for our fans. At the same time we balance that urgency with all decisions thoroughly and methodically.\" The Vikings made the playoffs twice since Adofo-Mensah was hired in 2022. They won the NFC North title in his first season and compiled a 43-25 record during his time in charge. The news comes after the Vikings missed the playoffs this season with a 9-8 record and after Adofo-Mensah let Sam Darnold walk in free agency in order to have 2024 first-round draft pick J.J. McCarthy take over the starting quarterback job. That decision did not work out as McCarthy struggled with injury and inconsistency in his first full NFL season. Darnold, meanwhile, recorded a second straight 4,000-yard passing season in 2025 with 25 touchdowns and has led the Seattle Seahawks to Super Bowl LX against the New England Patriots. The McCarthy-over-Darnold decision was put to Adofo-Mensah on Thursday, with the now-former GM admitting some unease about the decision while saying he still understands the reasons behind it. \"You're trying to make sure you don't lock yourselves into what you did and thinking that it's always right, and so there are those nights you wake up and stare at the ceiling and ask yourself,\" he said. \"I always go back to the process and what we thought at the time. It's easier to and be revisionist and results-based, but going to think through what we had at the time, I still understand why we did what we did. \"The results maybe didn’t play out the way we wanted them to, but ultimately, I think at the end of the day we could have executed better in certain places. I don't want to say it individually, in terms of a particular player, but just executing better — knowing what the room was, play style-wise, experience-wise, and just putting together a better combination of people, a collective in that group, that's probably what I focused on the most.\" McCarthy did not play his rookie season in 2024 after tearing the meniscus in his right knee in the preseason. That opened the door for Darnold, who went on to throw for a career-high 4,319 yards and 35 touchdowns as the Vikings finished 14-3 before losing in the wild-card round."
}