{
  "url": "https://www.pbs.org/newshour/nation/jill-bidens-ex-husband-charged-with-killing-his-wife-in-domestic-dispute-in-delaware",
  "title": "Jill Biden's ex-husband charged with killing his wife in domestic dispute in Delaware | PBS News",
  "text": "By — Associated Press Associated Press Leave your feedback Share Copy URL https://www.pbs.org/newshour/nation/jill-bidens-ex-husband-charged-with-killing-his-wife-in-domestic-dispute-in-delaware Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter Jill Biden's ex-husband charged with killing his wife in domestic dispute in Delaware Nation Feb 3, 2026 3:08 PM EST WILMINGTON, Del. (AP) — The first husband of former first lady Jill Biden has been charged with killing his wife at their Delaware home in late December, authorities announced in a news release Tuesday. William Stevenson, 77, of Wilmington was married to Jill Biden from 1970 to 1975. Caroline Harrison, the Delaware Attorney General's spokesperson, confirmed in a phone call that Stevenson is the former husband of Jill Biden. Jill Biden declined to comment, according to an emailed response from a spokesperson at the former president and first lady's office. Stevenson remains in jail after failing to post $500,000 bail after his arrest Monday on first-degree murder charges. He is charged with killing Linda Stevenson, 64, on Dec. 28. Police were called to the home for a reported domestic dispute after 11 p.m. and found a woman unresponsive in the living room, according to a prior news release. Life-saving measures were unsuccessful. She ran a bookkeeping business and was described as a family-oriented mother and grandmother and a Philadelphia Eagles fan, according to her obituary, which does not mention her husband. Stevenson was charged in a grand jury indictment after a weekslong investigation by detectives in the Delaware Department of Justice. It was not immediately clear if Stevenson has a lawyer. He founded a popular music venue in Newark called the Stone Balloon in the early 1970s. Jill Biden married U.S. Sen. Joe Biden in 1977. He served as U.S. president from January 2021 to January 2025. A free press is a cornerstone of a healthy democracy. Support trusted journalism and civil dialogue. Donate now By — Associated Press Associated Press WILMINGTON, Del. (AP) — The first husband of former first lady Jill Biden has been charged with killing his wife at their Delaware home in late December, authorities announced in a news release Tuesday. William Stevenson, 77, of Wilmington was married to Jill Biden from 1970 to 1975. Caroline Harrison, the Delaware Attorney General's spokesperson, confirmed in a phone call that Stevenson is the former husband of Jill Biden. Jill Biden declined to comment, according to an emailed response from a spokesperson at the former president and first lady's office. Stevenson remains in jail after failing to post $500,000 bail after his arrest Monday on first-degree murder charges. He is charged with killing Linda Stevenson, 64, on Dec. 28. Police were called to the home for a reported domestic dispute after 11 p.m. and found a woman unresponsive in the living room, according to a prior news release. Life-saving measures were unsuccessful. She ran a bookkeeping business and was described as a family-oriented mother and grandmother and a Philadelphia Eagles fan, according to her obituary, which does not mention her husband. Stevenson was charged in a grand jury indictment after a weekslong investigation by detectives in the Delaware Department of Justice. It was not immediately clear if Stevenson has a lawyer. He founded a popular music venue in Newark called the Stone Balloon in the early 1970s. Jill Biden married U.S. Sen. Joe Biden in 1977. He served as U.S. president from January 2021 to January 2025. A free press is a cornerstone of a healthy democracy. Support trusted journalism and civil dialogue. Donate now"
}