{
  "url": "https://www.reddit.com/r/PokemonLegendsArceus/comments/sjqaya/shiny_hunting_made_easy/",
  "title": "Reddit - The heart of the internet",
  "text": "Shiny hunting made easy I saw the infographic on the front page of the sub and it contains what is in my experience some less than good advice on shiny hunting, so I thought I'd write out what I've been doing that seems to work pretty well. I've almost filled an entire box with shinies so far using this method, it's simple and it works. First off, if you want to be really efficient about it, I'd suggest getting Braviary and an 8* Pokedex rank before you get started. Neither are necessary but they will save you a TON of time. I also don't recommend bothering with a perfect entry or the Shiny Charm as they don't really increase the odds enough to make up for the huge amount of time it would take to get them. I say you should get 8* for one very important reason: Jet balls. Jet balls are amazing, they take a LOT of the frustration out of shiny hunting, especially if you're going after one of the more notoriously aggressive species. The basic method is this: - Turn off Autosave - Get an outbreak by repeatedly going back and forth between Jubilife and an area. You don't have to sleep or do anything else, just immediately leave once you load into camp. - Once you have an outbreak, back out of the map and SAVE your game at Jubilife, then go to the area with the outbreak. - SAVE at the camp - Go check the outbreak - Clear out the spawns. You can catch them or battle them or whatever you want. By far the fastest way to do it is to stand back and chuck Jet Balls at everything, but you do you. Note that a lot of guides suggest just checking the first 4 and reloading, but it takes MUCH longer to reload and check 4 than it does to just clear it and check a dozen, and out of the 23 or so shinies I've found using outbreaks, only 2 of them were in the initial set of 4. - If a shiny spawns, DO NOT SAVE YOUR GAME. If something happens and you miss the shiny, you can reload from your camp save and go get it again. I had to reload 7 times to get my shiny Basculin, he was there every time. If you save during the outbreak itself, and your shiny runs away, reloading will just get you an empty screen and hurt feelings. I learned this the hard way. - If you don't get a shiny, reload your camp save, go back to Jubilife, come back to the area, and SAVE at the camp again. Repeat steps 4-8 until you get the shiny. Using this method I can do the full cycle every 3-5 minutes depending on travel time to the spawn, and I've been averaging a shiny an hour at minimum. Some notes: - the cycle of \"load at camp > go to jubilife > back to camp and save\" is important. If you don't save every time you go back you'll just end up checking the same spawns over and over - I've found that I tend to get additional outbreaks easier if I already had one going, so even if the first one you get isn't exiting, make sure you go to that area and save before continuing to reset. - Once again I need to emphasize, do not save your game during the outbreak itself. Reloading will wipe the outbreak and you won't get anything. If you reload your save from the camp, your shiny will still be there, there is no reason to save again."
}