{
  "url": "https://www.exchange-rates.org/converter/eur-gbp",
  "title": "EUR to GBP - Euro to British Pound Conversion",
  "text": "Check the latest currency exchange rates for the Euro, British Pound and all major world currencies. Our currency converter is simple to use and also shows the latest currency rates. Frequently Asked Question about EUR to GBP How much is 1 Euro in British Pounds? 1 Euro = 0.8646 British Pounds as of February 5, 2026 12:45 AM UTC. You can get live exchange rates between Euros and British Pounds using exchange-rates.org, which aggregates real-time forex data from the most authoritative sources. How much is 100 Euros in British Pounds? As of February 5, 2026 12:45 AM UTC, 100 Euros is equivalent to 86.460 British Pounds. The exchange rate at this time is 0.8646 British Pounds per Euro. What was the highest EUR to GBP exchange rate in the last 10 years? In the last 10 years, the highest rate from Euros to British Pounds was on March 18, 2020 when each Euro was worth 0.9427 British Pounds. When is the best time to convert EUR to GBP? The EUR and GBP can be traded 24x5, starting from the time markets open on Monday mornings in Sydney until they close on Fridays at 5 PM in New York. Exchange rates can fluctuate by the minute while markets are open. However, the period between 3-4 PM GMT is often a good time to convert Euros to British Pounds because currency market liquidity and trading volume tend to be the highest during this time. Additionally, it's advisable to convert Euros to British Pounds early in the week if you need GBP urgently. Executing a trade late in the week might result in a delayed settlement until the following week, as forex markets are closed on weekends. Which is stronger, the Euro or the British Pound? The British Pound is currently stronger than the Euro, as 1 GBP is equal to 1.1566 EUR. Conversely, 1 EUR is worth 0.8646 GBP. Is the Euro up or down against the British Pound? The Euro has decreased -0.85% year-to-date against the British Pound. Over the past 10 years, the Euro has appreciated +1.40% against the British Pound. Consequently, the Euro has gained purchasing power compared to the British Pound over the last decade. What's the best EUR to GBP exchange rate today? As of February 5, 2026 12:45 AM UTC, the best EUR to GBP exchange rate is 0.8646 GBP. This means that for every Euro you exchange, you will receive 0.8646 British Pounds."
}