{
  "url": "https://vocabularypoint.com/participle-verbs-list/",
  "title": "250+ Past Participle Verbs List - Vocabulary Point",
  "text": "Participles are versatile verb forms that play a crucial role in constructing clear and concise sentences. Whether used to form verb tenses, create adjectives, or serve as independent clauses, understanding participle verbs is essential for effective communication in both spoken and written English. However, with the vast number of participles available in the English language, it can be overwhelming to navigate through this grammatical landscape. That is why we have compiled an extensive participle verbs list that will serve as a comprehensive resource for writers and speakers alike. What is a Past Participle? A past participle is a form of a verb that is used in perfect tenses and passive voice. It usually ends in -ed for regular verbs (e.g., “walked,” “fixed”), but can have different forms for irregular verbs (e.g., “eaten,” “driven”). Past participles can also be used as adjectives (e.g., “broken window,” “finished work”). Past Participles: - Regular verbs end with “-ed” (e.g., walked, talked). - Irregular verbs have unique forms (e.g., gone, done). - Used in perfect tenses (e.g., I have finished my work). - Also used as adjectives (e.g., the broken window). Past Participle Verbs List - Accepted - Baked - Called - Danced - Eaten - Faced - Gained - Handed - Identified - Jumped - Kept - Laughed - Made - Noticed - Opened - Packed - Questioned - Ran - Said - Talked - Used - Visited - Waited - Walked - Xeroxed - Yielded - Zoomed - Advised - Begged - Created - Decorated - Enjoyed - Filed - Gathered - Helped - Imagined - Judged - Kicked - Learned - Moved - Named - Offered - Painted - Qualified - Read - Sang - Taught - Understood - Voted - Washed - Worked - X-rayed - Yawned - Zipped - Arrived - Believed - Caught - Delivered - Exercised - Fished - Guaranteed - Hoped - Installed - Joined - Knitted - Listened - Measured - Noticed - Owned - Planned - Quizzed - Recorded - Shared - Touched - Updated - Voiced - Watched - Wondered - Yelled - Zigzagged - Appeared - Borrowed - Chosen - Dreamed - Expected - Fixed - Handed - Hung - Introduced - Jumped - Known - Landed - Mentioned - Obeyed - Played - Quit - Recalled - Shown - Traveled - Undergone - Taken - Broken - Written - Eaten - Seen - Slept - Run - Swum - Driven - Thrown - Built - Bought - Caught - Chosen - Forgotten - Hidden - Lost - Paid - Sung - Spoken - Stolen - Torn - Worn - Forgiven - Risen - Shaken - Swung - Frozen - Grown - Known - Lain - Sworn - Drawn - Sought - Told - Blown - Flown - Gone - Met - Spent - Swept - Woken - Jumped - Arrived - Played - Cooked - Found - Given - Smelled - Felt - Heard - Sold - Closed - Opened - Learned - Taught - Hurt - Lived - Begun - Studied - Held - Dreamed - Woven - Bitten - Ridden - Lied - Beaten - Finished - Painted - Read Must Learn: List Of Common Verbs In English List of irregular verbs in English Verbs With Past And Past Participle Irregular Verbs Present Past Past Participle Irregular Verb Past Participle List - Been (Be) – She had been a great leader in her community. - Borne (Bear) – The evidence borne by the facts was undeniable. - Beaten (Beat) – The champion had never been beaten in a match. - Become (Become) – He had become an expert in his field. - Begun (Begin) – The project had just begun when funding was cut. - Bent (Bend) – The metal rod was bent out of shape. - Bet (Bet) – He had bet all his money on the wrong horse. - Bitten (Bite) – The apple had been bitten into. - Blown (Blow) – The candles had been blown out. - Broken (Break) – The vase was broken into a thousand pieces. - Brought (Bring) – She had brought her expertise to the team. - Built (Build) – A new school had been built in the town. - Bought (Buy) – He had bought the car at an auction. - Caught (Catch) – The thief was caught by the police. - Chosen (Choose) – The best candidate was chosen for the job. - Come (Come) – They had come a long way since their humble beginnings. - Cost (Cost) – The project had cost more than expected. - Cut (Cut) – The paper was cut into precise shapes. - Dealt (Deal) – She had dealt with difficult situations before. - Done (Do) – All the work had been done by the deadline. - Drawn (Draw) – A beautiful landscape had been drawn by the artist. - Dreamt (Dream) – He had dreamt about this moment for years. - Driven (Drive) – She had driven through the night to get here. - Drunk (Drink) – The water had been drunk quickly in the heat. - Eaten (Eat) – The cake had been eaten by the time we arrived. - Fallen (Fall) – The leaves had fallen from the trees. - Fed (Feed) – The animals had been fed before we left. - Felt (Feel) – She had never felt this happy before. - Fought (Fight) – The soldiers had fought bravely. - Found (Find) – The lost treasure had been found. - Flown (Fly) – The birds had flown south for the winter. - Forgotten (Forget) – The password had been forgotten. - Frozen (Freeze) – The lake had frozen over night. - Got (Get) – He had finally got what he deserved. - Given (Give) – The gift had been given with love. - Gone (Go) – She had gone to the store earlier. - Grown (Grow) – The plant had grown significantly. - Hung (Hang) – The painting had been hung on the wall. - Heard (Hear) – His speech had been heard by thousands. - Hidden (Hide) – The key had been hidden under the mat. - Hit (Hit) – The ball had been hit out of the park. - Held (Hold) – The record had been held for decades. - Hurt (Hurt) – His feelings had been hurt by the comment. - Kept (Keep) – The secret had been kept for years. - Known (Know) – She had known the answer all along. - Laid (Lay) – The table had been laid for dinner. - Led (Lead) – He had led the team to victory. - Left (Leave) – They had left early to avoid traffic. - Lent (Lend) – The book had been lent to a friend. - Let (Let) – She had let the opportunity slip away. - Lied (Lie) – He had lied about his qualifications. - Lit (Light) – The candles had been lit for the ceremony. - Lost (Lose) – The game had been lost in the final seconds. - Made (Make) – A decision had been made after much thought. - Meant (Mean) – His words had meant more than he realized. - Met (Meet) – They had met by chance years ago. Regular Verb Past Participle List - Accepted (Accept) – The offer had been accepted with gratitude. - Asked (Ask) – She had asked for assistance when needed. - Booked (Book) – The flight had been booked weeks in advance. - Cleaned (Clean) – The house had been cleaned thoroughly. - Danced (Dance) – They had danced until the early hours. - Described (Describe) – The scene had been described in vivid detail. - Entered (Enter) – He had entered the competition with confidence. - Fixed (Fix) – The problem had been fixed by the engineer. - Guessed (Guess) – She had guessed the answer correctly. - Helped (Help) – They had helped in every way they could. - Joked (Joke) – He had joked to lighten the mood. - Jumped (Jump) – The athlete had jumped further than ever before. - Kicked (Kick) – The ball had been kicked into the goal. - Laughed (Laugh) – We had laughed at the old jokes. - Learned (Learn) – The students had learned a valuable lesson. - Moved (Move) – The furniture had been moved to the new house. - Opened (Open) – The door had been opened to reveal a surprise. - Played (Play) – The band had played their best song. - Questioned (Question) – The suspect had been questioned for hours. - Relaxed (Relax) – She had relaxed on the beach all day."
}