{
  "url": "https://www.contabilizei.com.br/contabilidade-online/como-emitir-nota-fiscal-mei/",
  "title": "Como emitir nota fiscal MEI: passo a passo | Contabilizei",
  "text": "Como emitir nota fiscal MEI: passo a passo Neste artigo você vai ver: - O que é nota fiscal MEI e para que serve? - Passo a passo de como emitir notas fiscais de serviço pelo Portal Nacional - Como emitir Nota Fiscal MEI no Portal Nacional Web? - Quais as diferenças entre NF-e e NFS-e? - Como emitir Nota Fiscal MEI pelo aplicativo NFS-e Mobile? - Como preencher e emitir Nota Fiscal Avulsa (NFA-E) sendo um MEI? - Como emitir Nota Fiscal Eletrônica (NF-e) para MEI? - Quando o MEI precisa emitir nota fiscal? - Como emitir nota fiscal como MEI prestador de serviços? - Quais os cuidados para emissão da nota fiscal como MEI? - Como emitir Nota Fiscal MEI? Recapitulando! - Começou a faturar mais que o limite do MEI? O passo a passo de como emitir nota fiscal MEI envolve entender se você está vendendo um produto ou prestando um serviço. Isso é o que define o tipo de nota fiscal a ser emitida. A emissão de notas fiscais pelo MEI depende de dois fatores principais: Neste artigo você vai ver: - O que é nota fiscal MEI e para que serve? - Passo a passo de como emitir notas fiscais de serviço pelo Portal Nacional - Como emitir Nota Fiscal MEI no Portal Nacional Web? - Quais as diferenças entre NF-e e NFS-e? - Como emitir Nota Fiscal MEI pelo aplicativo NFS-e Mobile? - Como preencher e emitir Nota Fiscal Avulsa (NFA-E) sendo um MEI? - Como emitir Nota Fiscal Eletrônica (NF-e) para MEI? - Quando o MEI precisa emitir nota fiscal? - Como emitir nota fiscal como MEI prestador de serviços? - Quais os cuidados para emissão da nota fiscal como MEI? - Como emitir Nota Fiscal MEI? Recapitulando! - Começou a faturar mais que o limite do MEI? - O que você vende ou oferece (produto ou serviço); - Para quem você vende (empresa ou pessoa física). Ao entender esses fatores, é possível definir qual nota fiscal deve ser emitida, sendo elas: - Nota Fiscal de Serviço (NFS-e): para quem presta serviços; - Nota Fiscal de Produto (NF-e ou NFC-e): para quem vende mercadorias. Vale lembrar que o MEI não é obrigado a emitir nota fiscal para o consumidor que é pessoa física, exceto quando o cliente solicitar. Já para outras empresas, a emissão de nota fiscal pelo MEI é sempre obrigatória. Confira esse material elaborado pelos especialistas da Contabilizei e tire todas as suas dúvidas sobre como emitir nota fiscal MEI. Veja o passo a passo e evite erros. O que é nota fiscal MEI e para que serve? A Nota Fiscal do Microempreendedor Individual (MEI) é o documento que comprova oficialmente a venda de um produto ou a prestação de um serviço. Emitir nota fiscal é essencial para manter o negócio regularizado. Além disso, a nota fiscal emitida pelo MEI deve seguir o modelo correspondente à atividade econômica realizada na operação. Em casos de vendas ou serviços prestados para outras empresas, o MEI é obrigado a emitir nota fiscal. Já no caso de vendas ou serviços para pessoas físicas, o MEI não é obrigado a emitir nota fiscal (exceto quando o cliente solicitar). A emissão da Nota Fiscal MEI é uma forma de garantir a legalidade e profissionalismo do negócio. Além de ser obrigatória em muitas situações, a nota fiscal transmite confiança ao cliente. \"Emitir uma nota fiscal é como dar à sua empresa um cartão de visita. É a primeira forma de mostrar ao mundo que você está levando o seu negócio a sério e está pronto para crescer de forma profissional.\" Importante: o MEI não paga imposto por cada nota emitida, pois os tributos já estão incluídos na contribuição mensal fixa feita pelo Documento de Arrecadação do Simples Nacional (DAS). Além da Nota Fiscal, o Recibo de Pagamento é um documento importante para o controle financeiro de um prestador de serviços ou de uma empresa. Conheça o Emissor de Recibo Grátis da Contabilizei! Passo a passo de como emitir notas fiscais de serviço pelo Portal Nacional Para emitir notas fiscais de serviço pelo Portal Nacional, é preciso: - Se cadastrar no Portal Nacional, caso não tenha cadastro; - Configurar as informações da sua empresa; - Cadastrar seus serviços como favoritos. Veja a seguir como realizar cada uma dessas etapas. 1. Cadastro e configuração no Portal Nacional Antes de emitir nota fiscal neste sistema, você deve acessar o portal com a sua conta Gov.br. Também é possível realizar o seu cadastro de forma online, no Portal Nacional da NFSe, caso você ainda não tenha. Este cadastro é feito uma única vez e só após a conclusão dele é que você terá acesso para emitir suas notas fiscais. - Acesse o Portal da NFS-e e faça login: use seu CNPJ MEI e senha para acessar o sistema. Se ainda não tiver acesso, faça o cadastro da sua empresa selecionando a opção “Fazer primeiro acesso”; - Selecione a opção “CNPJ” e preencha seu CNPJ, seu CPF e sua data de nascimento. Depois, clique em “Avançar”; - No campo “Título de Eleitor”, insira o número do seu título eleitoral. Se você declara imposto de renda como pessoa física, use o número do recibo de entrega da sua declaração dos últimos dois anos. Se você não estiver com o número dos recibos, basta acessar o portal E-cac com seus dados de acesso, e pegar os números; - Informe seu e-mail pessoal ou o e-mail de sua empresa e crie a senha de acesso de acordo com as orientações do site; - Após seguir com seus dados de acesso, você receberá um código de segurança no e-mail que cadastrou; - Confira o código e preencha no campo correspondente do site. Isso vai validar seu cadastro no Portal Nacional da NFSe, e é muito importante que seja feito imediatamente para a finalização do cadastro; - Ao clicar em “Avançar”, se não aparecer nenhum erro, o seu cadastro de dados de acesso foi concluído. 2. Configure as informações da sua empresa Agora, com seu login e senha em mãos, acesse o Portal Nacional para configurar as informações de sua empresa. Para fazer isso: - Clique em “Configurações” e preencha os campos de informações pessoais; - No campo “Valor Aproximado dos Tributos”, selecione a terceira opção: “Não informar nenhum valor estimado para os tributos”. Essa configuração é importante, pois só depois de finalizada é que você pode acessar a sua conta no aplicativo NFS-e Mobile para emissão de notas fiscais pelo celular, com mesmo login e senha. 3. Cadastre seus serviços como favoritos Você pode cadastrar vários serviços como favoritos, que serão usados posteriormente na emissão das suas notas fiscais como MEI, tanto no emissor Web quanto no aplicativo. Para fazer isso: - Acesse o ícone de “Serviços Favoritos” e cadastre seus serviços clicando em “+Novo Serviço Favorito”; - E preencha os campos solicitados pesquisando pela descrição ou palavras chaves de seu serviço. Agora no Portal Nacional, os códigos e descrições são com base na legislação de abrangência nacional, ou seja, estão padronizados para todo o Brasil. Isso porque a partir de 1º de setembro de 2023, o MEI prestador de serviços passou a ser obrigado a emitir a Nota Fiscal de Serviço eletrônica (NFS-e) por meio do Portal Nacional, conforme determina a Resolução CGSN nº 169/2022. Essa medida visa padronizar o processo de emissão de notas em todo o país e facilitar o cumprimento das obrigações fiscais pelo microempreendedor. Com esses passos simples, você estará pronto para emitir notas fiscais como MEI de forma eficiente. Veja em mais detalhes como se cadastrar e configurar o Portal Nacional, além de todo o passo a passo de como emitir nota fiscal MEI neste vídeo feito pelos nossos especialistas. Saiba como emitir nota fiscal pessoa física. Como emitir Nota Fiscal MEI no Portal Nacional Web? Após ter realizado o seu cadastro no Portal Nacional, usando seu CNPJ e criando sua senha (que será a mesma para o aplicativo NFS-e Mobile), é possível emitir sua nota fiscal de serviço eletrônica. Para emitir Nota Fiscal MEI no Portal Nacional Web, é preciso seguir estes passos: - Acesse o Portal Nacional: entre no site oficial do Governo Federal para emitir a NFS-e ou use o app NFS-e Mobile; - Faça o login: use a sua conta gov.br com login e senha ou o certificado digital; - Selecione a emissão: clique em “Nova NFS-e” e escolha entre a emissão simplificada ou a completa. A emissão simplificada é para os serviços já cadastrados como favoritos, enquanto a completa é obrigatória para alguns serviços específicos; - Preencha os dados: informe a data de competência da nota fiscal (quando o serviço foi prestado), qual é o serviço prestado, valor e dados do cliente; - Emita a nota: depois de revisar todos os dados, clique em “Emitir NFS-e” e a nota será emitida. Se precisar fazer ajustes antes da emissão, clique em “editar” e, depois que estiver tudo certo, emita a nota. - Baixe ou imprima: depois de emitir a nota, você pode baixar o arquivo da nota em PDF ou imprimir o DANFE (Documento Auxiliar da Nota Fiscal Eletrônica). \"A precisão dos dados é fundamental ao emitir uma nota fiscal MEI, não apenas para a fiscalização, mas para a transparência com o seu cliente. Antes de emitir, sempre faça uma checagem dupla de todas as informações. Esse cuidado é o que separa o amador do profissional e garante que seu negócio opere sem surpresas desagradáveis.\" Vale lembrar que como MEI, você contribui com o ISS na DAS MEI. Por isso, deve responder “não” à pergunta sobre a incidência do ISS na prestação de serviço no momento de emitir a nota fiscal. O mesmo vale para a parte de tributação municipal: você deve responder “não” a todas as perguntas sobre tributação municipal no momento de emitir a nota fiscal. Sendo assim, clique em “Não informar nenhum valor estimado de tributos”. Isso porque o ISS é recolhido na DAS MEI e não de forma avulsa. Vale lembrar que nem todos os profissionais podem ser MEI. Se estiver na dúvida, consulte a tabela de atividades do MEI e veja se você está enquadrado corretamente. Quais as diferenças entre NF-e e NFS-e? A principal diferença entre a NF-e e a NFS-e está na finalidade de cada uma: - NF-e (Nota Fiscal Eletrônica) é usada para registrar a venda de produtos físicos; - NFS-e (Nota Fiscal de Serviço Eletrônica) é usada para registrar a prestação de serviços. A NF-e é exigida em operações de comércio, como compra e venda de mercadorias, seja no varejo ou atacado. Por exemplo: uma loja de informática que vende peças, acessórios ou computadores deve emitir uma NF-e, pois está vendendo produtos físicos. Já a NFS-e (Nota Fiscal de Serviço Eletrônica) se aplica para empresas e profissionais que oferecem serviços técnicos, manuais ou intelectuais. Por exemplo: se a mesma loja de informática faz manutenção, conserto ou instalação, deve emitir uma NFS-e, pois está prestando um serviço e não vendendo um produto. Saiba qual o limite MEI em 2026. Como emitir Nota Fiscal MEI pelo aplicativo NFS-e Mobile? Para emitir suas notas fiscais MEI pelo seu celular ou tablet: - Baixe o aplicativo NFS-e Mobile pela App Store ou Google Play; - Com os dados da configuração e dos serviços favoritos preenchidos previamente no site, acesse com a conta Gov.br ou login e senha; - Clique em emitir NFS-e; - Selecione o serviço prestado. Aqui aparecerão os serviços previamente cadastrados como favoritos no Emissor Web; - Preencha com o valor do serviço prestado e clique em Emitir NFS-e; - Nota Fiscal emitida com sucesso - Basta clicar em cima da nota que estará disponível o PDF para encaminhar ao cliente! Viu como agora a emissão de nota fiscal eletrônica pelo Portal Nacional está mais simples e fácil? A NFS-e é a forma mais moderna e eficiente de emitir notas fiscais e, por isso, é importante que o MEI se atualize e se adapte a essa modalidade. Lembrando que essa foi uma medida do Governo Federal em parceria com o Sebrae para simplificar o acesso à emissão de notas fiscais ao Microempreendedor Individual. Como preencher e emitir Nota Fiscal Avulsa (NFA-E) sendo um MEI? Para preencher e emitir a Nota Fiscal Avulsa Eletrônica (NFA-e) como MEI, é necessário: - Verificar se seu estado oferece a NFA-e: acesse o portal da SEFAZ do seu estado e veja se a Nota Fiscal Avulsa Eletrônica está disponível para MEIs. Exemplos de estados que oferecem a NFA-e: - Paraná (PR): o Paraná oferece o sistema de Nota Fiscal Avulsa Eletrônica para MEIs. - Rio Grande do Sul (RS): possui a opção de NFA-e disponível para MEIs. - Se cadastrar ou fazer login no portal da SEFAZ: crie um cadastro ou entre com suas credenciais no portal da SEFAZ do seu estado. - Solicitar autorização: em alguns estados, você precisa pedir autorização para emitir a NFA-e. Esse processo pode ser automático ou precisar de aprovação. - Preencher os dados da nota fiscal: inclua as informações como: - Dados do emitente (MEI); - Dados do destinatário (cliente); - Descrição do produto (quantidade, valor, CFOP); - Valor total e modalidade de frete. - Validar e transmitir a NFA-e: após preencher os dados, o sistema valida as informações e, se estiver tudo certo, emite a nota fiscal. A nota também é enviada para a SEFAZ. Você deve receber a chave de acesso e o protocolo de autorização. - Imprimir e guardar a NFA-e: imprima o DANFE (Documento Auxiliar). Vale lembrar que é fundamental que o MEI verifique qual tipo de nota fiscal a Secretaria da Fazenda do estado oferece. Isso porque alguns estados disponibilizam emissores próprios de Nota Fiscal Avulsa Eletrônica (NFA-e), como o Rio Grande do Sul, Goiás, Mato Grosso, Mato Grosso do Sul, Rio de Janeiro, entre outros. Já em outros estados, a Nota Fiscal Eletrônica (NF-e) deve ser o modelo utilizado, como em São Paulo. Como emitir Nota Fiscal Eletrônica (NF-e) para MEI? O primeiro passo é verificar as condições exigidas no estado onde o MEI foi aberto. Dentre essas condições, há duas exigências iguais para a maioria dos estados: - A necessidade de possuir um Certificado Digital E-CPF ou E-CNPJ; - A necessidade de solicitar junto à Secretaria da Fazenda do Estado (SEFAZ) o credenciamento para emissão de notas fiscais. Conforme o procedimento de cada estado, esse credenciamento pode ser feito de forma presencial ou online. Isso geralmente requer um agendamento prévio para a formalização do pedido de credenciamento. Por exemplo: a Secretaria da Fazenda do Estado de São Paulo publicou o procedimento de como solicitar o credenciamento para emissão de NF-e, em substituição ao uso da nota manual. Para que você possa verificar como é este procedimento e outras condições em sua localidade, acesse o site da Sefaz do seu estado e pesquise por termos como: NF-e MEI, Credenciamento para emissão de NF-e e Nota fiscal Avulsa. Quando o MEI precisa emitir nota fiscal? O MEI precisa emitir nota fiscal em situações específicas, como: - Venda de produtos ou mercadorias para outra pessoa jurídica (empresas): nesse caso, o MEI deve emitir a Nota Fiscal Eletrônica (NF-e) acompanhada do Documento Auxiliar da Nota Fiscal Eletrônica (DANFE), a imagem impressa e que acompanha a mercadoria; - Prestação de serviços para outra pessoa jurídica (empresas): quando o MEI presta serviços para uma empresa, é obrigado a emitir a Nota Fiscal de Serviço (NFS-e) para comprovar a prestação do serviço; - Quando o cliente pessoa física exigir a nota fiscal, comprovando a compra ou serviço tomado. Nessas situações em específico, o MEI é obrigado a emitir nota fiscal. Para vendas ou serviços prestados para pessoas físicas que não exigem nota fiscal, o MEI não é obrigado a emitir. Porém, é recomendado que faça a emissão para garantir a transparência e a segurança nas transações. Vale lembrar que, nos demais portes empresariais, a emissão de nota fiscal é obrigatória para todas as operações. Importante: desde 1º de abril de 2025, todo MEI que emitir Nota Fiscal de Serviço eletrônica (NFS-e) deve informar o Código do Regime Tributário (CRT) 4 no documento. Essa exigência faz parte da padronização nacional da nota fiscal determinada pela Receita Federal. Saiba mais no artigo “CRT-4 para MEI: o que é, como e quando você deve informá-lo na nota fiscal?”. Se você atingiu o limite de faturamento do MEI e precisa emitir suas notas fiscais como uma microempresa, pode ser a hora de você migrar o seu CNPJ. Para isso, saiba quanto custa tirar um CNPJ com a calculadora exclusiva da Contabilizei. Ainda não é microempreendedor individual? Saiba como abrir um MEI. Como emitir nota fiscal como MEI prestador de serviços? Desde setembro de 2023, todas as empresas registradas como Microempreendedor Individual (MEI) devem emitir suas notas fiscais de serviço exclusivamente pelo Portal da Nota Fiscal de Serviço Eletrônica. Os portais municipais já não estão mais disponíveis para emissão de notas, apenas para consultar informações e notas emitidas anteriormente. Outra novidade, é que após o cadastro no Portal Nacional, o mesmo acesso pode ser utilizado no aplicativo NFS-e Web de qualquer dispositivo móvel para emissão de notas fiscais. Quais os cuidados para emissão da nota fiscal como MEI? No caso de prestação de serviço, os cuidados para emissão da nota fiscal como MEI são: - Seguir o que estiver estabelecido no contrato de prestação de serviço; - Seguir o que foi acordado com o contratante do tomador do serviço; - Lembrar que os dados referentes ao serviço prestado (como data, valor e descrição) são sensíveis, pois impactam diretamente na operação do MEI prestador do serviço; No caso de comércio, os cuidados para emissão da nota fiscal como MEI são: - Preencher corretamente as informações sobre o bem descrito na nota fiscal; - Preencher corretamente os dados fiscais, como NCM (Nomenclatura Comum do Mercosul), CFOP (Código Fiscal de Operações e Prestações) e CSOSN (Código de Situação da Operação no Simples Nacional). Vale lembrar que caso alguma dessas informações fiscais esteja errada, isso pode levar a SEFAZ do estado a gerar cobranças tributárias adicionais sobre sua empresa. Essas cobranças só serão regularizadas após correção da nota e esclarecimentos à Receita Federal. Em ambas as situações, de serviços e mercadorias, é muito importante ter os dados do tomador do serviço ou remetente da mercadoria sempre atualizados e corretos na nota fiscal. Além disso, desde 1º de abril de 2025, entrou em vigor uma nova regra para emissão de Nota Fiscal Eletrônica (NF-e) e Nota Fiscal de Consumidor Eletrônica (NFC-e). A principal mudança é a obrigatoriedade de informar o Código de Regime Tributário (CRT 4), exclusivo para MEIs, no momento da emissão. Além disso, é necessário utilizar o CFOP correspondente à operação, como venda ou devolução. Se os dados forem preenchidos incorretamente, a nota fiscal poderá ser rejeitada pelos sistemas da Secretaria da Fazenda do estado. Se você desejar encerrar o seu MEI, é possível solicitar a baixa. Saiba como cancelar o MEI em poucos passos neste material preparado pelos especialistas da Contabilizei. Como emitir Nota Fiscal MEI? Recapitulando! Muitas informações? Vamos resumir os pontos principais sobre como emitir Nota Fiscal MEI: - O que é nota fiscal MEI: é o documento que comprova a venda de um produto ou a prestação de um serviço do Microempreendedor Individual (MEI); - Emissão de Nota Fiscal Eletrônica (NFS-e) online pelo Portal Nacional Web: para isso, é preciso primeiro se cadastrar no Portal Nacional, configurar as informações da empresa e cadastrar os serviços como favoritos. Depois, você deve acessar o Portal Nacional e fazer login, preencher as informações solicitadas e emitir a nota. Você pode baixar o arquivo em PDF ou imprimir o DANFE; - Emissão de Nota Fiscal pelo aplicativo NFS-e Mobile: para isso, também é preciso se cadastrar no Portal Nacional e configurar suas informações. Depois, baixe o aplicativo NFS-e Mobile, clique em “emitir NFS-e”, selecione o serviço, preencha as informações solicitadas e emita a nota; - O MEI é obrigado a emitir nota fiscal?: O MEI só é obrigado a emitir nota fiscal quando vende ou presta serviços para outra empresa, quando o cliente (pessoa física) pede a nota fiscal ou quando o MEI vai enviar o produto para o cliente. Em vendas ou serviços prestados para outras pessoas físicas que não pedem nota, o MEI não é obrigado a emitir; - Consulta de exigências locais (municipais e estaduais): antes de emitir sua nota fiscal, é importante conferir se existem exigências específicas na sua cidade ou estado. Por exemplo: para a NFS-e, usada na prestação de serviços, algumas prefeituras ainda exigem inscrição municipal, mesmo com o uso do Portal Nacional. Já no caso da NF-e, usada na venda de produtos, pode ser necessário fazer a inscrição estadual e se credenciar na Secretaria da Fazenda, principalmente em operações interestaduais ou que envolvam transporte. - Consulta de informações: no caso de dúvidas, também é importante entrar em contato com a prefeitura da região onde a nota fiscal será emitida. Também é possível conferir mais informações sobre nota fiscal MEI no Portal do Empreendedor, do Governo Federal. Além disso, é recomendável conferir junto à Secretaria da Fazenda do seu estado se há orientações ou requisitos adicionais para emissão de notas fiscais, especialmente no caso de venda de produtos (NF-e). Começou a faturar mais que o limite do MEI? A emissão de notas fiscais como MEI é fundamental para controlar o faturamento e planejamento financeiro do seu negócio. Vale lembrar que o limite de faturamento do MEI é de R$ 81 mil por ano. Se você espera atingir ou ultrapassar esse limite, é hora de dar o próximo passo e migrar seu MEI para uma microempresa. Essa migração de MEI para ME também é necessária se você planeja expandir suas atividades além das permitidas pelo MEI, incluir sócios em seu negócio, participar como sócio em outra empresa ou contratar mais de um funcionário. Se você está passando por uma dessas situações, significa que seus negócios estão prosperando. E a Contabilizei pode te ajudar nesta etapa tão importante de sua jornada empreendedora. Fale com um de nossos especialistas e saiba como podemos te apoiar! FAQ - Perguntas frequentes É possível emitir nota fiscal MEI pelo celular? Sim, o processo de emissão de nota fiscal pelo Portal Nacional ou portaria da fazenda pode ser feito por qualquer dispositivo móvel com acesso a internet e com os dados de acesso ou certificado digital instalado, para validação da nota fiscal. O procedimento é exatamente igual ao informado no passo a passo. É possível cancelar uma nota fiscal emitida? Sim, é possível cancelar notas fiscais MEI, tanto NF-e (Nota Fiscal Eletrônica) quanto NFS-e (Nota Fiscal de Serviço Eletrônica), mas com algumas ressalvas. NF-e: o cancelamento é feito no portal da SEFAZ (Secretaria Estadual da Fazenda) e o prazo para solicitar o cancelamento pode variar de acordo com cada estado, mas geralmente é de 24 horas após a emissão. NFS-e: o cancelamento da NFS-e é feito no Portal Nacional de Gestão da NFS-e, mesmo portal utilizado para emissão. É possível alterar dados de uma nota fiscal emitida? Sim, é possível alterar dados de uma NFS-e, mas com algumas limitações. Se houver erro na emissão, a opção principal é cancelar a nota fiscal e emitir uma nova com as informações corretas. No entanto, se o erro for específico, o Portal Nacional de Gestão NFS-e (gratuito e do governo) oferece a funcionalidade de retificação direta, permitindo a correção de informações no próprio sistema. Já para notas fiscais de mercadorias, é possível realizar a alteração de informações que não alterem o valor da operação das notas, data de emissão e data de saída da mercadoria ou informações em relação ao cadastro do remetente e destinatário da mercadoria. Informações como códigos fiscais (desde que não ajustem a tributação da nota), observações da nota, nome da mercadoria podem ser ajustadas por carta de correção eletrônica. Para dados que não podem ser ajustados por carta de correção eletrônica, desde que haja prazo, é possível cancelar a nota fiscal eletrônica e emitir uma nova com as informações atualizadas. A emissão de notas fiscais por MEI é gratuita? Quanto custa? A emissão é gratuita na prestação de serviço quando utilizar o Portal Nacional e na venda de mercadorias através da Secretaria da Fazenda do estados. Quantas notas fiscais o MEI pode emitir? Não há limite de número de notas fiscais, sendo possível emitir quantas forem necessárias. Apesar disso, vale lembrar que o limite de faturamento do MEI anualmente permitido é de R$ 81 mil. Esse valor não é totalizado apenas pelas notas emitidas obrigatoriamente pelo MEI, mas sim, por todas as operações de venda de mercadorias e prestações de serviços que o MEI realizou. 3 comentários - Esclarecedor DEMAIS!!! Obrigado! - Gratidão pelos exclarecimentos. - Nossa tirou minhas dúvidas e agora posso enviar minhas notas, sem precisar ter gastos Obrigado. Deixe um comentário Posts Relacionados CRT-4 para MEI: o que é, como e quando você deve informá-lo na nota fiscal? O CRT-4 MEI é uma nova exigência para a emissão de notas fiscais eletrônicas pelos microempreendedores individuais (MEI) e passou... Você tem certeza de que pode ser MEI? Veja 5 consequências do MEI irregular e opções para o seu negócio Ser MEI de forma irregular pode gerar desde multas até o cancelamento do CNPJ. Veja os riscos de atuar com MEI irregular e descubra opções para sua empresa! Tudo o que você precisa saber para a formalização da sua empresa com o Mercado Livre Se você chegou até aqui é porque está buscando vender de maneira formalizada com o Mercado Livre! Neste artigo vamos... Mural de recursos para o empreendedor - Categorias do Blog - Categorias por atividade - Está abrindo sua empresa? - Portes de empresa - Natureza Jurídica - Regimes de tributação - Tudo sobre CNAE - Simples Nacional - MEI - Autônomos - Dúvidas entre ser CLT ou PJ? - Universo da Contabilidade"
}