{
  "url": "https://www.nytimes.com/",
  "title": "The New York Times - Breaking News, US News, World News and Videos",
  "text": "New York Times - Top Stories Top Stories Federal agencies are delaying approvals for renewable energy projects on both federal and private land even as demand for electricity is rising. 8 min read The state’s Republican Party had asked the justices to step in and block the new congressional maps, which give an advantage to Democrats, before the midterms. 3 min read LIVE Any deal to codify rules around enforcement would face an uphill battle before a Feb. 13 deadline to fund the Homeland Security Department. Tom Homan said that the remaining 2,000 immigration officers in the state would focus on arresting criminals who pose public safety threats. 4 min read Analysis The Republican lawmaker’s successful targeting of a former president who faces no charge of wrongdoing was the sort of tactic typical in an autocracy. 5 min read Bard College’s president, Leon Botstein, agreed to help Woody Allen and Soon-Yi Previn’s daughter after Jeffrey Epstein connected them. 4 min read After a stroke four years ago, the actor has changed how he approaches performances, including the one he’s become an awards favorite for. 7 min read LIVE Britain, the reigning champion, faces Norway in a mixed doubles round robin. From The Athletic From The Athletic To many Israelis, he’s a war hero. To others, he’s a traitor guilty of “blood libel.” Can Yair Golan change politics in Israel? 21 min read With an impasse broken, the top two spots at the transportation agency the governors jointly control can be filled. 3 min read The N.F.L. claims Guardian Caps reduce the risk of concussions. The company that makes them says, “It has nothing to do with concussions.” 6 min read Weather Advertisement SKIP ADVERTISEMENTWatch Today’s Videos Trump Signs Bill to End Partial Government Shutdown N.H.L. Players Return to the Olympics for the First Time in 12 Years Does ICE Need a Warrant to Enter Your Home? Renee Good’s Brothers Testify After Fatal Minneapolis Shooting Cherry Tomato Labneh Dip More News The raiders stormed a rural community in central Nigeria, killing dozens and setting homes on fire in one of the country’s worst recent attacks. 2 min read A Detroit Tigers pitcher, he was famous for his ample waistline — and for his three complete-game wins in defeating the Cardinals, making him the Series’ M.V.P. 5 min read U.S., Russian and Ukrainian negotiators are meeting, but Russia continues to pummel Ukraine and has not softened demands that Kyiv calls unacceptable. 4 min read Well Culture and Lifestyle Audio Podcasts and narrated articles Audio Podcasts and narrated articlesGames Daily puzzles Games Daily puzzles"
}