{
  "url": "http://mikesrpgcenter.com/7thsaga/walkthrough.html",
  "title": "Mike's RPG Center - 7th Saga - Walkthrough",
  "text": "Melenam - If Lux is in your party, speak to the inventor in one of the houses in the northwest part of Melenam to receive an upgrade. Lux will gain 30 MaxHPs and MaxMPs as well as 20 power, guard, magic, and speed. You can also buy a new weapon and armor for Lux in the weapon and armor shops. - Go west from Melenam to reach Palsu. The woman in the southwest corner of town will give you a Letter to give to her son in Melenam. - Return to Melenam and enter the laboratory in the southeast corner. - Give the Letter to Tafuro and he will bring you to the inner lab. - Speak to all the scientists and then speak to Tafuro again and he will introduce you to Dr. Fail. - After speaking with Dr. Fail, leave Melenam. When you reenter Melenam after fighting a battle, you will hear sirens and find the people in an uproar. - Return to the secret laboratory and fight Foma who has gotten out of control. - Once you have defeated Foma, everyone will be evacuated from the continent before it sinks into the ocean. You will land in the Airship on a new continent. Saro and Garsia - Travel east, then north to reach a small village of Saro's followers. - Enter the cave to the west and defeat both Goron and Griffan to reach Saro at the back of the cave. In his dying breath he will remove the curse on the runes. - Return to the village and collect all seven runes from Saro's followers. The runes will not have any power at this time. - Go northeast to Gorfun Castle. Climb to the fourth floor by first climbing the stairs in the bottom left corner of the first floor, then the stairs in the bottom right corner of the second floor, then the stairs in bottom left corner of the third floor. (You can tell the different floors apart by noticing the positions of the Tetujin.) Enter the middle-top-right room to find Garsia. - To defeat Garsia you must use each of the seven runes to drain his power. The correct order is: Wizard, Light, Sky, Moon, Wind, Star, and Water."
}