{
  "url": "https://support.google.com/chrome/answer/95346?hl=pt&co=GENIE.Platform=Desktop",
  "title": "Transfira e instale o Google Chrome - Computador - Google Chrome Ajuda",
  "text": "Pode transferir e instalar o navegador de Internet Chrome sem custo financeiro e utilizá-lo para navegar na Web. Como instalar o Chrome Importante: antes de transferir, verifique se o Chrome é compatível com o seu sistema operativo e se cumpre todos os outros requisitos de sistema. Windows- No computador, transfira o ficheiro de instalação. - Para instalar o ficheiro, siga as instruções no ecrã. - Se receber a mensagem \"Quer executar este ficheiro?\", selecione Executar. - Se receber a mensagem \"Quer permitir que esta app faça alterações ao seu dispositivo?\", selecione Sim. - Abra o Chrome. - Para o Windows 10 e superior, quando a instalação estiver concluída, é apresentada uma janela do Chrome. Pode definir o Chrome como o navegador predefinido. Dica: se tiver usado um navegador diferente, como o Firefox, pode importar as suas definições para o Chrome. Instale o Chrome offline Se tiver problemas ao transferir o Chrome no seu computador com o Windows, use o link alternativo para transferir o Chrome para um computador diferente. - No computador, transfira um instalador do Chrome para outro computador. - Na parte inferior da página, em \"Família do Chrome\", selecione Outras plataformas. - Selecione o SO do dispositivo no qual quer instalar o Chrome. - Transfira o ficheiro. - Mova o ficheiro para o computador onde pretende instalar o Chrome. - Para instalar o Chrome, siga as instruções no ecrã. - No computador, transfira o ficheiro de instalação. - Abra o ficheiro com o nome \"googlechrome.dmg\". - Na janela apresentada, pode encontrar o Chrome. - Arraste o Chrome para a pasta Aplicações. - Pode ter de introduzir a palavra-passe de administrador. - Se não conseguir introduzir a palavra-passe de administrador, arraste o Chrome para uma localização onde tenha autorizações completas, como o ambiente de trabalho. Dica: para limpar após a instalação, na barra lateral do Finder, junto a \"Chrome\", selecione Ejetar . Para instalar o Chrome, use o mesmo software que instala programas no seu computador. Tem de introduzir a palavra-passe da conta de administrador. - No computador, transfira o ficheiro de instalação. - Para abrir o pacote, selecione OK Instalar pacote. Para garantir que o Chrome se mantém atualizado, este é adicionado ao gestor de software. Verifique os requisitos de sistema para usar o Chrome WindowsPara usar o Chrome no Windows com um processador Intel ou um processador ARM, precisa do seguinte: - Processador Intel: - Windows 10 e superior. - Processador Intel Pentium 4 ou superior compatível com SSE3. - Processador ARM: Windows 11 e superior. Para usar o Chrome no Mac, precisa do macOS 12 Monterey e superior. Para usar o Chrome no Linux, precisa do seguinte: - Ubuntu de 64 bits 18.04 ou superior, Debian 10 ou superior, openSUSE 15.5 ou superior, ou Fedora Linux 39 ou superior - Processador Intel Pentium 4 ou superior compatível com SSE3"
}