{
  "url": "https://nameberry.com/b/boy-baby-name-brian",
  "title": "Brian - Baby Name Meaning, Origin, and Popularity for a Boy | Nameberry",
  "text": "Brian Irish \"strong, virtuous, and honorable\" Share Copy link Brian Origin and Meaning Variation of Bryan - Brian Rank in US Top 1000 - Brian Rank in Nameberry Top 1000 - Names Similar to Brian - Famous People Named Brian - The name Brian in Pop Culture - The name Brian in Nameberry Blog Posts # 301 in the US Brian Rank in US Top 1000 # 208 on Nameberry Brian Rank in Nameberry Top 1000 Popularity of the name Brian 20 Names Similar to Brian These 20 names were selected by our users that were looking for other names like Brian. - Kevin - Steven - Justin - Bryan - Chris - Mark - Tony - Brandon - Danny - Alan - Jeremy - Jeffrey - Johnathan - Carlos - Jared - Shawn - Nick - Derek - Sean - Keith Famous People Named Brian - Brian BoruKing of Ireland - Brian Douglas WilliamsAmerican broadcast journalist - Brian Eno (aka Peter George St. John le Baptiste de la Salle Eno)English musician - (Martin) Brian Mulroney18th prime minister of Canada - Brian Russell de PalmaAmerican film director - Brian Manion DennehyAmerican actor - Brian Anthony BoitanoAmerican figure skater - Brian McKnightAmerican singer - Brian Austin GreenAmerican actor - Brian Samuel EpsteinEnglish manager of The Beatles - Brian Edward GottfriedAmerican tennis player - Brian HoldenAmerican actor, singer, writer - Brian MinchinBritish TV producer - Brian Douglas WilsonAmerican musician of The Beach Boys - (Louis) Brian PiccoloAmerican NFL football player, subject of film \"Brian's Song\" - Brian Howard CloughEnglish footballer and manager - Brian de la PuenteAmerican football player - Brian KerwinAmerican actor - Brian UrlacherAmerican football player - Brian Denis CoxScottish actor - Brian ReganAmerican comedian - Brian Justin CrumAmerican musician - Brian RosenthalAmerican actor and singer - Brian Thomas \"BRok\" Littrell, American singer of the Backstreet Boys - Brian Logan Daleslead singer of American band The Summer Set - Brian Leo BianchiniAmerican model/actor - Brian Mayguitarist for British band Queen - Brian HallisayAmerican actor - Brian HoweAmerican actor - Brian Phillip \"Head\" Welchguitarist for American band Korn - Brian 'Astro' BradleyAmerican actor and Rapper - Brian 'Q' QuinnAmerican comedian from The Tenderloins and Impractical Jokers - Brian Awadis aka FaZe RugAmerican YouTuber - Brian Sean O'Connor (b. 2007)son of American television personality Kevin O'Connor - Brian JonesMulti,instrumentalist and rhythm guitarist for The Rolling Stones - Brian Ross Weitzmusician and founding member of the band Animal Collective - Brian Johnsonlead singer of AC/DC - Brian Kang/Kang Yonghyunbassist, singer, songwriter, and rapper of the South Korean band Day6; more popularly known by his stage name Young K - Brian FirkusAmerican musician, TV personality, and drag queen - Brian Timothy GeraghtyAmerican actor - Brian Theodore Deneke (b. 1978)19 year old American man who was killed in a hit and run attack for being a punk rock musician The name Brian in Pop Culture - Sir Brian de BoisGuilbert, character in \"Ivanhoe\" by Sir Walter Scott - Brian Griffindog character on \"Family Guy\" - Brian Cohenmain character in 1979 film \"Monty Python's Life of Brian\" - Mr. Brian Fitzpatrickcharacter in “Tom Jones” (1746) - Brian Kinneycharacter on \"Queer as Folk\" - Brian Finncharacter in \"Keeping the Faith\" - Brian O'Connercharacter in \"Fast and the Furious\" series - Brian Johnsoncharacter in film \"The Breakfast Club\" - Brian Shelbycharacter in film \"Vanilla Sky\" - Brian Hardingcharacter in videogame \"Dream Daddy\" - Brian Davismain character on TV series \"What About Brian?\" - Brian Duffordcharacter in webcomic \"Camp Weedonwantcha\" - Brian Marshcharacter in \"Prince of Darkness\" - Albus Percival Wulfric Brian Dumbledorecharacter in Harry Potter series - Brian \"Otis\" Zvonecekcharacter on TV's \"Chicago Fire\" - Brian / Greencharacter in \"Monster Prom\" - Brian Thomasfull name of Hoodie from Marble Hornets The name Brian in Nameberry Blog Posts - Wes Anderson Names Add Whimsy - Back to School Names - Irish Baby Names: Rare in the US - Top Boys Name For Each Letter: a 130-year survey - The REAL Top Baby Names of All Time! - Irish Baby Names: Top Choices Here and There - 100 Brilliant Boy Names in Translation - 20 Most Controversial Baby Names More Lists containing Brian - Names that Peaked in 1970 - Irish Names - Names Ending in -ian for Boys - Irish Names for Boys - 5 Letter Boy Names - Names Ending in N for Boys - Names That Mean Honorable - One Syllable Names for Boys - Names that Peaked in 1972 - Names that Peaked in 1973 - Names that Peaked in 1974 - Names that Peaked in 1975 - Names that Peaked in 1976 - Names that Peaked in 1977 - Boy Cat Names That Start With B - Cat Names That Start With B - Animal Names for Boys - Irish Names that Start With B Find your type. Analyze your Baby Name DNA and find the names that match your unique style. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access. Introducing the Nameberry App Find your perfect baby name together with our new mobile app. - Swipe through thousands of names with your partner - Names you match on are saved to your shared list - Get personalized recommendations that learn based on your and your partner's preferences - Partner with friends and family to find names you all love - Backed by Nameberry's 20 years of data around name preferences. Sign up to be notified when the app launches and to receive a discount on full access."
}