{
  "url": "https://m.imdb.com/title/tt2277860/",
  "title": "Finding Dory (2016) - IMDb",
  "text": "Friendly but forgetful blue tang Dory begins a search for her long-lost parents and everyone learns a few things about the real meaning of family along the way.Friendly but forgetful blue tang Dory begins a search for her long-lost parents and everyone learns a few things about the real meaning of family along the way.Friendly but forgetful blue tang Dory begins a search for her long-lost parents and everyone learns a few things about the real meaning of family along the way. - Directors - Writers - Stars - Nominated for 1 BAFTA Award - 17 wins & 48 nominations total Ellen DeGeneres - Dory - (voice) Albert Brooks - Marlin - (voice) Ed O'Neill - Hank - (voice) Kaitlin Olson - Destiny - (voice) Hayden Rolence - Nemo - (voice) Ty Burrell - Bailey - (voice) Diane Keaton - Jenny - (voice) Eugene Levy - Charlie - (voice) Sloane Murray - Young Dory - (voice) Idris Elba - Fluke - (voice) Dominic West - Rudder - (voice) Kate McKinnon - Wife Fish - (voice) - Directors - Writers - All cast & crew - Production, box office & more at IMDbPro Featured reviews The story was beautifully executed, it was well paced, the new characters kept the story fresh and the film was somewhat educational. Perhaps not as emotionally charged as the first, but not many sequels can achieve such a high quality level in terms of depth in all its characters and minor details. Only Pixar can make you feel empathetic towards a fish. This is a really good sequel. Taking characters from the first one and putting new ones in there as well, it never gets boring or seems to repetitive. And you don't even have to be Dory, I mean forgetful, for this to work for you. Yes it does make sense to watch the first one (Finding Nemo) then, although I reckon you could watch it and enjoy it as a standalone too. The characters and their traits are strong and there are a lot of side jokes built in to this too. Humans are being treated like extras and we wouldn't have the time to deal with them anyway. That is apart from one major voice - but it's being highlighted too as if one of the writers or Ellen herself might have a crush there. But you can't blame them for that. On the contrary you can congratulate everyone involved for a really good movie The characters and their traits are strong and there are a lot of side jokes built in to this too. Humans are being treated like extras and we wouldn't have the time to deal with them anyway. That is apart from one major voice - but it's being highlighted too as if one of the writers or Ellen herself might have a crush there. But you can't blame them for that. On the contrary you can congratulate everyone involved for a really good movie A regal blue tang embarks on a journey to find her parents. 'Finding Dory' is an enjoyable sequel with some memorable moments. The plot is quite heartwarming as we follow Dory in search of her parents and it is this premise that carries a film with little else to say. As nice as it is to see these characters again, I find it a stretch to stay interested for 97 minutes. There is more of an emphasis on action-oriented visuals than was the case in 'Finding Nemo' and it feels like some of the spectacle is there to pad the movie out. Also Marlin and Nemo seem mostly to be along for the ride this time. That being said there are some standout moments, mostly involving Dory and her parents. There is one spectacular slow motion sequence that is very well done and makes good use of a popular song. Visually, as with most Pixar movies it is very impressive. The character designs and underwater backdrops are as fabulous as the original. 'Finding Dory' is an enjoyable sequel with some memorable moments. The plot is quite heartwarming as we follow Dory in search of her parents and it is this premise that carries a film with little else to say. As nice as it is to see these characters again, I find it a stretch to stay interested for 97 minutes. There is more of an emphasis on action-oriented visuals than was the case in 'Finding Nemo' and it feels like some of the spectacle is there to pad the movie out. Also Marlin and Nemo seem mostly to be along for the ride this time. That being said there are some standout moments, mostly involving Dory and her parents. There is one spectacular slow motion sequence that is very well done and makes good use of a popular song. Visually, as with most Pixar movies it is very impressive. The character designs and underwater backdrops are as fabulous as the original. I may be one of the few people out there that doesn't love Finding Nemo, it was ok but it didn't really do anything for me. So, going into Finding Dory I had no real expectations. First and foremost, it is GORGEOUS. The colors are striking, the blue tones of the water are realistic at times mesmerizing and the movements of the various creatures are realistic and fluid. Most importantly though is the story. Dory's journey is one of self discovery, of living with a disability and all of the hurdles that creates in your life. It's about the way it makes others look at you and how she overcomes that. Not with some miracle cure that instantly solves everything or erases the issue altogether in the end, but with honest to goodness character growth. As an aside, I had avoided seeing this one until I had finally seen Finding Nemo and while I would recommend seeing Nemo, Finding Dory does stand alone as it's own film. First and foremost, it is GORGEOUS. The colors are striking, the blue tones of the water are realistic at times mesmerizing and the movements of the various creatures are realistic and fluid. Most importantly though is the story. Dory's journey is one of self discovery, of living with a disability and all of the hurdles that creates in your life. It's about the way it makes others look at you and how she overcomes that. Not with some miracle cure that instantly solves everything or erases the issue altogether in the end, but with honest to goodness character growth. As an aside, I had avoided seeing this one until I had finally seen Finding Nemo and while I would recommend seeing Nemo, Finding Dory does stand alone as it's own film. I think it was great to see Dory side and more about her life. It was creative and overall it was good. 'Avatar: Fire and Ash' Joins the Billion Dollar Movie Club 'Avatar: Fire and Ash' Joins the Billion Dollar Movie Club Avatar: Fire and Ash just reached the $1 billion mark at the worldwide box office. Take a look at the top-grossing movies of all time. Did you know - TriviaHank has only seven tentacles because the animators realized they could not fit eight onto his body. His backstory was rewritten to account for the missing limb. For similar reasons, in the classic sci-fi film It Came from Beneath the Sea (1955) special effects genius Ray Harryhausen was only able to create a stop-motion giant octopus with six tentacles. - GoofsBailey the beluga whale and Destiny the whale shark are kept in an adjoining enclosure, separated by a rock wall with a metal grate that indicates they are sharing the same water. A beluga whale makes its home in Arctic and sub-Arctic waters, whereas the whale shark is indigenous to tropical and sub-tropical waters. Factually, they would not be kept adjacent to each other in shared waters. - Crazy creditsIn a post-end credits scene, Fluke and Rudder repel another attempt by Gerald to join them on the rock, while the Tank Gang from Finding Nemo (2003) floats by, still in their bags, which are filthy after crossing the ocean -- except for Jacques' bag of course. They begin to celebrate their arrival before being promptly scooped up by researchers from the Marine Life Institute and thrown into a cooler where they will be presumably rescued, rehabilitated and released. The ordeal distracts Fluke and Rudder long enough for Gerald to sneak onto the rock behind them. - ConnectionsFeatured in The Saturday Show: Episode #1.3 (2015) - SoundtracksWhat a Wonderful World Written by Bob Thiele (as Robert Thiele) and George David Weiss Performed by Louis Armstrong Courtesy of The Verve Music Group Under license from Universal Music Enterprises - How long is Finding Dory?Powered by Alexa Details - Release date - Country of origin - Official sites - Languages - Also known as - Buscando a Dory - Filming locations - Production companies - See more company credits at IMDbPro Box office - Budget - $200,000,000 (estimated) - Gross US & Canada - $486,295,561 - Opening weekend US & Canada - $135,060,273 - Jun 19, 2016 - Gross worldwide - $1,029,266,989 - Runtime - 1h 37m(97 min) - Color - Sound mix - Aspect ratio - 1.85 : 1 Contribute to this page Suggest an edit or add missing content"
}