{
  "url": "https://liverfoundation.org/liver-diseases/fatty-liver-disease/nonalcoholic-steatohepatitis-nash/nash-treatment/",
  "title": "Nonalcoholic Steatohepatitis Treatment",
  "text": "Metabolic dysfunction-associated liver disease, or MASLD, used to be known as nonalcoholic fatty liver disease (NAFLD). If MASLD worsens, it can become metabolic dysfunction-associated steatohepatitis, or MASH. MASH used to be called NASH, or nonalcoholic steatohepatitis. The first line of treatment for MASLD and MASH is weight loss through a combination of choosing healthy foods, eating fewer calories, and increasing physical activity. Slow and steady weight loss can reduce fat and inflammation (swelling) in the liver. The following lifestyle changes are important in managing your disease. Weight loss is one of the best treatments for MASLD and MASH because it moderates the conditions that contribute to fatty liver disease. Losing just three to five percent of your body weight can reduce fat in your liver. Losing seven percent can decrease inflammation as well. If you are overweight or obese, doctors typically recommend you gradually lose seven to ten percent of your body weight over the course of one year. Rapid weight loss through fasting is not recommended because it can make MASLD worse. The best ways to lose weight are by: These foods are the basis of the Mediterranean diet, which isn’t a “diet” in the traditional sense. It is a healthy way of eating inspired by the eating habits of people living in the Mediterranean area and is often recommended by doctors as a way to reduce some of the risk factors associated with fatty liver disease. Visit the ALF Liver Disease Diets page to learn more about how nutrition can make a difference for you. While following a healthy diet and maintaining a normal body weight may not seem like a specific treatment, it’s essential to managing MASLD and MASH. If you’ve tried to lose weight in the past without success, talk to your healthcare provider about getting help. You may be a candidate for a medically-supervised weight loss program that combines medication along with diet and exercise. Alternatively, there are weight-loss (bariatric) surgical procedures and endoscopic therapies that work by either physically limiting the amount of food your stomach can hold, or reducing the amount of nutrients and calories your body absorbs. Talk to your doctor about which option may be best for you. Closely monitor your blood sugar and take medications as prescribed. Limit your intake of saturated fats, which are found in meat, poultry skin, butter, shortening, milk and dairy products (except fat-free versions). Replace them with monounsaturated fats (olive, canola, and peanut oils) and polyunsaturated fats (corn, safflower, soybean oils, and many types of nuts). Particularly helpful in reducing heart disease are omega-3 fatty acids, a type of polyunsaturated fat found in oily fish such as salmon, flaxseed oil, and walnuts. Healthy eating combined with exercise, along with taking cholesterol-lowering medications if prescribed by your doctor, will help keep your cholesterol and triglyceride levels where they need to be. Do what you can to prevent putting extra stress on your liver. Treatment for MASLD and MASH often involves many different medical professionals such as hepatologists, nutritionists, endocrinologists, cardiologists, and other specialists as needed. This approach is essential to successfully manage the underlying metabolic conditions associated with steatotic liver disease. In March 2024, the US Food and Drug Administration approved the use of resmetirom (Rezdiffra™) for people with MASH and stage 2 or 3 fibrosis (but not cirrhosis) along with eating a healthy diet and participating in regular exercise. This is the first drug approved for MASH in the United States and the approval was based on resolution of MASH and improvement in fibrosis (scarring) in about a quarter of the patients treated in a large international trial (MAESTRO NASH, NCT03900429). This drug works by revving up the thyroid hormone pathway in the liver to increase the metabolism of liver fat. The most common side effects of treatment are nausea and diarrhea. Gallstones and gallbladder inflammation also developed in some patients in the trials. It can also interact with other medications such as statins, gemfibrozil (Lopid) and clopidogrel (Plavix), so be sure that your health care provider has a full list of your medications before prescribing Rezdiffra. A liver biopsy is not essential to start Rezdiffra because other tests that can show the accumulation of liver fibrosis such as Fibroscan or other measures of liver stiffness can provide the necessary information. Rezdiffra is not for people who do not have evidence of significant liver fibrosis. In studies of people with MASLD, those who drank coffee had less liver damage than those who drank little or no coffee. Caffeinated coffee reduces the risk of liver fibrosis in several liver diseases, including MASLD. Studies suggest you need to drink more than two cups per day to gain this benefit; however, some people do not tolerate it well. But for those who currently do drink caffeinated coffee – enjoy! This vitamin, which is an antioxidant, theoretically works by reducing or neutralizing the damage caused by inflammation. Some evidence suggests vitamin E supplements may be helpful for people with liver damage due to MASLD and MASH. Researchers in one study found that a daily dose of the natural form of vitamin E – the kind that comes from food sources and isn’t made in a laboratory – improved MASH in study participants overall by reducing fat and inflammation although not scarring. This medication is not for everyone and may have potential side effects as well. Discuss the potential benefits with your doctor. *Steatotic liver disease is the new name for fatty liver disease. *MASLD (metabolic dysfunction-associated steatotic liver disease) is the new name for NAFLD (nonalcoholic fatty liver disease, or NAFLD. or MASLD. *MASH (metabolic dysfunction associated steatohepatitis) is the new name for NASH (nonalcoholic steatohepatitis). Medically reviewed on April 2025. Last updated on June 12th, 2025 at 02:29 pm"
}