{
  "url": "https://www.cbsnews.com/philadelphia/news/william-stevenson-murder-charge-delaware-new-castle-county/",
  "title": "Jill Biden's ex-husband Bill Stevenson charged with murder after 2nd wife Linda found dead - CBS Philadelphia",
  "text": "Jill Biden's ex-husband Bill Stevenson charged with murder after 2nd wife Linda found dead William Stevenson, former first lady Jill Biden's ex-husband, was indicted on a murder charge connected to the death of his second wife late last year in Delaware, police said Tuesday. In late December, New Castle County police said they responded to a reported domestic dispute on the 1300 block of Idlewood Road in the Oak Hill neighborhood, near the town of Elsmere. Linda Stevenson, 64, was found unresponsive in the living room and later pronounced dead, according to police. No charges were filed at the time of the death investigation. Inside Edition reported in 2020 that Stevenson met Biden on the beach in Ocean City, New Jersey, in 1969 and were married the following year. They divorced in 1975, and about a decade later, he wed Linda. Stevenson is the former owner of The Stone Balloon venue in Newark, which hosted rock acts from Bruce Springsteen & The E Street Band to George Thorogood to Cheap Trick. On Monday, Feb. 2, a grand jury returned an indictment against Stevenson, NCCPD said. Police took him into custody shortly afterward. Bill Stevenson is charged with one felony count of first-degree murder. He was arraigned and placed in the Howard Young Correctional Institution after failing to post $500,000 bail. Investigators have not yet released Linda Stevenson's cause of death. Police declined to further comment on the investigation. Linda Stevenson was a mother and grandmother who had recently founded an accounting business, BMB Bookkeeping. She was an Eagles fan and \"will be remembered as tenacious, kind-hearted, and fiercely loyal,\" according to an obituary. Her husband was not mentioned in the obit. Outside the Stevenson residence on Tuesday, a neighbor placed a \"Justice for Linda\" sign. Most neighbors declined to speak with CBS News Philadelphia on camera, but one woman who lived down the street said she was surprised to learn about the murder charge. \"They always left and went out to dinner,\" Patty Master said. \"She was just as nice as can be, and he was, too.\""
}