{
  "url": "https://www.iss.europa.eu/publications/briefs/plugging-gap-how-europe-can-keep-ukraine-supplied-means-defend-itself",
  "title": "Plugging the gap: How Europe can keep Ukraine supplied with the means to defend itself | European Union Institute for Security Studies",
  "text": "Donald Trump’s election as US President has led to a flurry of diplomacy over Russia’s war on Ukraine. The outcome remains unclear: there may be a settlement, continued fighting, or a brief ceasefire followed by a resumption of hostilities. What is clear, however, is that Ukraine will need military support for the long haul, to defend itself against ongoing Russian attacks or deter a new round of fighting. At the same time, the Trump administration is highly unlikely to fund additional US military support to Ukraine. Adjusting to this new reality will be hard for Europe. But Europeans can use a range of mutually reinforcing strategies to put Ukraine in the strongest possible position. The cost of US disengagement In financial terms, the US has allocated almost €65 billion in military support since 2022, while the EU has provided over €51 billion, with the UK and Norway providing an additional €12 billion(1). Estimates based on assistance provided in 2024 suggest that Europe would only need to increase its support by 0.12% of GDP to make up for the loss of all US military support(2). But financial support is just one consideration, and the size of the gap depends on whether Washington is willing to continue providing Ukraine with military capabilities paid for by Europeans, or whether there is a complete halt in all deliveries of American equipment to Ukraine and a full cut-off in critical intelligence support provided by Washington. A complete loss of US support would leave a hole significantly larger than the numbers alone suggest. First, US equipment accounts for a very high proportion of overall assistance to Ukraine in many weapons categories, such as rocket artillery (98%), howitzer ammunition (80%) and long-range air defence systems (80%)(3). Ukraine depends on Washington to provide a consistent supply of spare parts to keep US-origin equipment operational. Data: Kiel Institute for the World Economy, 2025 Secondly, the US provides Ukraine with communications and intelligence support that is crucial but difficult to quantify. In terms of communications, Ukraine has so far relied on Starlink’s 40 000 terminals in the country to provide its forces with real-time connectivity critical for drone operations(4). In terms of intelligence, data from US satellites and other surveillance assets has allowed Kyiv to accurately and quickly track Russian troop movements, fend off air attacks and hit Russian assets far behind the frontlines, disrupting logistics, communications and production. More generally, intelligence has allowed Ukraine to make effective use of its numerically inferior forces, for example redeploying them in anticipation of Russian moves. Europe’s ability to provide Ukraine with the same quality and quantity of intelligence as the US is also limited. For some of these weapons systems there is a European alternative. Europeans have comparable capabilities to the US in terms of howitzers, artillery ammunition and battle tanks. The main challenge is scaling up production to meet operational demands. For 155mm artillery shells, a focus of EU efforts, the gap is relatively small as European production is set to reach 2 million shells this year, and Ukraine has also started domestic production(5). In air defence, European alternatives to the US Patriot exist in the form of the medium-range German IRIS-T and the long-range Franco-Italian SAMP-T. Ukraine currently has at least 2 SAMP-T and 6 medium-range IRIS-T systems, though production of interceptors for the two systems needs to be increased(6). In terms of long-range strike weapons, Ukraine already uses Franco/British Scalp/Storm-Shadow missiles alongside US-made ATACMS and Germany could provide its longer-range Taurus missile. However, European missiles are slower and open-source assessments suggest that their production rates are low – with 40-60 Taurus units per year and 50-100 for Scalp/Storm Shadow – while increasing production will take time(7). In comparison, Russia produces over 1 400 Iskander ballistic missiles and 500 Kh-101 cruise missiles a year(8). The most challenging gap for Europeans to fill in a scenario where the US completely cuts off all assistance to Ukraine would be providing Kyiv with communications and intelligence support. Intelligence, surveillance and reconnaissance have long-been recognised as critical shortfalls for Europe. The EU’s planned IRIS network of satellites will provide fast and secure connectivity, but is not scheduled to be operational until 2030. The Franco-British commercial company Eutelsat, which has been providing some services in Ukraine since 2024, does not have the same capability as Starlink: it only has 650 satellites compared to Starlink’s 7 000, providing more limited and slower coverage(9). Europe’s ability to provide Ukraine with the same quality and quantity of intelligence as the US is also limited. The US operates a range of satellites providing different types of intelligence round-the-clock for the whole frontline. Overall, the US has 263 military satellites while Europeans only have 44(10). This means Europeans have a much more limited ability to provide constant real-time coverage over the full battlefield. Moreover, whereas the US operates its satellites as an integrated whole, European countries operate them in a fragmented manner. Some integrated analysis of geospatial intelligence takes place through the EU Satellite Centre, which analyses data from Copernicus, commercial operators and some Member States’ own satellites(11). Nevertheless, European capabilities are limited, and it would be very challenging for Europe to provide a like-for-like replacement for the US in terms of the quantity and quality of data gathered and the speed with which it is processed, analysed and passed onto Kyiv(12). How Europeans can respond The scale of the challenge facing Europeans depends on exactly what stance the US takes. A total suspension of US arms and intelligence assistance is not certain. While the Trump administration is unlikely to fund more direct military support to Ukraine, deliveries of aid committed under the Biden administration are set to continue for a number of years(13). Moreover, even once that assistance runs out, Washington may still be willing to provide Ukraine with specific capabilities if Europeans pay for them. European countries can use a range of strategies to keep Ukraine supplied. First, boosting Ukraine’s domestic production capacity should be a core element of Europe’s strategy both immediately and over the long term. Since the start of Russia’s full-scale invasion in 2022, Ukraine has greatly increased its domestic production capacity, both in terms of quantity and quality of military equipment. Kyiv is now recognised as a leader in many areas, especially drones. Since last year, Europeans have been buying equipment for Ukraine directly from Ukrainian industry – through the so-called Danish model. Several other European countries, like Norway and the Netherlands, have emulated Denmark’s approach(14). The EU itself has directed a €1.4 billion share of the profits from Russia’s frozen assets to supporting Ukraine’s defence industry(15). Production in Ukraine is much cheaper and faster than in the EU, and the equipment is adapted to the needs of Ukraine’s forces. Moreover, Ukraine’s defence sector has substantial spare capacity: according to Ukraine’s defence minister, more than half of the country’s defence industrial capacity is currently unused. As long as Russia is fighting in Ukraine, an attack on a European country remains very unlikely. There is a strong case for Europe to increase its investment in Ukraine’s defence sector to ensure that Ukraine’s capacity is fully utilised and to help modernise the Ukrainian defence industry. Deepening existing cooperation between European defence firms and Ukraine should be encouraged, as should Ukraine’s integration into the European Defence Industrial Base. Nevertheless, there may be limits to how deep and technologically complex cooperation can be, given the risk of Russian strikes on production facilities in Ukraine, and concerns around the loss of sensitive information that make many European companies cautious about investing in Ukraine(16). Second, Member States could accept a higher degree of risk in terms of the stocks of military equipment that they hold in reserve. For example, countries geographically distant from Russia and facing a low likelihood of direct attack could re-assess their immediate requirements regarding stocks of ammunition or air defence interceptors. As long as Russia is fighting in Ukraine, an attack on a European country remains very unlikely. Some Member States are already acting on this logic: for example Denmark has donated all its artillery to Ukraine(17). Third, Europeans should try to avoid an extremely damaging withdrawal of US support for Ukraine. The EU should attempt to secure equipment and spare parts for Ukraine from the US, by purchasing it from Washington on Ukraine’s behalf or by giving Ukraine funds to do so itself. Buying equipment from the US would minimise operational disruption for Ukraine, as Kyiv would be able to continue using American equipment that it is accustomed to operating. European purchases from the US could also be a way of maintaining some degree of US intelligence sharing with Ukraine. Notably, there are signs that the US may be more open to such an approach after the signing of the minerals deal with the Ukrainian government. Following the deal, the Trump administration approved the sale of some military equipment to Ukraine and authorised Europeans to transfer US equipment from their stocks to Kyiv(18). Fourth, Europe needs to invest in strengthening its domestic defence production. This is a medium to long-term undertaking: while Europeans often produce high-quality equipment, it is typically manufactured in small quantities and slowly. Recent increases in defence spending across much of Europe should translate into more orders from industry and higher production rates for key equipment. Increasing production, especially of air defence and long-range strike capabilities, should be a political priority. Europeans need to place large long-term joint or coordinated orders to consolidate demand and send a strong, clear signal to industry to invest in new production lines. There is a strong case for aggregating orders with close partners such as the UK, given the level of integration between EU and British industry in sectors like air defence and long-range strike. Finally, Europeans also need to make substantial investments to address the most critical capability gaps, particularly in terms of communications and intelligence. Again, this will require them to expand their existing intelligence gathering and processing capabilities. But there are also steps that Europeans can take in the immediate term to better integrate their existing capabilities, for example by better coordinating the coverage of their satellite fleets. Conclusion Supporting Ukraine is a long-term challenge for Europe, and making up for a steep reduction in US support will be difficult. Europeans should pursue a set of mutually reinforcing strategies to keep Ukraine supplied, including purchasing equipment for Kyiv from the US, ramping up production in Europe and Ukraine, and rapidly investing in missing capabilities. None of this will be easy, but a Ukrainian defeat would be catastrophic for Europe’s security. References * The author would like to thank colleagues and experts for their comments, and Marlene Marx, EUISS trainee, for the excellent research assistance provided. - 1 Kiel Institute for the World Economy, ‘Ukraine Support Tracker’, 15 April 2025. - 2 Burilkov, A. and Wolff, G.B., ’Defending Europe without the US: first estimates of what is needed’, Bruegel, 21 February 2025. - 3 Kiel Institute, ’Ukraine Aid: How Europe can replace US support’, March 2025. - 4 Johnson, J., ‘EU’s big Starlink headache is time, not money’, Reuters, 14 March 2025. - 5 Ruitenberg, R., ‘Rheinmetall secures nitrocellulose supply amid European ammo scramble’, Defense News, 7 April 2025. - 6 Di Mizio, G. and Gjerstad, M., ‘Ukraine’s ground-based air defence: evolution, resilience and pressure’, IISS, 24 February 2025; German Ministry of Defence, ’Umerov in Berlin: Pistorius setzt sich für weiteres Hilfspaket ein’, 6 March 2025. - 7 Hoffmann, F., ‘Taurus News and the Future of the European Missile Industry’, Missile Matters, 2 March 2025. - 8 ‘Would Vladimir Putin attack NATO?’, The Economist, 8 May 2025. - 9 ‘Explainer: Could Europe’s Eutelsat help to replace Starlink in Ukraine?’, Reuters, 7 March 2025. - 10 International Institute for Strategic Studies, Military Balance 2025, 2025. - 11 European Union Satellite Centre, Annual Report 2023, 29 August 2023. - 12 Dover, R., ‘Europe may struggle to replace the military intelligence that Ukraine needs – but it has key strengths’, The Conversation, 11 March 2025. - 13 Byman, D. et al, ‘Can Ukraine fight without US aid? Seven questions to ask’, CSIS, 19 May 2025. - 14 Norwegian Government, ‘Norway to increase support for Ukrainian defence industry and procurement of drones for Ukraine’, 24 February 2025; Ministry for Strategic Industries of Ukraine, ‘Mechanism for implementing EUR 500 million allocated by the Netherlands to the Ukrainian defence industry discussed in Brussels’, 12 May 2025. - 15 European Commission, ‘Joint press release by the European Union and Ukraine on strengthening military industry ties at the EU-Ukraine Defence Industries Forum’, 13 May 2025. - 16 Fiott, D., ’Integrated arsenals? Mapping defence industrial relations between Europe and Ukraine‘, ARES, December 2024. - 17 Danish Ministry of Defence, ‘Danish Military Support for Ukraine’. - 18 ‘US State Dept OKs possible sale of F-16 training, sustainment for Ukraine’, Reuters, 2 May 2025; Jakes, L., ‘Europe wants to arm Ukraine, but It’s losing a race against time’, New York Times, 10 May 2025."
}