{
  "url": "https://www.visit-croatia.co.uk/croatia-destinations/dalmatian-islands-and-dalmatia/",
  "title": "Dalmatian Islands and Dalmatia - Hvar, Korcula, Brac, Mljet - Visit Croatia",
  "text": "You’ve surely heard of the amazing islands in Croatia – one of the amazing features of the Croatian coast that brings many visitors to the country each year. But what, specifically, are the Dalmatian islands? And which ones should you and can you visit? Dalmatia Although important and prominent throughout history – the flag of Dalmatia is one of the five shields that make up the Croatian flag – there is no one official region of the country known as Dalmatia today. In fact, Dalmatia today is made up of four counties – Zadar County, Sibenik-Knin County, Split-Dalmatia County and Dubrovnik-Neretva County. Because we like to do things a little differently here, we’ve split up Dalmatia on the Visit Croatia site into four other parts – North Dalmatia (around Zadar, Sibenik), Central Dalmatia (around Split), the Makarska Riviera (around the town of the same name!) and South Dalmatia (around Dubrovnik, Cavtat, Peljesac Peninsula). Read up on these sections for more details of Dalmatia! The Dalmatian Islands As you may well have guessed, the Dalmatian islands are those off the coast of Dalmatia, or the four counties that make up the Dalmatian coastline. In fact, most of the “famous” islands in Croatia – indeed most of the islands overall – are located in Dalmatia. From the northern Dalmatian coastline down to the southernmost point (just below Dubrovnik), the main Dalmatian islands are: - Pag - Vir - Ist - Molat - Sestrunj - Ugljan - Iz - Pasman - Dugi Otok - Kornati Islands - Murter - Kaprije - Zirje - Zlarin - Drvenik Mali - Drvenik Veli - Ciovo - Solta - Brac - Vis - Bisevo - Hvar - Pakleni Islands - Korcula - Lastovo - Mljet - Elafiti Islands – Sipan, Lopud, Kolocep As you can see, that’s a pretty decent list of islands for you to visit! You can perhaps tell which are the smaller islands in the above list which – unless you’re a keen sea adventurer – you may be unlikely to visit. What are the best Dalmatian islands to visit? There are many to choose from – which one is the best Dalmatian island to visit depends on your preferences and what you like to do on holiday! But here are our picks: Brac – Beaches, family holiday, water sports Brac is home to the famous Zlatni Rat Beach (pictured below) which surely draws many visitors to both Croatia and the Dalmatian islands! This island – the largest in Dalmatia – is home to many other lovely beaches, and has a very good selection of accommodation – from apartments to larger holiday resorts – making this island very suitable for a family holiday. The island can also be easily reached from the mainland – largely from Split, but also from Makarska – whether with a car or without (by catamaran). If you’re feeling sporty, Bol is certainly the place to come to for trying out some water activities. You can partake in everything from waterskiing to parasailing to more genteel fun on the sea; due to the specific winds around Zlatni Rat beach, windsurfing and kitesurfing is also possible. Hvar – chic towns, stylish bars and plenty of fragrance Ultra-chic Hvar draws in many visitors each year due to a wide variety of delightful features. Beautiful Hvar Town with its pretty harbour, stylish hotels, the gorgeous central piazza with numerous cafes, lively bars, excellent restaurants and absolutely stunning (yes, we did have to italicise that!) views from the fortress is certainly a top pick for many holidaymakers. But there are also plenty of smaller but no less pretty towns on the island such as Stari Grad or Jelsa if you’d like to stay somewhere quieter. Hvar is also well known for its stunning lavender fields – in full bloom in June and July each year – and is also a great island for trying out food and wine tours. Make sure to hop over to the nearby Pakleni Islands on a day trip! Vis – laid-back and eclectic Vis island is a bit of a mishmash of things; closed to foreign visitors until 1989 (as Vis was a naval base during the time of Yugoslavia), the island wasn’t able to develop as a tourist destination as some of the other Dalmatian islands did. This means that the island has no large-scale hotel resorts; in fact, it hardly even has any hotels, although there are plenty of apartments and villas to rent. (So don’t worry!) But as a former naval base, there are some interesting sights on the island such as the submarine tunnels you can swim in outside of Vis Town. Or the cave where then Partisan leader Tito hid out during WWII? (If you believe the story!) If that’s not of interest at all, simply head to one of the small beaches (Stiniva, Stoncica and Srebrna are frequently cited as the best beaches on Vis, although others not beginning with the letter ‘s’ also exist) for a chilled day by the sea. When you’re feeling a bit more energetic, hire a bike or moped (or a car!) to head up the highest point on the island, Hum, for some absolutely stunning views. Oh, and another element of Vis’ mishmash? The hit film Mamma Mia 2: Here We Go Again was shot here! Mljet – Lush greenery and inland lakes in this national park Mljet is not only another wonderfully laid-back island but also one of Croatia’s eight national parks. (A third of the park has been designated as a national park.) Again, there is little in the way of hotel accommodation here but you can enjoy island life in one of the rooms and apartments. Exploring Mljet by bike (available to rent on the island) is an ideal way of getting around – zip through the forests and then head to the two inland lakes (Veliko Jezero and Malo Jezero) for a refreshing dip. Hiring a kayak to tour the island by sea would also be an excellent way to spend your time here. Pag – Nightlife, nightlife, nightlife and cheese Say what? What kind of title is that? Well, what can we do – that’s what Pag island is famous for! (Insert laughing emoji here.) Just by Novalja to the north of the island is Zrce Beach which is home to a number of the top clubs in Croatia which host some of the country’s best-known music festivals – Hideout, Sonus, and Fresh Island Fest to name just three. If you’re really up for spending your nights (and days) clubbing, we’d certainly recommend that you make your way to Novalja on Pag for your summer hols. But if that’s not your cup of tea at all, we’d still suggest Pag! (Just maybe not Novalja.) Pag has a very unusual, rather rocky landscape – unlike most of the other Dalmatian islands – to explore. And yes, cheese too – the world-famous Paski sir (Pag cheese) is a hard cheese made out of sheep milk. You can visit a local cheese dairy, such as Sirana Gligora, to see how the cheese is made and for tastings. More to choose from on the Dalmatian Islands If none of the above really floats your boat (what?), there’s more! How about: - To explore another of Croatia’s national parks, join an organised trip through the stunning Kornati Islands. - Really get away from it all on little Lastovo, one of the islands furthest away from the mainland – also known as a wonderful place for stargazing - Ciovo is another excellent choice for a family-friendly holiday (lots of beaches) with no big holiday resorts – it’s also a great base for sightseeing on the mainland (Split, Krka National Park) - Korcula for more really amazing sights (a beautifully preserved, small town) as well as wonderful beaches - Visit little Solta – close to Split – which is one of the more overlooked islands; there’s a wonderful five-star hotel here in a 300-year-old castle! - The tiny island group the Elafiti islands are another exceedingly relaxing choice right at the southernmost part of the Croatian coastline – a good option if you want to be close to Dubrovnik Map of the Dalmatian Islands Here is a Google map showing where the main Dalmatian islands are located. Zoom in and out and move around to explore and click on a marker to see the name of the island. And here’s a static map showing the Dalmatian islands: More info on the Dalmatian islands You can see more on the Dalmatian islands on the websites of Zadar County Tourist Board, Sibenik-Knin County Tourist Board, Split-Dalmatia County Tourist Office and Dubrovnik-Neretva Tourist Board. Safe in Dalmatia offers helpful advice for visiting this region, including tips on staying safe on the islands and in nature, when driving and more."
}