{
  "url": "https://support.google.com/voice/answer/115061?hl=en&co=GENIE.Platform=Desktop",
  "title": "Set up Google Voice - Computer - Google Voice Help",
  "text": "View the same content in français Deutsch italiano Google Voice gives you a phone number for calls, texts, and voicemails. You can use this number to make domestic and international calls from your web browser and mobile devices. If you're in the US, you can choose your own number. In addition to using Google Voice for calls, texts, and voicemails, you can also: - Read voicemail transcripts in your inbox and search them like emails. - Personalize voicemail greetings. - Make international calls at low rates. - Get protection from spam calls and messages. - Block unwanted callers. - Screen calls before you answer. Google Voice saves and processes your call, text, and voicemail information. What you need to use Google Voice Supported operating systems: - Chrome OS - macOS - Microsoft Windows - Limited functionality may be available on other platforms Supported web browsers: - Google Chrome - Mozilla Firefox - Microsoft Edge - Safari Sign up for Google Voice & get your number Important: Google Voice doesn’t offer 1–800 numbers. - Go to voice.google.com. - Sign in to your Google Account. - Review the Terms of Service and Privacy Policy click Continue. - You can search for available numbers by city or area code. If numbers aren’t available in your area, try a nearby city or area code. - Next to the number you want, click Select. - Follow the on-screen instructions. Tip: After setting up Google Voice, you can link another phone number. Learn more about setting up phones. Add a shortcut in App Launcher If the Google Voice app doesn't appear in your Google apps in Chrome, you can add it. - Go to voice.google.com. - In the top right, click Google apps . - Under Voice , click Add a shortcut. Cost and availability - When you call from the US, almost all Google Voice calls to the US and Canada are free. - Some calls to specific phone numbers in the US and Canada cost 1 cent per minute (USD). - Calls outside the US are at listed rates."
}