{
  "url": "https://www.powerade.com/products/powerade",
  "title": "Powerade",
  "text": "POWERADE ISLAND BURST hydrates you with a great taste that includes tropical punch flavors. It takes more grind to dominate, so stock up on POWERADE today! Available Sizes:Â 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), NATURAL FLAVORS, VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), MODIFIED FOOD STARCH, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), MEDIUM CHAIN TRIGLYCERIDES, SUCROSE ACETATE ISOBUTYRATE, YELLOW 5, RED 40. POWERADE MOUNTAIN BERRY BLAST Â® hydrates you with a flavor blend that includes the sweet and slight tart flavors of mixed berries. Stock up on Powerade today! It takes more.â¯Â Available Sizes:Â 12 fl oz; 20 fl oz; 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, MODIFIED FOOD STARCH, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), MEDIUM CHAIN TRIGLYCERIDES, SUCROSE ACETATE ISOBUTYRATE, BLUE 1. POWERADE FRUIT PUNCH tastes great, that includes a vibrant blend of fruit flavors. It takes more grind to dominate, so stock up on POWERADE FRUIT PUNCH today!Â Available Sizes:Â 20 fl oz; 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, MEDIUM CHAIN TRIGLYCERIDES, MODIFIED FOOD STARCH, GLYCEROL ESTER OF ROSIN, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40. POWERADE GRAPE hydrates you with a deeply refreshing flavor of ripe grapes. It takes more grind to dominate, so stock up on POWERADE GRAPE today!Â Available Sizes:Â 20 fl oz; 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), NATURAL AND ARTIFICIAL FLAVORS, VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40, BLUE 1. POWERADE ORANGE hydrates you with a citrus experience that includes an invigorating burst of juicy orange flavor. It takes more grind to dominate, so stock up on POWERADE ORANGE today!Â Available Sizes:Â 12 fl oz; 20 fl oz; 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, GUM ACACIA, GLYCEROL ESTER OF ROSIN, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), YELLOW 5 AND 6. POWERADE LEMON LIME hydrates you with a zesty fusion that includes bright lemon and tangy lime flavors. It takes more grind to dominate, so stock up on POWERADE today!Â Available Sizes:Â 20 fl oz; 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, GUM ACACIA, GLYCEROL ESTER OF ROSIN, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), YELLOW 5. POWERADE STRAWBERRY LEMONADE hydrates you with a flavor blend that includes the combination of sweet ripe strawberries with tangy lemonade flavor. It takes more grind to dominate, so stock up on POWERADE STRAWBERRY LEMONADE today!Â Available Sizes:Â 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVOR, GUM ACACIA, GLYCEROL ESTER OF ROSIN, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), RED 40. POWERADE MELON hydrates you with the taste of ripe melon flavor. It takes more grind to dominate, so stock up on POWERADE MELON today!Â Available Sizes:Â 28 fl oz WATER, HIGH FRUCTOSE CORN SYRUP, LESS THAN 0.5% OF: CITRIC ACID, ELECTROLYTES (SALT, SODIUM CITRATE, MAGNESIUM AND CALCIUM CHLORIDES, MONO-POTASSIUM PHOSPHATE), VITAMINS B12 AND C (CYANOCOBALAMIN AND ASCORBIC ACID), NATURAL FLAVORS, MEDIUM CHAIN TRIGLYCERIDES, MODIFIED FOOD STARCH, SUCROSE ACETATE ISOBUTYRATE, CALCIUM DISODIUM EDTA (TO PROTECT COLOR), YELLOW 5, BLUE 1."
}