{
  "url": "https://www.countryreports.org/country/Malaysia.htm",
  "title": "Malaysia | Culture, Facts & Travel | - CountryReports",
  "text": "What makes Malaysia a unique country to travel to? Country Description Malaysia is a constitutional monarchy with an elected federal parliamentary government. The country comprises 13 states, 11 on the Malay Peninsula and two, Sabah and Sarawak, on the island of Borneo. There are also three federally administered territories: the capital city of Kuala Lumpur, the administrative center of Putrajaya, and the island of Labuan. Malaysia is a multi-ethnic country of 27 million people. Malays form the predominant ethnic group; the two other large ethnic groups are Chinese and Indians. Islam is the official religion and is practiced by some 60 percent of the population. Bahasa Malaysia is the official language, although English is widely spoken. Travelers to Malaysia may access information on areas of interest through the Malaysian government's website and Tourism Malaysia's website. Crime Petty theft, particularly purse snatching and pick-pocketing, and residential burglaries are the most common crimes committed against foreigners. Other types of non-violent criminal activity include credit card fraud and automobile theft. In tourist areas such as Bukit Bintang, Petaling Street (Chinatown), Sri Hartamas, and Bangsar in Kuala Lumpur, and the main square in Malacca, the police have established small \"Tourist Police” stations familiar with helping visitors to Malaysia. There have been recent incidents of violent crime perpetrated against foreign tourists and local residents by taxi drivers in downtown Kuala Lumpur. Single women travelers are advised to book taxis in downtown shopping areas by phone, rather than to hail taxis on the street, particularly after dark. Upon entering a taxi, confirm there is a license (with photo) on the dashboard or seatback, and that the driver's appearance matches the photo. Taxis are not permitted to stop to pick up additional passengers. Some drivers, particularly in tourist areas, refuse to use the meter despite a law prohibiting the practice. SPAD, the government body regulating taxis in Malaysia, has an English language hotline for reporting problems: 1-800-88-7732, Scams: U.S. citizens and businesses continue to be the victims of scams originating in Malaysia. Scammers and confidence artists contact U.S. citizens through the telephone and Internet, including dating websites. Scammers almost always pose as U.S. citizens who have unexpectedly experienced a medical, legal, financial or other type of “emergency” in Malaysia and who ask the U.S. citizen in the United States to send money quickly to Malaysia. Co-conspirators pose as Malaysian lawyers or medical professionals to verify the story and the supposed urgent need for cash. There have also been cases of U.S. businesses being defrauded by faulty investment scams. We strongly urge U.S. citizens in the United States to be very cautious about sending money to people they have not met in person and who claim to be U.S. citizens in trouble in Malaysia. If you insist on sending money, consider sending an OCS Trust though the U.S. Department of State instead of direct Western Union or MoneyGram. OCS trusts are deposited directly with the nearest U.S. embassy and consulate overseas for pick up by verification of an I.D. If you are scammed and wish to make a formal complaint (in person or via e-mail), the Malaysian Embassy or the nearest Malaysian consulate in the United States will accept the complaint and transmit it to the police for follow-up. Resources on how to identify, protect yourself, and report on business and financial fraud can be found in the Department of State's publication, International Financial Scams. Additional resources can be found at StopFraud.gov (a service of the Financial Fraud Enforcement Task Force) and from the U.S. Commodity Futures Trading Commission. Purse Snatchings: In most purse-snatching incidents, two thieves on a motorcycle speed up from behind a victim, and the passenger on the back snatches a purse, handbag, or cellular phone. Thieves have also conducted snatch-thefts while leaning out of the passenger side of moving vehicles. Increasingly, robbers confront a victim in larger groups. These types of thefts can occur at all hours and often in front of large groups of witnesses, even in upscale neighborhoods frequented by expatriates. Women walking by themselves or with small children are the most common targets, but men walking or jogging alone have also been targeted. Victims have been injured and even killed after falling and being dragged by thieves in cars or on motorcycles. More recently, some thieves carrying knives have slashed and cut the victim in order to shock the victim into immediately releasing valuable items. To avoid becoming the victim of a purse snatching, be alert and aware of your surroundings. Pedestrians should walk facing traffic and keep a close eye on all vehicular traffic, particularly motorcycles. If possible, try to walk on the sidewalk away from the curb. Avoid poorly lit streets, shortcuts, and narrow alleys, but be aware that attacks may still occur anywhere. Purses or shoulder bags should be closed and tucked under the arm. Do not wrap the strap around your arm or shoulder. People have been injured or killed by being pulled to the ground by their purse straps as the thieves sped off. If your purse or bag is snatched, report the incident as soon as possible to the police. Smash-and-Grab Robberies: The targets of smash-and-grab robberies are motorists who are stuck in traffic or stopped at a light. The usual scenario is that a pair of thieves on a motorcycle identifies a car with a lone passenger (male or female) and with valuables (e.g., purse, bag) visible. The thieves use a hammer or crowbar to smash the window of the car, grab the bag, and speed off. If the motorist's windows are already open, the motorcyclists simply reach in and take bags off the seat of the car. You can prevent these crimes by keeping valuables like purses and laptops out of sight while driving or removing them from the car (including from the trunk) when parked. GPS monitors should not be left on the windscreen or dashboard. Credit Card Fraud: While traveling in Malaysia you should closely safeguard your credit card numbers at all times, and use the cards only at reputable establishments. Credit card fraud continues to be a problem in the region, although enhanced technology has reduced reported instances of fraud. Unauthorized charges may not show on a credit card account for several months but can unexpectedly appear in amounts of $5,000 or more. One of the more common methods of carrying out this fraud is for retailers to swipe the credit card under the counter where a machine containing a mobile phone SIM card receives the card's information and transmits it to a criminal organization for reproduction. You should watch retailers closely and any “under the table” transactions should be reported to the local police. In some cases, sophisticated criminal organizations have tapped into data lines emanating from retail establishments. The criminals then steal the credit card information while it is being transmitted to financial institutions. If you must use a credit card in Malaysia, you should check your account information frequently for fraudulent charges. ATM cards are safer as long as the machines where they are used are associated with reputable Malaysian banks. Don't buy counterfeit or pirated goods, even if they are widely available. Not only are the bootlegs illegal in the United States, you are encouraging criminal activity if you buy them. Criminal Penalties While you are traveling in Malaysia, you are subject to its laws even if you are a U.S. citizen. Foreign laws and legal systems can be vastly different than our own. In some places you may be taken in for questioning if you don't have your passport with you. In some places, it is illegal to take pictures of certain buildings. In Malaysia, driving under the influence could land you immediately in jail.These criminal penalties will vary from country to country. There are also some things that might be legal in the country you visit, but still illegal in the United States, and you can be prosecuted under U.S. law if you buy pirated goods. Engaging in sexual conduct with children or using or disseminating child pornography in a foreign country is a crime prosecutable in the United States. If you break local laws in Malaysia, your U.S. passport won't help you avoid arrest or prosecution. It's very important to know what's legal and what's not wherever you go. If you violate the law, even unknowingly, you may be fined, expelled, arrested, or imprisoned. Malaysia strictly enforces its drug laws. If you possess, use, or traffic in illegal drugs in Malaysia, you will be sentenced to significantly longer prison sentences and much heavier fines than in the United States. Malaysian legislation provides for a mandatory death penalty for convicted drug traffickers. If you are arrested in possession of 15 grams (1/2 ounce) of heroin or 200 grams (seven ounces) of marijuana, you will be presumed by law to be trafficking in drugs. The Malaysian criminal code includes a provision for a sentence of caning for certain white-collar crimes, including criminal misappropriation, criminal breach of trust, and cheating. If you collect and/or remove local flora and fauna or protected species without authorization from the Malaysian government, you may be prosecuted criminally and may be sentenced to heavy fines, expulsion, and/or imprisonment. Distribution of religious leaflets or books of another faith to Malaysian Muslims is illegal; if you engage in this action, you may be arrested and imprisoned. Occasionally, special religious authorities coordinate with local police to conduct raids on popular nightspots and hotels to deter activities among local Muslims that contravene religious customs, including drinking alcohol and having premarital sex. Arrest notifications in Malaysia: While some countries will automatically notify the nearest U.S. embassy or consulate if a U.S. citizen is detained or arrested in a foreign country, that might not always be the case in Malaysia. To ensure that the United States is aware of your circumstances, request that the police and prison officials notify the U.S. Embassy as soon as you are arrested. You should carry your U.S. passport and current social visit pass (visa) with you at all times, so that if you are questioned by local officials, you will have proof of your identity, U.S. citizenship, and legal status in Malaysia readily available. Medical Facilities and Health Information Medical facilities and services are adequate in the larger cities, where you can find Western-trained doctors. The U.S. Embassy can provide a list of English-speaking doctors and hospitals upon request. Psychological and psychiatric medical and counseling services are limited. Serious medical problems requiring hospitalization and/or medical evacuation to the United States can cost thousands of dollars or more. Doctors and hospitals often expect immediate cash payment for health services, although major credit cards are acceptable at some hospitals in larger cities. Malaysian ambulance attendants do not have training equivalent to U.S. standards. Callers to Malaysia's \"999\" emergency number (equivalent to dialing 911 in the United States) are connected to the Red Crescent (a member of the International Federation of Red Cross and Red Crescent Societies), and patients are directed to whichever hospital the dispatcher chooses. If you are staying in Malaysia for a long time, and you have known health problems, you should investigate private ambulance services in the area and provide family and close contacts with the direct telephone number(s) of the service you prefer. Air quality in Malaysia is acceptable most of the time. However, when Malaysia and nearby countries burn vegetation, especially from March through June and during September and October, air quality can range from “unhealthy for sensitive groups” to “unhealthy.” Safety and Security The Department of State remains concerned about the possibility of terrorist attacks against U.S. citizens in Southeast Asia. Extremist groups in the region have demonstrated the capability to carry out attacks in locations where Westerners congregate, and these groups do not distinguish between civilian and official targets. The U.S. government has designated two such groups, Jemaah Islamiyah (JI) and the Abu Sayyaf Group (ASG), as Foreign Terrorist Organizations. JI, which has a known presence in Malaysia, is linked to al-Qaeda and other regional terrorist groups and has cells operating throughout Southeast Asia. U.S. citizens should consider the risks associated with travel to coastal eastern Sabah (Eastern Malaysia) due to the threat from both terrorist and criminal groups. Employees of the U.S. Embassy in Kuala Lumpur are prohibited from travelling to most of this area without prior permission from the security office and Ambassador. This permission requirement for U.S. embassy employees indicates a strong concern over safety. U.S. citizens are accordingly advised against travel to the coastal resorts in Eastern Sabah. This area includes the beach areas of Sandakan, Semporna and Beluran Districts, resorts along the Kinabatangan River (Sukau District) and Sabahan River (Kunak District, and the following resort islands: Selingan, Lankayan, Mabul, Pom Pom, Kapalai, Ligitan, Sipadan, and Mataking. Kidnappings-for-ransom occur frequently in these areas. In mid-November 2013, a foreign tourist was killed and his spouse was abducted from a resort on Pom Pom Island. In August 2013, Malaysian officials reported an aborted attempt by an armed Filipino group to kidnap foreign tourists from the resort island of Mabul. In addition to incursions on the coastal or island resort islands themselves, criminal or terrorist bands may attempt to intercept boats ferrying tourists from the mainland to the resort islands. U.S. citizens are also advised against travel to the peninsular Lahad Datu district (to include the Tabin Wildlife Reserve). In early February 2013, armed intruders from the Sulu archipelago, who had entered the area by sea from the southern Philippines, were involved in a violent confrontation with Malaysian security forces in the district. The entire eastern portion of Sabah (extending from the town of Kudat in the north to Tawau district near the border of Indonesia) has been designated as the Eastern Sabah Security Zone, and an Eastern Sabah Security Command has been established to coordinate security forces' activity. There is a significant police and army presence in the area, and road checkpoints have increased. The Malaysian government has also enhanced efforts to patrol its maritime border with the Philippines, but the size and remoteness of the coastal region makes it possible there may be future security incidents. Most tourists travel directly (via transportation arranged by tour operators and hotels) from Lahad Datu airport to the resorts in the inland Danum Valley. If you plan travel to the area, we recommend you use direct transit arranged by reputable companies. Traffic Safety and Road Conditions While in Malaysia, you may encounter road conditions that differ significantly from those in the United States. The information below concerning Malaysia is for general reference only and may not be totally accurate in a particular location or circumstance. Many car rental agencies in Malaysia are willing to rent vehicles for a short term to U.S. citizens with valid U.S. driver's licenses. Nevertheless, if you plan on driving in Malaysia, we strongly urge you to obtain an international driving permit (IDP) before leaving the United States. More information on how to obtain an IDP is available on the Road Safety Overseas section of the Department of State website. If you plan to stay in Malaysia for a longer period of time, you must obtain a local driver's permit through the Road Transport Department of Malaysia. Traffic in Malaysia moves on the left side of the road, and most vehicles are right-hand drive. Motorcyclists attempt to circumvent traffic blockage by weaving in and out of traffic, temporarily using vacant oncoming traffic lanes, and running through red lights. These practices pose a hazard for both drivers and pedestrians unfamiliar with such traffic patterns. If you drive, you should use your turn signals well in advance of turning to alert motorcycles of your intent to turn. By law, you must use your front- and back - seat belts in Malaysia and may not use your cell phone while driving unless it is hands-free (e.g., Bluetooth.) Turning left at a red light is not legal unless otherwise marked. Traffic is heavy during the morning and afternoon rush hours and slows down considerably when it rains. Monsoonal rains can quickly floods roads located in low-lying areas. Bottlenecks are common in major cities because infrastructure development has not kept pace with the proliferation of motorized vehicles. Multi-lane highways often merge into narrow two-lane roads in the center of town and cause added congestion. Many streets are narrow and winding. There have been fatal and other serious accidents involving long-distance tour buses in Malaysia, particularly at night or in adverse weather conditions. If you plan to travel by bus, choose a reputable company, and avoid overnight itineraries. Reports of late-night road rage incidents, especially after midnight, are rising. If you drive, avoid confrontational behavior if you are involved in an accident. If you are threatened, leave the scene and file a report with the local police within 24 hours. Taxis are metered, but many drivers refuse to use the meter and instead charge a much higher rate, particularly during peak hours, when it is raining, or when the passenger's destination is to or through a heavily congested area. By regulation, metered fares increase by 50 percent between midnight and 6 a.m.; meters are programmed to display the higher fee automatically during these hours. Sobriety Checkpoints: Please note that laws against drinking and driving are strictly enforced and carry serious penalties. Police operate sobriety checkpoints in many entertainment districts frequented by expatriates. At these checkpoints, all drivers must submit to alcohol breath tests. If you fail a breath test, you will be arrested. Driver's License Requirements: International Driver's Licenses (IDL) may be used for 90 days in Malaysia. The IDL must be obtained outside of Malaysia. If you are staying longer than 90 days in Malaysia, and desire a local license, the Malaysian Road Transport Department recommends contacting a local driving school to arrange all the paperwork. In order to obtain a local license, you will also need a valid work permit."
}