{
  "url": "https://www.royalcaribbean.com/puerto-rico-cruises",
  "title": "Plan a Trip to Puerto Rico by Cruise | Royal Caribbean Cruises",
  "text": "Take in the tropical flavour and lively energy with a cruise to Puerto Rico. Cruise to Puerto Rico and take to the roads that lead to remote Spanish colonial towns like San German that house elegant plazas and churches evoking hundreds of years of history. Head to the main old town, the always-vivid Old San Juan, and walk the cobblestoned streets where Conquistadors once marched. See the diverse and geographically stunning island with aquamarine mangrove waters, baby-blue beaches and emerald-green jungles and go inland for the Alps-lookalike peaks of Cerro de Punta, the lime green Lajas Valley, acres of plantain and banana groves and some of the best roasted pork (pernil) in the world. Discover the magic with a Puerto Rico cruise. Explore more while spending less with Puerto Rico cruise deals onboard our best cruise ships Lounge by the beach, swim under a waterfall or canoe through mangroves. Venture out and get lost in a world of rainforests and mist-covered mountain tops with the best Puerto Rico cruises. Puerto Rico is a beach lover’s paradise before or after your San Juan cruise. Enjoy Condado and Isla Verde near the port, or venture to Flamenco Beach in Culebra for pristine white sands and turquoise waters. Surf Rincon’s legendary waves or stroll Vieques’ dramatic black sands for unforgettable coastal escapes. Beyond the sandy beaches and lush jungles lie other natural wonders. Explore cavernous labyrinths like La Jungla Cave Park. See translucent mangrove lagoons like the ones in Parguera. Or trek through dry forests like Bosque Seco in Guanica. Keep in mind both are 2 hours from San Juan where your ship will dock. The sunny island has a long and storied history that encompasses hundreds of years, and you can take a glimpse into its past through its food, colonial towns and even souvenirs and attraction. Witness the cultural heritage come alive with your cruise to Puerto Rico. A cruise to Puerto Rico is filled with exciting destinations, each with its own style and vibe. Discover Puerto Rico onboard the Best Royal Caribbean Cruise Ships. Cruise the Eastern Caribbean and feel the ocean spray as you discover every corner of the Castillo San Felipe del Morro and the Castillo San Cristóbal, before you snorkel coral reefs in Labadee, Haiti, and trek through sugar plantations in St. Maarten. Take a Southern Caribbean cruise that includes a stop in San Juan, where you can bike by mangroves and sunbathe at the Pinones beach or grab a cold drink and a few fried delicacies at one of the many kiosks along the way. Best time to travel to Puerto Rico — the island stays warm all year long, so you can count on using your swimsuit whenever you visit. Rain showers are common but usually brief, and mid-April through June often brings a drier, sunnier stretch ideal for exploring San Juan or relaxing along the coast. Best way to get around in San Juan — the San Juan cruise port is right in the heart of Old San Juan, making the city easy to navigate on foot or by public transportation. You can ride the free Old San Juan trolley, catch a cab, or hop on a AMA Metrobus to reach your next island stop. Do you need a passport to cruise to or from Puerto Rico — U.S. citizens do not need one to visit, and the island uses the U.S. dollar, making travel especially seamless. Brush up on a little Spanish, though, to make conversations with locals even easier. 1 Stop by La Factoria, voted one of the 50 best bars in the world, and try craft cocktails with an island twist. 2 Hungry? Pay a visit to Calle Loiza, where local restaurateurs are cooking up a storm of Puerto Rican flavors. 3 Salsa dancing is a wildly fun local activity here, so head to La Placita in Santurce or La Factoria in Old San Juan and get your groove on. Food in Puerto Rico is a blend of Taino, African and Spanish influences, with a dose of contemporary inventions, too. Add to this diverse combination of flavors, a strong and fragrant cup of coffee and a shot of island rum, and you have the essence of what Puerto Rican food is all about. Puerto Rico is famous for its pernil, a roasted pork shoulder with crispy skin spiced with garlic and adobo, typically served over rice and beans with a side of sweet plantains. The mountain town of Cayey is known for having perfected pernil, but you don't have to leave San Juan for a taste — just head to El Jibarito or Bebo's Cafe."
}