{
  "url": "https://www.wikihow.com/Create-an-Account-on-GitHub",
  "title": "How to Create an Account on GitHub: Easy Sign-Up Guide",
  "text": "This article was co-authored by Théo Dufort and by wikiHow staff writer, Hannah Dillon. Théo Dufort is a Software Engineer and Full-Stack Web Developer based in Quebec, Canada. With nearly 6 years of experience, Théo is a full-stack developer specializing in web development. At just 16, he launched his own consulting business to advise on all things web design and development. Most recently he created MyBookQuest, designed to be an all-in-one platform for book lovers to track, organize, and fill their personal library. MyBookQuest aims to fill the gaps of the popular Goodreads app owned by Amazon by rewarding its users with points to give them different perks like discount coupons as an incentive to read, review, and rate their latest book. This article has been fact-checked, ensuring the accuracy of any cited facts and confirming the authority of its sources. This article has been viewed 274,982 times. Do you need to make a GitHub account? GitHub is an online code host and management system that's used by many programmers around the world. This wikiHow teaches you how to sign up for a free personal account on GitHub. It's free to make an account on GitHub, and it only takes a few seconds. Keep reading to learn how! Quick Steps - Go to github.com/signup. - Enter your email, desired username, and password. - Verify your account by entering a code sent to your email. - Sign in to your account to start using GitHub. Steps Making an Account - Go to github.com/signup in a web browser. You can use any web browser on your computer, phone, or tablet to join. Before you can create branches or make any pull requests, you’ll need an account.[1] - Some ad blockers, including uBlock Origin, prevent GitHub's verification CAPTCHA puzzle from appearing. For best results, disable your web browser's ad blocker when signing up for GitHub. - Enter your personal details. You'll need to enter your email, create a password and username, and choose your country/region before you can sign up for a GitHub account. - If you prefer, you can create your account using your Google or Apple account. Simply click Continue with Google or Continue with Apple at the top of the screen. - If you'd like to get emails from GitHub, check the box next to \"Receive occasional product updates and announcements.\" Advertisement - Click Create account to move forward. The button is at the bottom of the screen. After clicking this button, GitHub will verify your account and browser before progressing you to the next account creation step. - Carefully review the Terms of Service and the Privacy Statement before you continue. Continuing past this step confirms that you agree to both documents. - Verify your email by entering the code. After clicking Create account, you’ll receive an email with a code. Enter this code on the verification page. Entering the code will automatically take you to the welcome page. - Click Continue to move forward. - Sign into your account. Once you've verified your email address, you can sign into your account to start using GitHub! You'll immediately be brought to your GitHub dashboard, where you can download some directories and repositories or download a file. - Purchase a premium plan (optional). There are a few different plans to choose from, varying in the amount of features provided.[2] - Free: Unlimited public and private repositories, up to 3 collaborators, issues and bug tracking, and project management tools. - By default, all GitHub accounts start out as Free accounts. You'll have to select a premium plan and enter your payment information to subscribe. - Team: All of the aforementioned features, plus access to GitHub Codespaces, repository rules, code owners, and more. - A Team account is $4 per user per month. - Enterprise: All of the features of the Team plan, plus self-hosting or cloud hosting, priority support, single sign-on support, and more. - An Enterprise account starts at $21 per user per month. - Free: Unlimited public and private repositories, up to 3 collaborators, issues and bug tracking, and project management tools. Expert Q&A - QuestionHow do I reset a commit on GitHub?Théo DufortThéo Dufort is a Software Engineer and Full-Stack Web Developer based in Quebec, Canada. With nearly 6 years of experience, Théo is a full-stack developer specializing in web development. At just 16, he launched his own consulting business to advise on all things web design and development. Most recently he created MyBookQuest, designed to be an all-in-one platform for book lovers to track, organize, and fill their personal library. MyBookQuest aims to fill the gaps of the popular Goodreads app owned by Amazon by rewarding its users with points to give them different perks like discount coupons as an incentive to read, review, and rate their latest book. Software Engineer and Full-Stack Web DeveloperTo reset a commit, just type git reset --hard followed by the SHA (hash) of the commit you want to go back to. This command will roll your branch back to that specific point. If you’d like more control over the history, you can also use git rebase. Type git rebase -i along with the SHA of the commit you want to return to. This lets you reorder, edit, or even remove specific commits as needed. - QuestionWhat should I do after receiving my email?Mohsen IbrahimCommunity AnswerGitHub will send you an activation email with a link to activate the account. Just click the URL in the email you received. - QuestionHow do I open a new Github account?Võ Trần Nhã LinhCommunity AnswerJust create another email address and start a new one. Follow the structure of this post. Video Tips - To visit your GitHub dashboard, click the cat icon at the top-left corner of the page.Thanks - To customize your profile, click the menu at the top-right corner of the page and select Your profile.Thanks Warnings - Public repositories on GitHub can be viewed and cloned by anyone.Thanks References About This Article 1. Go to https://github.com/join. 2. Fill out the form. 3. Click Create account. 4. Complete the CAPTCHA. 5. Click Choose on your desired plan. 6. Verify your email address. 7. Confirm your plan. 8. Select your preferences."
}