{
  "url": "https://www.thepioneerwoman.com/food-cooking/recipes/a32601879/how-to-make-a-classic-martini/",
  "title": "How to Make a Martini - Best Classic Martini Recipe",
  "text": "How to Make a Martini Time for happy hour! Yields: 1 serving(s) Prep Time: 5 mins Total Time: 5 mins James Bond certainly put the martini on the cultural map. No matter which actor was playing the secret agent, Bond's drink of choice often made a cameo and was always “shaken, not stirred.” But the truth is, the martini is a sophisticated classic in its own right—even without 007. It’s also one of the most variable cocktails out there. Shaken or stirred? Vodka or gin? Should it be garnished with a lemon twist or do you prefer olives or cocktail onions? Would you like it “dirty” with a little olive juice? Do you prefer a fruity version with apple liqueur? Or do you want to go rogue with an espresso or chocolate martini? The options are endless! If you’re channeling your inner Pioneer Woman, you might want to mix up a Butterfly Martini made with gin, St Germain, Crème de Violette, and hibiscus bitters—it’s on the menu at Ree's pizzeria, P-Town Pizza! But first, let's start with how to make a martini—you don't need to have a well-stocked bar to mix one up. Experiment a little to find out how you like your drink. And no matter what martini path you choose, be sure to serve your cocktail in a chilled glass to keep it nice and cold—it makes all the difference. Is a classic martini made with vodka or gin? A classic martini is made with gin. But because the liquor has a strong botanical flavor, many people prefer to use vodka—it’s more neutral. You can't go wrong either way! Just keep in mind that a martini is basically straight gin or vodka, so use a brand you really like. What about dry vermouth? Other than gin or vodka, the only other alcohol in a classic martini is a hint of dry vermouth, which is a fortified wine. Like regular wine, vermouth is available in both red and white—pick white vermouth (or blanco, bianco or blanc, depending on what country it comes from) for a martini. You’ll only need a little bit of vermouth for a martini; be sure to refrigerate the opened bottle or, like wine, it will oxidize and turn into vinegar. If you want your cocktail “bone dry,” rinse your glass with vermouth instead of mixing it into the cocktail: Pour a small splash into a chilled glass, swirl it around, and dump it out before pouring in the vodka or gin. (If you’re feeling fancy, you can mist the vermouth into the glass with a spray bottle like some bartenders do!) The classic ratio is 1 part vermouth to 6 or 7 parts gin or vodka, but some people like their martinis \"wet,\" which means equal parts vermouth and gin or vodka. Should a classic martini be shaken or stirred? Purists would say that a classic martini that only contains alcohol (no extras like juice or olive brine) should be stirred, not shaken (sorry, 007!). Combine the ingredients in a shaker with ice and stir for about 30 seconds, then strain. (This technique is often used with gin-based martinis, since some people feel that gin can release too many of its botanical flavors if shaken.) Many people like to shake their martini to get it super cold, though—it’s purely a personal preference. To shake, combine the ingredients in a shaker with ice and vigorously shake for about 10 seconds before straining the drink into the glass. What should I use to garnish my martini? Some people like their martini “with a twist,” which means that you squeeze the back of a wide strip of lemon zest to release the oils into the glass, then rub the peel around the rim. You can even add the peel to the drink for a stronger citrus flavor. You can also garnish with pearl onions for a “Gibson” or add a toothpick of olives—usually plain green ones, although some people like garlic or blue cheese-stuffed ones in their glass. If you’re going the olive route and want your drink to have some olive juice in it, ask for it to be “dirty,” “extra dirty” or even “filthy,” depending on how much brine you want. Once you know how to make a classic martini, play around a little to create your own perfect recipe! Advertisement - Continue Reading Below Ingredients - 3 1/2 oz. gin or vodka - 1/2 oz. dry vermouth Olives or lemon twist, for garnish Directions Fill a cocktail shaker with ice. Add the gin or vodka and vermouth and stir for 30 seconds or shake vigorously for 10 seconds. Strain into a chilled martini glass. Garnish with olives or a lemon twist. Advertisement - Continue Reading Below Readers Also Read 12 Super Bowl Desserts You Can Make With Cake Mix 40 Chicken Breast Recipes for Any Day of the Week Winter Dinner Ideas for Cold Days Ree's Pot Roast Is A One-Pot Dinner Classic Advertisement - Continue Reading Below Advertisement - Continue Reading Below"
}