{
  "url": "https://squareup.com/help/us/en/article/5062-sign-in-and-out-of-square-point-of-sale",
  "title": "Sign in to your Square account | Square Support Center - US",
  "text": "Sign in to your Square account About your Square account You can access Square from the Square Point of Sale app or your Square Dashboard. Your Square Dashboard gives you access to the tools you need to manage your daily business operations. You can see your business performance with advanced reporting tools, manage team members and shifts, and create marketing campaigns that help you stay in touch with customers — all in one place. The Square Point of Sale app is where you accept payments from customers and keep track of sales. You can also handle online orders and inventory, reach your customers, and manage your team. Before you begin You need an active Square account to log in to your account. If you’re just getting started, learn more about how to create your Square account using the Set up your Square account. To sign in using the Square Point of Sale app, make sure both your mobile device and Square app are up to date. Your device also needs to be compatible with the app. Learn more about device compatibility. To sign in from your Square Dashboard, you need a supported and updated web browser. Make sure cookies are enabled. Learn how to update Google Chrome, update Microsoft Edge, update Firefox, and update Safari in your browser’s respective support center. You can restart or power off your device or Square hardware, but you need to power it back on to upload any pending offline payments before they expire. Remember to upload offline payments within 72 hours of taking your first payment. Option 1: Sign in from Square Dashboard Visit your Square Dashboard using a supported web browser. Enter the email address associated with your Square account and select Continue. Enter the password associated with your Square account and select Sign in. To sign out, select your business name and select Sign out. Option 2: Download and sign in using the Square POS app You can download the Square POS app on a supported iOS or Android device. Download the Square app on your compatible device. Open the Square app and select Sign in. Enter the email address and password associated with your account and select Sign in. To sign out, tap ≡ More > Sign out. If you’re having trouble signing in, learn how to reset your password."
}