{
  "url": "https://support.google.com/chrome/answer/95346?hl=ar-US&co=GENIE.Platform=Desktop",
  "title": "تنزيل Google Chrome وتثبيته - كمبيوتر - مساعدة متصفح Google Chrome",
  "text": "يمكنك تنزيل متصفّح الويب Chrome وتثبيته بدون أي رسوم، واستخدامه لتصفّح الويب. طريقة تثبيت Chrome ملاحظة مُهمة: قبل تنزيل Chrome، ننصحك بالتحقّق مما إذا كان المتصفِّح يتوافق مع نظام التشغيل لديك ومِن توفّر جميع متطلبات النظام الأخرى فيه. نظام التشغيل Windows- على الكمبيوتر، نزِّل ملف التثبيت. - لتثبيت الملف، اتّبِع التعليمات الظاهرة على الشاشة. - إذا ظهرت لك الرسالة \"هل تريد تشغيل هذا الملف؟\" (Do you want to run this file?)، انقر على تشغيل (Run). - إذا ظهرت لك الرسالة \"هل ترغب في السماح لهذا التطبيق بإجراء تغييرات على جهازك؟\" (Do you want to allow this app to make changes to your device?)، انقر على نعم (Yes). - افتح Chrome. - في نظام التشغيل Windows 10 والإصدارات الأحدث، تفتح نافذة متصفِّح Chrome عند اكتمال التثبيت. ويمكنك جعل متصفِّح Chrome المتصفِّح التلقائي. ملاحظة: إذا استخدمت متصفِّحًا آخر، مثل Firefox، يمكنك استيراد إعداداتك إلى Chrome. تثبيت متصفّح Chrome بلا اتصال بالإنترنت إذا واجهت مشاكل عند تنزيل Chrome على جهاز كمبيوتر يعمل بنظام التشغيل Windows، استخدِم الرابط البديل لتنزيل Chrome على جهاز كمبيوتر آخر. - على جهاز الكمبيوتر، نزِّل أداة تثبيت Chrome لجهاز كمبيوتر آخر. - في أسفل الصفحة، ضِمن \"عائلة Chrome\" (Chrome Family)، اختَر الأنظمة الأساسية الأخرى (Other Platforms). - اختَر نظام تشغيل الجهاز الذي تريد تثبيت Chrome عليه. - نزِّل الملف. - انقل الملف على الجهاز الذي تريد تثبيت Chrome عليه. - اتّبِع التعليمات الظاهرة على الشاشة لإكمال عملية التثبيت. - على الكمبيوتر، نزِّل ملف التثبيت. - افتح الملف الذي يُسمى \"googlechrome.dmg\". - ستفتح نافذة، حيث يمكنك العثور على Chrome. - اسحب Chrome إلى مجلد Applications (التطبيقات). - قد يُطلب منك إدخال كلمة مرور المشرف. - إذا تعذّر إدخال كلمة مرور المشرف، اسحب Chrome إلى مكان يتوفّر لك فيه أذونات كاملة، مثل سطح المكتب. ملاحظة: للتخلص من الملفات غير الضرورية بعد التثبيت، انقر على \"إخراج\" (Eject) بجانب Chrome في الشريط الجانبي لتطبيق Finder. لتثبيت Chrome، استخدِم البرنامج نفسه الذي يثبِّت البرامج على جهاز الكمبيوتر. ويجب إدخال كلمة مرور حساب المشرف. - على الكمبيوتر، نزِّل ملف التثبيت. - لفتح الحزمة، انقر على حسنًا (OK) تثبيت الحزمة (Install Package). للتأكّد من أنّ Chrome يظل محدّثًا، تتم إضافته إلى مدير البرامج. مراجعة متطلبات النظام لاستخدام Chrome نظام التشغيل Windowsلاستخدام متصفّح Chrome على نظام التشغيل Windows مع معالج Intel أو معالج ARM، ستحتاج إلى ما يلي: - معالج Intel: - نظام التشغيل Windows 10 والإصدارات الأحدث - معالِج Intel Pentium 4 أو معالِج أحدث متوافق مع SSE3 - معالج ARM: نظام التشغيل Windows 11 والإصدارات الأحدث لاستخدام متصفّح Chrome على نظام التشغيل Mac، يجب توفُّر الإصدار 12 Monterey من macOS أو الإصدارات الأحدث. لاستخدام متصفَّح Chrome على نظام التشغيل Linux، ستحتاج إلى: - إصدار Ubuntu 18.04 أو الأحدث، أو Debian 10 أو الأحدث، أو openSUSE 15.5 أو الأحدث، أو Fedora Linux 39 أو الأحدث - معالِج Intel Pentium 4 أو معالِج أحدث متوافق مع SSE3"
}