{
  "url": "https://www.dw.com/en/2026-winter-olympics-what-you-need-to-know/a-75716782",
  "title": "2026 Winter Olympics: What you need to know",
  "text": "2026 Winter Olympics: What you need to know February 4, 2026With the new ice hockey arena in Milan and the new ice rink in Cortina both finished just in time, the 25th Winter Olympics can begin. Cortina d'Ampezzo is hosting the Olympics for the second time. Seventy years ago, in 1956, the seventh edition of the Games was held entirely in the winter sports resort in the Italian Dolomites. What are the key dates and sports for the 2026 Winter Games? The Games will officially open on February 6 at the Giuseppe Meazza Stadium in Milan, better known as San Siro, where Inter and AC Milan usually play football. The arena can seat 75,000 spectators. The first competitions will begin two days before the opening ceremony, on February 4, with curling. A total of around 2,900 athletes (47% of whom are women) from more than 90 countries will compete for a total of 116 gold, silver and bronze medals. Germany will be represented by 188 winter athletes, more than ever before at the Winter Games. Ski mountaineering will be an Olympic sport for the first time. The competitions will mostly be held on circular courses. The athletes will climb the slope with the bottom of their skis covered in climbing skins, synthetic fabric that prevents sliding down. At the top, they will remove the skins and then ski down. Ice hockey, figure skating, speed skating, and short track will take place in Milan, while women's alpine skiing, luge, bobsleigh, skeleton and curling will be in Cortina d'Ampezzo. Other locations in northeastern Italy are also included. The biathlon in Antholz, Livigno will host freestyle skiing and snowboarding, and Bormio and Val di Fiemme will share men's alpine skiing and ski mountaineering. This means that the Games will not be short-distance: Milan and Antholz are 350 kilometers (217 miles) apart. The 2026 Winter Games will end on February 22 with the closing ceremony in the evocative ampitheater known as Verona Arena, which has a capacity of 12,000 and lies to the east of Milan. Are Russian and Belarusian athletes allowed to compete? As was the case at the 2024 Summer Games in Paris, only individual athletes are allowed to compete — and only if they have no ties to the army or security services, and have not publicly spoken out in favor of Russia's war of aggression in Ukraine. Only then are they considered \"neutral.\" In addition, they must have qualified for the Olympics in their respective sports. A three-member IOC review panel grants any final permission to compete. According to information from the International Olympic Committee (IOC), 13 winter athletes from Russia and seven from Belarus are expected to participate (as of January 29, 2026). At the Summer Games in Paris in 2024, 15 athletes from Russia and 17 from Belarus were admitted as neutral athletes. In December, the Court of Arbitration for Sport (CAS) overturned the exclusion of \"neutral\" Russian and Belarusian skiers from Olympic qualifications. At the 2022 Winter Games in Beijing, 216 Russians were only allowed to compete under a neutral flag, but for a different reason: the state-sponsored doping system in Russia had been uncovered. The Russian invasion of Ukraine began on February 24, 2022, four days after the end of the Games in Beijing. Who will be responsible for security during the Games? According to the IOC, security is \"the responsibility of the host country's authorities, who will work closely with the participating delegations.\" Reportedly, around 6,000 police and other security personnel will be on duty. By comparison, more than 50,000 were deployed at the Games in Paris. The announcement that officials from the controversial US immigration agency ICE would also be sent to the Olympic Games to ensure the safety of US guests of honor made headlines around the world. Vice President JD Vance and Secretary of State Marco Rubio have announced their visit, but President Donald Trump has not yet done so. However, the US ambassador to Italy, Tilman J. Fertitta, said that the ICE officers would be deployed \"only in an advisory and intelligence capacity, without patrolling or enforcement measures.\" This is likely in reference to the Homeland Security Investigations unit, which is a unit within ICE that focuses on cross-border crimes. It frequently sends officers to events like the Olympics to help with security, and they are completely seperate from those currently at the forefront of the immigration crackdown in the US. Nevertheless, the news of any ICE presence has increased tension in Italy. How are the doping controls carried out? As in Beijing in 2022, the IOC has commissioned the Switzerland-based International Testing Authority (ITA) to carry out doping tests in most sports. Pre-Olympic controls began at the end of October, with a further 3,000 tests planned during the Games in Milan and Cortina. For the first time, baggage checks will be carried out at airports with the aim of seizing suspicious substances. However, the world federations for skiing, biathlon, ice hockey and curling are not cooperating with the ITA, but are organizing doping controls in their respective sports themselves. Urine and blood samples will be stored for up to ten years so that doping offenders can still be exposed later using possible new analysis methods. The CAS will have its own office on site during the Games so that it can quickly rule on doping offenses. Will the 2026 Games be a success? That depends on many factors. According to the organizing committee, more than half of the tickets had already been sold by the beginning of November 2025. Prices range from €30 ($36) to €2,900 for the most expensive ticket for the closing ceremony in Verona. Atmosphere will likely play a key role in gauging the success of the Games. For particularly popular events such as the alpine skiing competitions, only expensive tickets, or so-called hospitality packages, are still available. For €3,500 you get a ticket, brunch and other special services. It remains to be seen whether the organizers will ultimately be in the black at the end of the month. The budget for the Olympic and subsequent Paralympic Games in Milan and Cortina is around €1.6 billion. According to official figures, the last Winter Games in Beijing cost €3.3 billion, but researchers at Oxford University in England calculated in a study that the cost was more than double that amount (€7.33 billion). This article was originally written in German."
}