{
  "url": "https://support.google.com/translate/answer/6142478?hl=es&co=GENIE.Platform=Desktop",
  "title": "Traducir texto escrito a mano - Ordenador - Ayuda de Google Translate",
  "text": "Con la aplicación Traductor de Google puedes traducir palabras o frases escritas. También puedes usar la versión disponible para navegadores web como Chrome o Firefox. Importante: Si quieres traducir texto en Chrome desde tu dispositivo móvil, necesitas JavaScript. Consulta cómo activar JavaScript. Traducir texto - En tu ordenador, abre el Traductor de Google. - En la parte superior de la pantalla, selecciona los idiomas que quieres traducir. - Del: elige un idioma o selecciona Detectar idioma . - Al: elige el idioma al que quieras traducir. - En el cuadro de texto de la izquierda, escribe el texto que quieras traducir. - Elige lo que quieres hacer: - Ver detalles: si quieres consultar los detalles disponibles para cada resultado, como definiciones, ejemplos u otras traducciones, haz clic en Ver detalles. Esta función solo está disponible en algunos idiomas. - Escuchar: para escuchar la traducción, haz clic en Escuchar . Para cambiar la velocidad del audio, haz clic en Ajustes en la parte superior derecha y selecciona Normal, Lenta o Muy lenta. - Copiar: para copiar la traducción en el portapapeles, haz clic en Copiar traducción . - Valorar o editar: los cambios sugeridos pueden ayudar a mejorar las traducciones. Para valorar una traducción o sugerir un cambio, haz clic en los iconos de \"Buena traducción\" o \"Mala traducción\" . - Compartir: para enviar la traducción por correo electrónico o a través de Twitter, haz clic en Compartir traducción . Importante: Algunas palabras pueden tener varios significados distintos. Para que la traducción refleje el significado al que te refieres, escribe la palabra en una frase u oración. Traducir textos largos Cuando copias y pegas un texto, puedes traducir hasta 5000 caracteres de una vez. - En tu ordenador, abre el Traductor de Google. - En la parte superior de la pantalla, elige los idiomas de origen y de destino. - Del: elige un idioma o selecciona Detectar idioma. - Al: elige el idioma al que quieras traducir. - Copia y pega lo que quieres traducir en el cuadro de texto. - Puedes revisar secciones de texto traducido. En la barra inferior, haz clic en Atrás o en Siguiente . Nota: También puedes traducir documentos y sitios web."
}