{
  "url": "https://www.petmd.com/dog/nutrition/what-fruits-can-dogs-eat",
  "title": "What Fruits Can Dogs Eat? | PetMD",
  "text": "What Fruits Can Dogs Eat? Mintra Kwthijak/iStock/Getty Images Plus via Getty Images NOTE: Always check with your veterinarian before giving your dog any new foods, especially “people foods.” What might be OK for one dog might not be good for your dog, depending on multiple factors such as their age, health history, health conditions, and diet. Dogs on prescription diets should not be fed any food or treats outside the diet unless your veterinarian tells you it’s fine to do so. Dogs are omnivorous, which means that they can digest both animal and plant materials. So you might wonder: Can dogs eat fruit? And if so, which fruits can dogs eat? Some fruits are safe for dogs, while others can be toxic. Even if a fruit is “safe,” dogs dealing with obesity, diabetes, bladder stones, allergies, gastrointestinal disease, and other conditions should not be fed fruit without consulting your veterinarian first. Here are some dog-friendly fruits, plus some fruits you should never feed your dog. Key Takeaways - Many fruits are OK for healthy dogs to eat but others should be avoided. - Always wash the fruit and remove any stems, leaves, seeds, pits, and skin before giving it to your dog. - Talk to your veterinarian to determine what you can safely feed your dog. Can Dogs Eat Fruit? It depends. Because they’re omnivores, dogs can safely eat some fruits, but others are toxic to them. Due to the balanced nature of high-quality, nutritionally complete commercial diets, it’s not necessary to supplement your dog’s diet with fruits, but it can be fun to use them as treats. Keep in mind that all treats, including fruits, should make up no more than 10% of your dog’s diet. The remaining 90% should come from a complete and balanced dog food. What Fruits Can Dogs Eat? Here are 18 fruits that are safe for dogs, and the possible health benefits of each. Apples Apples are a safe and healthy for dogs to eat. Not only are they low in calories, but they also contain many nutritional benefits like vitamins A and C, fiber, potassium, and antioxidants. If your dog doesn't like fresh apples, many commercial brands like Hill's and Fruitables have dog treat options with apples as an ingredient. Avocados Avocados can provide healthy fats, fiber, and vitamins like B6, E, and C that support your dog’s skin, coat, and immune system. However, they must be served carefully—only the soft, green flesh is safe, while the pit, skin, and leaves should always be avoided due to potential toxicity. Bananas Bananas are high in fiber, potassium, and vitamins B6 and C. However, they are also higher in sugar than many other fruits, so they should be given sparingly. And although dogs can eat bananas, they should not be given banana peels, as these are difficult to digest and could cause intestinal blockage. If you want the benefits of bananas without having to cut up a fresh one, try pre-made banana dog treats, like the Blue Buffalo Banana Health Bars or Wholesome Pride's dehydrated bananas. Blackberries Dogs can eat blackberries in moderation. Berries are packed with antioxidants and phytochemicals, which are chemical compounds in plants that have been found to help fight cancer in humans. They are also low in sugar and calories. But blackberries also contain small amounts of naturally occurring xylitol, which is highly toxic to dogs. That said, your dog would have to eat a huge number of blackberries to experience any adverse effects, like vomiting or weakness. A small amount of blackberries (depending on the size and health of your pup) once a week should be OK. Pre-made dog treats containing blackberries will contain a safe amount of blackberries for your dog. Blueberries Blueberries are low in calories and high in vitamin C, fiber, antioxidants, and phytochemicals. These berries can be a great snack for your dog as a food topper, or you can opt for blackberry-flavored dog treats. Cantaloupe Cantaloupe is a healthy and nutritious fruit for dogs to eat. It’s high in fiber, low in calories, and contains numerous vitamins and minerals, including vitamins A and C, folate, fiber, and potassium. Cantaloupe is also 90% water, so it’s great for hydration. Just watch out for the high sugar content—especially if your dog struggles with diabetes or obesity. Cherries Cherries are rich in antioxidants, fiber, and vitamins A and C, which can support immune health and digestion. But if you do feed your dog cherries, make sure you remove the stems and pits. Cherry pits contain cyanide, which can cause dilated pupils and difficulty breathing. Cranberries Cranberries are a great snack for dogs. They’re high in fiber and antioxidants and contain vitamins C, E, K, B1, and B2, plus manganese and copper. Fresh cranberries can be quite sour, so try out dog treats containing cranberries, like the Full Moon Artisanal Turkey Cranberry Sausage treats or Hill's Natural Fruity Snacks with Cranberries and Oatmeal. Cucumbers Cucumbers are great for hydration during hot weather because they’re almost 97% water. They’re also low in calories and fat, so they can be a good treat for dogs carrying a little extra weight. Honeydew Honeydew is safe and healthy for dogs to eat. It contains vitamin C, potassium, and fiber, and it’s low in calories. And much like cantaloupe, honeydew contains a high percentage of water, so it’s great for hydration. Kiwi Kiwi is a great source of vitamin C, fiber, and potassium—three nutrients a dog needs. It also has a high water content, which, combined with the fiber, can help ease constipation. Mangoes Mangoes are rich in many nutrients like fiber, potassium, and vitamins A, B6, C, and E. However, because they’re high in sugar, they should only be fed to dogs in moderation. If your dog doesn't like fresh mangoes, you can also try dry mango snacks, like Pupford's freeze-dried mango dog treats. Oranges Oranges are a safe and healthy treat for dogs to eat. They’re a great source of vitamin C, potassium, and fiber. However, because of their high sugar content, oranges are not a good choice for dogs who experience obesity or diabetes. Eating too many oranges can give any dog an upset stomach from the high acidity and sugar levels, so be sure to offer them only as an occasional treat in small portions. Peaches Yes, peaches are a great snack for dogs—but again, in moderation. They are filled with fiber and antioxidants while being low in calories and fat. However, peaches also have high sugar content. Try a commercial dog treat with peaches as an ingredient if you're worried about the sugar content of fresh peaches. Pears Dogs can safely eat pears, which contain nutrients like fiber, copper, and vitamins C and K. Avoid feeding canned pears to your dog, though, as they often contain added sugars. The Fruitables Alaskan Salmon and Pear Dog Treats are a commercial treat option that combines the tasty flavor of salmon with the health benefits of pears. Pineapple Pineapples are good for hydration and packed with antioxidants and vitamins. This fruit is great for supporting your dog’s immune and digestive systems, but some dogs may not like pineapple because of the strong acidity. Keep in mind that the high sugar content and acidity can upset your dog’s stomach in large amounts. Plus, large amounts of sugar over time can lead to health issues, including obesity and diabetes. Since pineapple can be acidic, your dog may not love the taste. Try out a pre-made version, like the Pawfect Yogurt with Pineapple Dog Treats, which may be more palatable for your dog. Raspberries Like blackberries, dogs can eat raspberries safely on occasion. But because they’re high in sugar, limit the number of berries to avoid gastrointestinal upset. Strawberries Strawberries are high in immune-boosting nutrients, like vitamin C, vitamin B1, and vitamin K. They’re also a good source of potassium, fiber, and antioxidants. If fresh strawberries aren't in season, try a commercial dog treat with strawberries as a main ingredient. Tomatoes Tomatoes are not toxic to dogs, despite a common misconception that they are. While you shouldn’t let your pup eat the stems or leaves of a tomato plant (which can be bad for dogs), the flesh of a ripe tomato is totally fine and can be a good source of potassium, antioxidants, and vitamin A and C. Watermelon Watermelon is mostly water, so it’s a hydrating, refreshing treat for dogs on hot days. It’s also a good source of vitamins A, B6, and C, as well as potassium. Though many dogs like watermelon, pre-made watermelon treats are available for pups who don't love fresh fruit. What Fruits Can Dogs Not Eat? While there are plenty of safe fruits for dogs, there are also a handful that they shouldn’t eat. If your dog eats any toxic fruits, call your vet or the Pet Poison Helpline (855-764-7661; a fee applies) for guidance on what to do next. Here are some fruits to avoid giving to your dog. Grapes (and Raisins) Never feed grapes or raisins to your dog. They may be toxic to some dogs and lead to kidney failure, even in small amounts. There is no way of knowing how your dog will react beforehand. The signs of grape toxicity depend on the severity but may include: - Vomiting - Diarrhea - Loss of appetite - Weakness If your dog has eaten any grapes or raisins, contact your veterinarian immediately and take your dog to the vet’s office or an emergency vet. Time is of the essence when it comes to treatment for grape toxicity. Lemons/Limes Lemons and limes contain high amounts of citric acid and natural insecticides like limonene and linalool, which can irritate your dog’s digestive system and central nervous system. Even small amounts—especially of the peel or rind—can lead to toxicity. To keep your dog safe, it’s best to avoid giving them any lemons or limes at all. The signs of lemon or lime toxicity in dogs can include: - Vomiting - Diarrhea - Trembling - Sensitivity to light - Lethargy - Weakness - Skin irritation (from contact with the peel or oils) Wild Berries Some wild berries, like blueberries, blackberries, strawberries, and raspberries, are safe for dogs. However, many wild berries can easily be mistaken for toxic varieties. Unless you're absolutely sure about what you're picking, it's best to play it safe and keep wild berries off your dog's menu. Signs of wild berry toxicity depend on the type of berry, but can include: - Vomiting - Diarrhea - Lethargy - Reduced appetite - Drooling - Difficulty breathing - Tremors - Seizures How To Prepare and Serve Fruits for Dogs Before feeding your dog fruit, make sure it’s properly prepared to limit any potential risks. For safety, follow these guidelines: - Stick to fresh fruit. Canned fruit in syrup should never be given, due to the high sugar content. - Wash fruit thoroughly. Fruit should be cleaned with cool water before feeding it to your dog. - Remove any leaves, stems, seeds, pits, or rinds. These parts of the fruit can be a choking hazard. Only feed your dog the flesh of a fruit. - Cut the fruit. Slice fruit into small, bite-size pieces and give your dog a small amount. Remember that fruit can be a choking hazard, especially for small dogs, so always monitor your pup while they’re eating. You can give your dog pieces of fruit as individual treats or mash up the fruit and add it to their meals. How Much Fruit Can a Dog Have? Treats—and this includes fruits—should make up no more than 10% of your dog’s diet. If you are giving your dog fruit in addition to other dog treats, make sure that you do not exceed this 10% recommendation. The specific amount of fruit, or any treat, your dog can have varies based on your dog’s size and health. Talk to your veterinarian for guidance. What To Do If a Dog Eats Too Much Fruit Even if a fruit is safe for dogs, eating too much can cause digestive upset that can show up in a number of symptoms, including: - Vomiting - Diarrhea - Restlessness or pacing (signs of abdominal discomfort) - Drooling - Decreased appetite - Lethargy - Excess gas If you notice any of these signs after your dog eats fruit, follow these steps: - Take note of the type and quantity of fruit eaten. - Monitor the severity of your dog’s symptoms. - Call your vet if symptoms are severe or you’re concerned. Fruit for Dogs FAQs Can dogs eat packaged fruit snacks? No, dogs should not eat fruit snacks. While they are not considered toxic to dogs, they are very high in sugar and best avoided. Can dogs eat dried fruit? No, dogs should not eat dried fruit. Dried fruit has a higher concentration of sugar and calories, which makes it easier to overindulge. Can dogs eat frozen fruit? Yes, dogs can eat frozen fruit as long as there’s no added sugar. You may want to let frozen fruit thaw to soften before giving it to your dog, as it can be hard on their teeth. What’s the best fruit for dogs? There are lots of fruits that are good for dogs. Some of the best include apples, blueberries, strawberries, and watermelon, because they provide essential nutrients and antioxidants for your pup."
}