{
  "url": "https://maisgeek.com/como-exibir-o-icone-meu-computador-na-area-de-trabalho-do-windows-7-8-ou-10/",
  "title": "▷ Como exibir o ícone “Meu computador” na área de trabalho do Windows 7, 8 ou 10 - Mais Geek",
  "text": "Não sei sobre você, mas realmente preferia ter o ícone Meu computador diretamente na área de trabalho. Parece que as versões modernas do Windows não o têm mais por padrão. Existem duas maneiras diferentes de adicionar o ícone de volta. No Windows 10, o ícone Meu computador se chama “Este PC” e é muito fácil de adicionar. Continue lendo as instruções para Windows 7, 8 e Vista abaixo. Índice Adicione o ícone Meu Computador à Área de Trabalho do Windows 10 Se você deseja adicionar Computador, Lixeira, Painel de Controle ou o ícone da pasta do usuário à área de trabalho no Windows 10, há uma etapa extra que você precisa saber como fazer. Primeiro, clique com o botão direito na área de trabalho e escolha Personalizar. Agora selecione Temas no menu à esquerda e, quando estiver lá, você pode selecionar Configurações do ícone da área de trabalho na seção “Configurações relacionadas”. E agora você pode clicar nas caixas de seleção dos ícones que deseja de volta. Você deverá ver os ícones aparecerem assim que clicar em Aplicar. Nota: você pode renomear este PC para Meu computador simplesmente clicando com o botão direito e escolhendo Renomear. Adicione o ícone Meu Computador à Área de Trabalho no Windows 7, 8 ou Vista Clique com o botão direito do mouse na área de trabalho e escolha Personalizar, depois clique em “Alterar ícones da área de trabalho” no lado esquerdo da tela. No painel Ícones da área de trabalho, você pode escolher quais dos ícones integrados mostrar na área de trabalho: Uma das solicitações mais comuns é como adicionar a lixeira de volta … o que você também pode fazer no painel acima. Outro truque no Windows 7 ou Vista Para colocar o ícone do Computador na área de trabalho, clique no botão Iniciar e, a seguir, clique com o botão direito em “Computador”. Clique no item “Mostrar na área de trabalho” no menu e o ícone do seu computador aparecerá na área de trabalho."
}