{
  "url": "https://support.google.com/photos/answer/9343482?hl=es-419&co=GENIE.Platform=Android",
  "title": "Cómo restablecer fotos y videos borrados recientemente - Android - Ayuda de Google Fotos",
  "text": "Puedes restablecer las fotos y los videos borrados recientemente que todavía están en la papelera. No se pueden restablecer los elementos que se borraron de forma permanente. Las fotos y los videos con copia de seguridad permanecerán en la papelera durante 60 días. Las fotos y los videos sin copia de seguridad permanecerán en la papelera durante 30 días. Si te faltan fotos o videos, revisa la papelera. Obtén más información para activar la copia de seguridad. Revisa el archivo Si el elemento que falta está archivado, puedes desarchivarlo para que aparezca en tu biblioteca de Google Fotos. Descubre cómo revisar el archivo y desarchivar elementos. Revisa la papelera Si la foto o el video que buscas está en la papelera, puedes restablecerlo. Si la foto o el video que buscas no está en la papelera, es posible que se haya borrado de forma permanente. Obtén más información sobre fotos y videos que se hayan borrado. Cómo restablecer fotos y videos Importante: Solo puedes restablecer las fotos y los videos si aún están en la papelera. - En tu dispositivo Android, abre la app de Google Fotos . - En la parte inferior, presiona Colecciones Papelera. - Mantén presionada la foto o el video que quieras restablecer. - Si el contenido no está en la papelera, es posible que se haya borrado definitivamente. - En la parte inferior, presiona Restablecer. Tu foto o video volverá a aparecer en los siguientes lugares: - Los álbumes en los que estaba - La biblioteca de Google Fotos - La app de galería del teléfono No todas las fotos ni todos los videos que se borren pueden restablecerse Importante: Si no presentas actividad en Google Fotos durante 2 años o más, es posible que se borre tu contenido. Obtén más información sobre la política de inactividad de Google Fotos. Si una foto o un video borrado no está en la papelera, no podrás restablecerlo. No podrás restablecer una foto o un video en los siguientes casos: - La foto o el video no tiene copia de seguridad y ocurrió lo siguiente: - En un dispositivo con Android 11 y versiones posteriores, moviste el contenido a la papelera hace más de 30 días. - Borraste el contenido definitivamente de la app de galería de tu dispositivo. - Se creó una copia de seguridad de la foto o el video, y se movió a la papelera hace más de 60 días. - Moviste el contenido a la papelera y luego la vaciaste. - Borraste el contenido definitivamente de la papelera."
}