{
  "url": "https://en.wikipedia.org/wiki/Tokaji",
  "title": "Tokaji - Wikipedia",
  "text": "Tokaji Tokaji (Hungarian: of Tokaj Hungarian pronunciation: [ˈtokɒji]) or Tokay is a rich, sweet wine originating in the Tokaj wine region (also Tokaj-Hegyalja wine region or Tokaj-Hegyalja) in Hungary and in Slovakia. This region is noted for its sweet wines[1] made from grapes affected by noble rot, a style of wine which has a long history in this region. The \"nectar\" coming from the grapes of Tokaj is also mentioned in the national anthem of Hungary. The Hungarian wine region of Tokaj may use the Tokajský/-á/-é label (\"of Tokaj\" in Slovak)[2] if they apply the Hungarian quality control regulation.[2] This area used to be part of the greater Tokaj-Hegyalja region within the Kingdom of Hungary, but was divided between Hungary and Czechoslovakia after the Treaty of Trianon. Cultivation [edit]Six grape varieties are officially approved for Tokaji wine production: - Furmint - Hárslevelű - Yellow Muscat (Hungarian: Sárgamuskotály) - Zéta (previously called Oremus – a cross of Furmint and Bouvier grapes) - Kövérszőlő - Kabar (a cross of Hárslevelű and Bouvier grapes) Furmint accounts for 60% of the area and is by far the most important grape in the production of Aszú wines. Hárslevelű accounts for a further 30%. Nevertheless, an impressive range of different types and styles of wines are produced in the region, ranging from dry whites to the Eszencia, the world's sweetest wine.[3] The area where Tokaji wine is traditionally grown is a small plateau, 457 metres (1,500 ft) above sea level, near the Carpathian Mountains. The soil is of volcanic origin, with high concentrations of iron and lime. The location of the region has a unique climate, beneficial to this particular viniculture, due to the protection of the nearby mountains. Winters are bitterly cold and windy; spring tends to be cool and dry, and summers are noticeably hot. Usually, autumn brings rain early on, followed by an extended Indian summer, allowing a very long ripening period. The Furmint grapes begin maturation with thick skins, but as they ripen the skins become thinner, and transparent. This allows the sun to penetrate the grape and evaporate much of the liquid inside, producing a higher concentration of sugar. Other types of grapes mature to the point of bursting, however, unlike most other grapes, Furmint will grow a second skin which seals it from rot. This also has the effect of concentrating the grape's natural sugars. The grapes are left on the vine long enough to develop the \"noble rot\" (Botrytis cinerea) mold. Grapes then are harvested, sometimes as late as December (and in the case of true Eszencia, occasionally into January).[4] Typical yearly production in the region runs to a relatively small 100,280 hectolitres (2,649,000 US gal).[citation needed] Types of Tokaji wine [edit]- Dry Wines: The fine quality dry Tokaji Furmint is a relatively new development in the region. For centuries the main product of the area was the sweet wine, mainly the Botrytised selections. The dry Furmint drew the attention of wine connoisseurs and experts of the world when the Úrágya 2000 single vineyard selection had been introduced by István Szepsy. The wine expressed great minerality, complexity and structure, which has been experienced only in the finest white wines of historic regions like Burgundy or the Mosel before. The aging potential was also promising. In 2003 more producers of Mád village produced single vineyard selected dry Furmint wines with great success. Mád village with its almost 1200 ha had the opportunity to produce high quality dry Furmint wine in significant quantity as a commune level wine, which can express the unique volcanic terroir of the region, this wine is named after its appellation Mad and produced by István Szepsy Jr. in the Szent Tamás Winery. These wines, once referred to as common, ordinárium, are now named after their respective grape varieties: Tokaji Furmint, Tokaji Hárslevelű, Tokaji Sárgamuskotály and Tokaji Kövérszőlő. - Szamorodni: This type of wine was initially known as főbor (prime wine), but from the 1820s Polish merchants popularised the name samorodny, (The word stems from Slovak, the Prekmurje dialect of Slovene, and Kajkavian Croatian, which used to be spoken before the hungarization of the Pannonian Basin. The word is an adjective and means \"self-grown\", \"the way it was grown\", or \"made by itself\"). What sets Szamorodni apart from ordinary wines is that it is made from bunches of grapes which contain a high proportion of botrytised grapes. Szamorodni is typically higher in alcohol than ordinary wine. Szamorodni often contains up to 100-120 g of residual sugar and thus is termed édes (sweet). However, when the bunches contain less botrytised grapes, the residual sugar content is much lower, resulting in a száraz (dry) wine. Its alcohol content is typically 14%. - Aszú: This is the world-famous sweet, topaz-colored wine known throughout the English-speaking world as Tokay.[5] The original meaning of the Hungarian word aszú was \"dried\", but the term aszú came to be associated with the type of wine made with botrytised (i.e. \"nobly\" rotten) grapes. The process of making Aszú wine is as follows:- Aszú berries are individually picked, then collected in huge vats and trampled into the consistency of paste (known as aszú dough). - Must or wine is poured on the aszú dough and left for 24–48 hours, stirred occasionally. - The wine is racked off into wooden casks or vats where fermentation is completed and the aszú wine is left to mature. The casks are stored in a cool environment, and are not tightly closed, so a slow fermentation process continues in the cask, usually for several years. - The concentration of aszú was traditionally defined by the number of puttony (large baskets, holding about 25 kilograms) of dough added to a Gönc cask (136 liter barrel) of must.[6] Nowadays the puttony number is based on the content of sugar and sugar-free extract in the mature wine. Aszú ranges from 3 puttonyos to 6 puttonyos, with a further category called Aszú-Eszencia representing wines above 6 puttonyos. Unlike most other wines, alcohol content of aszú typically runs higher than 14%. Annual production of aszú is less than one percent of the region's total output. - Eszencia: Also called nectar, this is often described as one of the most exclusive wines in the world, although technically it cannot even be called a wine because its enormous concentration of sugar means that its alcohol level never rises above 5-6 percent. Eszencia is the juice of aszú berries which runs off naturally from the vats in which they are collected during harvesting. The sugar concentration of eszencia is typically between 500 g and 700 g per litre, although the year 2000 vintage produced eszencia exceeding 900 g per liter.[7] Eszencia is traditionally added to aszú wines, but may be allowed to ferment (a process that takes at least 4 years to complete) and then bottled pure. The resulting wine has a concentration and intensity of flavor that is unequaled, but is so sweet that it can only be drunk in small quantities. Unlike virtually all other wines, Eszencia maintains its quality and drinkability when stored for 200 years or more. - Fordítás: (meaning \"turning over\" in Hungarian), wine made by pouring must on aszú dough which has already been used to make aszú wine. - Máslás: (derived from the word \"copy\" in Hungarian), wine made by pouring must on the lees of aszú. - Other sweet wines: In the past few years reductive sweet wines have begun to appear in Tokaj. These are ready for release a year to 18 months after harvest. They typically contain 50-180 g/L of residual sugar and a ratio of botrytised berries comparable to Aszú wines. They are usually labeled as késői szüretelésű (late harvest) wines. Innovative producers have also marketed tokaji wine that does not fit the appellation laws of the above categories but is often of high quality and price, and in many ways comparable to aszú. These wines are often labeled as tokaji cuvée. Imperial Tokay [edit]Prior to 1918 (the end of World War I and the fall of the Austro-Hungarian Empire), the finest eszencia Tokaji was not sold but was reserved for the Imperial cellars of the Habsburg monarchy.[8] By the mid 18th century these finest eszencia Tokaji originally held by the Habsburgs were called \"Imperial Tokay\". Cases, barrels, and bottles of it often passed between European monarchs as gifts. In 2008, a bottle of Imperial Tokay bearing the seal of the wine cellar of the Royal Saxon Court sold at auction at Christie's for £1,955.[9] History [edit]It is not known for how long vines have been grown on the volcanic soil of the fork of the rivers Bodrog and Hernád. This predates the settlement of the Magyar tribes to the region.[6] According to legend, the first aszú was made by Laczkó Máté Szepsi in 1630. However, mention of wine made from aszú grapes had already appeared in the Nomenklatura of Fabricius Balázs Sziksai which was completed in 1576. A recently discovered inventory of aszú predates this reference by five years. Tokaji wine became the subject of the world's first appellation control, established several decades before Port wine, and over 120 years before the classification of Bordeaux. Vineyard classification began in 1730 with vineyards being classified into three categories depending on the soil, sun exposure and potential to develop noble rot, botrytis cinerea, first class, second class and third class wines. A royal decree in 1757 established a closed production district in Tokaj. The classification system was completed by the national censuses of 1765 and 1772. In 1920, following the fall of the Austro-Hungarian Empire, a small part of the Tokaj wine region (approx. 1.75 km2) became part of Czechoslovakia due to the Treaty of Trianon, while the rest remained part of Hungary. After World War II, when Hungary became a Soviet-influenced state, Tokaji production continued with as many as 6,000 small producers, but the bottling and distribution were monopolized by the state-owned organization. Since the collapse of the communist regimes in 1990, a number of independent wineries have been established in the Tokaj wine region. A state-owned producer continues to exist and handles approximately 20% of the overall production. Famous consumers of Tokaji [edit]Voivode Stephen the Great of Moldavia was said to be a very big fan of Tokay wines. He introduced to Moldavia the Kövérszőlő cultivar, that lead to the development of Grasă de Cotnari wine.[10] Tokaji has since the 18th century been known as \"Vinum Regum, Rex Vinorum\" (\"Wine of Kings, King of Wines\"),[11] an epithet sometimes attributed to King Louis XIV of France. In 1703, Francis Rákóczi II, Prince of Transylvania, gave Louis XIV some Tokaji wine from his Tokaj estate as a gift. The Tokaji wine was served at the French Royal court at Versailles, where it became known as Tokay. Emperor Franz Josef (who was also King of Hungary) had a tradition of sending Queen Victoria Tokaji Aszú wine, as a gift, every year on her birthday, one bottle for every month she had lived, twelve for each year. On her eighty-first and final birthday (1900), this totaled an impressive 972 bottles. Tokaji wine has received accolades from numerous great writers and composers including Beethoven, Liszt, Schubert, Goethe, Heinrich Heine, Friedrich von Schiller, Bram Stoker, Johann Strauss II, and Voltaire. The composer Joseph Haydn's favorite wine was Tokaji. Besides Louis XIV, several other European monarchs are known to have been keen consumers of the wine. Louis XV and Frederick the Great tried to outdo one another when they treated guests such as Voltaire with Tokaji. Napoleon III, the last Emperor of the French, ordered 30–40 barrels of Tokaji at the French Royal Court every year. Pope Pius IV (1499–1565) at the Council of Trent in 1562, exclaimed: Summum pontificem talia vina decent! (This is the type of wine that should be on the papal table.) Gustav III, King of Sweden, loved Tokaji – it has been said he never had any other wine to drink. In Russia, customers included Peter the Great and Empress Elizabeth of Russia. A newspaper account of the 1933 wedding of Polish president Ignacy Mościcki notes that toasts were made with 250-year-old wines, and goes on to say \"The wine, if good, could only have been Essence of Tokay, and the centuries-old friendship between Poland and Hungary would seem to support this conclusion.\"[12] Grand Rabbi Shmuel Schneersohn of Lubavitch was known to drink Kosher Tokaji wines on celebratory occasions, such as on completion of his famous series of discourses titled \"Vekocho\" in the year 1878.[13] Other uses of the Tokaji appellation [edit]Tokaji wines have been famous for a long time, which has resulted in their name being \"adopted\" by other wines: - Historically Tokaji was a white wine from the region of Tokaj in the Kingdom of Hungary. Tokaji wine was mentioned as early as 1635 with reference to the sweet dessert aszú (botrytised) wine. Prior to the phylloxera epidemic in the 1880s, wine was grown in Tokaj from various types of mainly white grape varieties. In English and French the spelling \"Tokay\"[14] was commonly used. - Under Hungary's and Slovakia's accession treaty to the European Union, and an earlier 1993 agreement, the Tokaj name (including other forms of spelling) has been given Protected Designation of Origin status. From March 2007, wine producers in France and Italy have no longer been allowed to use the Tokay or Tocai name for their wines, which were made from two unrelated varieties. - The name Tokay came to be used in the Alsace region of France for wines made with the Pinot gris grape, typically as Tokay d'Alsace. Following the 1993 agreement, the name Tokay Pinot gris was adopted as an intermediate step, and by 2007 the use of the Tokay part was no longer allowed nor used. Many Alsace producers switched to the name Pinot gris several years before the deadline. - In Italy the name Tocai came to refer to the grape Sauvignon vert from the Friuli-Venezia Giulia region, under the designation Tocai Friulano. It is currently known simply as Friulano. - In Slovenia, in line with the EU prohibition, the wine of Goriška Brda and Vipava regions was renamed Sauvignonasse. - There has also been a long-running dispute between Hungary and Slovakia over the right to use the name Tokaj. Negotiations between the two governments resulted in an agreement being signed in June 2004. Under this agreement, wine produced on 5.65 km2 of land in Slovakia is allowed to use the Tokajský/-á/-é label.[2] However, a number of practical issues remain. Slovakia has pledged to introduce the same standards enshrined in Hungarian wine laws since 1990, but it has not yet been decided who will monitor or enforce those laws. In November 2012, the European Court ruled against Hungary's request to erase the Slovak entry \"Vinohradnícka oblasť Tokaj\" from \"E-Bacchus\", an electronic database containing a register of designations of origin and geographical indications protected in the EU. Hungary lodged an appeal against the judgement of the General Court. In February 2013, the EU Court of Justice has turned down the Hungarian appeal against an earlier ruling concerning Slovakia's registration of \"Vinohradnícka oblasť Tokaj\" (Tokaj Wine Region), which contains the name of Hungary's Tokaj region. In its ruling, the court said that Slovakia's registering its \"Vinohradnícka oblasť Tokaj\" in the European database E-Bachus did not constitute an actionable measure.[15] As a result, under the current EU legislation the wine-growing region of Tokaj is located in both Hungary and Slovakia. - The Rutherglen wine region in Australia produces a dessert wine made from Muscadelle grapes that has usually been referred to as Tokay, but which has little resemblance to the grapes or the processes of Hungarian Tokaji. Following a change in regulations in 2007, this variety of dessert wine has been sold under the name \"Topaque\"[16] by some wineries, but as of 2012 some others continue to label theirs Tokay. - Ukraine also produces wines labelled \"Tokay,\" which are generally produced in Transcarpathia. This wine is made from similar cultivars[17] is bottled in similar 500 mL bottles, but does not necessarily adhere to the same standards; this issue is being negotiated. In popular culture [edit]- In Goethe's Faust, in the scene in the Auerbach's Cellar, Mephistopheles offers the other characters a choice of any one wine each, which he then produces by boring holes in the table with a corkscrew. Frosch wishes for Rhine wine, Brander for Champagne, and Siebel wishes for a sweet wine, after which Mephistopheles chooses Tokay for him. - In the first chapter of Alexander Dumas' The Queen's Necklace (1849, 1850), the Marshal of Richelieu's butler makes him wait one hour for lunch, so he can offer a special tokaji wine bottle to the king of Sweden who, under the name Count of Haga, is one of the marshal's guest. - In Henrik Ibsen's The Wild Duck (1884), the guests at the party in act 1 drink Tokay. In the scene, the main character, Hjalmar Ekdal, is revealed to be quite ignorant of vintage differences of fine wines.[18] - In chapter four of Sir Arthur Conan Doyle's The Sign of the Four (1890), Thaddeus Sholto offers Miss Morstan Chianti or Tokay, as the only two refreshments he had on hand. - In Bram Stoker's Dracula (1897), Jonathan Harker is served a bottle of Tokay on his first night in Dracula's castle. - In another Sherlock Holmes story, \"His Last Bow\" (1917), the German spy Von Bork tells a confederate that \"Altamont\" (Holmes in disguise) had taken, \"a fancy to my Tokay\". Later, Holmes offers Watson a glass, saying, \"A remarkable wine, Watson. Our friend upon the sofa has assured me that it is from Franz Josef’s special cellar at the Schönbrunn Palace\".[19] - Imperial Tokay is served in Virginia Woolf's 1925 novel Mrs Dalloway. - A bottle of \"genuine imperial Tokay\" plays a prominent part in the Lord Peter Wimsey short story \"The Bibulous Business of a Matter of Taste\" (1928), which centers on identifying wines by taste. It is described as 'both sweet and coarse' and as 'horribly over-rated'. - The occult novel Moonchild, published in 1929 by the magician and writer Aleister Crowley, features a feast in Chapter IV with several rare wines, including \"a Tokay that really was Imperial\". - In H. Warner Allen's short story \"Tokay of the Comet Year\" (1930), a rare Tokay features prominently in a complex plot involving spies and a missing treaty. - Sniffing the aromatic essence of Tokaji, as well as its sympathetic effect upon being imbibed, serves as an important and amusing plot device in the 1936 novel My Talks with Dean Spanley, by Edward Plunkett, 18th Baron of Dunsany. The 2008 film adaptation of the novel, Dean Spanley also features this device. - In Jack Kerouac's 1952 poem \"October in the Railroad Earth\", Kerouac is described as enjoying \"a fifth of Tokay, no tea\" on the weekend when not working at the railyard. In Kerouac’s 1957 novel On the Road he writes, “Another hour it would come streaming through the Golden Gate to shroud the romantic city in white, and a young man would hold his girl by the hand and climb slowly up a long white sidewalk with a bottle of Tokay in his pocket.” - In Terry Gilliam's film The Adventures of Baron Munchausen (1988), the Baron and the Sultan make a wager over whether the Baron can obtain, from \"the imperial cellars at Vienna,\" a bottle of Tokaji superior to that proffered by the Sultan. - In Philip Pullman's novel Northern Lights (1995, also known as The Golden Compass), there is an attempted poisoning by the Master of Jordan College (the novel and television series) or an official of the Magisterium (the film) of one of the major characters, Lord Asriel, via a decanter of Tokaji (spelt 'Tokay') in the first chapter, titled \"The Decanter of Tokay\". Tokaji is said to be Lord Asriel's favorite wine. - In the eighth episode \"The Hobo Code\" (2007) of the American television series Mad Men, Don Draper argues with a beatnik. When the beatnik says advertising \"won't bring back those ten dead kids in Biloxi,\" Don replies that \"neither will buying some Tokaj wine and leaning up against a wall in Grand Central pretending you're a vagrant.\" - In Gaston Leroux's novel The Phantom of the Opera, the titular character Erik offers Christine Daae a meal consisting of Tokay during her first visit to his home beneath the Paris Opera House. - In the Traveller science fiction role-playing game Tokaj Escenzia (aka Tokaji Essencia) is considered such a fine wine that the entirety of Earth's production of it is reserved for the sole use of the Emperor of the interstellar Third Imperium. A famous event aboard an Azhanti High Lightning class cruiser involved an attempt to steal the Emperor's wine shipment. See also [edit]References [edit]- ^ \"Tokay\". Encyclopædia Britannica. Encyclopædia Britannica, Inc. 2008. Retrieved 2008-08-16. - ^ a b c \"A névért perelnék az uniót a tokaji gazdák\". Népszabadság (in Hungarian). 2008-08-02. Retrieved 2008-09-21. - ^ \"TOKAJI.com .::. Types of Tokaji\". www.tokaji.com. Retrieved 2 June 2017. - ^ Vrontis, Demetris; Thrassou, Alkis (2011). \"The Renaissance of Commandaria- A Strategic Branding Prescriptive Analysis\" (PDF). School of Business, University of Nicosia. academia.edu/. J. Global Business Advancement, Vol. 4, No. 4. pp. 302–316. Archived from the original (PDF) on 4 March 2016. Retrieved 16 February 2022. - ^ “A rich, sweet, moderately strong wine of a topaz color, produced in the vicinity of Tokay, in Hungary; also, a similar wine produced elsewhere.” Webster’s New International Dictionary of the English Language (Springfield, Mass.: G.&C. Merriam, 1913). See Tokay at p. 2166. - ^ a b Lichine, Alexis (1987). Alexis Lichine's New Encyclopedia of Wines & Spirits (5th ed.). New York: Alfred A. Knopf. pp. 497–499. - ^ \"Sweet Wines 101 - Wine Basics - Learn Wine - Wine Spectator\". Retrieved 2 June 2017. - ^ Chambers's Encyclopaedia, Volume 13. Oxford University Press. 1950. p. 667. The wine not only retains its sweet taste without any brandy being added to it to check the fermentation, but it goes on improving for many years, longer by far than any other unfortified wine. This, however, only applies to the best wine of Tokay (Tokaj), Tokay Essencia. Before 1918 the finest Tokay Essencia was never sold but reserved for the Imperial cellars of the Habsburgs; hence its name of Imperial Tokay. Next in order of excellence come the Tokay Aszu, also called Tokay Ausbruch and the Tokay Szamorodner. - ^ \"Imperial Tokay--Mid-Eighteenth Century\". Christie's. 11 December 2008. Retrieved 31 December 2017. - ^ \"VITICULTURĂ ROMÂNEASCĂ: Grasă de Cotnari, soiul adus de Ștefan cel Mare (1457-1504) din Transilvania – AGERPRES\". Archived from the original on 31 December 2017. Retrieved 2 June 2017. - ^ Bori, Istvan, ed. (2012). The Essential Guide to Being Hungarian: 50 Facts and Facets of Nationhood. Steerforth Press. ISBN 9780982578162. - ^ \"Tokaj Wine Region\". Discover Slovakia with Branio and his team. Retrieved 2 June 2017. - ^ Diary of the Lubavitcher Rebbe Shlito [Reshimas Hayoman p. 358, Hemshech 5666 p. 747]. - ^ \"Alsace Tokay Pinot Gris Wine\". www.terroir-france.com. Retrieved 2 June 2017. - ^ \"European Commission - PRESS RELEASES - Press release - The Court of Justice declares that the listing of the Slovak wine name 'Vinohradnícka oblasť Tokaj' in the E-Bacchus register of protected designations of origin does not constitute an actionable measure\". europa.eu. Retrieved 2 June 2017. - ^ \"Rutherglen: What is Topaque?\". Retrieved 2 June 2017. - ^ \"Tokaji wine Transcarpathia Ukraina - Sök på Google\". www.google.se. Retrieved 2 June 2017. - ^ Project Gutenberg e-book: https://gutenberg.org/cache/epub/13041/pg13041.html#id00167. Accessed on 10 September 2021. - ^ Arthur Conan Doyle, \"His Last Bow\". Project Gutenberg e-book: http://www.gutenberg.org/files/2350/2350-h/2350-h.htm. Accessed 1 February 2016. Further reading [edit]- Lambert-Gócs, Miles. Tokaji Wine: Fame, Fate, Tradition. Board and Bench Publishing, 2010, ISBN 978-1934259498 - Alkonyi, Laszló. Tokaj - The Wine of Freedom, Budapest, 2000 - Grossman, Harold J. & Lembeck, Harriet. Grossman's Guide to Wines, Beers and Spirits (6th edition). Charles Scribner's Sons, New York, 1977, p. 172–174. ISBN 0-684-15033-6 - Terra Benedicta - Tokaj and Beyond (Gábor Rohály, Gabriella Mészáros, András Nagymarosy, Budapest 2003) - \"Tradition and Innovation in the Tokaj Region\" (PDF). (328 KB) Tim Atkin, MW. masters-of-wine.org - \"Slovakia, a Land of Wine\" (PDF). (328 KB) Slovak Union of Grape and Wine Producers. pp. 21–23. www.slovakia.travel External links [edit]- Media related to Wines of Tokaj at Wikimedia Commons"
}