{
  "url": "https://www.thefreedictionary.com/just",
  "title": "Just - definition of just by The Free Dictionary",
  "text": "just Also found in: Thesaurus, Legal, Acronyms, Idioms, Encyclopedia, Wikipedia. just 1 (jŭst)adj. 1. Honorable and fair in one's dealings and actions: a just ruler. See Synonyms at fair1. 2. Consistent with what is morally right; righteous: a just cause. 3. Properly due or merited: just deserts. 4. Law Valid within the law; lawful: just claims. 5. Suitable or proper in nature; fitting: a just touch of solemnity. 6. Based on fact or sound reason; well-founded: a just appraisal. adv. (jəst, jĭst; jŭst when stressed) Idioms: 1. Precisely; exactly: just enough salt. 2. Only a moment ago: He just arrived. 3. By a narrow margin; barely: just missed being hit; just caught the bus before it pulled away. 4. At a little distance: just down the road. 5. Merely; only: just a scratch. 6. Simply; certainly: It's just beautiful! 7. Perhaps; possibly: I just may go. just about Almost; very nearly: This job is just about done. just now Only a moment ago. just′ly adv. just′ness n. just 2 (jŭst)n. & v. Variant of joust. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. just adj 1. a. fair or impartial in action or judgment b. (as collective noun; preceded by the): the just. 2. conforming to high moral standards; honest 3. consistent with justice: a just action. 4. rightly applied or given; deserved: a just reward. 5. (Law) legally valid; lawful: a just inheritance. 6. well-founded; reasonable: just criticism. 7. correct, accurate, or true: a just account. adv 8. used with forms of have to indicate an action performed in the very recent past: I have just closed the door. 9. at this very instant: he's just coming in to land. 10. no more than; merely; only: just an ordinary car. 11. exactly; precisely: that's just what I mean. 12. by a small margin; barely: he just got there in time. 13. (intensifier): it's just wonderful to see you. 14. informal indeed; with a vengeance: isn't it just. 15. just about a. at the point of starting (to do something) b. very nearly; almost: I've just about had enough. 16. just a moment just a second just a minute an expression requesting the hearer to wait or pause for a brief period of time 17. just now a. a very short time ago b. at this moment c. South African informal in a little while 18. just on having reached exactly: it's just on five o'clock. 19. just so a. an expression of complete agreement or of unwillingness to dissent b. arranged with precision [C14: from Latin jūstus righteous, from jūs justice] ˈjustly adv ˈjustness n Usage: The use of just with exactly (it's just exactly what they want) is redundant and should be avoided: it's exactly what they want Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 just1 (dʒʌst)adv. 1. within a brief preceding time; but a moment before: The sun just came out. 2. exactly or precisely: That's just what I mean. 3. by a narrow margin; barely: just over six feet tall. 4. only or merely: I was just a child. Don't just sit there. 5. at this moment: The movie is just ending. 6. simply: We'll just have to wait and see. 7. quite; really; positively. adj. 8. guided by reason, justice, and fairness. 9. done or made according to principle; equitable: a just reply. 10. based on right; lawful: a just claim. 11. in keeping with truth or fact; true; correct: a just analysis. 12. given or awarded rightly; deserved: a just punishment. 13. in accordance with standards or requirements; proper or right: just proportions. 14. (esp. in Biblical use) righteous. 15. actual, real, or genuine. [1325–75; Middle English < Latin jūstus lawful, deserved, just, adj. derivative of jūs law, right] just′ly, adv. just′ness, n. just2 (dʒʌst)n., v.i. just′er, n. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. just You use just to say that something happened a very short time ago. British speakers usually use the present perfect with just. For example, they say 'I've just arrived'. I've just bought a new house. American speakers usually use the past simple. Instead of saying 'I've just arrived', they say 'I just arrived'. His wife just died. I just broke the pink bowl. Some British speakers also use the past simple, but in Britain this use is usually regarded as incorrect. Be Careful! Don't use 'just' with adverbs such as partly to give the meaning 'not completely'. Don't say, for example, 'The job is just partly done'. You say 'The job is only partly done'. He was only partially successful. The bus was only half full. Collins COBUILD English Usage © HarperCollins Publishers 1992, 2004, 2011, 2012 ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. just adverb 3. barely, hardly, only just, scarcely, at most, by a whisker, at a push, by the skin of your teeth He could just reach the man's head with his right hand. 4. exactly, really, quite, completely, totally, perfectly, entirely, truly, absolutely, precisely, altogether, positively Kiwi fruit are just the thing for a healthy snack. adjective 1. fair, good, legitimate, honourable, right, square, pure, decent, upright, honest, equitable, righteous, conscientious, impartial, virtuous, lawful, blameless, unbiased, fair-minded, unprejudiced She fought honestly for a just cause and for freedom. fair unfair, prejudiced, corrupt, unlawful, unjust, dishonest, devious, inequitable fair unfair, prejudiced, corrupt, unlawful, unjust, dishonest, devious, inequitable 2. fitting, due, correct, deserved, appropriate, justified, reasonable, suitable, decent, sensible, merited, proper, legitimate, desirable, apt, rightful, well-deserved, condign This cup final is a just reward for all the efforts they have put in. fitting inappropriate, unreasonable, unfit, undeserved fitting inappropriate, unreasonable, unfit, undeserved Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 just adjective1. Free from bias in judgment: disinterested, dispassionate, equitable, fair, fair-minded, impartial, indifferent, nonpartisan, objective, square, unbiased, unprejudiced. Idiom: fair and square. 2. Consistent with prevailing or accepted standards or circumstances: 3. Based on good judgment, reasoning, or evidence: 2. With precision or absolute conformity: bang, dead, direct, directly, exactly, fair, flush, precisely, right, smack, square, squarely, straight. Slang: smack-dab. 3. To the fullest extent: absolutely, all, altogether, completely, dead, entirely, flat, fully, perfectly, quite, thoroughly, totally, utterly, well, wholly. Idioms: in toto, through and through. The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations الآن، في هذه اللحْظَهبِالكاد، في آخر ثانيَهبصورةٍ مُطْلَقَه، تَماماتُسْتَعْمَل للتوكيدتماما عندما، في اللحْظَةِ التي právěprávě takprávě ve chvílipřed chvilkoupřesně ligelige netopnetopretfærdigvelfortjent nur kõigest juurituskinvain upravo aîeins; baraeinmitt, rétt eins og, nákvæmlegaí òann mund aî, rétt í òessunákvæmlega á òeirri stunduöldungis たった今 방금 acumirkli!nupatpamatotspareizspašreiz doar prostozaslúžený komajpravičenpravkarravnosamo samoskorotek barajustprecisrättvis เพิ่ง mới vừa just 1 [dʒʌst]A. ADJ B. NPL the just → los justos just 2 [dʒʌst] ADVERB1. (relating to time) 1.1. (= at this moment) → ahora mismo we're just off → nos vamos ahora mismo I'm just coming! → ¡ya voy! \"have some tea!\" - \"actually, I was just going\" → -tómate un té -en realidad ya me iba we're just off → nos vamos ahora mismo I'm just coming! → ¡ya voy! \"have some tea!\" - \"actually, I was just going\" → -tómate un té -en realidad ya me iba 1.2. (= at that moment) → justo he was just leaving when the phone rang → estaba justo saliendo cuando sonó el teléfono he was just leaving when the phone rang → estaba justo saliendo cuando sonó el teléfono 1.3. (= recently, a moment ago) we were just talking about that → precisamente or ahora mismo estábamos hablando de eso just cooked → recién hecho it's just gone 10 o'clock → acaban de dar las diez to have just done sth → acabar de hacer algo he has just left → acaba de irse he had just left → acababa de irse just married → recién casados the book is just out → el libro acaba de salir it's just past 10 o'clock → acaban de dar las diez just cooked → recién hecho it's just gone 10 o'clock → acaban de dar las diez to have just done sth → acabar de hacer algo he has just left → acaba de irse he had just left → acababa de irse just married → recién casados the book is just out → el libro acaba de salir it's just past 10 o'clock → acaban de dar las diez 1.4. (in expressions specifying \"when\") just after I arrived → poco después de mi llegada just after Christmas → justo después de Navidad it's just after 9 o'clock → son las nueve un poco pasadas just as I arrived → justo cuando yo llegaba just as it started to rain → justo cuando empezó a llover, en el momento en que empezó a llover just before I arrived → poco antes de mi llegada just before Christmas → justo antes de Navidad I saw him just this minute → lo he visto hace un momento I've just this minute finished it → acabo de terminarlo en este momento just at that moment → en ese mismo momento or instante just this morning → esta misma mañana just when it was going well → precisamente or justamente cuando iba bien ... just yesterday → ayer mismo \"are you leaving?\" - \"not just yet\" → -¿te vas? -aún or todavía no see also now A6 see also recently 2 see also then A1 just after I arrived → poco después de mi llegada just after Christmas → justo después de Navidad it's just after 9 o'clock → son las nueve un poco pasadas just as I arrived → justo cuando yo llegaba just as it started to rain → justo cuando empezó a llover, en el momento en que empezó a llover just before I arrived → poco antes de mi llegada just before Christmas → justo antes de Navidad I saw him just this minute → lo he visto hace un momento I've just this minute finished it → acabo de terminarlo en este momento just at that moment → en ese mismo momento or instante just this morning → esta misma mañana just when it was going well → precisamente or justamente cuando iba bien ... just yesterday → ayer mismo \"are you leaving?\" - \"not just yet\" → -¿te vas? -aún or todavía no see also now A6 see also recently 2 see also then A1 2. (= barely) → por poco we (only) just missed it → lo perdimos por muy poco I (only) just caught it → lo alcancé por un pelo → por poco lo pierdo we had just enough money → teníamos el dinero justo he missed the train, but only just → perdió el tren, pero por poco he passed, but only just → aprobó pero por los pelos we arrived just in time → por poco no llegamos → llegamos justo a tiempo we (only) just missed it → lo perdimos por muy poco I (only) just caught it → lo alcancé por un pelo → por poco lo pierdo we had just enough money → teníamos el dinero justo he missed the train, but only just → perdió el tren, pero por poco he passed, but only just → aprobó pero por los pelos we arrived just in time → por poco no llegamos → llegamos justo a tiempo 3. (= slightly) just over/under two kilos → un poco más de/menos de dos kilos it's just over/under two kilos → pasa de/no llega a los dos kilos just to the left/right → un poco más a la izquierda/derecha just to one side → a un lado just over/under two kilos → un poco más de/menos de dos kilos it's just over/under two kilos → pasa de/no llega a los dos kilos just to the left/right → un poco más a la izquierda/derecha just to one side → a un lado 4. (= exactly) → justo, exactamente it's just my size → es justo or exactamente mi talla it's just the same → es justo or exactamente igual just here/there → aquí/ahí mismo just behind/in front of/next to → justo detrás/delante de/al lado de it's just (on) 10 (o'clock) → son las diez en punto it cost just (on) £20 → me costó veinte libras justas just how many we don't know → no sabemos exactamente cuántos that's just it! → ¡ahí está!, ¡ésa es la cuestión! he's just like his father (physically, in behaviour) → es idéntico a su padre that's just like him, always late → es típico (de él), siempre llega tarde they are just like brothers → son como hermanos they have their problems just like the rest of us → tienen sus problemas, exactamente igual que el resto de nosotros I can't find £1,000 just like that → no puedo conseguir mil libras así sin más that's just the point! → ¡ahí está!, ¡ésa es la cuestión! he likes everything just so → le gusta que todo esté perfecto it's just what I wanted → es justo or precisamente lo que quería that's just what I thought → eso es justo or precisamente lo que pensé just what did he say? → ¿qué dijo exactamente? just what are you implying? → ¿qué es exactamente lo que estás insinuando? see also luck A see also right A2 it's just my size → es justo or exactamente mi talla it's just the same → es justo or exactamente igual just here/there → aquí/ahí mismo just behind/in front of/next to → justo detrás/delante de/al lado de it's just (on) 10 (o'clock) → son las diez en punto it cost just (on) £20 → me costó veinte libras justas just how many we don't know → no sabemos exactamente cuántos that's just it! → ¡ahí está!, ¡ésa es la cuestión! he's just like his father (physically, in behaviour) → es idéntico a su padre that's just like him, always late → es típico (de él), siempre llega tarde they are just like brothers → son como hermanos they have their problems just like the rest of us → tienen sus problemas, exactamente igual que el resto de nosotros I can't find £1,000 just like that → no puedo conseguir mil libras así sin más that's just the point! → ¡ahí está!, ¡ésa es la cuestión! he likes everything just so → le gusta que todo esté perfecto it's just what I wanted → es justo or precisamente lo que quería that's just what I thought → eso es justo or precisamente lo que pensé just what did he say? → ¿qué dijo exactamente? just what are you implying? → ¿qué es exactamente lo que estás insinuando? see also luck A see also right A2 5. (= only) → sólo, nomás (LAm) they were just 15 when they got married → tenían sólo or nada más 15 años cuando se casaron he's just a lad → no es más que un chaval → es sólo un chaval it's just a mouse → es sólo un ratón don't take any notice of her, she's just jealous → no le hagas ni caso, lo que está es celosa or lo que pasa es que está celosa it's just around the corner → está a la vuelta de la esquina I just asked! (hum) → ¡preguntaba nada más! just a few → sólo unos pocos, unos pocos nada más just a little → sólo un poco, un poco nada más just once → una vez nada más → solamente una vez it's just over there → está ahí mismo it's just a suggestion → es sólo una sugerencia he's just teasing → sólo está bromeando, está bromeando, nada más just this once → sólo esta vez we went just to see the museum → fuimos sólo para ver el museo just the two of us → los dos solos → sólo nosotros dos I just wanted to say that → sólo quería decir que ... see also friend, note A3 they were just 15 when they got married → tenían sólo or nada más 15 años cuando se casaron he's just a lad → no es más que un chaval → es sólo un chaval it's just a mouse → es sólo un ratón don't take any notice of her, she's just jealous → no le hagas ni caso, lo que está es celosa or lo que pasa es que está celosa it's just around the corner → está a la vuelta de la esquina I just asked! (hum) → ¡preguntaba nada más! just a few → sólo unos pocos, unos pocos nada más just a little → sólo un poco, un poco nada más just once → una vez nada más → solamente una vez it's just over there → está ahí mismo it's just a suggestion → es sólo una sugerencia he's just teasing → sólo está bromeando, está bromeando, nada más just this once → sólo esta vez we went just to see the museum → fuimos sólo para ver el museo just the two of us → los dos solos → sólo nosotros dos I just wanted to say that → sólo quería decir que ... see also friend, note A3 6. (= simply) → sencillamente I just told him to go away → le dije sencillamente que se fuera just ask the way → simplemente pregunta por dónde se va I'm just phoning to remind you that → sólo llamo para recordarte que ... let's just wait and see → es mejor esperar a ver (qué pasa) you should just send it back → deberías devolverlo sin más he just couldn't wait to see them → tenía unas ganas enormes de verlos it's just one of those things → son cosas que pasan it's just that I don't like it → lo que pasa es que no me gusta I just thought that you would like it → yo pensé que te gustaría see also because A see also imagine 1, 2 see also wonder B I just told him to go away → le dije sencillamente que se fuera just ask the way → simplemente pregunta por dónde se va I'm just phoning to remind you that → sólo llamo para recordarte que ... let's just wait and see → es mejor esperar a ver (qué pasa) you should just send it back → deberías devolverlo sin más he just couldn't wait to see them → tenía unas ganas enormes de verlos it's just one of those things → son cosas que pasan it's just that I don't like it → lo que pasa es que no me gusta I just thought that you would like it → yo pensé que te gustaría see also because A see also imagine 1, 2 see also wonder B 8. (= conceivably) it may just be possible → puede que sea posible it's an old trick, but it could just work → es un viejo truco, pero puede que funcione it's an old trick, but it could just work → es un viejo truco, pero puede que funcione 9. (in comparisons) just as → tan it's just as good as yours → es tan bueno como el tuyo you sing just as well as he does → cantas tan bien como él the new one is just as big → el nuevo es igual de grande this model goes just as fast → este modelo va igual de rápido just as → tan it's just as good as yours → es tan bueno como el tuyo you sing just as well as he does → cantas tan bien como él the new one is just as big → el nuevo es igual de grande this model goes just as fast → este modelo va igual de rápido 10. (in imperatives) just let me get my hands on him! → ¡cómo lo coja!, ¡con que lo agarre! (LAm) just listen to that rain! → ¡escucha or fíjate cómo llueve! just listen a minute, will you? → ¡escúchame un momento!, ¿quieres? just look at this mess! → ¡fíjate qué desorden! just wait a minute! → ¡espera un momento! just you wait, he'll come sure enough (reassuringly) → espera hombre, ya verás cómo viene just (you) wait until I tell your father (threateningly) → ya verás cuando se lo cuente a tu padre, espera (nomás (LAm)) a que se lo cuente a tu padre just you do! just you try it! just you dare! → ¡inténtalo si te atreves! just let me get my hands on him! → ¡cómo lo coja!, ¡con que lo agarre! (LAm) just listen to that rain! → ¡escucha or fíjate cómo llueve! just listen a minute, will you? → ¡escúchame un momento!, ¿quieres? just look at this mess! → ¡fíjate qué desorden! just wait a minute! → ¡espera un momento! just you wait, he'll come sure enough (reassuringly) → espera hombre, ya verás cómo viene just (you) wait until I tell your father (threateningly) → ya verás cuando se lo cuente a tu padre, espera (nomás (LAm)) a que se lo cuente a tu padre just you do! just you try it! just you dare! → ¡inténtalo si te atreves! 11. (emphatic) she's just amazing! → es una mujer increíble \"that dress is awful\" - \"isn't it just?\" → -ese vestido es francamente horrible -¡y tanto! we're managing just fine → nos apañamos perfectamente it's just perfect! → ¡es absolutamente perfecto! see also plain A3, B1 \"that dress is awful\" - \"isn't it just?\" → -ese vestido es francamente horrible -¡y tanto! we're managing just fine → nos apañamos perfectamente it's just perfect! → ¡es absolutamente perfecto! see also plain A3, B1 12. (imagining something) I can just hear the roars of laughter → me puedo imaginar muy bien or perfectamente las carcajadas I can just imagine her reaction → me imagino muy bien or perfectamente su reacción I can just see her face if I told her → me puedo imaginar muy bien or perfectamente la cara que pondría si se lo dijese I can just hear the roars of laughter → me puedo imaginar muy bien or perfectamente las carcajadas I can just imagine her reaction → me imagino muy bien or perfectamente su reacción I can just see her face if I told her → me puedo imaginar muy bien or perfectamente la cara que pondría si se lo dijese 13. (in set expressions) just about I've just about finished this work → estoy a punto de terminar este trabajo it's just about finished → está casi terminado I think that it was just about here that I saw him → creo que yo estaba más o menos aquí cuando lo vi I've just about had enough of this noise! → ¡estoy ya más que harto de este ruido! to be just about to do sth → estar a punto de hacer algo I was just about to phone → estaba a punto de llamar come just as you are → ven tal como estás leave it just as it is → déjalo tal como está just as you wish → como usted quiera just as I thought! → ¡ya me lo figuraba or imaginaba!, ¡lo que yo me figuraba or imaginaba! just in case → por si acaso just in case it rains → por si acaso llueve, por si llueve I've prepared some extra food, just in case → he preparado comida de más, por si las moscas or por si acaso just a minute!, just one moment! (= coming) → ¡un momento, por favor! → ¡voy! just a minute, I don't know if I agree with that → un momento, no sé si estoy de acuerdo con eso ... just the same, I'd rather → de todas formas, prefiero ... that's just too bad! (iro) → ¡qué lástima!, ¡qué mala pata! it's just as well → menos mal it's just as well it's insured → menos mal que está asegurado I wasn't expecting much, which was just as well → no esperaba mucho, y menos mal it would be just as well if we checked the prices → más valdría que comprobásemos los precios see also happen 2 see also soon 4 just about I've just about finished this work → estoy a punto de terminar este trabajo it's just about finished → está casi terminado I think that it was just about here that I saw him → creo que yo estaba más o menos aquí cuando lo vi I've just about had enough of this noise! → ¡estoy ya más que harto de este ruido! to be just about to do sth → estar a punto de hacer algo I was just about to phone → estaba a punto de llamar come just as you are → ven tal como estás leave it just as it is → déjalo tal como está just as you wish → como usted quiera just as I thought! → ¡ya me lo figuraba or imaginaba!, ¡lo que yo me figuraba or imaginaba! just in case → por si acaso just in case it rains → por si acaso llueve, por si llueve I've prepared some extra food, just in case → he preparado comida de más, por si las moscas or por si acaso just a minute!, just one moment! (= coming) → ¡un momento, por favor! → ¡voy! just a minute, I don't know if I agree with that → un momento, no sé si estoy de acuerdo con eso ... just the same, I'd rather → de todas formas, prefiero ... that's just too bad! (iro) → ¡qué lástima!, ¡qué mala pata! it's just as well → menos mal it's just as well it's insured → menos mal que está asegurado I wasn't expecting much, which was just as well → no esperaba mucho, y menos mal it would be just as well if we checked the prices → más valdría que comprobásemos los precios see also happen 2 see also soon 4 Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 just [ˈdʒʌst](STRONG) [ˈdʒəst] adj adv (= a short time ago) to have just done sth → venir de faire qch He's just done it → Il vient de le faire. She's just arrived → Elle vient d'arriver. He's just left → Il vient de partir. just now (= a short time ago) I did it just now → Je viens de le faire. She was here just now → Elle était là il y a une minute. He's just done it → Il vient de le faire. She's just arrived → Elle vient d'arriver. He's just left → Il vient de partir. just now (= a short time ago) I did it just now → Je viens de le faire. She was here just now → Elle était là il y a une minute. (= at this time) → à l'instant I'm just finishing this → Je le finis à l'instant. just now (= at the moment) → pour l'instant I'm rather busy just now → Je suis assez occupé pour l'instant. not just now → pas tout de suite I'm just finishing this → Je le finis à l'instant. just now (= at the moment) → pour l'instant I'm rather busy just now → Je suis assez occupé pour l'instant. not just now → pas tout de suite (= very soon) I'm just going to do it → Je vais le faire tout de suite. I'm just coming! → J'arrive! to be just about to do sth (= on the point of doing) → être sur le point de faire qch I was just about to phone → J'étais sur le point de téléphoner. I'm just going to do it → Je vais le faire tout de suite. I'm just coming! → J'arrive! to be just about to do sth (= on the point of doing) → être sur le point de faire qch I was just about to phone → J'étais sur le point de téléphoner. (= at that moment) we were just going, when ... → nous partions juste quand ... just as he was leaving → juste au moment où il partait just as he was leaving → juste au moment où il partait (with imperative) (= simply) → simplement, juste If you need help, just ask! → Si vous avez besoin d'aide, demandez tout simplement! Just ask someone the way → Demandez tout simplement votre chemin à quelqu'un. Just listen to this! BUT Écoutez un peu ça!. just a minute! (asking someone to wait) → une minute! just one moment! → un instant!, un instant s'il vous plaît! If you need help, just ask! → Si vous avez besoin d'aide, demandez tout simplement! Just ask someone the way → Demandez tout simplement votre chemin à quelqu'un. Just listen to this! BUT Écoutez un peu ça!. just a minute! (asking someone to wait) → une minute! just one moment! → un instant!, un instant s'il vous plaît! (emphatic) (= absolutely) (+ adj) → absolument, complètement That's just stupid! → C'est complètement stupide! She just won't relax BUT Elle refuse tout bonnement de se détendre. That's just stupid! → C'est complètement stupide! She just won't relax BUT Elle refuse tout bonnement de se détendre. (= only) → juste just one → juste un(e) I just want ... → je veux juste ... don't do it just because → ne le faites pas juste parce que ... it's just that ... → c'est juste que ... it's just a ... (= no more than) → ce n'est que ... It's just a suggestion → Ce n'est qu'une suggestion. It's just a mistake → Ce n'est (rien) qu'une erreur. just one → juste un(e) I just want ... → je veux juste ... don't do it just because → ne le faites pas juste parce que ... it's just that ... → c'est juste que ... it's just a ... (= no more than) → ce n'est que ... It's just a suggestion → Ce n'est qu'une suggestion. It's just a mistake → Ce n'est (rien) qu'une erreur. (= immediately) → juste just before → juste avant just after → juste après just after Christmas → juste après Noël He arrived just after you called → Il est arrivé juste après que tu aies appelé. just before → juste avant just after → juste après just after Christmas → juste après Noël He arrived just after you called → Il est arrivé juste après que tu aies appelé. (= exactly) → exactement, juste That's just what I wanted to hear → C'est juste ce que je voulais entendre. just how much? → combien exactement?, combien au juste? to be just like sb/sth → être exactement comme qn/qch just as I expected → exactement comme je m'y attendais, précisément comme je m'y attendais just so! (British) (old-fashioned) → exactement! just so (= exactly as it should be) She wants everything just so → Il faut que tout soit impeccable pour elle. just right adj → parfait(e) It's just right → C'est parfait. just two o'clock → exactement deux heures, juste deux heures just in time → juste à temps just here → ici just the ... [+ person, place, thing] He knew just the place → Il connaissait l'endroit idéal. That's just what I wanted to hear → C'est juste ce que je voulais entendre. just how much? → combien exactement?, combien au juste? to be just like sb/sth → être exactement comme qn/qch just as I expected → exactement comme je m'y attendais, précisément comme je m'y attendais just so! (British) (old-fashioned) → exactement! just so (= exactly as it should be) She wants everything just so → Il faut que tout soit impeccable pour elle. just right adj → parfait(e) It's just right → C'est parfait. just two o'clock → exactement deux heures, juste deux heures just in time → juste à temps just here → ici just the ... [+ person, place, thing] He knew just the place → Il connaissait l'endroit idéal. (= only just) (with verb) → tout juste I just managed to crawl through the hole → Je parvins tout juste à passer dans le trou en rampant. He could just reach it → Il pouvait tout juste l'atteindre. She just caught the train BUT Elle a attrapé son train de justesse. to just miss sth [+ target] He just missed → Il a échoué de peu. (= avoid crashing into) He just missed the wall → Il a évité le mur de justesse. just about (= more or less) → à peu près We can just about get there in time → Nous pouvons y arriver à peu près à temps. It's just about big enough BUT C'est tout juste assez grand. I just managed to crawl through the hole → Je parvins tout juste à passer dans le trou en rampant. He could just reach it → Il pouvait tout juste l'atteindre. She just caught the train BUT Elle a attrapé son train de justesse. to just miss sth [+ target] He just missed → Il a échoué de peu. (= avoid crashing into) He just missed the wall → Il a évité le mur de justesse. just about (= more or less) → à peu près We can just about get there in time → Nous pouvons y arriver à peu près à temps. It's just about big enough BUT C'est tout juste assez grand. (= only just) (with adj) Her hand was just visible → Sa main était à peine visible. just enough adv → juste assez; prep → juste assez de We had just enough money → Nous avions juste assez d'argent. just enough time → juste assez de temps Her hand was just visible → Sa main était à peine visible. just enough adv → juste assez; prep → juste assez de We had just enough money → Nous avions juste assez d'argent. just enough time → juste assez de temps (= slightly) just under an hour → un peu moins d'une heure just over an hour → un peu plus d'une heure just over an hour → un peu plus d'une heure (= equally) It's just as good → C'est (vraiment) aussi bon. She's just as clever as you → Elle est tout aussi intelligente que toi. It's just as good → C'est (vraiment) aussi bon. She's just as clever as you → Elle est tout aussi intelligente que toi. to be just as well (= lucky) It's just as well that you → Heureusement que vous ... It's just as well that you → Heureusement que vous ... Collins English/French Electronic Resource. © HarperCollins Publishers 2005 just 1adv (immediate past) → gerade, (so)eben; they have just left → sie sind gerade or (so)eben gegangen; she left just before I came → sie war, gerade or kurz bevor ich kam, weggegangen; he’s just been appointed → er ist gerade or eben erst ernannt worden; I met him just after lunch → ich habe ihn direkt or gleich nach dem Mittagessen getroffen (= at this/that very moment) → gerade; hurry up, he’s just going → beeilen Sie sich, er geht gerade; he’s just coming → er kommt gerade or eben; I’m just coming → ich komme ja schon; I was just going to … → ich wollte gerade …; just as I was going → genau in dem Moment or gerade, als ich gehen wollte (= barely, almost not) → gerade noch, mit knapper Not; he (only) just escaped being run over → er wäre um ein Haar überfahren worden; it just missed → es hat fast or beinahe getroffen; I’ve got only just enough to live on → mir reicht es gerade so or so eben noch zum Leben; I arrived just in time → ich bin gerade (noch) rechtzeitig gekommen (= exactly) → genau, gerade; it is just five o’clock → es ist genau fünf Uhr; that’s just like you → das sieht dir ähnlich; it’s just on nine o’clock → es ist gerade neun Uhr; it happened just as I expected → es passierte genau so, wie ich es erwartet hatte; it’s just because of that that he insists → gerade or eben deshalb besteht er darauf; that’s just it! → das ists ja gerade or eben!; that’s just what I was going to say → genau das wollte ich (auch) sagen; just what do you mean by that? → was wollen Sie damit sagen?; just what does this symbol mean? → was bedeutet dieses Zeichen genau?; it was just there → genau da war es; just so! (old) → genau, ganz recht; everything has to be just so → es muss alles seine Ordnung haben (= only, simply) → nur, bloß; I can stay just a minute → ich kann nur or bloß eine Minute bleiben; just you and me → nur wir beide, wir beide allein; this is just to show you how it works → dies soll Ihnen lediglich zeigen, wie es funktioniert; this is just to confirm … → hiermit bestätigen wir, dass …; he’s just a boy → er ist doch noch ein Junge; why don’t you want to/like it? — I just don’t → warum willst du nicht/magst du es nicht? — ich will/mags eben or halt (inf) → nicht; just like that → (ganz) einfach so; I don’t know, I just don’t → ich weiß (es) nicht, beim besten Willen nicht; you can’t just assume … → Sie können doch nicht ohne weiteres annehmen …; it’s just not good enough → es ist einfach nicht gut genug; I just prefer it this way → ich finds eben or einfach besser so (= a small distance: with position) → gleich; just round the corner → gleich um die Ecke; just above the trees → direkt über den Bäumen; put it just over there → stells mal da drüben hin; just here → (genau) hier (= absolutely) → einfach, wirklich; it was just fantastic → es war einfach prima; it’s just terrible → das ist ja schrecklich! just as → genauso, ebenso; the blue hat is just as nice as the red one → der blaue Hut ist genauso hübsch wie der rote; she didn’t understand you — it’s just as well! → sie hat Sie nicht verstanden — das ist vielleicht auch besser so; it’s just as well you stayed at home, you didn’t miss anything → es macht nichts, dass Sie zu Hause geblieben sind, Sie haben nichts verpasst; it’s just as well you didn’t go out → nur gut, dass Sie nicht weggegangen sind; it would be just as well if you came → es wäre doch besser, wenn Sie kämen; come just as you are → kommen Sie so, wie Sie sind; it’s just as you please → wie Sie wollen; just as I thought! → ich habe es mir doch gedacht! just about → in etwa, so etwa; I am just about ready → ich bin so gut wie fertig; it’s just about here → es ist (so) ungefähr hier; did he make it in time? — just about → hat ers (rechtzeitig) geschafft? — so gerade; will this do? — just about → ist das recht so? — so in etwa; I am just about fed up with it! (inf) → so langsam aber sicher hängt es mir zum Hals raus (inf); that’s just about the limit! → das ist doch die Höhe! just now (in past) → soeben (erst), gerade erst; not just now → im Moment nicht; just now? → jetzt gleich?; you can go, but not just now → Sie können gehen, aber nicht gerade jetzt (other uses) just think → denk bloß; just listen → hör mal; just try → versuchs doch mal; just taste this → probier das mal; (it’s awful) → probier bloß das mal; just let me try → lassen Sies mich doch mal versuchen; just shut up! → sei bloß still!; just wait here a moment → warten Sie hier mal (für) einen Augenblick; just a moment or minute! → Moment mal!; I can just see him as a soldier → ich kann ihn mir gut als Soldat vorstellen; I can just see you getting up so early (iro) → du - und so früh aufstehen!; can I just finish this? → kann ich das eben noch fertig machen?; the possibilities just go on for ever → die Möglichkeiten sind ja unerschöpflich; don’t I just! → und ob (ich …); just watch it → nimm dich bloß in Acht; just you dare → wehe, wenn dus wagst just 2adj (+er) person, decision → gerecht (to gegenüber) punishment, reward → gerecht; anger → berechtigt; suspicion → gerechtfertigt, begründet; a just cause → eine gerechte Sache; I had just cause to be alarmed → ich hatte guten Grund, beunruhigt zu sein; as (it) is only just → wie es recht und billig ist Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 just 1 [dʒʌst] adj (fair) → giusto/ajust 2 [dʒʌst] adva. (exactly) → proprio, esattamente just here/there → proprio qui/là just behind/in front of/near → proprio dietro a/davanti a/vicino a just when it was going well ... → proprio quando tutto andava a gonfie vele... just then or just at that moment → proprio in quel momento it's just on 10 o'clock → sono le 10 in punto or precise it costs just (on) £20 → costa 20 sterline tonde tonde it's just what I wanted → è proprio quello che volevo just right → proprio giusto just what did he say? → cosa ha detto esattamente? come just as you are → vieni così come sei leave it just as it is → lascialo esattamente com'è they are just like brothers → sono proprio come fratelli that's just it!, that's just the point! → precisamente!, proprio così!, per l'appunto! that's just (like) him, always late → è proprio da lui arrivare sempre in ritardo just as I thought/expected → proprio come pensavo/mi aspettavo just as he was leaving → proprio mentre se ne stava andando just as you like → come vuoi he likes everything just so (fam) → gli piace che tutto sia fatto a puntino just here/there → proprio qui/là just behind/in front of/near → proprio dietro a/davanti a/vicino a just when it was going well ... → proprio quando tutto andava a gonfie vele... just then or just at that moment → proprio in quel momento it's just on 10 o'clock → sono le 10 in punto or precise it costs just (on) £20 → costa 20 sterline tonde tonde it's just what I wanted → è proprio quello che volevo just right → proprio giusto just what did he say? → cosa ha detto esattamente? come just as you are → vieni così come sei leave it just as it is → lascialo esattamente com'è they are just like brothers → sono proprio come fratelli that's just it!, that's just the point! → precisamente!, proprio così!, per l'appunto! that's just (like) him, always late → è proprio da lui arrivare sempre in ritardo just as I thought/expected → proprio come pensavo/mi aspettavo just as he was leaving → proprio mentre se ne stava andando just as you like → come vuoi he likes everything just so (fam) → gli piace che tutto sia fatto a puntino b. (recently, soon) → appena, or ora he's just done it/left → lo ha appena fatto/è appena partito just this minute → proprio adesso the book is just out → il libro è appena stato pubblicato we were just going → stavamo giusto andando I was just about to phone → stavo proprio per telefonare he's just done it/left → lo ha appena fatto/è appena partito just this minute → proprio adesso the book is just out → il libro è appena stato pubblicato we were just going → stavamo giusto andando I was just about to phone → stavo proprio per telefonare c. (only) → soltanto, solo it's just me → sono solo io just the two of us → soltanto noi due it's just 3 o'clock → sono le 3 just yesterday/this morning → soltanto ieri/stamattina just for a laugh → tanto per ridere it's just around the corner → è appena dietro l'angolo just a minute!, just one moment! → un attimo! it's just me → sono solo io just the two of us → soltanto noi due it's just 3 o'clock → sono le 3 just yesterday/this morning → soltanto ieri/stamattina just for a laugh → tanto per ridere it's just around the corner → è appena dietro l'angolo just a minute!, just one moment! → un attim"
}