{
  "url": "https://www.carelon.com/providers",
  "title": "Carelon Provider Portals and Resources | Carelon",
  "text": "Find useful tools, resources, and information to help you care for your patients. Welcome, care providers Quick access to the portals and resources you need Use the links below to access your Carelon provider portal, important contact information, and additional resources. Behavioral Health Our provider portals have the information, tools, and resources that support the day-to-day needs of your patients and office. Depending on the plan and state program, you’ll access one or multiple portals to manage your transactions. Care providers must obtain a user ID before using our online services. Carelon Behavioral Health Provider Portal Our provider portal provides convenient tools and resources for processing claims, obtaining claims information, verifying eligibility status, and more. Our secure online portal is available 24/7, saving time and resources while reducing errors. It minimizes phone inquiries, speeds up payments through efficient processing, and integrates seamlessly with practice management software. Our eServices portal offers care providers clinical and administrative tools aimed at allowing providers easier, more efficient access 24 hours a day, 7 days a week. Access our care provider handbook, primary care provider toolkit, web-based trainings, and other materials. Explore care provider resources Explore all Carelon Behavioral Health Provider content: Find information about joining our network, updating your contact information, claims, payments, credentialing, and more. Medical Benefits Management Our portals, resources, and updates enable specialty and post-acute care providers to streamline case reviews and find our evidence-based guidelines quickly. Specialty Care provider portal (formerly AIM Specialty Health’s provider portal) Specialty care providers can submit a new case for prior authorization or check the status of an existing case. Post-Acute Care provider portal (formerly myNEXUS) For home health, DMEPOS, PAC-IM, SDoH, and wound care services, post-acute care providers can submit a new case for prior authorization or check the status of an existing case. Carelon Medical Benefits Management offers clinical review (prior authorization) services that used to be under AIM Specialty Health. It covers these specialty clinical areas: - Cardiology - Genetic testing - Medical oncology - Musculoskeletal - Radiation oncology - Radiology - Rehabilitation - Sleep medicine - Surgical procedures Specialty Care: - Access our provider FAQs page Visit Provider FAQs - Access our clinical appropriateness guidelines and care pathways. Visit our guidelines home - Read news and updates about prior authorization. Visit Provider Connections Post-Acute Care: - Learn about important updates and discover new resources for care providers. Find post-acute care provider resources Specialty Care: - Specialty Care portal support: 1-800-252-2021 or contact our support team - For MBM Specialty Care prior authorizations, care providers can submit requests through the MBM provider portal or call the number on the back of the member’s ID card Post-Acute Care: For home health, DMEPOS, PAC-IM, SDoH and wound care providers - Post-Acute Care provder support: 1-844-411-9622 or contact our support team - Post-Acute Care provider network support: 1-833-585-6262 or email our network team Palliative Care The following resources, including access to our EpicCare Link provider portal, are provided to help you serve your patients more efficiently. Quickly and easily refer a patient or securely access information and updates about your patients’ treatment. Access referral forms, answers to frequently asked questions, and learn more about Palliative Care. For questions about referring a patient or member, please call: 844-232-0500 or email us at referrals@carelon.com Pharmacy (CarelonRx) The information and resources listed below, including contact information, links to portals, and drug lists, can help you serve your patients more easily. Pharmacy help desk For 24/7 assistance with pharmacy claims, contact us at the appropriate phone number below. - Commercial: 833-296-5038 - Medicare: 833-377-4266 - Medicaid: Please use the number on the back of the member’s ID card Electronic prior authorization Submit pharmacy prior authorization requests at the appropriate link below. - Surescripts - CoverMyMeds - CenterX (Submit through EPIC EMR) Access our latest drug lists and information on drug recalls and alerts, and learn more about our approach to therapeutic care decisions. - For information about CarelonRx prior authorization, prescription exceptions, and utilization management: 833-293-0659 or fax 844-521-6940. - For information about CarelonRx home delivery: 833-396-0309 or fax 833-389-4172. - For information about BioPlus Specialty Pharmacy: 833-549-2874 or fax 800-269-5493. Looking for something else? We're here to help answer any questions you have about Carelon."
}