{
  "url": "https://people.com/love-is-blind-season-10-what-to-know-11891208",
  "title": "'Love Is Blind' Season 10: Release Date, Cast, Filming Location and News",
  "text": "Love Is Blind Season 10: All About the Dating Show’s Return, Including the Newly Revealed Cast and Filming Location The tenth installment of 'Love Is Blind' will premiere on Netflix on Feb. 11 By Christopher Rudolph Christopher Rudolph Christopher Rudolph is a contributing writer for PEOPLE. He previously covered entertainment at The Advocate, HuffPost, Logo News, MTV News and more. People Editorial Guidelines and Emily Blackwood Emily Blackwood Emily Blackwood is a writer and editor at PEOPLE. She has been working at PEOPLE since 2023. Her work has previously appeared in National Geographic, SELF and HuffPost. People Editorial Guidelines Updated on January 28, 2026 10:12AM EST Leave a Comment Steven Sunday on Love is Blind Season 10 ; Chris Fusco on Love is Blind Season 10 ; Brittany Wicker on Love is Blind Season 10. Credit : Adam Rose/Netflix (3) NEED TO KNOW Netflix renewed Love Is Blind for season 10 in January 2025, months before the ninth season was releasedThe cast was revealed on Jan. 27, along with the season's filming locationSeason 10 of the hit reality dating series will premiere on Feb. 11 The Love Is Blind pods are open once again. Several months before all the drama and altar rejections fans had to endure during season 9, Netflix renewed its hit reality dating show in January 2025, Variety reported. Season 10 will start streaming on Feb. 11. Real-life couple Nick Lachey and Vanessa Lachey have hosted the series since its 2020 debut, challenging singles to form connections sight unseen. After leaving the pods, the newly engaged couples take their relationships into the real world, where they must decide whether their bond can last outside the pods. If — and that's a big if — they make it to the altar, they're asked to answer the question: Is love truly blind? Each season features contestants from a different city, with season 9 spotlighting romantic hopefuls from Denver. On Jan. 27, Netflix revealed the new pod squad cast for season 10, which will take place in Ohio. Here's everything to know about Love Is Blind season 10, including the show's potential filming location. Will there be a Love Is Blind season 10? Anton Yarosh in \"Love Is Blind\" season 9. Courtesy of Netflix Yes, Love Is Blind has been renewed for season 10. According to Variety, in January 2025, Netflix announced a two-season renewal for seasons 9 and 10. The show's ninth season made franchise history, with the first-ever finale where no couple tied the knot. \"I’m honestly surprised this is the first season where nobody got married,\" creator Chris Coelen told Tudum in October 2025. \"While we’re always rooting for our participants to find a lifelong commitment — because that’s what they all say they come to Love is Blind for — most importantly, we root for them to make the decisions they feel are right for themselves.\" He added, \"And I think that’s what happened here.\" When will Love Is Blind season 10 premiere? Megan Walerius, \"Love Is Blind\" season 9. Courtesy of Netflix The tenth season of Love Is Blind will premiere on Feb. 11, following the same alternating February and October release schedule the series has adhered to since season 6. Season 6 premiered on Valentine's Day 2024, with season 7 debuting in Oct. 2 that year. Seasons 8 and 9 followed the same pattern, dropping on Netflix on Valentine's Day 2025 and Oct. 1, respectively. Where was Love Is Blind season 10 filmed? Patrick Suzuki and Anna, \"Love Is Blind\" season 9. Courtesy of Netflix Past seasons of Love Is Blind featured contestants from a different city. However, season 10 will include singles from all over the state of Ohio, with cast members coming out of everywhere from Cincinnati to Columbus. Our new app is here! Free, fun and full of exclusives. Scan to download now! In February 2025, Lachey explained to PEOPLE how he believes the cities where the contestants are from impact the show. \"I think, as we've said before, every season takes on the personality of the city that it's based in,\" he said. The Love Is Blind participants are from cities across the United States, but according to Tudum, the actual pods are located in California. Who will host Love Is Blind season 10? Nick Lachey and Vanessa Lachey, \"Love Is Blind\" season 9. Courtesy of Netflix Nick and Vanessa will return to host season 10 of Love Is Blind. While speaking to CinemaBlend in February 2025 about the future of the show, Vanessa said, \"Netflix has picked up season 9 and 10, so we're bringing you two more seasons after this one.\" Hosting the series has helped the Lacheys with their relationship, as Nick told PEOPLE in February 2025. Are the Love Is Blind Season 9 Couples Still Together? All About Their Lives After the Dramatic Wedding Finale 10 Rules Love Is Blind Participants Must Follow (Including Who Pays for the Engagement Rings!) \"I think it's great therapy almost for us,\" he revealed. \"We said this before that watching these couples, and specifically in pods, watching the way they connect, it's a great reminder to never lose that communication in your own relationship.\" \"Never lose sight of what set it all off, the connection you felt, the emotions you felt in the beginning,\" Nick added. Who will be in the Love Is Blind season 10 cast? Tyler Lanier in Love is Blind Season 10 ; Dynasty Ballard in Love is Blind Season 10 ; Tyler Hunt in Love is Blind Season 10. Adam Rose/Netflix (3) Netflix officially revealed the cast for Love Is Blind season 10 in January 2026. This season, there are 32 singles looking for love in the pods. See the cast list below: Alex H., 31, Financial salesAlex L., 33, Assistant controllerBrennan, 30, Accounting and finance managerChris, 33, Account executiveConnor, 32, Account managementDevo, 32, Loan officerHaramol, 36, E.R. doctorJordan, 34, Account executiveKevan, 32, RealtorKevin, 35, Certified public accountantMiguel, 32, Software engineerMike, 30, Sales managerParker, 29, Business ownerSteven, 32, FinanceTyler H., 32, Management consultantVictor, 34, ProfessorAmber, 34, Nurse practitionerAshley, 34, Claims managerBri, 34, Senior merchantBrittany S., 37, Flight attendantBrittany W., 33, Registered nurseBry, 30, Commerical real estate agentChristine, 31, Speech-language pathologistDynasty, 33, Senior marketing managerElissa, 39, NurseEmma, 28, Retail merchandisingJennifer, 32, Financial professionalJessica, 39, Infectious diseases physicianKeya, 31, Marketing directorPriyanka, 34, RecruiterRosalyn, 31, Marketing managerTyler L., 33, Sales leader Where can I watch Love Is Blind? Edmond L. Harvey, \"Love Is Blind\" season 9. Courtesy of Netflix The first nine seasons of Love Is Blind are available to stream on Netflix. Close Leave a Comment Read more: Entertainment TV Reality TV"
}