{
  "url": "https://doctorondemand.com/",
  "title": "Doctor On Demand® Telehealth: 24-Hour Online Doctor",
  "text": "See if we take your plan in just a few seconds: Convenient telehealth appointments for urgent care and mental health support We accept most insurance, which means your visit could be free. *Primary Care is available for select health plans and employers. **People who have a digital otoscope that allows the healthcare provider to see in the ear remotely can be evaluated during a telemedicine visit for ear infections. We partner with leading health plans to serve millions of members around the country. Your telehealth visit may be as low as $0/visit. See if we take your plan in just a few seconds: - Select Insurance Plan - Angle Health - Blue Cross and Blue Shield of Minnesota - Blue Cross and Blue Shield of Texas - CDPHP - Compass Rose - Evry Health - Florida Health Care Plan - Harvard Pilgrim Health Care - Health Plans Inc - healthEZ - Humana Healthy Ohio - Mountain Health CO-OP - Optum - Regence BlueCrossBlueShield of Idaho - Regence BlueCrossBlueShield of Oregon - Regence BlueCrossBlueShield of Utah - Regence BlueShield - SCAN Health Plan - Surest - TRICARE East - TRICARE West - UHC - UMR - Wellmark BlueCrossBlueShield Don't see your insurance listed? No problem. Eligible members may receive $0 virtual care through their employer. Prefer to cash-pay? See pricing below. Create a free account to check eligibility. Limited-time cold & flu offer: Save $15 on cash-pay urgent care visits during the nationwide cold & flu surge. Board Certified Clinician $99$84 for an urgent care visit Same high-quality care at a lower price than leading competitors Psychologist - $134 for a 25 min consultation - $184 for a 50 min consultation Psychiatrist - $299 for initial 45 min consultation - $129 for 15 min follow-up Your estimated cost might change as we learn more details about your coverage, such as your specific benefits or whether you’ve met your deductible. Register or log in to see your actual cost. We will always share the cost of your visit before you book your appointment. Your estimated cost might change as we learn more details about your coverage, such as your specific benefits or whether you’ve met your deductible. Register or log in to see your actual cost. We will always share the cost of your visit before you book your appointment."
}