{
  "url": "https://ell.stackexchange.com/questions/73113/what-is-the-person-who-takes-minutes-in-a-meeting-called",
  "title": "word request - What is the person who takes minutes in a meeting called? - English Language Learners Stack Exchange",
  "text": "What do we call a person who takes the minutes in a meeting? Is it a minute taker, reporter? What do we call a person who takes the minutes in a meeting? Is it a minute taker, reporter? For the sake of providing an answer, the appropriate answer is \"minutes taker\", which you provided in your question. A minutes taker is the attendee at meeting whose role it is to record the minutes of the meeting. The note taker may be a formal, professional note taker, whose only job is to take notes, or they may be an active participant in the meeting who has taken on the role for that specific meeting. Take note: A Company Secretary is a person who is supposed to keep the records of a company (for reference, retrieval, etc.). Of course there are other definitions (responsibilities & functions); just want to point out that it is not necessary that a company secretary is always a minutes taker. (This is based on what I notice every time I attend a board meeting) \"Note taker\" and \"secretary\" are common terms in the United States. These terms are used for casual meetings. On formal committees with formal titles such as \"President\", \"Vice President\", and \"Treasurer\", the \"Secretary\" is responsible for the taking of the minutes, and for reading a summary of the minutes at the following meeting. (If the committee has a hired staff, a staff member often takes the minutes. The \"Secretary\" is responsible for whether the task was done correctly, and for reading the summary at the next meeting.) The person who takes meeting notes is the scribe. From a page of Meeting Tips: The scribe's job is to record what happened, especially the decisions reached and committments made. See also this answer on English.SE. In the Episcopal Church, the Registrar is the position on the Vestry specifically tasked with taking minutes at Vestry meetings. He/she is elected from within the Vestry and also responsible for reviewing previous minutes at the beginning of each meeting. That person who records all the information in a meeting is called a Company Secretary. (Abbreviated as CS.) Definition of a Company Secretary from businessdictionary: Officer appointed by the directors of a firm as responsible for ensuring that firm's legal obligations under the corporate legislation are complied with. His or her formal duties include (1) calling meetings, (2) recording minutes of the meetings, (3) keeping statutory record books, (4) proper payment of dividend and interest payments, and (5) proper drafting and execution of agreements, contracts, and resolutions. Reporter, on the other hand, is a person who writes news stories for a newspaper, magazine, etc., or who tells people the news on radio or television. - Merriam-Webster EDIT: I am not saying that only a CS can take minutes in a meeting. It can be a person appointed by a chairman also. But, It is is generally a CS or a secretary(of a committee or company) in India who records the meeting. A minute-taker can also be a CS or secretary or any other person who records the meeting. But I have rarely heard the term \"minute-taker.\" In my organisation they are called RAPPORTEUR. who is a person appointed by the organization to report o the proceedings of the meeting."
}