{
  "url": "http://www.yesworld.com/",
  "title": "Official website for the progressive rock band YES",
  "text": "THE FRAGILE TOUR UK 2026, THE ALBUM SERIES The Fragile Tour 2026 The ‘Fragile’ Album In Its Entirety + Classic Cuts YES return to the UK & Europe once more for a 11-date trek across the continent. The tour will see YES performing their 1971 classic album, ‘Fragile’, in its entirety as well as a selection of songs from across their illustrious catalogue. Each show will feature a gallery of work by esteemed artist, Roger Dean, whose paintings have graced the covers of many of YES albums over the years. The Fragile Tour Dates 2026 Date Venue Tickets “Roundabout” Merchandise Package - Premium Reserved Ticket in first 10 Rows (where applicable) - Exclusive YES Foil Poster, designed by Roger Dean - Exclusive VIP Merchandise Available at the links above. LATEST MUSIC RELEASES Mirror To The Sky – YES‘ 23rd studio album. The Quest – YES‘ 22nd studio album. The Royal Affair Tour: Live From Las Vegas – All YES concert tours are special events for their legions of fans, and “The Royal Affair Tour” was no exception, conceived as a wonderful celebration of the best of British progressive music. Guests on the tour were Asia, John Lodge of The Moody Blues and Carl Palmer’s ELP Legacy featuring Arthur Brown. From a Page – The complete works of the Benoît David, Steve Howe, Chris Squire, Oliver Wakeman and Alan White incarnation of YES and features four previously unreleased studio tracks plus the Live From Lyon 2009 recordings. YES50 Live – YES celebrated the band’s 50th anniversary in 2018 with an extensive tour that included shows in Europe, North America and Japan. YES50 LIVE is the double live album that was recorded during that tour. The Steven Wilson Remixes – Remixed versions of: The Yes Album (1971), Fragile (1971), Close To The Edge (1972), the double album Tales From Topographic Oceans (1973), and Relayer (1974). Each album features remixed audio by renowned producer Steven Wilson, released on vinyl for the first time. The Royal Affair Tour: Live From Las Vegas – New live album recorded at the Hard Rock Hotel, Las Vegas on 26 July 2019 during The Royal Affair Tour."
}