{
  "url": "https://www.silverbay.com/?page_id=8",
  "title": "History | City of Silver Bay, Minnesota",
  "text": "Go North Young Man In 1943, author Grace Lee Nute wrote, “From Duluth north and east to the Sault, the Wilderness still prevails; only a few villages and three cities have sprung up.” Within two years, Reserve Mining Company through the Northern Land Company and Lake Superior Land Company would begin acquiring land near Beaver Bay. Land was paid for in cash and the purpose concealed in order not to drive up prices. One rumor had it that a major hotel and resort was to be located near Peterson’s store. In the area around Peterson’s store and along the shore in both directions were many cabins owned by settlers and fishermen. This was the area that would come to be known as Silver Bay. In 1946, the secret could no longer be kept. Reserve Mining Company made known its intention to build a taconite processing plant when surveyors began laying out its stakes. These stakes, scattered throughout the valley where the town was to be and along the shore where the plant was to be located, were the beginnings of Silver Bay. The roots of its benefactor, Reserve Mining, extended back to the days of Peter Mitchell, an explorer, timber cruiser and geologist, hired by a group of Duluth, Minnesota, and Ontonogan, Michigan, businessmen in 1870 to look for minerals in northern Minnesota. Peter Mitchell explored the area around Babbitt, Minnesota, for three years looking for gold and silver but found instead promising iron ore deposits or, as he put it, “an iron mountain 12 miles long and 1/2 mile wide.” The Duluth and Michigan businessmen who hired Peter Mitchell formed the Mesaba Iron Company in 1882. The mountain discovered by Mitchell was found to contain taconite, a lower grade iron ore identified by Minnesota state geologist Newton Winchell in 1892. The Mesaba Iron Company never mined any of the 9,000 acres of land it acquired in the Babbitt area; it eventually sold the company to George St. Clair, John Williams and Samuel Mitchell in 1905. Mesaba Iron Company was renamed Mesabi Iron Co. and a Duluth mining engineer was hired to determine the feasibility of mining and processing the lower grade ore. The engineer determined that if the iron concentrate of the ore could be brought up to 60%, it would be possible to make a profit. With the aid of Daniel C. Jackling, a western copper developer, an experimental plant was built in Duluth to refine taconite processing. Dr. E.W. Davis, who worked for 40 years on the taconite process until retiring in 1955 at the University of Minnesota Mines Experiment Station, also became involved in the project. In 1920, Jackling built a pilot plant in Babbitt. Although it only operated for 2 years, it went a long way toward convincing owners that taconite production was possible if market conditions were right. In 1939, Dr. Davis was able to convince mining companies that it was possible to mine and process taconite at a profit. Reserve Mining Company was formed by four steel companies, but by 1950 Armco Steel and Republic Steel would each own 50% of the company. The name “Reserve” was chosen as the need for taconite was thought to be 20 years into the future. A major stumbling block to mining taconite was high taxes, which was addressed by the Minnesota legislature in 1941. This resulted in the Taconite Amendment which lowered these taxes. By 1944, Armco and Republic Steel committed themselves to building a plant in Minnesota, which was capable of producting 10,000,000 tons per year, and two cities, Babbitt and Silver Bay, to house the approximately 3500 workers and families. For all practical purposes, Silver Bay’s beginning was a scale model on a Milwaukee, Wisconsin, engineer’s desk. Reserve obtained the necessary state and federal permits to begin construction in 1947. Construction contracts were let to Hunkin-Conkey Co. of Cleveland, Ohio; the Arundal Corporation of Baltimore, Maryland; and the L. E. Dixon Co. of San Gabriel, California. Clearing of the plant site and town site began early in 1951 and continued night and day for four years until it was substantially completed in October 1955. Because places to live were limited, barracks-style housing with a cafeteria and dormitories was erected in the Reserve office complex. In addition, a trailer court with large metal wash houses was set up for families. By December 1952, a few homes were ready for occupancy. There were several different floor plans and house payments were cheap–less than $50 per month–in order that workers could afford them. No down payment was required, and Reserve paid the cost of installing utilities, landscaping, street paving, and sidewalks. At first, only Reserve employees were allowed to purchase the homes. On May 1, 1954, it was announced that Reserve’s new town on the shore would be called Silver Bay. Until that time, the city was known as the Beaver Bay housing project. One of the first houses in town became the post office, and Silver Bay was issued its own mail cancelling stamp. 1956 was a banner year for Silver Bay. The last of 6 pelletizing machines was fired up in February, and the first shipment of pellets went out on the C. L. Austin in April. Campton Elementary School was dedicated on March 11 thereby eliminating the overcrowding in the small two-room school in Beaver Bay. The $350 million Reserve plant was officially dedicated on September 3 and was renamed the E. W. Davis Works. On October 16, Silver Bay voted to incorporate with a mayor-council form of government. In 1958, William Kelley High School, named for Reserve’s first president, was opened eliminating the long 28-mile bus ride to Two Harbors. That same year, Reserve announced that it was selling its shopping centers in Babbitt and Silver Bay to J. W. Galbraith. Silver Bay’s shopping center was once heralded in the Duluth News Tribune as “expected to be the largest on the North Shore north of Duluth.” The 1960’s brought a second wave of construction when in April 1960, Reserve announced it was expanding its production from 6 million to 10 million tons per year. This expansion was a three-year $100 million project which created almost 400 new jobs. More houses, city buildings, stores, and Mary MacDonald Elementary School were built. Rocky Taconite came to symbolize Silver Bay as the “Taconite Capitol of the World” when it was dedicated in 1964. The 1960’s were prosperous, but Reserve was coming under increasing pressure to stop dumping its waste rock into Lake Superior. On February 17, 1972, the U.S. Justice Department filed suit against Reserve for violating the Rivers and Harbors Act of 1899 which prohibited the dumping of harmful materials into interstate waters. For five years, as the trial dragged on, everyone who lived in Silver Bay or worked for Reserve wondered if they would to continue to have homes and jobs. Finally, on July 7, 1977, Reserve was given permission to build a tailings storage basin 7 miles inland from Silver Bay at Mile Post 7. This brought the third construction period when Reserve invested $370 million to reduce its air and water pollution by the court-ordered April 15, 1980, deadline. Within two years of the completion of the Mile Post 7 project, the demand for steel declined. Mills, mines and plants were closing and thousands of people were losing their jobs. Reserve cut its production and workforce and finally closed on July 31, 1986. Over its 30 years of operations, Reserve shipped almost 219,024,410 tons of pellets. For three years it seemed that no one was anxious to rehabilitate Reserve’s idled plant. Silver Bay’s population dropped from 2,917 in 1980 to 1,894 in 1990 as people left for work elsewhere. In the spring of 1989, two companies showed a strong interest in acquiring Reserve. A bidding war took place between Cyprus Minerals of Denver, Colorado, and Cleveland Cliffs of Cleveland, Ohio. Even though Cliffs topped the Cyprus offer by $1 million, the bankruptcy judge awarded the $680 million plant to Cyprus. After spending $30 million for repairs and renovations, the renamed Cyprus North Shore Mining Company began making pellets again. In the fall of 1994, Cyprus North Shore Mining was sold to Cleveland Cliffs. The Bay Area Historical Society is here to provide visitors with information on the area and also its history through its building on the corner of Davis and Outer Drive or by writing to them at P.O. Box 33, Silver Bay, Minnesota 55614."
}