{
  "url": "https://www.resetera.com/threads/skate-story-ot-hell-is-a-halfpipe.1375174/",
  "title": "Skate Story |OT| Hell is a Halfpipe Indie - OT | ResetEra",
  "text": "About This Game Developer: Sam EngPublisher: Devolver Digital Genre: Arcade / Skateboarding Platforms: PC (Steam), PS5 (Also on PS Plus Extra Day 1), Switch 2 Price: $19.99, £17.99, 19,99€ Release Date: December 8th, 2025 [Launches in: Dec 8, 2025 at 1:00 PM] Steam Deck Compatible?: Yes, verified. Demo Available?: Yes, only on Steam. Age Ratings: ESRB - T, PEGI - 12 System Requirements: Minimum: - Requires a 64-bit processor and operating system - OS: Windows 10 x64 Bit - Processor: Intel Core i7-6700 / AMD Ryzen 5 1600 - Memory: 8 GB RAM - Graphics: GeForce GTX 1050 Ti / Radeon RX 570 / Arc A380 - DirectX: Version 12 - Storage: 12 GB available space - Additional Notes: Low Quality setting, in 1080p, producing 60 FPS - Requires a 64-bit processor and operating system - OS: Windows 11 x64 Bit - Processor: Intel Core i7-1070 / AMD Ryzen 7 2700X - Memory: 16 GB RAM - Graphics: GeForce RTX 2070 / Radeon RX 5700 / Arc A750 - DirectX: Version 12 - Storage: 12 GB available space Game Description You are a demon in the Underworld, made out of glass and pain. The Devil has given you a skateboard with a simple deal: Skate to the Moon and swallow it — and you shall be freed.Ollie, kickflip, and grind your way through the ash and smoke of The Emptylands as you take on a seemingly impossible quest. Learn to master your weight and motion to conquer the weeping concrete. Savour the ritualistic beauty as you set your feet to pop a perfect kickflip. Skate fast to destroy vicious demons, help a forgetful frog, and save other tortured souls on your journey from fragile beginner to hardened skater. Push through hell and discover The Devil's greatest weakness: humility, perseverance, and a disgustingly sweet backside tailslide. All you need is your skateboard. Game Features Hypnotic Beats for Demonic Streets Cruise through The Underworld to a psychedelic soundtrack by enigmatic New York artist Blood Cultures, and additional tracks by John Fio.Stylish Street Skating Adventure Skate through nine layers of The Underworld. Cruise through streets and surreal landscapes full of waxed ledges, unholy gaps, and tortured demons. Push your way through precarious paths and shred freeform skate spots. Discover and create your own challenges as you explore the world and master your board.Succumb To The Beauty of The Board Sell your soul for decks, wheels, and trucks to keep your skating fresh. Over 70+ skate tricks to progress and improve. Complete skate trials to level up, learn new tricks, and get new gear. Destroy vicious demons with your 360 flip… or at least impress them.Reviews: TBD Media Screenshots 📸:Trailers 🎥:"
}