{
  "url": "https://www.bavarianinn.com/stay/packages-specials/",
  "title": "Hotel Deals and Special Packages | Bavarian Inn Lodge in Frankenmuth",
  "text": "SPECIAL DEALS AT BAVARIAN INN LODGE! stay, dine, & Play package This hotel room deal includes everything your family needs for an amazing stay, including: a family chicken dinner, mini-golf, gameplay, breakfast, and a room. Offered on Sunday – Thursday night stays. Based on availability. Rates may vary based on room type selection. Early Bird Spring Break Deal Book a two-night stay now through February 28, 2026 for a date between March 20 – April 5, 2026, and enjoy a bonus $50 Game Card plus exclusive savings of 15% OFF a 2 night stay or 25% OFF a 3 Night Stay. Rooms based on availability. New bookings only. 40th Anniversary Special Celebrate 40 years with us and enjoy a special Anniversary Rate, available for a limited time from February 9–12, 2026. It’s our way of saying thank you for being part of the memories. Perks Club Member Discount As a thank-you to our Perks Club Members, enjoy a special room rate available through December 18, 2026. Rooms based on availability. New bookings only. PACKAGES TO ADD TO YOUR STAY! You may add any of the below packages to any guestroom reservation. This may be done during online booking or with a live reservationist at the Lodge. Call us at 855-652-7200 with questions! (Due to supply chains, substitutions may apply) KIDS PACKAGES WILLY’S NIGHTLY DELIVERY EXPERIENCE! Enjoy freshly baked cookies and milk delivered to your room by Willy the Dragon—perfect for family photos and fun! Call 855-652-7200 to add this special snack pack experience, available select Saturdays through year’s end. GOODNIGHT SNACK PACK – $26.99 Includes four freshly baked chocolate chunk cookies and two cartons of milk, delivered right to your room by Willy the Dragon! GOODNIGHT FAMILY SNACK PACK – $39.99 Includes four warm chocolate chunk cookies and two cartons of milk delivered by Willy the Dragon, plus pre-arrival extras delivered to your room: two bottled waters and a bag of Grandpa Tiny’s caramel corn. GOODNIGHT FAMILY SNACK PACK SUPREME – $52.99 Includes four warm chocolate chunk cookies and two cartons of milk, delivered right to your room by Willy the Dragon! Plus, enjoy pre-arrival extras delivered before check-in: two Bavarian Inn Root Beers, two Bavarian glass mugs, and a bag of Grandpa Tiny’s caramel corn. Snack Pack Hofbrau Upgrade your experience with Hofbräu beer for just $6 more! Want extra treats? Add two more cookies and one more milk to any snack pack for only $7.99. Kid's Mystery Bag $29.99 Each themed package is packed with fun activities, toys, and goodies designed to delight kids ages 4 to 10. From Spring and Easter to Halloween and Christmas, surprises match the season of your stay. Birthday Packages Celebrate your birthday at the Bavarian Inn Lodge with our Birthday Surprise Package for $49.99! Includes a personalized door poster, handwritten note, birthday candy with balloons, a $20 gaming card, mini-golf pass, and a scoop of ice cream from Emilie’s Eis. BUILD-A-BEAR EXPERIENCE Enjoy our Build-A-Bear Experience and create your own personalized furry friend, complete with a Bavarian Inn commemorative t-shirt. Perfect for kids and the young at heart! CANDY TOWER PACKAGE $99.99 Enjoy a 2-tier Candy Cake Tower filled with chocolates, Skittles, and more—pre-assembled and perfect for sharing! Includes a cuddly rainbow BIL logo bear. (Candy selections cannot be customized.) BAVARIAN INN CHOCOLATE TRUFFLES $17.50 Treat yourself to our housemade Bavarian Inn Boxed Truffles—available in a variety of flavors and perfect for your room. Rich, chocolatey, and irresistible! RAINBOW SOUVENIR BEAR $19.99 Bring home a vibrant souvenir bear featuring our lodge logo—a perfect keepsake from your Bavarian Inn Lodge visit. FAMILY FUN PACKAGES Enjoy your stay in Michigan’s Little Bavaria with one of our Family Fun Packages! Bavarian Inn Lodge is the ultimate destination for family-friendly activities. Family Fun Package $70.00 Enjoy a large pizza with up to five toppings from the Ratskeller, a pitcher of pop or lemonade, a pound of Greta’s homemade fudge, four rounds of mini-golf, and $20 in gaming credit for the Family Fun Center. Deluxe Family Fun Package $95.00 Enjoy a large pizza with up to five toppings from the Ratskeller, a pitcher of pop or lemonade, a pound of Greta’s homemade fudge, two small ice creams from Emilie’s Eis, four 2-day unlimited mini-golf passes, and $40 in gaming credit for the Family Fun Center. Extreme Family Fun Package $195.00 Enjoy a large pizza with up to five toppings, a pitcher of pop or lemonade, a pound of Greta’s fudge, four small ice creams, six 2-day unlimited mini-golf passes, $100 gaming credit, and $40 spending credit for dining or shopping. Downtown Frankenmuth - Shop & Savor $100.00 Discover a delicious variety of local treats, gift certificates, and keepsakes from Frankenmuth’s favorite shops—all bundled for a tasty and memorable experience! Willy's adventure pass $99.99 Enjoy an all-day adventure in the Family Fun Center with unlimited access to our indoor ropes course, climbing walls, laser tag, and mini-golf—plus a $50 game card for even more excitement. PACKAGE IDEAS FOR ADULTS Enjoy your stay in Michigan’s Little Bavaria with one of our Adult Getaway Packages! Bavarian Inn Lodge is the perfect destination for relaxing, dining, and unforgettable experiences. Root Beer Package $24.99 Enjoy a refreshing Bavarian Inn Root Beer experience complete with keepsake glasses and a tasty bag of our signature pretzels. Hofbrau Package $29.99 Savor two Hofbrau beers with keepsake glasses and a bag of our famous Bavarian Inn pretzels for the perfect pairing. Champagne Package $39.99 Celebrate with a bottle of champagne (or non-alcoholic option) and two keepsake glasses to toast the occasion. Wine Package $34.99 Choose from a selection of wines paired with two keepsake glasses—perfect for enjoying a special moment. Additional options available upon request. Bourbon Packages $120.00 – $235.00 Choose from Bourbon Matriarch or Bourbon Select, each with a 375 mL bottle and two Bavarian Inn whiskey glasses, or enjoy the Duo Bourbon package featuring both bottles and glasses. Champagne Package $39.99 Celebrate with a bottle of champagne (or non-alcoholic option) and two keepsake glasses to toast the occasion. COUPLES PACKAGES Enjoy your stay in Michigan’s Little Bavaria with one of our Couples Packages! Bavarian Inn Lodge offers the perfect setting for romance, relaxation, and memorable moments together. Tomahawk Ribeye Dinner $95.00 Enjoy a 52 oz. Tomahawk Ribeye with three sauces and four sides—perfect for sharing or a fun challenge! Served after 4:30 PM in Oma’s Restaurant or the Lorelei Lounge on your first night. Reservations required 24 hours in advance; wine pairing available. Chocolate Covered Strawberry Package $24.00 Make your getaway even sweeter with fresh, hand-dipped strawberries delivered to your room. Perfect for sharing and savoring together. GAMING PACKAGES Enjoy your stay in Michigan’s Little Bavaria with one of our Gaming Packages! Bavarian Inn Lodge is your go-to destination for nonstop fun in our expansive Family Fun Center. Game Mayhem Package $250.00 Get five game cards loaded with 250 credits each—plus a $50 bonus to spend at select dining spots or Michael’s Gift Shop. Mega Game Mayhem Package $500.00 Enjoy five game cards with 550 credits each, plus a $75 bonus to use at select dining locations or Michael’s Gift Shop. Ultimate Game Mayhem Package $1,000.00 Score five game cards with 1,200 credits each—plus a $125 bonus to spend at select restaurants or Michael’s Gift Shop. WATERPARK PACKAGES Enjoy your stay in Michigan’s Little Bavaria with one of our Waterpark Packages! Bavarian Inn Lodge offers exciting options that can make your trip perfect for enjoying Bavarian Blast Waterpark. Willy's Waterpark Package $149.99 Packed with snacks, drinks, and Bavarian Inn Lodge goodies – from a flying disc to a Willy towel – this bundle is perfect for waterpark adventures and relaxing in style. Willy's Picnic Package $39.99 This playful picnic bundle includes a flying disc, hydration bottle, caramel corn, animal crackers, lip balm, a Willy the Dragon lollipop, and a picnic tarp – everything you need for a sweet simple day in the sun. Frankenmuth Friends Package $29.99 Pick your favorite pal – Puddles, Goldie, Fritz, Schnitz, or Bertina – and take them along with a hydration bottle in a Bavarian Inn Lodge drawstring bag! Willy's Hydration Package $29.99 Stay cool and refreshed on the go! This handy bundle includes a resort-branded drawstring bag, a hydration bottle, and a cooling bottle – perfect for waterpark days, outdoor adventures, or exploring in comfort."
}