{
  "url": "https://www.verywellmind.com/the-importance-of-friendship-3024371",
  "title": "6 Benefits of Friends: Why It's Important to Stay Close",
  "text": "6 Benefits of Friendship and Why It's So Important to Stay Close Invest in your besties By Arlin Cuncic, MA Arlin Cuncic, MA Arlin Cuncic, MA, is the author of The Anxiety Workbook and founder of the website About Social Anxiety. She has a Master's degree in clinical psychology. Learn about our editorial process Updated on October 23, 2025 Reviewed Verywell Mind articles are reviewed by mental health professionals. Reviewers confirm the content is thorough and accurate, reflecting the latest evidence-based research. Content is reviewed before publication and upon substantial updates. Learn more. by David Susman, PhD Reviewed by David Susman, PhD David Susman, PhD is a licensed clinical psychologist with experience providing treatment to individuals with mental illness and substance use concerns. Learn about our Review Board Verywell / Joshua Seong Table of Contents View All Table of Contents Physical Health Healthy Behaviors Emotional Support Confidence Building Stress Reduction Friends Help You Cultivate Community Motivation Frequently Asked Questions Close Key Takeaways Friends can encourage us to be our best and reach our goals. The social support that friendships provide is also vital to mental health and well-being. In an age where many of us feel lonelier and more disconnected than ever—despite being chronically online—it's never been more important to invest extra energy into our friendships. Platonic relationships are sometimes overlooked in our quest for romantic ones, but friendship is just as important to our psychological well-being. Friendships can enrich your life in countless ways. Good friends teach you about yourself and challenge you to be better. They encourage you to keep going when times get tough and celebrate your successes with you. They help you build community. How the 4 Types of Friendship Fit Into Your Life Friends Are Good for Your Physical Health It turns out that healthy relationships actually contribute to good physical health. Having a close circle of friends can decrease your risk of health problems like diabetes, heart attack, and stroke. Having strong social ties can also decrease feelings of loneliness, which evidence shows can take a toll on your longevity. One study found that the risk of mortality increased by a whopping 91% among socially isolated people. A 2023 systematic review and meta-analysis found that social isolation increased the risk of mortality from all causes. Social isolation and loneliness are linked to a variety of health issues such as high blood pressure, substance abuse, heart disease, and even cancer. Friends Encourage Healthy Behaviors One possible explanation for those health benefits is that friendships can help you make lifestyle changes that can have a direct impact on your well-being. For example, your friends can help you set and maintain goals to eat better and exercise more. They can also watch out for you and give a heads-up when any unhealthy behaviors (like drinking too much) get out of hand. Additionally, people are more motivated and likely to stick to a weight loss or exercise program when they do it with a buddy. It's much easier to get out and stay active when you have a friend by your side. That friend may also suggest activities that you would not have considered on your own—thus, pushing you outside your comfort zone to challenge your anxiety. Reaching Out to Others Has a Greater Impact Than You'd Expect Friends Provide Emotional Support If you find yourself going through a hard time, having a friend to help you through can make the transition easier. Emotional support involves offering comfort and empathy. For example, friends can listen without judging, validate your feelings, and offer words of comfort. They can also just be physically present with you when you are going through something tough, which can be a *huge* comfort. By checking in and standing by you, they help you feel less alone. Research also shows that happiness is contagious among friends. One study of high school students found that those who were depressed were twice as likely to recover if they had happy friends. Likewise, kids were half as likely to develop depression if their friends had a \"healthy mood.\" Dealing With No Support from Family When You're Depressed Friends Help Build Your Confidence Everyone has self-doubts and insecurities every now and then. But having friends who support you plays a big role in building your self-esteem. When people around you provide validation, it impacts your ability to love and appreciate yourself. Supportive friends can help you feel more confident by offering praise and reassurance when you're feeling unsure. They'll shine a light on just how amazing you are and how much you have to offer others. Friends Help You Beat Stress Everyone goes through stressful events. If you know you have people you can count on, you may be less likely even to perceive a tough time as stressful. Spending time with friends can also help reduce stress. According to Harvard Medical School, \"social connections help relieve levels of stress, which can harm the heart's arteries, gut function, insulin regulation, and the immune system.\" Friends can also help you cope with stressful situations. Research suggests that when children hang out with their friends during a stressful situation, they produce less cortisol, a hormone released when the body is under stress. Kids who talk to a good friend after a negative experience also return to a relaxed state more quickly than those who do not. Other research has shown that teens who have higher levels of perceived social support have lower cortisol responses to stress. They also have lower neural activity in the areas of the brain that are often associated with the social distress people experience when they are socially excluded. As the song goes: \"We all need somebody to lean on.\" A lack of friends can leave you feeling lonely and without support, which makes you vulnerable to other problems such as depression and substance abuse. How Social Support Contributes to Psychological Health Friends Help You Cultivate Community While we might all be pretty good at building online communities, our in person ones are seriously lacking. When we invest the energy in our friendships, and then encourage our friends to be friends with each other it fosters a sense of community. A healthy community can help us feel more at home in our towns and cities When we're out and about and we see people we know—at the grocery store, at a local cafe, etc—it lets us know that we are part of something bigger and that we belong. Research has found that a sense of community is associated with decreased symptoms of stress, anxiety, and depression. Friends Push You To Be Your Best Ever heard some version of the phrase, \"you are the average of the people you spend your time with\"? The people we're friends with have the power to influence our own values and character. When you prioritize friendships with people who are generous with their time, help others, or are ambitious or family-oriented, you are more likely to develop those values yourself. Great friends have the power to mold you into the best version of yourself. They see you and love you for who you truly are. They encourage you and push you to do better and be the person you want to be—your \"ideal self.\" Why Trio Friendships Often Feel Uneven—and What You Can Do About It 'I Don't Need Friends': Why You Might Feel This Way Frequently Asked Questions What makes someone a friend? There are many different components of friendship. If someone is loyal to you, honest with you, shares many of your interests, and is there for you when you need them, you would likely consider them a friend. What is the purpose of having friends? Many of the benefits of friends could be considered evolutionary—having a group of friends can create feelings of safety and social inclusion. Caring for others, and having others that care for you in turn, can help foster a collective purpose and feelings of self-worth. 8 Signs You've Found Your Platonic Soulmate Read more: Conditions A-Z Anxiety Social Anxiety Disorder Living With 13 Sources Verywell Mind uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. U.S. Department of Health and Human Services. Our Epidemic of Loneliness and Isolation, 2023. Yang YC, Boen C, Gerken K, Li T, Schorpp K, Harris KM. Social relationships and physiological determinants of longevity across the human life span. Proc Natl Acad Sci U S A. 2016;113(3):578-583. doi:10.1073/pnas.1511085112 Naito R, McKee M, Leong D, et al. Social isolation as a risk factor for all-cause mortality: Systematic review and meta-analysis of cohort studies. PLoS One. 2023;18(1):e0280308. doi:10.1371/journal.pone.0280308 Holt-Lunstad J, Smith TB, Baker M, Harris T, Stephenson D. Loneliness and social isolation as risk factors for mortality: A meta-analytic review. Perspect Psychol Sci. 2015;10(2):227-237. doi:10.1177/1745691614568352 Craddock E, vanDellen MR, Novak SA, Ranby KW. Influence in relationships: A meta-analysis on health-related social control. Basic Appl Soc Psych. 2015;37(2):118-130. doi:10.1080/01973533.2015.1011271 Morelli SA, Lee IA, Arnn ME, Zaki J. Emotional and instrumental support provision interact to predict well-being. Emotion. 2015;15(4):484–493. doi:10.1037/emo0000084 Hill EM, Griffiths FE, House T. Spreading of healthy mood in adolescent social networks. Proc Biol Sci. 2015;282(1813):20151180. doi:10.1098/rspb.2015.1180 Harvard Medical School. The health benefits of strong relationships. Doom JR, Doyle CM, Gunnar MR. Social stress buffering by friends in childhood and adolescence: Effects on HPA and oxytocin activity. Soc Neurosci. 2017;12(1):8-21. doi:10.1080/17470919.2016.1149095 Scheuplein M, van Harmelen AL. The importance of friendships in reducing brain responses to stress in adolescents exposed to childhood adversity: A preregistered systematic review. Current Opinion in Psychology. 2022;45:101310. doi:10.1016/j.copsyc.2022.101310 Shadur J, Hussong A. Friendship intimacy, close friend drug use, and self-medication in adolescence. J Soc Pers Relat. 2014;31(8):997-1018. doi:10.1177/0265407513516889 Park EY, Oliver TR, Peppard PE, Malecki KC. Sense of community and mental health: a cross-sectional analysis from a household survey in Wisconsin. Fam Med Community Health. 2023;11(2):e001971. doi:10.1136/fmch-2022-001971 Houle J, Meunier S, Coulombe S, et al. Peer positive social control and men's health-promoting behaviors. Am J Mens Health. 2017;11(5):1569-1579. doi:10.1177/1557988317711605 By Arlin Cuncic, MA Arlin Cuncic, MA, is the author of The Anxiety Workbook and founder of the website About Social Anxiety. She has a Master's degree in clinical psychology. See Our Editorial Process Meet Our Review Board Share Feedback Was this page helpful? Thanks for your feedback! What is your feedback? Helpful Report an Error Other Submit"
}