{
  "url": "https://www.falloutcascadia.com/faq",
  "title": "F.A.Q — Fallout: Cascadia",
  "text": "FREQUENTLY ASKED QUESTIONS Take a look at our F.A.Q before you ask any questions! What is Fallout: Cascadia? Fallout: Cascadia is a complete replacement mod for Fallout 4, featuring new factions, weapons, armors, characters, a branching main story, and so much more! It is set in the year 2329 in the Seattle metro-area, approximately 40 years after the events in the Commonwealth. Will this mod be released on Consoles or as a Creation? We would love for this to be the case, but it's sadly not possible based on our use of Fallout 4’s Script Extender (F4SE), and custom asset limitations on PlayStation. However, we have released some of our content on Xbox* (such as our NCR Armor Pack and our Service Rifle). *And there are no plans to upload Cascadia to Bethesda.net as a standalone mod or as a Creation so it’s available for consoles. What will I need to play Fallout: Cascadia? At the minimum, your PC needs to be able to run Fallout 4 on medium settings. Additionally, we require all the official DLCs for Fallout 4. Finally, you’ll need the Fallout 4 Script Extender. Unfortunately, there will not be a “no-DLC” version of Fallout: Cascadia. When will Fallout: Cascadia be released? This is difficult to say as our team works on a volunteer basis. We are working towards a set internal date, but we have not yet announced anything formally to the public. Whenever we have a date set, it’ll be announced. Will this be lore friendly? Short answer: Yes! The long answer is that we have done extensive research into the lore of the Fallout franchise, and we abide by all the canon lore established by previous games. We've worked tirelessly to seamlessly fill in gaps and bring you a whole new, albeit familiar, world. Where can I learn more about the story? The writing team has a podcast miniseries where you can find more details about our protagonist (\"the Drifter\"), factions, main characters, locations, and much more! You can find all currently released episodes here. Do I have to start a New Game for Cascadia? Yes. Fallout: Cascadia's story is completely separate from that of Fallout 4, and utilizes many changes/augmentations of game mechanics. All this requires a new game to be started. Will there be a voiced protagonist? No. The voiced protagonist is something we have gotten rid of as it put a huge amount of limitation on our writers, a massive amount of work for voice acting, and as we thought about it the idea sounded less appealing, and we decided to develop Cascadia without it. Have a question? Join our Discord Server, and we’d be delighted to hear from you and answer whatever question you have!* *Please note that we’re humans and might take some time to answer questions."
}