{
  "url": "https://nypost.com/",
  "title": "New York Post – Breaking News, Top Headlines, Photos & Videos",
  "text": "Advertisement Advertisement Common sense. No nonsense. Advertisement The best of everything Metro - Year-round outdoor dining to ‘finally’ return to NYC streets, Council Speaker Julie Menin vows - Suspect charged with armed robbery of New York Jets player in New Jersey - Fast-food customers slammed by McFlation yearn for old days of 99-cent burgers, tacos and fries - GOP pol seeks rematch against Dem NY Rep. Suozzi after narrowly missing out in 2024 business - Eddie Bauer could close all North American stores as parent company eyes bankruptcy - New Epstein emails about top Goldman lawyer spark internal drama at bank: report - Bari Weiss made decision on CBS fate of Peter Attia — but she won’t tell staffers: report - Federal Reserve governor resigns from WH post Wellness - Bella Hadid’s esthetician reveals the under-the-radar at-home treatment she loves — and her fave drugstore buys - Controversial diet may actually help drug-resistant depression: study - Forget nightlife — ‘daylife’ wellness movement is social fun without a hangover - An ER doctor explains how to dodge the Grim Reaper — for a time shopping - One and done: Amazon just cut 41% off this indestructible titanium cutting board - Working boots that are ‘kind of Doc Marten’ are under $55 and make winter commuting tolerable - Real flowers die, but these LEGO bouquets won’t — get them in time for Valentine’s Day - I’ve tried luxe shampoos for winter scalp dryness — I still reach for this $9 CeraVe one every time Real estate - Milan named Europe’s hottest luxury housing market: Prices surge ahead of the Winter Olympics - ‘Rent now, pay later’ services may help tenants manage monthly payments — but are the fees worth it? - How filing your taxes changes when you buy a home instead of rent one - Walter White’s iconic ‘Breaking Bad’ House lists for second time after its price was slashed by $3M Lifestyle - Sentimental fans mourn the end of Minute Maid’s iconic Frozen Canned Juices after 80 years: ‘I grew up on these’ - Coca-Cola drops brand new ‘nostalgic’ flavor alongside highly anticipated Diet Cherry Coke — no longer a limited edition - My fellow community group member is married to a sex offender - Popular chip brand exits coastal hometown after decades tech - Elon Musk loses bid to dismiss SEC lawsuit over Twitter stake - LI veterans use virtual reality to fight PTSD with fantastical trips to outer space, animal sanctuaries - Svedka to air Super Bowl’s first fully AI-generated ad — despite revolt against ‘dystopian nightmare’ marketing - Goldman Sachs’ top lawyer sought Epstein’s help in bid for senior Facebook role, emails show media - Ex-WashPo staffer accuses Jeff Bezos of trying to ‘survive’ Trump rather than save paper - Netflix co-CEO grilled by senators as Warner Bros. deal sparks monopoly concerns - Former OnlyFans model leaves LA to join Amish TLC show - Mamdani ripped over hunt for personalized jacket ahead of winter storm that left 16 NYers dead Complete your morning routine. Get The Post's top stories straight to your inbox. Horoscopes Aquarius You are never afraid to say what you think and what you tell a friend or work colleague today will be very much to the point, maybe brutally so. They won't like it to begin with but later on they will thank you for your honesty. Trending Now Now on Page Six - Claire Foy secretly battled ‘disgusting’ parasite infection for 5 years - Everything Page Six editors are giving (and hoping to get) for Valentine’s Day, from custom jewelry to ‘kissable’ lip gloss - Savannah Guthrie’s brother arrives at sister Annie’s house in first sighting since mom Nancy disappeared - Dog the Bounty Hunter’s stepson arrested for fatally shooting his child in tragic accident - Ryan Reynolds’ ex Scarlett Johansson gets dragged into Blake Lively, Justin Baldoni’s case Trending in Sports - Dodgers dump veteran Andy Ibanez weeks after signing to grab Yankees outfielder - Rangers trade Artemi Panarin to Kings in seismic pre-Olympic freeze deal - Mavericks ship Anthony Davis to Wizards in trade deadline bombshell - Joe Milton III hated his time with the Patriots: 'Disrespected' - Terrell Owens: Tom Brady shouldn't be first-ballot Hall of Famer Sports Podcasts The best insights from the ultimate insiders - Up in the Blue Seats - Rangers Listen on Apple Podcasts Spotify - The Show with Joel Sherman and Jon Heyman Listen on Apple Podcasts Spotify - Blue Rush: NY Giants Football Podcast Listen on Apple Podcasts Spotify - Gang’s All Here: A NY Jets Football Podcast Listen on Apple Podcasts Spotify - NY Got Game: Basketball Listen on Apple Podcasts Spotify - Pinstripe Post - Yankees Listen on Apple Podcasts Spotify - Against the Cage - Combat Sports Listen on Apple Podcasts Spotify - Straight Outta Flushing - Mets Listen on Apple Podcasts Spotify"
}