{
  "url": "https://www.baladin.it/en/",
  "title": "Homepage | Baladin",
  "text": "The first 100% Italian craft beer! Nazionale is an ambitious project that draws attention to the importance of the Italian supply chain in the production of craft beer. The addition of spices is indissolubly linked to the history of beer, since its very beginnings. Baladin pays homage to this tradition with three beers - now considered classics - made with unusual cereals and unique, elegant and refined mixes of spices. A great beer is the result of many factors, including a careful selection of ingredients: good water, the right malts, the right hops and the best yeast. With his \"pure malt” beers, Teo shows that the four classic ingredients alone can generate great and complex results. The use of hops is certainly very old in the history of beer production. The hop plant is an endemic species in most of Europe, so it is easy to imagine that it was largely used by the very first beer brewers. Three beers with deeply different stories pay homage to this vine. Our special beers are brewed in limited quantities for special occasions, a particular cooperation or because of seasonality. This is why they are so important to us. Naturally alcohol-free beers characterized by the use of botanicals. They contain 66 kcal per bottle. The beers in the Teo Musso Reserve are the most intimate expression of his thought and unstoppable desire to experiment. These are limited edition beers, little gems that explore fermentation techniques, wood aging, macro-oxidation and, in some cases, the use of special spices. Making a gluten-free beer with a good body, aroma and taste. This was our goal. And now it is our pride: the many positive comments we have received confirm that the gluten-free version of Nazionale, the first 100% Italian craft beer, is just as good as the original. Baladin offers a huge selection of draught beers. Some of them, the Special ones, exclusively on tap. Experimenting. That’s how Teo Musso created his Baladin Spirits for the first time: refined jewels which take inspiration from tradition and reinterpret it. Discover our beer Vermouth and all the spirits created for those who like to drink with gusto. Baladin’s history is characterized by the constant search for taste in all its shapes and forms, even if they don’t belong to the brewing tradition. One example? Our cider! The Baladin soft drinks recreate tastes and flavors that were once traditional, but with a touch of innovation. Free from colorings or preservatives, these special drinks are devoted to those who used to children, and to new generations alike. In this section, you’ll find Baladin’s Bevi Frutta: flavorsome drinks created by craft producers who have decided to put their art at the service of Teo Musso’s taste. They are the perfect combination of farm-to-table fruit and spices. Sweets always please everybody around a dining table, including the most demanding palates. In this selection by Baladin you will certainly find the perfect treat for you! Recreating the Baladin Beers at home? Yes…you…CAN! Here are the beer kits for all the homebrewers who’d like to produce our Open beers at home and - why not - revisit one of them according to their unique taste. The perfect glass for beer tasting. Teo Musso and Lorenzo Dabove - better known as Kuaska - are the two creative minds behind this project. Design and architecture come together to enhance the taste and scents of great quality craft beers. We started in Piozzo and now we are (almost) in all parts of Italy... here are our places! We do not only have pubs and breweries we also have stunning resorts! All the places who have chosen to serve Baladin products The Baladin brewery is a sort of Wonderland: if you want to enter it, just drink a glass of live beer and… book your visit!"
}