{
  "url": "https://www.polet.network/blog/polet-at-the-international-energy-workshop-2024-future-growth-of-wind-and-solar-power-projected-by-historical-national-experience-m54xc",
  "title": "NEW STEPS kickoff meeting and Reference group workshop — POLET",
  "text": "NEW STEPS kickoff meeting and Reference group workshop The NEW STEPS research project (NuclEar and Wind Socio-TEchnical Pathways for Sweden) held its kickoff meeting in Gothenburg on October 24th. Researchers from Chalmers University of Technology (Jessica Jewell, Marta Vetier, Lisa Göransson and Simon Öberg) and Lund University (Aleh Cherp and Joel Gordon) discussed an action plan for examining which combination of low-carbon technologies and policies can best support a fossil-free Sweden. To get the discussions started, Aleh Cherp presented initial analysis of Swedish energy scenarios for NEW STEPS, bridging insights on how to examine the feasibility of different technologies, while anticipating their potential trajectories under net-zero assumptions. Lisa Göransson shared modelling results in the frame of the future European zero-emission electricity system, with a focus on developments in Nordic markets. Leveraging both research streams, NEW STEPS will develop anticipatory pathways of nuclear and wind power for Sweden based on insights from feasibility assessments of new technologies and modelling simulations. Additionally, NEW STEPS also held its first reference group meeting on November 4th to support the aim of communicating realistic storylines and actionable steps for a fossil-free Sweden. Our reference group includes seven experts with experience in energy policy planning, wind markets, and nuclear technologies. Following introductions, Jessica Jewell led a scenario construction exercise where reference group members identified and discussed the key technological, societal, economic and political driving forces that are expected to shape Sweden’s energy future. The exercise stimulated considerable engagement with the underlying drivers and barriers influencing the development of onshore and offshore wind power, different types of nuclear reactors, and hydrogen energy technologies both in Sweden and internationally. The NEW STEPS research team will convene again for a project meeting in early 2025 and meet again with the reference group in 2025 to develop further expert insights on the development of nuclear and wind power in Sweden. Get in touch with us if you are interested in NEW STEPS!"
}