{
  "url": "https://support.google.com/earth/answer/21955?hl=pt-BR",
  "title": "Instalar e desinstalar o Google Earth Pro - Ajuda do Google Earth",
  "text": "Importante: para usar o Google Earth Pro e os recursos associados a ele, é preciso ter as seguintes versões do app: - 7.1.8 ou mais recente. - A versão 7.3.3 ou mais recente é necessária para acessar o Google Street View no Google Earth Pro. Para instalar ou fazer upgrade para a versão mais recente do Google Earth Pro, faça o download do aplicativo. Requisitos do sistema Para que o Google Earth Pro seja executado no seu computador, é necessário atender a todos os requisitos mínimos do sistema. Configuração de sistema paraWindowsMínima: - Sistema operacional: Windows 7 - CPU: 1 GHz ou mais rápido - Memória do sistema (RAM): 2 GB - Disco rígido: 2 GB de espaço disponível - Conexão de Internet - Processador gráfico: compatível com DirectX 9 ou OpenGL 1.4 Recomendada: - Sistema operacional: Windows 7 ou mais recente - CPU: 2 GHz dual-core ou mais rápido - Memória do sistema (RAM): 4 GB - Disco rígido: 4 GB de espaço disponível - Conexão de Internet de alta velocidade - Processador gráfico: compatível com DirectX 11 ou OpenGL 2.0 Mínima: - Sistema operacional: Mac OS 10.8 - CPU: Intel de 64 bits - Memória do sistema (RAM): 2 GB - Disco rígido: 2 GB de espaço disponível - Conexão de Internet - Processador gráfico: compatível com OpenGL 1.4 Recomendada: - Sistema operacional: Mac OS 10.8 ou mais recente - CPU: Intel dual-core de 64 bits - Memória do sistema (RAM): 4 GB - Disco rígido: 4 GB de espaço disponível - Conexão de Internet de alta velocidade - Processador gráfico: compatível com OpenGL 2.0 Mínima: - Sistema operacional: Ubuntu 14/Fedora 23 (ou equivalente) ou mais recente - CPU: compatível com amd64, 1 GHz - Memória do sistema (RAM): 2 GB - Disco rígido: 2 GB de espaço disponível - Conexão de Internet - Subsistema gráfico 3D: compatível com OpenGL 1.4 Recomendada: - CPU: compatível com amd64, 2 GHz - Memória do sistema (RAM): 4 GB - Disco rígido: 4 GB de espaço disponível - Conexão de Internet de alta velocidade - Subsistema gráfico 3D: compatível com OpenGL 2.0 - Tela: 1.280 x 1.024, cores de 32 bits O Google Earth Pro é compatível com as versões mais recentes das distribuições Ubuntu e Fedora Linux, e também pode funcionar em outras distribuições conhecidas. Entretanto, devido à grande variedade de plataformas Linux disponíveis, isso não é garantido. Instalar o Google Earth Pro Instalar o Google Earth Pro no Windows- Faça o download do Google Earth Pro. - Clique duas vezes no arquivo e siga o processo de instalação. - Para abrir o Google Earth Pro, clique em Iniciar Programas Google Earth Pro. Depois, clique em \"Google Earth Pro\". - Faça o download do Google Earth Pro. - Abra \"GoogleEarthProMac-Intel.dmg\". - Abra o arquivo \"Install Google Earth Pro.pkg\" e siga o processo de instalação. - Para abrir o Google Earth Pro, abra a pasta \"Aplicativos\" e clique duas vezes no Google Earth Pro. Observação: durante o processo de instalação, o Mac OS X solicita uma senha de administrador. Essa informação nunca é compartilhada com o Google. Corrigir erros de instalação Antes de seguir as instruções abaixo: - Verifique se o sistema operacional é compatível. - Se estiver usando o Google Earth Pro, confirme se você tem direitos administrativos no computador ou faça a instalação usando uma conta de administrador na máquina local. Erro de MSI ou .dll - Desinstale sua versão do Google Earth Pro em Painel de Controle Desinstalar um programa. Observação: em algumas versões do Windows, é necessário clicar em Painel de Controle Adicionar ou remover programas. - Faça upgrade para a versão mais recente clicando no link de download do Google Earth Pro. Se você estiver com problemas para se conectar ao Google Earth Pro e seu computador tiver um software de firewall, é possível que o Earth esteja sem acesso à Internet. Exemplos de software de firewall/antivírus comuns: - McAfee Personal Firewall Plus (também incluso no McAfee Internet Security Suite) - ZoneAlarm - Norton Personal Firewall Para ajudar a resolver problemas de firewall nas suas preferências de software antivírus, verifique se: - o googleearth.exe não está bloqueado (apenas no Windows); - o acesso à \"porta 80\" está disponível para outros aplicativos além do navegador. Observação: antes da instalação do software Google Earth Pro, o Mac OS X solicitará que você insira uma senha de administrador. Essa informação nunca é compartilhada com o Google. Desinstalar o Google Earth Pro Desinstalar o Google Earth Pro em um PCVersões anteriores do Windows - Clique em Iniciar Configurações Painel de Controle. - Clique duas vezes em Adicionar ou Remover Programas. - Localize e selecione Google Earth Pro. - Clique em Remover Sim Concluir. Windows 7 e versões mais recentes - Clique em Iniciar Configurações Painel de Controle. - Clique duas vezes em Desinstalar um programa. - Localize e selecione Google Earth Pro. - Clique em Desinstalar. - Acesse a pasta \"Aplicativos\" e procure \"Google Earth Pro\". - Clique com o botão direito do mouse no ícone do Google Earth Pro e selecione Mover para a lixeira. Se você quiser remover todos os arquivos do Google Earth Pro do seu Mac, siga estas etapas: - Vá para o Finder. - Na parte superior, clique em Ir. - No teclado, pressione \"Alt\" e clique em Biblioteca. - Acesse Caches Google Earth Pro e exclua todos os arquivos. - Em seguida, acesse Biblioteca Suporte ao aplicativo Google Earth Pro e exclua todos os arquivos. Em versões anteriores do Mac OSX: - Vá para o Finder. - Abra o ícone \"Diretório principal\" que possui seu ID de usuário. - Acesse Biblioteca Caches Google Earth Pro e exclua todos os arquivos. - Em seguida, acesse Biblioteca Suporte ao aplicativo Google Earth Pro e exclua todos os arquivos."
}