{
  "url": "https://support.microsoft.com/de-de/surface/surface-pro-7-spezifikationen-und-features-8254894d-bb80-77ef-daae-612ea713e310",
  "title": "Surface Pro 7 – Spezifikationen und Features - Microsoft-Support",
  "text": "Surface Pro 7 – Spezifikationen und Features Gilt für Entdecken Sie den neuesten Surface Pro Profitieren Sie von flexibilitätsbasierter Tablet-zu-Laptop-Leistung auf einem leistungsstarken PC. Mit KI-beschleunigten Copilot+ PC-Erfahrungen und der ganztägigen Akkulaufzeit ist Surface Pro so aufgebaut, dass Sie unterwegs bleiben. Surface Pro 7 kennenlernen Das Surface Pro 7 ist leistungsfähiger als je zuvor und passt sich an Ihre Arbeitsweise an. Sie wissen nicht genau, welche Anschlüsse wozu dienen oder wie Sie die Lautstärke regeln? Wir klären Sie auf. Im Folgenden finden Sie einige Diagramme, die Ihnen helfen. - Volumen - Ein/Aus-Taste - Headset- und Mikrofonbuchse - Gesichtserkennungskamera für Windows Hello - Frontkamera - Studio-Mikrofone (duale Mikrofone) - USB-C-Port - USB-A-Anschluss - Surface Connect-Anschluss - microSDXC™ Karte Reader Surface Pro 7 und Windows 10 Surface Pro 7 enthält: - Windows 10 Home Edition (Privatkunden) - Windows 10 Pro-Edition (Geschäftskunden) Wenn Sie Windows 10 Home auf Ihrem Gerät ausführen, können Sie gegen eine zusätzliche Gebühr auf Windows 10 Pro upgraden. Weitere Informationen finden Sie unter Upgrade von Windows 10 Home auf Windows 10 Pro. Sie wissen nicht, welche Windows-Version Sie verwenden? Informationen dazu finden Sie unter Welches Windows-Betriebssystem wird derzeit ausgeführt?. Unter Welches Surface-Modell besitze ich? wird erläutert, wie Sie ermitteln können, welches Surface-Modell Sie verwenden. Hinweis: Sie können Ihr Surface Pro 7 auf Windows 11 aktualisieren. Weitere Informationen finden Sie unter Windows 11 Systemanforderungen. Aufladen Ihres Surface Sie können Ihr Surface mit USB-C oder Surface Connect aufladen. Weitere Informationen finden Sie unter Aufladen von Surface. Surface Pro 7-Features Arbeiten, wie Sie möchten Verwandeln Sie Surface Pro 7 mit dem Kickstand und dem Surface Signature Type Cover von einem Tablet in einen Laptop. Verwenden Sie die Anschlüsse USB-C und USB-A, um eine Verbindung mit Displays, Dockingstationen und Ihrem Zubehör herzustellen. Energie der nächsten Generation für Ihre Ideen Surface Pro 7 verwendet den Intel® Core™-prozessor der 10. Generation mit Konfigurationsoptionen von bis zu 16 GB RAM und 1 TB SSD. Mit Schnellladevorgang, Akkulaufzeit für den ganzen Tag und „Schnellem Hochfahren” können Sie Ihre Arbeit jederzeit fortsetzen. Drücken Sie Ihre Gefühle aus Surface Pro 7 ist in den Ausführungen Platingrau und Mattschwarz verfügbar, zudem ist das Surface Pro Signature Type Cover in neuen Farben erhältlich. Dank dem Dolby Audio Premium-Sound klingt Musik kristallklar und hell. Nutzen Sie die Dual-Far-Field-Studiomikrofone, wenn Sie das nächste Gespräch führen oder Sprachdiktate verwenden. Erreichen Sie mehr – mit dem Windows, das Sie kennen Genießen Sie vertraute Funktionen wie Windows Hello, um sich anzumelden, und Microsoft Edge. Mit Microsoft 365 können Sie Ihre besten Arbeiten erstellen und sicher in OneDrive speichern. Personalisieren Erfahren Sie mehr über das optionale Zubehör, das mit Ihrem Surface Pro 7 kompatibel ist. Holen Sie das Beste aus Ihrem Surface heraus. Erfahren Sie mehr über Ihr Surface, und passen Sie es mit der Surface-App an. Wählen Sie zum Öffnen Start aus, geben Sie Surface ein, und wählen Sie es aus, um die App zu öffnen. Wenn die App nicht geöffnet wird, rufen Sie sie aus dem Microsoft Store ab. Surface Pro 7 Technische Daten * Software und Zubehör sind separat erhältlich. [1] Akkulaufzeit Surface Pro 7: Bis zu 10,5 Stunden Akkulaufzeit basierend auf der typischen Verwendung von Surface-Geräten. Tests wurden von Microsoft im September 2019 mit Vorproduktionssoftware und Einem Intel® Core™ i5-Vorproduktionsgerät mit 256 GB und 8 GB RAM durchgeführt. Die Tests bestanden aus einer vollständigen Akkuentladung mit einer Mischung aus aktiver Nutzung und modernem Standby. Der aktive Nutzungsteil besteht aus (1) einem Webbrowsingtest, bei dem über mehrere offene Registerkarten auf 8 beliebte Websites zugegriffen wird, (2) einem Produktivitätstest unter Verwendung von Microsoft Word, PowerPoint, Excel und Outlook und (3) einem Zeitanteil, in der das Gerät mit Anwendungen im Leerlauf verwendet wird. Alle Einstellungen waren Standardeinstellungen, mit der Ausnahme, dass die Bildschirmhelligkeit auf 150 Nits bei deaktivierter automatischer Helligkeit eingestellt war. Das WLAN war mit einem Netzwerk verbunden. Die Akkulaufzeit hängt stark von Einstellungen, der Verwendung und anderen Faktoren ab.[2] Gewicht ohne Type Cover. [3] Systemsoftware belegt erheblichen Speicherplatz. Der verfügbare Speicherplatz kann sich aufgrund von Updates der Systemsoftware und der Verwendung von Apps ändern. 1 GB = 1 Milliarde Byte. 1 TB = 1.000 GB. Weitere Informationen finden Sie unter Surface.com/Storage. [4] Verfügbare Farben für Zubehör, Type Cover (separat erhältlich) und Surface Pro 7 können je nach Markt und Konfiguration variieren. [5] Erfordert ein Microsoft 365-Abonnement. [6] Die eingeschränkte Garantie von Microsoft gilt zusätzlich zu Ihren Verbraucherrechten."
}