{
  "url": "https://opendevelopmentmekong.net/topics/the-mekong/",
  "title": "The Mekong - Open Development Mekong",
  "text": "Introduction The Mekong River originates high in the Tibetan plateau and passes through six countries: China, Myanmar, Thailand, Laos, Cambodia and Vietnam. Estimated by the Mekong River Commission at just under 4909 kilometers long, it is the seventh longest river in Asia and the 10th longest in the world.1 The average mean discharge for the Greater Mekong Basin is about 460 km3 of water annually, making it 10th in water volume in the world. Approximately 60-65 million people live in the Lower Mekong Basin2, as well as 20,000 plant species, 430 mammal, 1,200 bird, 800 reptile and amphibian, and 850 fish species. The Mekong basin and associated river network. Distribution coverage by country: China (21 percent), Myanmar (3 percent), Lao People’s Democratic Republic (25 percent), Thailand (23 percent), Cambodia (20 percent) and Vietnam (8 percent). Map created by ODM. For the people living along the Mekong River, especially the 29.6 million living within 15km of the river, this great waterway plays both a cultural and economic role. Cultural practices, traditions, and holidays center around the river’s seasonal changes, and country economies depend on the resources and services of the river, which provides rice, fish, and water for domestic, municipal and industrial use. Any impacts to the river, especially if exacerbated by climate change, will have a devastating impact on those dependent on it, especially marginalized populations like women, indigenous peoples, and the poor. The People of the Greater Mekong River Basin People have lived in the Greater Mekong region for more than 4,000 years. These indigenous peoples and ethnic minorities continue to live in the region, each with their own traditional economic and cultural relationship to the natural environment. In the Kayah-Karen Tenasserin highlands between Thailand and Myanmar lives six different ethnic groups: The Akha, Hmong, Lu Mien, Karen, Lisu and Lahu peoples. In Thailand and Cambodia, 80% of the population is made up of minority ethnic groups like the Jarai, Kraol, Phnong, Ro Oung, Stieng, Oey, Kreung and Tampuan as well as Cham, Chinese, Khmer, Lao and Vietnamese. The Greater Annamite Mountains bordering Laos and Vietnam is home to 30 million people from 70 ethno-linguistic groups, such as the Ruc and Khamu Rok, who have inhabited this ecoregion for thousands of years. To the extent that they are able, indigenous peoples and ethnic minorities in the region continue to live off the land based on traditional customs. The Physiography of the Greater Mekong River Basin The Greater Mekong River Basin is 795,000 km2 in area, and is commonly divided into two parts: the Upper Basin, primarily in China (where it is called the Lancang), and the Lower Basin, generally described as south of China from Myanmar and ending in southern Vietnam, where the river empties into the South China Sea. While there are some differences of opinion on how to demarcate the upper and lower basins, the most common division is by national boundaries, with the Upper Basin entirely within China, and the Lower Mekong Basin everything below that. This is consistent with the Mekong River Commission’s descriptions of the Upper and Lower Mekong Basins.3 The entire Greater Mekong Basin may be further divided into seven sub-areas based on physical characteristics, including drainage patterns, landform and geology. These seven areas are: the Tibetan Plateau, the Three Rivers Parallel Area, the Lancang Basin (which make up the Upper Mekong), the Northern Highlands, Khorat Plateau, Tonle Sap Basin and Mekong Delta (which make up the Lower Mekong.4 The Upper Mekong The Upper Mekong Basin is divided into three areas: the Tibetan Plateau, Three Parallel Rivers Area, and Lancang Basin, all within China. The Tibetan Plateau or Three Rivers Source: The Mekong, called the Lancang in China, originates high in the Tibetan Plateau in southern Quinhai province. An area of about 316 km2 drains into the headwaters of the Mekong. Replenished by melting snow from the Himalayas, the river starts in the Jifu mountains, flowing approximately 450 km through Quinhai, and continuing through the Tibetan Autonomous Zone. The source of the Mekong (also known as “headwaters”) is protected by China’s Sanjiangyuan National and Nature Reserve—an area also known as the “Three Rivers Source” and the “Three Rivers’ Headwaters Natural Reserve Area”, since the Yellow and Yangtze rivers also originate there. The headwaters of the Salween (called the Nu River in China) originate just to the south of the Mekong. The Three Parallel Rivers Area: The Mekong then flows through the Three Parallel Rivers Protected Area in Yunnan Province; the three parallel rivers being the Mekong/Lancang, the Salween/Nu and Yangtse rivers. Consisting of eight geographical clusters, this area forms a 1.7 million hectare UNESCO heritage site. Here, the river runs through a deep ravine, with no tributaries joining it. The Upper Mekong, the Three Parallel Rivers, their basins, and the Sanjiangyuan National Nature Reserve in Yunnan. Map created by ODM. The Lancang Basin: From here the river flows into the Lancang Basin in lower Yunnan where it transitions from steep gradients to mid and lowland plains, broadening as it goes. South of the Three Rivers Area, the river continues to drop through highlands and plateaus that are still relatively elevated (2000-3000 meters above sea level), transitioning to mid and lowland reaches and broadening as it goes. Small tributary catchments drain into the river from both sides of the mainstream. About 50 percent of the sediment necessary for the downstream ecologies enters the river in the Upper Basin. The Upper Basin contributes about 20 percent of the total river flow, while during the dry season it accounts for 45 percent. Overall, the Upper Basin catchment is long and narrow, characterized by steep inclines. This is advantageous for the development of hydroelectric dams, which capture the power generated by water falling through steep gradients. China has built seven dams on the Upper Mekong and has plans for as many as 21 more. There continues to be considerable controversy about these dams since they have disrupted the natural flow of water and sediment to the lower Mekong countries. The Lower Mekong Basin The Lower Mekong Basin (LMB), stretching from the Chinese border in Myanmar to the South China Sea in southern Vietnam, is 630,000 km2 in area, and is critical to maintaining the Mekong River’s sensitive ecology, and the ecosystem services underlying the region’s water and food security. The interaction between the Mekong, its tributaries, and the surrounding forests is critical for the regulation of surface water, ground water and sediment. In particular, when water flows through the forest, organic matter from the forest floor is also carried to the flood plains, helping to replenish soil fertility. The LMB’s forests are also host to an astonishing range of biodiversity. The LMB is divided into four areas: The Northern Highlands, the Khorat Plateau, the Tonle Sap Basin, and the Mekong Delta. The Northern Highlands: This is an upland region that includes northeastern Myanmar, northern Thailand, and northern Laos. Tributaries entering the Mekong here include the Nam Ta, Nam Ou, Nam Soung, and Nam Khan on the left bank, and the Nam Mae Kok and Nam Mae Ing on the right bank. This region’s steep topography makes it attractive for hydropower development. The controversial Xayaburi Dam in Laos is in this stretch of the river. Thailand has also conducted feasibility studies for diverting water from the Kok and Ing basins into the Chao Praya basin. The Greater Annamite Mountains, which straddle the Laos-Vietnam border, is a particularly unique ecoregion that is also sustained by, and divides, the Mekong River. Comprising 75 Protected Areas, it has a distinctive geography and biodiversity. The Khorat Plateau: This is a low-lying plain, mostly within northeastern Thailand (Isaan) and covering about one third of the country. Major tributaries are the Songkhram and Mun rivers on the right bank, and the Nam Ca Dinh, Se Bang Fai, and Se Bang Hiang Rivers on the left bank. The area previously supported dry deciduous forest, but is now mostly deforested. The Khorat Plateau is one of the driest regions along the LMB. In 2016, the Thai government conducted feasibility studies to increase agriculture production to the arid Isaan region by diverting water through a giant tunnel from the Loei estuary, which drains into the Mekong.5 In February 2016, the Thai government began pumping water from the Huai Luang River—a Mekong tributary in Nong Khai province—with the intent to extract 47 million m3 of water in three months, to provide for irrigation during drought.6 While that action was temporary, Thailand’s National Water Resources Board also approved a much larger, permanent pumping station that may divert 150 m3 per second from the Mekong River,7 or 10 times the volume of pumping previously carried out.8 The Lower Mekong Basin. Map created by ODM. The Tonle Sap Basin: Beginning in southern Laos just north of Pakse, this area includes northern and central Cambodia and the 3S Basin, which is made up of the three major tributaries Se Kong, Se San, and Sre Pok rivers and the Tonle Sap Great Lake, which also drains into the Mekong. About 20 percent of the Mekong’s total sediment flow enters from the 3S Basin. 95 percent of its water flow has joined the mainstream by the time it enters Cambodia. The Tonle Sap, located in Cambodia’s central floodplain, is the largest lake in Southeast Asia and the most important inland fishery in Cambodia. It sustains vital fisheries, the floodplains where most of Cambodia’s rice is produced, and the Mekong Delta below. The Mekong’s flood pulse (or periodic flooding and drought) is an unusual characteristic that is key to this ecosystem. During the dry season, the Tonle Sap Lake drains into the Mekong via the 120 kilometer-long Tonle Sap River. During the wet season, the Mekong swells to as much as 30 times its dry season volume, causing the Tonle Sap to reverse the direction of its flow and spill into the floodplain. On average, the Tonle Sap expands from about 2500 km2 to as much as 15,000 km2, and increases in volume from 1.5 km3 (or a depth of about 1 meter) to between 60-70 km3 (a depth of about 10 meters). At the end of the wet season, when the Mekong River flow subsides, the Tonle Sap once again reverses and flows downstream draining the floodplain. This pulse flushes the lake and plain, preventing stagnation and redistributing organic matter and sediment that increases the fertility of the plain, while also creating an exceptionally productive ecosystem for fish. The biodiversity of the lake and floodplain is uniquely adapted to this cycle. Significant changes in the lake’s cycle brought about by alterations in hydrology and water quality—whether upstream or around the lake itself—could have disastrous effects. Heavy deforestation around the floodplains and chemical pollutants are taking their toll on the habitat. Upstream dams and water extraction, exacerbated by climate change, are also changing the amount and timing of water and sediment entering the sensitive system. Many indicators already point to problems in the ecosystem, and sharp declines have been documented in several large keystone fish species.9 Most recently, the Mekong River Commission issued a warning on the beautiful but worryingly blue colour of the Mekong in Thailand and Laos. For a river that is meant to have a murky hue due to sedimentation, the blue colour is a symptom of extraordinarily low water flows, decreased sedimentation, and the presence of algae.10 The Mekong Delta: The most densely populated section of the Mekong River, the Mekong Delta begins in Phnom Penh, Cambodia, where the Bassac River diverges from the mainstream Mekong. Together, the two rivers fan into a 62,520 km2 alluvial plain covering southern Vietnam from just north of Ho Chi Minh City. The Mekong crosses the border at Đồng Tháp province, where it is known as Sông Tiền or Tiền Giang. It flows through Long Xuyên, Sa Đéc and Vinh Long and then splits into four distributaries before exiting to the South China Sea. The Bassac, which flows south, enters Vietnam at Châu Đốc, where it becomes known as the Sông Hậu or Hậu Giang and passes through the major delta city of Cần Thơ. It disperses into three distributaries before exiting to the sea in Sóc Trăng. In Vietnam, the Mekong Delta is known as the Đồng Bằng Sông Cửu Long or ‘Nine Dragon River Delta’; the name is derived from the nine major channels. References - 1. Mekong River Commission. Mekong Basin. Accessed March 2, 2020. - 2. Ibid. - 3. Mekong River Commission. Physiography. Accessed March 2, 2020. - 4. Ibid. - 5. National News Bureau of Thailand. 2016. Large water transmission tunnel to be constructed for Northeast. Accessed September 2016. - 6. The Straits Times. 2016. Drought-hit Thailand taps Mekong water. Accessed September 2016. - 7. ABC News. 2016. Mekong River diverted into Thailand’s waterways, worrying drought-stricken neighbours like Vietnam. Accessed September 2016. - 8. The Straits Times. 2016. Drought-hit Thailand taps Mekong water. Accessed September 2016. - 9. Reef 2 Rainforest Media. 2015. Cambodia’s Amazon: the Tonle Sap. Accessed September 2016. - 10. Mekong River Commission. 2019. Mekong River’s aquamarine hue likely to occur elsewhere due to low flows, bringing possible risks. Accessed March 2, 2020."
}