{
  "url": "https://www.marcos.com/about-marcos/",
  "title": "Discover Marcos Pizza: Our Story & Online Ordering",
  "text": "Naturally, our love of making great pizza started back in the Old World, where our founder, Pasquale “Pat” Giammarco, learned the importance of doing things the right way. Obsess over the details. Take pride in what you make. Appreciate the best things in life—like Ah!thentic® Italian pizza! When he was nine years old, he moved with his family from Sulmona, Italy, to America, and he brought with him a dedication to never cutting corners. Pat founded Marco’s Pizza in 1978, and he’s been cutting delicious slices ever since. Our founder, Pat Giammarco’s vision wasn’t just to serve pizza, it was to serve quality pizza—and have people keep coming back for more. It worked! What was one store in the Toledo area is now over 1,100 stores across 33 states with locations in Puerto Rico and the Bahamas. Today, we are the fastest-growing pizza company in America and #5 in system wide sales*. We’re looking for operators who want to join an accelerating brand. Marco’s Pizza is the nation’s fastest-growing pizza brand*, recently crossing the $1B annual systemwide sales milestone. The achievement comes on the heels of record-breaking growth and is due in large part to its people-first culture that has helped catapult its strong performance as America’s No. 5 pizza brand in systemwide sales*. We opened our 1,100th store in 2022 and don’t plan on stopping there. That means we have great opportunities for people like you. Just like our fresh-made dough, these leaders rise to the top of our organization and to every opportunity that comes our way. Jack Butorac, Chairman & Co-Chief Executive Officer Tony Libardi, President & Co-Chief Executive Officer Marie Brown, VP of Franchise Relations & Market Planning Gerardo Flores, Chief Development Officer Denise Lauer, Chief Marketing Officer John Meyers, Chief Operating Officer Jeff Rager, SVP & Chief Financial Officer Rod Sanders, SVP & Chief Performance Officer Steve Seyferth, EVP Chief Growth Officer Danny Singh, SVP of Franchise Operations Rick Stanbridge, Executive Director of MTS & CIO Emeritus Kristin Corcoran, Chief Legal Counsel Milton Molina, VP of Store Technology Cathy Kinzer, VP of Supply Chain"
}