{
  "url": "https://www.space.com/space-exploration/artemis/nasa-delays-artemis-2-moon-launch-to-march-after-encountering-issues-during-fueling-test",
  "title": "NASA just delayed the Artemis 2 moon mission because its giant rocket has a leak — we've seen this before | Space",
  "text": "NASA just delayed the Artemis 2 moon mission because its giant rocket has a leak — we've seen this before Breaking space news, the latest updates on rocket launches, skywatching events and more! You are now subscribed Your newsletter sign-up was successful Want to add more newsletters? Delivered daily Daily Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Once a month Watch This Space Sign up to our monthly entertainment newsletter to keep up with all our coverage of the latest sci-fi and space movies, tv shows, games and books. Once a week Night Sky This Week Discover this week's must-see night sky events, moon phases, and stunning astrophotos. Sign up for our skywatching newsletter and explore the universe with us! Twice a month Strange New Words Space.com's Sci-Fi Reader's Club. Read a sci-fi short story every month and join a virtual community of fellow science fiction fans! Humanity's return to the moon will have to wait at least another four weeks. NASA had been targeting Feb. 8 for the launch of its Artemis 2 mission, which will send four astronauts on a 10-day trip around the moon and back to Earth. But the agency just moved the timeline back, after experiencing several issues during a key prelaunch exercise called a wet dress rehearsal. And some of those issues looked all too familiar to ones NASA saw on Artemis 1 in 2022. \"Engineers pushed through several challenges during the two-day test and met many of the planned objectives,\" NASA officials said in a statement early Tuesday morning (Feb. 3). \"To allow teams to review data and conduct a second wet dress rehearsal, NASA now will target March as the earliest possible launch opportunity for the flight test.\" There are five potential launch dates available in March for Artemis 2, which will lift off from NASA's Kennedy Space Center (KSC) in Florida: March 6-9 and March 11. If the mission can't make any of those dates, another window opens in April, with launch possible on April 1, April 3-6 and April 30. A wet dress rehearsal is a practice run through the operations that will precede an actual launch. Artemis 2's 49-hour wet dress officially began Saturday (Jan. 31) at 8:13 p.m. EST (0113 GMT on Feb. 1), when launch team members arrived at their stations at KSC. The team checked a lot of boxes over the next day and a half — powering up both stages of Artemis 2's Space Launch System (SLS) rocket, for example, and charging the flight batteries of the mission's Orion crew capsule. But the wet dress' main event came on Monday (Feb. 2) — the tanking test, which involved loading more than 700,000 gallons (2.65 million liters) of super-cold liquid hydrogen (LH2) and liquid oxygen (LOX) propellant into the SLS. Breaking space news, the latest updates on rocket launches, skywatching events and more! With the conclusion of the wet dress rehearsal today, we are moving off the February launch window and targeting March for the earliest possible launch of Artemis II.With more than three years between SLS launches, we fully anticipated encountering challenges. That is precisely…February 3, 2026 Artemis 1 experienced multiple LH2 leaks during its prelaunch campaign, which contributed to extensive delays for the mission. Originally slated to fly in spring 2022, Artemis 1 didn't get off the ground until that November. (The mission was successful, however, sending an uncrewed Orion to lunar orbit and back to Earth.) So leaks were on the minds of many space fans during the Artemis 2 wet dress — and they popped up on the pad Monday as well. \"During tanking, engineers spent several hours troubleshooting a liquid hydrogen leak in an interface used to route the cryogenic propellant into the rocket’s core stage, putting them behind in the countdown,\" NASA officials wrote in the Tuesday update. \"Attempts to resolve the issue involved stopping the flow of liquid hydrogen into the core stage, allowing the interface to warm up for the seals to reseat, and adjusting the flow of the propellant. \" The leaks observed on Monday appear similar to those that plagued Artemis 1's prelaunch campaign; they all involved LH2 and occurred at an interface with the tail service mast umbilical, a line that runs propellant to the SLS from the mobile launch tower. The launch team dealt with the Artemis 2 leak effectively, managing to fill the SLS' LOX and LH2 tanks and keep them topped up. However, the leak rate spiked again late in the wet dress' simulated countdown, causing NASA to end the exercise with about five minutes left on the clock. The launch team encountered a few other issues during the wet dress as well. For example, there were several dropouts of audio communications during the test, something that had also happened in the past few weeks leading up to the exercise. In addition, \"a valve associated with Orion crew module hatch pressurization, which recently was replaced, required retorquing, and closeout operations took longer than planned,\" NASA officials said in the update. (\"Closeout operations\" are those that ensure Orion is secure and ready for crew ingress. But astronaut boarding itself is not a wet dress milestone; the Artemis 2 crew did not participate in the test.) Speaking of the crew: The Artemis 2 quartet — NASA's Reid Wiseman, Victor Glover and Christina Koch, and Canadian astronaut Jeremy Hansen — have been in quarantine in Houston since Jan. 21 and were scheduled to travel to KSC on Tuesday to gear up for launch. They won't make that trip now, and they can exit quarantine; they'll have to go back into quarantine two weeks prior to the new target launch date. We'll learn more about the wet dress on Tuesday at 1 p.m. EST (1800 GMT), when the agency holds a press conference to discuss the results. You can watch it here at Space.com. Whenever the Artemis 2 astronauts fly, they'll make history: No human has been beyond low Earth orbit since December 1972, when the Apollo 17 astronauts returned from the moon. Michael Wall is a Senior Space Writer with Space.com and joined the team in 2010. He primarily covers exoplanets, spaceflight and military space, but has been known to dabble in the space art beat. His book about the search for alien life, \"Out There,\" was published on Nov. 13, 2018. Before becoming a science writer, Michael worked as a herpetologist and wildlife biologist. He has a Ph.D. in evolutionary biology from the University of Sydney, Australia, a bachelor's degree from the University of Arizona, and a graduate certificate in science writing from the University of California, Santa Cruz. To find out what his latest project is, you can follow Michael on Twitter. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name."
}