{
  "url": "https://forums.terraria.org/index.php?threads/1-4-4-terrasavr-web-based-inventory-editor.404/",
  "title": "Standalone - [1.4.4] Terrasavr, web-based inventory editor | Terraria Community Forums",
  "text": "YellowAfterlife Official Terrarian Terrasavr is a web-based inventory and profile editor. Being web-based means that you don't have to download it, and it will work for PC/Mac/Linux flawlessly. If you'd like to take a look without further ado, here goes: LAUNCH TERRASAVR Alternative version (if that doesn't work). Terrasavr beta (work-in-progress, mobile-friendlier) (also check out my blog or Twitter. I make games and other things.) In short, it's a stylish editor which works right in browser. Looks like this (357K GIF @ IMGUR): You can tweak stats, change colours, manage items, change prefixes... To make decisions easier, Terrasavr will also display full information about items upon hover: Also you can search for items. This works nicely and there's pagination: Of course, sometimes it's hard to remember everything, so there's also a \"library\" of commonly needed item sets: So one could say that it's pretty good, right? Logical points A list of things that I thought you may want to know: Things I currently plan to introduce later on Have a nice day! Being web-based means that you don't have to download it, and it will work for PC/Mac/Linux flawlessly. If you'd like to take a look without further ado, here goes: LAUNCH TERRASAVR Alternative version (if that doesn't work). Terrasavr beta (work-in-progress, mobile-friendlier) (also check out my blog or Twitter. I make games and other things.) - To search in item descriptions instead of titles, add a dot \".\" in start of search phrase. - You can start the program with search open (for quick reference/linking) by adding \"?q=name\" into end of URL. For example, Terrasavr - You can search in item descriptions by adding a dot \".\" in the start of search query - Holding left mouse button allows to pick a stack of items from library shelf (similar to how right mouse button works in actual game) You can download a version of Terrasavr for offline use from itch.io. If application does not run, or does not seem to have any effect, try the following steps in order: - If page appears blank or characters do not load, step 4 is to be taken first instead. It's also worth pointing out that program will not work correctly in Internet Explorer versions below 10. - Ensure that you do not have character open in the game, or game set at character selection screen. - Verify that you are using application correctly (see video in first spoiler). - Try running application in a different browser. - Try saving the output file under a different name and then copying it over the source file. If that fails, ensure that you have no other programs working with file at the moment. - Verify that you are actually changing the correct files (and not ones from other user account, for example). - If nothing worked after these, leave a detailed reply, or (better) a short video-capture of steps taken. In short, it's a stylish editor which works right in browser. Looks like this (357K GIF @ IMGUR): You can tweak stats, change colours, manage items, change prefixes... To make decisions easier, Terrasavr will also display full information about items upon hover: Also you can search for items. This works nicely and there's pagination: Of course, sometimes it's hard to remember everything, so there's also a \"library\" of commonly needed item sets: So one could say that it's pretty good, right? Logical points A list of things that I thought you may want to know: - Despite being web-based, program does not involve uploading or downloading files to/from a server - as soon as the page is loaded, there's no further interaction with server. This also means that program will work offline if page is cached. - Program is backwards compatible - for earlier versions of game format is kept intact, meaning that loading and saving a 1.2.0 profile would keep it 1.2.0-compatible. - While program will do it's best to not break anything, I suggest to make backups of profiles at least once in a while. - The one and primary requirement of program is a modern browser. This covers most browsers released in past year or so. Program may also work in certain mobile browsers like Chrome for Android. Don't expect it to load profiles from mobile version though. Things I currently plan to introduce later on - Either color wheels or color ramps for setting character colors. - More item collections to choose from. Have a nice day! Last edited:"
}