{
  "url": "https://www.tropicana.com/our-commitment/",
  "title": "Commitment to Quality – Tropicana",
  "text": "Commitment to quality We bottle up the brightness from the soil to the shelf. Picked at Their Peak We monitor more than 400 Florida groves through a proprietary system that ensures our oranges are harvested at their peak goodness and flavor. Each of our dedicated and experienced growers is passionate about making sure we pick our oranges at the perfect time for the juiciest flavor. Squeezed Fresh The fresh oranges are hand-graded and any fruit that doesn‘t meet our stringent standards is removed. Then the oranges are washed and the orange oil is extracted from the peel to capture the from-the-orange taste and aromas that are later carefully blended into the juice for consistent quality and flavor. The Perfect Blend The oranges Tropicana uses for its juices have different ripening seasons — so some stored juice is blended with fresh juice to deliver the most consistent and best-tasting juice. Pulp may be mixed in at this point, too, depending on the product. Our blend team and expert tasters manage the daily quality and regularly sample our juice to ensure consistent great taste. Purely Delightful 100% Juice No Added Sugar No Artificial Flavors No Artificial Colors No Preservatives Every 8oz glass of Tropicana Pure Premium® is 100% pure-squeezed orange juice. That’s it! Nutritious and Delicious Immune System Support A full day’s supply of Vitamin C* helps support the immune system. Strong Bones Vitamin D* helps your body absorb calcium to maintain strong bones and teeth. *Found in Tropicana® Orange Juice with Added Calcium & Vitamin D. Anti-Oxidation Vitamin C, a dietary anti-oxidant, works to protect the cells in the body to help maintain overall good health. Healthy Cell Development Folate (Vitamin B9) is important for normal cell growth – especially for the developing fetus. Energy Thiamine (Vitamin B1) helps convert food into energy. Healthy Heart Potassium helps regulate blood pressure, while Omega-3 may reduce coronary heart disease."
}