{
  "url": "https://techcommunity.microsoft.com/blog/microsoftteamsblog/what’s-new-in-microsoft-teams--december-2025/4482056",
  "title": "What’s New in Microsoft Teams | December 2025 | Microsoft Community Hub",
  "text": "As 2025 comes to a close, I want to thank you all for being part of the Microsoft Tech community! Your suggestions and feedback have been incredibly impactful as we’ve continued working toward our goal of making Teams smarter, more secure, and easier to use. In 2026, you can look forward to new ways to collaborate and do more, with Teams as the platform where people and agents collaborate together. We hope you’ll keep sharing your experience with new Teams features in the new year! To wrap up the year and lead into the next, we’re announcing some new features that can help you customize Teams for the way you like to work and make your conversations and connections more secure. “Pop out core Teams functions into a new window” gives you the ability to organize the elements of Teams that you use most frequently however you want on your desktop. “Tenant-Owned Domain Impersonation Protection for Teams Messaging” analyzes the identity and domain authenticity of external users when they make their first contact with you, to make sure they’re not impersonating your organization’s domain. These and all the other features below are now available, so give them a try and let us know what you think. Best wishes for a very happy and productive start to 2026! Meetings, webinars, and town halls Chat and Collaboration Pop out your core Teams functions into a new window You can now organize your work environment to fit your needs by opening Teams chat, calls calendar, activity, and more in separate windows. This gives you the flexibility to multitask and organize your workspace the way you want. Whether you're catching up on chats while reviewing call history or managing notifications alongside your calendar, this update helps you stay productive without switching tabs. Simply right-click an app icon or use the app flyout to pop it out into its own window. Joining a private team by code now requires owner approval Joining a private team using a code now requires a team owner’s approval. This update gives team owners more control and boosts security by ensuring every new member is approved even when using a Join code. This helps prevent unintended or unauthorized access to private teams while keeping code-based joining convenient for those who are authorized. Meetings, webinars, and town halls Enhancements to Interpreter and multilingual meeting experience Spoken language is now automatically detected and updated across Interpreter, live captions, and live transcription when Interpreter is enabled, keeping all speech features consistent with the language being spoken – no manual setup required. When Interpreter is disabled, live captions and transcription will still work, but auto-update spoken language will not be available, and meeting participants will need to speak in the spoken language manually selected in the meeting settings to ensure accuracy. Additionally, a new “preparing” status provides clear visual feedback while Interpreter initializes, helping users know when the system is ready – especially important for multilingual meetings. Interpreter settings have also been improved with concise explanations for each configuration and field, making setup easier and minimizing confusion. Teams Phone Microsoft 365 Copilot chat in Calls app post-calling experience – Generally available The post-call Copilot experience for Teams Phone on desktop and in mobile is now powered by Microsoft 365 Copilot Chat. After a call ends, users can open Microsoft 365 Copilot Chat as a side panel in the Teams ‘Calls’ app to generate summaries, surface key insights, and get suggested next steps. By using data from Microsoft Graph and the web—not just the call transcript—Microsoft 365 Copilot Chat delivers responses that are more personalized, relevant, and actionable, helping users quickly move from conversation to follow-up. Compliance Recording ISV Support for Call Queues in Microsoft Teams Phone Teams Phone now supports third‑party ISV compliance recording at the call queue level, giving organizations a simpler and more consistent way to meet regulatory requirements. Recording is applied at the queue—rather than per individual calling representative—so every call routed through that queue is automatically captured by the organization’s chosen compliance solution. This approach is especially useful for large enterprises and dynamic support teams where calling representative membership frequently changes. Admins can apply a single queue-level policy to ensure all incoming calls are recorded compliantly without managing individual calling representative user settings. Learn more. Fundamentals and Security Tenant-Owned Domain Impersonation Protection for Teams Messaging Own Domain Impersonation Detection in Teams identifies if an external user comes from a domain that is impersonating the recipient tenant's own domains during their initial contact with an enterprise user via Teams messages. This helps to protect users from bad actors spoofing tenant domains by analyzing sender identity and domain authenticity in real time, alerting users to suspicious activity and reducing phishing risks across messaging. Frontline Worker Solutions Frontline Hub Say goodbye to scattered tools and fragmented workflows. Frontline hub brings everything you need to deploy, manage, and monitor frontline Teams experiences into one streamlined destination—now available on the manage frontline teams page in the Teams Admin Center. With dynamic recommendations tailored to your deployment journey, frontline hub helps you deploy faster, simplify management, and deliver connected experiences that empower your frontline workforce. Teams Devices and Peripherals EPOS IMPACT 500 MS UC ANC WL USB-C+A Headset Designed for modern communication, IMPACT 500 delivers clarity and comfort all day. Certified for Microsoft Teams Open Office with a future software release that will add support for Teams over native Bluetooth® - for dongle free calls. EPOS microphone technology blocks out background noise for clear, precise speech and focused conversations. Hybrid ANC and EPOS BrainAdapt™ reduce noise and listening fatigue in the open office, while an impressive 35 hours of talk time keeps you connected longer. EPOS IMPACT 400 ANC Headset The IMPACT 400 delivers the focus and clarity professionals need to communicate seamlessly across office and home environments. Equipped with EPOS Hybrid ANC, it balances noise reduction for distraction-free focus, while four AI-powered microphones ensure your voice is transmitted clearly—even in noisy surroundings. Certified for Microsoft Teams Open Office, the IMPACT 400 delivers reliable performance in any environment. With plug-and-play connectivity and intuitive functions like lift-to-mute the IMPACT 400 combines effortless usability with all-day comfort, making it an ideal choice for professionals who demand clarity and productivity throughout their workday. Lenovo Webcams: FHD, QHD and 4K Pro The Lenovo FHD Webcam is a FHD webcam with1080P resolution, leading image quality, and a focus on design that delivers unparalleled clarity and functionality for users in various work environments. The Lenovo QHD Webcam provides 2K resolution, superior image quality, innovative design, and seamlessly integrates into collaborative work environments. Advanced AI features like auto-framing, face AE/AF, and AI noise reduction enhance communication and productivity. It's not just a webcam; it's a comprehensive video conferencing solution with advanced technology and functionality. The Lenovo 4K Pro Webcam delivers 4K resolution and exceptional performance in low-light settings, and is equipped with AI, making it a complete communication solution. Lenovo Dual-mode Wireless ANC Headset 6550 (USB-A and USB-C) For professionals in open offices or hybrid work setups, the Lenovo Dual-Mode Wireless ANC Headset 6550—a Microsoft Teams certified headset for open office—elevates workplace communication to a new standard. It provides stable call performance and seamless integration with Microsoft Teams. Equipped with hybrid ANC (Active Noise Cancellation) and AI-powered ENC (Environmental Noise Cancellation) technologies, it effectively blocks out ambient distractions even in bustling, high-noise environments so that every word in calls is clear. Designed for all-day wear and certified by SGS, its ergonomic structure, premium leatherette, and memory foam deliver long-lasting comfort; meanwhile, its intelligent dual connectivity enables smooth, instant switching between devices (such as PCs and smartphones). Tailored for dynamic workspaces, this headset stands as a dependable tool to help professionals stay focused and boost productivity. Yealink Solutions for Teams Rooms The Yealink MVC S90 is an intelligent Dual-cam solution for Microsoft Teams Rooms, designed to enhance collaboration and is ideal for large meeting spaces. This set includes the new generation mini-PC MCore 4, the 11.6-inch touch panel MTouch Plus, the intelligent dual-lens camera UVC86, the audio and video processor AVHub, the intelligent detect sensor RoomSensor, and BYOD-Extender. The Yealink S50 is ideal for medium meeting spaces. This set includes the new generation mini-PC MCore 4, the 11.6-inch touch panel MTouch Plus, the MeetingBar A50 all-in-one video bar with USB mode, and the intelligent detect sensor RoomSensor. The Yealink MVC S40 is designed for small meeting spaces, and includes the new generation mini-PC MCore 4, the 11.6-inch touch panel MTouch Plus, the SmartVision 40 all-in-one video bar, and the intelligent detect sensor RoomSensor."
}