{
  "url": "https://www.vanderbilthealth.com/locations/vanderbilt-birth-center",
  "title": "Vanderbilt Birth Center | Vanderbilt Health Nashville, TN",
  "text": "Vanderbilt Birth Center As the region's only out-of-hospital birth center, we’re proud to deliver a complete care experience for pregnant people and families. No matter where you are in your fertility, pregnancy or parenting journey, we’re here to support you. We offer a range of services including wellness coaching, prenatal care, postpartum support, family planning, well-person care and educational classes. Download our Treatment Guide Learn more about - Guidance for selecting the best type of obstetric... Vanderbilt Birth Center Tour Why Choose the Vanderbilt Birth Center - Personalized care We tailor your care plan to meet your unique needs and health goals. We offer prenatal care at the same location where you will give birth, so you will be familiar with the space before your labor and birth experience. Our goal is to get you back home and comfortable in your own bed after your labor and birth experience, so you postpartum stay will be shorter than it would be in the hospital. - Team approach Our collaborative midwife and OB/GYN team provides personalized care to ensure you are listened to, cared for, comfortable and safe. We offer all of the support you need, no matter what surprises or challenges may come up along the way. We are committed to caring for you and your unique needs with compassion and expertise. - Birth suites Our birth suites provide a comfortable place to give birth and bond with your baby. Our suites include queen-sized beds, in-suite bathrooms, hydrotherapy birth tubs, Swedish bars and ambience control, like dimmers on the lights and temperature control. We can customize the space to provide the birth experience that you want. - Support Part of what makes our experience special is the welcoming community we help create for birthing people, partners and families. We host a variety of classes, events, meetups and groups to help families build their support systems in-person and online. - Educational Resources We offer a wide variety of education classes to our patients and their families, including classes focused on birthing, preparing for baby and early parenting. Services We Provide If needed, maternal-fetal medicine neonatal specialty care are provided at Vanderbilt University Hospital and Monroe Carell Jr. Children's Hospital at Vanderbilt. - 24/7 labor and delivery service - Birth center delivery - Family planning - Fertility counseling - Hydrotherapy and water births - Lactation guidance - Midwifery services - Postpartum care - Preconception care - Prenatal care and testing - Primary care - Health and wellness coaching - Well-woman care Programs and Clinics Meet Your Care Team Loading map ..."
}