{
  "url": "https://www.spanishdict.com/translate/veres",
  "title": "Veres | Spanish to English Translation - SpanishDictionary.com",
  "text": "veres Plural of ver RELATED ARTICLES ver( behr )A transitive verb is a verb that requires a direct object (e.g., I bought a book.). 2. (to observe) a. to watch Se sentaron en el sofá a ver su programa de televisión favorito.They sat on the sofa to watch their favorite television program. b. to look at Me gusta ir a ver los cuadros en el museo.I like to go look at paintings in the museum. c. to see He leído el libro, pero no he visto la película. ¿Es buena?I've read the book but haven't seen the movie. Is it any good? 3. (to notice) a. to see ¿Tú ves la diferencia entre esta camisa y la azul?Do you see the difference between this shirt and the blue one? 4. (to verify) a. to see Este campo vio la muerte de muchos durante la guerra.This field saw the death of many during the war. b. to witness Esta ciudad ha visto tiempos buenos y malos.This city has witnessed good times and bad. c. to live through Mi abuelo ha visto cuatro guerras y sigue siendo optimista.My grandfather has lived through four wars, and he's still an optimist. 8. (to picture) b. to imagine Todavía los puedo ver como si fuera ayer.I can still imagine you guys like it was yesterday. 9. (to meet) 10. (legal) 11. (to study) a. to look at El semestre que viene veremos el impacto de las empresas sobre el medioambiente.Next semester we will look at the impact of companies on the environment. An intransitive verb is one that does not require a direct object (e.g., The man sneezed.). 13. (to observe) a. to watch Mamá, ¡ve! Puedo manejar el carro yo solito.Mom, watch! I can drive the car all by myself. 14. (to verify) 15. (to consider) 16. (to comprehend) a. to see ¿Ya ves? - No, no veo. Explícame de nuevo la situación.You see? - No, I don't see. Explain the situation to me again. A masculine noun is used with masculine articles and adjectives (e.g., el hombre guapo, el sol amarillo). 18. (appearance) a. no direct translation This refers to an idiomatic word or phrase for which there is no word-for-word translation. Ese actor no es de mal ver, pero a mí no me gusta.That actor isn't bad-looking, but I don't find him attractive. ¿Cómo es tu prima? - Es inteligente, trabajadora, y además tiene buen ver.What's your cousin like? - She's smart, hardworking, and she's also good-looking. verse A reflexive verb is a verb that indicates that the subject performs an action on itself (e.g., Miguel se lava.). Me quiero ver en el espejo a ver cómo me queda el corte de pelo.I want to see myself in the mirror to see how my haircut looks. a. to see oneself No me veo trabajando aquí de por vida.I don't see myself working here for the rest of my life. A pronominal verb always uses a reflexive pronoun. (e.g., Te ves cansado.). A reciprocal verb is a verb that indicates that two or more subjects perform an action on each other (e.g., Ellos se abrazan.). Vocabulary Lists See more lists Examples Conjugations Random Word Roll the dice and learn a new word now! Want to Learn Spanish? Spanish learning for everyone. For free."
}