{
  "url": "https://www.gotquestions.org/life-Samuel.html",
  "title": "Who was Samuel in the Bible? | GotQuestions.org",
  "text": "Answer Samuel, whose name means âheard of God,â was dedicated to God by his mother, Hannah, as part of a vow she made before he was born (1 Samuel 1:11). Hannah had been barren and prayed so fervently for a child that Eli the priest thought she was drunk (1 Samuel 1). God granted Hannahâs request, and, true to her promise, Hannah dedicated Samuel to the Lord. After Samuel was weaned, likely around the age of four, he was brought to the tabernacle to serve under Eli the priest (1 Samuel 1:22â25). Even as a child, Samuel was given his own tunic, a garment normally reserved for a priest as he ministered before the Lord in the tent of meeting at Shiloh, where the ark of the covenant was kept (1 Samuel 2:18; 3:3). Traditionally, the sons of the priest would succeed their fatherâs ministry; however, Eliâs sons, Hophni and Phinehas, were wicked in that they were immoral and showed contempt for the Lordâs offering (1 Samuel 2:17, 22). Meanwhile, Samuel continued to grow in stature and in favor with the Lord and with men (1 Samuel 2:26). At a time when prophecies and visions were rare, Samuel heard what he first believed to be Eli calling him during the night. Though the young Samuel was ministering in the tabernacle, he still didnât know the Lord, and the word of the Lord had not yet been revealed to him (1 Samuel 3:7). The first three times the Lord called Samuel, the boy responded to Eli. Eli then understood what was happening and instructed Samuel to respond to the Lord if he called again. Then, \"The LORD came and stood there, calling as at the other times, âsamuel! Samuel!' Then Samuel said, âspeak, for your servant is listening'\" (1 Samuel 3:10). God gave him a message of judgment to relay to Eli. The following day, Samuel took his first leap of faith, telling Eli everything, even though the message was bad news for Eli and his family (1 Samuel 3:11â18). Eli responded with acceptance. Samuelâs credibility as a prophet spread throughout Israel, and God continued to reveal His Word to His people through Samuel (1 Samuel 3:20â21). The Philistines, perennial enemies of Israel, attacked Godâs people. Eliâs sons were killed in the battle, and the ark of the covenant was captured and taken to Philistia. Upon hearing the news of his sonsâ deaths, Eli also died. After several months, the Philistines returned the ark to Israel, where it remained at Kiriath Jearim for over twenty years. As the Israelites cried out to God for help against the Philistine oppressors, Samuel instructed them to be rid of the false gods they had been worshiping. With Samuelâs leadership, and by Godâs power, the Philistines were overcome, and there was a time of peace between them (1 Samuel 7:9â13). Samuel was recognized as the judge of all Israel. Like Eliâs sons, Samuelâs two sons, Joel and Abijah, sinned before God by seeking dishonest gain and perverting justice. Samuel had appointed his sons as judges, but the elders of Israel told Samuel that because he was too old and his sons did not walk in his ways, they wanted Samuel to appoint a king to rule like other nations had (1 Samuel 8:1â5). Samuelâs initial reaction to their demand was one of great displeasure, and he prayed to God about the matter. God told Samuel that they had not rejected him, but had rejected God as their king. God gave Samuel leave to permit their request but warned the people what they could expect from a king (1 Samuel 8:6â21). In time, Saul, a Benjamite, was anointed by Samuel as Israelâs first king (1 Samuel 10:1). Even so, Samuel called on God for a sign to show the Israelites the evil of choosing to replace their true kingâGodâwith an earthly king (1 Samuel 12:16â18). After a time, Samuel learned that Saul had been rejected by God to lead His people because of Saulâs disobedience (1 Samuel 13:11â13). Samuel immediately warned Saul that God had already sought out a replacement for him (1 Samuel 13:14). After Saul continued to disobey, Samuel denounced him as king (1 Samuel 15:26). Samuel returned home, never to be at King Saulâs side again, but he mourned for him (1 Samuel 15:35). God instructed Samuel to choose another king from the family of Jesse (1 Samuel 16:1), and Samuel anointed Jesseâs youngest son, David (1 Samuel 16:13). Samuel died before David was made king, though, and \"all Israel assembled and mourned for him\" (1 Samuel 25:1). The life of Samuel was pivotal in Israelâs history. He was a prophet, he anointed the first two kings of Israel, and he was the last in the line of Israelâs judges, considered by many as the greatest judge (Acts 13:20). Samuel is cited alongside Moses and Aaron as men who called on God and were answered (Psalm 99:6). Later in Israelâs history, when the Israelites were living in disobedience to God, the Lord declared they were beyond even the defense of Moses and Samuel, two of Israelâs greatest intercessors (Jeremiah 15:1). This is a clear indication of the power of Samuelâs prayersâand the depth of Israelâs sin in Jeremiahâs day. There is much to learn from the life of Samuel. In particular, we see the sovereignty of God in Israel, no matter whom the people chose to reign over them. We may allow other things or people to occupy the throne of our hearts, but God will always remain sovereign and will never accept usurpers to His authority in the lives of His subjects. We can imagine how daunting it must have been for the young Samuel to give an honest account of his first vision to Eli. However, it appears that, even from a young age, Samuelâs absolute allegiance was to God first. There may be times when we feel intimidated by those in authority, but, as Samuel proved more than once, it is God who must remain our priority. The world may look on us cynically when we remain steadfast in our faith. However, we can be confident that God will vindicate those who have remained faithful to His Word (Psalm 135:14). Though Samuel had deep reservations about letting the people have a king, he was quick to consult God about the matter and abided by His decision (1 Samuel 8:6â7). Many of us may consult God about important decisions in our lives, but how many of us are ready to accept His counsel and abide by it, especially when it appears to go against our own desires? Leaders in particular can learn from Samuelâs example of the power he derived from his close relationship with God, generated by a healthy prayer life. Samuel was a great man of prayer, and his people respected him for it (1 Samuel 12:19, 23). Even though Samuel was aware of the evil in Saulâs life, he never stopped praying and mourning for him. Indeed, Samuel described it as a sin not to pray for the people under his care. Perhaps too quickly we may deem a brother beyond restoration when we see him fall into sin. Certainly, Godâs plans for each individual will come to pass, but it should never stop us from continuing to pray and care for those who are weaker in their faith (Romans 15:1; 1 Thessalonians 5:14). The main theme throughout Samuelâs life is that God alone should receive the glory and honor. After making his sons judges, it must have been a very sad thing for Samuel to learn that they were unfit to lead. When he consulted God about the peopleâs request for a king, nothing was said in defense of his sons. Samuel was obedient to Godâs instructions to give the people what they wanted. A key verse in the life of Samuel relates his words to King Saul: âBut Samuel replied: âDoes the Lord delight in burnt offerings and sacrifices as much as in obeying the voice of the Lord? To obey is better than sacrifice, and to heed is better than the fat of ramsââ (1 Samuel 15:22). Obedience to Godâs Word must always be our top priority."
}