{
  "url": "https://www.learnreligions.com/about-santeria-traditions-2562543",
  "title": "What Is Santeria?",
  "text": "Other Religions Paganism and Wicca Basics What is Santeria? Print Santeria 'babalawo' Victor Omolofaoro Betancourt, Havana, Cuba, 2002. Sven Creutzmann/Mambo Photo / Getty Images Paganism and Wicca Basics Rituals and Ceremonies Sabbats and Holidays Wicca Gods Herbalism Wicca Traditions Wicca Resources for Parents By Patti Wigington Patti Wigington Paganism Expert B.A., History, Ohio University Patti Wigington is a pagan author, educator, and licensed clergy. She is the author of Daily Spellbook for the Good Witch, Wicca Practical Magic and The Daily Spell Journal. Learn about our Editorial Process Updated on February 13, 2019 Although Santeria is a religious path that is not rooted in Indo-European polytheism like many other contemporary Pagan religions, it's still a faith that is practiced by many thousands of people in the United States and other countries today. Did You Know? Santeria combines influences of Caribbean tradition, West Africa's Yoruba spirituality, and elements of Catholicism. To become a Santero, or high priest, one must pass a series of tests and requirements prior to initiation. In a landmark 1993 case, the Church of Lakumi Babalu Aye successfully sued the city of Hialeah, Florida, for the right to practice animal sacrifice within a religious context; the Supreme Court determined that it was a protected activity. The Origins of Santeria Santeria is, in fact, not one set of beliefs, but a \"syncretic\" religion, which means it blends aspects of a variety of different faiths and cultures, despite the fact that some of these beliefs might be contradictory to one another. Santeria combines influences of Caribbean tradition, West Africa's Yoruba spirituality, and elements of Catholicism. Santeria evolved when African slaves were stolen from their homelands during the Colonial period and forced to work in Caribbean sugar plantations. Santeria is a fairly complex system, because it blends the Yoruba orishas, or divine beings, with the Catholic saints. In some areas, African slaves learned that honoring their ancestral orishas was far safer if their Catholic owners believed they were worshiping saints instead - hence the tradition of overlap between the two. The orishas serve as messengers between the human world and the divine. They are called upon by priests by a variety of methods, including trances and possession, divination, ritual, and even sacrifice. To some extent, Santeria includes magical practice, although this magical system is based upon interaction with and understanding of the orishas. Santeria Today IulianUrsachi / Getty Images Today, there are many Americans who practice Santeria. A Santero, or high priest, traditionally presides over rituals and ceremonies. To become a Santero, one must pass a series of tests and requirements prior to initiation. Training includes divinatory work, herbalism, and counseling. It is up to the orishas to determine whether a candidate for priesthood has passed the tests or failed. Most Santeros have studied for a long time to become part of the priesthood, and it is rarely open to those who are not part of the society or culture. For many years, Santeria was kept secret, and limited to those of African ancestry. According to the Church of Santeria, \"Over time, African people and European people began to have children of mixed ancestries and as such, the doors to Lucumí slowly (and reluctantly for many people) opened to non-African participants. But even then, the practice of Lucumí was something you did because your family did it. It was tribal – and in many families it continues to be tribal. At its core, Santería Lucumí is NOT an individual practice, is not a personal path, and is something you inherit and pass on to others as elements of a culture that survived the tragedy of slavery in Cuba. You learned Santería because it was what your people did. You practice Santería with others in the community, because it serves the greater whole.\" There are a number of different orishas, and most of them correspond to a Catholic saint. Some of the most popular orishas include: Elleggua, who is similar to the Roman Catholic Saint Anthony. Elleggua is the lord of the crossroads, serving as a liaison between man and the divine, and has very great power indeed. Yemaya, the spirit of motherhood, is often associated with the Virgin Mary. She is also affiliated with moon magic and witchcraft. Babalu Aye is known as the Father of the World, and is associated with sickness, epidemics and plagues. He corresponds to the Catholic Saint Lazarus. Connected to healing magic, Babalu Aye is sometimes called upon as a patron of those suffering from smallpox, HIV/AIDS, leprosy, and other infectious diseases. Chango is an orisha who represents powerful masculine energy and sexuality. He is a being associated with magic, and may be invoked to remove curses or hexes. He ties strongly to Saint Barbara in Catholicism. Oya is a warrior, and the guardian of the dead. She is associated with Saint Theresa. It is estimated that about a million or so Americans currently practice Santeria, but it's hard to determine whether this count is accurate or not. Because of the social stigma commonly associated with Santeria by followers of mainstream religions, it is possible that many adherents of Santeria keep their beliefs and practices secret from their neighbors. Santeria and the Legal System Driendl Group / Getty Images A number of adherents of Santeria have made the news lately, because the religion does incorporate animal sacrifice — typically chickens, but sometimes other animals such as goats. In a landmark 1993 case, the Church of Lakumi Babalu Aye successfully sued the city of Hialeah, Florida. The end result was that the practice of animal sacrifice within a religious context was ruled, by the Supreme Court, to be a protected activity. In 2009, a federal court ruled that a Texas Santero, Jose Merced, could not be prevented by the city of Euless from sacrificing goats in his home. Merced filed a lawsuit with city officials said he could no longer perform animal sacrifices as part of his religious practice. The city claimed \"animal sacrifices jeopardize public health and violate its slaughterhouse and animal cruelty ordinances.\" Merced claimed he had been sacrificing animals for over a decade without any problems, and was willing to \"quadruple bag the remains\" and find a safe method of disposal. In August 2009, the 5th U.S. Circuit Court of Appeals in New Orleans said the Euless ordinance \"placed a substantial burden on Merced's free exercise of religion without advancing a compelling governmental interest.\" Merced was pleased with the ruling, and said, \"Now Santeros can practice their religion at home without being afraid of being fined, arrested or taken to court.\" Cite this Article Format mla apa chicago Your Citation Wigington, Patti. \"What is Santeria?\" Learn Religions, Jun. 25, 2024, learnreligions.com/about-santeria-traditions-2562543. Wigington, Patti. (2024, June 25). What is Santeria? Retrieved from https://www.learnreligions.com/about-santeria-traditions-2562543 Wigington, Patti. \"What is Santeria?\" Learn Religions. https://www.learnreligions.com/about-santeria-traditions-2562543 (accessed February 5, 2026). copy citation"
}