{
  "url": "https://www.polygon.com/pokemon-legends-arceus-guide-pla/22912957/shiny-hunting-odds-charm-rates-locked/",
  "title": "Pokémon Legends Arceus Shiny hunting guide",
  "text": "Pokémon Legends: Arceus introduces the easiest Shiny hunting to the Pokémon franchise, allowing players to nab Shiny Pokémon using mass outbreaks. Our Pokémon Legends: Arceus Shiny hunting guide explains how to find Shiny Pokémon, what the Shiny rate is, and how to get the Shiny Charm. What’s the Shiny rate in Pokémon Legends: Arceus? As with other Pokémon games, the standard Shiny rate in Pokémon Legends: Arceus is 1/4096, according to Serebii.net. However, mass outbreaks increase the Shiny chance to a whopping 1/158.2 chance, making it one of the best ways to find Shiny Pokémon. If the Pokémon you’re hunting has a completed Pokédex entry (level 10), then the chance to find them Shiny increases. For general hunting, it doubles to a 1/2048.5 chance. In mass outbreaks, it goes up to a 1/152.9 chance. If you have a perfect Pokédex entry for that Pokémon, then the general chance to find them Shiny doubles again to a 1/1024.38 chance. For mass outbreaks, it goes up to a 1/141.7 chance. Once you get the Shiny Charm item, the chances to find Shiny Pokémon increases yet again. Since you need level 10 Pokédex entry for each Pokémon to get the Shiny Charm, this makes the standard rate to find a Shiny 1/819.6. The Shiny rate in mass outbreaks then becomes 1/137.02. With a perfect Pokédex entry and the Shiny Charm, the standard Shiny rate is 1/585.57 and the mass outbreak rate is 1/128.49. How do I find Shiny Pokémon? The best way to hunt Shiny Pokémon is through a mass outbreak. Since mass outbreak spawns are random, it’s a good idea to complete the Pokédex entry for any of your favorite Pokémon, so you’ll be ready when they appear in a mass outbreak. The Jubilife Village guard you talk to when you leave the village will warn you of a mass outbreak when it’s happening and an icon of the outbreaking Pokémon will appear over the area its in. To Shiny hunt in a mass outbreak, do the following: - Turn off auto-save in the game settings. - Go to the area the mass outbreak is in. - Prepare any extra Poké Balls you may need at the crafting bench. - Save your game manually. - Head to the mass outbreak spot. - Catch or K.O the Pokémon until they stop respawning. (There will be four Pokémon in the outbreak at a time. Once there is less than four, the outbreak is ending.) - If there was no Shiny, close and relaunch the game. - In the newly relaunched game, go back to Jubilife Village. - Check to see if the mass outbreak is still there. If it’s not, close and reset again. - If the mass outbreak is still there, go back to a base camp in that area and save. - Repeat steps 5-10 as needed until you get your Shiny. Do NOT save in Jubilife Village, as this will potentially ruin the mass outbreak. In addition, do not save once you actually encounter the mass outbreak or else it will be gone when you reload your game. Notably, if you end up finding a Shiny and it runs away or gets knocked out, you can restart your game and head straight to the outbreak from the base camp, rather than returning back to Jubilife Village again. How do I get the Shiny Charm? To get the Shiny Charm, you will need to complete your Pokédex beyond catching one of everything. You’ll need to hit research level 10 on each Pokédex entry, which you can do by catching multiple of each Pokémon, battling them, seeing them use different moves, and even feeding them. To do this quickly, we recommend catching one of everything and then using that Pokémon in battles until the Pokédex entry is marked as complete. Once you do this, you can talk to Professor Laventon in Galaxy Hall for your Shiny Charm. What Pokémon are Shiny locked? A few Pokémon you get through special methods are Shiny locked. This means you cannot reset your game to get these Pokémon Shiny. This includes: - Oshawott, Rowlett, and Cyndaquil (the ones you get from Professor Laventon) - Uxie, Mesprit, and Azelf - Dialga and Palkia - Heatran, Regigigas, and Cresselia - Giratina - Tornadus, Thundurus, Landorus, and Enamorus - Darkrai - Shaymin - Manaphy and Phione - Arceus"
}