{
  "url": "https://www.hannovermesse.de/de/news/news-fachartikel/mehr-sicherheit-fu-r-die-vernetzte-fertigung",
  "title": "IT/OT-Sicherheit: Mehr Sicherheit für die vernetzte Fertigung",
  "text": "Mehr Sicherheit für die vernetzte Fertigung Das diesjährige Motto von achelos anlässlich der HANNOVER MESSE 2024 lautet „Cybersicherheit für vernetzte Lösungen in der Industrie“. In diesem Kontext bieten die Ostwestfalen Herstellern und Integratoren in der Automatisierungsindustrie ein umfangreiches Portfolio an Security-Engineering-Dienstleistungen und individuellen Key-Management-Lösungen für die vernetzte Fertigung. 18. Apr. 2024Teilen Das Paderborner Systemhaus für Cybersicherheit und digitales Identitätsmanagement achelos präsentiert sich auf der HANNOVER MESSE 2024 als Teil des „Industrial Security Circus“ Gemeinschaftsstands (A12) in der Halle 16. „Der ‚Industrial Security Circusʻ-Gemeinschaftsstand ist die Anlaufstelle für Anwender:innen und Produktentwickler:innen, die ihre industriellen Produkte mit Security-Maßnahmen sichern wollen,“ sagt Dr. Michael Jahnich, Director Business Development. Im Fokus von achelos steht in diesem Jahr der Cyber Resilience Act (CRA) und IEC 62443. Auf beide wird Jahnich in seinem Vortrag „Digitale Geräteidentitäten für Industrielle IoT im Rahmen des Gesetzes über Cyberresilienz“ am 24. April um 10 Uhr in Halle 16, Stand A12/24 näher eingehen. Cybersicherheit mit Public-Key-Infrastrukturen Eine auf Public-Key-Infrastrukturen basierende Cybersicherheit ist die Grundlage für die intelligente Vernetzung von Geräten. Der Markt benötigt sichere, gegen Hackerangriffe gehärtete Produkte, die über einen Sicherheitsnachweis, etwa in Form einer Zertifizierung nach IEC 62443, verfügen. Mit hochwertigen elektronischen Zertifikaten zum Nachweis der Echtheit von Software und Hardware ihrer Produkte können Hersteller die Anforderungen der IEC 62443 erfüllen. Das Team von achelos bietet eine umfassende Betreuung von Public-Key-Infrastrukturen, von der Planung über die Bereitstellung bis hin zum sicheren Betrieb, auch als Managed Services in der Cloud. Security Engineering mit achelos Für die industrielle Cybersicherheit hat achelos ein umfangreiches Angebot an Security-Engineering-Dienstleistungen im Portfolio. Das Unternehmen begleitet Hersteller professionell und effizient auf dem Weg zur CRA-Compliance ihrer ICS-Produkte unter Berücksichtigung industrieller Sicherheitsstandards gemäß IEC 62443. Durch langjährige Erfahrung in der Entwicklung und Evaluierung von Software unterstützt achelos Hersteller dabei, die Integrität, Verfügbarkeit und Vertraulichkeit von kritischen Daten und Systemen sicherzustellen. Weitere Themenschwerpunkte von achelos auf der HANNOVER MESSE 2024 sind Hardware-Sicherheitsmodule (HSM), Consulting und Cloud Security Testsuiten. Aussteller zum Thema Interesse an News zu Ausstellern, Top-Angeboten und den Trends der Branche? Browser Hinweis Ihr Webbrowser ist veraltet. Aktualisieren Sie Ihren Browser für mehr Sicherheit, Geschwindigkeit und eine optimale Darstellung dieser Seite. Browser aktualisieren"
}