{
  "url": "https://en.wikipedia.org/wiki/Fermín_López",
  "title": "Fermín López - Wikipedia",
  "text": "Fermín López Fermín López Marín (born 11 May 2003) is a Spanish professional footballer who plays as an attacking midfielder or winger for La Liga club Barcelona and the Spain national team.[2] Known for his off the ball press, clinical goal scoring and technical skills, he is regarded as one of the best attacking midfielders in the world. Club career [edit]Early career [edit]Born in El Campillo, Huelva, Andalusia, López began playing football with his local club El Campillo, and followed that with a stint at Recreativo before moving to Real Betis in 2012.[3] In the summer of 2016, he moved to the youth academy of Barcelona. Barcelona [edit]2022–23 season: Loan to Linares [edit]On 19 August 2022, López signed a professional contract with Barcelona Atlètic for two years until 2024, and immediately went on loan with Linares in the Primera Federación for the 2022–23 season.[4] He made his senior debut nine days later, starting in a 2–0 home win over Mérida. López scored his first senior goal on 30 October 2022, in a 2–1 away success over Rayo Majadahonda. He finished the campaign with 12 goals in 40 appearances overall, being an undisputed starter for Linares. 2023–24 season: First team debut [edit]After strong performances in training with Barcelona before the preseason, López was called up to their senior preseason squad in July 2023. He received international recognition after a strong performance for Barcelona, as he scored a goal and provided an assist in a friendly 3–0 win over their rivals Real Madrid on 29 July 2023.[5] After the game, Xavi confirmed that López was to stay with their senior side for the 2023–24 season.[6] On 27 August 2023, López made his La Liga debut for Barcelona in a 4–3 away win over Villarreal.[7] Two days later, he signed a new contract at the club until 30 June 2027, with a buyout clause of €400 million.[8] The following 10 September, Fermin would make his official debut with Barça Atlètic after receiving Xavi's permission to play for them.[9] He was sent off after receiving a second yellow card in a 1–0 away loss to Gimnàstic de Tarragona.[10] López would later return to the first team setup and made his UEFA Champions League debut on 19 September, coming off the bench to replace Gavi in the 58th minute of a 5–0 home victory over Royal Antwerp in the competition's group stage.[11] A week later, in an away match against Mallorca, he scored his first goal for Barcelona and first La Liga goal: after coming on as a substitute on the 64th minute, with Barça losing 2–1, he scored a 75th-minute equalizer, setting the final score at 2–2.[12] On 25 October 2023, López scored a goal on his first start in the Champions League in a 2–1 victory over Shakhtar Donetsk,[13] in which he was also named player of the match.[14] 2024–25 season: Contract extension and domestic treble [edit]On 31 October 2024, López extended his contract with Barcelona until 2029.[15][16] On 15 May 2025, he netted a goal in a 2–0 away win over Espanyol, securing his team's La Liga title.[17] Having already won the Copa del Rey and Supercopa de España, he capped off a historic domestic treble with his club.[18] 2025–26 season [edit]On 21 October 2025, López netted his first career hat-trick in a 6–1 victory over Olympiacos in the Champions League, becoming the first Spanish player to do so for the club since Pichi Alonso in 1986.[19][20] In January 2026, he signed a contract extension with Barcelona until 2031[21]. International career [edit]On 6 October 2023, López was called up to the Spain under-21 squad; he later made his debut on 13 October in a 0–0 draw against the Uzbekistan under-23 team.[22][23] He then went on to score his first goal for the team in a 4–0 away win over Kazakhstan in a qualifying match for the 2025 UEFA European Under-21 Championship on 17 October.[24] On 27 May 2024, López was selected in the Spanish senior 29-man preliminary squad for the UEFA Euro 2024.[25] On 5 June, he debuted in a 5–0 friendly victory against Andorra at the Estadio Nuevo Vivero in Badajoz, coming on as a substitute to Barcelona teammate Pedri in the 62nd minute and assisting on the last goal of the game by another Barcelona player Ferran Torres.[26] In May 2024, López was named in Spain's 26-man squad for the UEFA Euro 2024. The team would go on to win the tournament, with López being a largely unused substitute.[27] In July 2024, he was selected in the Spain under-23 squad for the 2024 Summer Olympics. He and Spain would go on to win the Olympic gold medal at the men's football event in the Olympics. López scored 6 goals (including two against France in the final) and became second best goalscorer of the tournament (only behind Soufiane Rahimi). He along with his teammate Álex Baena became only the second and third players ever to win the UEFA European Championship and the Summer Olympic gold medal in the same year, after the French goalkeeper Albert Rust.[28] Style of play [edit]López is an ambipedal central midfielder, with the versatility to play as an attacking midfielder. He has been described as technically proficient with great movement off the ball, adept at exploiting space, and productive with goals and assists. He is known for his powerful long-range shots, close control and high work-rate.[29] Career statistics [edit]Club [edit]- As of match played 3 February 2026[30] - ^ a b c Appearances in UEFA Champions League - ^ a b c Appearance(s) in Supercopa de España International [edit]- As of match played 18 November 2025[31] Honours [edit]Barcelona Spain U23 Spain References [edit]- ^ \"Who is Fermin Lopez? The surprise star of Barcelona's preseason tour\". sport. 30 July 2023. - ^ \"Fermín\". FC Barcelona. Retrieved 9 January 2025. - ^ \"One for the Future : Fermín López from Juvenil A\". Barça Buzz. 23 October 2021. Archived from the original on 30 July 2023. Retrieved 30 July 2023. - ^ \"El Barça Atlètic cede a Fermín López al Linares\". Mundo Deportivo. 19 August 2022. - ^ Sanderson, Tom (29 July 2023). \"Fermin Lopez Dazzles For FC Barcelona With Screamer And Assist Vs. Real Madrid In El Clasico Thrashing (Video)\". Forbes. - ^ König, Kosta (29 July 2023). \"Xavi reveals what's next for El Clasico starboy Fermin Lopez\". Tribuna.com. - ^ \"Fermín López makes official first team debut\". FC Barcelona. 27 August 2023. - ^ \"Fermín López, blaugrana until 2027\". FC Barcelona. 29 August 2023. - ^ \"Humilde Fermín: pidió él a Xavi jugar con el Barça Atlètic\" [Humble Fermín: He asked Xavi to play with Barça Atlètic]. Sport. 10 September 2023. Retrieved 30 September 2023. - ^ \"Casadó: \"Fermín estaba llorando después del partido\"\" [Casadó: \"Fermín was crying after the game\".]. Mundo Deportivo. 11 September 2023. Retrieved 30 September 2023. - ^ Quiroz, Andrés (20 September 2023). \"Fermín López made his debut in the Champions League in the win against Antwerp\". FCBN. Retrieved 27 September 2023. - ^ Baynes, Ciaran (26 September 2023). \"Mallorca 2-2 Barcelona: Youngster Fermin Lopez comes off bench to rescue a point for Xavi Hernandez's side\". Eurosport. Retrieved 27 September 2023. - ^ \"Barcelona 2-1 Shakhtar Donetsk: Fermin Lopez stars in Champions League win\". sport.es. 25 October 2023. - ^ \"Fermin Lopez talks after Man of the Match performance during Barcelona 2–1 Shakhtar\". OneFootball. 25 October 2023. - ^ \"Fermín staying until 2029\". FC Barcelona. 31 October 2024. - ^ \"Fermín signs new Barça deal with €500m clause\". ESPN.com. 31 October 2024. Retrieved 2 November 2024. - ^ \"WATCH: Fermin Lopez scores La Liga title-winning goal safe for Barcelona\". Football Espana. 15 May 2025. - ^ \"Barcelona clinch LaLiga title, domestic treble with win at Espanyol\". ESPN. 15 May 2025. - ^ \"Barcelona 6-1 Olympiacos: Fermin bags maiden career hat-trick in Champions League rout\". beIN SPORTS. 21 October 2025. - ^ \"Fermín López nets Barça's first Spanish hat-trick in the Champions League for 39 years\". OneFootball. 21 October 2025. - ^ \"Le FC Barcelone prolonge son milieu de terrain Fermin Lopez jusqu'en 2031\". L'Équipe (in French). Retrieved 2 February 2026. - ^ \"Oficial | Lista de convocados para los partidos frente a Uzbekistán y Kazajistán\" (in Spanish). Royal Spanish Football Federation. 6 October 2023. Retrieved 10 November 2023. - ^ \"Crónica | Empate sin goles en el amistoso frente a Uzbekistán (0-0)\" (in Spanish). Royal Spanish Football Federation. 13 October 2023. Retrieved 10 November 2023. - ^ \"Crónica | Goleada para seguir en lo más alto (0-4)\" (in Spanish). Royal Spanish Football Federation. 17 October 2023. Retrieved 10 November 2023. - ^ \"Euro 2024 provisional squad\". Royal Spanish Football Federation. 27 May 2024. Retrieved 30 May 2024. - ^ \"Fermín debutó con una precisa asistencia a Ferran\" [Fermín debuted with a precise assist to Ferran]. sport.es (in Spanish). 5 June 2024. - ^ \"Spain | Squad | UEFA EURO 2024\". UEFA. Retrieved 15 July 2024. - ^ \"Lista para el Torneo Olímpico Masculino de Fútbol\" [List for the Men's Olympic Football Tournament] (in Spanish). Royal Spanish Football Federation. 10 July 2024. - ^ \"Fermin Lopez impressing Barcelona management on pre-season tour of the USA\". 25 July 2023. - ^ Fermín López at Soccerway - ^ \"Fermín López\". EU-Football.info. Retrieved 7 September 2025. - ^ \"Barcelona Win La Liga, Complete 2024-25 Domestic Treble\". SI. 15 May 2025. Retrieved 15 May 2025. - ^ Lowe, Sid (26 April 2025). \"Barcelona win thrilling Copa del Rey and drive Madrid to red card fury\". The Guardian. ISSN 0261-3077. Retrieved 15 May 2025. - ^ read, OneFootball·1 min (12 January 2025). \"🏆 Barcelona smash Real Madrid in Supercopa de España thriller\". Yahoo Sports. Retrieved 15 May 2025. {{cite web}} : CS1 maint: numeric names: authors list (link) - ^ \"Barcelona vs Real Madrid Highlights, El Clasico Supercopa Final: Barcelona Beat Real Madrid 3-2 In Thriller, Clinch 1st Trophy Of Season\". NDTV. Retrieved 12 January 2026. - ^ Ronay, Barney (9 August 2024). \"Camello's extra-time double clinches football gold for Spain against France\". The Guardian. ISSN 0261-3077. Retrieved 9 August 2024. - ^ \"Spain 2-1 England | UEFA EURO 2024 Final\". UEFA. 14 July 2024. Retrieved 14 July 2024. - ^ \"Portugal vs Spain - UEFA Nations League Final 2025\". UEFA.com. Retrieved 8 June 2025. External links [edit]- Profile at the FC Barcelona website - Profile at the Royal Spanish Football Federation website (in Spanish) - Fermín López – UEFA competition record (archive) - Fermín López at Olympics.com - Fermín López Marín – COE – Paris 2024 (in Spanish) - 2003 births - Living people - 21st-century Spanish sportsmen - Spanish men's footballers - Footballers from the Province of Huelva - Men's association football midfielders - Men's association football wingers - La Liga players - Primera Federación players - FC Barcelona players - FC Barcelona Atlètic players - Linares Deportivo footballers - Spain men's under-21 international footballers - Spain men's international footballers - UEFA Euro 2024 players - UEFA European Championship–winning players - Olympic footballers for Spain - Footballers at the 2024 Summer Olympics - Olympic medalists in football - Olympic gold medalists for Spain - Medalists at the 2024 Summer Olympics"
}