{
  "url": "https://secure.runescape.com/m=news/roadmap-check-in-november---january",
  "title": "Roadmap Check In: November - January - News - RuneScape - RuneScape",
  "text": "Hey 'Scapers! Now that we're exiting spooky season (🎃) and entering festive season (🎄), it's time for a check in on what's to come for the rest of this year! First, a bit of a development update. As many of you know, we've undergone some significant shifts to how we approach development this year. This work really came to fruition back in August when we released our first ever RS Ahead - our next big step in making our content plans more visible and opening the door to work with players during the development process. We've loved the content that's resulted from this so far and it's a committed direction for us going forward. (Our next one will be live at RuneFest!) We have recently made a few tweaks to our release schedule and - as promised - we're dropping in to give you a quick update on what to expect, when to expect it and a little on the why behind these development shifts. Let's dive in! RuneScape Key Updates & Events - November 2024 to January 2025 - Out Now: Group Ironman Mode - Out Now: New Slayer Monster & Necromancy Slayer Helmet - Out Now: Premier Membership Yearly Refresh - November 15 - 25: Double XP - December 2 - Jan 6: Christmas Village 2025 - December 9: 110 Woodcutting & Fletching - December 16: Shooting Star Refresh - January 13: Desert Quest I* - Late January: Combat Mastery Achievements *Moved from original December release window Find out more about these content releases further down the post! Release Window Changes Along with working more closely with all of you during development, we also want to make sure we're landing quality content as best we can. In a recent Roadmap Review internally, we identified Desert Quest I was coming in a little hot (arguably appropriate for a Desert Quest maybe?). We know how important the return to this quest series is for many of you, especially as it was one of our first major changes to the Roadmap as a result of player feedback. To avoid a situation where we could end up short changing this release with too tight a deadline, we've adjusted it's release window from December to January. We do expect this change to have a slight knock-on impact to the general flow of these quests next year, but we're confident you'll still get that showdown with everyone's favorite goddess of destruction by mid 2025. While it's still landing in it's release window, we can now confirm 110 Woodcutting & Fletching will be landing on December 9 - right at the tail end of 'early December'. Taking us to the tail end of the release window is a conscious decision we've made so we can add some small additional gameplay elements to the 110 release based on your feedback from 110 Mining & Smithing. We do recognise this means a bit of a wait for our next content release as we trade off a now lighter November for a jam-packed December and January. We hope you'll agree it's a trade worth making. At the very least, the end of 2024 and start of 2025 cosy-season is going to be packed with things to do. A Look Into November New Slayer Monster & Necromancy Slayer Helm Addition. From the sands of the Kharidian Desert comes a new terrifying Slayer monster! The Profane Scabarites, unholy creatures who have cast off the tenets of Scabaras, are on the move! These malicious insects will swarm unsuspecting adventurers who stumble into their isolated cavern. Keep your wits about you, and avoid wandering into creepy caves near Pollnivneach - unless you want to fight them, of course. These monsters require level 87 Slayer to fight, but persevere and you may get your hands on the new Spectral Lens, a new addition to the Slayer Helm that gives it Necromancy benefits. Find them in the game now! Premier Membership Premier Membership has received its yearly refresh! Premier Membership is the best value offer for dedicated RuneScape players, along with extra rewards such as monthly drops, increased bank space and exclusive cosmetics. This year, we'll be including a few new additions to our yearly refresh: - New Cosmetic Outfit & Pet* - New Teleport Animation - Daily Free Boss Instances (was weekly) - Refreshed Premier Token Store *This is new every year, but worth calling out! This is on top of the other benefits included every year such as Loyalty Points, increased Bank Spaces, access to the Premier Vault, the Premier Artefact, Monthly Drops, exclusive chat badge, additional Daily Key, Premier Tokens and - of course - 12 months of Membership. Blimey, that was a mouthful of a sentence! Lots of stuff there. This year's Premier Club does not include the 30 Day Double Daily Keys bundle. GameJam - Nov 11 till Nov 22 Game Jam is a special event where J-Mods come together to work on projects they are passionate about! Game Jams are a crucial chance for our J-Mods to spread their creative wings on personal projects, whether from their own creativity or guided by player feedback. Some of the content from Game Jam will end up seeing the light of day in the game - others are simply a way to express, improve and refine skills that can be taken to future content projects. We're switching from four week-long Game Jams per year to two two-week Game Jams per year. Our next Game Jam happens from the 11th - 22nd of November. Double XP - November 15 till 25 Double XP. You know the deal - it's the perfect time to make big gains towards those goals you've always dreamed about. Double XP will begin on November 15 and run until November 25, offering 48 hours of Double XP gametime over 10 days. A Little More On December Christmas Village - Dec 2 till Jan 6 The festive expansion to last year's Christmas Village will be launching on December 2, running until January 6th! Look for a new blog near the end of November where we'll run you through the additions to this year's event - from rewards to new activities. Check our last year's Christmas Village Blog for a refresher on what's returning this year too. 110 Woodcutting & Fletching - December 9 Our next 110 skill release lands on December 9! We're excited to reveal this release in full in early December - including dropping details on the new Masterwork Bow, the new Augmentable Hatchets and other rewards. Shooting Star Refresh - December 16 Ready your telescopes and pickaxes, the Shooting Star D&D is getting a refresh! Nab new rewards, discover new star locations and enjoy some really awesome QoL improvements. It will be landing on December 16 - so keep watching the skies. Opening The New Year With A Bang! Desert Quest 1 - Working Title Picking up from the end of Phite Club - and carrying on from the Sanctum of Rebirth - this quest will be the first of a trilogy of quests that will have lead us to our long awaited final confrontation with Amascut! As mentioned in the above paragraph this quest will launch in January, we will update you with more details closer to launch. Combat Mastery Achievements Prepare to test your talents against a suite of combat challenges to prove your bossing prowess - from Easy to Grandmaster. Combat Mastery Achievements will be coming early next year so we will keep you posted on the launch date and what rewards are in store! Thanks for reading! We hope you have a wonderful Winter and Festive season - whether you're in or out of Gielinor. - The RuneScape Team Mods Astar, Alex, Azanna, Bak, Balkan, Bam, Blkwitch, Boko, Brat, Breezy, Brig, Camel, Colibri, Chaose, Dark, Daze, Desert, Dorn, Dragon, Drew, Drewid, Easty, Echo, Fallen, Forza, Fowl, Fox, Frosch, Grace, Gunner, Helen, Hooli, Ink, Jack, Keyser, Kitsune, Kristy, Luma, Lunatear, Lykos, Lynx, Makkari, MIC, Mickey, Morty, Muse, Nemo, Neong, Nixon, Noms, Pearce, Pebble, Phoenix, Pigeon, Rain, Raiwtch, Ramen, Rowley, Rsguy, Ryan, Samy, Sakura, Shrew, Shrike, Skyefall, Soul, Sponge, Spyro, Stead, Stu, Sukotto, Taelae, Tiger, Timbo, Titus, Toebeans, Tri, Vegard, Volta, Who, Wov, Yuey & Zura"
}