{
  "url": "https://www.salina.com/",
  "title": "Salina Journal: Local News, Politics & Sports in Salina, KS",
  "text": "2 future Jayhawks basketball players named McDonald’s All-Americans Topekan joins US Senate race Who is in Kansas State football's 2026 signing class? Kansas State football's 2026 signing day analysis, class rankings Watch Now Must Read More Stories How did Kansas State, Jerome Tang let this season get… Help us honor 250 women who shaped the United States Kansas State football recruiting tracker for 2026 class Kobach pushes bill on SNAP data sharingKris Kobach explains reason behind SNAP data legislation Topekan joins US Senate race Kobach pushes bill on SNAP data sharing Kris Kobach explains reason behind SNAP data legislation 2 future Jayhawks basketball players named McDonald’s All-Americans Who is in Kansas State football's 2026 signing class? Kansas State football's 2026 signing day analysis, class rankings How to watch the 2026 Grammy Awards on TV, streaming Catherine O'Hara, 'Beetlejuice' and 'Schitt's Creek' star, dies at 71 Best hidden gem restaurants in America? Beloved spots worth the trip Rempp should recognize his privilege David Norlin One year later: America is getting healthy again Roger Marshall Following through on Kansans’ priorities Tracey Mann 'KPop Demon Hunters' Lego sets coming with first release in summer Winning numbers for Wednesday's Powerball drawing. See the results. Rare bus-sized giant phantom jellyfish caught on camera. See video. Can this $15 muscle cream fix tech-neck? Find out here Get fast charging for your iPhone with Anker's 3-in-1 wireless station Super Bowl LX wing night essentials for the ultimate game day feast Featured Gallery Extra, Extra 3 things to know about Kansas baseball’s roster before 2026 season Who has signed in Kansas football's 2026 signing class? Kansas basketball's NCAA tournament seed projections after big win Will Kansas State football sign anyone on National Signing Day? 3 takeaways from Kansas basketball’s Big 12 road win at Texas Tech"
}