{
  "url": "https://oglobo.globo.com/economia/tecnologia/noticia/2026/02/02/whatsapp-a-lista-completa-de-celulares-que-ficam-sem-o-app-em-fevereiro.ghtml",
  "title": "WhatsApp: a lista completa de celulares que ficam sem o app em fevereiro",
  "text": "WhatsApp: a lista completa de celulares que ficam sem o app em fevereiro Aplicativo deixa de funcionar nos modelos que não contam com um sistema operacional compatível RESUMO Sem tempo? Ferramenta de IA resume para você GERADO EM: 01/02/2026 - 19:12 WhatsApp deixará de funcionar em celulares antigos a partir de fevereiro A partir de 1º de fevereiro, o WhatsApp deixará de funcionar em celulares antigos que não suportam os requisitos mínimos de atualização, visando otimizar segurança e desempenho. Modelos como Samsung Galaxy S3, iPhone 5 e Moto G (1ª geração) estão na lista. Usuários devem atualizar o sistema ou adquirir novos dispositivos para continuar usando o app. O WhatsApp notifica previamente sobre a necessidade de atualização. A partir de 1º de fevereiro, o WhatsApp começou a deixar de funcionar em certos celulares que já podem ser considerados “antigos” por não cumprirem os requisitos mínimos de atualização. Nesse sentido, é recomendável levar isso em conta para não ficar sem acesso ao aplicativo de mensagens instantâneas. Essa não é uma medida nova da aplicação da Meta; periodicamente é implementado um ajuste para que os sistemas operacionais consigam suportar as atualizações. Elas respondem à necessidade do WhatsApp de otimizar a segurança, o desempenho e a capacidade de incorporar novas funcionalidades. Como consequência, os dispositivos afetados não poderão abrir o aplicativo, nem enviar ou receber mensagens. Isso ocorre porque eles ficam fora do suporte de uma das plataformas de mensagens mais utilizadas do mundo. Por que o WhatsApp deixa de funcionar em certos celulares? O WhatsApp avalia quais dispositivos utilizam softwares mais antigos e têm o menor número de usuários para determinar se continuarão ou não sendo compatíveis. Isso não é um simples capricho do aplicativo, mas uma resposta à modernização constante dos smartphones. Quando um celular tem um software obsoleto, ele não consegue receber atualizações, muito menos as novas funções do app. Outra consequência é a queda de desempenho, com lentidão ou falhas como desligamentos inesperados. Porém, o maior risco é relacionado à segurança, já que o dispositivo fica exposto a vírus, malwares e outros tipos de ataques que comprometem a privacidade dos dados armazenados. Ainda assim, em seu Centro de Ajuda, o aplicativo especifica que “antes de deixar de oferecer suporte ao seu sistema operacional, você receberá uma notificação no WhatsApp e será lembrado várias vezes de que precisa atualizá-lo”. Dessa forma, busca-se não deixar os usuários incomunicáveis. Ao receber esse alerta, é necessário atualizar o software para verificar se o aparelho é antigo. É possível conferir a versão do sistema diretamente em “Sobre o dispositivo” no Android ou em “Informações” no iPhone. De acordo com o site oficial de suporte do WhatsApp, o aplicativo precisa de Android OS 5.0 ou versões posteriores. No caso do iPhone, é necessário o sistema operacional iOS 15.1 ou versões posteriores. A maioria dos dispositivos que ficarão sem acesso ao app foi lançada há mais de uma década. Por isso, eles já não recebem as atualizações de software necessárias por parte de seus fabricantes para se adaptar às exigências atuais do aplicativo. Essa incompatibilidade é o principal motivo do fim do suporte. A seguir, os modelos de celulares que não contam com o sistema operacional exigido para utilizar o WhatsApp: Marcas e modelos - Samsung - Galaxy S3, S4, S4 Mini, S5, Note 2, Core, Trend, J2, Ace 4 - LG - Optimus L3, L5, L7, F5, L3 II Dual, L5 II - Motorola - Moto G (1ª geração), Moto E (1ª geração) - Sony - Xperia Z2, Z3, M - Huawei - Ascend Mate, G740, D2 - HTC - Desire 500, One M8 - Apple - iPhone 5, 5c, 5s, 6, 6 Plus De todo modo, vale esclarecer que o aplicativo notifica diretamente os usuários afetados com vários meses de antecedência antes de ficarem sem acesso. Isso oferece um prazo suficiente para que tomem as providências necessárias. O que fazer se meu celular estiver na lista Diante desse cenário, os usuários cujos telefones estejam na lista de dispositivos afetados têm opções para não perder o acesso ao aplicativo. A primeira recomendação é verificar se é possível atualizar o sistema operacional do telefone. Caso isso não seja viável, será necessário migrar as conversas e os dados para um dispositivo mais moderno ou, alternativamente, adquirir um novo celular compatível com os requisitos atuais do WhatsApp para continuar utilizando o aplicativo sem interrupções. Para evitar a possível perda de informações valiosas, o WhatsApp enfatiza a importância de realizar um backup de todas as conversas e arquivos multimídia antes da data-limite estabelecida. Isso facilita enormemente a migração das informações para um novo dispositivo e garante que o histórico de conversas e os conteúdos compartilhados sejam preservados integralmente ao trocar de celular. Essa ação preventiva é fundamental para os usuários que desejam manter seu histórico de mensagens."
}