{
  "url": "https://mb.srb2.org/addons/sonic-adventure-2-blast.8079/",
  "title": "Sonic Adventure 2: Blast | SRB2 Message Board",
  "text": "- What permissions do you give others to modify and/or maintain your submission? - Modify: ASK ME - Maintain: NO - Others must ask me for permission before modifying my submission or use it in their own work, and I reserve the right to say no for any reason. No, others may not maintain my submission, even in my absence. It's Sonic Adventure 2 in Sonic Robo Blast 2, revamped and reworked for 2.2! This is a full conversion mod with new levels, characters and abilities to make for one cohesive adventure! This is the first demo release. Future releases are planned to add more levels! Hope you enjoy! - This mod only works on 2.2.15 and above! If you're getting issues like the level not completing properly or not seeing the Adventure Style HUD, please update your SRB2 version. - By default, the main pack uses ForceCharacter. You can't switch characters, since level headers are hardcoded. - However, if you run the \"multiplayer\" command, this adds a patch file which removes ForceCharacter from the level headers. (You can also just add the patch file manually.) - This patch file will also add holographic objects to the stages that allows the levels to be completable by any character. - Additionally, the patch file implements the \"sa2abilities on/off\" command. By default, this is set to off, in order to avoid interfering with custom characters. - You can also toggle sa2abilities by pressing Fire and Fire Normal at the same time. (This is necessary in Record Attack since console isn't accessible there.) - Emblems are not obtainable in the \"multiplayer\" version of the pack. - This pack is heavily recommended to be played in OpenGL. Visual errors and lag may occur if played in Software. - This pack comes pre-installed with all necessary characters/assets. This means, for example, you shouldn't add characters such as Shadow yourself, otherwise mod conflicts may occur. - By default, the main pack uses ForceCharacter. You can't switch characters, since level headers are hardcoded. - However, if you run the \"multiplayer\" command, this adds a patch file which removes ForceCharacter from the level headers. (You can also just add the patch file manually.) - This patch file will also add holographic objects to the stages that allows the levels to be completable by any character. - Additionally, the patch file implements the \"sa2abilities on/off\" command. By default, this is set to off, in order to avoid interfering with custom characters. - You can also toggle sa2abilities by pressing Fire and Fire Normal at the same time. (This is necessary in Record Attack since console isn't accessible there.) - Emblems are not obtainable in the \"multiplayer\" version of the pack. - This pack is heavily recommended to be played in OpenGL. Visual errors and lag may occur if played in Software. - This pack comes pre-installed with all necessary characters/assets. This means, for example, you shouldn't add characters such as Shadow yourself, otherwise mod conflicts may occur. - All of these abilities are disabled by default in the multiplayer version of the pack, however you can re-enable them with the \"sa2abilities on/off\" command, or by pressing Fire and Fire Normal at the same time. - All characters can use their double-jump abilities any time they are in mid-air. Sonic - Sonic's thok has replaced with the homing thok. - Spin dash no longer has to be at a stand-still to charge, and also charges faster. - Chaining spin dashes will retain your momentum, similar to the spam-dash. - Sonic has the bounce bracelet. (Jump + Spin) - Sonic can perform the light dash. (Custom 1) Shadow - Shadow only has one Chaos Snap, à la 2.1 SRB2 Heroes. - Shadow only has a horizontal Chaos Snap, no vertical ones. - The stored speed for Shadow's Chaos Snap caps at normalspeed. - Shadow has the same changes to the spin dash as Sonic. - Shadow has the bounce bracelet. (Jump + Spin) - Shadow can perform the light dash. (Custom 1) Tails - Tails' flight has been replaced with a multi-ability slow fall. - Tails' secondary ability has been replaced with Fang's pop-gun. - Tails is able to shoot while moving, as well able to shoot in mid-air. Eggman - Eggman has the exact same abilities as Tails. Knuckles - Knuckles has been given multi-glide. - Knuckles' secondary ability has been replaced with CA2_MELEE. Rouge - Rouge has the exact same abilities as Knuckles. - All characters can use their double-jump abilities any time they are in mid-air. Sonic - Sonic's thok has replaced with the homing thok. - Spin dash no longer has to be at a stand-still to charge, and also charges faster. - Chaining spin dashes will retain your momentum, similar to the spam-dash. - Sonic has the bounce bracelet. (Jump + Spin) - Sonic can perform the light dash. (Custom 1) Shadow - Shadow only has one Chaos Snap, à la 2.1 SRB2 Heroes. - Shadow only has a horizontal Chaos Snap, no vertical ones. - The stored speed for Shadow's Chaos Snap caps at normalspeed. - Shadow has the same changes to the spin dash as Sonic. - Shadow has the bounce bracelet. (Jump + Spin) - Shadow can perform the light dash. (Custom 1) Tails - Tails' flight has been replaced with a multi-ability slow fall. - Tails' secondary ability has been replaced with Fang's pop-gun. - Tails is able to shoot while moving, as well able to shoot in mid-air. Eggman - Eggman has the exact same abilities as Tails. Knuckles - Knuckles has been given multi-glide. - Knuckles' secondary ability has been replaced with CA2_MELEE. Rouge - Rouge has the exact same abilities as Knuckles. - Sonic Adventure 2 had a scoring system that awarded you points for doing specific actions in a level. However, these actions were often obscure and inconsistent. - SA2:Blast has a new scoring system that awards you points for interacting with anything in the stage at a fluid pace. - Now, just about everything you can interact with in the level gives you points. For example, rings give you 10 points each, dash rings give you 200 points, monitors give you 500, extra life monitors give you 1000, etc. Enemies always give you 200 points, as enemy combos don't exist anymore. - Some points are continuous, like grind rails and zoom tubes, which each give you 10 points per second. However, for actions you can perform infinitely, there is a limit on the amount of points you can earn before they stop awarding you anything. - Whenever you earn points, an 8-second timer starts ticking down, indicated by the star spinning in the top-right corner. You can reset this timer by gaining more points. - If you collect 1000 points without the timer running out, you'll get a point bonus. The first time you collect 1000 points, you'll get a 1000 point \"Good!\" bonus. If you collect another 1000 points, you'll get a 2000 point \"Great!\" bonus. This continues all the way up to a 10000 point \"Perfect!\" bonus, after which it'll loop back down to the 1000 point bonus. - When you complete the level, you'll be rewarded with a score and a letter rank from E to A based on the points you earned in the level, as well as a time bonus, which starts at 100000 and decrements by 250 for every second you spend in the level. - In treasure hunting stages, you earn more points the faster you collect a shard. You'll get the maximum points if you collect a shard in under 30 seconds. - You can use hint monitors to get a clue as to where the closest emerald shard is, however, this will cost 10 seconds from your timer. - SA2:Blast has a new scoring system that awards you points for interacting with anything in the stage at a fluid pace. - Now, just about everything you can interact with in the level gives you points. For example, rings give you 10 points each, dash rings give you 200 points, monitors give you 500, extra life monitors give you 1000, etc. Enemies always give you 200 points, as enemy combos don't exist anymore. - Some points are continuous, like grind rails and zoom tubes, which each give you 10 points per second. However, for actions you can perform infinitely, there is a limit on the amount of points you can earn before they stop awarding you anything. - Whenever you earn points, an 8-second timer starts ticking down, indicated by the star spinning in the top-right corner. You can reset this timer by gaining more points. - If you collect 1000 points without the timer running out, you'll get a point bonus. The first time you collect 1000 points, you'll get a 1000 point \"Good!\" bonus. If you collect another 1000 points, you'll get a 2000 point \"Great!\" bonus. This continues all the way up to a 10000 point \"Perfect!\" bonus, after which it'll loop back down to the 1000 point bonus. - When you complete the level, you'll be rewarded with a score and a letter rank from E to A based on the points you earned in the level, as well as a time bonus, which starts at 100000 and decrements by 250 for every second you spend in the level. - In treasure hunting stages, you earn more points the faster you collect a shard. You'll get the maximum points if you collect a shard in under 30 seconds. - You can use hint monitors to get a clue as to where the closest emerald shard is, however, this will cost 10 seconds from your timer. -- Mod created by Garrean -- Shadow - Inazuma - https://mb.srb2.org/threads/shadow-the-hedgehog.30633/ -- Eggman - DrStephen - https://mb.srb2.org/threads/eggpack-remake-v2-6.27515/ -- Rouge - https://mb.srb2.org/threads/rouge-the-bat-legacy-v3-1.29479/ -- Simple character rebalancing - TehRealSalt - https://mb.srb2.org/threads/simple-character-rebalancing.27221/ -- sloperollangle - Golden - https://mb.srb2.org/addons/sloperollangle-character-rotation-on-slopes.1188/ -- SA1 Spindash - Starlight - https://mb.srb2.org/threads/sa1-spindash-it-doesnt-matter.28199/ -- Sonic Lost World Bounce - MotdSpork - https://mb.srb2.org/threads/sonic-lost-world-bounce-for-2-2.27112/ -- Light Dash - aquaponiee - https://mb.srb2.org/addons/1-09-4-light-dash-port.2813/ -- Adventure Style - Skydusk - https://mb.srb2.org/addons/game-styles.8024/ -- GS Rails - GoldenShine & Metalwario64 -- GUN Robots - GoldenShine & Metalwario64 -- Sonic grinding sprites - OrdoMandalore -- Radical Highway blimp - OrdoMandalore -- Title screen background & skies - N4h -- Sound replacements - Cola -- PlatinumTools - JanaSol -- Big - MotorRoach -- Testers: BlueBlur, Cola, Inazuma, Othius, JanaSol, Limo, Metalwario64, OrdoMandalore, Seaballer, GoldenShine, Skydusk -- Shadow - Inazuma - https://mb.srb2.org/threads/shadow-the-hedgehog.30633/ -- Eggman - DrStephen - https://mb.srb2.org/threads/eggpack-remake-v2-6.27515/ -- Rouge - https://mb.srb2.org/threads/rouge-the-bat-legacy-v3-1.29479/ -- Simple character rebalancing - TehRealSalt - https://mb.srb2.org/threads/simple-character-rebalancing.27221/ -- sloperollangle - Golden - https://mb.srb2.org/addons/sloperollangle-character-rotation-on-slopes.1188/ -- SA1 Spindash - Starlight - https://mb.srb2.org/threads/sa1-spindash-it-doesnt-matter.28199/ -- Sonic Lost World Bounce - MotdSpork - https://mb.srb2.org/threads/sonic-lost-world-bounce-for-2-2.27112/ -- Light Dash - aquaponiee - https://mb.srb2.org/addons/1-09-4-light-dash-port.2813/ -- Adventure Style - Skydusk - https://mb.srb2.org/addons/game-styles.8024/ -- GS Rails - GoldenShine & Metalwario64 -- GUN Robots - GoldenShine & Metalwario64 -- Sonic grinding sprites - OrdoMandalore -- Radical Highway blimp - OrdoMandalore -- Title screen background & skies - N4h -- Sound replacements - Cola -- PlatinumTools - JanaSol -- Big - MotorRoach -- Testers: BlueBlur, Cola, Inazuma, Othius, JanaSol, Limo, Metalwario64, OrdoMandalore, Seaballer, GoldenShine, Skydusk If you want to keep up with this mod's development, consider checking out the YouTube channel's community posts! Previews and teasers will be posted there occasionally, so if you need something to tide you over until the next release, go and give it a look!"
}