{
  "url": "https://www.dolesunshine.com/us/en/",
  "title": "Dole® Sunshine Company: Packaged Fruit, Recipes, & More",
  "text": "Discover Fruity Goodness The Brightest New Products Our 2026 Trend Forecast Is Here Make It With Dole® Every dish deserves love and sunshine, so take a look at our lovely recipes and collections and make every mouthful magical. Bring sunshine to every meal! Our Beliefs A Brighter Planet For All We are dedicated to caring for the land we harvest. A Brighter Product For All We aim to enhance nutrition through the goodness of fruit. A Brighter Today For All We strive to foster harmony and prosperity throughout our value chain. Over 86,000 Restaurant Locations use Dole Products Over 31,000 School Districts Serve Dole Products Nearly 30,000 Senior Living Facilities Serve Dole Products Nearly 7,000 Hospitals Serve Dole Products New Innovations Lead to Simple Solutions Recent Happenings In the News FRUIT, FLAVOR AND THE 2026 FEED: DOLE PACKAGED FOODS UNVEILS FIRST ANNUAL FRUIT TREND REPORT From treatonomics and tropical flavors to brighter beverages and mini meals, Dole’s report spotlights key shifts on how consumers choose and enjoy fruit. DOLE PACKAGED FOODS, LLC NAMES TODD STILLWELL AS NEW VICE PRESIDENT, SUPPLY CHAIN AND MANUFACTURING Todd Stillwell joins Dole Packaged Foods, LLC as Vice President, Supply Chain and Manufacturing Dole delivers “Sunshine You Can Taste” at Natural Products Expo West 2025 Dole Packaged Foods Celebrates “Sunshine You Can Taste” with Fruit-First Treats, Trending Mango Creations at Natural Products Expo West 2025 Mike Secor as New VP of Marketing; Stacy Smoot as VP, Retail & Foodservice Sales Dole Packaged Foods, LLC Appoints Mike Secor as New Vice President of Marketing, Expands Stacy Smoot’s Current Role into Foodservice to Drive Growth and Innovation for US Business Dole Wiggles® For Words Program Launches to Advocate for Childhood Literacy and Better Snacking Kicking off on National Read A Book Day, Dole Teams Up with Select Retailers to Match Dole Wiggles® Gels Purchases with Book Donations Dole Celebrates First-ever National Pineapple Juice Day With Nationwide “PJ” Parties Start Your Day Differently and Raise Your Glass to the Refreshing Taste of Pineapple Juice Feeling social? Follow us Bringing you the best snack hacks, easy recipes, and giveaways!"
}