{
  "url": "https://ge.globo.com/sp/santos-e-regiao/futebol/brasileirao-serie-a/noticia/2025/09/21/santos-x-sao-paulo-onde-assistir-ao-vivo-horario-e-escalacoes.ghtml",
  "title": "Santos x São Paulo: onde assistir ao vivo, horário e escalações | Ge",
  "text": "Santos e São Paulo se enfrentam neste domingo, às 20h30 (de Brasília), na Vila Belmiro, pela 24ª rodada do Campeonato Brasileiro. O sportv e o Premiere transmitem ao vivo, e o ge acompanha a partida em Tempo Real - clique aqui e acesse. O Santos tenta encerrar uma sequência de quatro jogos sem vitória, que manteve o time apenas um ponto acima da zona de rebaixamento no Campeonato Brasileiro. O técnico Juan Pablo Vojvoda também busca o primeiro triunfo dirigindo o Peixe: ele soma dois empates, contra o Fluminense e Atlético-MG, em dois jogos. O São Paulo vem de vitória no Brasileirão, já que derrotou o Botafogo em casa na rodada passada, mas chega abalado pela derrota por 2 a 0 para a LDU em Quito, na partida de ida das quartas de final da Conmebol Libertadores. Como o jogo de volta será disputado na próxima quinta-feira, no Morumbis, a tendência é que Crespo upe um time com mudanças no clássico. Onde assistir: - Tempo Real: o ge acompanha todos os lances da partida (clique aqui). - Transmissão: SporTV e Premiere. Vila Belmiro, estádio do Santos — Foto: Jose Edgar de Matos Escalações prováveis: Santos - técnico: Juan Pablo Vojvoda O técnico Juan Pablo Vojvoda não contará com Neymar para o clássico contra o São Paulo. O camisa 10 sofreu uma lesão na coxa durante o treino da última quinta-feira e virou desfalque. Além dele, seguem fora o meia Gabriel Bontempo, com lesão na coxa direita, e o volante Willian Arão, na transição.O zagueiro Zé Ivaldo e o lateral-direito Igor Vinícius estão suspensos. Em contrapartida, o meia Benjamín Rollheiser retorna após cumprir suspensão contra o Atlético-MG. Escalação provável: Gabriel Brazão; Mayke, Adonis Frías, Luan Peres e Escobar; João Schmidt, Zé Rafael, Victor Hugo e Rollheiser; Guilherme e Lautaro Díaz João Schmidt Mayke Zé Rafael Luan Peres Guilherme Rollheiser Escobar Gabriel Brazão Adonis Frías Victor Hugo Lautaro Díaz - Quem está fora: Zé Ivaldo (suspenso), Igor Vinícius (suspenso), Gabriel Bontempo (lesão na coxa direita), Neymar (lesão na coxa direita) e Willian Arão (transição física). - Pendurados: João Basso, Luisão, Escobar, Zé Rafael e Tiquinho Soares. São Paulo - técnico: Hernán Crespo Crespo deve poupar alguns jogadores nesta rodada já pensando na partida de quinta-feira, contra a LDU. Titulares como Enzo Díaz, Alan Franco, Marcos Antônio e Luciano podem ser poupados, e atletas que chegaram recentemente podem ganhar ritmo, casos de Rafael Tolói e Maílton. Escalação provável: Rafael, Rafael Tolói, Arboleda e Sabino; Maílton, Pablo Maia, Alisson, Rodriguinho e Wendell; Ferreira e Dinenno. Rafael Tolói Rafael Wendell Alisson Arboleda Maílton Dinenno Ferreira Sabino Pablo Maia Rodriguinho - Quem está fora: Tapia (suspenso), Cédric (virose), Lucas Moura, Oscar e Luiz Gustavo (em processo de transição), Calleri (cirurgia no ligamento cruzado do joelho esquerdo) Ryan Francisco (ruptura do ligamento cruzado anterior e lesão no menisco do joelho esquerdo) e André Silva (lesão no ligamento cruzado posterior e estiramento no ligamento cruzado anterior do joelho direito). - Pendurados: Rafael, Maik, Arboleda, Ferraresi, Sabino, Alan Franco e Marcos Antônio. Arbitragem: - Árbitro: Rodrigo José Pereira de Lima (PE) - Árbitro assistente 1: Alex Ang Ribeiro (SP) - Árbitro assistente 2: Miguel Cataneo Ribeiro da Costa (SP) - Quarto árbitro: Lucas Canetto Bellote (SP) - VAR: Ilbert Estevam da Silva (SP) Árbitro Rodrigo José Pereira de Lima — Foto: Gilson Lobo/AGIF"
}