{
  "url": "https://abcnews.go.com/US/jill-bidens-husband-charged-murdering-wife/story?id=129817143",
  "title": "Jill Biden's ex-husband charged with murdering his wife - ABC News",
  "text": "Jill Biden's ex-husband charged with murdering his wife William Stevenson is accused of killing Linda Stevenson late last year. Former first lady Jill Biden's ex-husband has been charged with murdering his wife following an \"extensive weeks-long investigation,\" police in Delaware announced on Tuesday. Police officers responding to a \"reported domestic dispute\" at a home in the Wilmington community of Oak Hill on Dec. 28 found Linda Stevenson, 64, unresponsive on the living room floor, according to police. Her husband, William \"Bill\" Stevenson, had called 911, police said at the time. A grand jury in New Castle County on Monday indicted Stevenson, 77, with first-degree murder in connection with his wife's death, according to police. The indictment alleges he \"did intentionally cause the death\" of his wife. Detectives took Stevenson into custody at his home without incident, police said. He has since been arraigned and is being held in the Howard Young Correctional Institution in Wilmington after failing to post $500,000 bail, police said. It is unclear if Stevenson has an attorney. Officers responded to the Stevensons' home after 11 p.m. on Dec. 28 and attempted lifesaving measures, but Linda Stevenson was later pronounced dead, police said. Detectives from the New Castle County Police Department's Criminal Investigations Unit responded to the scene to assume the investigation, officials said. No additional details, including the cause of death, have been released. Linda Stevenson ran a bookkeeping business and was \"deeply family-oriented,\" according to her obituary, which did not mention her husband. Bill Stevenson founded a popular bar and music hall in the early 1970s in Newark, Delaware. He is the former husband of Jill Biden, the Delaware Department of Justice confirmed to ABC News. The two were married for five years before divorcing in 1975. Jill Biden married former President Joe Biden two years later, in 1977."
}