{
  "url": "https://www.melhoresdestinos.com.br/miami-dicas-o-que-fazer.html",
  "title": "O que fazer em Miami - 42 dicas incríveis para aproveitar a cidade!",
  "text": "O que fazer em Miami – 42 dicas incríveis para aproveitar a cidade! O que fazer em Miami – 42 dicas incríveis para aproveitar a cidade! Miami é um destino que os brasileiros amam e isso todo mundo já sabe. O que muita gente não sabe é o que Miami pode oferecer além das compras. A cidade tem um astral alegre, qualidade de vida, um clima agradável e é ótima para praticar atividades ao ar livre. Há muito para ver e fazer por lá, basta ter tempo disponível. Confira nossas dicas de Miami, saiba o que fazer por lá, onde se hospedar e muito mais! Passeando pela cidade você perceberá que Miami é muito mais do que um destino para ver de relance. É um lugar para ficar, descansar e se divertir… e o melhor de tudo é que a cidade agrada a públicos completamente distintos: famílias com crianças, jovens em busca de baladas e o público mais velhos que quer descanso. Não é em vão que ela é um dos grandes destinos turísticos dos Estados Unidos e que recebe pessoas de todas as partes do mundo. O que fazer em Miami Clique abaixo e vá direto ao tema que mais te interessa: Como chegar em Miami O que fazer em Miami Hotéis em Miami Passeios em Miami Miami com crianças Restaurantes em Miami Compras Melhor época em Miami Transporte Informações úteis Dicas de Miami: Nada como caminhar a pé curtindo a sombra das centenas de coqueiros da Ocean Drive, dar um mergulho num mar de águas cristalinas ou curtir uma festa na beira da praia. A arquitetura Art Déco, os restaurantes deliciosos, as pessoas bonitas circulando pelas ruas e principalmente a atmosfera de “férias” são atrativos que fazem com que Miami conquiste fácil o nosso carinho. Para quem nunca visitou a cidade ou deseja descobrir novas atrações, o Melhores Destinos preparou uma lista com dicas essenciais do que fazer em Miami! Como chegar a Miami – Flórida O Miami International Airport (MIA), localizado a cerca de 15 km do centro da cidade (Downtown) é a principal forma de chegada de turistas brasileiros à região. Há voos diretos entre o Brasil e Miami, operado por companhias como a American Airlines e Latam, com partidas de cidades como Rio de Janeiro, São Paulo e Belo Horizonte. Confira aqui todas as nossas dicas de passagens aéreas para Miami! O Fort Lauderdale-Hollywood International Airport (FLL), localizado a cerca de 46 km de Miami é outra opção para visitar a região e conta com voos diretos da Azul. Muitas pessoas aproveitam também para conhecer Orlando na mesma viagem, que está a 370 km de distância e assim visitando as duas cidades, que ficam no estado da Flórida. Confira aqui nossas dicas de passagens aéreas para Orlando! Dica importante: Para visitar Miami e outros destinos dos Estados Unidos é necessário ter um passaporte válido e o visto americano! Clique nos links e saiba como tirá-los! O que fazer em Miami Confira as principais atrações que Miami oferece! 1. Hotéis em Miami: onde ficar Escolher um hotel em Miami nem sempre é uma tarefa fácil justamente porque a cidade tem tantas opções que pode ser difícil saber em qual ficar. E sobre esse assunto, é pertinente se lembrar que Miami e Miami Beach são cidades diferentes. Ir de uma cidade à outra é muito simples e rápido, mas na hora de procurar seu hotel, pesquise pelo local que você está buscando. Miami é onde fica o Aeroporto, os edifícios comerciais, o centro financeiro da região, por exemplo. Já Miami Beach é a região de praias e clima mais descontraído, onde fica a Lincoln Road e você pode se deslocar mais facilmente a pé ou de bike. Nas tabelas abaixo, você confere algumas sugestões de hotéis nas duas localidades, Miami e Miami Beach. Para reservar sua estadia, basta clicar nos links da lista! Se você busca um hotel próximo ao Aeroporto de Miami, o Fairfield Inn & Suites by Marriott é uma boa dica. Se quer ficar no centro de Miami, duas excelentes sugestões em que já ficamos hospedados são o InterContinental Miami, que tem uma belíssima vista e localização muito central e o EAST Miami é considerado referência na cidade, com um rooftop excelente! Em Miami Beach, o Shepley South Beach Hotel é uma boa para quem procura um lugar intimista e charmoso, pertinho de tudo. Para ficar na frente da praia, considere o Nautilus e o elegante 1 Hotel South Beach, que tem piscinas maravilhosas e uma atmosfera animada! Em Surfside, vale olhar o Grand Beach Hotel Surfside. Confira aqui mais dicas de onde ficar em Miami e hotéis baratos em Miami. 2. Curtir as praias de Miami Mergulhar, caminhar na areia ou simplesmente admirar a cor azul-turquesa do mar é um programa imperdível em Miami. Em South Beach as areias fervem de gente, muitos jovens, e ficam até meio muvucadas para quem quer sossego, mas em North Beach e Surfside as praias são bem mais vazias, ótimas para relaxar. O Haulover Park é uma das melhores opções para curtir a praia, além de ser um local com boa estrutura e tranquilo, tem trechos da praia com água muito calminha e cristalina. As praias em Miami têm areia clara e em algumas áreas a faixa de areia até o mar é bem grande. Leia sobre praias em Miami. 3. Caminhar pela Ocean Drive A Ocean Drive é uma das avenidas mais gostosas de Miami Beach e representa todo o frenesi de South Beach, o bairro mais quente da cidade. Ela tem edifícios de arquitetura art déco, está cheia de coqueiros e ao longo de sua extensão são diversos os restaurantes, bares e baladas. Experimente caminhar pela via na tarde de um sábado ou domingo para ver como é o agito. Os bares e casas noturnas tocam músicas completamente diferentes uns próximos aos outros, o movimento de pessoas é intenso e os carros conversíveis desfilam com sons altos. Ver e ser visto é um estilo em Miami. Veja os TOP 07 passeios mais bem avaliados pelos turistas em Miami! –Tour por Wynwood –Ingresso do Zoo Miami –Aluguel de iate com capitão em Miami –Go City Miami Explorer Pass –Miami SightSeeing Pass –Parasailing em Miami –Escala em Miami? Tour saindo do aeroporto 4. Fazer um passeio de barco Como o mar faz parte da vida da cidade, nada melhor do que conhecer Miami por esse ângulo. Há passeios de barcos com diferentes roteiros e embarcações e a maioria deles leva a Biscayne Bay. Passeando por essa área você poderá conhecer as ilhas onde existem verdadeiras mansões, muitas delas pertencentes a celebridades. Essa é uma ótima pedida para um dia de sol e para uma atividade em família. 5. Alugar uma bicicleta para pedalar por Miami Beach Essa é uma das melhores maneiras de conhecer Miami Beach, em especial a região de South Beach. Estão espalhados por Miami diversos pontos de aluguel de bicicleta da empresa Deco Bike – você retira sua bike em um dos diversos terminais da cidade, faz o pagamento com o cartão de crédito e pode devolvê-la em qualquer terminal. A melhor pedida para um dia de sol é dar uma pedalada em South Beach. 6. Assistir a um jogo da NBA na America Airlines Arena Miami é a casa do Miami Heat, um dos melhores times da NBA, a liga de basquete profissional dos Estados Unidos. A sede do time é a AmericanAirlines Arena, em Downtown Miami, um local com uma estrutura incrível para os torcedores. Assistir a um jogo da NBA é uma experiência contagiante, um verdadeiro espetáculo tanto por parte da organização quanto pela torcida, que agita mesmo aqueles que não são tão fãs do basquete. Esse é um programa para pessoas de todas as idades, dos mais novinhos aos mais velhos. Vale a pena ficar de olho na programação da liga para ver se durante sua viagem o estádio sediará algum jogo. 7. Caminhar e fazer compras na Lincoln Road A Lincoln Road é como um shopping a céu aberto em South Beach. Ela tem movimento o dia todo, tem feirinha de comidas no fim de semana, restaurantes, cafeterias, baladas e várias lojas onde os brasileiros adoram fazer compras. É um dos locais imperdíveis a se conhecer em Miami Beach e que deixa a gente sempre com vontade de ir de novo, afinal, agrada a todo mundo. Seja para fazer compras ou curtir a noite na cidade, vale sempre a pena dar uma voltinha por lá. 8. Passear no Wynwood e visitar Wynwood Walls Essa é uma boa ideia para quando você quiser fazer um passeio diferente, em um lugar muito descolado, que cada vez fica mais em evidência na cidade. O bairro, que antigamente era abandonado, ganhou diversas paredes grafitadas, galerias. Nele fica o Wynwood Walls, um “museu” do grafite, com diversas paredes pintadas por diferentes artistas. Bem diferente e superlegal para tirar fotos! 9. Visitar Downtown Miami e Brickell Miami e Miami Beach são cidades diferentes, sabia disso? Miami é a parte continental e Miami Beach a ilha, que tem praias. Muita gente se hospeda em Miami Beach e acaba esquecendo de passar um tempo em Downtown, que é onde fica o distrito financeiro da cidade. A região vale um passeio durante o dia (de noite fica deserto), para ver a Miami de quem vive e trabalha na cidade. Veja os melhores hotéis em Miami Beach! 10. Passar uma tarde no South Pointe Park O lugar é ideal para descansar, fazer um programa relax e admirar o por do sol. O parque fica na pontinha ao sul de South Beach e tem uma boa área para crianças brincarem e uma praia com águas calmas, além de um calçadão gostoso de frente para o mar. 11. Ir ao Vizcaya Museum and Gardens Esse é um dos passeios mais legais a se fazer em Miami porque mistura a beleza da cidade à arquitetura europeia. Vizcaya foi planejada para ser a mansão de inverno de um magnata e hoje em dia é um museu, onde as pessoas podem conhecer os ricos detalhes da decoração do casarão e seus jardins bem cuidados. Como o lugar é realmente muito bonito e ainda fica de frente para Biscayne Bay, o museu é constantemente utilizado para ensaios fotográficos e casamentos. Veja aqui mais informações sobre o Vizcaya Museum. 12. Passear no Fairchild Tropical Botanic Garden Essa é uma atividade diferente e que poucos turistas fazem em Miami. O jardim botânico tem uma variedade incrível de plantas e reúne mais de 1.500 espécies só de coqueiros, além de um borboletário encantador. Faça o tour guiado em um trenzinho para conhecer todo o parque sentado e ainda aprender diversos detalhes sobre as espécies de plantas do lugar. 13. Visitar Little Havana nas Viernes Culturales Little Havana é um bairro cubano de Miami, onde as placas são escritas em espanhol, as lojas vendem produtos cubanos e as pessoas te cumprimentam com um “¡hola!” nas ruas. O lugar é interessante para quem gosta de conhecer outras culturas, para fazer um tour gastronômico e experimentar o sanduíche cubano, um tradicional na região. Outra sugestão é visitar Little Havana nas Viernes Culturales, um evento de música e artes que acontece na terceira sexta-feira de cada mês. 14. Mergulhar na Venetian Pool A Venetian Pool é uma piscina pública que foi inaugurada em 1924 e recebeu esse nome devido à sua semelhança com a cidade de Veneza. A piscina tem águas cristalinas e fica cercada por um cenário muito bonito. O local é ideal para quem está com crianças e quer um pouco de tranquilidade. 15. Andar no Metromover de Miami Tudo bem, esse não é exatamente um programa imperdível para fazer em Miami, mas é interessante, vai. O metromover é um veículo elétrico elevado que circula principalmente por Downtown Miami; ele é gratuito e proporciona uma vista muito bonita de alguns locais da cidade. Andando no metromover a gente se sente um pouco em um desenho dos Jetsons. Leia aqui sobre o transporte em Miami. 16. Se impressionar com o Phillip and Patricia Frost Museum of Science Moderno e interativo, o museu Phillip and Patricia Frost é uma ótima dica para quem se interessa por ciências, tecnologia e pelo mundo animal. O espaço tem um planetário, labirinto de espelhos, aquário e é uma dica para pessoas de todas as idades que procuram um programa divertido e diferente na cidade. 17. Conhecer o Time Out Miami 18. Ir ao Bayside Marketplace e passear no Bayfront Park O Bayside Marketplace um dos shoppings mais gostosos da cidade, não exatamente pelas lojas, mas pela arquitetura com espaços abertos e pelos restaurantes ao ar livre. É uma boa opção para almoçar durante o dia curtindo o visual do mar e durante a noite para aproveitar a vida noturna. Em seguida, você pode caminhar pelo Bayfront Park, que fica bem ao lado e possui uma ótima vista da cidade. 19. Alugar um carro conversível Esse é um luxo possível nos Estados Unidos. Se no Brasil os modelos esportivos têm preços exorbitantes, em Miami você consegue alugar um veículo desse tipo sem sacar uma fortuna do bolso. Alugar um carro é a maneira mais fácil para circular por Miami e se esse transporte puder ser feito, um dia que seja, em um Porsche, uma BMW ou Ferrari, melhor ainda, né? Veja mais sobre aluguel de carro em Miami. 20. Passear em Key Biscayne Key Biscayne é uma ilha ao sul de Miami Beach e a sudeste de Downtown Miami. Ela está a apenas 15 minutos de carro do centro da cidade e é uma região tranquila, residencial, mas com alguns pontos de interesse que chamam a atenção dos turistas, como o Miami Seaquarium e o farol de Key Biscayne (Cape Florida Lighthouse). 21. Relaxar no Miami Beach Botanical Garden Muita gente não sabe que esse jardim botânico existe e que fica no coração de Miami Beach. Não há muitas atividades para fazer por lá, mas pode ser um lugar agradável para passar o tempo, curtir a natureza e descansar em um local mais fresco entre os passeios na cidade. 22. Conhecer o lado cultural de Miami Nem só de baladas e compras vive Miami; a cidade tem vários museus e embora muita gente não pare para conhecer essa faceta da cidade, ela existe e é muito interessante. Entre os museus bacanas para visitar estão o, Pérez Art Museum, Bass Museum of Art, o Phillip and Patricia Frost Museum of Science, e o Wolfsofian, que pertence a Universidade Internacional da Florida. O Memorial ao Holocausto, em Miami Beach, também vale um momento da sua programação. 23. Meditar no Wat Buddharangsi Buddhist Temple Você tem vontade de conhecer um templo budista? Miami também poderá oferecer essa experiência! A cidade possui o Wat Buddharangsi, um espaço tranquilo, relaxante, cercado por árvores e que pode render um passeio muito diferente em Miami! 24. Conhecer o Miami Design District Reduto de amantes da moda, arquitetura e artes, o Miami Design District é uma área luxuosa da cidade, com lojas de grandes nomes da moda mundial, galerias, restaurantes e shoppings como o Paradise Plaza e Palm Court. Se dinheiro não for problema, você pode fazer algumas compras por lá, ou simplesmente conhecer a região e lojas que referência de moda no mundo. 25. Desbravar a cidade através do Miami Trolley Esse sistema de transportes de Miami é uma ótima pedida para quem tem tempo e quer conhecer algumas das principais atrações da cidade gratuitamente. Ele é um ônibus, mas tem cara de bondinho, e leva seus passageiros entre bairros como Downtown, Wynwood, Little Havana, Coconut Grove e outros. Para quem quer economizar, é imperdível! Veja aqui mais dicas sobre o Miami Trolley. 26. Fazer um brunch O brunch é a mistura de breakfast (café da manhã) com lunch (almoço) e é um hábito sair para fazer brunch em algumas cidades dos Estados Unidos, principalmente no domingo. Miami tem tudo a ver com um brunch ao ar livre e vários restaurantes da cidade abrem com um cardápio especial para essa refeição. 27. Descobrir a história do Ancient Spanish Monastery Esse monastério espanhol em North Miami é outra boa surpresa da cidade. Utilizado para eventos e casamentos, ele possui um edifício de pedras e belos jardins com árvores. Inicialmente construído no século XII, o monastério ficava no Norte da Espanha e abrigou monges por mais de 700 anos. Em 1925 o edifício foi comprado por um magnata e posteriormente reconstruído, pedra por pedra, em Miami. 28. Conhecer o Deering Estate Outra dica para quem quer fugir dos passeios mais tradicionais ou prefere uma programação menos explorada, é conhecer o Deering Estate, uma propriedade enorme, com uma mansão e largos jardins. O local foi adquirido por Charles Deering, oferece atividades ao ar livre como caminhadas e caiaque, e conserva o charme das construções de 1920. 29. Curtir os restaurantes ao ar livre de Miami Se tem uma expressão que define Miami muito bem é “ao ar livre”. O clima gostoso da cidade permite que muita coisa seja planejada para ficar em áreas abertas, então é fácil encontrar uma cafeteria ou restaurante com mesinhas nas calçadas. Se o dia estiver bonito, já sabe… sente-se numa dessas mesinhas para o people watching, o hábito de observar pessoas andando pelas ruas. 30. Aproveitar a noite de Miami Se você gosta de baladas, escolheu o lugar certo para visitar. A cidade tem ótimos bares, lounges e boates que tocam música até tarde. Para quem gosta de festa, Miami é o lugar certo, em especial na área de South Beach, onde estão a Lincoln Road, Ocean Drive com suas diversas casas noturnas, a Española Way, uma rua que reúne vários bares e restaurantes. Para um happy hour, considere ir ao roofttop do East Hotel, que tem um visual lindo! Veja dicas sobre a vida noturna de Miami. Importante: Por causa da pandemia, os estabelecimentos algumas atrações podem estar fechadas e/ou funcionando parcialmente, com novos protocolos sanitários. Passeios em Miami Atividades para conhecer nos arredores da cidade 31. Passeio de airboat nos Everglades O Parque Nacional dos Everglades ocupa um grande pedaço da Flórida e uma das maneiras mais legais de conhecê-lo é com um airboat, um barquinho movido a hélice. O barulho do barco é chato, mas essa é uma maneira bem divertida de navegar pela vegetação alagada do parque e ver jacarés de todos os tamanhos, que é o principal foco do passeio. Veja aqui mais informações. 32. Passar um dia em Fort Lauderdale 33. Passeio em Key West Key West é uma cidade ao sul da Flórida que faz parte da chamada “Florida Keys”, região com pequenas ilhas, resorts e o lindo mar do Caribe. Algumas agências oferecem passeios por essa região de paisagens bucólicas, onde você pode praticar atividades aquáticas e mergulhar com corais. Esses passeios podem ser de um único dia, o que o torna um pouco corrido, ou você pode aproveitar para emendar a viagem e ficar alguns dias em Florida Keys. 34. Excursão às Bahamas Fazer uma excursão às Bahamas, arquipélago caribenho com ilhas paradisíacas é outra opção que pode complementar sua viagem de uma maneira espetacular! Há pequenos cruzeiros pela região ou também ferry boats, que levam em torno de duas horas de viagem entre Fort Lauderdale e Bimini, nas Bahamas. Conhecer Miami e incluir na programação uma viagem ao Caribe é a dobradinha perfeita para encontrar praias incríveis e a estrutura de uma cidade grande. Miami com crianças Famílias com crianças viajam à Flórida aos montes e os pequenos não ficam para trás em nenhum roteiro pela cidade, pois há diversos programas interessantes para quem está com os filhos. Veja mais aqui. 35. Miami’s Children Museum Esse é um espaço que as crianças amam e não querem mais ir embora! O local é como um playground enorme, em que as crianças podem participar de atividades interativas, participar de atividades sensoriais, simular diferentes profissões, entre outros. 36. Gecko Park Ótima alternativa para um dia divertido em família, o Gecko Park possui camas elásticas, slackline, área de escalada, jousting (espécie de duelo com almofadas) e outros. 37. Jungle Island A Jungle Island é um local que mistura um pouco de zoológico e parque. O local promove encontros com algumas espécies animais e tem um beach club para curtir sua praia. 38. Miami Seaquarium O aquário de Miami é um dos mais antigos em funcionamento contínuo nos Estados Unidos e um dos principais pontos turísticos da cidade. Ele foi criado em 1955 e recebe mais de meio milhão de visitantes por ano. 39. Zoo Miami O Zoo de Miami é um espaço onde você poderá conhecer e admirar animais como elefantes, girafas e macacos e alimentar algumas espécies. - Outras opções de passeios com crianças em Miami: Venetian Pool, Phillip and Patricia Frost Museum of Science, Monkey Jungle, FunDimension Wynnwood Walls etc. 40. Restaurantes em Miami – onde comer Uma parte importante da programação de uma viagem é conhecer os restaurantes da cidade. E Miami tem ótimos restaurantes, desde os mais refinados aos mais simples. Para comer um bom caranguejo, a dica é ir ao Joe’s Stone Crab, um restaurante muito tradicional, com mais de 100 anos de história. Para um café ou brunch na beira da praia, a dica é ao News Café, em South Beach. Se quiser conhecer a gastronomia cubana, visite o Versailles, em Little Havana. Para um almoço rápido, uma ótima dica é o La Sandwicherie, que tem sanduíches com bom custo-benefício e está em diferentes endereços da cidade. Hambúrgueres são tradicionais nos Estados Unidos e algumas sugestões para comê-los são o Shake Shack, Five Guys e o Lokal. Se estiver passando pela Linconl Road e indeciso sobre o que comer, vale dar uma olhada na Paul Bakery Cafe e Pizza Rustica, opções práticas e rápidas. Outra dica para refeições rápidas e saudáveis são os supermercados da rede Whole Foods, que têm uma área de refeições prontas. Para um ambiente mais refinado e uma refeição especial, vá ao italiano Casa Tua, opção bem aconchegante. O contemporâneo Juvia, e o LaMar by Gaston Acurio são duas boas dicas para quem quer comer bem e ainda desfrutar de um belo visual. Em Miami Beach ainda fica o delicioso Byblos Miami, que serve pratos da gastronomia mediterrânea, em Downtown você pode conferir o japonês Zuma. Veja mais dicas sobre onde comer em Miami. 41. Compras em Miami Para muita gente, essa é a principal atividade a ser feita na cidade, afinal, como resistir a preços tão camaradas? Mesmo em tempos de dólar alto, é possível encontrar boas ofertas na cidade! Se você tem vontade de fazer compras em Miami, planeje um tempo apenas para isso porque os melhores shoppings, muitas vezes, ficam mais afastados e possuem muitas lojas, o que acaba levando tempo para destrinchá-lo. Para quem quer encontrar os melhores preços, o lugar a não perder uma visita é o Sawgrass Mills, a 40 minutos de Miami de carro, e que tem ótimos preços. O Dolphin Mall também é uma boa dica e mais próximo de Miami. Para lojas de luxo, o Miami Design District é uma boa dica, assim como Bal Harbour Shops. Na Lincoln Road, em Miami Beach e Downtown Miami você encontra um misto de lojas de luxo e outras mais populares, que rendem ótimas compras, inclusive grandes lojas de departamento com preços de ponta de estoque. Em Downtown está o Bayside Marketplace, um shopping simpático para um passeio no fim de tarde, e em Brickell fica o novo e belíssimo Brickell City Centre, com um arquitetura moderna e boas lojas. 42. Melhor época em Miami: quando ir Miami é um destino agradável o ano inteiro porque costuma oferecer temperaturas agradáveis mesmo no inverno, quando em outras partes dos Estados Unidos faz muito frio. O verão (junho, julho, agosto) é quando a cidade fica mais cheia e com temperaturas mais altas, com muita gente curtindo suas praias e praticando atividades ao ar livre. O mês mais quente na cidade é agosto, enquanto o mais frio é janeiro. As chuvas acontecem com mais frequência entre maio e outubro, que coincide com a temporada de furacões no Caribe, que pode (direta ou indiretamente) afetar as cidades da Flórida — é sempre bom ter isso em mente, embora os furacões sejam estatisticamente, algo raro de afetar uma viagem. Informações do site Weather.com Voltar ao Menu Transporte em Miami e deslocamento – como circular Como explicamos, alugar um carro é uma ótima pedida para circular por Miami porque seus preços costumam ser convidativos. Entretanto, é importante pensar também na questão do estacionamento, que em algumas áreas da cidade é escassa e/ou pago. Se você não quiser alugar um carro, considere a possibilidade de utilizar a Uber para trajetos mais longos ou se preferir economizar, utilize o transporte público da cidade, que é composto por ônibus, trolley, Metromover (veículo elétrico elevado) e o Metrorail (trem de superfície). Para trajetos de curtas ou médias distâncias, é possível ir a pé ou com bicicletas, já que Miami e Miami Beach têm um projeto chamado CitiBike, de bicicletas compartilhadas. Mais dicas de Miami: – Confira sempre a previsão do tempo ao visitar a cidade. Reserve os dias de céu nublado ou chuva para fazer compras e os dias de sol para ficar ao ar livre, por exemplo. – Se estiver sozinho ou com mais uma pessoa e achar que não compensa alugar um carro, ande de ônibus. Ok, não é tão prático quanto um carro, mas é barato e funciona. Tenha sempre dinheiro trocado para pagar a passagem pois não há troco ao fazer o pagamento nos ônibus. – Se você pretende visitar vários pontos turísticos, compre o Go Miami Card, um cartão que dá direito a entrada em diversos pontos turísticos da Flórida e que pode refletir em uma boa economia. – Use o velho truque de comprar um chip de telefone pré pago para o seu smartphone e utilize o Google Maps, Waze e tantos outros apps de viagem que poderão facilitar sua vida em destinos em que você não tem familiaridade. Informações úteis – Miami Aeroporto: Miami International Airport (MIA) e também servido pelo Fort Lauderdale-Hollywood International Airport (FLL). Língua: inglês, mas o espanhol é amplamente utilizado Moeda: dólar americano – USD (veja aqui a cotação) Estado: Flórida Fuso horário: UTC -5 População: 470 mil habitantes Site oficial de turismo Embaixada dos Estados Unidos no Brasil Quer saber mais detalhes para planejar sua viagem a Miami? Leia aqui sobre quando ir a Miami, como chegar a Miami, onde ficar em Miami, pontos turísticos de Miami, como é andar no Brightline, o trem rápido que liga Miami a Orlando, e muito mais. Sabemos que há muitas outras atrações em Miami e queremos as suas dicas! Conte nos comentários qual é a atração ou o passeio que você mais gosta na cidade!"
}