{
  "url": "https://oregonisforadventure.com/astoria-oregon/",
  "title": "27 BEST Things To Do in Astoria, Oregon",
  "text": "27 BEST Things To Do in Astoria, Oregon There are so many things to do in Astoria, Oregon! A picturesque settlement dotted with Victorian-era homes and perched on the hills along the Columbia River, Astoria is the oldest city in Oregon, making it rich in history and culture. Its iconic bridge over to Washington dominates its shoreline, which makes for a beautiful sight as you walk along the Riverfront path. And for those after adventure, you can expect hilly hikes, old forts, shipwrecks, and even famous movie locations. We love Astoria! Shh, don’t tell the other Oregon coast towns, but Astoria just might be our favorite! Table of Contents - BEST Things To Do in Astoria - 1. Take a Ride on the Historic Trolly - 2. Explore the Astoria Riverwalk Trail on Foot or Bike - 3. Walk Down (or Up) the Pigeon Steps - 4. Enjoy Great Beer With a View at Astoria Brewing Company - 5. Check Out Obelisk Beer Co. – The New Brewery in Town - 6. Stretch Your Legs Along the Airport Dike Trail and Bayfront - 7. Spend Some Time By the Water at Pier 39 Astoria - 8. Get Your Caffeine Fix at Coffee Girl - 9. Stop for Seals by the East Astoria Mooring Basin Dock - 10. Visit the Flavel House Museum - 11. Hike the Cathedral Tree Trail and See the Astoria Column - 12. Reconnect with Nature at Shively Park - 13. Go Back in Time at the Columbia River Maritime Museum - 14. Grab a Pint at Fort George Brewery or a Pastry at Blue Scorcher Bakery & Cafe - 15. Don’t Miss Fort Astoria - 16. Catch a $5 Movie at the Columbian Theater - 17. Wander the Goonie Trails - 18. Learn about Astoria’s Stints on Screen at the Oregon Film Museum - 19. Have Some Retro-Style Fun at Gizmo’s Arcade & Eatery - 20. Discover Local Wildlife - 21. Go Bowling at Lower Columbia Bowl - Things to Do Near Astoria, Oregon - Lodging and Camping Around Astoria, Oregon - More Oregon Coast Towns BEST Things To Do in Astoria ✋ HOLD UP! Don’t Forget… You need some wheels! It’s nearly impossible to get around the USA and check out the best adventures without a car! Here are our top recommendations… 🚗 Rent a car If you don’t have your own, renting a car is your best bet! 🚐 Rent a home on wheels For the more adventurous, rent a van or RV and ditch the hotel. 📍 GET THE ULTIMATE PNW MAP 🗺️ Get our curated list of the best adventures, things to do, and places to grab a brew loaded onto your maps with just two clicks! ✅ Waterfalls ✅ Hikes ✅ Viewpoints ✅ Craft breweries ✅ National Parks ✅ 1400+ Pins 1. Take a Ride on the Historic Trolly For a real sense of Astoria’s history, take a ride on the Historic Trolley. The ‘Old 300’ was built in 1913, and it continues chugging along today parallel to Astoria’s scenic waterfront. On average, a round trip will take you about an hour, with a guide narrating your journey the whole way. The view from the trolley is amazing and ever-changing, and it runs from the East End Mooring Basin to the West End Mooring on the original tracks. There are plenty of shops and eateries along the route, making it an easy and cost-effective way to see the city without having to worry about getting in and out of a car and finding multiple places to park. Pay just $1 to ride for as long as you like or $2 to hop on and off all day. 2. Explore the Astoria Riverwalk Trail on Foot or Bike If you prefer to stretch your legs rather than take the trolley, take a stroll or bike ride along the Astoria Riverwalk Trail. You’ll pass museums, restaurants, and breweries, with great views of the river along the way. Astoria is also very well known for the incredible Astoria-Megler Bridge that connects Oregon to Washington. It is a beautiful addition to the city’s skyline, and when crossing, the views of the Columbia River are breathtaking. It’s 5 miles long and an easy paved path. You can do as little or as much of the trail as you’d like. 3. Walk Down (or Up) the Pigeon Steps If you’re hunting for views, the hilly city of Astoria has plenty to offer. One of the best views in town sits atop the Pigeon Steps—a series of small steps that lead up to an epic viewpoint over the whole town and waterfront. Not sure if steps is the right word, so don’t be scared off just yet. It’s really more of a long ramp with “steps” (more like bumps) along the way. The steps are located at the intersection of 11th Street and Irving (or Jerome, depending on if you want to go up or down). After you take in the views from the top, you can walk down the steps and continue along 11th Street, where you’ll run into some cute houses, shops, Astoria Brewing, and the River Walk. 4. Enjoy Great Beer With a View at Astoria Brewing Company One of our favorite things to do in Astoria is to plop down at Astoria Brewing, the city’s oldest microbrewery. It has been overlooking the Columbia River since 1997 and provides great food accompanied by some amazing views and brews. At the very least, you’ve got to pop in for a quick brew and a to-die-for marionberry cobbler (we’ve had it like 5 times; it’s so good)! Last time we were here, I had a sour, and Garrett had their flagship IPA. They always have something new and fun on tap. 🏨 Need a place to crash nearby? From rustic cabins to boutique inns—check prices and availability in just a click. 5. Check Out Obelisk Beer Co. – The New Brewery in Town Obelisk Beer Co. is one of Astoria’s newer breweries, and it’s definitely worth checking out if you’re a craft beer lover. The brewery is actually set in a midcentury beer distribution warehouse, and it’s a super cozy space. We had a few beers here when they were still opening and can’t wait to visit again when they are more established! 6. Stretch Your Legs Along the Airport Dike Trail and Bayfront Distance: 4 miles Type of Trail: Out & Back Difficulty: Easy Elevation Gain: 29 feet The Airport Dike Trail is a 4-mile out-and-back easy. This pleasant walk will take you through a lush estuary, which is a prime bird habitat, and as you stroll, you’ll have stunning views of Astoria and Youngs Bay. Start the trail at the end of the Lewis and Clark Bridge along a small access road, where you can also park. From the access road, it is an easy, flat walk along a grassy road that is very well maintained. The last half of the hike actually runs parallel to the airport runway, offering exceptional views of landing and take-offs. Once you reach the end of the trail, you can continue along the Bayfront Dike Trail by carefully crossing Highway 101. RELATED: 17 Breathtaking Oregon Coast Hikes 7. Spend Some Time By the Water at Pier 39 Astoria One of the best things to do in Astoria is to spend some time down by the water, and Pier 39 is hands down one of the best places along the waterfront. This large and historic building was once a cannery, and today, it houses some cute shops, tons of memorabilia, and a mini museum. There are also some old ships parked nearby and a large boardwalk around the entire area, making it a great spot for photo ops or simply soaking in the views. 8. Get Your Caffeine Fix at Coffee Girl Once you’re ready for a little pick-me-up, head to Coffee Girl. This cute coffee shop is located in Pier 39, and it can also tie its roots back to the canning history of the building. Over 175 years ago, this little coffee shop served up the good stuff to workers of the cannery. Today, you can still get a good cup of Joe here, and there are also tons of old photos and other cute artifacts displaying the shop’s lore. Coffee with a splash of history, why not? 9. Stop for Seals by the East Astoria Mooring Basin Dock Making a stop at the East Astoria Mooring Basin Dock is probably one of the most underrated things to do in Astoria. You can’t actually get onto the pier (which is why most people don’t waste their time coming over here), but I’ll let you in on a little secret. You can park in the small parking area, then start walking along the boardwalk trail for some awesome views of the harbor. Come for the views, stay for the seals! If you’re lucky, you’ll be able to spot some seals on the dock just in front of the trail here. 10. Visit the Flavel House Museum Astoria is home to some pretty cool architecture, and one of the most beautiful houses in town is a museum open to the public. The Flavel House Museum is an old Victorian mansion that was once owned by one of Astoria’s most influential residents – Captain George Flavel. You can tour the house and grounds (much of which has remained the same over the last couple of centuries) or simply admire the home from the outside. 11. Hike the Cathedral Tree Trail and See the Astoria Column Distance: 1.6 mi Type of Trail: Out & Back Difficulty: Moderate Elevation Gain: 393 feet *Option to drive up to the column for a fee When looking for things to do in Astoria, Oregon, hiking is often one of the first things that come to mind. This hike begins at the Astoria Column parking lot, taking you to the towering Sitka spruce known as the Cathedral Tree. The tree is just around half a mile from the trailhead, leading through a dense forest. The route is very well marked, and it is a relatively easy walk, although there are some short hills and stairs to tackle. The Cathedral Tree is a massive Sitka spruce tree, said to be around 300 years old, and it is quite a spectacle to behold. One of the most interesting features of the tree is the large, natural opening at its base, which looks like an old cathedral, hence the name. If you are up for extending your adventure, you can continue for an additional mile to the top of Coxcomb Hill and enjoy the 360-degree panoramic views of the surrounding area. If you don’t feel like hiking but still want to get some epic views over the city, you can pay $5 to park at the Astoria Column, then head up to the observation deck inside. RELATED: How To Do an Oregon Coast Day Trip From Portland 12. Reconnect with Nature at Shively Park You don’t have to go far to reconnect with nature in Astoria. The historic Shively Park sits off the main drag, and it’s one of the best things to do in Astoria if you want a break from the busy town center. The park has multiple trails, plus a paved walkway that loops around the entire park. There are also picnic shelters and a play area for the kiddos. 13. Go Back in Time at the Columbia River Maritime Museum Thanks to its position along the Columbia River (which empties out into the Pacific Ocean), Astoria has a long history with all things Maritime. If you’re interested in Maritime history, the Columbia River Maritime Museum is one of the best things to do in Astoria. From the days of hand-carved canoes to the present-day use of the river, the museum is full of cool artifacts and exhibits. 14. Grab a Pint at Fort George Brewery or a Pastry at Blue Scorcher Bakery & Cafe Craving a pastry? Or maybe a coffee? Beer? Well, no matter what you’re in the mood for, Fort George Brewery and the Blue Scorcher Bakery & Cafe have you covered! These two Astoria favorites are housed in the same majestic building, so whether you’re in the mood for craft beer and pizza or a latte and a scone, this historic building can make all your dreams come true. We love the patio at Fort George and always pop in for a brew when we are in town. 15. Don’t Miss Fort Astoria Tucked away behind the Fort George Brewery is a relic of Astoria’s past. Fort Astoria is an unassuming log-cabin-like structure, but it was once the main trading post of the Pacific Fur Company. I wouldn’t go too far out of your way to see this unless you’re a major history buff, but if you’re already at the brewery, it’s definitely worth checking out. There’s a nice plaque with some info about the old fort, plus a cool mural to literally help paint a picture of what this area used to look like. 16. Catch a $5 Movie at the Columbian Theater Is there anything better than a $5 movie? How about a $5 movie in a cool vintage theater? Welcome to the Columbian Theater! Situated in downtown Astoria, this old-school theater is a must-see, even if you’re not sticking around for a showtime. If you do want to catch a showing on the big screen, you can do so with a pizza, beer, and of course, a giant bucket of movie theater popcorn. 17. Wander the Goonie Trails Take an afternoon to wander along the wild and rarely documented trails known as the Goonie Trails, one of the most fun things to do in Astoria. The trails are named after the famous movie, The Goonies, as some of the most iconic movie scenes were filmed in Astoria. Many filming locations can still be seen around the town today, including the Goonies House, Data’s House, the crosswalk opposite Astoria Coffee Co, the Flavel House Museum, and more. Note that most of the homes are inhabited by actual people, so don’t get too close! 18. Learn about Astoria’s Stints on Screen at the Oregon Film Museum As you trek along the Goonie Trails, be sure to check out the County Jail, which was used in the film as a jailhouse and is now home to the Oregon Film Museum. It’s not just the Goonies that was filmed in Oregon. The state’s impressive landscape makes it a popular backdrop amongst producers. If you want to learn more about film or Astoria’s history on screen, don’t miss this museum! 19. Have Some Retro-Style Fun at Gizmo’s Arcade & Eatery Gizmo’s Arcade is one of the most fun things to do in Astoria! This retro-style arcade is decked out with pinball machines, arcade games, and more, and trust me when I say it’s not just for the kids. We definitely got lost in time here and played tons of old school games together! If you work up an appetite, they serve up a menu full of unique hot dogs, plus other arcade-inspired cuisine like pizzas, nachos, and rootbeer floats. 20. Discover Local Wildlife Astoria is well known for the huge number of seals and sea lions that can often be spotted frolicking along the river. In fact, Astoria often puts well-known American sea lion hotspots, such as San Francisco, to shame. Huge whales can be seen all along the coast here, like in nearby Fort Stevens State Park or Ecola State Park, making their way down to warmer waters. It is fairly common at Ecola State Park to see huge Roosevelt Elk slowly emerging from the trees to graze. The state parks are also a great spot for spotting every Northwest bird imaginable. One of the best places to catch sight of Bald Eagles is the Twilight Eagle Sanctuary, where you’ll see them hunting over the open water from your roadside observation deck. You also have a good chance of spotting the Great Egret, Great Blue Heron, and Canadian geese in the winter. RELATED: 11 Stunning Things To Do on the North Oregon Coast 21. Go Bowling at Lower Columbia Bowl Bowling is the perfect rainy day activity, and Astoria has a pretty cool bowling alley. Lower Columbia Bowl is a retro bowling alley that has been featured on the big screen multiple times. Chuck is seen hanging out in the bowling alley’s arcade in The Goonies, and LCB has also made an appearance in Teenage Mutant Ninja Turtles III and Free Willy. Even if you don’t care much about the movie lore, Lower Columbia Bowl is a fun spot to spend an afternoon. GET THE ULTIMATE PNW MAP Get our curated list of the best adventures, things to do, and places to grab a brew loaded onto your maps with just two clicks! Things to Do Near Astoria, Oregon You don’t have to head out too far to find more things to do around Astoria. Everything here is only about 45 minutes away or less. 22. Spend a Day at Fort Stevens State Park Fort Stevens State Park is just a 20-minute drive from Astoria and is a stunningly diverse park that is well worth the drive. There is so much to do within its 4200 acres, looking out over both the Columbia River and the Pacific Ocean. It is one of Oregon’s busiest summer vacation spots with activities such as swimming and fishing in the freshwater lakes, biking and hiking on miles of trails, and exploring 15 miles of open, sandy beach. There are also designated viewing platforms for birding and whale watching during the winter months. Visitors can also enjoy the human-made attractions in the park, including the historic military installations and the incredible Peter Iredale shipwreck that has been lying on the coast since 1906. READ MORE: Your Guide to Fort Stevens State Park 23. Marvel at Youngs River Falls Distance: .3 miles Type of Trail: Out & Back Difficulty: Easy Elevation Gain: 49 feet If you’re looking for a nice and easy walk down to a stunning waterfall, the Youngs River Falls area is for you. It is a beautiful place to explore a beautiful stretch of river hidden by dense forest. The falls are a scenic 50-foot plunge on the Youngs River, just about 15 minutes outside Astoria. A short quarter-mile trail starts from the signs and winds downhill to the waterfall’s base. It is the perfect place to relax, with a nice little swimming hole a few feet downstream of the falls and a rocky beach at the base of the falls. The deepest spot of this swimming area is 5.7 feet. The stop makes for a popular roadside attraction for those exploring this part of Oregon, as you can stretch your legs on the trail and even take a dip in the warmer weather. Part of the allure of these falls is their fame, having featured in several movies such as Free Willy 2. RELATED: 29 Stunning Oregon Waterfall Hikes 24. Find Your New Favorite Beach—Cannon Beach! As soon as you set eyes on Cannon Beach, you will be able to see why it is one of Oregon’s favorite coastal destinations. It is stunning, with plenty for everyone to enjoy. Just a stroll along the sand is reason enough to make the trip to this striking beach, just 40 minutes south of Astoria. Haystack Rock is the real attraction here, towering a majestic 235 feet out of the ocean just off the coast. At low tide, the pools at the base of the rock are filled with a huge variety of colorful sea creatures, while the birdlife around the rock is sure to satisfy even the most avid birdwatcher. Common sightings include Tufted Puffins, Brown Pelicans, and Bald Eagles. READ MORE: Adventurous Things To Do in Cannon Beach 25. Discover the Beauty of Ecola State Park The viewing area at Ecola State Park offers one of the most stunning vistas on the Oregon Coast. It is easy to miss this coastal beauty if you are on your way to more well-known sights such as Cannon Beach, but if you have time to make a stop, you certainly will not be disappointed. The drive to the park is beautiful in itself, winding through stands of Sitka spruce and western hemlock. The views stretch all the way south past Cannon Beach and north towards Seaside. Have a picnic, a stroll, or if you’re up for a little more of a walk, take the Tillamook Head Trail or the Clatsop Loop Trail, which takes you to dramatic ocean viewpoints. One of the most iconic sights at Ecola State Park is ‘Terrible Tilly,’ a decommissioned lighthouse that sits on a rock out to sea, named for the severe weather conditions that often batter the lighthouse. READ MORE: Your Guide to Ecola State Park on the Oregon Coast 26. Take a Day Trip to the Town of Seaside The town of Seaside is close to Astoria and has plenty of adventurous things to do that will keep you entertained for a day or two. You can’t visit the town without taking the famous Promenade Walk. It is a 1.5-mile paved walkway that runs alongside the ocean, with lovely views on one side and cute cottages, coffee shops, and eateries on the other. At the end of the prom, you’ll find one of Seaside’s historical landmarks, the Lewis and Clark Monument. For those that want to take to the water, there are a few options in Seaside. The Necanicum River is the perfect place for kayaking. Alternatively, there is Quatat Park, which offers a range of different boat rental options, from stand-up paddleboards to floating trikes, which can be a lot of fun. This part of Oregon has some of the best breaks in the Pacific Northwest, making it a hotspot for surfers too! There are lots of places to eat or grab a drink in town, and once you have tired yourself out with all the adventurous activities on offer, take a soak in the Ashore Hotel’s saline pools; there is nothing more relaxing. READ MORE: Adventurous Things To Do in Seaside, Oregon 27. Hop in the Car and Take a Scenic Drive Over To Washington Once you’ve tired of walking all around the city, hop in the car and take the scenic drive over to the neighboring state of Washington. The drive will take you over the Columbia River mouth, starting at Astoria. You’ll cross the stunningly scenic and famous Astoria Bridge, where the river merges with the Pacific Ocean, and then catch Washington 101 on the other side. Pop into Fort Columbia Historical State Park for a dash of history while you wander old coastal defenses. Carry on along the 2-mile-wide Long Beach Peninsula to Seaview. The area has made a name for itself for having the ‘world’s longest beach drive,’ thanks to its 28 miles of sand (although it’s not!). Once you reach the southern end, make sure you spend a little time exploring Cape Disappointment State Park. The drive ends at Leadbetter State Park for even more hikes and scenic viewpoints. RELATED: 19 Must-Visit Oregon Coast State Parks Lodging and Camping Around Astoria, Oregon Here’s a quick rundown of some great places, but we also have a guide on where to stay in Astoria for more info! - Fort Stevens State Park Campground – The campsite at Fort Stevens State Park is huge, one of the biggest in the Oregon State Park system. There are over 300 campsites available, many of which come with full hookups and even yurts. - By the Pier – This two-bedroom home gets a big thumbs up for its location – you’ll be right near the pier with views of the water and just a short walk to all that Astoria has to offer. The comfortable stay is decked out with two queen beds, and it’s pet-friendly too! - Norblad Hotel – This historic Astoria building has been converted into a guesthouse with a cool, modern design. You’ll find rooms to suit a range of budgets, from simple but chic doubles to deluxe king suites. There’s even a shared kitchen where you can cook your own meals. 👉 More Accommodation in Astoria We hope this post helped you better explore Astoria! Check out more posts on the Oregon Coast and even more adventures around the state."
}