{
  "url": "https://en.m.wikipedia.org/wiki/Produce",
  "title": "Produce - Wikipedia",
  "text": "Produce In American English, produce generally refers to fresh fruits and vegetables intended to be eaten by humans, although other food products such as dairy products or nuts are sometimes included.[1][2][3][4] In supermarkets, the term is also used to refer to the section of the store where fruit and vegetables are kept. Produce is the main product sold by greengrocers (UK, Australia) and farmers' markets. The term is widely and commonly used in the U.S. and Canada, but is not typically used outside the agricultural sector in other English-speaking countries. Packaging [edit]Produce may be packaged for transport or sale. In parts of the world, including the U.S. and Europe, loose pieces of produce, such as apples, may be individually marked with small stickers bearing price look-up codes. These four- or five-digit codes are a standardized system intended to aid checkout and inventory control at places where produce is sold. - Produce may be bagged in the field during harvest. - Produce may be packaged for transport in a plastic crate. - Wooden boxes for bulk produce - Mesh bag used for retail sales - Small amounts may be banded together. - Bulk produce may be identified by stickers Bacterial contamination [edit]Raw sprouts are among the produce most at risk of bacterial infection.[5] Rinsing is an effective way to reduce the bacteria count on produce, reducing it to about 10 percent of its previous level.[6] Wastewater used on vegetables can be a source of contamination, due to contamination with fecal matter, salmonella or other bacteria.[7] After Denmark eliminated salmonella in its chickens, attention has turned to vegetables as a source of illness due to feces contamination from other animal sources, such as pigs.[7] See also [edit]Notable people [edit]References [edit]- ^ \"produce, noun\". Merriam-Webster Dictionary. 2024-09-02. Retrieved 2024-09-08. 2: agricultural products and especially fresh fruits and vegetables as distinguished from grain and other staple crops - ^ \"Standards for the Growing, Harvesting, Packing, and Holding of Produce for Human Consumption\". Federal Register. 2015-11-27. Retrieved 2024-09-08. the Food and Drug Administration...is establishing science-based minimum standards for the safe growing, harvesting, packing, and holding of produce, meaning fruits and vegetables grown for human consumption. - ^ \"produce\". Longman Dictionary of Contemporary English. Retrieved 2024-09-08. food or other things that have been grown or produced on a farm to be sold - ^ \"produce, noun\". Oxford English Dictionary. 4. Agricultural and natural products collectively, as opposed to manufactured goods. - ^ \"Hold the Raw Sprouts, Please\". www.medscape.com. Retrieved 2016-09-18. - ^ DeRusha, Jason (9 November 2010). \"Good Question: Does Washing Fruit Do Anything?\". Retrieved 2016-09-18. - ^ a b \"No more salmonella in Danish poultry\". 3 July 2012. Retrieved 2016-09-18. Further reading [edit]- Doyle, Martin (1857). Farm & Garden Produce: A Treasury of Information. G. Routledge & Co. OCLC Number: 39049007 - Microbial Safety of Fresh Produce - Google Books - The Produce Contamination Problem: Causes and Solutions - Google Books - Produce Degradation: Pathways and Prevention - Google Books - Decontamination of Fresh and Minimally Processed Produce - Google Books - Microbiology of Fresh Produce - Google Books - Slow food: A Passion for Produce - Google Books - Melissa's Everyday Cooking with Organic Produce - Google Books - Procurement and Marketing of Minor Forest Produce in Tribal Areas - Google Books - Public Produce: The New Urban Agriculture - Google Books - Global standard for food safety: guideline for category 5 fresh produce (North American version) - Google Books External links [edit]The dictionary definition of produce at Wiktionary"
}