{
  "url": "https://forums.rs-rot.net/t/84186/",
  "title": "Joining RoT - General Chat - Reign of Terror",
  "text": "Jarjar inks Report post Posted November 19, 2023 I am coming back to runescape after leaving for a few years. In the past I have pked with smaller teams (10-20 man). I’m looking for guidance on how to join rot and to get back into multi pking. Share this post Link to post Share on other sites 0 Bluewatch Report post Posted November 19, 2023 gm my boy Share this post Link to post Share on other sites 0 Bbm Report post Posted November 19, 2023 yes PM @Antijarfor any concerns If you need any additional assistance please PM the manager of Architecture and Foundation @Edson If you need any assistance with managing female accounting please PM @Mike Share this post Link to post Share on other sites 0 dexys Report post Posted November 19, 2023 pm@chasewith your best runescape fantasy fo make an admissions enquiry Share this post Link to post Share on other sites 0 Reindeer Report post Posted November 19, 2023 pm @Mikehe will guide you Share this post Link to post Share on other sites 0 Bipoc Report post Posted November 19, 2023 hey heres a guide; 1. join antirot clan 2. spy 3. u get chance to join rot 4. gl Share this post Link to post Share on other sites 1 Goy Report post Posted November 19, 2023 @Mikeis the application manager he can steer you in the right direction Share this post Link to post Share on other sites 0 Pamp Report post Posted November 19, 2023 @Antijaris usually good at explaining this process. I would message him on discord. Share this post Link to post Share on other sites 0 Jarjar inks Report post Posted November 19, 2023 Ty for the info boys. I will follow up with everyone you mentioned Share this post Link to post Share on other sites 0 Entangle Report post Posted November 19, 2023 best of luck. Share this post Link to post Share on other sites 0 Solo Report post Posted November 19, 2023 2 hours ago, Jarjar inks said: Ty for the info boys. I will follow up with everyone you mentioned gl brother Share this post Link to post Share on other sites 0 Sanders Report post Posted November 19, 2023 10 hours ago, bipoc said: hey heres a guide; 1. join antirot clan 2. spy 3. u get chance to join rot 4. gl Share this post Link to post Share on other sites 0 rot scientist Report post Posted November 19, 2023 12 hours ago, bipoc said: hey heres a guide; 1. join antirot clan 2. spy 3. u get chance to join rot 4. gl Share this post Link to post Share on other sites 0"
}