{
  "url": "https://es.wikipedia.org/wiki/YouTube",
  "title": "YouTube - Wikipedia, la enciclopedia libre",
  "text": "YouTube YouTube (abreviado como YT) es una red social y plataforma de video online de Estados Unidos propiedad de Google. YouTube fue fundada el 14 de febrero de 2005 por Steve Chen, Chad Hurley y Jawed Karim, tres antiguos empleados de PayPal.[1] Con sede en San Bruno, California, es el segundo sitio web más visitado del mundo, después de Google Search. En enero de 2024, YouTube contaba con más de 2,7 millardos de usuarios activos mensuales, que veían colectivamente más de mil millones de horas de videos al día.[2] En mayo de 2019 se subían videos a la plataforma a un ritmo de más de 500 horas de contenido por minuto,[3][4] y a 2023, había aproximadamente 14 millardos de videos en total.[5] El 9 de octubre de 2006 Google LLC anuncia la compra de Youtube por 1.650 millones de dólares en acciones (equivalentes a 2.310 millones de dólares en 2023), siendo esta efectiva, tras la aprobación de los reguladores, el 13 de noviembre de 2006.[6][7] Google amplió el modelo de negocio de YouTube de generar ingresos únicamente a partir de anuncios, para ofrecer contenidos de pago como películas y contenidos exclusivos producidos por y para YouTube. También ofrece YouTube Premium, una opción de suscripción de pago para ver contenidos sin anuncios. YouTube incorporó el programa Google's AdSense, generando más ingresos tanto para YouTube como para los creadores de contenidos aprobados. En 2023, los ingresos por publicidad de YouTube ascendieron a 31.700 millones de dólares, un aumento del 2% con respecto a los 31.100 millones de dólares informados en 2022.[8] Entre el cuarto trimestre de 2023 y el tercero de 2024, los ingresos combinados de YouTube por publicidad y suscripciones superaron los 50 mil millones de dólares.[9] Historia [editar]YouTube usa un reproductor en línea basado en HTML5, que incorporó poco después de que la W3C lo presentara y que es soportado por los navegadores web más difundidos. Antiguamente su reproductor funcionaba con Adobe Flash, pero esta herramienta fue desechada en 2016. Los enlaces a videos de YouTube pueden ser también insertados en blogs y sitios electrónicos personales usando API o incrustando cierto código HTML. El 29 de agosto de 2017, YouTube dio a conocer algunos cambios en el diseño de su versión web y presentó un nuevo logotipo, que por primera vez separa el nombre del ícono.[10][11] A partir de agosto de 2018, el sitio web está clasificado como el segundo sitio más popular a nivel mundial, según Alexa Internet, justo detrás de Google.[12] A partir de mayo de 2019 se suben a YouTube más de 500 horas de contenido de video cada minuto.[13] Según los ingresos publicitarios trimestrales reportados, se estima que YouTube tiene ingresos anuales de US $ 15 mil millones.[14] YouTube se ha enfrentado a críticas sobre aspectos de sus operaciones, incluido el manejo del contenido con derechos de autor de los videos subidos. Sus algoritmos de recomendación que incluyen videos cuyo contenido, se dice, promueve teorías de conspiración y falsedades,[15] además de albergar videos aparentemente dirigidos a niños, pero que contienen violencia o sugerencia sexual, videos de menores que atraen actividades pedófilas en sus secciones de comentarios y políticas que cambian constantemente sobre los tipos de contenido que pueden ser monetizados con publicidad.[16] YouTube fue fundado por Jawed Karim, Steve Chen y Chad Hurley en febrero de 2005 en San Mateo (California). Todos ellos se conocieron cuando trabajaban en Paypal, Hurley y Chen como ingenieros.[17] De acuerdo con Hurley y Chen, la idea de YouTube surgió ante las dificultades que experimentaron al tratar de compartir videos tomados durante una fiesta en San Francisco. Esta historia ha sido considerada una versión muy simplificada, y Chen ha reconocido que esta idea se puede haber promovido por la necesidad de presentar una historia sencilla al mercado.[17] Karim ha declarado que la fiesta nunca ocurrió, y que la idea de compartir videos en Internet fue suya.[17] Sus compañeros han declarado que la fiesta sí ocurrió, y que la idea original de Karim era crear una página de citas, donde las personas pudiesen calificarse sobre la base de sus videos. Karim reconoce haber sido influenciado por un sitio de citas llamado HotorNot.com, donde los usuarios podían cargar fotos suyas, que luego eran calificadas por otros usuarios.[18] El dominio fue activado el 14 de febrero de 2005,[19] y el 23 de abril fue cargado el primer video llamado «Me at the Zoo» («Yo en el zoológico») por el cofundador de la plataforma Jawed Karim.[20][21] En la primavera YouTube entró en línea. Sin embargo, los creadores se percataron rápidamente de que los usuarios cargaban toda clase de videos, dejando atrás la idea original. El tráfico se disparó cuando la gente empezó a colocar enlaces de YouTube en sus páginas de MySpace.[22] El rápido crecimiento del sitio atrajo a Time Warner y Sequoia Capital, que invirtieron en el mismo. Luego de que, en octubre de 2005, la empresa Nike colocara un spot protagonizado por Ronaldinho, grandes compañías empezaron a sentirse atraídas por YouTube.[22] Solo en 2005, Sequoia tuvo que invertir 8,5 millones de dólares estadounidenses en el sitio. Para diciembre de 2005, las páginas de YouTube eran visitadas unas 50 millones de veces al día. Sin embargo, luego de que el video musical Lazy Sunday, transmitido originalmente en el show Saturday Night Live, fuera cargado a YouTube, las visitas se dispararon de nuevo hasta alcanzar las 250 millones de vistas diarias.[20] Para mayo de 2006, según Alexa.com, YouTube alcanzó los 2000 millones de vistas por día, y para mediados de agosto había alcanzado la marca de 7000 millones en diversas oportunidades;[20] además, se había convertido en el décimo sitio más visitado en Estados Unidos. En aquel momento, el New York Post estimó que YouTube debía valer entre 600 y 1000 millones de dólares estadounidenses.[20] MySpace.com y Google publicaron sus propias versiones de YouTube, sin éxito. Para octubre de 2006, las oficinas de YouTube permanecían en el condado de San Mateo, ubicadas en el segundo piso de un edificio, y contaba con unos 60 empleados. Un ejecutivo de Universal Music Group había anunciado hace poco que «YouTube les debía decenas de millones de dólares», por violación de derechos de autor.[23] Mark Cuban, cofundador de Broadcast.com, un servicio de radio por Internet comprado por Yahoo en 1999, había declarado un mes antes que «solo un tonto compraría YouTube por los potenciales problemas legales que enfrentaría».[23] No obstante, los propietarios del sitio ya se habían comprometido con Warner Music para mejorar el servicio, de manera tal que pudiesen detectar más rápidamente cuándo un video de su propiedad era cargado al sitio. No obstante, a inicios de ese mes se publicó un reporte en Wall Street Journal que indicaba que Google iba a comprar YouTube por 1600 millones de dólares. Dicha información inicialmente fue negada por YouTube y Google, que la calificaron como rumores. Ese mismo mes, Google compró YouTube por 1650 millones de dólares en acciones.[24] En el momento de la compra 100 millones de videos en YouTube eran visualizados y 65 mil nuevos videos era agregados diariamente. Además, unos 72 millones de personas la visitaban por mes. Hurley y Chen mantuvieron sus cargos, al igual que los 67 empleados que en ese momento trabajaban en la empresa.[25] En los días anteriores, YouTube había firmado dos acuerdos con Universal Music Group y la CBS; y Google había firmado acuerdos con Sony BMG y Warner Music para la distribución de videos musicales. Para junio de 2008, el 38 % de los videos visualizados en Internet provenían de YouTube; el competidor más cercano sólo llegaba a representar el 4 %. Aunque Google no reveló las cifras, se estimó que el sitio generó 200 millones de dólares estadounidenses ese año.[26] En ese mes, un anuncio en la página de inicio de YouTube costaba 175 000 dólares diariamente, y el cliente debía comprometerse a gastar 50.000 dólares adicionales en anuncios en Google u otras páginas de YouTube. Sin embargo, debido a que el contenido de la vasta mayoría de los videos en YouTube no atraían a los anunciantes, los precios de los anuncios se colapsaron. YouTube procedió a presionar a los estudios de cine y televisión para que produjeran contenido audiovisual de calidad, y les ofreció canales destacados, donde podían presentar anuncios de estrenos de películas y cortos de televisión. También llegó a colocar anuncios antes del inicio de un video, pero luego descubrieron que el 70 % de los usuarios abandonaba el sitio antes de que este terminase.[26] La relación de YouTube con las empresas productoras de televisión y cine ha sido variada. Viacom continúa la demanda contra YouTube por 1000 millones de dólares, iniciada en marzo de 2007, por supuesta violación masiva de derechos de autor.[27] Por otro lado, Disney firmó a finales de marzo de 2009 un acuerdo con YouTube, autorizando la transmisión de videos cortos de la ABC y ESPN. Disney podrá presentar anuncios en YouTube gracias a este trato. En abril de 2009 Google anunció que YouTube firmó alianzas con algunos estudios de Hollywood para que el sitio pudiese mostrar programas de televisión y películas completas.[28] En enero de 2010, se lanza YouTube Rentals, un servicio de videoclub por Internet con películas completas que se pueden ver al instante previo pago.[29] En los primeros años de la página Google no logró convertir efectivamente el alto tráfico de YouTube en ganancias; la empresa ha reconocido esto, pero se ha negado a proporcionar las cifras.[30] De acuerdo con un artículo de la revista Forbes, se estimaba que YouTube generaría 240 millones de dólares en 2009, quedando muy por debajo de los 710 millones en costos operativos del sitio.[31] Según un analista de la Credit Suisse, YouTube estaría presentando pérdidas por 470 millones de dólares estadounidenses en 2009;[31] sin embargo, otras empresas estiman las pérdidas en 174,2 millones.[30] En 2015, se consideraba que YouTube no era rentable, siendo que en 2014 reportó ingresos por $4000 millones de dólares, frente a los $3000 millones del año anterior, pero luego de pagar por el contenido y los equipos que reproducen de forma rápida los videos, el balance quedó en un punto de equilibrio, o sea que no ganó ni perdió dinero. Estos resultados reflejan las dificultades que tiene para expandir su audiencia que está conformada principalmente por adolescentes y preadolescentes. La mayoría de los usuarios utiliza al sitio como un depósito de videos a los cuales se accede desde enlaces o código insertado que son publicados en otras páginas, en lugar de visitar YouTube.com.[32] En febrero de 2015, YouTube lanzó una aplicación móvil conocida como YouTube Kids. La aplicación está diseñada para los niños, y cuenta con una interfaz simplificada, con selecciones de canales cuyo contenido sea apropiado para niños y funciones de control parental.[33] Más tarde, el 26 de agosto de 2015, YouTube lanzó YouTube Gaming, un sub-sitio orientado a juegos de video y una aplicación que pretende competir con la Twitch de Amazon.com.[34] En el año 2015 también se anunció un servicio prémium de YouTube titulado YouTube Red, que ofrece a los usuarios contenido libre de anuncios y también la posibilidad de descargar videos entre otras cosas.[35] El 10 de agosto de 2015, Google anunció que estaba creando una nueva compañía, Alphabet, para actuar como holding de Google, con el cambio en la información financiera a partir del cuarto trimestre de 2015. YouTube sigue siendo una subsidiaria de Google.[36] En enero de 2016, YouTube amplió su sede en San Bruno (California) al comprar oficinas por 215 millones de dólares. El complejo puede albergar hasta 2800 empleados.[37] YouTube también renovó su apariencia de aplicación móvil en agosto de 2017. En Latinoamérica ocurrió el 4 de septiembre de 2017. La plataforma de videos YouTube dio a conocer las nuevas características de su aplicación móvil, tal como el nuevo diseño, velocidades en reproducción, visualización automática y opciones con pantalla completa. En su blog oficial, la plataforma destacó que está en evolución, por lo que han comenzado una serie de actualizaciones durante lo que resta del año, con un nuevo nivel de funcionalidad y una mirada constante a través de las experiencias móviles y de escritorio. Apuntó que el nuevo diseño consiste en un encabezado en blanco, para que el contenido resalte, y se movimiento de las pestañas de navegación hasta la parte inferior de la aplicación, para que estén más cerca de los pulgares. También, expuso que se agregaron nuevas pestañas en la biblioteca y en la cuenta que le dan acceso fácil a lo que está buscando. Asimismo, explicó que, a principios de este año, se introdujo un gestor que permite doblar el toque en el lado izquierdo o derecho de un video para avanzar o retroceder rápidamente 10 segundos. La empresa con sede en San Bruno, California, comentó que en los próximos meses «experimentaremos una función que permite saltar entre videos con un movimiento: simplemente desliza hacia la izquierda para ver un video anterior o desliza el dedo hacia la derecha para ver el siguiente». En el caso de la velocidad, manifestó que a los usuarios les encanta acelerar y ralentizar la reproducción de un video en el escritorio, por lo que dicha función se trasladó a la aplicación móvil, para que los usuarios le den la velocidad que deseen. También añadirá una función que permita ver filas de videos sugeridos mientras se observa un video con pantalla completa, en tanto que en poco se cambiará la forma en que se ven los videos en vertical, cuadro u horizontal, sin barras negras en los lados.[38][39] YouTube cambió de logotipo por primera vez en su historia, dado a conocer el 29 de agosto de 2017. Ahora, el logo tiene la palabra YouTube con todas sus letras negras, mientras que el símbolo de «play» de color rojo aparece al costado izquierdo.[40] En septiembre de 2020, para competir con TikTok, YouTube lanzó YouTube Shorts, una plataforma de videos de formato corto.[41] Durante este período, YouTube entró en disputas con otras empresas tecnológicas. Por más de un año, en 2018 y 2019, no hubo ninguna aplicación de YouTube disponible para los productos Amazon Fire.[42] En 2020, Roku eliminó la aplicación YouTube TV de su tienda en linea después de que las dos compañías no pudieron llegar a un acuerdo.[43] En 2022, YouTube reaiizó un experimento en el que la empresa mostraría a los usuarios que veían videos más largos en televisores una larga cadena de anuncios cortos que no se podían omitir, con la intención de consolidar todos los anuncios al principio de un video. Tras la indignación pública por la cantidad sin precedentes de anuncios que no se podían omitir, YouTube «finalizó» el experimento el 19 de septiembre de ese año.[44] En octubre, YouTube anunció que implementaría nombres de usuario personalizables además de los nombres de los canales, que también se convertirían en el URL de los canales.[45] El 16 de febrero de 2023, Susan Wojcicki anunció que dejaría su puesto de directora ejecutiva que tenía desde 2014 y que Neal Mohan sería su sucesor. Wojcicki asumió un papel de asesora para Google y la empresa matriz Alphabet.[46] Wojcicki murió un año y medio después, el 9 de agosto de 2024.[47] A fines de octubre de 2023, YouTube comenzó a tomar medidas duras contra el uso de bloqueadores de anuncios en la plataforma. Los usuarios que usan bloqueadores de anuncios pueden recibir una advertencia emergente que dice «El reproductor de video se bloqueará después de 3 videos», así como se les muestra un mensaje que les solicita que permitan los anuncios o los invita a suscribirse al plan de suscripción sin anuncios de YouTube Premium. YouTube afirma que el uso de bloqueadores de anuncios viola sus condiciones de servicio.[48][49] En ese mismo año obtuvo ingresos por US$31 500 000 000[50] En abril de 2024, YouTube anunció que «reforzaría sus medidas sobre las aplicaciones de terceros que violen las Condiciones de Servicio de YouTube, específicamente las apps que bloquean anuncios».[51] En diciembre de 2024, YouTube introdujo nuevas directrices que prohíben los vídeos con títulos clickbait para mejorar la calidad del contenido y combatir la desinformación. La plataforma busca penalizar a los creadores que utilicen títulos engañosos o sensacionalistas, con posibles medidas que incluyen la eliminación del vídeo o la suspensión del canal.[52] Según YouTube, esta directriz se implementará gradualmente, primero en India, y después se expandirá a más países en los próximos meses.[53] El 14 de febrero de 2025, YouTube celebró su vigésimo aniversario desde su fundación.[54] El 30 de julio de 2025, en el contexto de la implementación de la Ley de Seguridad en Línea de 2023 en el Reino Unido, Google anunció que comenzaría a aplicar políticas de «verificación de edad» a usuarios seleccionados en Estados Unidos a modo de prueba. Se utilizará aprendizaje automático para determinar la edad del usuario (independientemente de la información de la cuenta que indique dicha edad) y restringir el acceso a cierto contenido y funciones en todas las propiedades de Google, incluido YouTube (en particular, se desactivará la publicidad personalizada y se activarán ciertos límites de bienestar digital), si se asume que es menor de 18 años. En YouTube, esto se basará en factores como el historial de búsquedas y vídeos, y la antigüedad de la cuenta. El usuario deberá verificar su edad mediante un pago, un documento de identidad escaneado o una selfi para acceder a todas las funciones si se detecta que es menor de edad.[55][56] El 9 de abril de 2025, YouTube expresó su apoyo a la Ley NO FAKES de 2025, presentada por el senador Chris Coons (D-DE) y la senadora Marsha Blackburn (R-TN), y anunció una expansión de su programa piloto diseñado para identificar contenido generado por IA.[57] El 23 de septiembre de 2025, la empresa matriz de YouTube, Alphabet, reveló que reincorporaría a los creadores que fueron suspendidos por difundir información errónea sobre el COVID-19 y las elecciones presidenciales estadounidenses de 2020.[58] En el contexto de la suspensión de Jimmy Kimmel y los debates sobre la libertad de expresión en Estados Unidos, el vicepresidente JD Vance defendió la suspensión de Kimmel y, en su lugar, citó una carta enviada por el asesor legal de Alphabet, Daniel F. Donovan, al presidente del Comité Judicial de la Cámara de Representantes de los EE. UU., Jim Jordan, afirmando que la administración Biden presionó a YouTube para que eliminara «contenido generado por el usuario no violatorio» que contenía información errónea sobre la pandemia de COVID-19 y las elecciones de 2020, y anunció que restablecería a los creadores de contenido previamente prohibidos debido al contenido citado;[59][60] sin embargo, tales afirmaciones no se han probado formalmente, y la Corte Suprema de Estados Unidos desestimó en 2024 el caso Murthy v. Missouri, basado en la Primera Enmienda (que alegaba que la administración Biden había presionado a las empresas de redes sociales para que censuraran las opiniones conservadoras, las críticas al gobierno y la desinformación sobre la COVID-19), al dictaminar por 6 votos a 3 que ni los fiscales generales de Missouri y Luisiana ni los demás demandados tenían legitimidad para presentar el caso. La decisión de Alphabet de reincorporar a los creadores de YouTube que participaron en la desinformación fue criticada por priorizar la «libertad de expresión» sobre los «hechos».[61] Nombre [editar]YouTube literalmente se traduce al español como «tú televisión». You «tú, vos, usted» representa que el contenido es generado por el usuario y no por el sitio en sí, de ahí su eslogan «difunde tú mismo». «Tube» (que tiene muchos significados) «televisión» es un guiño hacia un término original antiguo para televisión y los primeros monitores que eran comunes para cuando la empresa estaba empezando. En Estados Unidos, tubo es sinónimo de televisión, y hace referencia a los tubos de rayos catódicos, además las cámaras de video tenían un Tubo como componente para emitir imágenes. Los anuncios de televisores promocionaban la última tecnología detrás de sus «tubos de imágenes en color» y dieron popularidad al término en los años 70 y 80, pero desde entonces ha estado en declive. La palabra «televisión» contiene el prefijo griego «tele», que significa «a distancia». En tal sentido, las transmisiones en un principio no se podían grabar, por lo que toda la programación iba en vivo. Sólo a partir de la utilización de las Valvulas ternomicas, se logró retransmitir el mismo programa pero con horarios diferentes. Características y críticas [editar]Sobre la búsqueda de videos [editar]YouTube mantiene una logística que permite localizar cualquier video por medio de las etiquetas de metadato, títulos y descripciones que los usuarios asignan a sus videos, pero cuyo uso está restringido únicamente a los videos alojados en YouTube. Sin embargo, a raíz de la compra de YouTube por parte de Google LLC, Google Video empezó a agregar a sus búsquedas los contenidos de YouTube. En junio de 2007 se dio un importante paso hacia la internacionalización del sitio, al traducir su interfaz a diversos idiomas, entre ellos el español. Reproductor [editar]El diseño del reproductor es minimalista y ligero, basado en un color predeterminado: el gris claro, debido a que la empresa busca la comodidad en lo que respecta al tipo de banda de Internet. El primer reproductor de YouTube tenía un diseño curveado, simple, con las opciones resaltando como botones. A mediados de 2007, el segundo cambió a uno más limpio y moderno, con una estructura más recta y con las opciones separadas por espacios compartidos. Se agregó opciones como agregar anotaciones, pausar haciendo clic sobre la pantalla del reproductor, banners publicitarios similares a los que aparecen en la televisión, subtítulos originales y traducidos. A veces, se incluyen spots cortos antes del video. En 21 de enero de 2010 en las opciones del reproductor se agrega un menú desplegable para seleccionar la calidad de video que se quiere visualizar y dos nuevos iconos para cambiar el tamaño del reproductor y para visualizar el video a pantalla completa, respectivamente. Cuando hay subtítulos, aparece un icono que permite mostrarlos. Últimamente, también YouTube ha agregado la capacidad de ver algunos videos en 3D y resoluciones hasta Ultra alta definición. Por otro lado, existe la posibilidad de ver subtítulos, que están en formato SubViewer (*.SUB) y SubRip (*.SRT).[62] Cada video cuenta con su propio contador de visitas que permite dar a conocer la popularidad del mismo abiertamente. En 2012 el código de YouTube fue reprogramado para diferenciar dos tipos de material según la cantidad de sus visitas. Los videos cuyo contador no llega a las trescientas visitas son considerados «inocuos». Por otro lado, aquellos que hayan sido visitados más de trescientas veces pasan a ser verificados manualmente para garantizar le legitimidad de la cifra de visitas. Debido a esto, el contador se congela y, momentáneamente, no refleja en tiempo real el número de personas que ya vio el video. Una vez que pasó por la verificación, el contador se actualiza y se suman las visitas que habían quedado en espera. Sin embargo, un error en la programación del código determinó que la cifra sea de trescientos uno, y no trescientos, lo que produjo diferentes reacciones por parte de los usuarios ante la aparente arbitrariedad del número. A raíz de esto, el fenómeno fue conocido como el misterio de las 301 visitas.[63] La Calidad de video [editar]En Google Video y otros sitios de videos hay quejas acerca de la calidad, siendo que los videos se pixelan (aparecen cuadros de color uniforme de mayor tamaño, en forma de mosaico), en gran medida debido al equilibrio entre calidad de imagen y velocidad de transmisión de datos en la red. Otro problema es que en bastantes clips, el audio y el video no están sincronizados; aunque esto depende del formato del archivo original. En general, todos los videos deben ocupar un espacio en disco no mayor a 2 GB y deben tener una duración menor o igual a 15 minutos, con una tolerancia extra de 59 segundos de grabación, es decir, una duración total de 15:59 segundos. La totalidad de los videos son convertidos a resoluciones de 320×240 y 480×360 píxeles, y a 30 fotogramas por segundo, aunque los videos alojados antes de marzo de 2008 solo están disponibles en la resolución más baja. A pesar de que todos los videos se muestran predeterminadamente en la resolución menor, los usuarios pueden reproducirlos en alta calidad ajustando sus preferencias. No todos los videos de YouTube han sido optimizados o convertidos a un formato de alta resolución; sin embargo, hay un pequeño porcentaje que sí lo está, y para visualizarlos se debe agregar el parámetro «&fmt=6» (sin comillas) al final de la dirección URL[cita requerida]. El vídeo seguiría siendo un video en formato FLV pero con calidad superior, siempre y cuando exista dicha versión; de lo contrario, solamente se visualizará la versión normal. Como método alternativo, puede agregarse «&fmt=18», parámetro que está disponible para casi todos los videos (en formato MP4).[cita requerida] Desde finales de 2008 se pueden ver videos HD con calidad 720p y desde 2009 con calidad 1080p, a las cuales se puede acceder eligiendo la calidad deseada en uno de los botones que aparece en la esquina derecha inferior del video. Al igual que el formato de HQ (alta calidad), el formato HD (alta definición) solamente se visualizará si existe la versión. El 25 de noviembre de 2008, YouTube cambió la relación de aspecto de su reproductor de video, de 4:3 a 16:9, siguiendo el estándar de los televisores LCD y de plasma, y también en concordancia con las intenciones de la empresa de transmitir películas completas en el futuro.[64] Este cambio de aspecto es para todos los videos, por lo que los que están en formato 4:3 se ven con franjas negras a los lados. Posteriormente se añadieron las resoluciones QHD (1440p) y 4K o Ultra alta definición. En julio de 2015 se añadió la resolución 8K (hasta 7.680 × 4.320 píxeles) la cual es 16 veces superior a la alta definición y 75 veces superior al sistema PAL. En noviembre de 2016 se añadió soporte para subir y reproducir videos en HDR.[66] En junio de 2014, YouTube introdujo videos que se reproducen a 60 fotogramas por segundo, con el fin de reproducir videojuegos con una velocidad de fotogramas comparable a las tarjetas gráficas de gama alta.[67][68] Los videos se reproducen con una resolución de 720p o superior.[69] Los videos de YouTube están disponibles en una variedad de niveles de calidad. Los antiguos nombres de calidad estándar (SQ), alta calidad (HQ) y alta definición (HD) han sido reemplazados por valores numéricos que representan la resolución vertical del video. La secuencia de video predeterminada se codifica en el formato VP9 con audio Opus estéreo; Si no se admite VP9 / WebM en el navegador/dispositivo o si se está usando Windows XP, entonces se utilizará vídeo H.264/MPEG-4 AVC con audio AAC estéreo.[70] En enero de 2015, Google anunció que YouTube permitirá la subida de videos en 360°. Desde el 13 de marzo de 2015, los videos en 360° se pueden ver en Google Cardboard, una plataforma de realidad virtual. YouTube 360° también se puede ver desde todas las demás plataformas de realidad virtual.[71] Actualizaciones [editar]A lo largo de su historia, YouTube ha publicado actualizaciones a varias de sus funciones con el objetivo de ofrecer una mejor experiencia a sus usuarios. Las últimas se impusieron en enero de 2010, introduciendo variadas opciones adicionales, aunque lo más notable fue su cambio de diseño: la opción impuesta más significativa fue el compartimiento de vídeos mediante nuevas redes sociales que antes no existían, como Tuenti, Vkontakte, Tumblr u otros servicios, como Blogger. También, la bandeja de entrada ahora permite ver todos los mensajes en una vista, y la carga de estos es mucho más rápida que antaño. Así, ahora se pueden ver los comentarios a los vídeos, las respuestas a los mensajes privados y las invitaciones en una misma página. También se pueden enviar mensajes a numerosos destinatarios. La gestión de video ha recibido una importante mejora y entre los cambios más notables salta a simple vista una interfaz más ligera, con menús expandibles, información más concisa y más opciones de edición en pantalla. El manejo de contactos y suscripciones también ha sido actualizado, y ahora se pueden organizar de manera más sencilla y rápida. Se pueden, por ejemplo, visualizar los datos de más de un contacto con solo marcarlos, o aplicarles etiquetas y organizarlos en grupos, todo de manera muy sencilla. La descarga de canciones no solo se podrán hacer a partir de iTunes, sino también de distintos servicios impuestos por el propio autor del video. Esta opción es una mejora, ya que estaba disponible desde 2008. En septiembre de 2011 se eliminó la restricción de límite de video a 15 minutos,[72] aunque solo para algunas cuentas.[73] Esta característica se pierde automáticamente si el usuario infringe en las políticas a la comunidad y/o haya hecho violaciones de derechos de autor y/o haya tenido reclamaciones de ID de contenido. Formatos de archivo admitidos [editar]YouTube admite los formatos de video .MOV, .MPEG4, .MP4, .AVI, .WMV, .MPEGPS, .FLV, .3GPP y .WebM.[74] Restricción de copias [editar]Para evitar copias de los archivos de video, en un principio estos fueron distribuidos en formato flash (FLV), propiedad de la empresa Adobe Flash, que impide a los usuarios hacer copias digitales fácilmente. Aun así, diversos programadores han elaborado herramientas que permiten, sin permiso de YouTube, la descarga de los videos alojados en el sitio. Hoy en día existe una infinidad de aplicaciones para acceder a la descarga de los videos de YouTube; además, ya existe una herramienta para bajar videos en alta definición. El navegador Google Chrome ha aplicado una restricción por la cual las extensiones de la Chrome Web Store para bajar videos, no permiten hacerlo con los de YouTube.[75] Derechos de autor [editar]YouTube ha cambiado profundamente la definición de derechos de autor en videos, ya que antes de 2005 solo se aplicaban a música compartida por P2P. Gran parte de los videos que los usuarios publican en YouTube tienen música o imágenes con derechos de autor, pero la compañía solo los retira si es requerido por el propietario de los derechos de autor. Al retirarse los videos la cuenta del usuario que los publicó es suspendida después de recibir, cuando menos, tres advertencias. Adicionalmente, las productoras de música pueden solicitar la anulación de las pistas de audio de los videos que incluyen bandas sonoras o música que no fue licenciada para su inclusión, quedando totalmente sin sonido.[76] En 2017, las penalidades son las siguientes: - En caso de que una transmisión en vivo actual o archivada se quite por incumplir los derechos de autor, se restringirá el acceso a la función para transmitir en vivo por noventa días. - En caso de que el usuario reciba tres advertencias por incumplimiento, se rescindirá la cuenta, se quitarán todos los videos que de la misma, y no podrá crear cuentas nuevas. Las advertencias por incumplimiento se hacen cuando el propietario de los derechos de autor envía una solicitud legal completa y válida.[77] Disputa con Viacom International. [editar]Uno de los casos más conocidos ocurrió en febrero de 2007 ante la exigencia por parte de Viacom, casa matriz de la cadena MTV, y los canales infantiles Nickelodeon, Nick Jr., Nick Jr. 2 y Noggin, de retirar de su sitio más de 100 000 videos, al no poder llegar a un acuerdo económico con la compañía para que los usuarios pudieran utilizar el contenido de Viacom.[78] La disputa entre las dos compañías se agravó el 13 de marzo, cuando Viacom anunció públicamente que había demandado a YouTube y a su propietaria Google Inc. por presunta violación de los derechos de autor por un monto que supera los 1000 millones de dólares en daños.[79] Como respuesta, algunos usuarios de YouTube subieron vídeos al sitio exhortando a otros usuarios a boicotear a Viacom.[80] Google respondió argumentando que sí respetan los derechos de autor y que no permitirá que la demanda legal se transforme en una distracción del continuo y sólido crecimiento de YouTube.[81] YouTube como plataforma publicitaria [editar]Desde mayo de 2007, en YouTube empezaron a aparecer vídeos publicitarios de 15 a 30 segundos y otro en estilo pop-up para toda empresa que lo solicite. El tipo de anuncio mostrado al usuario es completamente aleatorio y sin relación con el contenido del que video que buscaba ver o las palabras clave usadas en la búsqueda. Para el uploader estándar de YouTube, puede desactivar que sus propios vídeos tengan anuncios de terceros, de cualquier forma ningún uploader de YouTube recibe remuneración por mantener anuncios en sus vídeos.[82] Sin embargo, en los últimos años (2010-actualidad), quien pública el video puede elegir si quiere insertar anuncios o no, y de que tipo (en varias partes del video, uno solo al iniciar la reproducción, un banner), y en función de factores como el número de vistas, tipo de contenido, etc. Reciben cierta remuneración por parte de Google.[83] Como complemento de la televisión [editar]Algunos canales estadounidenses han creado webisodes, breves capítulos de cinco minutos de duración cuya trama está relacionada con la serie original de la cual se derivan, que son distribuidos exclusivamente en Internet. Estos episodios surgieron como un método alternativo, tras la huelga de guionistas en Hollywood de 2007-2008, para llegar a una audiencia verdaderamente global. Un ejemplo de estos cortos es Qué vida más triste, que fue transmitido después por el canal de España La Sexta.[84] Además, se ha comprobado que YouTube no roba audiencia a la televisión, de hecho la estimula,[cita requerida] ya que, aunque un programa no tenga éxito en su país de origen, es posible que en YouTube sí lo tenga, al atraer más público del esperado. Esto ha sucedido con el programa español Muchachada Nui, que ya es ampliamente conocido en Latinoamérica.[85] YouTube Premium [editar]YouTube Premium es el servicio de suscripción prémium de YouTube. Ofrece streaming sin publicidad, acceso a contenidos exclusivos, reproducción de vídeo en segundo plano y acceso fuera de línea en dispositivos móviles.[86] YouTube Premium se anunció originalmente el 12 de noviembre de 2014 como «Music Key», un servicio de streaming de música por suscripción, y tenía la intención de integrarse y reemplazar el servicio «All Access» existente de Google Play Music (actualmente YouTube Music).[87][88] El 28 de octubre de 2015, el servicio se volvió a lanzar como YouTube Premium, ofreciendo streaming sin publicidad en todos los videos, así como acceso a series gratuitas de YouTube Originals.[89] Pagos por derechos de autor [editar]Google (dueño de YouTube) recibió demandas por derechos de autor y violaciones a la ley por propiedad intelectual en los vídeos que se subían a la plataforma, razón por la que se vio obligado a crear contratos con emisoras y productoras, a esto se agregó la creación de cuentas para canales de televisión para agregar contenido adicional.[90] Según la página de estadísticas de YouTube en el mes de julio de 2016 la empresa había pagado la suma de 2000 millones de dólares a los titulares de los derechos de autor que habían decidido monetizar reclamos desde que fue lanzado Content ID en el año 2007. Impacto en la cultura popular y sociedad [editar]YouTube ha tenido un gran impacto en la cultura popular; prueba de ello es haber obtenido el premio al «Invento del año», otorgado por la revista Time en noviembre de 2006.[91] El sitio se convirtió en un medio de difusión tan popular para la difusión de fenómenos de Internet de todo tipo que incluso ha sido utilizado por importantes personalidades como Tony Blair, quien publicó allí su mensaje de felicitación al presidente de Francia, Nicolas Sarkozy, cuando este resultó elegido.[92] El sitio es también un medio de promoción para artistas y políticos en campaña electoral que cuentan con un espacio o canal (channel) propio; tal es el caso de Citizen Tube, un espacio donde los políticos en campaña para las elecciones de Estados Unidos exponen en blogs de vídeo sus propuestas y comentarios. De igual manera, la Comisión Europea puso en marcha un espacio dentro de YouTube para comunicarse con los ciudadanos.[93] Si bien las temáticas son muy variadas y diversas, varias tendencias positivas se han mostrado en los videos y listas de comentarios donde los usuarios vierten las impresiones del video visto. Por ejemplo, se encuentran los vídeos con imágenes de ciudades y provincias, que en su mayor parte muestran fraternidad entre personas y pueblos; cursos diversos con fines educativos, técnicos y científicos, como la muestra de videos médicos de operaciones y autopsias, muestras gastronómicas, archivos históricos, comedia o entretenimiento en general. Por tanto, YouTube es una plataforma que concentra un gran repertorio de prácticas que promueven el aprendizaje informal.[94] Sin embargo, la pornografía no es tolerada, aunque a raíz de esta prohibición un grupo de personas ajenas a YouTube creó YouPorn. El sitio ha sido criticado por haber alojado videos sobre peleas entre miembros de distintas razas en Estados Unidos[cita requerida] o entre escolares, donde incluso aparecen niñas golpeándose.[95] Algunos de estos videos han sido realizados exclusivamente para su difusión por YouTube.[cita requerida] Además, han aparecido videos relacionados con el terrorismo y videos de webcam donde se exponen poses eróticas sin llegar a la desnudez. Algunas de estas últimas imágenes han sido expuestas sin la autorización de las personas filmadas. Dentro de esta categoría se encuentran los videos voyeur, usualmente captados por teléfonos celulares con video integrado, que muestran imágenes de grabaciones de partes íntimas de mujeres u hombres en el transporte público o en la vía pública. Estos videos son filmados sin autorización de las personas filmadas.[cita requerida] Controversias [editar]Videos virales [editar]Otra característica del portal es que se ha ostentado como plataforma principal para la difusión de videos virales. Estos se refieren a un sinfín de videos, ya sean extraídos de diversos medios como la TV, vídeos de promoción musical o videoaficionados, a los cuales particularmente el público expectante encuentra alguna característica generalmente cómica, por lo cual comienzan a difundirlos a través de blogs u otras redes sociales para que sean vistos por más gente. Muchos de estos videos son totalmente espontáneos y no fueron hechos con el objetivo original de ser vídeos virales, ni tampoco para fines de lucro posterior,[96] los propios espectadores son los que hacen que estos tengan ese comportamiento de difusión en la Red. Un ejemplo es la fama obtenida por una maquillista de la televisión peruana llamada Judith Bustos, conocida como La Tigresa del Oriente, quien con la exposición de un videoclip Nuevo amanecer fue un vídeo viral que respondió a un sinfín de reacciones diversas, entre ellas considerar su presentación como un camp o también un kitsch,[97] esto se debe a que la pequeña empresa que lo produjo, Éxitos del mundo, que surgió de la bancarrota de toda la industria fonográfica del Perú a mediados de los años 1990,[98] contaba con recursos limitados para su producción, no utilizando los que generalmente tiene una compañía de televisión. Un ejemplo similar y que generalmente caracteriza a un vídeo viral es el que representa al actor indio Chiranjeevi, que durante 1985 filma una escena en que utiliza element"
}