{
  "url": "https://flcl.fandom.com/wiki/Canti",
  "title": "Canti | FLCL Wiki | Fandom",
  "text": "Canti (カンチ?, Kanchi) is the first robot to emerge from Naota Nandaba's head in FLCL. It was manufactured by Medical Mechanica, and had been used by them to capture Atomsk. It is later revealed that Atomsk can manifest through Canti, with Naota serving as the catalyst. As of Our Running, he currently resides with Hidomi Hibajiri and Hinae Hibajiri, aiding them in their café as a maid. Profile[] Canti is a robot whose head resembles a Sony 8-301W portable transistor television set. As such, he is referred to as \"TV-boy\" by Naota's father. Canti can take x-ray photographs, possibly because he was manufactured by Medical Mechanica. Atomsk channels his power through Canti several times and is used as a method of escaping Medical Mechanica by Atomsk. When he first emerged from Naota’s head, Canti appeared red in color. After he is struck in the head by Haruko, he turns blue. Canti later appears in FLCL Progressive, where he was somehow damaged and in the possession of Masurao and Eye Patch. Personality[] The emotions of Canti are very human-like, despite his looks. He is embarrassed about his broken head (where Haruko hit him) and is looking for the pieces to glue back together in episode 2. He wears a box on the back of his head in episode 3 for the same reason. Canti seems to like porn, as he was reading it in a store in the anime, and it is stated in the novel that he spends 3 hours at a time looking through \"perverted magazines.\" He is also extremely polite, extending a helping hand to Lieutenant Kitsurubami even after she attempted to destroy him. Appearance[] In the anime, Canti is often seen wearing an overcoat or jacket. The jacket he is usually seen in (specifically, a Type MA-1 Flight Jacket) covers relatively little of him, only his upper arm and torso, leaving his legs and head exposed. In FLCLimax, Canti is also seen dressing as and working as a crossing guard. It is unknown for how long he worked this job, but while on the job, he wears a long, light blue trench coat or raincoat. Canti also dons a halo and fake wings for a brief period, which Haruko puts on him earlier in the episode. When Canti fuses with Naota, he can transform into a cannon. The cannon has only one piece of ammo: Naota. When Naota has reached a certain point, he returns to the mouthpiece of the cannon to be re-fired if needed. Canti can also transform into the cannon while flying. At the Bureau of Interstellar Immigration's base in outer space, Canti briefly takes on the form of a small, dog-like creature, before eating Ide's rubber \"corpse\" and eventually returning back to his original form. He later returns Ide in his human form as well, partially due to Atomsk's control. In FLCL Alternative, older Canti models protect the Medical Mechanica facility in Kana's town. They are navy blue with neon green details and a slightly sleeker build, as well as not having their screens on, but are roughly the same otherwise. Powers[] Canti can take x-rays, fly and has a greater physical prowess than humans. He has shown himself capable with guns in episode 5 of FLCL. As stated above, when synced with Naota, Canti transforms into a cannon and fires Naota like a bullet. When using Atomsk's power, he turns red and his abilities are heightened, making him faster and stronger. In episode 6 of Progressive, Canti helped Hidomi to overcome her inhibitor by letting her speak with her mother. He was used as a communication device along with Aiko, her potted plant serving as a transmission catalyst. His screen could receive both visuals and sound from her despite being a great distance away. He was also taunting Hidomi with glasses symbolizing Ide later on, suggesting he can store humans other than Naota, though that may have been Atomsk using his body. The newer models seen in Alternative use metal weapons such as flails, pipes and spiky bats in combat. They strategize differently, depending on the threat level, with only one unarmed robot attacking Haruko while she was unsuccessfully drilling on the iron's surface, whereas many armed robots attacked when Haruko was helping Kana activate her N.O. to teleport the iron. They are also durable enough to break Haruko's guitar over time. Trivia[] - Canti is quite different in the manga and anime. When first synchronized with Naota, the mouth is less monstrous in the manga, and Naota fully connects with Canti through a plug that goes in his eye instead of a screw-in light bulb in the back of his head. - Considering the overall shape of Canti's form as an antitank gun, as well as the projectile's spherical shape, it is possible that it isn't actually meant to look like an antitank gun at all. Instead, when seen in full, while it does resemble a mounted gun, it also resembles a baseball pitching machine. - Apparently, he can eat curry with his \"mouth,\" which is just a grille, but it is never explained how. - As stated by Kazuya Tsurumaki, Canti was placed in the show for the sake of having a robot in it. - Canti can be summoned in the first installment of the flash game series Epic Battle Fantasy."
}