{
  "url": "https://informatecdigital.com/pt/Como-configurar-uma-VPN-no-Windows-passo-a-passo/",
  "title": "Como configurar uma VPN no Windows: um guia completo",
  "text": "- As VPNs criam um túnel criptografado que protege seus dados e pode ser usado tanto para acesso remoto quanto para melhorar sua privacidade online. - O Windows 10 e o 11 permitem configurar perfis VPN integrados e configurar seu próprio servidor VPN sem programas de terceiros. - Para que uma VPN doméstica funcione corretamente, você precisa abrir a porta 1723 no roteador e permitir o roteamento e o acesso remoto no firewall. - Um serviço VPN comercial simplifica a configuração, oferece servidores em diversos países e adiciona recursos extras de segurança e conveniência. Configurar uma VPN no Windows pode parecer complicado à primeira vista, mas com um bom guia, torna-se bastante simples. Seja qual for o seu objetivo — Proteja sua privacidade em redes públicas Por exemplo, se você precisar se conectar à rede da sua empresa a partir de casa, o Windows inclui ferramentas integradas para criar e usar conexões VPN sem depender sempre de programas externos. Ao longo deste artigo você verá, passo a passo, Como configurar uma VPN no Windows 10 e no Windows 11Como configurar seu próprio servidor VPN em casa, quais configurações ajustar no roteador e no firewall, e também como usar serviços VPN comerciais quando você deseja mudar virtualmente de país ou adicionar camadas extras de segurança e conveniência. O que é uma VPN e quais tipos podem ser usados no Windows? Uma VPN (Rede Virtual Privada) é, resumidamente, um túnel criptografado dentro da Internet Isso conecta seu dispositivo a outro computador ou rede como se você estivesse fisicamente presente. Esse túnel protege seus dados de olhares indiscretos, redes Wi-Fi não seguras e certos tipos de rastreamento. Quando você se conecta a uma VPN, Seu tráfego passa primeiro pelo servidor VPN.Os dados são criptografados e trafegam por esse túnel seguro. O servidor VPN se comunica com os sites e serviços que você visita, portanto, eles veem apenas o endereço IP do servidor, e não o do seu roteador doméstico ou da rede pública que você está usando. No ambiente Windows, é importante distinguir entre duas abordagens: Use uma VPN integrada ou corporativa. (por exemplo, para acessar a rede da sua empresa ou a sua rede doméstica) e usar um serviço VPN comercial (NordVPN, ExpressVPN, AVG Secure VPN, etc.), projetados para navegar anonimamente, contornar restrições geográficas e aumentar sua privacidade. Com a VPN integrada do Windows, você pode Conecte-se a uma rede específica que você já conhece.como o da sua empresa ou o da sua casa, mas seu endereço IP público ainda será aquele fornecido pelo seu provedor de internet. Com um serviço VPN pago, no entanto, Você usa endereços IP de servidor distribuídos pelo mundo todo.Isso permite simular estar em outro país e aproveitar os endereços IP compartilhados com outros usuários. Uma rede VPN doméstica ou empresarial geralmente se concentra mais em... acesso remoto a recursos internos (pastas, servidores, impressoras ou PCs) e na criptografia do tráfego entre seu dispositivo e essa rede específica. Um serviço VPN comercial é mais voltado para a Privacidade geral na Internet, contornando bloqueios e ocultando seu endereço IP real de sites, anunciantes e potenciais atacantes em redes abertas. Qual a finalidade de uma VPN doméstica no Windows? Quando as pessoas falam sobre VPNs, muitas pensam apenas em \"fazer parecer que estou em outro país para assistir a determinado conteúdo\", mas configurar sua própria VPN no Windows tem outros usos diferentes. Uma VPN doméstica por si só não fará parecer que você está navegando de outro país. Se o seu servidor estiver na Espanha, os sites ainda verão que você está acessando de lá, mesmo que não vejam o seu endereço IP residencial real. A grande vantagem de configurar seu próprio servidor VPN é que Todo o seu tráfego é criptografado desde o seu dispositivo até esse servidor.Isso significa que, em um café, hotel ou aeroporto, qualquer pessoa que tentar espionar a rede verá dados ilegíveis, pois sua conexão está encapsulada dentro do túnel VPN. Além disso, ao usar seu servidor VPN como intermediário, Os sites já não armazenam o endereço IP do seu roteador nem o endereço IP da rede pública.mas sim o endereço IP do servidor VPN ao qual você se conecta. Isso dificulta que aplicativos, anunciantes ou terceiros rastreiem seus movimentos entre diferentes serviços e correlacionem exatamente quais sites você visitou. Sempre que você abre uma página da web, o que realmente acontece é que seu navegador envia uma solicitação ao servidor que hospeda esse site. Esse servidor responde usando seu endereço IP como seu \"endereço postal digital\". Sem uma VPN, Todos os sites armazenam seu endereço IP em seus registros.que eles podem então compartilhar ou vender para anunciantes para traçar o perfil da sua atividade online. Ao inserir uma VPN entre eles, quem de fato se comunica com o servidor web é o servidor VPN, não o seu computador diretamentePortanto, os sites armazenam o endereço IP do servidor VPN, não o seu. Esta é uma maneira simples de reduzir sua pegada online, especialmente se você gerencia o servidor por conta própria ou confia plenamente em quem o gerencia. Outra vantagem interessante de ter seu próprio servidor VPN é que você pode estabelecer uma espécie de rede local estendidaEm outras palavras, seus dispositivos podem se comportar como se estivessem na mesma LAN, mesmo estando fisicamente em locais diferentes, facilitando o compartilhamento de recursos internos, o acesso a um computador doméstico do trabalho ou a redução da necessidade de cabeamento físico, caso tudo esteja na mesma rede lógica. Como criar e configurar um perfil de VPN no Windows 10 e no Windows 11 Antes de se conectar a uma VPN no Windows, você precisa ter um perfil de conexão VPN criadoEste perfil inclui o tipo de VPN, o endereço do servidor, o sistema de autenticação e, se necessário, o nome de usuário e a senha. Se a VPN for para uso profissional, geralmente é a sua empresa. Forneceremos todos os detalhes de conexão. ou até mesmo um aplicativo proprietário. Nesse caso, geralmente é uma boa ideia acessar a intranet da empresa ou falar com o departamento de TI para obter instruções precisas, já que cada empresa tem a sua própria. política de segurança. Se você deseja usar um serviço VPN de terceiros para uso pessoal, você pode Primeiro, procure o aplicativo deles na Microsoft Store ou no site oficial.Eles quase sempre oferecem um cliente para Windows que configura tudo automaticamente. Se você preferir fazer isso manualmente, a página de ajuda geralmente lista os endereços do servidor, os protocolos suportados e outros parâmetros. Depois de obter os detalhes da sua VPN (seja para trabalho, casa ou um provedor terceirizado), é hora de criar o perfil no Windows. No Windows 11, você pode abrir o aplicativo Configurações e acessar... Rede e Internet > VPN > Adicionar VPNNo Windows 10, o caminho é muito semelhante: basta acessar Configurações, depois Rede e Internet e procurar a seção VPN. No formulário “Adicionar uma conexão VPN”, no campo do provedor, você precisará selecionar “Windows (integrado)” Se você for usar a funcionalidade nativa do sistema, insira um nome de conexão que você reconheça facilmente (por exemplo, \"VPN doméstica\" ou \"VPN empresarial\") e anote o servidor ou endereço no campo de servidor ou endereço. Endereço IP ou nome DNS do servidor VPN que você vai usar. Na seção Tipo de VPN, você precisará escolher o protocolo ou método de conexão usado pelo seu servidor ou pelo serviço ao qual você se inscreveu. O Windows oferece suporte a vários tipos, portanto, essa escolha é crucial. Saiba qual tipo de VPN a outra parte suporta.Em caso de dúvida, consulte a documentação da sua empresa ou do seu provedor de VPN. Em “Tipo de informação de login”, você pode selecionar se usará ou não. Nome de usuário e senha, certificado, token de uso único ou cartão inteligente.Para conexões corporativas, certificados ou métodos de autenticação fortes são frequentemente utilizados. Se precisar inserir um nome de usuário e senha, você pode salvá-los diretamente nos campos disponíveis ou deixá-los em branco para que seja solicitado a digitá-los sempre que necessário. Depois de configurar tudo, salve o perfil e, se precisar revisar ou ajustar algo posteriormente, você poderá retornar à seção VPN em Configurações. Selecione a conexão e acesse as Opções Avançadas.A partir daí, você pode alterar as configurações, configurar o proxy ou excluir o perfil, caso não precise mais dele. Após a criação do perfil, conectar-se é muito simples: no canto direito da barra de tarefas, acima do ícone de Rede (Wi-Fi ou Ethernet), você verá o Lista de conexões VPN disponíveisEscolha a opção desejada, clique em Conectar, insira suas credenciais, se solicitado, e se tudo estiver correto, o status mudará para \"Conectado\". Enquanto você estiver conectado a uma VPN reconhecida, geralmente aparece um pequeno escudo azul ou indicador semelhante Nas configurações de rede, na página de configuração da VPN, você verá o texto \"Conectado\" abaixo do nome da conexão. Isso permite verificar rapidamente se o túnel VPN está ativo. Como configurar seu próprio servidor VPN no Windows 10 ou 11 Se você quiser ir um passo além, o Windows permite Configure seu próprio servidor VPN sem instalar software de terceiros.Não é tão prático quanto usar um serviço comercial, mas oferece mais controle sobre quem gerencia seus dados e como sua rede doméstica é acessada. O processo é baseado na antiga ferramenta de conexões de entrada do Painel de Controle. Para começar, acesse... Configurações do Windows, depois Rede e InternetA partir daí, no Windows 10, acesse \"Status\" e clique em \"Alterar opções do adaptador\". No Windows 11, acesse \"Configurações avançadas de rede\" e selecione \"Mais opções do adaptador de rede\". A janela clássica do Painel de Controle será aberta, exibindo seus adaptadores de rede (Ethernet, Wi-Fi etc.). Nessa janela, pressione a tecla Pressione Alt ou F10 para exibir o menu clássico. Se não aparecer, vá em \"Arquivo\" e selecione \"Nova conexão de entrada\". Essa opção permite que você prepare o Windows para aceitar conexões de outros computadores pela internet. Uma tela com as contas de usuário do sistema será exibida. Você pode Marque usuários existentes ou crie um novo. Este é o nome de usuário que será usado ao conectar-se à VPN. Por motivos de segurança, é altamente recomendável criar uma conta de usuário VPN específica com um nome de usuário e senha fortes, que você usará em seus dispositivos. Na próxima tela, o Windows perguntará como esses usuários se conectarão. Certifique-se de deixar a caixa marcada. “Pela Internet”, pois é isso que permite que a conexão VPN seja estabelecida de fora da sua rede local, passando pela Internet até o seu servidor. Uma lista dos protocolos e componentes de rede para a conexão de entrada aparecerá posteriormente. É importante selecionar a opção apropriada aqui. “Protocolo de Internet versão 4 (TCP/IPv4)” e clique em “Propriedades”. Esta janela é usada para definir quais endereços IP serão atribuídos aos clientes VPN assim que estiverem conectados. Por padrão, o Windows pode tentar atribuir IPs automaticamente, mas é melhor instruí-lo a fazer isso. Reserve um intervalo de endereços IP específico para a VPN.Selecione a opção que permite especificar endereços IP e definir um intervalo dentro da sua sub-rede local. Isso parece mais técnico do que realmente é, mas pode ser resolvido sabendo o endereço IP do seu gateway. Para descobrir, abra o aplicativo \"Prompt de Comando\" e execute o comando. ipconfigEntre os dados exibidos, você verá uma linha com \"Gateway Padrão\", que quase sempre será algo como 192.168.0.1 ou 192.168.1.1. Este é o endereço IP do seu roteador. Nas propriedades IPv4 do servidor VPN, o Os três primeiros dígitos numéricos do seu endereço IP atribuído devem corresponder aos do roteador.Por exemplo, se o gateway for 192.168.1.1, você pode reservar um intervalo de 192.168.1.20 a 192.168.1.30 para a VPN. Dessa forma, qualquer cliente que se conectar ao seu servidor VPN receberá um endereço IP dentro desse intervalo. Após definir o intervalo, aceite as alterações e retorne à tela do software de rede. Agora tudo está pronto, basta clicar em “Permitir acesso” Isso permite que o Windows crie a conexão de entrada e ative o servidor VPN. A partir daí, seu computador estará pronto para receber conexões VPN externas, desde que seu roteador e firewall não estejam bloqueando o tráfego. Abra a porta no roteador e configure o firewall do Windows. Para que dispositivos fora de sua casa ou escritório consigam acessar o servidor VPN, você precisa Abra a porta correspondente no seu roteador. e configure o firewall do Windows para permitir esse tráfego. Caso contrário, qualquer tentativa de conexão da internet será bloqueada antes de chegar ao servidor. Na maioria das configurações domésticas, os roteadores usam o endereço IP do gateway que mencionamos anteriormente (algo como 192.168.1.1 ou 192.168.0.1). Se você digitar esse endereço na barra de endereços do seu navegador, poderá... Acesse a interface web do roteador.O nome de usuário e a senha iniciais geralmente são encontrados em um adesivo no próprio dispositivo, embora, por motivos de segurança, seja altamente recomendável alterá-los. Depois de acessar as configurações do roteador, você precisa procurar a seção relacionada a “Redirecionamento de portas”, “Redirecionamento de portas” ou “NAT”A terminologia varia dependendo do fabricante, mas a ideia é sempre a mesma: definir uma regra que abra uma porta externa e a direcione para o endereço IP interno do computador onde o servidor VPN está sendo executado. A porta padrão para esse tipo de conexão no Windows é a 1723Você precisará criar uma nova regra especificando que o tráfego TCP para a porta 1723 deve ser enviado para o endereço IP privado do seu servidor (e não para o do roteador). Se você não souber esse endereço IP, use o comando ipconfig novamente e observe a linha \"Endereço IPv4\" correspondente ao seu adaptador de rede ativo. Em paralelo, você precisa ajustar o firewall do Windows para que ele não bloqueie a funcionalidade de acesso remoto. Vá para o Painel de Controle e, em seguida, para... Sistema e Segurança > Firewall do Windows Defender E, na coluna da esquerda, clique em “Permitir que um aplicativo ou recurso passe pelo Firewall do Windows Defender”. Nessa janela, clique em “Alterar configurações” para modificar a lista. Em seguida, em ordem alfabética, encontre a entrada chamada “Roteamento e acesso remoto” Marque as caixas de seleção de rede privada e rede pública. Ao fazer isso, você estará autorizando o serviço a receber tráfego pelo firewall em ambos os tipos de rede. Salve as alterações clicando em OK. Se desejar mais ferramentas para gerenciar a segurança do firewall, você pode consultar as opções disponíveis. Gerenciar o firewall do Windows. Alguns guias mais avançados também recomendam Analise o perfil de rede usando o PowerShell.Ao executar os comandos como administrador e usar funções como Get-NetConnectionProfile e Set-NetConnectionProfile, você pode garantir que sua rede local seja marcada como \"Privada\", o que reduz conflitos de firewall e evita bloqueios desnecessários. Se você deseja que seu servidor VPN esteja disponível assim que ligar o computador, é uma boa ideia acessar a ferramenta \"Serviços\" do Windows e localizar o serviço. “Roteamento e acesso remoto”Abra as propriedades e defina o tipo de inicialização como \"Automático (inicialização atrasada)\". Isso garantirá que o Windows inicie o serviço VPN de forma confiável sempre que for iniciado. Gerencie IPs dinâmicos e domínios para seu servidor VPN. Há um detalhe prático que muitas vezes é negligenciado: o O endereço IP público do seu roteador geralmente é dinâmico.Em outras palavras, seu operador pode alterá-lo a qualquer momento (reiniciando o roteador, por exemplo), o que tornaria o endereço que você usa para se conectar à sua VPN inválido. Uma maneira simples de resolver isso é usar um serviço de DNS dinâmico, como o Sem IP ou similarEsses serviços permitem que você registre um nome de domínio (por exemplo, “tuvpn.no-ip.org”) que sempre apontará para o endereço IP público atual do seu roteador, mesmo quando ele mudar. O procedimento costuma ser semelhante em todos os casos: primeiro você se cadastra no site, escolhe o nome de domínio desejado e então Você instala um pequeno programa cliente no computador que funciona como um servidor VPN.Este cliente é responsável por notificar o No-IP sempre que o endereço IP público for alterado, para que o domínio seja atualizado automaticamente. No painel de controle da sua conta do serviço de DNS dinâmico, você precisará garantir que O domínio que você criou está marcado e associado. ao cliente instalado no seu computador. A partir daí, mesmo que você reinicie o roteador e seu endereço IP público mude, o cliente atualizará as informações e você sempre poderá se conectar digitando o mesmo nome de domínio nas configurações da VPN. Isso é muito útil porque evita que você precise verificar e compartilhar o novo endereço IP sempre que ele mudar. Na prática, seus dispositivos só precisam saber esse domínio fixo, o nome de usuário e a senha que você definiu para a VPN. Conecte-se à sua VPN a partir do Windows e de outros dispositivos. Depois de o servidor estar em funcionamento, as portas abertas, o firewall configurado e (se desejar) o domínio dinâmico configurado, chega a parte mais gratificante: Conecte-se à sua VPN a partir de outros dispositivos., tanto em sistemas Windows quanto em dispositivos móveis Android ou iOS. Em um PC com Windows 10 ou 11, o processo é muito semelhante ao de qualquer outra VPN. Vá para Configurações e, em seguida, para Rede e Internet > VPN e clique em “Adicionar uma conexão VPN”. Em Provedor, escolha “Windows (integrado)”, dê um nome à conexão e, em “Nome ou endereço do servidor”, insira o endereço IP ou nome de domínio do seu roteador (ou o endereço IP IPv4 do seu servidor, caso esteja na mesma rede local). Nos campos de autenticação, insira o Nome de usuário e senha que você criou especificamente para a conexão de entrada. Na VPN, salve o perfil e selecione a conexão para clicar em \"Conectar\". Se tudo estiver configurado corretamente, em alguns segundos você verá o status mudar para \"Conectado\" e seu computador começará a usar o túnel VPN. É uma boa prática revisar as configurações avançadas da conexão VPN acessando suas propriedades pelo Painel de Controle, na seção \"Central de Rede e Compartilhamento\" e, em seguida, em \"Alterar as configurações do adaptador\". Lá você pode Ajuste a seção de segurança e rede.Desative o IPv6 se não precisar dele, certifique-se de que o IPv4 esteja ativado e, se for o caso, acesse as \"Opções Avançadas\" para decidir se deseja usar o gateway padrão do servidor VPN ou não. Na seção de segurança dessa mesma janela, é recomendável verificar se o Tipo de VPN e métodos de criptografia Essas configurações correspondem ao que você configurou no servidor para evitar erros de autenticação ou protocolo. Depois que tudo estiver correto, basta clicar em \"OK\" e testar a conexão novamente. Em telefones Android e iOS, o processo é semelhante, embora a interface seja diferente. Cada sistema possui sua própria seção \"VPN\" nas configurações de rede, onde você pode criar um novo perfil inserindo o endereço IP. Endereço do servidor, tipo de VPN, nome de usuário e senha.A chave continua a mesma: aponte para o IP ou domínio correto e use as credenciais que você criou no seu computador Windows. Use o serviço VPN do seu provedor em vez de configurar o seu próprio. Se toda essa conversa sobre configurar um servidor, abrir portas e ajustar o firewall parecer muito complicada, você tem outra opção: Utilize uma VPN comercial através de um aplicativo do Windows.Nesse caso, você não é responsável pela manutenção dos servidores, mas sim delega essa tarefa a um provedor especializado. O mercado é altamente competitivo, com inúmeros serviços como NordVPN, CyberGhost, ExpressVPN, AVG Secure VPN e muitos outros. A ideia básica é sempre semelhante: Você se cadastra, instala o aplicativo oficial, faz login e escolhe um servidor no país desejado.O aplicativo é responsável por criar o túnel, gerenciar protocolos, reconexões e opções adicionais, como o kill switch. Ao escolher um fornecedor, é aconselhável focar em três pontos principais: o Política de privacidade e ausência de registro de atividades, o tipo e o nível de criptografia que utilizam (para evitar serviços fracos) e a reputação geral da empresa, incluindo a jurisdição em que opera e as opções de suporte técnico que oferece. Na prática, basta fazer o download do programa no site deles ou na Microsoft Store. Versão do aplicativo específica para WindowsExecute o instalador e siga o assistente. Muitas vezes, eles incluem versões de avaliação gratuitas para que você possa testá-los. acelerarEstabilidade e facilidade de uso antes de pagar por uma assinatura completa. Após instalar o aplicativo, você escolhe um servidor (ou deixa a VPN selecionar automaticamente o mais rápido disponível), ativa a conexão e pronto. A partir desse momento, todo o seu tráfego de internet estará protegido. É encaminhado através de uma VPN comercial.E você pode alterar os países virtuais com apenas alguns cliques, caso precise acessar conteúdo com restrição geográfica. Essas aplicações normalmente integram recursos avançados, como: kill switch (interruptor de internet que corta a conexão se a VPN falhar)Suporte para diversos protocolos (OpenVPN, WireGuard, etc.), conexão automática em redes Wi-Fi abertas e opções adicionais para evitar... Vazamentos de DNS ou IPv6. Tudo isso reduz o risco de vazamento de dados que poderia ocorrer se você configurasse a VPN manualmente e cometesse um erro. Por outro lado, você fica totalmente dependente desse fornecedor: Todo o seu tráfego passa pelos servidores deles.Portanto, você deve escolher uma VPN com boa reputação e políticas claras de não registro de dados. VPNs gratuitas, em particular, costumam ser financiadas pela exploração de dados de uso ou pela inserção de publicidade, então não são a melhor opção se a verdadeira privacidade for sua prioridade. Resumindo, configurar sua própria VPN no Windows ou usar um serviço comercial são dois caminhos diferentes para atingir objetivos semelhantes: ter uma conexão segura e eficiente com a internet. Uma conexão mais segura e criptografada, com maior controle sobre suas informações.A escolha depende de se você prefere controle absoluto e um pouco mais de trabalho técnico, ou conveniência e uma solução pronta para uso em troca de depender de terceiros. Tabela de conteúdos - O que é uma VPN e quais tipos podem ser usados no Windows? - Qual a finalidade de uma VPN doméstica no Windows? - Como criar e configurar um perfil de VPN no Windows 10 e no Windows 11 - Como configurar seu próprio servidor VPN no Windows 10 ou 11 - Abra a porta no roteador e configure o firewall do Windows. - Gerencie IPs dinâmicos e domínios para seu servidor VPN. - Conecte-se à sua VPN a partir do Windows e de outros dispositivos. - Use o serviço VPN do seu provedor em vez de configurar o seu próprio."
}