{
  "url": "https://timeline.carnegiehall.org/genres/boogie-woogie",
  "title": "History of Boogie-Woogie — Timeline of African American Music",
  "text": "Boogie-Woogie Albert Ammons Pictorial Press Ltd/Alamy Stock PhotoKey Attributes of Boogie-Woogie Select to filter timelineThemes - Oral Traditions - Daily Life - Dance - Love/Relationships - Political Issues/Activism - Travel Musical Features - Timbre - Phrasing - Instrumentals - Repetition - Harmony - Slide - Blues Form - Meter - Vocals Instruments - Guitar - Piano “The jook was in full play when we walked in. The piano was throbbing like a stringed drum and the couples slow-dragging about the floor were urging the player on to new lows...”Zora Neale Hurston Boogie-woogie, primarily a piano-based style, is one of the most rhythmically intense forms of blues music. Its evolution began in the late 1800s among pianists in the rough-and-tumble city taverns and rural juke joints, and it spread to the traveling vaudeville shows. It was a feature in the barrelhouses in the logging, sawmill, turpentine, levee, and railroad camps throughout the South. In Texas the piano style was known as “fast western.” The basic boogie-woogie rhythm, an outgrowth of ragtime and rural blues, is said to have been inspired by the rhythmic clacking of steam locomotives throughout the Deep South. Context and History Boogie-woogie musicians traveled the barrelhouse circuit providing entertainment and music for dancing. Many began their professional careers performing on traveling medicine shows, Black vaudeville circuits. In the North, they performed at house parties at which an admission fee was charged and food and drink were sold in order for the tenant to be able to pay the rent. Boogie-Woogie musicians later found regular employment in clubs. The pianist Charles “Cow Cow” Davenport made the earliest recordings that can be described as boogie-woogie during the early 1920s, while the first hit record in the genre was Clarence “Pinetop” Smith’s “Pinetop’s Boogie-Woogie” (1928). Boogie-woogie lost popularity during the Depression Era but came back into style at the end of the 1930s, with pianists such as Albert Ammons and Pete Johnson. It peaked from then into the 1940s when it was adapted by the swing bands (Bennie Moten and Count Basie) as well as rhythm & blues (Louis Jordan and Joe Liggins) and early rock ‘n’ roll artists, such as Little Richard and Jerry Lee Lewis. Later in the 20th century, New Orleans “piano professors” such as “Professor Longhair” (Roy Byrd), Allen Toussaint and “Dr. John” (Mac Rebennak) also performed it in a recognizable style that came to be called “New Orleans Piano,” incorporating Caribbean rhythms, what “Jelly Roll” Morton called “the Latin tinge” as can be heard in the left-hand (bass) rhythm of “Tipitina.” Musical Features/Performance Style Boogie-Woogie is characterized by a repetitive eight-beat-to-the-bar “walking” piano bass line (eighth notes in 4/4 time) in which the left hand emphasizes each note of the chord. The right hand is on top and improvises a syncopated melody in counter rhythm. The combination creates a continuous drive. “The Fives,” a tune published as sheet music in 1922, contains all the modern boogie-woogie left-hand combinations. Albert Ammons and Meade “Lux” Lewis said that many pianists in the 1920s played it just before leaving to take a break. Lyrics “Pine Top’s Boogie Woogie” by Clarence “Pine Top” Smith Now, when I tell you to hold yourself, don’t you move a peg. And when I tell you to get it, I want you to boogie woogie! Other Notable Performers An outstanding dual-piano boogie-woogie performance by Albert Ammons and Pete Johnson, “The Boogie Woogie Man,” can be seen beginning at about 4 minutes and 50 seconds in the 1944 film “The Boogie Woogie Dream.” It also stars vocalist Lena Horne and pianist Teddy Wilson and his jazz band. Most of the music in the film is blues. In the late 1930s, Kansas City jazz bands led by Bennie Moten and Count Basie began incorporating the boogie-woogie piano style into big-band jazz to produce a sound that later became known as swing jazz. “Western Swing” (or “Texas Swing”) was an adaptation by white bands, such as Bob Wills and His Texas Playboys, with a lasting influence in Texas country music and also in the bluegrass music of Bill Monroe. Boogie-woogie rhythms also were adapted to guitar styles. Among the important of these guitarists were Chicago-based Blind Blake in the 1920s, and rural blues singer Robert Johnson in the 1930s. Just after World War II, John Lee Hooker enjoyed a best-selling recording with his composition “Boogie Chillen” (1949). During the height of the rock era, American and British blues-rock bands such as Canned Heat, Savoy Brown, and Commander Cody and his Lost Planet Airmen revived and updated the style. Bibliography - Page, Christopher. Boogie Woogie Stomp: Albert Ammons and His Music. Northeast Ohio Jazz Society. 1997. - Oliver, Paul. The Story of the Blues. Northeastern University Press. 1998."
}