{
  "url": "https://corporate.nicolas.com/our-history/",
  "title": "Our History – Nicolas",
  "text": "WE TAKE CARE OF YOUR WINES The story begins at the time when wine was drunk in taverns or wine shops. And if in the mood to eat at home, we had to go to a wine merchant or directly to the producer to buy a barrel! It is from this observation that Louis Nicolas invented a new concept in wine sales that would revolutionize the habits of consumption and trading: bottled wine. OUR BIG DATES Founded in 1822, the Nicolas House had at that time a main shop at 53 rue Sainte-Anne and three depots in Paris. The idea of providing a superior and consistent quality at a reasonable price created the reputation of the House. Nicolas implemented click-n-collect OUR MISSION, TO FACILIATE ACCESS TO WINE. OUR VISION, WE PROMISE TO FIND THE WINE THAT SUITS YOU. EXPERTISE IN WINE SERVICE Quality experts in consulting since 1822, Nicolas wine merchants are real wine professionals with excellent product knowledge. Indeed, at Nicolas, selling wine is not just a simple exchange between the producer and the consumer. To ensure the quality of advice, Nicolas fully trains all its wine merchants for a period of five weeks. Thanks to the integrated Ecole Nicolas (authorized training center), each future wine merchant discovers not only the products but the task of effectively managing a store. At Nicolas, all questions are answered, whether they are about wine, its service or the art of food pairing! STRONG CULTURE OF INNOVATION First to sell wine in bottles, Nicolas has always been able to assert itself as a pioneer in creating a more innovative range of services: home delivery in 1840, the availability of fresh wines in 1988, the Ice service in 2012 … And as innovation also depends on the offer, Nicolas was the first to propose the Beaujolais Nouveau scale in 1966. In 1995 it celebrated the Pays de France wines with a range of Small Crops followed by Variety of grains in 2003. OUR VALUES NECTAR VARIATIONS The notoriety of NICOLAS asserted itself through an intense advertising in both film (first advertising cartoons in 1921), and on the walls with the appearance of Nectar in 1922. Born from the mind of Dransy and inspired by a deliverer of the house named Le Paven, the frail deliveryman with a moustache and wide eyes, loaded with bottles in each hand, became an immediate success. In 2012, to mark the 190th anniversary of Nicolas, the iconic delivery man of the house was modernized and made us discover a new face. Today, the wine merchant has the honour of advertising communication at Nicolas."
}