{
  "url": "https://en.m.wiktionary.org/wiki/babushka",
  "title": "babushka - Wiktionary, the free dictionary",
  "text": "babushka Appearance English [edit]Alternative forms [edit]Etymology [edit]Borrowed from Russian ба́бушка (bábuška, “grandmother”), from Old East Slavic бабушка (babuška, “grandmother, midwife”). First attested in the 1830s. Pronunciation [edit]Noun [edit]babushka (plural babushkas or babushki) - An Eastern European old woman. [from 1830s] - 1984, Eugenie Fraser, “Before the Storm”, in The House by the Dvina: A Russian Childhood, Mainstream Publishing, →ISBN, pages 126–127: - Yet, much as I loved to listen to it, standing there in the heat of all the lighted candles and dressed in my heavy shuba and felt boots, I invariably, halfway through the service, would begin to feel an intolerable pain across my shoulders which would spread across my back, gradually getting worse, until in the end I was forced to go to the back of the church and find a corner on a bench especially placed there for all the old babushkas and dedushkas who were also unable to bear the strain of standing throughout the whole service. - 2023 May 14, Marc Santora, “As Ukraine Makes Inroads in Bakhmut, Devastation Still Reigns”, in The New York Times[1], archived from the original on 27 August 2023: - There was a 92-year-old babushka who was injured, and we put her on the stretcher and helped get her out. - 2023 July 7, David Volodzko, “Dear Fremont: We need to talk about Lenin and your statue of the genocidal tyrant”, in The Seattle Times[2], archived from the original on 28 April 2025: - As a boy, I hand-made pelmeni with my babushka Alla, my hands and face covered in flour as we worked in the cold of my grandparents’ basement in Paterson, New Jersey. - A Russian grandmother. [from 1830s] - 1834, Michael Zakosken, translated by “a Russian Lady of high rank and her two amiable daughters”, edited by Frederic Chamier, The Young Muscovite, or the Poles in Russia, volume I, London: Cochrane and M'crone, translation of Youry Dmitrich Miloslawsky (in Russian), page 203: - I tell thee what, Babushka! I have no time to waste with thee in idle words. - 1899, Lyof N. Tolstoï, “The Dekabrists: A Romance”, in [unknown], transl., Master and Man; The Kreutzer Sonata; Dramas (The Novels and Other Works of Lyof N. Tolstoï), New York, N.Y.: Charles Scribner’s Sons, page 231: - The young coachman […] not knowing how to treat the old woman: whether with deference as it seemed to him proper, because the old woman wore the same kind of attire as his babushka and the mother of his house did […] - 1980, Mike Davidow, Moscow Diary, Moscow: Progress Publishers, page 147: - There they were, the devoted babushkas and dedushkas, mothers and fathers, sisters and brothers of Bobby’s companions, lugging their bags, their bulging packages and bundles. - 2020, Nalini Singh, Alpha Night (Psy-Changeling Trinity), Berkley, →ISBN, page 205: - “He and my babushka took an angry and confused teenager and taught her how to build herself up into a strong woman.” - (originally Northern US) A traditional floral headscarf worn by an Eastern European woman, tied under the chin. [from 1930s] - 1966 March, Thomas Pynchon, chapter 5, in The Crying of Lot 49, New York, N.Y.: Bantam Books, published November 1976, →ISBN, page 79: - “Say hello to old Stanley,” he called as she pattered down the steps into the street, flung a babushka over her license plate and screeched away down Telegraph. - 1982, TC Boyle, Water Music, Penguin, published 2006, page 78: - The crowd falls silent, momentarily stunned, while a heavyset woman in a babushka pushes her way through, broadcasting the news […]. - A Russian doll, a matryoshka. [from 1940s] - 1948, Theodore Dryden, “Remarks on the Constitution of the Mongolian People's Republic”, in Dwight Macdonald, editor, politics[3], volume 5, number 3, New York: Politics Publishing Co., page 190: - The present inhabitants of the Kremlin […] have rigged the Constitution in a series of articles which fit into each other like those wooden babushkas Russian peasants used to make, so that, as one shell after another is removed, the effective power finally resides in the tiny babushka in the inmost center. Usage notes [edit]- Note that the Russian term ба́бушка (bábuška, “grandmother, old woman”) doesn't have the sense \"Russian doll, matryoshka\" or \"woman’s headscarf\". Derived terms [edit]Related terms [edit]Translations [edit]an old woman woman’s headscarf tied under the chin matryoshka — see Russian doll References [edit]- “babushka, n.”, in OED Online , Oxford: Oxford University Press, launched 2000. Categories: - English terms borrowed from Russian - English terms derived from Russian - English terms derived from Old East Slavic - English 3-syllable words - English terms with IPA pronunciation - English terms with audio pronunciation - English lemmas - English nouns - English countable nouns - English nouns with irregular plurals - English terms with quotations - Northern US English - en:Female family members - en:Headwear - en:Russia"
}