{
  "url": "https://support.google.com/translate/answer/6142478?hl=pt-PT&co=GENIE.Platform=Desktop",
  "title": "Traduzir palavras escritas - Computador - Ajuda do Google Translate",
  "text": "Você pode usar o app Google Tradutor para traduzir palavras ou frases escritas. Também é possível usar esse serviço em um navegador da Web, como o Chrome ou Firefox. Importante: para traduzir no Chrome com seu dispositivo móvel, o JavaScript é necessário. Aprenda a ativar o JavaScript. Traduzir texto - No computador, abra o Google Tradutor. - Na parte de cima da tela, selecione os idiomas para traduzir. - De: escolha uma opção ou toque em Detectar idioma . - Para: selecione o idioma para o qual você quer traduzir. - Na caixa de texto à esquerda, digite o texto que você quer traduzir. - Escolha o que você quer fazer: - Consulte os detalhes: para conferir os detalhes disponíveis para cada resultado, como definições, exemplos ou outras traduções, clique em Consulte os detalhes. No momento, esse recurso está disponível apenas para alguns idiomas. - Ouvir: para escutar a tradução, clique em Ouvir . Para mudar a velocidade do áudio, clique em Configurações no canto superior direito e selecione Normal, Lenta ou Mais lenta. - Copiar: para copiar a tradução para a área de transferência, clique em Copiar . - Avaliar ou editar: as edições sugeridas podem ajudar a melhorar as traduções. Para avaliar uma tradução ou sugerir uma edição, clique em Gostei ou Não gostei . - Compartilhar: para enviar a tradução por e-mail ou pelo Twitter, clique em Compartilhar tradução . Importante: algumas palavras podem ter significados diferentes. Escreva a palavra em uma frase para encontrar o significado pretendido com mais facilidade. Traduzir textos mais longos Você pode traduzir até 5.000 caracteres de uma vez ao copiar e colar o texto. - No computador, abra o Google Tradutor. - Na parte de cima da tela, escolha os idiomas que você quer usar na tradução. - De: escolha uma opção ou toque em Detectar idioma. - Para: selecione o idioma para o qual você quer traduzir. - Copie e cole o texto na caixa. - Você pode revisar trechos do texto traduzido. Na barra da parte de baixo da tela, clique em Voltar ou Avançar . Dica: também é possível traduzir documentos e sites."
}