{
  "url": "https://www.thefreedictionary.com/aspirant",
  "title": "Aspirant - definition of aspirant by The Free Dictionary",
  "text": "aspirant Also found in: Thesaurus, Medical, Wikipedia. as·pi·rant (ăs′pər-ənt, ə-spīr′-)n. One who aspires, as to advancement, honors, or a high position. adj. Seeking recognition, distinction, or advancement. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. aspirant (ˈæspɪrənt; əˈspaɪərənt)n a person who aspires, as to a high position adj aspiring or striving Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 as•pir•ant (ˈæs pər ənt, əˈspaɪər ənt)n. 1. a person who aspires, as one who seeks or desires a career, advancement, status, etc. adj. 2. aspiring. [1730–40; (< French) < Latin] Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. aspirant noun adjective Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 aspirant noun2. A person who applies for or seeks something, such as a job or position: The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 Collins English/French Electronic Resource. © HarperCollins Publishers 2005 aspirant Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995"
}