{
  "url": "https://forum.supremacy1914.com/index.php?game-manual/",
  "title": "Game Manual - Supremacy - Forum",
  "text": "Game Manual Supremacy 1914 is a grand strategy multi-player online game set in World War I. You will take control of one nation and try to use diplomatic skill, military prowess and covert tactics in the struggle for dominance over the continent - or the whole world. Supremacy 1914 is played in single matches (or 'game rounds') which may take up to 6 months to finish and pit up to 500 players against each other in real-time combat. Gameplay takes place on historical maps and is all about managing your economy, directing your armies to expand your territory, and forming coalitions with other players in order to fulfil the victory condition of the match. Unit commands and productions will be executed even when you are offline. However, keeping a close eye on what is happening on the map and managing the moment-to-moment interactions is key to victory. You can play multiple game rounds simultaneously to explore strategies and challenge different players. By playing and winning games, you will gain awards and higher ranks to measure your progress against other players. You can also join alliances, enter cooperative team matches, and set up rounds with various different settings and game modes. TABLE OF CONTENTS This manual will cover everything you need to know to successfully participate in a round of Supremacy 1914. Many of the intricacies of gameplay and tactics will only be mentioned in passing, though. It is up to you to master the game and dominate your opponents. If you want to read up on a specific topic you can take one of the following shortcuts: WINNING THE GAME The goal of the game is to be the first player to reach a certain amount of Victory Points and thereby win the round. Your current Victory Points are calculated on the basis of various factors reflecting your progress towards dominance on the map. To increase your Victory Points score you can: - conquer provinces; - construct buildings; - increase the morale in your provinces. WHAT IS A GAME ROUND? A game of Supremacy 1914 (also called a ‘round’) hosts a limited number of players. You can play multiple of these rounds at the same time, for example to change between different maps and scenarios, explore different strategies, rule different countries, challenge friends in password-protected private games, etc. Each ranked game will award you with a certain amount of Goldmark depending on your final Victory Points score, as well as an increase in account level and combat stats. You will also be able to collect various achievements reflecting your progression in the game. Have a look at the New Games section to find out about the different possible round settings and to find running games with these settings."
}