{
  "url": "https://fr.wikipedia.org/wiki/Tumblr",
  "title": "Tumblr — Wikipédia",
  "text": "Tumblr Tumblr est une plate-forme de microblogage créée en 2007 et permettant à l'utilisateur de poster du texte, des images, des vidéos, des liens et des sons sur son tumblelog. Elle s'appuie principalement sur le reblogage. Son slogan est : « Venez pour voir ce que vous aimez. Restez pour ce que vous découvrirez. » Étymologie [modifier | modifier le code]De a-tumble, « pêle-mêle »[réf. souhaitée]. Histoire [modifier | modifier le code]Tumblr a été créée en 2007 par l'entrepreneur américain David Karp[2],[3]. La plate-forme a connu une augmentation rapide du nombre d'usagers. En , Tumblr comptait quelque 170 000 utilisateurs[4]. Début , environ 6,6 millions de personnes l'utilisaient, selon Mark Coatney, employé de Tumblr[5]. Début , une interface en français de Tumblr a été lancée à l'attention des internautes francophones[1]. Selon le site The Next Web, le nombre de comptes a doublé en un an et comptait en 2013 plus de 100 millions de blogs avec plus de 44,6 milliards de billets postés depuis sa création en 2007[6]. En , Tumblr a mis fin à son service Storyboard moins d'un an après son lancement. Storyboard était un pôle d'échange contrôlé par des journalistes expérimentés afin de valoriser des articles écrits par des auteurs issus de la sphère créative du site. Le fondateur, David Karp, avait vivement soutenu ce service[7]. En , Yahoo! a racheté Tumblr pour 1,1 milliard de dollars américains[8],[9]. Après l'achat de Yahoo! et l'union avec Aol, par Verizon, Oath devient la maison mère de Tumblr en [10]. En , Tumblr a annoncé que dès le 17 du mois, tout contenu à caractère pornographique serait banni de la plate-forme, à l'exception des contenus textuels, artistiques ne représentant pas d'activités sexuelles, de nudité militante, d'allaitement au sein et de natalité. Les images et vidéos montrant la poitrine dénudée d'une femme, qu'importe le contexte, sont également interdites, ce qui n'est pas le cas pour le torse d'un homme[11],[12]. Cette décision surprenante a été vivement critiquée par de nombreux utilisateurs qui se servaient de la plate-forme pour regarder du porno « trash », « safe » ou simplement du nu artistique[réf. nécessaire]. L'application, qui était bannie de l'App Store[13],[14], a pu être remise à disposition pour les utilisateurs d'appareils Apple après la mise en place de ces nouvelles réglementations. La corrélation entre le jour du retrait de l'application sur l'App Store le et l'annonce soudaine d'un nouveau règlement le fait penser que le susdit règlement relevait davantage d'un intérêt financier que d'une véritable tolérance zéro[15]. En effet, il ne correspond plus au slogan après 11 ans de liberté d'expression. En réalité, la raison de ce bannissement est l'entrée en vigueur de la loi FOSTA/SESTA aux États-Unis. Bien que le but officiel de cette dernière soit de lutter contre la traite d'êtres humains, elle a été vivement critiquée par les travailleurs du sexe, car selon eux, elle contribuerait à les marginaliser davantage en les privant de plates-formes qui leur garantissaient une relative indépendance et leur permettaient de promouvoir leur travail[16]. En , Tumblr, qui appartient toujours à Verizon, est racheté par Automattic[17] pour un montant non-publié mais estimé à trois millions de dollars. Financement [modifier | modifier le code]Le financement de Tumblr a évolué. Initialement, le financement provenait des gains de David Karp lorsqu'il était consultant en logiciel sur le site parental UrbanBaby. Tumblr a également bénéficié d'investissements de l'Union Square Ventures, de Spark Capital, de Martin Varsavsky, de John Borthwick et de Fred Seibert. En , Sequoia Capital a injecté environ 30 millions de dollars dans Tumblr[18]. En , s'apprêtant à lever de nouveaux fonds (de 75 millions à 100 millions de dollars), Tumblr a été évalué à 800 millions de dollars[19]. Le , Yahoo rachète Tumblr pour 1,1 milliard de dollars alors que le site ne parvient pas à être bénéficiaire[20]. Identité visuelle (logo) [modifier | modifier le code]- Logo de janvier à - Deuxième logo - Logo jusqu'en - Logo à partir de - Logo à partir de 2018 Fonctionnement [modifier | modifier le code]Présentation [modifier | modifier le code]L’inscription sur Tumblr est gratuite et ne nécessite qu'une adresse e-mail, un nom d’utilisateur et un mot de passe. Après avoir terminé l’inscription, Tumblr propose au nouvel utilisateur de consulter des pages susceptibles de l'intéresser ou de retrouver ses connaissances déjà inscrites sur le site. Tumblr fonctionne par un système d’abonnements similaire à celui de Twitter ; l'utilisateur peut choisir de s’abonner à un tumblelog sans que celui-ci ne le suive nécessairement ; les mises à jour sont ensuite visibles sur un tableau de bord (dashboard) depuis lequel l'utilisateur peut publier ses posts, voir les posts mis en ligne par les personnes qu'il suit, voir les notifications et les questions éventuelles et modifier l’apparence de son propre blog Tumblr. Publications [modifier | modifier le code]En haut du dashboard, on trouve la sélection des diverses publications possibles sur la plateforme : - les textes – Les mises en forme sont minimalistes ; il est possible de programmer la publication des articles dont les URL peuvent être personnalisées manuellement. Il est possible aussi d’ajouter des tags. Bien que ce soit un ajout de texte, une ou plusieurs photos peuvent être ajoutées. - les images – L’éditeur est similaire à celui du module « texte » ; il est possible de télécharger une photo jusqu’à 10 Mo ou de pointer vers l’URL d’une image déjà en ligne. Des tags peuvent être ajoutés. La publication peut s’effectuer en même temps sur les plateformes Tumblr, Facebook et Twitter. Tumblr est visuel. La majorité des publications sont des images, rebloguées grâce à la fonction rebloguer. Sur le dispositif, des spams et du contenu pornographique peuvent apparaître : Tumblr n'exerce aucun contrôle sur les images publiées. On peut néanmoins préciser que les images sont \"NSFW\" : Not Safe For Work. Le mot-clé « porn » aboutit à plus de 35 millions de résultats. - Les citations – Ce mode permet de citer un contenu web pour mettre en valeur les dires d’un blogueur ou d’une personnalité de référence. La citation peut être cliquable et renvoyer vers un article. - Les liens – Ce mode est très proche de Twitter mais comporte plus de fonctionnalités ; il dispose des mêmes possibilités de référencement que les autres modules (réécriture d’URL, choix des tags, etc.). - Les extraits de discussions – Il permet de copier/coller des extraits d’une discussion. - Les contenus audio et vidéo – Ces deux modules permettent d’intégrer des sons en MP3 et des vidéos à partir de plates-formes telles que YouTube ou en les téléchargeant depuis son ordinateur (limite fixée à 5 minutes pour un poids maximum de 100 Mb). Fonctionnalités [modifier | modifier le code]- Créer son espace personnalisé – Bien qu’il existe des thèmes déjà prédéfinis (certains gratuits et d’autres payants), la mise en forme et le graphisme sont entièrement personnalisables. La création d'un thème unique se fait à partir d'un codage html. - Suivre des utilisateurs – Lorsqu’on visite un tumblelog, il est possible de s'abonner à cette page ; avec cet abonnement, l'utilisateur est averti sur son dashboard des mises à jour effectuées. - Publier du contenu – Photos, textes, vidéos, liens, sons, discussions… - Rebloguer – Le reblogage permet de partager la publication d’un membre de Tumblr sur son propre tumblelog (grâce à l’icône « rebloguer »). - Mettre en avant des billets « coups de cœur » – Les articles « coups de cœur » d'autres utilisateurs sont remontés sur son propre tumblelog (grâce à l’icône [♥]). - Devenir contributeur – Un contributeur peut proposer du contenu sur le Tumblr d’un autre utilisateur, avec son accord. - Questions/Réponses – Avec la fonction « Ask me anything », les utilisateurs peuvent poser des questions aux autres membres. Si un membre répond, sa réponse apparaît sur son tumblelog. Il est aussi possible de répondre en privé. - Recherches – Il existe deux types de recherches : la recherche par tags permet de trouver des contenus ou des utilisateurs plus facilement ; par ailleurs, Tumblr propose la fonction « explore », qui permet de découvrir des contenus répertoriés par thèmes et classés par popularité. La recherche de contenus officiels via « spotlight » permet une recherche thématique parmi les tumblelogs mis en avant officiellement par la plateforme. Tumbeasts [modifier | modifier le code]Lorsque Tumblr est indisponible, une page avec des Tumbeasts s'affiche. Ces créatures vertes sont nées de l'imagination du graphiste Matthew Inman, créateur du site The Oatmeal[21],[22]. Il s'agit d'une référence à la baleine échouée (la « Fail Whale ») qui illustre les plantages de Twitter[23]. Usages [modifier | modifier le code]Pour Évelyne Broudoux, chercheuse en communication à l'université de Versailles-Saint-Quentin-en-Yvelines, Tumblr appartient à « cette première génération d’outils d'auto-publication à spécialiser les billets selon la matière qu’ils réceptionnent ». Dans une étude, elle explique : « Un billet Tumblr est pré-formaté selon sa forme sémiotique : simple lien hypertexte, texte ou image, enregistrement sonore ou vidéo, ou symbolique : citation avec sa source ou republication entière d’un post[24] ». Tumblr est parfois utilisé comme outil de militantisme, par exemple avec la création par Anaïs Bourdet de Paye ta schnek en 2012 pour dénoncer le harcèlement sexiste dans l'espace public ou de Ruines d'université par le collectif Sciences en marche en 2014 pour alerter sur le manque de moyen de certaines universités françaises[25]. Priorité au visuel [modifier | modifier le code]La plate-forme serait très utilisée par les spécialistes de la mode en raison de la possibilité de diffuser et de partager des visuels[26]. Les documents sont conçus pour être partagés au sens d'une réutilisation et non d'un simple accès à l'information[réf. nécessaire]. Version mobile [modifier | modifier le code]Tumblr est également présent sur les mobiles via tous les systèmes d'exploitation de la téléphonie mobile. Différentes versions de Tumblr ont été lancées pour Android : dans la version de 2013, des changements ont été apportés tant au niveau du système d'affichage des images que des animations. Il est à nouveau possible d'utiliser la fonction « prendre une photo »[27]. Le , Tumblr a été retiré de l'AppStore en raison de contenus pédopornographiques partagés sur la plateforme[réf. souhaitée]. Notes et références [modifier | modifier le code]- « Tumblr, shaker à blogueurs », sur ecrans.fr, consulté le 1er mars 2011 - ↑ « Tumblr lève 25 millions de dollars », sur clubic.com (consulté le ). - ↑ « David Karp : «Tumblr pourrait être aussi connu que Twitter et Facebook» », sur 20minutes.fr (consulté le ). - ↑ (en) Would You Take a Tumblr With This Man? - The New York Observer, 15 janvier 2008 - ↑ (en) « Media Companies Try Getting Social With Tumblr », sur betcmusic.fr, consulté le 18 février 2011. - ↑ Nathalie Bur, « Tumblr franchi le cap des 100 millions de blogs », sur cnetfrance.fr, (consulté le ). - ↑ « Tumblr arrête son service Storyboard », sur pcworld.fr, consulté le 13 avril 2013. - ↑ Sarah Belouezzane, « Yahoo! officialise le rachat de Tumblr », sur Le Monde.fr, (consulté le ). - ↑ « Yahoo ! va racheter Tumblr pour $1,1 milliard », sur Investir, (consulté le ). - ↑ Clément Fages, « Verizon finalise l'acquisition de Yahoo! pour donner naissance à Oath », sur emarketing.fr, . - ↑ « A better, more positive Tumblr », sur Tumblr Staff (consulté le ). - ↑ (en-US) « Adult content », sur Help Center (consulté le ). - ↑ « L'application de Tumblr disparaît de l'App Store à cause de contenus pédopornographiques », sur Le Figaro, (consulté le ). - ↑ Shannon Liao, « Tumblr will ban all adult content on December 17th », sur The Verge, (consulté le ). - ↑ (en-US) « November 16, 2018: Issues with the iOS app », sur Help Center (consulté le ). - ↑ The Establishment, « Want To Know Why Tumblr Is Cracking Down On Sex? Look To FOSTA/SESTA », sur Medium, (consulté le ). - ↑ « La plate-forme Tumblr vendue au propriétaire de WordPress.com », Le Monde, (lire en ligne). - ↑ Tumblr, un « Twitter » multimédia, lève 30 millions de dollars - Le Figaro, 28 décembre 2010. - ↑ (en) Spencer E. Ante, « The $800 Million Formula: Slim Sales, a Goofy Name », sur online.wsj.com, (consulté le ). - ↑ Boris Manenti, « Yahoo va-t-il tuer Tumblr ? », sur nouvelobs.com, (consulté le ). - ↑ « Tumblr envahi par les « Tumbêtes » »(Archive.org • Wikiwix • Archive.is • Google • Que faire ?), sur ecrans.fr, consulté le 19 février 2011 - ↑ (en) Tumblr Adds Suggested Tumbeast to 404 Page - The New York Observer, 25 janvier 2011. - ↑ « Twitter : sauvez la baleine ! » »(Archive.org • Wikiwix • Archive.is • Google • Que faire ?), sur ecrans.fr, consulté le 1er février 2011. - ↑ « L’exercice autoritatif du blogueur et le genre éditorial : un exemple avec le microblogging de Tumblr », sur Archive Ouverte en Sciences de l'Information et de la Communication, consulté le 1er mars 2011 [PDF]. - ↑ Amandine Schmitt, « \"Ruines d’université\" : le Tumblr qui dénonce l’insalubrité des facs », sur L'Obs, (consulté le ). - ↑ « Tumblr va-t-il remplacer Facebook comme réseau social de référence pour la mode ? », sur leparisien.fr, consulté le 18 février 2011. - ↑ « Info US : Tumblr pour Android, Facebook rattrapé par Google, les mots de passe menacés », sur pro clubic.com, consulté le 11 avril 2013. Bibliographie [modifier | modifier le code]- Katrin Tiidenberg, Natalie Ann Hendry, Crystal Abidin, Tumblr, Polity Press, 2021. - Allison McCracken, Alexander Cho, Louisa Stein, Indira N Hoch, A Tumblr Book. Platform and Cultures, University of Michigan Press, 2020. Annexes [modifier | modifier le code]Articles connexes [modifier | modifier le code]Liens externes [modifier | modifier le code]- Ressource relative à l'audiovisuel : - Notices dans des dictionnaires ou encyclopédies généralistes : - (mul) Site de la plateforme"
}