{
  "url": "https://www.60millions-mag.com/forum/commerce-en-ligne/livreur-amazon-amazon-ofm-refuse-de-rembourser-t258425.html",
  "title": "Forum 60 millions de consommateurs • Consulter le sujet - Colis Amazon jamais recu, Amazon OFM refuse de rembourser",
  "text": "Bonjour à tous, J'ai effectué mi-décembre une commande pour une PS5 sur le site Amazon, avec livraison à domicile. Le jour de la livraison, je reçois le matin-même un email de la part d'Amazon me fournissant un code secret à donner en main propre au livreur. Le mail d'Amazon stipule bien que je dois donner le code au livreur, et non le rentrer moi-même. Le livreur arrive et m'appelle à ce moment-là. Je descends pour réceptionner le colis, et lui fournit le code en main propre. Le livreur rentre trois fois de suite le mauvais code dans son interface, et m'explique qu'il ne peut malheureusement pas valider la livraison du fait de cette erreur. De mon côté, je suis étonné car la situation me paraît très louche, mais je reçois un mail d'Amazon m'indiquant que la tentative de livraison ayant échouée, une nouvelle tentative de livraison sera effectuée le jour ouvrable suivant. N'ayant de mon côté rien signé qui valide la bonne réception du colis, et ayant reçu un mail d'Amazon m'indiquant qu'ils repasseraient plus tard, je laisse bon gré mal gré le livreur repartir avec le colis. Moins de 10 minutes plus tard, je reçois un email de confirmation d'Amazon m'indiquant que mon colis a 'bien été livré', alors qu'il ne s'est strictement rien passé de mon côté depuis le premier passage. Je pense que le livreur a tout simplement utilisé le code plus tard pour son propre compte. J'appelle le service Amazon, qui me demande d'attendre 2-3 jours afin de m'assurer que le colis n'a pas été livré à des voisins, etc.., et ouvre une requête en interne. Deux jours plus tard, je reçois un email de la part d'Amazon m'indiquant que les achats non numériques ont été suspendus sur mon compte à la suite de 'violations de leur politique de retour et de remboursement' prétendument répétées. Je conteste, n'ayant jamais été impliqué dans de telles affaires ; je leur demande également un remboursement ou renvoi du colis qui ne m'a pas été livré. Le service Amazon OFM refuse de me rembourser, estimant que la commande m'a été livrée et que j'ai signé la bonne réception de ce colis. Estimant que la responsabilité est celle d'Amazon car je n'ai rien signé et j'ai suivi leurs instructions à la lettre, et pensant être potentiellement victime d'une usurpation d'identité, je demande au service Amazon plus de précisions quant à cette prétendue livraison, mais ne reçois aucun détail supplémentaire de leur part si ce n'est un refus de me rembourser/effectuer un remplacement. Depuis, plus de nouvelles ; le service OFM Amazon ignore toutes mes relances par email, et mes appels à leurs équipes sont redirigés vers OFM. J'ai contacté la FEVAD et ouvert une procédure de RLL, sans succès pour l'instant : la FEVAD n'a rien donné (mail OFM me disant qu'ils ne feraient rien de plus), et pas de nouvelles côté RLL. J'ai également envoyé un courrier recommandé, pas de réponse. Je suis sidéré par le comportement du service OFM. Il suffit d'une petite recherche internet pour voir que cette situation est connue et survient fréquemment (https://www.capital.fr/economie-politique/***), et le service répond en portant de fausses accusations envers son consommateur. J'ai essayé de discuter avec eux en soulevant le fait qu'il était dans leur intérêt comme du mien que leurs livreurs ne profitent pas leurs client impunément, mais je tombe face à un mur.. Je pense donc maintenant : 1 - Essayer de contacter quelqu'un en interne chez Amazon US et leur expliquer la situation 2 - Envoyer une lettre de mise en demeure 3 - Porter plainte contre Amazon France Est-ce que cette situation vous est déjà arrivée ? Auriez-vous d'autres idées d'actions à effectuer pour me faire rembourser ? J'ai dépassé le point où je crois à une nouvelle livraison. Bonne soirée à vous"
}