{
  "url": "https://krinos.com/about/",
  "title": "About us – Krinos",
  "text": "About Us Krinos Foods, Since 1958 Established in 1958, Krinos Foods is the largest importer and distributor of Greek and Eastern European specialty foods in North America. Headquartered in New York, Krinos also has facilities in Atlanta, Chicago, Texas, California and Louisiana. Bringing Global Flavors to Every Market Unmatched Variety Krinos imports, manufactures and distributes over 1,800 frozen, refrigerated and dry products including the best-selling tahini in the U.S. Product lines include beverages, cheeses, coffees, confectionery, meats, olives, olive oils, pastas and peppers. SKU Brands Suppliers Around the World Countries We Source From Sustainability Krinos Foods’ state-of-the-art facility in New York includes green elements such as energy efficient lighting, HVAC systems, and 1,743 solar panels generating 70% of our facility’s power. The solar panel installation is one of the ten largest in New York City. The power generated—566,475 kilowatts annually, is enough to power 65 residential homes a year. With 55 trees planted on and off site, Krinos is also helping to create more green space in the community. As our owner said at the opening of the New York facility, “The new facility is a significant milestone for Krinos as we continue to lead within the specialty food industry.” The Krinos Advantages Quality Value Partnership Versatility Location Krinos Foods Headquarters - 1750 Bathgate Avenue, Bronx, NY 10457 - Phone: (718) 729-9000 - Toll Free: (800) 877-5757 - Fax: (718) 361-9725 Krinos Foods Atlanta - 1810 Satellite Boulevard, Buford, GA 30518 - (678) 377-0098 - (678) 377-0099 - krinosatlanta.com Krinos Foods Chicago - 4545 James Place, Melrose Park, IL 60160 - 708-344-6500 - Fax (708) 344-6501 - krinoschicago.com The Olive Packing Company - 1500 Sabine Avenue, Port Authur, TX 77642 - (409) 293-3257 - (866) 449-0393 - olivepackingcompany.com Santa Barbara Olive Company - 1105 E. Foster Road, Santa Maria, CA 93455 - (805) 922-6700 - (805) 922-6701 - sbolive.com"
}