{
  "url": "https://finance.yahoo.com/quote/GEO/",
  "title": "The GEO Group, Inc. (GEO) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "The GEO Group, Inc. (GEO) - Previous Close 15.75 - Open 15.72 - Bid 15.50 x 20000 - Ask 15.74 x 80000 - Day's Range 15.42 - 15.80 - 52 Week Range 14.27 - 32.09 - Volume 833,463 - Avg. Volume 1,873,706 - Market Cap (intraday) 2.219B - Beta (5Y Monthly) 0.76 - PE Ratio (TTM) 9.28 - EPS (TTM) 1.69 - Earnings Date Feb 12, 2026 - Forward Dividend & Yield -- - Ex-Dividend Date Jan 22, 2021 - 1y Target Est 32.25 The GEO Group, Inc. (NYSE: GEO) is a leading diversified government service provider, specializing in design, financing, development, and support services for secure facilities, processing centers, and community reentry centers in the United States, Australia, South Africa, and the United Kingdom. GEO's diversified services include enhanced in-custody rehabilitation and post-release support through the award-winning GEO Continuum of Care, secure transportation, electronic monitoring, community-based programs, and correctional health and mental health care. GEO's worldwide operations include the ownership and/or delivery of support services for 95 facilities totaling approximately 75,000 beds, including idle facilities and projects under development, with a workforce of up to approximately 20,000 employees. www.geogroup.com20,000 Full Time Employees December 31 Fiscal Year Ends Sector Security & Protection Services Industry Recent News: GEO View MorePerformance Overview: GEO Trailing total returns as of 2/4/2026, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) . YTD Return 1-Year Return 3-Year Return 5-Year Return Earnings Trends: GEO View MoreAnalyst Insights: GEO View MoreStatistics: GEO View MoreValuation Measures Market Cap 2.20B Enterprise Value 3.65B Trailing P/E 9.32 Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.87 Price/Book (mrq) 1.44 Enterprise Value/Revenue 1.44 Enterprise Value/EBITDA 5.99 Financial Highlights Profitability and Income Statement Profit Margin 9.40% Return on Assets (ttm) 4.72% Return on Equity (ttm) 16.80% Revenue (ttm) 2.53B Net Income Avi to Common (ttm) 237.33M Diluted EPS (ttm) 1.69 Balance Sheet and Cash Flow Total Cash (mrq) 183.94M Total Debt/Equity (mrq) 107.26% Levered Free Cash Flow (ttm) 6.3M Compare To: GEO Select to analyze similar companies using key performance metrics; select up to 4 stocks. Company Insights: GEO Fair Value Dividend Score Hiring Score Insider Sentiment Score Research Reports: GEO View MoreLowering target price to $13.00 GEO GROUP INC/THE has an Investment Rating of SELL; a target price of $13.000000; an Industry Subrating of Medium; a Management Subrating of Low; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Low. RatingPrice TargetWhat does Argus have to say about GEO? GEO GROUP INC/THE has an Investment Rating of SELL; a target price of $14.000000; an Industry Subrating of Medium; a Management Subrating of Low; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Low. RatingPrice TargetRaising target price to $14.00 GEO GROUP INC/THE has an Investment Rating of SELL; a target price of $14.000000; an Industry Subrating of Medium; a Management Subrating of Low; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Low. RatingPrice TargetWhat does Argus have to say about GEO? GEO GROUP INC/THE has an Investment Rating of SELL; a target price of $13.000000; an Industry Subrating of Medium; a Management Subrating of Low; a Safety Subrating of Low; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Low. RatingPrice Target"
}