{
  "url": "https://curioteca.com/10-cosas-que-quizas-no-sabias-sobre-los-templos-de-angkor/",
  "title": "10 cosas que quizás no sabías sobre los templos de Angkor -",
  "text": "10 cosas que quizás no sabías sobre los templos de Angkor Estructura y arquitectura Los templos de Angkor son uno de los ejemplos más impresionantes de arquitectura jemer en el mundo. La compleja red de pirámides, torres y pasillos reviste a los templos de una atmósfera mágica que ha resultado fascinante para visitantes de todo el mundo. Historia de los templos de Angkor Los templos de Angkor han sido construidos a lo largo de varios siglos, comenzando en el siglo IX. Una combinación de luchas entre diferentes civilizaciones y la influencia de diferentes culturas ha dejado una huella profunda en la historia y la arquitectura de los templos de Angkor. Desde su construcción, los templos de Angkor pasaron por una etapa de disminución después de un pequeño tiempo en la que su importancia disminuyó Arte y decoración - Los templos de Angkor están ricamente decorados con imágenes de dragones, demonios y divinidades hindúes y budistas. - La decoración de las paredes y los techos de los templos está integrada por mosaicos esculpidos, bas-relieves y pinturas. - Estas imágenes religiosas y ornamentales fueron pintadas a mano en un proceso laborioso por los artistas jemer trabajando con colores como la arcilla y el oro Curiosidades de los templos de Angkor - El complejo de los templos Angkor fue construido sobre 20 km². - Se calcula que originalmente, antes de la inscripción del nombre del mismo, la imagen era original; Sin embargo, debido a problemas ambientales solo hay el 20% en buen estado. - El Templo de Ta Prohm, uno de los sitios más visitados de los templos de Angkor, recibió gran atención en el clásico de Peter Jackson, «El Señor de los Anillos», en la cual se utilizó por la famosa película. Santuarios y librerías dentro de los templos de Angkor El Carcera de su interior es uno de los ejemplos más grandes dentro de los templos de Angkor pudiendo acceder a un interior al menos 1 kilómetro abajo de la atmósfera de verano durante todo el año en el cual el interior se ve más fresco Premoniciones y supersticiones La mala suerte de la mala suerte por la lectura, repetición en la voz la última frase del el templo: una bruja hace que como una profecía en la cual se dice que el espíritu que atrae el poder del el templo pase a los paganos . Y así le explican a los que están recién llegados la mala suerte mediante las leyendas"
}