{
  "url": "https://play.google.com/store/apps/details?id=com.google.android.youtube&hl=en-US",
  "title": "YouTube - Apps on Google Play",
  "text": "Get the official YouTube app on Android phones and tablets. See what the world is watching -- from the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more. Subscribe to channels you love, create content of your own, share with friends, and watch on any device. Watch and subscribe ● Browse personal recommendations on Home ● See the latest from your favorite channels in Subscriptions ● Look up videos you’ve watched, liked, and saved for later in Library Explore different topics, what’s popular, and on the rise (available in select countries) ● Stay up to date on what’s popular in music, gaming, beauty, news, learning and more ● See what’s trending on YouTube and around the world on Explore ● Learn about the coolest Creators, Gamers, and Artists on the Rise (available in select countries) Connect with the YouTube community ● Keep up with your favorites creators with Posts, Stories, Premieres, and Live streams ● Join the conversation with comments and interact with creators and other community members Create content from your mobile device ● Create or upload your own videos directly in the app ● Engage with your audience in real time with live streaming right from the app Find the experience that fits you and your family (available in select countries) ● Every family has their own approach to online video. Learn about your options: the YouTube Kids app or a new parent supervised experience on YouTube at youtube.com/myfamily Support creators you love with channel memberships (available in select countries) ● Join channels that offer paid monthly memberships and support their work ● Get access to exclusive perks from the channel & become part of their members community ● Stand out in comments and live chats with a loyalty badge next to your username Upgrade to YouTube Premium (available in select countries) ● Watch videos uninterrupted by ads, while using other apps, or when the screen is locked ● Save videos for when you really need them – like when you’re on a plane or commuting ● Get access to YouTube Music Premium as part of your benefits Safety starts with understanding how developers collect and share your data. Data privacy and security practices may vary based on your use, region, and age. The developer provided this information and may update it over time. Idk if it's just me, but for a year now, YT has been glitching, and it's not my internet. Also, the ads are pretty annoying. Some things are pretty questionable and inappropriate, but mostly okay. Also, if I click on shorts one video pops up, and the rest are all previous ones I've watched. That can be pretty frustrating. Other than that, it's a pretty good app to have. Edit: I no longer see shorts that I have before all the time, but it still glitches and YT is obviously still weird sometimes. 33,966 people found this review helpful Paige Thornton Flag inappropriate November 24, 2025 Crashes a lot. Videos can play just fine but I can't go into my account without freezing. Navigating everything else but the music consistently fails and causes me to reboot. Doesn't always work. It has happened across multiple phones through the years. 23 a month for the family though, can't knock that part. Although, it was way cheaper back when mp3 players were a thing...hmmm 126,810 people found this review helpful Tenley Bernal Flag inappropriate Show review history October 15, 2025 Much better since I last reviewed. Isnt letting me watch videos but may just be my phone. Overall so much better! Update: yeah no it's definitely not just my phone. Comments were loading fine on shorts (Wanted to quickly see if it was ok again) while the video wasn't. Then the comments kept closing then not loading. I'm still getting notifications from the app and videos on the home screen are loading so it's not a connection thing. At this point its on your end. I just wanna chill and I can't. 116,710 people found this review helpful What’s new For new features, look for in-product education & notifications sharing the feature and how to use it!"
}