{
  "url": "https://www.bankmillennium.pl/en/",
  "title": "Individuals - Accounts, loans, mortgage credits, cards, deposits - Bank Millennium",
  "text": "Since 25.08 It will not be possible to log in to Millenet from the version of the browser you are now using. Update the browser on your device and use online banking in a comfortable and secure way. Update the browserCyberscammers atack again, this time using ad-blocking applications. How does this work? 1. You search for an ad-blocking application for your browser outside of the official store (for example Google Play). 2. You install the application from an ad or an unknown website. 3. The downloaded application is actually malware that fraudsters can use to: - intercept your authorisation PIN and password, - gain unauthorised access to your account and notifications sent by the bank, - take control of your mobile device. How can you protect yourself? - Use antivirus software on your phone and update it regularly. - Never install applications from outside the official store (for example Google Play). - Do not click on advertisements leading to supposed ad-blocking applications. - Stop the installation if a new application asks for additional access, e.g. to text messages, notifications or other access features. When you suspect that your phone has been infected If you notice suspicious behaviour on your phone (freezing, overheating, unexpected clicks): - disconnect your phone from the internet by enabling airplane mode, - immediately remove the suspicious application or consider restoring default settings, - contact us by calling our special helpline: (+48) 22 598 44 44 Available in the app and Millenet Open an account till 31.03.2026 Open an account till 31.03.2026 Promotion till 20.02.2026 Available in the app and Millenet Available in the app and Millenet Check out the offer Promotion till 20.02.2026 Promotion till 20.02.2026 The smart way to buy The smart way to buy The smart way to buy Discover all possibilities of BLIK mobile payments available in our mobile app: It's good to know as much as you can about how to be secure online, when you use your account or pay online, or even when you pick up the phone from a stranger. We have prepared 6 thematic quizzes for you. Test your knowledge of cyber security!"
}