{
  "url": "https://twiningsusa.com/pages/history",
  "title": "History – Twinings North America",
  "text": "The History of Tea and Twinings Explore over 300 years of Twinings’ innovation, creativity and masterblending expertise. For us, tea is more than just a drink. It's been part of our daily lives and the lives of generations of tea lovers. History 350 CE. The origins of tea in China The history of tea goes back at least two thousand years with many myths and legends about the origins of tea steeped into storytelling. One of the best-known legends about its origin dates back to 2737 BC when it is said Chinese Emperor Shen Nung accidentally discovered the drink when leaves from a nearby tree fell into a pot of boiling water during a picnic. However, the first real evidence of tea drinking comes from China's Yunnan province in 350 CE. Over the centuries that followed, China developed different methods for cultivating tea and developed different types: green, black and white. Tea became China’s national drink and by first millennium, the Chinese Tea house had become a focal point of Chinese social life. 1606. Tea arrives in Europe Tea was introduced to Europe when the Dutch established their trading port on the island of Java, Indonesia, and sent their first cargo of tea, by sea, to Amsterdam in 1606. Tea quickly became popular amongst the upper classes, including in Portugal, where Catharine of Braganza grew up. When she married Charles II in 1662, Catherine’s father, King John IV of Portugal, provided a dowry of luxury goods, including a chest of tea, which had become the favourite drink at the Portuguese Royal Court. Following Catherine’s arrival, it wasn’t long before tea became fashionable in the drawing rooms of the wealthier classes and court of England. As well as the chest of tea her sizeable dowry was the Portuguese colony of ‘Bom Bahia’ (Mumbai) on the western coast of India. King Charles II agreed to transfer control of Mumbai to the East India Company and it soon became its base. 1664. The East India Company Before 1600 Portugal controlled most European trade with India and the Far East, an area known then as the Indies, but in 1600 Queen Elizabeth I gave a Royal Charter to a new trading company, the East India Company (EIC), giving it a monopoly over all British trade with the Indies and therefore the only company licensed to sell goods, such as tea, into Britain. The EIC weathered various political storms and when Charles II was restored to the throne in 1660, the Company ingratiated itself with the King, who extended its privileges to allow the Company to take military action to establish itself in places where it wished to trade. In 1664 the EIC placed its first order for tea - for 100lbs of China tea to be shipped from Java for import into Britain. The Company was powerful overseas too, becoming an agent of British imperialism in South Asia and the de facto colonial ruler of large parts of India, where it used its private army to control several states and principalities. It maintained high prices and charged its tax collectors with extracting as much revenue from the local population as possible. It was gradually deprived of its commercial monopoly and political control following the Indian Uprising in 1857 and was formally dissolved in 1874. 1684. Twinings’ beginnings The Twining family originate from Gloucestershire where they held occupations as weavers and fulling millers. Despite their close ties with the countryside over many centuries, recession drove the family to London in 1684. Nine-year-old Thomas Twining, who would become the founder of the tea business, went with them. In London, he initially followed in his father's footsteps by taking up an apprenticeship with a London weaver. Attaining a trade was an essential to becoming a Freeman of the City of London - the key to any future business career. The ambitious young Thomas Twining became a Freeman in 1701 at the age of 26. By that time he had turned his back on weaving and was learning a new trade working for a wealthy merchant and handling some of the early shipments of tea. Thomas spent the next five years learning about this new trade and as the popularity of tea grew, he was fascinated by the business opportunities it offered. 1706. Tom’s Coffee House Coffee houses were incredibly popular meeting places for men in London, providing them with places to do business, socialize and drink. Thomas Twining saw this as a great business opportunity and purchased ‘Tom’s Coffee House’. The coffee house straddled the border between Westminster and the City of London, on the Strand, which was an area newly populated with the wealthy after the Great Fire of London in 1666. With approximately 2,000 coffeehouses in London offering an assortment of beverages including coffee, hot chocolate, rum, brandy and arrack, Thomas was keen to stand out from the competition, so introduced fine quality tea as a new offering. Tea was increasingly fashionable to drink and before long Thomas was selling more dry tea than wet. He sold dry tea to competitive coffee houses as well as wealthy households. Social norms of the time meant it was socially taboo for ladies to enter coffee houses, but they were keen to serve this new beverage in their drawing rooms, so they would wait outside Tom’s Coffee House in their carriages while their footman went in to buy the tea. 1717. The Golden Lyon Selling tea had become so popular, that by 1717 Thomas had acquired two adjacent houses enabling him to convert one into a shop specifically for handcrafted and blended teas alongside the Coffee House. Convention meant it was still not acceptable for ladies to enter coffeehouses, but it was acceptable to shop. In opening up this shop, Thomas was now able to sell his high-quality tea directly to his wealthy female customers, for whom drinking tea at home had become very fashionable. Thomas adorned the shop entrance with a gold painted lion, regal in nature and radiating class. The Golden Lyon Tea and Coffee House was born. This was probably the world's first dry tea and coffee shop. The same building is now number 216 Strand, the famous Twinings shop that still exists today. 1741. Daniel Twining takes over Thomas Twining died in 1741 and was succeeded by his son Daniel, who had also been his apprentice. As Twinings’ reputation continued to grow, so did the customer base. Daniel Twining established connections that led to Twinings’ first exports overseas. His ledgers show that in 1749, Twinings tea was being sold to America and the Governor of Boston was a loyal customer – though in 1773, when the Boston Tea Party dumped English tea in the harbour to protest against the British imposing taxation without representation, a local writer noted: “…it was not Twinings tea the Boston rebels tossed into the sea.” 1762. Mary Twining takes the lead History was made when Mary Twining, Daniel’s widow, took over the business. It was very unusual at the time for a woman to have this position. However, her tenacious character and business expertise enabled her to continue for to run Twinings for the next 21 years. During her tenure tea taxation peaked and it became common for tea to be smuggled into the country from France and Holland. Smugglers would tamper with the tea, mixing it with dry leaves, twigs and bark, reducing the quality and increasing the volume to maximise their profits. It’s been well documented that Mary wrote a journal, in which she listed her proudest achievement as not buying any smuggled tea and therefore having stuck to her commitment to only blend and sell the finest quality teas. 1783. Richard Twining Richard Twining took over from his mother in 1783. He soon became a prominent figure in the tea trade and became Chairman of the London Tea Dealers at a time when the smuggling and tampering of tea was high on the political agenda. Smuggling and tampering were rife, primarily because tea taxation was so high. Richard believed tea should be affordable for everyone, so took a proposal to the Prime Minister, William Pitt, to drastically cut the taxation of tea from 119% to 12.5%. He argued that lower tax would mean more sales and that high levels of duty only served to encourage smuggling. Pitt listened and he passed the Commutation Act of 1784, slashing tea taxes. Tea sales went through the roof and tea became the national drink in the UK, as it is today. The Commutation Act also committed the East India Company to importing enough tea to satisfy the domestic market regulated the price of its tea at a level which would cover its costs but not enable profiteering. Richard was himself a shareholder in the East India Company from 1793 and became a director between 1810 and 1817. During his time as director, some of the powers of the East India Company were curbed and its monopoly removed for trade in India. 1787. Twinings logo at The Strand The store entrance that you see today was commissioned by Richard Twining, Thomas Twining’s grandson. The two Chinese figures represent the origins of tea in China and the golden lion is a reference to Thomas Twining’s original dry tea and coffee shop, which was called The Golden Lyon. The lion is lying down as a sign of respect to Richard’s grandfather and the legacy he created. The Twinings logo, which is part of our historic entrance, is one of the oldest unchanged British commercial logos in continuous use in the UK. 1788. Boycotting sugar Sadly, at a time when the East India Company was exploiting resources in Asia, much of Britain’s economy was also linked directly or indirectly to the transatlantic trade of enslaved people, including through the activities of The Royal African Company. Thomas Twining himself made a personal investment in the Royal African Company in August 1723, selling his shares just over a month later. Investments of this kind were commonplace in the 18th century, thousands of individuals, both men and women, invested in the Royal African Company, from skilled tradespeople through to high society. Slavery is, and always has been, indefensible and towards the end of the century, attitudes towards the slave trade were thankfully changing. In 1788, the Society for Effecting the Abolition of the Slave Trade organised a nationwide effort to highlight the evils of the Atlantic slave trade. It called for British people to boycott goods produced by slaves in the West Indies, particularly the sugar often added to tea. It was one of the abolitionists’ most successful campaigns, with approximately 300,000 people boycotting sugar. Abolition became an election issue and public opinion towards the slave trade began to change. The slave trade was finally abolished in Britain in 1807. 1830s. The Legend of Earl Grey During a diplomatic mission to China, one of Prime Minister Charles Grey’s British envoys heroically saved the life of a Chinese mandarin. As a token of thanks, a gift of tea was given, alongside the recipe to reproduce it, which was usually a well-guarded secret. The envoy took the gift back to England and presented it to Grey. This new tea became so popular with Grey and his associates that in 1831 he asked Twinings to reproduce it and sell it on for others to enjoy. The blend became known as Earl Grey, named after Prime Minister Charles Grey II. “Twinings has been blending my family tea for years. Legend has it that my ancestor, the second Earl Grey, was presented with this exquisite recipe by an envoy on his return from China. He liked it so much he asked Richard Twining to recreate it for him. Generations of my family have enjoyed Earl Grey tea and today, I am proud to continue the tradition with the tea celebrated throughout the world known as Twinings Earl Grey.” – The 7th Earl Grey. 1837. Queen Victoria makes Twinings an Official Royal Warrant Holder In 1837, Queen Victoria granted Twinings our first Royal Warrant for tea – she appointed Twinings as supplier of teas to her household. Twinings has had the honour of supplying every successive British Monarch to date. 1860s. Supporting social reform Many generations of the Twining family were involved in supporting local charities and communities. In 1866, Elizabeth Twining turned her family home in Twickenham, Dial House, into an informal training school for impoverished girls who wanted to enter into service, as well as caring for retired domestic servants. She also established a provident hospital, St John’s, to provide medical care for those who could not afford a doctor. Whereas Elizabeth’s interest lay in the welfare of mothers and children, her sister Louisa was concerned with provision for the poor and elderly. Appalled by the conditions in the workhouses, she set out to spearhead reform and founded homes to care for the old and infirm. In 1893, she was elected the first female poor law guardian for Tunbridge Wells, one of a very small number of women to hold the position. She was also president of the local branch of the National Union of Women Workers and Lady of Grace of the Order of Jerusalem, placing her among the ranks of women like Florence Nightingale. 1899. Twinings first print advertisement Up until this point, Twinings had relied on its reputation to sell our teas. And while it had loyal customers, Arthur Tweed, Richard Twining III’s grandson, had an ambitious plan for growth. To reach more people and help tell the Twinings’ story, Arthur had the Company’s first ever print advertisement published. 1933. Twinings first blends our famous English Breakfast As Twinings continued to expand its portfolio of teas, there was an opportunity to create a blend that was specifically designed to be enjoyed with breakfast. The Company wanted to develop a ‘stronger’ tea to complement the stronger flavours of breakfast, for example, bacon, so the English Breakfast blend was launched! Twinings first tea and food pairing, which is still a best seller today. 1939. Keeping spirits high during World War II During World War II, rationing of food and drink, including tea, was put into place. Twinings supplied tea for Red Cross prisoner of war parcels and the Women’s Voluntary Service. YMCA’s mobile wartime canteens also served our tea to troops, rescue workers and victims of bombing raids. This brought people together and provided moments of much needed relief during the difficult war-time years. 1956. Twinings makes tea bags for the first time In the UK, customers preferred to drink their tea using loose leaves. However, across the Atlantic Ocean our North American customers demanded something different, so Twinings created its first ever tea bags. 1972. Twinings broadens its offering While visiting new markets, Sam Twining, our Export Director, noticed that in many countries herbal infusions were much more popular than green and black teas. With his passion to make Twinings appeal to everyone, Sam was inspired to create a new herbal offering and our herbal filter bags were launched. The initial range consisted of just five blends but over time we have continue to expand and evolve this offering and now have over a hundred infusions in the Twinings portfolio. 1982. The Tea Caddy at Disney Twinings has a long-standing relationship with Disney that’s steeped in collaboration, and Twinings products have been featured in the Tea Caddy since the location opened at EPCOT®. Located in the United Kingdom pavilion at the World Showcase, the Tea Caddy features a wide selection of Twinings tea, accessories, and other British favourites. 1994. Twinings Launches Lady Grey® Twinings first blends its exclusive Lady Grey® tea – a softer, more elegant version of the original Earl Grey tea developed by Richard Twining in 1831. It’s a delightful blend that’s lighter & brighter, as it uses dried orange and lemon peel with just a hint of bergamot flavour. 1997. Ethical sourcing Tea supply chains are complex and there is work to be done to improve the lives of tea workers, their families and their communities. That’s why in 1997 Twinings became a founding member of the Ethical Tea Partnership, an organisation working to create a fairer, more sustainable tea industry for tea workers, farmers, and the environment. 2006. Twinings partners with Keurig® to Launch K-Cup® Pods Twinings partners with Keurig® to produce K-Cup® Pods for the first time, introducing a fresh new way to brew the perfect cup of tea. Ready in seconds, it’s a super convenient way to enjoy your tea, with the same great taste as teabags. 2016. Launched Sourced with Care In 2016, Twinings launched Sourced with Care, its responsible sourcing programme, which aims to improve the lives of the communities who grow its tea and herbs. Together with NGOs, supply chain partners, industry associations, workers and farmers, the brand supports the empowerment of women and young people, and work towards enabling access to water and sanitation, protecting workers’ rights and improving incomes. Find out more: Social Impact team. 2018. Launch of Wellness Teas In 2018 Twinings launched a range of wellness teas, focusing on wellbeing attributes that come from the goodness of herbs. Brilliantly blended by our Master Blenders to support everyday well-being, these blends taste delicious and are beneficial for you at the same time. 2019. Spotlight on Saturday Night Live Twinings also steps into the spotlight when SNL features “Twinings Extreme” in a cut for time sketch. In this commercial parody, sport-loving Brits finally have a tea that’s as active as they are with a new line of Twinings products specifically made for high-energy English athletes. 2021. Twinings Line of Superblends® Teas, Supported by “Drink in Life” Campaign Twinings launched its new “Drink in Life” campaign, bringing vibrancy and positivity to wellbeing drinks and inviting consumers to share in the optimism of our reinvigorated brand. Showcasing our new Superblends® collection, “Drink in Life” demonstrates how these products help consumers feel good, live well, and enjoy life. Superblends®Teas + Vitamins expand Twinings’s wellbeing offering with a new range of delicious teas fortified with vitamins or functional additives to help people enhance their everyday lives without compromising on great taste. 2024. Twinings granted His Majesty The King’s Royal Warrant We are delighted to confirm that we have been granted His Majesty The King’s Royal Warrant. We were awarded our first warrant in 1837 and have had the honour of supplying tea to every successive British Monarch since. Twinings Today More than 300 years later, passion for tea remains - and so do we. We still sell tea from Thomas' shop on the Strand in London. We take pride in continuing to bring the most exciting new blends to tea lovers around the world. Now, we have over 500 varieties and our teas are cherished worldwide. Each blend is developed at our global headquarters near London, where our expert Master Blenders taste more than 3,000 cups of tea every week. With over 250 years of combined experience, our nine Master Blenders are responsible for buying, blending, and tasting each blend for consistency and quality so that you can be sure the next cup you sip will be every bit as good as the one yesterday or the day before. From our facilities near London, our Master Blenders work closely with global New Product Development teams to ideate and create the next generation of tea and botanical beverages to delight consumers around the world. From this central hub, our teams constantly review the world tea markets, working with suppliers and ultimately with our state-of-the-art manufacturing plant in Poland to ensure the best quality tea is delivered to our customers."
}