{
  "url": "https://www.musictimes.com/articles/99998/20240125/melanie-safka-cause-death-singer-unexpectedly-dies-76-recording-new.htm",
  "title": "Melanie Safka Cause of Death: Singer Unexpectedly Dies at 76 While Recording New Project",
  "text": "\"Brand New Key\" and \"Lay Down (Candles in the Rain)\" songstress Melanie has died at the age of 76, her three children confirmed. In an announcement posted on Facebook, Melanie's three kids Lelilah, Jeordie and Beau Jarred delivered the heartbreaking confirmation about the matriarch's passing. Her record label, Cleopatra, and publicity firm, Glass Onyon PR, also disclosed the news in separate statements. Melanie Safka Dead at 76 Melanie, born Melanie Safka, reportedly died on Tuesday, January 23. \"We are heartbroken, but want to thank each and every one of you for the affection you have for our Mother, and to tell you that she loved all of you so much!\" Melanie's children wrote. \"She was one of the most talented, strong and passionate women of the era and every word she wrote, every note she sang reflected that.\" They added, \"Our world is much dimmer, the colors of a dreary, rainy Tennessee pale with her absence today, but we know that she is still here, smiling down on all of us, on all of you, from the stars.\" Melanie's cause of death was not disclosed to the public, though her children mentioned she had an illness before her death. Her label added that she had been working on her new cover songs in the studio in the weeks prior to her demise, and the project was scheduled to be part of her 32nd album, \"Second Hand Smoke.\" To honor the late songstress, the children asked everyone to light a candle in honor of the singer on January 24 at 10 p.m CT. Fans took to X to express their heartbreak over the loss. One said, \"rest in peace melanie safka, a beautiful soul who blessed us all. i urge everyone to listen to the art she created.\" \"Rest in peace, Melanie Safka. Another of the greats is gone,\" another wrote, while a third added, \"I'm sad to hear the Melanie Safka has passed away. I've always loved her voice and thought she should have been known for so much more than 'Brand New Key.'\" Melanie's decades-old of career reached an all-time high when she released \"Lay Down (Candles in the Rain)\" in collaboration with the Edwin Hawkins Singers. She immediately followed it up with \"Brand New Key,\" her only other top 10 hit in the U.S. © 2026 MusicTimes.com All rights reserved. Do not reproduce without permission."
}