{
  "url": "https://www.bordeaux.com/en/appellations/entre-deux-mers/cadillac-cotes-de-bordeaux/",
  "title": "Cadillac Côtes de Bordeaux : vin rouge de l’Entre-deux-mers",
  "text": "Cadillac – Côtes de Bordeaux, a heartwarming wine Nestled in the Grandes Côtes region along the Garonne River, the Cadillac – Côtes de Bordeaux PDO is located on an outstanding sunny terroir combining traditional expertise and authenticity. Its elegant and fruity red wines are the perfect reflection of this – generosity through and through. What is the Cadillac – Côtes de Bordeaux wine region? Key points to remember - 1,247 hectares, 39 communes and 138 estates, often passed down from one generation to the next. - An ocean of vines which stretch out on the Right Bank of the Garonne River, southeast of Bordeaux on magnificent sundrenched slopes. This dramatic landscape and microclimate moderated by the river form the perfect duo for creating well-balanced wines. Historic châteaux, Romanesque churches and elegant mansions complete the picture, offering a feast for the eyes. - A heritage straight from the Premières Côtes de Bordeaux region, officially named Cadillac – Côtes de Bordeaux in 2009 Why do people love Cadillac – Côtes de Bordeaux and its wines? - Because its authentic, easygoing and attractive wines are perfect for get-togethers with family and friends - Because they reflect the warm and friendly spirit of the region - Because high-quality is always guaranteed, without breaking the bank - Because behind these bottles lie passionate winegrowers who pay attention to every detail - Because the views from the vineyards, overlooking the Garonne River, will make you never want to leave! - Because between two tastings or visits to estates, you can step back in time and admire Château Ducal de Cadillac, Château de Langoiran or the village of Rions What is the Cadillac – Côtes de Bordeaux style? It is plain to see from the very first sip: these wines are easygoing and delicious, marked by fruity nuances and the smoothness of Merlot. The epitome of Bordeaux hospitality Fruity, round and underpinned by smooth tannins, Cadillac – Côtes de Bordeaux wines offer a lovely balance between generous finesse and elegance. Aromas of cherry, plum and ripe red fruit bestowed by Merlot mingle with hints of blackcurrant, pepper, graphite and licorice imparted by Cabernet Sauvignon. Whatever the occasion, these wines are guaranteed to please Which kind of wines can be found in Cadillac – Côtes de Bordeaux? Red wines and nothing else. Merlot, the PDO’s star grape variety, provides well-balanced fruitiness and sweetness. Cabernet Sauvignon adds structure to the wines, while its firm tannins ensure good aging potential. Lighter Cabernet Franc brings its own touch of freshness and finesse. On the rare occasion that Petit Verdot is included, it enriches the blend with its color and complexity. Fun Facts Three fun facts you need to know about Cadillac – Côtes de Bordeaux Something to surprise your family and friends during your next wine tastings! 1. In the Middle Ages, the region’s wine trade flourished thanks to the Garonne River, so much so that it was named “the Garonne effect”. 2. The “Cadillac” grafting technique was invented here. This method ensured the successful development of American rootstocks, which played a decisive role in saving the vines from the phylloxera crisis in the second half of the 19th century. 3. The appellation and its estates are easily accessible from Bordeaux: by train from Bordeaux Saint-Jean station, by bike via the dedicated cycle path or even by boat – the choice is yours! Sustainable tourism has never been so simple… or enjoyable! Let’s talk about the soil The Cadillac – Côtes de Bordeaux vineyards lie atop a patchwork of clay-limestone slopes, deep clay soils and gravelly rises benefiting from ideal sun exposure and overlooking the Garonne River. En voir plus This clever mix gives the vines everything they need to thrive, and shapes the unique aromatic signature of each wine in the appellation. Let’s travel back in time This is one of the oldest vineyards in Bordeaux whose history is intertwined with that of the vineyards on the Right Bank of the Garonne over the centuries. En voir plus More precisely, vines have been grown here from the Gallo-Roman period but it wasn’t until the Middle Ages that winegrowing really took off. The reason? The English appetite for local wines. And when the Dutch also became fans of these delicious wines in the 17th and 18th centuries, the region’s wine economy flourished once again. The PDO was officially founded in 1937 when the high quality of its terroirs was recognized."
}