{
  "url": "https://exame.com/tecnologia/examelab/como-usar-o-whatsapp-web/",
  "title": "WhatsApp Web: como escanear o código QR e usar [tutorial fácil] | Exame",
  "text": "Última atualização em 20 de junho de 2024 às 14h06. O WhatsApp, um dos aplicativos de mensagens mais populares do mundo, oferece duas opções para utilizá-lo no computador: o WhatsApp Web e o WhatsApp Desktop. Essas alternativas são ideais para facilitar a comunicação durante o trabalho ou até mesmo para quem gosta de navegar ou jogar enquanto conversa. Se você ainda não conhece essas soluções ou está cansado de depender do celular o tempo todo, confira este guia para aprender como usar o WhatsApp no PC. Como usar WhatsApp Web Para usar o WhatsApp com a versão Web é preciso fazer a leitura do QR Code disponibilizado pelo mensageiro no navegador, no endereço http://www.web.whatsapp.com. O processo é feito usando a câmera do celular, que deve ser apontada para a tela do computador. Para entrar no WhatsApp Web, acesse as configurações do app, abra a seção “Aparelhos conectados” e selecione a opção “Conectar um aparelho”. A câmera será aberta e você poderá fazer a leitura imediatamente. Abaixo, você confere o passo a passo detalhado: WhatsApp Web: acesse o site web.whatsapp.com diretamente pelo navegador (Chrome, Microsoft Edge, Firefox ou Safari). Ou baixe o app para computador em whatsapp.com/download e clique em \"Baixar para Windows ou Mac\" para obter o aplicativo. Abra o WhatsApp no seu celular e toque no ícone de menu (três pontos ou linhas) no canto superior direito. Selecione a opção \"WhatsApp Web\" ou \"WhatsApp Desktop\", dependendo da versão que você estiver usando. Toque em \"Escanear QR Code\" e aponte a câmera do celular para o código QR exibido na tela do computador. Aguarde até que o código QR seja escaneado e a autenticação seja concluída. Agora você está conectado ao WhatsApp no seu PC. Aponte a câmera para escanear o QR Code exibido no WhatsApp Web (Foto/Reprodução) 1/10 (Kenza Layli: \"Criadora de conteúdo gerado por IA, focada no empoderamento feminino em Marrocos e no Oriente Médio\".) 2/10 (Aliya Lou: \"Artista de performance, afro-brasileira e japonesa, representando narrativas da diáspora africana.\") 3/10 (Olivia C: \"Viajante digital baseada em Portugal, demonstrando a integração positiva entre humano e digital\".) 4/10 (Anne Kerdi: \"Promotora da região francesa da Bretanha, destacando a utilidade da IA em várias formas de mídia\".) 5/10 (Zara Shatavari: \"Defensora da saúde feminina, desenvolvendo um sistema de auto diagnóstico baseado em IA\".) 6/10 (Aiyana Rainbow: \"Voz da comunidade LGBT, promovendo diversidade e inclusão\".) 7/10 (Lalina: Criada com visão artística, protege sua propriedade intelectual enquanto promove compreensão entre culturas.) 8/10 (Seren Ay: Embaixadora da marca na Turquia, desafiando papéis de gênero e promovendo a cultura turca.) 9/10 (Asena Ilik: \"Demonstrando que influência pode ser gerada sem objetificação, com uma personalidade única e distinta\".) 10/10 (Eliza Khan: \"Uma das pioneiras como influenciadora de IA em Bangladesh, promovendo inclusão e harmonia social\".) Como funciona o WhatsApp Web e Desktop É importante destacar que tanto o WhatsApp Web quanto o WhatsApp Desktop dependem do celular estar conectado à internet. Ao contrário de aplicativos como o Telegram, que armazenam as imagens na nuvem e sincronizam com os dispositivos vinculados à conta, o WhatsApp armazena as mensagens no telefone e as espelha no WhatsApp Web ou Desktop. Dessa forma, para que os dois aplicativos funcionem corretamente, é necessário que o seu celular esteja conectado à internet, independentemente se está na mesma rede Wi-Fi do computador ou não. No entanto, o WhatsApp está testando, em versão beta, o recurso de login em múltiplos aparelhos, o que permitirá utilizar o WhatsApp Web ou Desktop sem a necessidade do celular estar conectado. Fique atento às atualizações do aplicativo para saber mais sobre essa novidade."
}