{
  "url": "https://en.m.wikipedia.org/wiki/Dory_(Finding_Nemo)",
  "title": "Dory (Finding Nemo) - Wikipedia",
  "text": "Dory (Finding Nemo) Dory is a fictional blue tang fish and a major character of Pixar's animated film series Finding Nemo. Her personality combines childlike optimism and ditziness, a stark contrast to the stern personality of the first film's protagonist, Marlin. She suffers from short-term memory loss and she is a multilinguist, having the ability as a fish to read human writing and whale speech. The character is voiced by Ellen DeGeneres. Various merchandise of the character have also been produced, including action figures and toys produced for McDonald's Happy Meals.[2] Production history [edit]Casting [edit]Dory was initially supposed to be a male character during the pre-production of the film. Andrew Stanton admitted that he struggled with a writing block upon the character until he overheard his wife watching Ellen. Stanton was impressed with Ellen DeGeneres' ability to speak many different subjects within a few minutes, leading to the casting of DeGeneres.[3] During production of Finding Nemo, the producers developed concerns about DeGeneres's ability to cue dramatic lines and deliver performances. Upon the first take of Dory's speech for Marlin to not leave her, DeGeneres's first take was so emotionally rich that the producers used it in the film.[4] DeGeneres would credit Stanton for producing the character with her personality in mind, particularly for her motto \"Just keep swimming.\" DeGeneres utilizes the quote as a philosophy of persistence in her career, particularly after facing her sitcom Ellen being cancelled by ABC.[5] Appearances [edit]Finding Nemo [edit]Dory first appears in the film when she accidentally bumps into Marlin while he was chasing after a diver that captured his son, Nemo. Dory recalls seeing such a boat and offers Marlin to follow her direction towards the boat. Unknowingly to Marlin, Dory forgets her objective and flees from Marlin thinking he is stalking her. After Dory yells at Marlin to stop following her, Marlin confusingly tells her about the boat again, causing Dory to repeat the same offer before Marlin tells Dory that she already told him that. Dory apologizes and reveals she has short-term memory loss. The two encounter Bruce, Anchor, and Chum, three sharks who have sworn to not eat fish. Marlin finds a mask during their meeting to read its address, but he and Dory fight for it until he accidentally hits her with it. Her blood's scent sends Bruce into a frenzy and he accidentally sets off naval mines that knock Marlin and Dory unconscious. The two then flee from a falling submarine while the mask falls into a deep trench. Marlin blames Dory for losing the mask, but Dory attempts to cheer him up with a song as they swim into the trench to find it, where they get attacked by an anglerfish. Dory finds the mask during the chaos and memorizes the address before the anglerfish runs into the mask while chasing Marlin. The two ask a school of moonfish for directions to the East Australian Current. Before they venture, the moonfish tell Dory to go through an upcoming trench rather than over it. Marlin fears the trench's frightening appearance, but Dory insists on following the moonfish school's orders. However, the two go over the trench after Marlin tells Dory that there's something shiny and find themselves in a forest of jellyfish. Marlin persuades Dory to a race to escape the jellyfish forest, but forgets about the safety of Dory, forcing Marlin to save her and leaving them stung immensely. A turtle named Crush rescues the two fish and takes them to the East Australian Current with a group of sea turtles. After Marlin explaining his quest to find his son, Crush's son, Squirt, pushes Marlin and Dory to their Sydney exit, but the two get lost and are swallowed by a giant whale. Marlin attempts, but fails to break through the whale's baleen, but Dory gleefully swims, oblivious that they're inside a whale. Dory comforts a sobbing Marlin and motivates him that they will find Nemo. Dory asks the whale about what it's doing, leading to the whale lifting its tongue. As Marlin and Dory hang onto the tongue, Dory attempts to communicate to the whale, which infuriates Marlin into shouting at her. Dory lets go of the whale's tongue after hearing the whale vocalize, but Marlin grabs her. Dory tells Marlin the whale is asking them to let go, but Marlin asks Dory how she knows anything bad wouldn't happen. After Dory says that she's uncertain about what would happen, Marlin lets go of the whale's tongue, which leads to the two getting blown outside the whale through its blowhole into Sydney, revealing that Dory understood whale language. Marlin and Dory meet Nigel the pelican, who knows about Nemo and offers a ride to his location, which they do after a swarm of seagulls attempt to eat them. The three travel to the office of dentist Philip Sherman, who is the diver that captured Nemo. After a scuffle with Sherman to prevent Nemo from getting thrown away, Marlin and Dory fearfully see Nemo's body upside down and believe that he's dead, which is interrupted as Sherman puts Nigel out of the dentist room. Nigel apologizes about the loss of Nemo, which leads Marlin to gloomfully thank Dory for her help while attempting to leave. Dory pleads Marlin to not leave her and keep her as a friend, especially after being alone for much of her life. She thanks Marlin for being able to remember better and tells him that she doesn't want to forget. Marlin regretfully tells Dory he wants to forget the entire journey, and thus heads back home. Dory panics in loneliness until she meets Nemo. Though she initially forgot who he was, she remembers after reading a logo on a pipe and returns him to Marlin until she gets captured in a fishing net alongside a school of groupers. Nemo and Marlin get the fish to break free from the net and rescue Dory by swimming down. Nemo was injured after the net fell down but gets back up after Marlin tells him about his and Dory's adventure. Dory is eventually guided to Marlin and Nemo's reef by Bruce and his shark club, to which she agreed to be a part of. As Nemo goes to school, Dory waves Nemo goodbye alongside Marlin. Finding Dory [edit]Through flashbacks, it is revealed that Dory got separated from her parents, Jenny and Charlie, as a child and eventually forgot about them due to her short-term memory loss, then joined Marlin to find Nemo. One year after meeting Marlin and Nemo, Dory is living with them in their reef. During a field trip in Nemo's class, Dory has a flashback about her parents, only to be swept away by a school of eagle rays. After Nemo mentions Morro Bay, California, Dory goes on a quest to find her parents. Dory, Marlin, and Nemo ride Crush through the California Current to their destination, where they explore a shipwreck full of cargo. Dory accidentally awakens a giant Humboldt squid while attempting to call for her parents, but the three trap it in a large shipping container just before it devoured Nemo. Marlin berates Dory for endangering them, saddening Dory until she hears the voice of Sigourney Weaver through an aquarium loudspeaker, causing Dory to surface to seek help until she gets captured by staff from the Marine Life Institute. Dory is placed in quarantine and tagged. She meets a grouchy seven-legged octopus named Hank. Dory's tag marks her for transfer to an aquarium in Cleveland, Ohio. Hank, who fears being released back into the ocean, agrees to help Dory find her parents in exchange for her tag. In one exhibit, Dory encounters her childhood friend Destiny, a nearsighted whale shark who used to communicate with Dory through pipes, and Bailey, a beluga whale who mistakenly believes he has lost his ability to echolocate. Dory begins having more flashbacks of life with her parents while Hank attempts to locate Dory to her former aquarium habitat. Those flashbacks include how she learned her motto \"just keep swimming\" and her interest in shells. Her short-term-memory loss often causes frustration to Hank due to quest prolonging Hank's desires of going to Cleveland, which makes him threaten Dory to take away her tag. After a day's worth of searching for Dory's habitat, Hank would finally bring Dory to her destination, and Dory would give Hank the tag to Cleveland. While in the habitat, Dory notices her parents are gone, which reminds her why she went lost in the first place: she was pulled away by an undertow current out into the ocean while she was getting a shell to cheer up her mother. After being told by a hermit crab that her species was being held in the aquarium's quarantine, Dory would go through the same pipe that swept her away, to which she would eventually reunite with Marlin and Nemo searching for her. Destiny and Bailey would attempt to guide the trio into the aquarium's quarantine, which the other blue tangs tell them that Dory's parents escaped from the institute a long time ago to search for her, only for them to never come back. This startles Dory to believe that they have died. Hank retrieves Dory from the tank while confused on if Dory reunited with her parents as the blue tangs and clownfish are loaded in a truck to be relocated to Cleveland. He is then caught by one of the employees and unintentionally drops Dory into the drain, flushing her out to the ocean. While wandering aimlessly, she comes across a trail of shells; remembering that her parents had set out trails to help her get back home, she follows it to an empty tire, where she reunites with her parents. Dory apologizes for her mistakes, to which her parents dismiss by telling Dory it was her unique personality that got them reunited. They also tell her they spent years laying down the trails for her to follow in the hopes that she would eventually find them. Dory and her parents go back to the institute to save Nemo, Marlin, and Hank from a truck that's transporting them to Cleveland, with Destiny and Bailey helping them. Once onboard the truck, Dory persuades Hank to return to the sea with her, and together, they hijack the truck and crash it into the sea, freeing all the fish. Dory, along with her parents and friends, return to the reef. Hank begins to adapt a happy lifestyle in the ocean and also becomes a substitute teacher for Nemo's school as Mr. Ray goes on migration. Dory goes to the same drop-off that Nemo got captured, where Marlin praises Dory for her accomplishments in finding her parents as they together gaze at the ocean. Environmental impact [edit]Dory's species, the blue tang, saw a spike in sales among fish owners and aquarists after the release of Finding Nemo. Despite the popularity, all blue tangs in captivity are wild-caught, leading to concerns of overfishing for the pet-trade. In-line with the release of Finding Dory, the University of Florida's Tropical Aquaculture Laboratory managed to successfully breed blue tangs in human care. Despite hopes of reaching mainstream accessibility, this form of care is currently not available to public aquarists.[6] Reception [edit]Dory has become the most popular character in the Finding Nemo franchise. Her cheerful and ditzy personality, as well as her comedic moments, proved very popular with audiences. Dory has also been praised for her sympathetic, dramatic moments, particularly when she attempts to sympathize with a depressed Marlin before he leaves her after failing to rescue Nemo before his supposed 'death'.[7] Many disability organizations have documented on Dory's short-term memory loss, particularly on how disabled individuals and their peers are represented. The Disability Visibility Project and others have praised Dory for her disability being portrayed as integral to the character as opposed to a weakness that must be overcome, as evident in how characters respond to Dory.[8] Dory's concern of her disability objecting herself is put down by her parents telling her that it was her actions and character that define who she is as a person.[9] Although Dory has anterograde amnesia, organizations such as the Autism Awareness have likened her personality and characteristics to people exhibiting traits of autism or ADHD. Examples include Dory being unaware of basic social cues[10] being akin to autism, her fixation on specific tasks such as translating a mask's writing being akin to ADD. The Society for Disability Studies described Dory's disability as being a core element of her character as a progressive representation in mainstream animation, but also noted her peers describing her abilities as a person among her disability as a traditional portrayal that a character is overcoming a disability. For her performance as Dory, Ellen DeGeneres won the Saturn Award for Best Supporting Actress[11] and was nominated for the Chicago Film Critics Association Award for Best Supporting Actress. In 2016, DeGeneres would get a nomination for best voice performance from the Washington D.C. Area Film Critics Association Awards. References [edit]- ^ \"Dory Voices (Finding Nemo) - Behind The Voice Actors\". - ^ \"McDonald's Finding Nemo Happy Meal toy promo\". May 2003. - ^ \"Pixar Movies: 9 Behind-The-Scenes Facts About The Making Of The Studio's Films\". GamesRadar. 25 December 2022. Retrieved 25 December 2022. - ^ Ben Sherlock (21 February 2020). \"Just Keep Swimming: 10 Behind-The-Scenes Facts About Finding Nemo\". ScreenRant. Retrieved 21 February 2020. - ^ Raphael Chestang (20 November 2015). \"EXCLUSIVE: Ellen DeGeneres says 'Finding Nemo' came along at her lowest point\". AOL. Retrieved 20 November 2015. - ^ RET TALBOT (19 July 2016). \"'Dory' Bred in Captivity for First Time\". National Geographic. Archived from the original on February 26, 2021. Retrieved 19 July 2016. - ^ Michael Canva (16 June 2016). \"Why Dory is one of Pixar's most popular characters\". The Washington Post. Retrieved 16 June 2022. - ^ Wong, Alice (June 27, 2016). \"Finding Dory, Disability Culture, and Collective Access\". Disability Visibility Project. Retrieved June 27, 2016. - ^ Holcomb, Jeanne; Latham-Mintus, Kenzie (August 18, 2022). \"Disney and Disability: Media Representations of Disability in Disney and Pixar Animated Films\". Society for Disability Studies. Retrieved August 18, 2022. - ^ Macdonald, Christie (July 4, 2016). \"The Lessons I Learned From Dory\". Autism Awareness. Retrieved July 4, 2016. - ^ \"Academy of Science Fiction, Fantasy & Horror Films, USA\". IMDb."
}