{
  "url": "https://www.northeastshooters.com/xen/threads/beretta-al-2-20ga-problems.270440/",
  "title": "Beretta AL-2 20ga problems | Northeastshooters.com Forums",
  "text": "Sorry this is kind of long. I recently retrieved my Beretta AL-2 20 gauge from my Dad. We're moving to a 25 acre lot in the Blue Ridge and I want to do some clay shooting, so I took it back from him. As far as I know it hadn't been shot or cleaned in 30+ years. I field stripped it, cleaned it and took it out for a few rounds near his house and it cycled just fine. We were shooting some decades-old shells from his closet; I don't remember what the specs were. I THINK they were at least 1 oz dram eq but I'm not sure. Got it back home and went clay shooting with a neighbor, still using some of those old shells. It ran fine until I ran out, and my neighbor gave me some of his target reloads. It went into single shot mode. We figured it just wasn't set up for his light loads. So I ordered a couple cases of Winchester Super X Game loads, 7/8 dram, 7 1/2 shot and took it out for another trial. Same thing happened. It cycled the few remaining old shells I had left, but wouldn't cycle with the new stuff. I read up on it some and decided to pull the recoil spring, thinking I might find it dry and/or all gunked up. It wasn't too bad, but there was some hardened stuff, kind of like varnish, on the spring guide. I cleaned it up, oiled the spring, and re-lubricated all the sliding parts inside. But it just didn't seem to be in bad enough shape to keep it from cycling. I'll be testing it again tomorrow. So here's the question: if it still won't cycle, I am considering clipping the recoil spring. Is this a bad idea? Information on this particular model is very hard to come by; Beretta doesn't even have manuals anymore. Anybody here know anything else I might try? Edit to add: I realize that one obvious answer is to just use hotter loads. But my new ammo is pretty standard stuff and I feel like it should run it. If not I would love to be educated. I recently retrieved my Beretta AL-2 20 gauge from my Dad. We're moving to a 25 acre lot in the Blue Ridge and I want to do some clay shooting, so I took it back from him. As far as I know it hadn't been shot or cleaned in 30+ years. I field stripped it, cleaned it and took it out for a few rounds near his house and it cycled just fine. We were shooting some decades-old shells from his closet; I don't remember what the specs were. I THINK they were at least 1 oz dram eq but I'm not sure. Got it back home and went clay shooting with a neighbor, still using some of those old shells. It ran fine until I ran out, and my neighbor gave me some of his target reloads. It went into single shot mode. We figured it just wasn't set up for his light loads. So I ordered a couple cases of Winchester Super X Game loads, 7/8 dram, 7 1/2 shot and took it out for another trial. Same thing happened. It cycled the few remaining old shells I had left, but wouldn't cycle with the new stuff. I read up on it some and decided to pull the recoil spring, thinking I might find it dry and/or all gunked up. It wasn't too bad, but there was some hardened stuff, kind of like varnish, on the spring guide. I cleaned it up, oiled the spring, and re-lubricated all the sliding parts inside. But it just didn't seem to be in bad enough shape to keep it from cycling. I'll be testing it again tomorrow. So here's the question: if it still won't cycle, I am considering clipping the recoil spring. Is this a bad idea? Information on this particular model is very hard to come by; Beretta doesn't even have manuals anymore. Anybody here know anything else I might try? Edit to add: I realize that one obvious answer is to just use hotter loads. But my new ammo is pretty standard stuff and I feel like it should run it. If not I would love to be educated. Last edited:"
}