{
  "url": "https://techcommunity.microsoft.com/blog/spblog/top-10-most-important-powers-of-your-sharepoint-team-sites-in-office-365/355598",
  "title": "Top 10 most important powers of your SharePoint team sites in Office 365",
  "text": "Keep team members—internal and external—connected to important people and information. How? Create a group-connected SharePoint team site in Office 365 – and use it. It’s yours to squeeze as much power and value out of based on what you are trying to accomplish – which at the base level is to keep everyone informed and moving in the right direction: forward. This blog is a ‘what’s possible today’ guide to best use and configure your SharePoint team site to collaborate on rich content, share reports with partners, have conversations with your team, keep track of events, manage tasks, and more—from virtually any device. You’ll find lots of visual screenshots and links to further learn ‘how to’ accomplish each important power. On to the first important power for SharePoint team site. #1 | Create a SharePoint team site in seconds You can create group-connected SharePoint team sites in seconds. BOOM! When you create a group, Office 365 gives the group a shared inbox, a calendar, a OneNote notebook, a default place for files (the team site document library), Planner for task management—and now a modern team site with pages, lists, libraries and team news – all to help the group collaborate, communicate and move things forward. Create SharePoint team sites connected to Office 365 Groups by clicking the Create site button on the SharePoint home page in Office 365 [https://tenantName.sharepoint.com/_layouts/15/sharepoint.aspx]. A two-step creation wizard will fly out from the right. Step one: Enter the title of the team site, select whether the group will be public or private, choose the site classification & preferred language, and then click Next. Step two: Enter the owners and members, click Finish and you’re done. A modern SharePoint team site is provisioned and ready for use in seconds, along with all the other group apps to improve teamwork all up. Learn more about creating a SharePoint team site in Office 365. #2 | Your site, your brand You can quickly and easily customize the look of your SharePoint site to reflect your professional style and brand. You can choose one of the default SharePoint themes and customize it as needed, choose a company theme with approved branding for your company, or use one of the classic experience designs. Site headers allow adjustment of layout options, logo and background choices. Site footers allow logo, text and links to be added to the bottom of pages. And if you wish to operationalize how sites get created, you can leverage custom site themes and site designs with powerful scripting capabilities. Create your custom team site. Set up a team site that suits your team best. Customize your site to make it your own – adjusting style and colors and adding logos. You can even add videos, slide shows, and more to the home page by using the out-of-box web parts. Learn more how you can “change the look” of your SharePoint site in Office 365 #3 | Turn on and use external sharing If your organization performs work that involves sharing documents or collaborating directly with vendors, clients, or customers, then you can use the external sharing features of SharePoint Online to share content with people outside your organization. An external user is someone from outside your Office 365 subscription to whom you have given access to one or more sites, files, or folders. There are several ways to control which sites can share externally and it can all be tracked and reported. When you need it, let people outside your organization access only the files you want them to view, download, or share. Use your site to more efficiently share reports with partners or connect with customers so they, too, can access your shared content whether they are online or on the go. Quick personal work story: Chris McNulty and I set up an internal, private group-connected SharePoint team site to use as we plan and execute on The Intrazone podcast for our bi-monthly episodes. We work with our core production team (long-term external vendors), each guest of the show (both internal and external to Microsoft), and ourselves. This means we all gain access and can share planning notes in our OneNote, chat via Microsoft Teams, review pre-published audio, build out per show graphic assets – and we use the SharePoint team site as our front door to anyone in the company to learn more about the show (this is set to view-only to the everyone at Microsoft AAD attribute); and it’s associated to our SOY (SharePoint – OneDrive – Yammer) hub site - check it out below. Learn more about external sharing for SharePoint in Office 365. #4 | Connect your existing team site to a new Office 365 group (groupify) and add an instance of Microsoft Teams (teamify) If your SharePoint team site does not yet have super powers from other integrated apps – you’re near-literally two clicks away – one click to groupify, one click to teamify. Be a two-click wonder – and become a team hero! Groupify | Modernize your existing SharePoint team sites by connecting them to new Office 365 groups. If your site is not yet group connected, you’ll see Connect to new Office 365 group in the gear icon menu in the upper-right of your site. Click it, and step through an easy set up wizard – like if you’re creating a new SharePoint team site from SharePoint home as described above. Being able to connect an Office 365 group to an existing SharePoint site is important if you want to modernize that site and provide additional group capabilities to all team members. In addition to using modern pages, lists and libraries already available in your classic sites, once you have connected your site to an Office 365 group, it can benefit from all other shared group-connected apps such as Outlook for a group inbox and calendar, Planner for task management, OneNote for team meeting notes and more. Teamify | Create a Team for your group-connected SharePoint team site. If your group-connected team site is not connected to Microsoft Teams, the hub for teamwork, then it’s just one click away with the new Create a Team button that appears on the bottom-left corner of your site (you can dismiss this, and it will go away once you’ve teamified). The next top most important power (#5) dives into all the things you can do with SharePoint inside of Teams post teamification. 😊 So groupify and teamify today; find the joyify in working better together. Learn more about connect a classic SharePoint team site to a new Office 365 group. Learn more about how to create a Teams instance for a SharePoint group-connected team site #5 | SharePoint + Microsoft Teams FTW! Now, once SharePoint and Microsoft Teams are connected – the collaboration world is your oyster with pearls a’plenty. SharePoint connects the workplace and powers content collaboration. Microsoft Teams is the hub for teamwork. Together, SharePoint and Teams are greater than the sum of their parts. You can accomplish use cases beyond file sharing, including shared news, lists, and apps – all with the ability to have a side-by-side chat and easy sharing across the team – all within the Teams user interface. When you share and work together, you need the tools and digital workspaces to communicate, access data, and stay productive. SharePoint is the content service that powers the Files experience in Teams. You can easily add additional document libraries as tabs in Teams (there is a document library tab to do this when you add a tab \"+\"). You can add SharePoint lists and pages as tabs in Teams (there is a \"SharePoint\" tab you can add \"+\" that then shows available lists and pages you can choose from). And to have your team news automatically trigger discussion in Teams, use the SharePoint News connector for channels to have team news flow directly from SharePoint (even when you publish news on the go from the SharePoint mobile app) into the Teams Conversation tab. It, too, is possible to add full sites (team sites, communication sites and hub sites) as tabs in Teams using the Website tab \"+\". And the last thing to be clear on is that all the above capabilities bring SharePoint content in with full fidelity and feature sets intact as a view into the content – not a copy of it. Learn more about how SharePoint + Teams powers teamwork in Office 365 #6 | Associate your team site to a SharePoint hub site (dare we say “hubify”) As business goals and team structures evolve, so too must your sites and the content that lives within them. Associating sites together in a hub site enhances discovery and engagement with content, while creating a complete and consistent representation of your project, department or region. SharePoint hub sites provide an important building block for your intranet. They are the \"connective tissue\" you use when organizing families of team sites and communication sites together. Office 365 admins establish hub sites. Once established, it’s then a two-click process to associate a team site to a hub site. You then have common navigation between sits, a consistent look and feel, search scoped to content across all associated sites, and roll up of news, events and activities. And just as easy to move a team site from one hub site to another. Learn more about planning for SharePoint hub sites in Office 365 #7 | Send your first team news article Extra, extra, read all about it! Keep your team up to date! And do it in a way that’s easy for anyone to consume and stay engaged. With SharePoint pages and news articles, you create data-rich announcements and reports that look great on any device and within other apps and sites – like Microsoft Teams and news roll up to SharePoint hub sites – all filled with content from inside and outside (News links) Office 365. Read and create news. Stay in-the-know with personalized news delivered in SharePoint home and the SharePoint mobile apps. And publish news to your teams right from your device while you’re on-the-go. It’s truly a personalized news distribution service throughout your intranet. Learn more how to create and share news on your SharePoint sites. I also created a short 4min30sec “use SharePoint news” video. #8 | Take team meeting notes in the team OneNote notebook Share the responsibility of taking notes. Note taking takes a village and it’s easy to do. OneNote is great for gathering ideas, research, and information – and it’s super simple to use the group-connected OneNote notebook available by default. This OneNote notebook is stored with the group-connected SharePoint team site (within the default Site Contents > Site Assets library); it’s easily accessed as one of the default left-hand navigation items, listed as Notebook. Click this nav item and it opens the OneNote Online experience – which is then one click away from opening it in the OneNote desktop client. Once you’ve done this, you can then access it anywhere you have installed the OneNote app (Window, iOS, Android, & Web). And if you share who takes notes across meetings, the note taking burden lessens and the overall value of always having your notes goes way up! Learn more about taking notes in OneNote. Also, download and install OneNote to all your devices – for free. #9 | Planner integration – the new Task list for SharePoint in Office 365 Task management is most efficient when your team has access to everything it needs in one place. And hey, SharePoint can help with that – and it’s the basis of Office 365 Groups. Add in Planner and now we’re talking – tasks and content in the same place. You can do this in two ways. First, if a Planner plan already exists, you can bring it in using the Planner web part. This allows you to bring in an existing plan in the context of other information on the page. Depending on what task information you think is most relevant to your team, you can choose between the Planner Board or Charts view to appear on your page. And second, you can create an entire new plan directly from within SharePoint. The “+New” button includes the option to add a Planner plan – like adding a new page, list, library or news. You can add the plan to your left-hand navigation so your whole team can access it with a single click. Sound like a good plan for a plan (or two)? Yes. Now go try it and check it off your new task list. Learn more how to use the Planner web part. Learn more about creating a Planner plan directly from within the SharePoint team site. #10 | Create team-oriented business solutions that blend lists, libraries, PowerApps and Flow Collect and manage data. SharePoint lists collect data, just like you might collect information in Excel. Lists enable you and your teams to gather, track, and share information within SharePoint libraries. With SharePoint lists and libraries, Microsoft Flow, and PowerApps, you can create rich digital experiences with forms, workflows, and custom apps for every device. And don’t forget, you can now bring a SharePoint list – in its full fidelity – into Microsoft Teams as a tab. It’s truly a thing of beauty. Automate repetitive tasks. Transform your business processes—from simple tasks like notifications and approvals to complex operational workflows to accelerate productivity. Use the simple, visual designer in Microsoft Flow to lay out the steps. You can do everything in Flow from configuring alerts and approvals to modeling complex, multistage processes. Learn more about building and configuring numerous types of business solutions BONUS POWER: SharePoint mobile apps Now that you’ve considered (and tried 😊) the top 10 most important powers of your SharePoint team sites in Office 365 – it’s time to bring it home with the reality that we’re all mobile and need to stay connected and productive even when on a smaller device. Imagine, your entire intranet in your pocket. That is a lot of access on the go. The SharePoint mobile app is a new way to reach intranet content on your devices – and engage on it. You can read and write news, navigate sites, search for people and content throughout your organization, and learn through others with the powerful people cards; my favorite way to look up and learn about someone here at Microsoft; I can see who they report to and where their office is, what they are working on (that I have permissions to view) and who they work with. Download and install the SharePoint mobile app (iOS, Android & Windows Mobile). Learn more about the ubiquitous connectivity, productivity, and the rise of the SharePoint mobile app. Try more and more of what SharePoint offers, and let us know what you think In all, we encourage you to build out and organize your sites, your intranet – the way you want them to be consumed in context of your content. As you progress year over year, keep creating and sharing structured, easy-to-navigate content, sites, and experiences to your audience. Visit support.office.com to learn more on how to collaborate with team content using SharePoint team sites in Office 365. And learn more broadly what SharePoint can do for you in the SharePoint help center. We want to empower you and every person on your team to achieve more. Let us know what you need next. We are always open to feedback via UserVoice and continued dialog in the SharePoint community in the Microsoft Tech Community —and we always have an eye on tweets to @SharePoint. Let us know. —Mark Kashman, senior product manager for the SharePoint team"
}