{
  "url": "https://www.carelonbehavioralhealth.com/providers/resources/provider-portals",
  "title": "Provider Portals | Carelon Behavioral Health (Beacon)",
  "text": "Our Provider Digital Front Door is your one-stop access point for essential provider tools and resources. What you can do through the Digital Front Door: - Check participant eligibility and benefits - Submit authorization requests - Track claim status - Submit appeal requests - Access Carelon portals through single sign-on feature - Submit a request to join the Carelon network Depending on the health plan member you are serving, you may use different Availity Tiles: Anthem Health Plans: Use Availity (under the applicable Anthem payer ID) to submit authorizations, check claim status, verify eligibility for Anthem membership. Other Carelon-Managed Health Plans: Use Availity (under the Carelon payer ID-BHOVO) to access ProviderConnect and/or eServices to complete these activities. All Health Plans: Use Availity Essentials (BHOVO) to submit your request to join the network. BHOVO is the standard payer ID for Carelon Behavioral Health. Check your state-specific materials to confirm if another ID applies. Provider Digital Front Door login To access our Provider Digital Front Door, providers must be registered with Availity. Availity Providers who are not yet registered with Availity, can learn more, and sign up today, at no charge by visiting Availity.com . If you are an existing user, an administrator or non-administrator, you already have an Availity user account, there is no need to create a new user account. Each office staff member who needs access to the portal should have their own unique login credentials. If you need further assistance, contact Availity Client Services at 1-800-282-4548. Assistance is available Monday through Friday 8 a.m. – 8 p.m. ET. Provider Digital Front Door login To access our Provider Digital Front Door, providers must be registered with Availity. Availity Providers who are not yet registered with Availity, can learn more, and sign up today, at no charge by visiting Availity.com . If you are an existing user, an administrator or non-administrator, you already have an Availity user account, there is no need to create a new user account. Each office staff member who needs access to the portal should have their own unique login credentials. If you need further assistance, contact Availity Client Services at 1-800-282-4548. Assistance is available Monday through Friday 8 a.m. – 8 p.m. ET. ProviderConnect and eServices (non-Anthem portals) ProviderConnect and eServices are Carelon portals that provide participating providers with access to the following online activities: - Authorization / concurrent review requests and discharge reporting - Claim status / Provider summary vouchers (PSVs) - Eligibility status - Submission of inquiries to Carelon’s provider customer service (ProviderConnect only) - Updates to provider records (ProviderConnect only) ProviderConnect and eServices are Carelon provider portals tailored to your specific health plan and market. Depending on your plan or market, you may be required to use one or both portals. After successful registration, you will receive a confirmation email from us with a link to the appropriate portal for your use. How to obtain your user ID Providers must obtain a user ID before using our online services. To accomplish this, the following forms must be completed for each portal: ProviderConnect forms Online Services Account Request This form authorizes Carelon Behavioral Health to receive and process claims electronically and certifies that claims will comply with all laws, rules, and regulations governing your contract with us. Providers who wish to have inquiry-only access to our system for conducting eligibility and claim status inquiries must also submit this form. Account Request Form for Access to Multiple Providers This form allows the user access to multiple provider identification numbers under one login once the users have completed online registration or the Online Services Account Request form. This form is required to deactivate any ProviderConnect account. Please note, this form must be signed. ProviderConnect Contact Information Change Form Use this form to make changes on the contact information in your ProviderConnect profile. eServices forms eServices Terms of Use and Account Authorization Form This document designates an account manager for your profile within the Carelon Behavioral Health eServices application. Link your Availity account to ProviderConnect / eServices for Single Sign-On Before you get started, link your ProviderConnect and/or eServices account with a single sign on in Availity. - Register for a ProviderConnect and/or eServices user account. - Register for an Availity user account. - In the Availity payer space, select organization administration to link your Availity account to your Carelon ProviderConnect and/or eServices account. This only needs to occur one time, enabling you to access features within ProviderConnect and/or eServices through Availity. Guides and additional resources* MFA Resources: For questions or assistance with MFA setup, please email us at MFA-ProviderSupport@carelon.com. Please visit our Training page for a list of upcoming training webinars or to reference one of our archived webinars. If you have a technical question about ProviderConnect or EDI Claims Link, don't hesitate to contact the EDI help desk at 888-247-9311, Monday to Friday, 8 a.m. to 6 p.m. Eastern time. Additional contact information: Fax: 866-698-6032 Carelon Behavioral Health Attn: EDI help desk P.O. Box 1287 Latham, NY 12110 Availity Essentials is a secure, one-stop, self-service, multi-payer portal and our preferred choice for direct data entry claim submissions, EDI claims, checking eligibility and benefits, and more. Learn more about Availity Essentials Availity Training Explore the Digital Solutions Learning Hub—your one-stop shop for training on Availity Essentials and EDI. Whether you need the latest updates or foundational knowledge, the hub offers a range of resources, including user guides, videos, and interactive courses. Questions? We're here to help. Whether you have a question or are interested in learning more about how we can best support you, please call our National Provider Services Line at 800-397-1630, Monday to Friday, 8 a.m. to 8 p.m. Eastern time. Join the Carelon Behavioral Health provider network Please submit an application today to get started."
}