{
  "url": "https://www.today.com/food/snacks/lays-real-potato-chips-rebrand-rcna237326",
  "title": "Lay’s Undergoes Biggest Rebrand in 100-Year History",
  "text": "A popular potato chip company is undergoing a major makeover, due to a concerningly large swath of clueless customers, apparently. On Oct. 9, Lay’s announced its rebrand — the largest in its nearly 100-year history. The company said it is removing artificial flavors and colors in the U.S. and revealing a refreshed logo, bag design and advertising, really trying to hammer home that its chips are made with “real potatoes.” The company said its design team made the sun “warmer and more distinct” with sun rays that beam from the logo, which it has nicknamed or “Lay’s Rays.” Lay’s also now has a color palette inspired by the ingredients of its recipes: pickle green, hickory brown, savory red and more. The red Lay’s ribbon will remain on the new bag. “This redesign, the brand’s biggest in nearly a century, is a love letter to our origins,” said Carl Gerhards, PepsiCo’s Senior Director of Design, Global Lay’s. “With the new Lay’s visual identity, our team created a flexible design system that celebrates the brand’s famous flavors in countries around the world.” The phrase “made with real potatoes” is now printed on every bag, along with “enhanced photography” that shows “vivid, close-up visuals” of its product. “The new visual identity celebrates the humble, farm-grown potato — where every Lay’s potato chip starts — and heroes the ingredients that deliver the unmatched flavor consumers have always loved,” Alexis Porter, PepsiCo’s VP of Marketing, Global Lay’s., said in a press release. Some product ingredients will be changing, too, as the company seems to move away from seed oils: Lay’s Baked will be made with olive oil, Baked Lay’s Kettle Cooked Reduced Fat Original Sea Salt will be made with avocado oil, and more “new options across PepsiCo’s food portfolio” will be coming in 2026. “The potatoes’ journey from the soil to the shelf is the heart of Lay’s. But here’s the surprising part — 42% of people who enjoy Lay’s don’t realize they’re made with real, farm-grown potatoes,” reads the release. Wait ... what? Lay’s doesn’t reveal in the release how many people were surveyed or what exactly they were asked. It also begs the question: What do those folks think Lay’s chips are made of? There is a lot of online chatter on this specific detail of the announcement, particularly on Reddit. “there’s literally a potato on the package,” one Reddit user noted. “I really want to know the details of this study, because there’s a lot of stupid people but I frankly don’t believe that that many people don’t know potato chips are made out of potatoes,” another user wrote. “The official announcement doesn’t even cite a study,” added one more. Lay’s did not immediately respond to TODAY.com’s request for comment on the survey."
}