{
  "url": "https://www.simplyhealthcareplans.com/florida-home/simply.html",
  "title": "Simply Healthcare plans | Simply Healthcare",
  "text": "Your partner for a healthier life Take me to: MEDICAID AND FLORIDA HEALTHY KIDS For adults and children enrolled in Managed Medical Assistance (MMA), Long-Term Care (LTC) or Florida Healthy Kids (FHK) For people on Medicaid who are living with HIV/AIDS MEDICARE PLANS For adults age 65 and older or younger individuals with disabilities. We offer a wide variety of Medicare Advantage plans including Special Needs Plans for people with Medicare and Medicaid or chronic conditions. PROVIDER TOOLS Information and tools for health care professionals serving our plans About Simply As a Florida licensed health maintenance organization (HMO), we offer health plans for people enrolled in Medicaid and/or Medicare programs. Our plans are designed around meeting the unique health needs of our members and include many specialty plans. In fact, Simply began as a minority-owned HMO and was the first to offer a Medicaid specialty plan for people living with HIV/AIDS. We want our members to stay well and have access to the care and treatment they deserve, when they need it. Weâre working to help make health care simple, so members can focus on what matters most. Let us be your partner for a healthier life. Our Medicaid and Florida Healthy Kids plans Simply serves members in Floridaâs Statewide Medicaid Managed Care Managed Medical Assistance (MMA) and Long-Term Care (LTC) programs, as well as members enrolled in Florida Healthy Kids. Clear Health Alliance is a health plan for people on Medicaid who are living with HIV/AIDS. Members of the plan can see highly trained HIV/AIDS doctors and get community services to help them stay well. Get access to the health care and services you need with extra benefits to live healthier. Visit our Newsroom Visit Simply Visit Clear Health AllianceOur Medicare plans Simply Medicare Advantage plans combine health and drug coverage in one convenient, low-cost plan. They give you the hospital and medical coverage of Parts A and B in Original Medicare, plus Part D prescription drug benefits. We also offer Special Needs Plans. We work to make things simpler so you can be your healthiest. Find the plan that meets your needs. Visit Simply Medicare We work with thousands of doctors to make getting medical care easy. Use our search tool to find: Simply DoctorsImportant member notice: Learn about the Episource vendor security incident. Important member notice: Learn about the Outcomes vendor security incident. Y0114_26_3019404_0000_I_C 12/10/2025"
}