{
  "url": "https://www.onthisday.com/",
  "title": "On This Day - Today in History, Film, Music and Sport",
  "text": "Today in History - 211 Roman Emperor Septimius Severus dies in Eboracum (York) in England, leaving the Roman Empire in the hands of his two quarrelsome sons, Caracalla and Geta - 960 Coronation of Zhao Kuangyin as Emperor Taizu of the Song initiates three centuries of Song Dynasty dominance in southern China - 1789 First US Electoral College chooses George Washington as President and John Adams as Vice President - 1859 One of the oldest known copies of the Bible, \"The Codex Sinaiticus\" (Sinai Bible), is seen in Egypt by Constantin von Tischendorf, who takes the manuscript home - 1865 Robert E. Lee is named general-in-chief of Confederate forces - 1969 The Palestine National Congress appoints Yasser Arafat chairman of the PLO - 1988 Panamanian General Manuel Noriega is indicted by a US federal grand jury for drug trafficking and racketeering - 2004 Mark Zuckerberg launches Facebook from his Harvard dormitory room Today in Film & TV - 1970 Biographical film \"Patton\" directed by Franklin J. Schaffner and starring George C. Scott premieres in New York (Academy Awards Best Picture 1971) Today in Music - 1977 \"Rumours\" 11th studio album by Fleetwood Mac is released (Grammy Album of the Year) Today in Sport - 1990 New Zealand bowler Richard Hadlee takes his 400th Test cricket wicket, dismissing Sanjay Manjrekar, becoming the first to reach the milestone - 1991 NZ cricketers Martin Crowe and Andrew Jones make a world record 467 run stand, against Sri Lanka at the Basin Reserve in Wellington Famous Birthdays Ferdinand Magellan 1480 - 1521Tadeusz Kościuszko 1746 - 1817Emperor Norton 1819 - 1880Charles Lindbergh 1902 - 1974Rosa Parks 1913 - 2005Betty Friedan 1921 - 2006 Celebrity Birthdays George A. Romero 1940 - 2017Alice Cooper 78th BirthdayLawrence Taylor 67th BirthdayClint Black 64th BirthdayChen Kun 50th Birthday Fun Fact About Today Russian newspaper Izvestia reports that baseball is an old Russian game Famous Weddings - 1875 Princess Louise of Belgium marries Prince Philip von Saksen-Coburg-Gotha in Belgium - 1924 Jazz musician Louis Armstrong (22) weds jazz pianist Lillian \"Lil\" Hardin (26) - 2nd try for each; separate in 1931 and divorce in 1938 - 1939 American singer Frank Sinatra (23) marries 1st wife Nancy Barbato (21) at Our Lady of Sorrows catholic church in Jersey City, New Jersey; divorce in 1951 Famous Divorces - 1985 American professional boxer George Foreman (35) divorces Andrea Skeete after almost 3 years of marriage"
}