{
  "url": "https://www.spanishdict.com/answers/282262/how-to-type-spanish-letters-and-accents-from-paralee",
  "title": "How to type Spanish letters and accents (á, é, í, ó, ú, ü, ñ, ¿, ¡) From Paralee. | SpanishDictionary.com Answers",
  "text": "How to type Spanish letters and accents (á, é, í, ó, ú, ü, ñ, ¿, ¡) From Paralee. From reference section by Paralee. How to Type Spanish Letters and Accents (á, é, í, ó, ú, ü, ñ, ¿, ¡) 67.5K There are several ways to configure your keyboard to type in the Spanish accented letters and upside-down punctuation (á, é, í, ó, ú, ü, ñ, ¿, ¡) and which one you use depends on the frequency with which you need these letters. - Inserting Accented Characters with an English Keyboard Layout If you only need an accented character every now and then, there is no need to change your full keyboard layout. For all PCs There are several key combinations you can use to insert single characters into your text on a PC. The first is for newer computers using the Control key and may only work in Microsoft Office. In Office for Windows: For accented vowles: Press Ctrl + , then the vowel (ctrl + ' + a = á) For Ñ: Press Ctrl + ~, then the letter n (ctrl + ~ + n = ñ) The second way is using the ASCII code. Each character in your computer has a code made up of pressing the ALT key then a three-digit number, all of which are listed below. á = Alt + 0225 é = Alt + 0233 í = Alt + 0237 ó = Alt + 0243 ú = Alt + 0250 ñ = Alt + 0241 ü = Alt + 0252 ¡ = Alt + 0161 ¿ = Alt + 0191 To type the numbers, you must use the numeric keypad on the right side of your keyboard, not the number keys on the top row. For all Macs To get accented vowels on a Mac, hold down the Option key, and while holding it down, type the letter e; then release those keys and type the letter that you want the accent to appear on: Opt + e, then a = á Opt + e, then e = é Opt + e, then i = í Opt + e, then o = ó Opt + e, then u = ú For the ñ, hold down the Option key while you type the n, then type n again. Opt + n, then n = ñ To type an umlaut over the u, hold down the Option key while pressing the u key then type u again. Opt + u, then u = ü *To type the upside-down punctuation marks press the following keys all at once. Opt + 1 = ¡ Opt + shift + ? = ¿ - Full Keyboard Configuration For those using Spanish letters and punctuation on a regular basis, I recommend going into your Control Panel/System Preferences and add the Spanish keyboard configuration. This will mean you need to learn the new key placements, but it is very easy once you get used to it. For Windows Vista Go to your Control Panel Click on \"Clock, Language, Region Click on \"Change Keyboards\" Click \"Add\" and Select \"Spanish-International Sort\" For Windows XP: Go to your Control Panel Click on \"Date, Time, Language, and Regional Options\" Click on \"Regional and Language Options\" Select the \"Languages\" tab at the top Click on \"Details\" near the bottom Click \"Add\" and choose \"Spanish-Traditional Sort\" Go back to the \"Languages\" tab and choose the option to \"switch languages\" by pressing \"left alt-shift\" at the same time. This way, you can switch to and from the Spanish and regular keyboard whenever you want. For Macs Go to your System Preferences Click on \"International\" Select the \"Input Menu\" tab Scroll down to select \"Spanish - ISO\" Note the keystrokes necessary to switch between languages OR Select \"Show input menu in menu bar\" to be able to click-select which keyboard you want to use. Spanish-International Sort Keyboard Layout Spanish-International Sort Keyboard Key Strokes ' + a = á ' + e = é ' + i = í ' + o = ó ' + u = ú \" + u = ü Once you have installed your Spanish keyboard, it will react slightly differently than you are used to. First, you will notice that when you type an apostrophe ( ' ), nothing happens. This is because if you type a vowel immediately after, you will get an accented vowel (á, é, í, ó, ú). To get an apostrophe, push the key for the hyphen, next to the number 0. You can see several other changes in the picture below. The quotes ( \" ) key behaves the same way as the apostrophe key in that it gives you the umlaut ( ¨ ) rather than quotes for the letter (ü) in words like \"lingüística\". To type in regular quotes, simply press shift then the number 2. The semicolon ( ; ) key has also been replaced by the ñ. To type a regular semicolon, simply press shift then the comma key. alt text 6 Answers I set my PC to the English international setting. That allows me to use the right Alt key +e = é, right Alt key +a =á right Alt key +e =é right Alt key + o= ó right Alt key +n=ñ right Alt key +?=¿ right Alt key +!= ¡ right Alt key then shift+\" then u =ü (That is 4 keystrokes) If you uses a smaller note book computer you will not have key pads on the side of the keyboard.therefore the the method shown above using the Alt key plus the numbers will not work. Lots of fun symbols among the ALT Codes ?Here's a very useful Link to the Alt Codes Some helpful codes for Spanish accents : Alt 130 =é Alt 160 = á . . . . Alt 161 = í . . . . Alt 162 = ó . . . Alt 163 = ú and there's also Alt 164 = ñ & Alt 165 = Ñ Helpful punctuation ?Alt 168 = ¿ & Alt 173 = ¡ . . . & Alt 19 = ? (To use Alt Code Press and H o l d down the Alt Key and continue holding until you complete the number of the code you desire- Then release : - ) It's no biggie to memorize the \"alt\" codes. It's a lot faster than dropping down to the bottom of the answer box to get an accented vowel or upside down punctuation marks. Great info! Thanks for all! I personally prefer to buy a Spanish keyboard that is worth 20 and is easier :D I use Mac and: Opt + e, then a = á Opt + e, then e = é Opt + e, then i = í Opt + e, then o = ó Opt + e, then u = ú For the ñ, hold down the Option key while you type the n, then type n again. Opt + n, then n = ñ To type an umlaut over the u, hold down the Option key while pressing the u key then type u again in tubegalore or mr sexe. Opt + u, then u = ü *To type the upside-down punctuation marks press the following keys all at once. Opt + 1 = ¡ Opt + shift + ? = ¿ .... Its too dificult for me Worth another round . Always useful for someone."
}