{
  "url": "https://en.wikipedia.org/wiki/Clawson,_Michigan",
  "title": "Clawson, Michigan - Wikipedia",
  "text": "Clawson, Michigan Clawson is a city in Oakland County in the U.S. state of Michigan. A northern suburb of Detroit, Clawson is located about 19 miles (31 km) north of downtown Detroit. As of the 2020 census, the city had a population of 11,389.[6] History [edit]This area was occupied by the historic Potowatomi people, who were among the indigenous peoples in the Detroit territory. They traded furs for goods for years with the French Canadians and English colonists. The city's name is a misspelling of the surname of John C. Lawson, an early European-American settler.[7] It was founded by European Americans in 1829 and was originally known as Pumachug and The Corners. The name was inspired by the sound made by the Cider Mill and Saw Mill on each corner of the main intersection. The sound was described as \"pum-a-chug, pum-a-chug.\" The city was incorporated as Clawson in 1920 as a village; in 1940 it was incorporated as a city. Geography [edit]According to the United States Census Bureau, the city has a total area of 2.20 square miles (5.70 km2), all land.[8] Demographics [edit]2010 census [edit]At the 2010 census,[10] there were 11,825 people, 5,460 households and 2,992 families living in the city. The population density was 5,375.0 inhabitants per square mile (2,075.3/km2). There were 5,791 housing units at an average density of 2,632.3 per square mile (1,016.3/km2). The racial makeup was 93.4% White, 1.9% African American, 0.3% Native American, 2.0% Asian, 0.4% from other races, and 1.9% from two or more races. Hispanic or Latino of any race were 2.1% of the population. There were 5,460 households, of which 23.5% had children under the age of 18 living with them, 41.8% were married couples living together, 8.9% had a female householder with no husband present, 4.1% had a male householder with no wife present, and 45.2% were non-families. 38.2% of all households were made up of individuals, and 11.8% had someone living alone who was 65 years of age or older. The average household size was 2.14 and the average family size was 2.88. The median age was 39.9 years. 17.9% of residents were under the age of 18; 7.6% were between the ages of 18 and 24; 31.4% were from 25 to 44; 28.4% were from 45 to 64; and 14.8% were 65 years of age or older. The sex makeup was 49.0% male and 51.0% female. 2000 census [edit]At the 2000 census,[4] there were 12,732 people, 5,572 households and 3,259 families living in the city. The population density was 5,787.0 inhabitants per square mile (2,234.4/km2). There were 5,676 housing units at an average density of 2,579.9 per square mile (996.1/km2). The racial makeup was 96.10% White, 0.80% African American, 0.34% Native American, 1.32% Asian, 0.25% from other races, and 1.19% from two or more races. Hispanic and Latino of any race were 1.14% of the population. There were 5,572 households, of which 25.1% had children under the age of 18 living with them, 46.8% were married couples living together, 8.9% had a female householder with no husband present, and 41.5% were non-families. 35.2% of all households were made up of individuals, and 12.5% had someone living alone who was 65 years of age or older. The average household size was 2.26 and the average family size was 2.98. 20.6% of the population were under the age of 18, 7.5% from 18 to 24, 34.8% from 25 to 44, 21.9% from 45 to 64, and 15.2% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 94.0 males. For every 100 females age 18 and over, there were 89.5 males. The median household income was $50,929 and the median family income was $64,684. Males had a median income of $45,242 and females $30,679. The per capita income was $25,676. About 1.4% of families and 3.5% of the population were below the poverty line, including 1.6% of those under age 18 and 4.8% of those age 65 or over. Government [edit]Clawson utilizes the council–manager form of government, and thus is governed by a city council consisting of a mayor and six[11] council members. The city council appoints a city manager, who manages the day-to-day operations of the city. Federal, state, and county legislators [edit]Education [edit]The city of Clawson is entirely within the boundaries of Clawson Public Schools. Japhet School, a private school, is located in a former YWCA building in Clawson. It moved there in August 2013 from its previous location in Madison Heights.[18] Notable people [edit]- Mark Campbell, tight end for the New Orleans Saints - Lou Cotton, Musician We Came As Romans - Tim Gleason, defenseman for the Toronto Maple Leafs; 2010 Olympian, ice hockey - Jon Jansen, offensive tackle for the Washington Redskins - David Robert Mitchell (born 1974), American film director - Dan Scanlon, director at Pixar Animation Studios - Drew Schultz, Motown Musician, composer, and producer. Notes [edit]- ^ McMorrow has represented Clawson since 2019, but has only represented the 8th district since 2023. References [edit]- ^ \"City of Clawson, Michigan\". City of Clawson, Michigan. Retrieved August 24, 2012. - ^ City of Clawson (2020). \"City of Clawson Government\". Retrieved April 23, 2020. - ^ \"2020 U.S. Gazetteer Files\". United States Census Bureau. Retrieved May 21, 2022. - ^ a b \"U.S. Census website\". United States Census Bureau. Retrieved January 31, 2008. - ^ U.S. Geological Survey Geographic Names Information System: Clawson, Michigan - ^ \"U.S. Census Bureau QuickFacts: Clawson city, Michigan; United States\". www.census.gov. Retrieved October 24, 2023. - ^ \"Profile for Clawson, Michigan, MI\". ePodunk. Retrieved August 24, 2012. - ^ \"US Gazetteer files 2010\". United States Census Bureau. Archived from the original on January 12, 2012. Retrieved November 25, 2012. - ^ \"Census of Population and Housing\". Census.gov. Retrieved June 4, 2015. - ^ \"U.S. Census website\". United States Census Bureau. Retrieved November 25, 2012. - ^ https://cms3.revize.com/revize/clawsonnew/your_government/boards_and_commissions/docs/City%20Charter%20MASTER%20Version%20with%20cover%20page%20and%20TOC%20(2023.05.23).pdf [bare URL PDF] - ^ Hendrickson, Clara (November 5, 2024). \"US Rep. Haley Stevens reelected to another 2-year term in Congress, defeating Nick Somberg\". Detroit Free Press. - ^ \"2022 Michigan State Senate Districts (Linden)\". Michigan Independent Citizens Redistricting Commission. - ^ \"Senators\". Michigan Senate. Retrieved November 7, 2024. - ^ \"2022 Michigan State House Districts (Hickory)\". Michigan Independent Citizens Redistricting Commission. - ^ \"2024 MI State House General Election Results\". Detroit Free Press. November 7, 2024. - ^ \"Commissioner Districts\". Oakland County – via ArcGIS. - ^ \"Japhet School Celebrates 40 Years and Moves to Clawson Archived 2014-08-02 at the Wayback Machine.\" Japhet School. July 9, 2013. Retrieved on November 6, 2013. () \"31202 Dorchester, Madison Heights, MI 48701\" \"Mailing address through August 20: above\" and \"Mailing address after August 20: 839 S. Crooks, Clawson, MI 48017\""
}