{
  "url": "https://www.hobbylobby.com/crafts-hobbies/c/9",
  "title": "Craft Supplies From Hobby Lobby | Live A Creative Life",
  "text": "Hobby & Craft Supplies Let your creativity show you the way. Whether you’re in need of crafts for kids or you want to put together more interesting model kits, it’s all here! Enjoy the nostalgic details of classic model cars, trucks, and motorcycles. Spend a cozy evening working on your DIY hobbies alone or with friends and family. Great For Beginners & Experts Beginner and expert crafters will find all they need to complete their favorite hobbies at Hobby Lobby! Our craft supplies feature a wide variety of materials and tools for DIY projects. Need a simple sit-down activity? We carry tons of fun small and large puzzles. Personal care enthusiasts will enjoy shopping through our wide selection of soap and candle making supplies. Create homemade soaps that are non-toxic, chemical-free, and feature plenty of delightful scents. You can do the same with our candle making supplies, crafting relaxing accents that look great and help promote wellness. We carry unfinished wood picture frames in several styles and shapes, so you can design custom photo and poster frames at home. Diamond Painting Diamond art kits are enjoyable for kids and adults. These pre-arranged kits help with hand-eye coordination while also encouraging a love of art. Find the perfect kit featuring animals, flowers, or even a magical mermaid to frame and hang up in your home. Crafts For Kids & Adults Need crafts for kids? Choose from our many options for vibrant markers, crayons, and paint-by-number kits. Science kits for kids are educational and teach critical thinking, while jewelry kits for kids help train fine motor skills. Cover home and school projects with our wide selection of stickers. They come in a variety of fun themes and styles, showcasing popular cartoon characters like Hello Kitty and Spider-Man. Our dollhouse kits come ready-to-assemble in unique styles that range from old world to spunky and new. Once made, fill each house with tons of adorable furniture. If you need simple activities to keep young minds occupied, pick up a couple of our sensory toys. Slime kits are great for sensory play and come individually or in sets that include colorful embellishments and textures. Add a little more creativity to your life with fun hobby and craft supplies! Frequently Asked Questions What is a hobby? A hobby is an activity done during free time for fun. Common examples include painting, collecting, scrapbooking, and crocheting. Hobbies are a great way to explore interests, meet new people, and live a creative life. How to find a hobby? To find a hobby, consider activities you enjoy working on alone or with a group of friends. Hobby Lobby features a variety of DIY inspiration pages that you can browse for ideas on what to try."
}