{
  "url": "https://www.msd.com/stories/exploring-kras-a-precision-approach-in-oncology/",
  "title": "Exploring KRAS: A precision approach in oncology - MSD",
  "text": "Exploring KRAS: A precision approach in oncology MSD scientists research oncogene mutations driving cancer growth July 22, 2025 How oncogenes like KRAS drive cancer growth Armed with an ever-deepening understanding of cancer biology and advanced precision medicine tools, scientists have traced the molecular basis of cancer cell formation and tumor growth to alterations in key genes, known as oncogenes. Oncogenes play a crucial role in driving cancer growth by disrupting normal cellular processes that control cell growth and division. When oncogenes are mutated, they cause cells to grow and divide uncontrollably, leading to tumor formation and cancer development. Understanding how oncogenes drive cancer development provides a potential means to explore new research approaches aimed at the specific genetic drivers of a patient’s cancer compared with a one-size-fits-all approach. KRAS is one of the most frequently mutated oncogenes found in cancer. In healthy cells, KRAS serves as an on-off switch that regulates cell growth. However, when the gene is mutated, KRAS can become stuck in the “on” position, causing uncontrolled cancer cell growth and proliferation. Several different mutations of KRAS have been identified, and commonly found types include G12C, G12V and G12D. The KRAS G12C mutation occurs in approximately 14% of non-small cell lung cancer (NSCLC) and 3-5% of colorectal cancers. “We now know there’s no one-size-fits-all approach to treating cancer. By focusing on key oncogenes like KRAS, we’re exploring how to harness precision approaches to potentially impact tumor growth at its source.” - Dr. Jane Healy Vice president and head of oncology early development, MSD Research Laboratories Advances in targeting KRAS Despite decades of research, the smooth, spherical structure of the KRAS protein hindered efforts to impact its activity on a molecular level. That’s because chemists often look for places to engage with the protein on its surface, like crevices or cracks. After 40 years of research and informed by a greater understanding of the detailed structure of the KRAS protein, scientists have discovered ways to engage with a pocket that appears on KRAS when the protein is maintained in an inactive state. “As we advance our KRAS research efforts, we’re hopeful that we may uncover new ways to impact the underlying processes that fuel cancer growth.” - Dr. Marjorie Green Senior vice president and head of oncology, global clinical development, MSD Research Laboratories Today, our scientists are building on these findings to advance potential targeted approaches in oncology research. Our precision oncology research efforts are a key tenet in our robust oncology pipeline."
}