{
  "url": "http://www.upenet.com.br/concursos/25_REDMULT/",
  "title": "UPENET | Residência Multi 2025",
  "text": "Comunicado Nº 006 A Secretaria Estadual de Saúde – SES/PE e o Instituto de Apoio a Universidade de Pernambuco - IAUPE, COMUNICAM aos inscritos no Processo Seletivo para a Residência Multiprofissional - ano 2025, o seguinte ajuste no Anexo I – Cronograma de Execução: Permanecendo inalteradas as demais datas previstas no cronograma. Atenciosamente, IAUPE CONCURSOS NOTA DE ESCLARECIMENTO A Secretaria Estadual de Saúde – SES/PE e o Instituto de Apoio a Universidade de Pernambuco - IAUPE, ESCLARECEM aos inscritos no Processo Seletivo para a Residência Multiprofissional - ano 2025, que de acordo com o item 6.3 do edital, o (a) candidato (a) deverá comparecer ao local de prova com documento oficial de identificação na forma impressa. Para os (as) candidatos (as) que não possuam a documentação física, será permitido utilizar a documentação virtual. Sendo permitido o uso do telefone celular, apenas para essa finalidade. Para tanto, serão distribuídos envelopes com lacres para o (a) candidato (a) armazenar o telefone celular, obrigatoriamente desligado e sem a respectiva bateria. Sendo terminantemente proibido a utilização do mesmo, durante a aplicação das provas objetivas. Em caso de não atendimento destas orientações, o (a) candidato (a) será automaticamente ELIMINADO (A). Em relação as MALAS E MOCHILAS, RECOMENDAMOS, aos candidatos que não levem estes materiais para o prédio de aplicação das provas, visto não haver local apropriado para o seu armazenamento. SECRETARIA EXECUTIVA DE GESTÃO DO TRABALHO E EDUCAÇÃO NA SÁÚDE DIRETORIA GERAL DE EDUCAÇÃO NA SAÚDE A SECRETARIA ESTADUAL DE SAÚDE/PE torna torna público o PPROCESSO SELETIVO PARA OS PROGRAMAS DE RESIDÊNCIA EM ÁREA PROFISSIONAL DE SAÚDE para o ano de 2025, que será realizado através do Instituto de Apoio à Fundação Universidade de Pernambuco (IAUPE), vinculados à COREMU da Escola de Governo em Saúde Pública de Pernambuco (ESPPE), COREMU da Universidade de Pernambuco (UPE), COREMU da Universidade Federal de Pernambuco (UFPE), COREMU da Universidade Federal do Vale do São Francisco (UNIVASF), COREMU do Instituto de Medicina Integral Prof. Fernando Figueira (IMIP), COREMU da Secretaria Municipal de Saúde do Município de Jaboatão dos Guararapes, COREMU da Secretaria Municipal de Saúde do Municipio de Recife, COREMU da Fundação Gestão Hospitalar Prof. Martiniano Fernandes (FGH), COREMU da Sociedade Pernambucana de Combate ao Câncer (HCP) e desenvolvidos nas Instituições de Saúde que ofertam residências em Área Profissional de Saúde no Estado de Pernambuco, de acordo com as normas e resoluções da Comissão Nacional de Residência Multiprofissional em Saúde (CNRMS/MEC) e da Secretaria Estadual de Saúde-PE."
}