{
  "url": "https://dguides.com/seattle/attractions/parks-gardens-and-beaches/ballard-locks/",
  "title": "Ballard Locks - Your Destination Guide to Seattle",
  "text": "The Ballard Locks turn engineers into tour guides, saltwater into freshwater, and salmon into courageous fighters. Combining education with entertainment, the Ballard Locks are one of the most unique destinations in Seattle. The Ballard Locks, known officially as the Hiram M. Chittenden Locks, were created out of necessity to facilitate boat travel between Puget Sound and Seattle's freshwater lakes. Located slightly above sea level, Seattle's lakes needed a connection to Puget Sound in order to transport logs and other natural resources. A simple canal would allow saltwater to pour into freshwater, upsetting ecosystems and fragile environments. To solve this problem the Ballard Locks were created to raise boats to freshwater levels and to protect the integrity of both water systems. The result is a daily procession of massive trade ships, tugs, sailboats, dinghies, and kayaks. Visitors get a front-row view of the monumental task of organizing and controlling the plethora of vessels that enter and exit the locks. There are around 65,000 crossings every year, averaging almost 180 boat crossings every day. Between transfers, guests can tour the visitor's center, gift shop, salmon ladder, and botanical gardens. During their annual migration from the salty waters of the Pacific Ocean and Puget Sound to the freshwater lakes and streams accessed through Lake Washington, salmon use the ladder to get past the locks, an understandably uncommon obstacle for a salmon. A portion of the ladder has been turned into an aquarium exhibit where guests can watch the salmon fight the current. The Carl S. English Jr, Botanical Gardens, built in place of the construction site after the locks were completed, now feature hundreds of varieties of local and international flowers and trees including Japanese Anemone and Horse Chestnuts native to Greece. The Ballard Locks are more than just functional. They provide simple entertainment and an uncommon, interactive experience—a contrast from the passive attractions of more traditional parks and destinations. Attraction Information - Hours: - The Ballard Locks are open every day from 7am to 9pm - Visitor Center and Gift Shop: - Winter (October 1st-April 30th): Thursday through Monday: 10am to 4pm,Tuesday and Wednesday: Closed - Summer (May 1st – September 30th): Daily: 10am to 6pm - Admission: - Free - Metro Stop: - Metro routes 44,46 and 17 serve locations near the Ballard Locks - Contact: - Location: 3015 NW 54th St., Seattle, WA - Phone: 206-783-7059 - Website: www.nws.usace.army.mil"
}