{
  "url": "https://armeniadiscovery.com/en/city/jermuk",
  "title": "Jermuk",
  "text": "Jermuk is located in Vayots Dzor Region and is considered one of the main spa and resort towns in Armenia since the Soviet Union period. It is situated 53 km east of the administrative centre of Yeghegnadzor and 170 km south-east of Yerevan, at the height of 2080 meters above sea level. Jermuk is located in the mountains of Vayots Dzor, on a plateau divided by the canyon of the River Arpa. The town is surrounded by thick forests and is known for its hot springs and mineral water. The name of the town itself means \"geyser\" in the Armenian language. Jermuk was considered to be a part of the Vayots Dzor canton of the Syunik Region. The town's name was first mentioned in the 13th century by famous Armenian historian Stepanos Orbelian. However, the remains of an ancient cyclopean fortress and the ruins of an 8th-century basilica were found in the area of the modern-day city which proves that the city has been settled before the 13th century. Fresh air, waterfalls, artificial lakes, surrounding forests and mineral water pools make Jermuk one of the best resort towns in Armenia. The town is also famous for its bottled mineral water branded as \"Jermuk\". The underground geyser of Jermuk is used both for drinking and taking baths. It cures various diseases and neurological disorders. The town of Jermuk is a regular venue for international chess tournaments as well. Every year the town hosts the FIDE Grand Prix Jermuk chess tournament. The surrounding mountains of 2500-3500 meters high are covered with forests and alpine meadows. The forests are rich with oak and hornbeam trees, as well as wild fruit and juniper trees. These forests are home to foxes, rabbits, badgers, bears and other animals. One of the most beautiful places in this town is the Jermuk waterfall which is of 72-meter height and flows into the Arpa River. The waterfall is fascinating and marvellous and looks like the hair of a girl. The locals call the waterfall \"Mermaids hair\". According to the legend, once a castle of a powerful nobleman stood on the cliffs. The nobleman had a beautiful girl. Many noblemen from different parts of the world came to marry her but the girl rejected them all because she was in love with the young and brave son of the shepherd. Every night, the girl threw a long rope from her window so that her beloved one could climb the cliffs to see her. But once her father saw them together and cursed his daughter saying that if she met the boy again she would become a mermaid and could never get out of the water. However, the desire to see each other was so strong that the young people ignored the curse. This time the girl threw her beautiful long hair instead of the rope to climb up the rock and her father's curse was immediately fulfilled and the princes became a mermaid, while her hair turned into a beautiful waterfall. Not far from the town of Jermuk is the Kechut Reservoir which is very popular among tourists. This reservoir has a unique style of a flower. The reservoir was built in 1981 and its total volume is 23 million cubic meters. The beauty of Jermuk can be fully seen from the Ropeway. The town is one of the main resort towns of Armenia. The town has many hotels and sanatoriums in the city. Jermuk Ashkharh is one of the best hotels. It was built in 1975. Due to many years of working practice and experience, this sanatorium remains one of the best in Jermuk. The staff members are highly-qualified professionals who will undoubtedly show a personal approach to all their guests. Another famous sanatorium in Jermuk is the “Olympia” resort. It is a medical centre of international standards which has been operating for more than 50 years. “Olympia” was founded in 1953 and includes the hotel, the restaurant, and the medical centre which is well equipped and provides medical services of high quality. The medical staff regularly attends advanced training courses. The interior of the sanatorium and restaurant are designed in the classical style that matches all international health standards. The hotel has a bar, a billiards room, a beauty salon, a conference hall, a children's room, a fitness room, a library, a lounge bar and a sauna."
}