{
  "url": "https://www.mmamania.com/2024/12/26/24329828/top-american-mma-regional-shows-announce-historic-shows-for-early-2025-lfa-200-fury-fc-100",
  "title": "Top American MMA Regional Shows Announce Historic Shows For Early 2025 | MMA Mania",
  "text": "Historic regional mixed martial arts (MMA) events are going down next month! Top American MMA regional promotions, LFA and FURY FC, announce historic early 2025 events Regional MMA is the lifeblood of the sport. Without regional fighters, major promotions would collapse or become stale because there would be no new talent to keep them running. With that being said, two of the most prominent American regional shows, Legacy Fighting Alliance (LFA) and Fury Fighting Championship (Fury FC), are having landmark events planned for Jan. 2025. Both events will stream live on UFC Fight Pass. Fury FC 100 Fury FC 100: “Kilmer vs. Smotritsky” goes down on Jan. 12, 2025, from inside Imagen Venues in Houston, Texas, and is headlined by three title fights. In the main event, two-time Contender Series veteran, Shimon Smotritsky (11-2), collides with grappling ace, Sam Kilmer (8-4), for the vacant Welterweight title. The co-headliner sees Justice Torres (10-2) defend his Featherweight title against long-time Fury FC veteran, Cameron Graves (13-7), and in the featured bout, Flyweight champion Paris Moran (11-2) looks to punch his Ultimate Fighting Championship (UFC) ticket at the expense of Alden Coria (9-2). Other notable fights on this gigantic card are two-time Contender Series veteran, Malik Lewis (7-2) vs. Hector Saenz (8-2), top Welterweight prospect Isaac Moreno (6-0) vs. Luis Hernandez (4-0) and Reese “Baby Goose” Watkins (5-0) vs. Christopher Ewert (6-0). LFA 200 LFA 200, meanwhile, goes down on Jan. 25, 2025, from inside Mystic Lake Casino in Prior Lake, Minn., and is also headlined by three big title unification bouts. In the main event, Featherweight champion, Elijah Johns (10-2) — brother of UFC fighter Miles Johns — takes on interim champion, Lerryan Douglas (11-5). In the co-main event, LFA Flyweight champion, Shannon Clark (5-1) — fresh off getting brutally slept on Contender Series (watch it) — unifies her title against interim queenpin, Cheyanne Bowers (5-1). The third title fight takes place in the “Featured” bout, where Vanilto Antunes (16-7) collides with Shamidkhan Magomedov (9-1) to unify the Welterweight title. Other interesting fights include Joey Hart (6-2) vs. Chris Mixan (5-1), Devon Lozej (7-2) vs. Enrique Pacheco Parra (8-1), and Alvin Hines (4-0) vs. Matt Adams (4-1). For more regional MMA news and notes click here."
}