{
  "url": "https://dictionary.cambridge.org/dictionary/english/just",
  "title": "JUST | English meaning - Cambridge Dictionary",
  "text": "just adverb uk /dʒʌst/ us /dʒʌst/just adverb (NOW) \"Where are you, Jim?\" \"I'm just coming.\" I'll just finish this, then we can go. just after It's just after ten o'clock. - carpe diem - contemporaneity - contemporarily - contemporary - current - currently - hereon - hereupon - immediate - in current use - in this day and age idiom - minute - present - present-day - presently - sitting - status quo - still - there's no time like the present idiom - topical You can also find related words, phrases, and synonyms in the topics: just adverb (EXACTLY) just as many You've got just as many toys as your brother. just as much Teenagers need their parents just as much as toddlers. Thank you, it's just what I've always wanted. not just yet I can't help you just yet. just then Just then, the lights went out. just adverb (ONLY) B1 only; simply: He just won't do as he's told. It's just too expensive. - all - all of something idiom - at a pinch idiom - barely - but - by a whisker idiom - by inches idiom - hardly - ill - is all idiom - little - mere - merely - merest - narrowly - only - scarce - scarcely - whisker You can also find related words, phrases, and synonyms in the topics: just adverb (VERY) Grammar just adjective uk /dʒʌst/ us /dʒʌst/The judge's sentence was perfectly just in the circumstances. just cause I don't really think he had just cause to complain. - all's fair in love and war idiom - anti-bias - anti-discrimination - anti-egalitarian - anti-nepotism - economic justice - EDI - EDIB - egalitarian - egalitarianism - get your just deserts idiom - global justice - it is fair that - it's a fair cop idiom - it's not fair - sportsmanlike - unbought - undemocratically - what goes around comes around idiom - without fear or favour idiom Idiom just noun uk /dʒʌst/ us /dʒʌst/- all's fair in love and war idiom - anti-bias - anti-discrimination - anti-egalitarian - anti-nepotism - economic justice - EDI - EDIB - egalitarian - egalitarianism - get your just deserts idiom - global justice - it is fair that - it's a fair cop idiom - it's not fair - sportsmanlike - unbought - undemocratically - what goes around comes around idiom - without fear or favour idiom"
}