{
  "url": "https://www.newworldencyclopedia.org/entry/3_(number)",
  "title": "3 (number) - New World Encyclopedia",
  "text": "3 (number) - This article is about the number three. 3 (three) is a number, numeral, and glyph that represents the number. It is the natural number[1] that follows 2 and precedes 4. It is an integer and a cardinal number, that is, a number that is used for counting.[2] In addition, it is classified as a real number,[3] distinguishing it from imaginary numbers. Evolution of the glyph The number three was once written with as many lines as the number represents. The Romans tired of writing 4 as IIII, but 3 continues to be written as three lines in Roman and Chinese numerals. This was the way the Brahmin Indians wrote it, and the Gupta made the three lines more curved. The Nagari started rotating the lines clockwise, ending each line with a slight downward stroke on the right. Eventually, they made these strokes connect with the lines below, transforming it to a character that looks very much like a modern 3 with an extra stroke at the bottom. The Western Ghubar Arabs finally eliminated the extra stroke and created our modern 3. The extra stroke, however, was very important to the Eastern Arabs, who made it much larger, while rotating the strokes above to lie along a horizontal axis. To this day, Eastern Arabs write a 3 that looks like a mirrored 7 with ridges on its top line: ٣[4] While the shape of the 3 character has an ascender in most modern typefaces, in typefaces with text figures the character usually has a descender, for example, in . In some French text-figure typefaces, though, it has an ascender instead of a descender. A common variant of the digit 3 has a flat top, similar to the character Ʒ (ezh), sometimes used to prevent people from falsifying a 3 into an 8. In mathematics Three is the first odd prime number, and the second smallest prime. It is both the first Fermat prime (22º + 1) and the first Mersenne prime (2² - 1), as well as the first lucky prime. However, it's the second Sophie Germain prime, the second Mersenne prime exponent, the second factorial prime (2! + 1), the second Lucas prime, the second Stern prime. Three is the first unique prime, based on the properties of its reciprocal. Three is the third Heegner number. Three is the second triangular number and it is the only prime triangular number. Three is the only prime which is one less than a perfect square. Any other number which is n² - 1 for some integer n is not prime, since it is (n - 1)(n + 1). This is true for 3 as well, but in its case one of the factors is 1. Three non-collinear points determine a plane and a circle. Three is the fourth Fibonacci number and the third that is unique. In the Perrin sequence, however, 3 is both the zeroth and third Perrin numbers. Vulgar fractions with 3 in the denominator have a single digit repeating sequences in their decimal expansions, (.000…, .333…, .666…) A natural number is divisible by three if the sum of its digits in base 10 is divisible by 3. For example, the number 21 is divisible by three (3 times 7) and the sum of its digits is 2 + 1 = 3. Because of this, the reverse of any number that is divisible by three (or indeed, any permutation of its digits) is also divisible by three. For instance, 1368 and its reverse 8631 are both divisible by three (and so are 1386, 3168, 3186, 3618, and so on). A triangle is the most durable shape possible, the only \"perfect\" figure that, if all endpoints have hinges, will never change its shape unless the sides themselves are bent. 3 is the only integer between the mathematical constants e and π. Three of the five regular polyhedra have triangular faces—the tetrahedron, the octahedron, and the icosahedron. Also, three of the five regular polyhedra have vertices where three faces meet—the tetrahedron, the hexahedron (cube), and the dodecahedron. Furthermore, only three different types of polygons comprise the faces of the five regular polyhedra—the triangle, the quadrilateral, and the pentagon. There are only three distinct 4×4 panmagic squares. Only three tetrahedral numbers are also perfect squares. In numeral systems It is frequently noted by historians of numbers that early counting systems often relied on the three-patterned concept of \"One- Two- Many\" to describe counting limits. In other words, in their own language equivalent way, early peoples had a word to describe the quantities of one and two, but any quantity beyond this point was simply denoted as \"Many.\" As an extension to this insight, it can also be noted that early counting systems appear to have had limits at the numerals 2, 3, and 4. References to counting limits beyond these three indices do not appear to prevail as consistently in the historical record. List of basic calculations - Multiplication - Division - Exponentiation In science Astronomy - Earth is the third planet from the Sun. - There are three types of galaxies: Elliptical, spiral, and irregular. - Globular Cluster M3 (also known as Messier Object 3 or NGC 5272) is a globular cluster in the Canes Venatici constellation. - The Roman numeral III stands for giant star in the Yerkes spectral classification scheme. - The Roman numeral III (usually) stands for the third-discovered satellite of a planet or minor planet (for example, Pluto III) - In the constellation Orion, the \"belt\" is made up of 3 stars in a row. Biology - Classification of biological forms - 3 basic life domains: Archaea, Bacteria, and Eucarya - 3 phyla of Archaebacteria that are found mainly in extreme habitats where little else can survive: Methanogens, Halophiles, Thermoacidophiles. 3 distinct species of the genus Homo: - Homo habilis \"capable man\" - Homo erectus \"upright man\" - Homo sapiens \"wise man\" 3 distinct species of the genus Paranthropus: - Paranthropus robustus - Paranthropus boisei - Paranthropus aethiopicus 3 Proconsul species: - Proconsul africanus - Proconsul major - Proconsul nyanzae 3 Pan troglodyte sub-species: - Pan Troglodytes Schweinfurthii- (Eastern Common Chimpanzee) - Pan Troglodytes Troglodytes- (Central Common Chimp) - Pan Troglodytes Verus- (Western Common Chimp) 3 types of primates: - Prosimians - Monkeys (old & new world) - Apes (lesser & greater apes, as well as humans) 3 social group types of the Great Apes: - Orangutans (Solitary—little amount of both sexes) - Gorillas (Harems—great amount of one sex) - Common Chimps (Live in territories defended by related males—great amount of both sexes) Three traditional families of hominoid: - Hylobatidae: Include the so-called lesser apes of Asia, the gibbons and siamangs. - Hominidae: Include living humans and typically fossil apes that possess a suite of characteristics such as bipedalism, reduced canine size, and increasing brain size such as the australopithecines. - Pongidae: Include the remaining African great apes including gorillas, chimpanzees, and the Asian orangutan. - Molecular biology - The information in DNA and RNA is stored and transmitted in the form of a triplet codon system. - Anatomy - A human ear has three semicircular canals. - A human middle ear has three ossicles. - Physiology - 3 distinct Cytoskeleton components: Microtubules, Intermediate Filament, Actin Filaments - 3 primary cellular energy molecules: AMP, ADP, ATP - 3 main fatty acid categories: Saturated, Monounsaturated, Polyunsaturated - 3 substances metabolized for energy needs: Carbohydrates, Fats, Proteins - Triglycerides are the main storage forms of fatty acids. - 3 primary germ layers of a mammalian embryo: Endoderm, Mesoderm, Ectoderm. - Plants and Animals - Triceratops: Cretaceous period dinosaur with three horns on its head. - Shamrock: refers to one of several trifoliate (three-leaved) plants of the Leguminosae family which includes the clover. - 3-bodied general description of insects: Head, Thorax, Abdomen. - Trilobite: hard-bodied invertebrate marine arthropod of the Paleozoic era with three lobes. - Monocotyledon: A monocot's flower is often trimerous, with the flower parts in threes or in multiples of three (typically three, six, or nine petals). Chemistry - Three is the atomic number of lithium. - Atoms consist of three types of constituents: Protons, neutrons, and electrons. - 3 types of molecular bonds: Covalent, Ionic, and Polar Covalent (Dative or Coordinate). - 3 types of isomerism: Structural (Ethyl alcohol), Geometric (Maleic acid), and Optical (L-Lactic acid). - 3 types of hydrocarbon chains: Straight (Propane), Branched (Isobutane), and Circular (Cyclopropane). Geology - Three basic planes: Above, Surfaced, Beneath. - Three fundamental divisions of Earth's layers: Core, Mantle, and Crust. - Three main types of rock formations: Igneous, Metamorphic, and Sedimentary. - 3 types of earthquake waves: P (Primary) waves, S (Secondary) waves, and L/R (Love & Rayleigh) waves. - 3 types of volcanoes: Cinder cones, Shield volcano, and Composite volcano. Physics - Humans perceive the universe to have three spatial dimensions. - White light is composed of a mixture of the three additive primary hues: Red, green, and blue. - Particle physics - There are three generations of fundamental leptons (electron, muon, tauon and their neutrinos) and three groups of flavors of quarks (up-down, charmed-strange, top-bottom). - A neutron consists of three quarks: Two down quarks and one up quark. - Nature defines the state of supersymmetry as ±0 (left- and right-handed). This allows additional variations with respect to the breaking of supersymmetry involving the number three. The whole spectrum of possibilities based on the number three thus is duplicated for matter and antimatter. - Three is realized as 0 1 2 in the number of exponents defining the basic kinds of spin. These are ½*2^0 ħ (fermionic), ½*2^1 ħ (bosonic), ½*2^2 ħ (gravitational). The bosonic state is the symmetric state. - Changes of spin, appearing as changes of flavor, can be by only three multiples of a fundamental angular quantum of spin causing an 1/3 elementary charge e. The down quark only can change its spin from -1 to +2, the up-quark. A supersymmetric superstring can break supersymmetry from -0 to -3 (electron) or from +0 to +3 (positron). The electron anti-neutrino (+3) and electron neutrino (-3)represent three quanta of fermionic spin within the spacetime metric (no superstrings/particles), conserving supersymmetry globally. - Three non-gravitational forces actively are generated by three different superstring spin functionalities, while gravity is a passive reaction of spacetime due to the presence of superstrings with broken supersymmetry. - Three represents an optimum of economy in a physical geometrical realization and a maximum of functionality at the same time. This limits the otherwise nearly infinite number of degrees of freedom by a defined geometry with a specific functionality to exactly the ones needed to generate the fundamental basis for the expression of the \"Everything.\" - The number three is shown to be represented by different possible spin states in the regime from -3 to +3, that is by negative and positive integer numbers, including a -0 and +0, in contrast to mathematics where 0 is an integer number without sign. Due to geometrically defined quanta of spin, the superstring shows a physical realization of integer numbers between -3 and +3. This answers Roger Penrose's question of the physical meaning of integer numbers (Road to Reality, p. 65) and their relevance in the physical world. - Three different states of string tension exist. The whole geometry and functionality is the same with exception of the orthogonal magnetic flux component causing gravo-magnetic mass. Thus three generations of particles can exist solely according to energetic conditions. The basic relevance of the number three for the superstring in no way is touched. - Three is the smallest number that, in a physical realization, on breaking of symmetry allows the emergence of two additional functionalities different from the one of a central state. These either can be symmetric as in -3 (±0) +3 (electron, two supersymmetric superstrings (left/right-handed, no matter particles, dark), and the positron) or asymmetric as in -1 (-0) +2 (quarks) or -2 (+0) +1 (anti quarks). This means, breaking of a symmetry also can result in one of two different asymmetric states. In this case supersymmetry globally is conserved on the average by the properties of three quarks (enforced quark confinement). Multiplication of these angular spins by 1/3 gives the three particle charges, negative or positive are defined by the direction of angular spin. In technology - Three is the resin identification code used in recycling to identify polyvinyl chloride. - In ASCII, the code for \"3\" in hexadecimal is 33. This is the only character in ASCII such that a large file consisting of a single character has identical-looking hexadecimal and normal representation. - Three is approximately pi (which is closer to 3.14159) when doing rapid engineering wags or estimates. The same is true if one wants a rough-and-ready estimate of e, which is approximately 2.7183. - Some computer users may use \"3\" as an alternate to the letter \"E,\" often in jest or to prevent search engines from reading their messages. This form of code is an example of basic Leetspeak. - \"3\" is the DVD region code for many East Asian countries, except for Japan (which is Region 2) and China (which is Region 6). - The glyph \"3\" may be used as a substitute for yogh (Ȝ, ȝ) or ze (З, з) when those characters are not available. - Three is the minimum odd number of voting components for simple easy redundancy checks by direct comparison. In history - Christian Jürgensen Thomsen proposed the three-age system to divide prehistory in the Stone, Bronze and Iron Ages. - 3rd Reich of Germany: Adolf Hitler's Empire - 3rd Rome: Old name for Russia - 3rd Estate: French Revolution - 3rd Way: Mussolini's social movement - 3rd Wave: Journalistic name given to Newt Gingrich's social movement (U.S.) - Third Communist International was founded in 1919 by Vladimir Ilyich Lenin (He died after a 3rd stroke). In religion Abrahamic religions - There are three main Abrahamic religions: Judaism, Christianity, and Islam. - Noah had three sons: Shem, Ham and Japheth. Christianity - In the Christian concept of the Holy Trinity, God is a single being with three persons: The Father, Son and Holy Spirit. - Three Wise Men visited Jesus after his birth and brought him three gifts. - Jesus had three main disciples. - Jesus' main ministry lasted for 3 years before his crucifixion. - Jesus rose from the dead on the third day after his death. - Jesus predicted that Peter would deny him three times. - Paul's first letter to the Corinthians (1 Cor 13:13) mentions three theological virtues: faith, hope, and love. - In Roman Catholicism, there are three groups of martyrs, collectively known as Faith, Hope, and Charity (named after the Theological Virtues). - Catholicism also mentions three divisions in the spiritual world: Heaven, Hell, and Purgatory (or Limbo). Judaism - The three Patriarchs: Abraham, Isaac, and Jacob. - King Solomon states in Ecclesiastes 4:12: \"A three-ply cord is not easily severed.\" - The three pilgrim festivals (Sheloshet HaRegalim): Passover, Shavuot, and Sukkot. - The three leaders of the Jewish nation during their 40 years of wandering in the desert: Moses, Aaron, and Miriam. - The Tanakh is comprised of 3 sections: Torah, Nevi'im, and Ketuvim - There are 3 daily prayer services: Shacharit, Mincha, and Maariv - Shimon Hatzaddik taught: \"On three things the world stands: On Torah, on prayer, and on acts of kindness\" (Pirkei Avoth 1:2). Rabban Shimon ben Gamliel taught: \"The world continues to exist because of three things: justice, truth, and peace\" (ibid. 1:18). Islam - In Muslim devotional rites, certain formulas are repeated three times, and others, thirty-three times. - A devout Muslim tries to make a pilgrimage to all three holy cities of Islam: Mecca, Medina, and Jerusalem. Zoroastrianism - In their daily prayers, Zoroastrians commit themselves to pursuing three types of goodness: good thoughts, good words, and good deeds. - At the same time, they pray to reject three types of evil: Evil thoughts, evil words, and evil deeds. Hinduism - 3 main aspects of God (Trimurti) in Hinduism: Brahma, Vishnu, and Shiva (Maheshwara). - The three Gunas underlie action, in the Vedic system of knowledge. - The three Vedas are called trayi, that is, triad. - Lord Shiva is Trinetra, or three-eyed. - The famous \"Triveni\" is the confluence of three holy rivers: Ganga, Yamuna, and the hidden Sarasvati. In Buddhism - The Triple Gem—Buddha, Dhamma (Buddha's teaching) and Sangha (the preachers of Dhamma). - The Triple Bodhi (ways to understand the end of birth)—Budhu, Pasebudhu, Mahaarahath - Buddhism's three refuges are called \"Trisharana:\" Buddhan sharanam gacchami, Dhammam sharanam gacchami, Sangham sharanam gacchami. Other religions In mythology - 3 Greek gods: Zeus, Poseidon, Hades (Air, Water, Earth) - 3 Roman gods: Jupiter, Neptune, Pluto (Air, Water, Earth) - 3 mysterious figures amongst Norse gods: Hoenir, Lodurr, Mimir. - Ancient Egypt Theban Triad: Amun, Mut, and their son Khans. - 3 ancient Egyptian central religious figures: Horus, Isis, Osiris. - The Maya believed 3 stars in the Orion Constellation (Alnitak, Saiph, Rigel) were arranged by the gods as a triangular hearth, enclosing the smoke of the fire creation—the nebula. - 3 Greek Fates (Moirai, Moirés): Clotho, Lachesis, Atropos (sometimes referred to as the 3 spinners). - 3 Roman Fates: Decima, Nona (goddesses of birth), Morta (goddess of death) - 3 Roman Graces (or the Charities in Greek mythology, and according to the Spartans, Cleta was the third): Aglaia, Euphrosyne, Thalia. - 3 parts to a Chimera: Head of a lion, body of a goat, tail of a snake. - 3-faced goddess in Greek Mythology: Hecate - 3 Gorgons-(snake-haired sisters in Greek mythology): Stheno, Euryale, Medusa are sometimes depicted as having wings of gold, brazen claws, and the tusks of boars. Medusa is the only one of the gorgons that is mortal. - 3 different beings made up the different qualities of death according to ancient Greek belief: Thantos (male), Ker (female), Gorgo (female). - 3 Roman Furies (female personifications of vengeance) that were called the Erinyes (the Angry Ones) or Eumenides by the Ancient Greeks (Orestes called them the Solemn Ones, or the Kindly Ones): Alecto (\"unceasing\"), Megaera (\"grudging\"), Tisiphone (\"avenging murder\"). - 3-headed dog that guarded the gate to Hades in Greek Mythology: Cerberus - 3 ancient Greek Harpies: Aello, Ocypete, and Celaeno. In philosophy In Education - 3 R's: Reading, 'Riting, 'Rithmetic. - 3 levels: Primary (Elementary) Education, Secondary (Jr. and Sr. High) Education, Tertiary (College, University, Polytechnical Institute, TAFE) Education. - 3 levels of University degrees: Bachelor's, Maste, Doctor's (Ph.D., M.D., J.D., and so on) - 3 University distinctions at graduation: Cum Laude, Magna Cum Laude, Summa Cum Laude. - 3 good grade divisions: A, B, C - 3 levels to each grade formula: A+ (A plus), A (A neutral), A- (A minus) In politics - Plato split his utopian city into three populations: laborers, guardians (warriors), and philosophers (rulers) - Several polities have been ruled by three persons in a triumvirate or a troika. - Medieval theory divided society in laboratores (peasants), bellatores (noble warriors) and oratores (clergy). An earlier division had only the potentes (\"powerful,\" warriors) and the powerless. - In the Ancient Regime, the estates of the realm (for example, the French Estates General) were divided in a branch for aristocracy, another for the Catholic hierarchy and the Third Estate for rich peasants and bourgeoisie. The triumph of the Third Estate is the French Revolution. - By analogy to the Third Estate, the Third World (poor countries or non-aligned countries) was defined as different from the First World (led by the United States) and the Second World (led by the Soviet Union). - The \"third way\" is a political term applied to a variety of \"third choice\" options that some offer as an alternative to dichotomous situations which may otherwise appear polarized. - After the fall of Constantinople, the Tsars considered Moscow as the Third Rome. - Also Nazism considered Nazi Germany the Third Reich after the Holy Roman Empire and the Prussian Empire. - There are three branches to the US government; executive, legislative, and judicial. - Alvin Toffler's The Third Wave considers that the late twentieth century saw the beginning of a third wave of change in post-industrial civilization after the Neolithic and the Industrial Revolution. - The Third International supported Leninism. - Cenocracy is the word coined to represent what is believed by some to be the next and superior step to present day forms of Democratic rule. It is based on the notion that before a society can truly achieve a government Of-By-and For the people, the people themselves must play a direct part (and not be represented vicariously) in the law-making process. To this end, every man, woman, and worker must have access to such a role, thus constituting a true 3rd branch legislative body. For example, each State in the United States would adopt an ongoing list of self-elected candidates from which the 3 aforementioned persons would be randomly selected to fulfill one-year terms of office with at least the same pay, privileges and legislative power commensurate to all other congressional members. Lucky or unlucky number Three (三, formal writing: 叁, pinyin san1, Cantonese: saam1) is considered a good number in Chinese culture because it sounds like the word \"alive\" (生 pinyin sheng1, Cantonese: saang1), compared to four (四, pinyin: si4, Cantonese: sei3) that sounds like the word \"death\" (死 pinyin si3, Cantonese: sei2). Counting to three is common in situations where a group of people wish to perform an action in synchrony: Now, on the count of three, everybody pull! Assuming the counter is proceeding at a uniform rate, the first two counts are necessary to establish the rate, but then everyone can predict when \"three\" will come based on \"one\" and \"two;\" this is likely why three is used instead of some other number. In Vietnam, some consider it bad luck to take a photo with three people in it. Luck, especially bad luck, is often said to \"come in threes.\" Some cultures in history have a place for people of third gender such as in Thailand. There is a superstition that states it is unlucky to take a third light, that is, to be the third person to light a cigarette from the same match or lighter. This is commonly believed to date from the trenches of the First World War when a sniper might see the first light, take aim on the second and fire on the third. Three strikes and the player is out. It is commonly believed that \"third time's the charm.\" In music - In music, the Roman numeral iii is the mediant scale degree, chord, or diatonic function, when distinguished III = major and iii = minor. - Three is the number of performers in a trio. - There are 3 notes in a triad, the most important and basic form of any chord. - Any diatonic chord progression's key signature is made obvious with any 3 different triads, as opposed to potential key ambiguities with any 2 chords. - The tritone, which divides the octave into 3 equally spaced notes (root, tritone, octave), is the rarest interval of any mode, occurring semantically only twice, and physically once. It is the only interval that, when inverted, remains unchanged functionally and harmonically. - The 3/4 time signature[5] of Western classical music tradition is said to represent the Holy Trinity of Christian doctrine, Father, Son and Holy Spirit. It is for this reason that it is often utilized in compositions which were written for use in ecclesiastical rites, or that are inspired by scriptural/spiritual themes and texts. - In a standard jazz combo there are 3 necessary parts: bass, percussion, and chord maker. - 3 is The Magic Number, according to De La Soul. In Geography - Several cities are known as Tripoli from Greek for \"three cities.\" - Sicilia was known as Trinacria for its triangle-shape. In sports - In bowling, 3 strikes in a row is called a turkey. - In cricket, 3 outs in a row is called a hat trick. - In ice hockey, a game consists of 3 periods of twenty minutes each. - In rugby union, 3 is the jersey number of the starting tighthead prop. It is also the number of points received for a successful drop goal or penalty kick. - In baseball, 3 is the number of strikes before the batter is out and the number of outs per side per inning. It also represents the first baseman's position. The number 3 position in the batting order is generally occupied by the team's best hitter. In high school and college, 3 is the maximum \"drop\" (inches of length minus ounces of weight) for a legal bat. - In basketball, a shot made from behind the three-point arc is worth 3 points. 3 is used to represent the small forward position. - A hat-trick in sports is associated with succeeding at anything three times in three consecutive attempts. - In both American and Canadian football, the number of points received for a successful field goal. - In Canadian football, the last down before a team loses possession on downs. Usually, a team faced with a third down will punt (if far from the opponent's goal line) or attempt a field goal (if relatively close). - An Ironman triathlon consists of three events, a 2.4 mile (3.86 kilometer) swim, a 112 mile (180.2 kilometer) bike ride, and a 26.2 mile (42.2 kilometer) marathon run. - In football, number 3 is assigned in most cases to the left defender or fullback. In literature - 3 is the number of words or phrases in a Tripartite motto. - 3 is the number of novels or films in a trilogy and the number of interconnected works of art in a triptych. - The tricolon is often used for rhetorical effect. - Dante Alighieri's Divine Comedy has three parts each of thirty-three cantos (plus one introductory canto totaling 100). It was written in terza rima, a combination of tercets. All of this is an allusion to the Christian Trinity. - The number three recurs several times in Tolkien's The Lord of the Rings and also in The Silmarillion. Three Rings of Power were given to the Elves. There are three Silmarils. The unions of the Eldar (Elves) and the Edain (Men) were three in number: Beren and Lúthien, Tuor and Idril, and (of course) Aragorn and Arwen. - Three Blind Mice is a children's nursery rhyme and musical round. - The Three Musketeers is a novel by Alexandre Dumas, and is part of a trilogy. - The Three Sisters is a play by Anton Chekhov. In other fields - The French Revolution espoused three values (liberty, equality, fraternity). - The flags of many nations have three colors, including the flags of the United States, France, Colombia. - The number of stars in \"Pacific's triple star\" in the God Defend New Zealand, one of New Zealand's two national anthems. - The phrase \"Third time's the charm\" (or, rarely, \"Three time's the charm\") usually means that the third time a person attempts something, he or she will succeed. - Three-bean salad is an appetizer containing three types of beans, such as kidney, yellow, and green beans. - In most earlier video games, three lives were commonly given to players at the start. - The television VHF channel most often used for hooking up VCRs and/or video game systems. If it is otherwise occupied by a local broadcaster, then channel 4 is used instead. - On most phones, the 3 key is associated with the letters D, E, and F, but on the BlackBerry it is the key for U and I. - The number 3 is often used as a literary device to provoke a feeling of unnaturalness, as twos are much more common in nature (pairs of limbs, hemispheres, eyes, and so forth). This is a prevailing theme in Ray Bradbury's novel Fahrenheit 451. The aliens and their machines in the 2005 film War of the Worlds were associated with features recurring in threes: eyes, legs, fingers, and so on, for this reason. - A tricycle has three wheels. - Three Giza Pyramids: Khufu, Khafre, and Menkaure (Giza pyramid complex). See also Notes - ↑ A natural number is any number that is a positive integer, such as 1, 2, 3, 4, and so forth. Often, the number 0 is also called a natural number. - ↑ A cardinal number indicates the quantity of things, but not the order in which they occur. By contrast, ordinal numbers are first, second, third, and so on, indicating their positions in a series. - ↑ A real number is a number that can be given by a finite or infinite decimal representation. The term \"real number\" was coined to distinguish it from an \"imaginary number.\" The set of real numbers includes rational and irrational numbers, which can be positive, negative, or zero. - ↑ Georges Ifrah, The Universal History of Numbers: From Prehistory to the Invention of the Computer (New York: Wiley, 2000, ISBN 0471393401), 393. - ↑ The 3/4 time signature refers to three beats to a measure, with the quarter note comprising the beat. ReferencesISBN links support NWE through referral fees - Flegg, Graham. Numbers: Their History and Meaning. Mineola, NY: Dover Publications, 2002. ISBN 0486421651. - Ifrah, Georges. The Universal History of Numbers: From Prehistory to the Invention of the Computer. Translated by David Bellos et al. New York: Wiley, 2000. ISBN 0471393401. - McLeish, John. The Story of Numbers: How Mathematics Has Shaped Civilization. New York: Fawcett Columbine, 1994. ISBN 0449909387. - Menninger, Karl. Number Words and Number Symbols: A Cultural History of Numbers. New York: Dover Publications, 1992. ISBN 0486270963. - Wells, D. G. The Penguin Dictionary of Curious and Interesting Numbers. London, UK: Penguin Books, 1998. ISBN 0140261494. External links All links retrieved June 13, 2023. - Number \"3\" and \"recycling\" Teachers.net. - Dr. John A. McNulty. List of Three's in Anatomy. Credits New World Encyclopedia writers and editors rewrote and completed the Wikipedia article in accordance with New World Encyclopedia standards. This article abides by terms of the Creative Commons CC-by-sa 3.0 License (CC-by-sa), which may be used and disseminated with proper attribution. Credit is due under the terms of this license that can reference both the New World Encyclopedia contributors and the selfless volunteer contributors of the Wikimedia Foundation. To cite this article click here for a list of acceptable citing formats.The history of earlier contributions by wikipedians is accessible to researchers here: The history of this article since it was imported to New World Encyclopedia: Note: Some restrictions may apply to use of individual images which are separately licensed."
}