{
  "url": "https://squareup.com/us/en",
  "title": "Power your entire business | Square",
  "text": "Please update your browser. Download the latest version of a supported browser below to get the most out of this website: Local legend or global icon. Make it big on your block. Whatever your flavor of business, build and grow on your terms. See your whole business click into place Take payments Take payments Sell anything in person and online with a point of sale platform that works for whatever you sell. Manage your team Manage your team Run payroll, schedule shifts, and take care of admin — so your team can focus on performing their best. Grow your customer base Grow your customer base Set up the right marketing campaigns and loyalty program to welcome new customers and keep them coming back for more. Control your cash flow² Control your cash flow² Bring your revenue under one roof. Instantly access your funds, save for future expenses, and get quicker access to loans. Connect your favorite apps Connect your favorite apps Square partners with hundreds of apps so you can manage your entire business without jumping between. Get the latest updates from Square Nice to meet you. We think businesses are as unique as the people who run them. Get individualized content on the topics you care about most by telling us a little more about yourself. 1All credit sale plans are issued by Block, Inc. Not available to merchants in AL, DE, MO, MS, NH, and TN. Purchase amounts must be from $49 to $10,000. APR is 15%. Available plan lengths vary from 3, 6, 12, and/or 24 month installments, depending on purchase amount. Sales tax, where applicable, will be due at checkout. All plans subject to credit approval and other factors. 2Block, Inc. is a financial services platform and not an FDIC-insured bank. FDIC deposit insurance coverage only protects against the failure of an FDIC-insured deposit institution. If you have a Square Checking account, up to $250,000 of your balance may be covered by FDIC insurance on a pass-through basis through Sutton Bank, Member FDIC, subject to aggregation of the account holder’s funds held at Sutton Bank and if certain conditions have been met. Square Debit Card is issued by Sutton Bank, Member FDIC, pursuant to a license from Mastercard. Funds generated through Square’s payment processing services are generally available in the Square Checking account balance immediately after a payment is processed. Fund availability times may vary due to technical issues. Square, the Square logo, Square Financial Services, Square Capital, and others are trademarks of Block, Inc. and/or its subsidiaries. Square Financial Services, Inc. is a wholly owned subsidiary of Block, Inc. All loans are issued by Square Financial Services, Inc. Actual fee depends upon payment card processing history, loan amount and other eligibility factors. A minimum payment of 1/18th of the initial loan balance is required every 60 days and full loan repayment is required within 18 months. Loan eligibility is not guaranteed. All loans are subject to credit approval."
}