{
  "url": "https://www.convertunits.com/from/kg/to/lbs",
  "title": "Convert kg to lbs - Conversion of Measurement Units",
  "text": "How many kg in 1 lbs? The answer is 0.45359237. We assume you are converting between kilogram and pound. You can view more details on each measurement unit: kg or lbs The SI base unit for mass is the kilogram. 1 kilogram is equal to 2.2046226218488 lbs. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between kilograms and pounds. Type in your own numbers in the form to convert the units! 1 kg to lbs = 2.20462 lbs 5 kg to lbs = 11.02311 lbs 10 kg to lbs = 22.04623 lbs 15 kg to lbs = 33.06934 lbs 20 kg to lbs = 44.09245 lbs 25 kg to lbs = 55.11557 lbs 30 kg to lbs = 66.13868 lbs 40 kg to lbs = 88.1849 lbs 50 kg to lbs = 110.23113 lbs You can do the reverse unit conversion from lbs to kg, or enter any two units below: The kilogram or kilogramme, (symbol: kg) is the SI base unit of mass. A gram is defined as one thousandth of a kilogram. Conversion of units describes equivalent units of mass in other systems. The pound (abbreviation: lb) is a unit of mass or weight in a number of different systems, including English units, Imperial units, and United States customary units. Its size can vary from system to system. The most commonly used pound today is the international avoirdupois pound. The international avoirdupois pound is equal to exactly 453.59237 grams. The definition of the international pound was agreed by the United States and countries of the Commonwealth of Nations in 1958. In the United Kingdom, the use of the international pound was implemented in the Weights and Measures Act 1963. An avoirdupois pound is equal to 16 avoirdupois ounces and to exactly 7,000 grains. ConvertUnits.com provides an online conversion calculator for all types of measurement units. You can find metric conversion tables for SI units, as well as English units, currency, and other data. Type in unit symbols, abbreviations, or full names for units of length, area, mass, pressure, and other types. Examples include mm, inch, 70 kg, 150 lbs, US fluid ounce, 6'3\", 10 stone 4, cubic cm, metres squared, grams, moles, feet per second, and many more!"
}