{
  "url": "https://www.photovoltaikforum.com/thread/220317-deye-oder-bosswerk-mi300-300w-balkon-wr-mit-sunlit-app-koppeln-tutorial-nach-pro/",
  "title": "Deye oder Bosswerk MI300 (300W) Balkon-WR mit Sunlit App koppeln - Tutorial nach Problemen - Wechselrichter - Photovoltaikforum",
  "text": "Nachdem ich sehr lange rumprobiert habe, da die Verbindungen zu Sunlit nicht zustande gekommen sind, hier einige Hinweise. Bei mir gab es summarisch insgesamt 2 Probleme: - Der WR zieht sich keine IP Adresse im WLAN. - Der WR wusste nicht, wohin er die Daten schicken soll, um sich mit Sunlit zu verbinden. - Verkomplizierung: Der WR lief instabil, insbesondere bei geringem Lichteinfall auf das angeschlossene PV-Modul, Konnektivität reißt immer ab. Gelöst wie folgt: 1. Sonnigen Tag abwarten. Insbesondere die kleinen WR (300W, sei es von Bosswerk oder Deye) brauchen relativ viel Licht, um anzulaufen und stabil zu arbeiten. Das externe Netzrelais (vielfach nachträglich geliefert) braucht auch nochmal Strom. PV Modul an WR und WR via Netzrelais an Steckdose. 2. Mit dem PC geht es vielfach leichter als mit dem Smartphone. Schaltet alle Eure WLANs im verwendeten PC auf manuelle Verbindung (also das Häkchen bei „automatische Verbindung herstellen“ raus). So seid ihr sicher, dass ihr entweder mit dem richtigen AP oder WLAN gekoppelt seid oder eben mit keinem, solltet ihr rausfallen. Beim Reset des WR oder sonstigem Rausfallen aus der WLAN-Verbindung springt sonst das WLAN wieder auf die „automatische“ Verbindung und der Aufruf der lokalen WR-Seite funktioniert dann nicht. 3. Wenn externes Netzrelais noch nicht gekoppelt ist, nach Anleitung koppeln. Hinweis hier: Das Netzrelais kommuniziert über den AP des Wechselrichters mit diesem. Nicht über das Haus-WLAN! Der lokale AP des WR hat die IP 10.10.100.254, der AP des Netzrelais 10.10.101.254. 4. Prüfen lt. Anleitung und den LEDs, ob des Netzrelais gekoppelt ist. Stromfluss ist ein sicheres Zeichen. Ansonsten mit dem AP des Netzrelais koppeln und im Status nachsehen, ob bei „Device Information“ der zweite Eintrag (also ab Router SSID) auf den vorgelagerten WR AP weist, erkennbar an Router SSID AP_Seriennummer_des_WR. Der erste Eintrag ist der lokale AP des Netzrelais. Zugewiesene IP Adresse im Netzrelais sollte 10.10.100.150 sein. 5. Mit dem AP des WR verbinden. Im versteckten Menü des WR 10.10.100.254\\config_hide.html aufrufen. Hier bei Server A und B settings kontrollieren, ob die Zieladresse des Datensammelservers eingetragen ist, bei mir war aus unerfindlichem Grund beim einen WR die Adresse da, beim anderen aber nicht. IP Adresse: leer, Domain name: 5406.deviceaccess.host, Port 10000 TCP. Löst das Problem oben b. 6. Die Sunlit App schickt bei Einrichten die Parameter Netzwerk SSID, Passwort und DHPC automatisch an den WR und wartet dann 15min, ob sich der WR zentral meldet. Ansonsten muss die Einrichtung wiederholt werden. 7. Punkt 6 ist deshalb wichtig zu verstehen, weil keiner meiner 300W Wechselrichter jemals eine IP-Adresse automatisch bezogen hat und daher nie eine Verbindung mit dem WLAN und zum Remote Server, den die Sunlit App verwendet, zustande kam. Bei wem das funktioniert hat, sollte die App jetzt funktionieren. Bei mir musste man tricksen und binnen 15min ab Einrichtungsbeginn (in der Sunlit App) die folgenden Schritte tun. Gleiches gilt, wer von vornherein nur feste IP-Adressen vergibt. 8. Im vorgelagerten Router ist entweder DHPC abgeschaltet (sofern man grundsätzlich nur mit festen IP Adressen arbeitet). Oder: Bei grundsätzlicher Vergabe durch DHCP: durch IMAC Bindung dem WR eine IP Adresse reservieren. Wenn er sie zieht, schön, wenn nicht, muss man dem WR manuell genau diese IP geben und sein DHCP abschalten. Dazu: Mit AP des WR lokal verbinden. Im Menü „Wizard“ das WLAN auswählen, SSID und Passwort eingeben, dann DHCP abschalten/disable, IP Adresse/Subnetz/ Gateway/DNS manuell eingeben und speichern. WR startet neu und verliert dabei die Verbindung via AP zum PC. Dann nochmal mit dem AP verbinden und unter Quick Set nachschauen, ob der WR alle Einstellungen übernommen hat. Auch das ar mehrfach nicht der Fall! Damit sollte – wenn alles richtig ist – der WR im lokalen WLAN sein. 9. Warten bis die Anzeige in der Sunlit App erfolgt. Ansonsten die Einrichtung in der App neu starten und binnen der 15min versuchen, die Verbindung wie vor herzustellen. 10. Kontrollen: WR über die WLAN IP im lokalen Netz aufrufen, wenn er reagiert und das Statusmenü liefert (Eingabe von Benutzername/Rasswort), ist die Verbindung da, und er kann auch seine Daten versenden. Dazu steht auf der Status Seite unten bei Remote Server Connection der erste Eintrag „Remote Server A“ auf „connected“. 11. Wichtig: wann immer ihr die Einrichtung der Verbindung via Sunlit App neu startet, ihr überschreibt damit die relevanten IP Einstellungen im WR. Also ggf. binnen 15min Schritt 8 wiederholen. 12. Wer den AP des WR schützen will: Standard Passwort auf der config_hide.html ändern. Aufpassen: damit muss auch im Netzrelais die Verbindung zum AP nochmals angepasst werden, d.h. das neue Passwort verwendet werden zur Ankopplung. Hoffe, ich konnte damit etwas helfen."
}