{
  "url": "http://www.iltransitionalmath.org/getting-started-kit/isbe-course-codes/",
  "title": "ISBE Course Codes – PWR Transitional Math",
  "text": "02055A001 – High School Transitional Math 4 – STEM Portability code: TM001 Math course framework built around essential algebraic competencies designed to prepare students for college and career pathways in areas such as: Science, Technology, Engineering, and Math or STEM which require advanced algebraic skills or calculus. Course design will enable students to transition directly into credit bearing college-level algebra courses. Students will engage in deepening conceptual understanding using algebra and mathematical applications of algebra and functions and how functions naturally arise using authentic modeling situations. The function families (linear, polynomial, rational, radical, and exponential) will be emphasized. Additionally, the course shall emphasize the eight mathematical practices, particularly modeling within the setting of authentic and contextualized applications, and upon completion, the student should be able to: demonstrate and justify both orally and in writing conceptual understanding of functions combined with advanced algebraic knowledge to solve complex, contextualized, multi-step problems in authentic settings. 02201A001 – High School Transitional Math 4 – Quantitative Literacy and Statistics Portability code: TM002 Math course framework designed to prepare and transition students directly into college and career pathways requiring general education college level math competencies in quantitative literacy and statistics. The competencies within each domain should include, but are not limited to: numeracy (operation sense, estimation, measurement, quantitative reasoning, basic statistics, and mathematical summaries), application based algebraic topics, and functions and modeling. Upon completion students should be able to: demonstrate proficiency and understanding in basic numeracy competencies in whole numbers, integers, fractions, and decimals, use estimation and explain/justify estimates, apply quantitative reasoning to solve problems involving quantities or rates, use mathematical summaries of data such as mean, median, and mode, use and apply algebraic reasoning as one of multiple problemsolving tools, and use functions and modeling processes. Course to be delivered through authentic application, problem based instruction designed to build mathematical conceptual understanding and critical thinking skills. 02153A001 – High School Transitional Math 4 – Technical Math (CTE) Portability code: TM003 Math course framework intended and designed specifically to transition students to post-secondary technical pathways or careers. Course work should align directly with the post-secondary technical math or career pathway. The course should encompass, but is not limited to number sense and number systems, geometry, and basic algebra delivered through authentic, contextualized, problem based learning environments not limited to stand alone courses, but may be incorporated into existing career and technical education (CTE) courses."
}