{
  "url": "https://support.microsoft.com/en-us/windows/find-your-windows-product-key-aaa2bf69-7b2b-9f13-f581-a806abf0a886",
  "title": "Find your Windows product key - Microsoft Support",
  "text": "Find your Windows product key Applies To A Windows product key is a 25-character code used to activate Windows. It looks like this: - PRODUCT KEY: XXXXX-XXXXX-XXXXX-XXXXX-XXXXX Locate your product key for Windows 10 or Windows 11 Depending on how you got your copy of Windows 10 or Windows 11, you'll need either a 25-character product key or a digital license to activate it. A digital license is a method of activation in Windows 10 and Windows 11 that doesn't require you to enter a product key. Without one of these, you won't be able to activate your device. Where to find your product key depends on how you got your copy of Windows. Select any of the following to see more information: The product key is preinstalled on your PC, included with the packaging the PC came in, or included on the Certificate of Authenticity (COA) attached to the PC. For more info, contact your hardware manufacturer, and for pictures of authentic product keys and COA labels, see How to tell your hardware is genuine. The product key is on a label or card inside the box that Windows came in. For more info, contact the retailer that sold you Windows 10 or Windows 11. How to tell your software is genuine. Find your product key in the confirmation email you received after buying Windows 10 or Windows 11 in a digital locker accessible through the retailer’s website. The product key is in the confirmation email you received after buying your digital copy of Windows. Microsoft only keeps a record of product keys if you purchased from the Microsoft online store. You can find out if you purchased from Microsoft in your Microsoft account Order history. If you upgraded to Windows 11 for free from Windows 10, or upgraded to Windows 10 for free from Windows 7 or Windows 8.1, you should have a digital license instead of a product key. If you bought Windows 10 or Windows 11 Pro upgrade in the Microsoft Store app, you'll receive a digital license instead of a product key in the confirmation email that was sent to confirm the purchase. That email address (MSA) will contain the digital license. You can use the digital license for activation. For more information about digital licenses and product keys in Windows 10 and Windows 11, see the “Methods of Activation” section in Activate Windows. Your product key is available through the web portal for your program. For more information, see Volume Activation for Windows 10. Locate your product key for Windows 7 or Windows 8.1 A product key is usually required when uninstalling or reinstalling Windows 7 or Windows 8.1. Generally, if you bought a physical copy of Windows, the product key should be on a label or card inside the box that Windows came in. If Windows came preinstalled on your PC, the product key should appear on a sticker on your device. If you’ve lost or can’t find the product key, contact the manufacturer. To ensure your product key is genuine, see How to tell your software is genuine and How to tell your hardware is genuine. Related links For info about how to tell if your copy of Windows is genuine Microsoft software, see the How to tell page. For more Windows 11 download info, see Download Windows 11. For more Windows 10 download info, see Download Windows 10. If you need installation media to install or reinstall Windows, see Create installation media for Windows to learn how to create your own installation media using either a USB flash drive or a DVD. If you need more help with activation, see Activate Windows. If you're getting an activation error, see Get help with Windows activation errors. If you’re reinstalling Windows, you might not need a Windows product key. See Activation in Windows for more info. If you're reinstalling Windows 10 or Windows 11 due to a motherboard problem or some other hardware issue, see Reactivating Windows after a hardware change. If you're looking for product keys for Office, apps, games, and more, see Find your Microsoft downloads and product keys"
}