{
  "url": "https://www.metric-conversions.org/temperature-conversion.htm",
  "title": "Temperature conversion calculators for Celsius, Fahrenheit etc.",
  "text": "Being able to convert between different temperature units is useful in many applications. The most common temperature scales are Celsius (°C), Fahrenheit (°F) and Kelvin (K). Celsius is used the most worldwide whilst Fahrenheit is mainly used in the United States of America. Kelvin is normally only used in science. Understanding temperature conversions can be useful when understanding weather forecasts, when cooking, checking for a fever and in scientific research. Celsius (°C) Celsius (°C) is the most common temperature measurement unit worldwide. It is named after the Swedish astronomer Anders Celsius who created it in 1742. Celsius (or Centigrade) is based on the freezing and boiling points of water at standard atmospheric pressure. The freezing point of water is defined as 0°C and the boiling point defined as 100°C with 100 degrees between the two points. The Celsius scale is widely used in weather forecasts, home and building heating and air conditioning and science. Fahrenheit (°F) Fahrenheit is a temperature unit commonly used in the United States and, occasionally, elsewhere. It was created by a German physicist named Daniel Gabriel Fahrenheit in the early 1700s. The scale is based on the freezing and boiling points of water at standard atmospheric pressure, with the freezing point at 32°F and the boiling point at 212°F giving 180 degrees between the two points. The smaller degree increments on the Fahrenheit scale allow for a more precise temperature when using whole numbers which can be particularly useful when describing the weather or the temperature in a building. Some people find the Fahrenheit scale is more intuitive to use but this is likely to be a consequence of what those individuals are accustomed to. Fahrenheit is not often used internationally, as most have adopted the Celsius (°C) scale as the standard. Kelvin (K) Kelvin (K) is an absolute temperature unit in the International System of Units (SI). The Scottish physicist William Thomson (Lord Kelvin) made significant contributions to the field of thermodynamics and the scale is named after him. Kelvin starts at absolute zero which is the point at which all molecular motion ceases and, because of this, the symbol for Kelvin is simply a \"K\" and not degrees K (or °K). The Kelvin scale has the same increments as the Celsius scale but starts at absolute zero as opposed to the freezing point of water. This makes Kelvin a more suitable scale for science as it eliminates negative values and allows for direct proportionality between temperature and thermodynamic properties. The freezing point of water on the Kelvin scale is 273.15K. Kelvin is used in physics, chemistry, and cosmology. It is especially used when making precise measurements and calculations on thermodynamics. Other units of temperature Other units of temperature featured on this site are Rankine, Delisle, Newton, Réaumur, and Rømer. The Rankine scale is an absolute temperature scale commonly used in engineering and thermodynamics. It is similar to the Fahrenheit scale, but with zero degrees Rankine being absolute zero. The Rankine scale is often used in conjunction with the Kelvin scale for scientific calculations. The Delisle scale is named after the French astronomer Joseph-Nicolas Delisle. The freezing point of water on this scale is 150 degrees and the boiling point at 0 degrees. This scale used to be used in Russia until they switched to use the Celsius scale. The Newton temperature scale (not to be confused with the Newton as a unit of force) is named after Sir Isaac Newton. The freezing point of water is 0 degrees and the boiling point at 33 degrees. This scale is hardly ever used today, but was once popular in the science. The Réaumur scale is named after René Antoine Ferchault de Réaumur. On this scale the freezing point of water is 0 degrees and the boiling point is 80 degrees. This scale was popular in Europe during the 18th and 19th centuries but is now consigned to the history books. The Rømer scale was named after Ole Rømer. With the freezing point of water at 7.5 degrees and the boiling point at 60 degrees, this scale was used in Denmark in the 17th and 18th centuries. What is the relationship between temperature and thermal energy? In thermodynamics, temperature and thermal energy are closely related. The temperature refers to the average kinetic energy of the particles in a substance, while thermal energy refers to the total kinetic energy of the particles in a substance. When two objects at different temperatures come into contact heat flows from the hotter object to the cooler object. This transfer continues until both reach the same temperature which is thermal equilibrium. The amount of heat transferred in this process is faster, the higher their temperature difference. It is important to understant that thermal energy and temperature are not the same. For example, a cup of water at 20°C and a swimming pool filled with water at 20°C clearly have the same temperature but the swimming pool contains much more thermal energy due to its greater volume."
}