{
  "url": "https://forums.terraria.org/index.php?threads/terraria-offline-wiki.57091/",
  "title": "Terraria offline wiki | Terraria Community Forums",
  "text": "PurpleDjango Skeletron Prime Hello my fellow Terrarians, recently I took the liberty to download and compact a great deal of webpages for offline use, as you might not be able to connect to the internet right away. This guide should have a great deal of relevant information for you to get your Terraria world started! There is one zip file containing organized folders filled with mhtml files (They are pretty much saved webpages that can be viewed offline), the sources I got them from are Gamepedia and Wikia, but there are some other minor websites I got them from. Right now links and videos will not work, but I added most useful links into subcatagory folders so you should have no problem finding them. The benefit of using this is it can be viewed offline, it's easy to access, and it has super fast load times without using data. This guide will work on both PC and Mobile (Not sure about ios, you could try) To open them, just click on the file and it should open in your browser. Anyways, I hope this is helpful! Here is the link: https://www.dropbox.com/s/fivudmd9n5hhfyk/Terraria Offline Wiki.zip?dl=0 It should only be around 40 mb, have a good day This guide should have a great deal of relevant information for you to get your Terraria world started! There is one zip file containing organized folders filled with mhtml files (They are pretty much saved webpages that can be viewed offline), the sources I got them from are Gamepedia and Wikia, but there are some other minor websites I got them from. Right now links and videos will not work, but I added most useful links into subcatagory folders so you should have no problem finding them. The benefit of using this is it can be viewed offline, it's easy to access, and it has super fast load times without using data. This guide will work on both PC and Mobile (Not sure about ios, you could try) To open them, just click on the file and it should open in your browser. Anyways, I hope this is helpful! Here is the link: https://www.dropbox.com/s/fivudmd9n5hhfyk/Terraria Offline Wiki.zip?dl=0 It should only be around 40 mb, have a good day"
}