{
  "url": "https://www.dole.com/",
  "title": "Fresh bananas, pineapples, and more Dole fruits | Dole",
  "text": "MAKING THE WORLD A HEALTHIER PLACE Discover a New Slice of Paradise From the company that knows pineapples best comes a new treasure. Dole’s new Colada Royale pineapple brings a smooth, tropical sweetness with subtle coconut notes for a truly elevated pineapple experience. Crafted for those who savor something special. Dole Resources, Recipes and Recommendations for GLP-1 Medications GLP-1 medications are changing how people think about weight loss and blood sugar management, but food still matters. Discover how fresh fruits and vegetables can play a practical, satisfying role alongside this medication, with recipes, tips, and real-world guidance designed for everyday life. Visit our GLP-1 resource hub to explore smart, produce-forward ways to nourish your body and support your journey. Eat Healthy At Home From kids to adults, these delicious recipes are sure to please the crowd on any occasion. Monthly Nutrition News Articles Treat yourself to inspiring ideas, learn why it's important to get enough exercise, and find out more about the various nutrients in fruit and vegetables. 2023 Dole plc Sustainability Report For over 170 years, we have been as proud to deliver nutritious, high-quality produce all around the world, as we have been to take responsibility for the land from which it is grown. And we are equally committed to supporting and enhancing the global communities that ensure we can produce and deliver the quality produce we are known for. The Dole Way is our enduring commitment to grow, process and distribute our produce responsibly- today and for generations to come. Read more about our progress here. 2022-2023 Dole Fresh Fruit Sustainability Report Dole Quick-fire Challenge How fast can you whip up some delicious Dole recipes? Find out in our Dole Quick-fire Challenge Game! Tips for Healthy Living Enjoy regular servings of fascinating topics and information, not to mention practical, everyday tips for a happy and healthy lifestyle. Goodness Stems from the Roots We believe we cannot be successful without ensuring that our people, resources, environment and communities are treated as our most precious assets."
}