{
  "url": "https://www.foodandwine.com/bellini-cocktail-recipe-11874983",
  "title": "Bellini Cocktail Recipe",
  "text": "Drinks Cocktails Brunch Cocktails Sparkling Wine Cocktails Bellini Be the first to rate & review! This peachy sparkler was said to be Princess Diana’s go-to sip. By Prairie Rose Prairie Rose Prairie Rose is Food & Wine's senior drinks editor. A trained sommelier, cocktail book author, and wine and spirits educator, in addition to Food & Wine she is also the senior editor of Liquor.com. Food & Wine's Editorial Guidelines Published on December 29, 2025 Save Rate PRINT Share Close Credit: Food & Wine / Photo by Carson Downing / Food Styling by Lauren McAnelly / Prop Styling by Sue Mitchell Prep Time: 1 mins Total Time: 2 mins Jump to recipe The Bellini is an elegant, two-part cocktail that pairs chilled sparkling wine with white peach purée. First poured at Harry’s Bar in Venice in the mid-20th century, it was created as a seasonal specialty by the bar’s owner and famed chef, Giuseppe Cipriani. His original version combined puréed white peaches with dry Italian sparkling wine — typically Prosecco — sometimes finished with a touch of berry juice to enhance its pale pink hue. Cipriani named the drink after 15th-century Venetian painter Giovanni Bellini, inspired by the soft blush tones in the artist’s work. Though she wasn’t a big drinker, the Bellini was said to be a favorite of Princess Diana’s. There are rumored stories about her sneaking out to gay bars in disguise with Freddie Mercury in the late ’80s, and the Bellini was her drink of choice. Though this has never been verified, her love of Bellinis was widely known. Over time, fresh purée was often replaced with peach liqueur, dulling the cocktail’s delicacy. With the return of fresh juice to cocktail culture in the early 2000s, the Bellini saw a rebirth. The 12 Best Cocktails to Make With Sparkling Wine Why the Bellini works Traditionally served only during peak white peach season in Italy, the Bellini benefits from ripe, high-quality fruit. Elegant yet unfussy, the Bellini captures the essence of Italian aperitivo culture: simple, seasonal, and lower in alcohol. White peaches are known for their sweetness and delicate, floral characteristics. They are also less acidic than yellow peaches. The Bellini’s brilliance lies in balance — the perfume and gentle sweetness of ripe white peaches matches the crisp lift of bubbles in sparkling wine, each amplifying the other. Keep Screen Awake Ingredients 1/2x 1x 2x Oops! Something went wrong. Our team is working on it. 1 1/2 ounces fresh white peach purée (see recipe below) Chilled sparkling wine, to top Peach slice, for garnish Directions Add the peach purée to a Champagne flute. Top with the sparkling wine. Garnish with a peach slice. How to make peach purée Remove skins and pits from 4 fresh peaches. If using frozen peaches, thaw 1 pound (16 ounces) of frozen sliced peaches. Blend peaches in a food processor until smooth. This should yield 2 to 2 1/2 cups of purée. This can keep up to five days in the refrigerator or up to three months or more in the freezer. Save Rate Print"
}