{
  "url": "https://www.foxnews.com/entertainment/brad-pitt-wins-court-ruling-forcing-angelina-jolie-reveal-private-texts?msockid=01e81dc801d468c615d80b3f00d969f7",
  "title": "Judge orders Angelina Jolie turn over private messages in Brad Pitt winery lawsuit | Fox News",
  "text": "Brad Pitt might have uncovered a \"smoking gun\" in the long-running legal fight against his ex-wife, Angelina Jolie. Fox News Digital can confirm a judge recently ruled in Pitt's favor, forcing Jolie to turn over 22 previously undisclosed documents. The docs reportedly contain Jolie's private messages which could be damaging to the \"Maleficent\" star's case. Pitt first sued Jolie over the sale of her stake in Château Miraval in 2022 after the actress sold her stake to a subsidiary of the Stoli Group. Jolie attempted to sell her company, Nouvel, to Tenute Del Mondo, a subsidiary of the Stoli Group, in 2021, effectively transferring her 50% ownership interest in Miraval. Pitt has fought this sale, claiming the move breached a contract between the two. According to Jolie's team, the ruling is being reviewed by an appeals court. \"Every aspect of Mr. Pitt’s lawsuit against Angelina is an extension of his need to harass and control her,\" Paul Murphy, Jolie's lawyer, told Fox News Digital. \"Angelina’s appeal is about upholding a fundamental right that belongs to everyone: Clients are allowed to discuss their lawyers’ advice with trusted advisers to understand their options and make informed decisions. That’s exactly what Angelina did. Mr. Pitt just cannot allow himself to accept that Angelina has the right to discuss her options in private with her own attorneys and trusted advisors without his interference. We are pleased the appeals court issued an immediate stay and will now be reviewing Pitt’s attempt to invade Angelina’s privileged communications.\" BRAD PITT'S AGGRESSIVE LEGAL MOVE COULD EXPOSE ANGELINA JOLIE'S PRIVATE MESSAGES The previously undisclosed documents, including Jolie's private messages, could be \"outcome-changing or even outcome-determinative\" to Pitt's case against the actress, legal experts told Fox News Digital. \"I cannot imagine a scenario where Jolie’s team would fight this battle based on a long-shot argument if the documents were not helpful to Brad’s case,\" Brett Ward, a partner in Blank Rome's Matrimonial and Family Law Group, explained to Fox News Digital. \"Generally speaking, the bigger the effort to protect documents, the more important they are. So, given Jolie’s significant effort to protect them, I would expect that these private messages weaken Jolie’s position in the case, perhaps fatally.\" While the discovery ruling is very common, entertainment lawyer Tre Lovell noted it could be a big win for Pitt. \"The parties to litigation have disputes all the time as to what documents must be produced, what questions must be answered and what discovery responses need to be addressed as opposed to pure objections,\" he explained to Fox News Digital. \"Obviously, these documents are believed to be very damning against Jolie due to the extent and effort her attorneys expended to avoid producing them. It appears to be a big win for Pitt.\" BRAD PITT, ANGELINA JOLIE'S HEATED WINERY BATTLE WILL HEAD TO COURT Jolie's legal team had argued the undisclosed documents were protected by attorney-client privelege. However, Pitt's team insisted the messages were unprotected conversations between Jolie and her personal aides – including financial advisers and PR consultants. Jolie's private messages could expose the actress, or they could never see the light of day. \"With regard to whether or not the … messages become public, that is really up to Brad Pitt,\" Patrick Baghdaserians, a family law attorney, told Fox News Digital. \"Generally speaking with discovery motions, the documents that are ordered to be produced are not made a part of the record unless somebody files them with the court or presents it as evidence during a public trial.\" \"The overall impact on this case will depend on what is contained in those documents that were improperly withheld,\" he explained. \"These documents may be the proverbial smoking gun to undermine Angelina Jolie's case.\" Fox News Digital reached out to Pitt and Jolie's representatives for comment. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS With Jolie now being forced to hand over the documents, legal experts told Fox News Digital the ruling could even bring the case to an abrupt end before the most sensitive material is disclosed. \"There is also a chance that, if the [private messages] are very detrimental to Jolie’s case, it might push the case to resolution before the [private messages] are even turned over,\" Baghdaserians claimed. CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER Pitt and Jolie bought a controlling stake in Château Miraval in 2008 and spent time at the home throughout their relationship. After Pitt sued Jolie, the actress' company accused the actor of running a \"vindictive campaign\" to \"loot\" the profitable business since she first filed for divorce in 2016. Nouvel accused Pitt of \"hijacking\" Château Miraval and \"wasting\" the company's assets on unnecessary renovation projects, including spending $1 million on swimming pool renovations, according to court documents previously obtained by Fox News Digital. Pitt and Jolie are expected to face off in court over the winery dispute in 2027."
}