{
  "url": "https://bulbapedia.bulbagarden.net/wiki/Aron_(Pokémon)",
  "title": "Aron (Pokémon) - Bulbapedia, the community-driven Pokémon encyclopedia",
  "text": "Aron (Pokémon) Hidden Ability Gen. III-IV V+ HP Atk Def Sp.Atk Sp.Def Speed Aron (Japanese: ココドラ Cokodora) is a dual-type Steel/Rock Pokémon introduced in Generation III. It evolves into Lairon starting at level 32, which evolves into Aggron starting at level 42. Biology Aron is a quadrupedal Pokémon with four stubby legs and a large round head. Its body is black with plates of gray steel armor covering its head, back, and legs. Throughout its body are small openings in the armor. There are six openings on its head, with the largest two being openings for its pale blue eyes and one opening on either side of the spike on its back. A single, blunt spike protrudes from its back. Aron feeds on iron ore that it digs from mountains. It uses this ore to make its body. Sometimes, hunger will drive it to descend from the mountains to eat bridges and rails, which makes it a pest. It makes a new suit of armor after evolving, while its old discarded armor is salvaged for making iron products. People have been collecting Aron's shed armor since ancient times. With one all-out charge, it can demolish even a heavy dump truck. It lives on mountains. As mentioned in Pokémon Sleep, Aron has been observed eating an iron ore snack on rare occasions. Evolution Aron evolves into Lairon, which evolves into Aggron. (For specifics on this Pokémon's Evolution in the games, refer to Game data→Evolution data.) Game data NPC appearances - Pokémon Pinball: Ruby & Sapphire: The EVO Mode banner features an Aron. Pokédex entries Game locations Victory Road (Horde Encounter) Ballimere Lake (Wanderer) Slippery Slope, Giant's Bed, Snowslide Slope, Frigid Sea, Ballimere Lake (Max Raid Battle) Grand Underground - Rocky Cave, Big Bluff Cavern, Whiteout Cave, Icy Cave, Glacial Cavern (After obtaining the National Pokédex) In side games Fainted Pokémon: Mt. Blaze, Murky Cave Old Gold Power Plant, Greengrass IsleExpert (from Basic 1) Held items Stats Base stats Pokéathlon stats Type effectiveness - If this Pokémon is given a Ring Target, the effectiveness of Poison-type moves is ½×. - Prior to Generation VI, the effectiveness of Dark-type moves was ½×. - Prior to Generation VI, the effectiveness of Ghost-type moves was ½×. Learnset Aron is available in Legends Z-A. By leveling up - Bold indicates a move that gets STAB when used by Aron - Italic indicates a move that gets STAB only when used by an Evolution of Aron - Click on the generation numbers at the top to see level-up moves from other generations By TM - Bold indicates a move that gets STAB when used by Aron - Italic indicates a move that gets STAB only when used by an Evolution or an alternate form of Aron - Click on the generation numbers at the top to see TM moves from other generations TCG-only moves Side game data Red Rescue Team and Blue Rescue Team Explorers of Time, Explorers of Darkness, and Explorers of Sky Body size: Standard (1 tile) How to Recruit: Talk to in Noe Town Connected to: Kadabra, Hippopotas (♂) Connection Orb Set: 8 (Tackle ×1) (present) (present) (Tackle ×1) (past) (past) (Tackle ×1) Ability 2: Bodyguard Ability 3: Run Up Belue Berry ×1 Bean Sausage ×2 Evolution data Steel Rock Level 32 → Steel Rock Level 42 → Steel Rock Sprites In animation Major appearances Multiple Aron debuted in A Hole Lotta Trouble. Ash, May, Max, Brock, and Team Rocket got themselves lost in a cave full of the Iron Armor Pokémon. Steven, who also owned one, helped them pass through the cave. Steven's Aron briefly reappeared in Mega Evolution Special II. Minor appearances An Aron appeared in a fantasy in Gone Corphishin'. A Trainer's Aron appeared in Delcatty Got Your Tongue. In A Double Dilemma, an Aron was living at North Petalburg. An Aron appeared in A Fan with a Plan. An Aron appeared in PK13. In Off The Unbeaten Path!, an Aron was in a field with an Azurill, Igglybuff, Smoochum, and Chikorita. In Giratina and the Sky Warrior, an Aron and its evolved forms helped Ash and his friends stop a broken glacier. During the ending credits, they were eating the ruins of the Megarig. In Steeling Peace of Mind! and Saving the World From Ruins!, multiple Aron were affected by Team Galactic's meddling on Iron Island. In Genesect and the Legend Awakened, multiple Aron were living at Pokémon Hills. An Aron appeared in BWS01. An Aron appeared in Mega Evolution Special II. In Volcanion and the Mechanical Marvel, a wild Aron was living at the Nebel Plateau. Pokédex entries In the manga Ash & Pikachu An Aron appears in a flashback in A Pokémon Battle Against An Entire Family?!, under the ownership of the Winstrate family. Movie adaptations An Aron appeared in the manga adaptation of Volcanion and the Mechanical Marvel as a resident of the Nebel Plateau. Pokémon Adventures - Main article: Rono Sapphire owns an Aron nicknamed Rono who first appeared in Distracting Dustox. He evolved before facing Brawly at the Dewford Gym, and after a long stay in her team during which he fought Team Aqua a few times, evolved on Mirage Island as she trained with Ruby there. He was her first Pokémon. An Aron appeared in a fantasy in Heracross Transforms. Pokédex entries Pokémon + Nobunaga's Ambition ~ Ranse's Color Picture Scroll ~ An Aron appeared in PNA2. In the TCG - Main article: Aron (TCG) Trivia - The back of Aron's head was changed from black in Generation VI to metallic gray in Generation VII. This makes it one of two Pokémon to have its model changed between these generations, the other being Glameow. Origin Aron seems to be based on the Bulgasari, a monster that eats iron in Korean legend, and a dinosaur from the family Nodosauridae. As its Pokémon category suggests, its appearance may also be inspired by plate armours. Name origin Aron may be a combination of armor and iron. Cokodora may be a combination of 坑道 kōdō (mining tunnel), 小 ko (small), 子 ko (child), and dragon or コドラ Kodora (Lairon). In other languages Related articles External links - Pokémon - Generation III Pokémon - Steel-type Pokémon - Rock-type Pokémon - Dual-type Pokémon - Pokémon with a gender ratio of one male to one female - Pokémon in the Slow experience group - Gray-colored Pokémon - Body style 08 Pokémon - Monster group Pokémon - Pokémon that are part of a three-stage evolutionary line - Pokémon in the Hoenn Pokédex - Pokémon in the Unova Pokédex - Pokémon in the Mountain Kalos Pokédex - Pokémon in the Crown Tundra Pokédex - Pokémon in the Lumiose Pokédex - Pokémon with wild held items - Pokémon with a base stat total of 330 - Pokémon with 15 max performance stars - Body size 1 Pokémon - F.E.A.R.-compatible Pokémon"
}