{
  "url": "https://www.booking.com/region/my/kelantan.html",
  "title": "The Best Kelantan Hotels – Where To Stay in and around Kelantan, Malaysia",
  "text": "Search hotels in Kelantan, Malaysia Enter your dates and choose from 1258 hotels and other places to stay Check out these popular cities in Kelantan Kota Bharu Gua Musang Kota Bharu Pasir Puteh Tanah Merah Wakaf Baharu Bachok Kubang Kerian Wakaf Che Yeh Machang Stay in Kelantan's best hotels! Filter by: Captain's Cabin Resort - Naval Heritage (Swimming Pool) Located in Kota Bharu, 3.1 miles from Handicraft Village and Craft Museum, Captain's Cabin Resort - Naval Heritage (Swimming Pool) has accommodations with an outdoor swimming pool, free private... AnR Studio Suite Inside H Elite Building AnR Studio Suite Inside H Elite Building is located in Kota Bharu, 4.8 miles from Handicraft Village and Craft Museum and 4.3 miles from Kelantan Golf & Country Club. Tanjung Chap Beach Resort Located within a few steps of Pantai Irama Bachok Beach and 17 miles of Handicraft Village and Craft Museum, Tanjung Chap Beach Resort has rooms with air conditioning and a private bathroom in Bachok.... ibis Styles Kota Bharu Located in Kota Bharu, a 17-minute walk from Handicraft Village and Craft Museum, ibis Styles Kota Bharu provides accommodations with an outdoor swimming pool, private parking, a fitness center and a... Perdana Kota Bharu Conveniently located within a 10-minute drive from Pasar Siti Khadijah, Perdana Kota Bharu offers accommodations in Kota Bharu. Renai Hotel Kota Bharu Renai Hotel Kota Bharu (formerly known as The Grand Renai Hotel) is located in Kelantan’s commercial and shopping district. The hotel offers an outdoor pool and 3 dining options. Salaam Suites Hotel Located within a 14-minute walk of Handicraft Village and Craft Museum and half a mile of Kelantan Golf & Country Club, Salaam Suites Hotel provides rooms in Kota Bharu. Andiana Hotel & Lodge - Kota Bharu City Centre Located within a 6-minute walk of Handicraft Village and Craft Museum and 0.7 miles of Kelantan Golf & Country Club, Andiana Hotel & Lodge - Kota Bharu City Centre provides rooms in Kota Bharu. M Quality Hotel Located in Gua Musang, 26 miles from National Park East Kelantan Entrance, M Quality Hotel provides accommodations with free WiFi and free private parking. The hotel features family rooms. Assalam Hotel Providing free WiFi, Assalam Hotel offers rooms in Kota Bharu, 3.4 miles from Handicraft Village and Craft Museum and 2.8 miles from Kelantan Golf & Country Club. Most-booked hotels in Kelantan in the past month Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Popular with guests booking hotels in Kelantan Kelantan's best hotels with breakfast Jewels Hotel Jewels Hotel Sdn Bhd is located in Kota Bharu, a 5-minute walk from Kampong Craft Tangan. It offers free WiFi, a 24-hour front desk and rooms with a flat-screen TV. Royal Guest House RGH Featuring 4-star accommodations, Royal Guest House RGH is located in Kota Bharu, a few steps from Handicraft Village and Craft Museum and a 13-minute walk from Kelantan Golf & Country Club. H Elite Design Hotel H Elite Design Hotel features an outdoor swimming pool, fitness center, a shared lounge and restaurant in Kota Bharu. With free WiFi, this 4-star hotel offers a kids' club and room service. Grand Riverview Hotel Located along the Kelantan River, Grand Riverview features spacious accommodations with city views and free Wi-Fi. AAM Hotel Located in Kota Bharu, 4.2 miles from Handicraft Village and Craft Museum, AAM Hotel has accommodations with a shared lounge, free private parking and a restaurant. Crystal Lodge Providing free Wi-Fi, the Crystal Lodge in Kota Bharu Kelantan has air-conditioned rooms with an LCD TV. UMMI GUESTROOM Located in Kota Bharu, 4.7 miles from Handicraft Village and Craft Museum, UMMI GUESTROOM provides accommodations with an outdoor swimming pool, free private parking and a restaurant. MRJ Hotel Wakaf Che Yeh 2 Located within 3.1 miles of Handicraft Village and Craft Museum and 2.6 miles of Kelantan Golf & Country Club, MRJ Hotel Wakaf Che Yeh 2 provides rooms with air conditioning and a private bathroom in... Budget hotels in Kelantan Sh Garden Hotel Located within 30 miles of Handicraft Village and Craft Museum and 30 miles of Kelantan Golf & Country Club, Sh Garden Hotel provides rooms with air conditioning and a private bathroom in Tanah Merah. Villa Temila Located in Pasir Puteh, 27 miles from Handicraft Village and Craft Museum, Villa Temila has accommodations with a garden, free private parking and barbecue facilities. Located within a 8-minute walk of Handicraft Village and Craft Museum and 600 yards of Kelantan Golf & Country Club, Hotel O Kota Bharu Near War Museum Formerly Azam Hotel provides rooms in Kota Bharu... Located in Kota Bharu, within a 7-minute walk of Handicraft Village and Craft Museum and 0.9 miles of Kelantan Golf & Country Club, Hotel O G Home Hotel, Kota Bharu, Kelantan. Has free WiFi. 61 Hotel 61 Hotel is located in Gua Musang, within 27 miles of National Park East Kelantan Entrance and 2.6 miles of Mountain Chamah. The property has a 24-hour front desk and free WiFi. PCB BEACH RESORT Located in Kota Bharu, a few steps from Pantai Cahaya Bulan Beach, PCB BEACH RESORT has accommodations with an outdoor swimming pool, free private parking, a garden and a terrace. OYO 89933 Nun Hotel OYO 89933 Nun Hotel is offering accommodations in Jeli. This 2-star hotel offers a 24-hour front desk. Located in Kota Bharu, Dane & Shue Hotel Kok Lanas provides air-conditioned rooms with free WiFi. The hotel features family rooms. Hotels in Kelantan you can book without a credit card Hotel Murah Pasir Puteh Located in Pasir Puteh, 30 miles from Handicraft Village and Craft Museum, Hotel Murah Pasir Puteh has accommodations with free WiFi and free private parking. W Hotel Cemerlang W Hotel Cemerlang is located in Kota Bharu, a 17-minute walk from Handicraft Village and Craft Museum and 0.9 miles from Kelantan Golf & Country Club. Mines Inn Hotel Located in Gua Musang, 26 miles from National Park East Kelantan Entrance, Mines Inn Hotel provides accommodations with free WiFi and free private parking. The hotel features family rooms. Qeyjan Hotel Located 26 miles from Handicraft Village and Craft Museum, Qeyjan Hotel provides rooms with air conditioning in Pasir Puteh. HL HOTEL Kota Bharu Located in Kota Bharu, 2.3 miles from Handicraft Village and Craft Museum, HL HOTEL Kota Bharu provides accommodations with free WiFi and free private parking. Hotel Nawar Located in Pasir Mas, within 16 miles of Handicraft Village and Craft Museum and 15 miles of Kelantan Golf & Country Club, Hotel Nawar provides accommodations with a restaurant as well as free private... OYO 90740 Paddington Lodge Located in Kubang Kerian and with Handicraft Village and Craft Museum reachable within 4.9 miles, OYO 90740 Paddington Lodge provides a garden, non-smoking rooms, free WiFi throughout the property and... OYO 90454 Haza Harmoni Guesthouse OYO 90454 Haza Harmoni Guesthouse has accommodations in Kampong Kijang. This 2-star hotel offers free WiFi."
}