{
  "url": "https://www.google.com/finance/quote/EUR-USD",
  "title": "EUR/USD Currency Exchange Rate & News - Google Finance",
  "text": "HomeEUR / USD • Currency Euro to United States Dollar Follow In the news Previous close 1.18 About Euro The euro is the official currency of 21 of the 27 member states of the European Union. This group of states is officially known as the euro area or, more commonly, the eurozone. The euro is divided into 100 euro cents. The currency is also used officially by the institutions of the European Union, by four European microstates that are not EU members, by one British Overseas Territory, as well as unilaterally by two European states that are not EU members. Outside Europe, a number of special territories of EU members also use the euro as their currency. The euro is used by 358 million people in the eurozone, in addition to those living in states and territories where the euro is also the sole official currency. Furthermore, over 200 million people worldwide use currencies pegged to the euro. It is the second-largest reserve currency as well as the second-most traded currency in the world after the United States dollar. As of December 2019, with more than €1.3 trillion in circulation, the euro has one of the highest combined values of banknotes and coins in circulation in the world. The name euro was officially adopted on 16 December 1995 in Madrid. WikipediaAbout United States Dollar The United States dollar is the official currency of the United States and several other countries. The Coinage Act of 1792 introduced the U.S. dollar at par with the Spanish silver dollar, divided it into 100 cents, and authorized the minting of coins denominated in dollars and cents. U.S. banknotes are issued in the form of Federal Reserve Notes, popularly called greenbacks due to their predominantly green color. The U.S. dollar was originally defined under a bimetallic standard of 371.25 grains fine silver or, from 1834, 23.22 grains fine gold, or $20.67 per troy ounce. The Gold Standard Act of 1900 linked the dollar solely to gold. From 1934, its equivalence to gold was revised to $35 per troy ounce. In 1971 all links to gold were repealed. The U.S. dollar became an important international reserve currency after the First World War, and displaced the pound sterling as the world's primary reserve currency by the Bretton Woods Agreement towards the end of the Second World War. The dollar is the most widely used currency in international transactions, and a free-floating currency. Wikipedia"
}