{
  "url": "https://en.wikipedia.org/wiki/Bunnings",
  "title": "Bunnings - Wikipedia",
  "text": "Bunnings Bunnings Group Limited, trading as Bunnings Warehouse or Bunnings, is an Australian hardware and garden centre chain.[3] The chain has been owned by Wesfarmers since 1994, and has stores in Australia and New Zealand.[4] Bunnings was founded in Bunbury, Western Australia in 1886, by brothers Arthur and Robert Bunning, who had emigrated from England. Initially, a limited company focused on sawmilling, it became a public company in 1952 and subsequently expanded into the retail sector, purchasing several hardware stores. Bunnings began to expand into other states in the 1990s and opened its first warehouse-style store in Melbourne in 1994. As of 2022, the chain had 381 stores and over 53,000 employees,[5] with a 68% market share in the Australian do it yourself hardware market; competing chains include Mitre 10, Home Hardware and various independent retailers around Australia.[6] Bunnings had the title of Australia's most trusted brand until 2020.[7] Bunnings runs community events outside or in its stores, including sausage sizzles and do it yourself workshops. History [edit]Pre-Wesfarmers history [edit]In 1886, brothers Arthur and Robert Bunning left London to settle in Perth, and soon gained a government building contract, which led to the founding of a group of building companies which later became Bunning Bros Pty Ltd. They purchased their first sawmill the following year in the south west of Western Australia,[8] and over the next few years, they concentrated more on sawmilling and timber distribution and less on building.[9] In 1928, Robert Bunning's sons Charles and Tom began working in the business, eventually becoming directors after their father's death in 1936; Charles was a qualified engineer and Tom a chartered accountant. The company secured several major contracts in the 1930s, including for timber fittings on major Perth buildings, timber supply contracts on the Eastern Goldfields, and railway sleeper contracts in Ceylon and South Africa. Further expansion occurred during World War II, where Bunnings co-operated with its rival Millars, and in the post-war period which saw the creation of a workshop in Manjimup and timber mills in south-west Western Australia and north Queensland.[10] In 1952, Bunnings became a public company, Bunning Timber Holdings Pty Ltd, expanding into retailing and purchasing several hardware stores.[9] Charles and Tom Bunning became joint managing directors in 1956, with Charles becoming chairman two years later. In 1970, Bunnings bought the merchandising and sawmilling operations of Hawker Siddeley, which \"almost doubled the size of the company\".[10] In 1983, it bought out Millars and, in 1990, the Alco Handyman hardware operations.[11] In 1993, Bunnings bought a company that operated Harry's and Lloyd's in South Australia, Campbell's in Queensland, and McEwans in Victoria and New South Wales. (This company had been spun off from Harris Scarfe in 1989.) Many of the stores acquired were subsequently closed, with only the best-performing sites being retained.[citation needed] 1990s [edit]Bunnings Limited was bought out by Wesfarmers in 1994 for $600 million (equivalent to $1.23 billion in 2022).[12] In late-1995, the Red Hammer symbol was introduced and is still in use today. In June 1996, the company's trademark slogan \"Lowest Prices Are Just The Beginning\" was introduced. In February 2020, the company discontinued the use of the slogan in Australia. New Zealand ads and stores continue to use the slogan at present.[13] After the acquisition, the first Bunnings Warehouse was opened on August 24, 1994, in the Melbourne suburb of Sunshine.[14] Present at the official opening were the Victorian premier Jeff Kennett, American actor Richard Karn[citation needed] who played Al Borland on the television sitcom Home Improvement, and Joe Boros, the managing director of Bunnings.[15] This was quickly followed by the opening of three more Bunnings Warehouse stores in Melbourne. Since then, new stores have been opened across Australia approximately every three months on average.[citation needed] Development in Sydney and Brisbane proved more difficult than in other areas, as large blocks of land in the metropolitan area were limited.[citation needed] In 1997, the remaining smaller-format McEwans stores were renamed as Bunnings stores. 2000s [edit]In August 2001, Wesfarmers bought the Howard Smith Group, including BBC Hardware (previously Nock & Kirby) and big-box offshoot Hardwarehouse. This supplemented the Bunnings national network by several dozen stores, many of them large Hardwarehouse stores in Sydney, Brisbane and New Zealand. Hardwarehouse had been dominant in New South Wales and Queensland, but the purchase complemented Bunnings' prior domination in Victoria, where Hardwarehouse had only seven stores to Bunnings' twenty at the time of the buy-out. At the time of purchase, the market leader was Mitre 10 with a 12% market share, but the inclusion of the Hardwarehouse and BBC Hardware stores brought Bunnings market share to 13.5%.[16] Hardwarehouse and BBC Hardware stores retained their branding for a year, while television advertisements were tagged with each of Bunnings Warehouse, Hardwarehouse and BBC Hardware during this transition period. Lower-volume stores were closed and, in 2002, the remaining Hardwarehouses were renamed Bunnings Warehouse.[17] The Howard Smith Group purchase also included Benchmark Building Supplies, a New Zealand chain of 32 stores, including nine Auckland stores. These were also closed or rebranded as Bunnings by 2003.[17][18][19] Until then, Bunnings had just three New Zealand stores.[20][19] By 2008, it had 14 large warehouse stores in the country.[21][20] From 2004 to 2008, Bunnings purchased and re-branded Mitre 10 stores in Griffith, Kempsey, Randwick and Wodonga, Magnet Mart in Griffith and a Mitre 10 Mega store in Modbury. In 2008 the Australian Competition & Consumer Commission (ACCC) looked into its acquisitions of five Mitre 10 stores, as it deemed the purchases would be anti-competitive. In February 2009, the ACCC allowed the purchases, finding that the acquisition of the Mitre 10 stores did not significantly alter the level of competition in the relevant market.[22] 2010s [edit]Over time, some smaller-format Bunnings stores have gradually been closed. However, six new stores were opened in Victoria in 2015, mainly in smaller regional markets and inner-suburban areas.[23] In December 2015, the Bunnings Workshop online community was launched, a space for home improvement help and inspiration. Michael Schneider was appointed managing director, Bunnings Group in May 2017 following his appointment as managing director, Bunnings Australia & New Zealand in March 2016.[24] In October 2019, Bunnings acquired specialist tool retailer Adelaide Tools.[25] At the time, the business had five retail outlets, a mower centre and an online store.[26] The business was rebranded as Tool Kit Depot.[27] 2020s [edit]In mid-May 2020, Bunnings announced it would close seven stores in New Zealand in Ashburton, Hornby, Hastings, Cambridge, Rangiora, Te Awamutu, and Putāruru with the loss of 145 jobs as a result of the global COVID-19 pandemic.[28][29] This left Bunnings with 41 New Zealand stores, including 12 in Auckland.[30] In Australia, Bunnings unsuccessfully lobbied the Victorian state government to exempt its 168 stores from closure during the second Melbourne lockdown.[31] However the company was allowed to continue fulfilling online orders, and subsequently its online business expanded and grew due to continuing demand despite various periods of restrictions around the country.[32] In April 2021, Bunnings announced it would acquire tile retailer Beaumont Tiles.[33] The ACCC ruled that the purchase of Beaumont Tiles outlets would not reduce competition as Bunnings was not currently in the field in a big way. Bunnings has said it will continue to run Beaumont Tiles the way it has been and with the same management team.[34] In November 2021, both Bunnings and Officeworks partnered with the Flybuys Loyalty program to allow customers to collect points at both stores.[35] In 2022, Bunnings sought to expand its commercial business by doubling the number of frame and truss processing plants it owns from three to six by 2024.[36][37] In 2023, Bunnings expanded its pet care and cleaning product ranges, reflecting the company's repositioning as a home improvement destination.[38][39] In early 2024, Bunnings temporarily rebranded six of its stores in Australia and one in New Zealand to \"Hammerbarn\", a fictional hardware shop in the animated television series Bluey. The series' creators were inspired by Bunnings when writing about the fictional shop.[40][41][42] In March 2025, Bunnings launched Hammer Media, a retail media business.[43] In July, the company established Zelora, a partnership with Intellihub, to sell household rooftop solar panels and battery storage.[44] Operations [edit]Since the development of the Bunnings Warehouse stores, three general operational formats exist: Bunnings Small-format Store (SFS), Bunnings Warehouse (WH) and Bunnings Trade Centre (TC). The smaller \"Bunnings\" stores stock a more limited range of hardware, whereas the larger \"Bunnings Warehouses\" contain a more comprehensive hardware range and garden supplies, including plants. The big box format accounts for 167 stores of the network of 280.[23] Bunnings Warehouse offers a variety of additional services, both in-home and in-store.[45] The in-home services are mainly installations, assembling, quotes and consultancy for multiple products. The in-store services include a hire shop, spare parts enquiry, colour matching, key cutting, pool water testing and gas swapping. Bunnings also provides gardening, craft, and woodwork do it yourself (DIY) workshops for children in-store, as well as for other groups in schools, nursing homes, and hospitals. The Bunnings staff are available to community groups for assistance with DIY projects. On weekends (and weekdays at some sites), Bunnings outlets regularly host sausage sizzles and cake stalls for community groups and causes.[46] It has become an intrinsic part of the Bunnings Warehouse brand, and iconic in Australian culture.[47] Facial recognition software [edit]In 2024 the Australian Privacy Commission found that Bunnings's use of facial recognition cameras on customers in NSW and Victorian stores from 2018 to 2021 breached Australian privacy laws as they did not obtain consent.[48] Finances [edit]Bunnings reported A$16.871 billion in revenue for the fiscal year 2020–2021,[49] which was a 12.5% revenue growth from the 2019–2020 fiscal year, where Bunnings reported A$14.999 billion in revenue.[50] UK and Ireland [edit]In February 2016, Bunnings' parent company Wesfarmers bought the United Kingdom-based hardware chain Homebase for £340 million. The chain's 265 stores in the UK and 15 in Ireland were intended to be rebranded with the Bunnings name within five years.[51] The first Bunnings store in the UK was opened at the end of January 2017 in St Albans, four months later than planned to ensure the adopted format was suited to the UK public. The company planned to use that store as a test model prior to fine-tuning and expanding in that region. In April 2017, they bought a former B&Q store in Folkestone to be the fifth Bunnings store in the UK.[52] On 25 May 2018, after mounting losses, Wesfarmers sold the UK and Ireland Bunnings/Homebase operation to Hilco for a nominal sum of £1.[53] The 24 stores already rebranded as Bunnings reverted to the Homebase name, with some later closing under an agreed company voluntary arrangement.[54] The failure of Bunnings in the UK and Ireland has been called \"the most disastrous retail acquisition in the UK ever\".[55] House brands [edit]House brands of Bunnings include: - Click: Electrical fittings and accessories (Australian and New Zealand) - Matador: Barbecues and accessories[56] - Saxon: Gardening and landscaping products - IronHorse: Portable lighting and electric space heaters - Eiger Electrical: Electrical fittings and accessories (UK and Ireland) - Craftright tools: hand tools See also [edit]References [edit]- ^ \"2022 Full-year results\". Wesfarmers. 26 August 2022. Archived from the original on 2 January 2023. Retrieved 2 January 2023. - ^ a b \"Wesfarmers FY2025 Full Year Results\". Wesfarmers. Retrieved 16 September 2025. - ^ Canning, Simon (4 April 2007). \"Officeworks fits in the Bunnings shed\". The Australian. News Limited. Archived from the original on 13 September 2012. Retrieved 6 September 2011. - ^ \"Bunnings: Who we are\". Wesfarmers Limited. 2 January 2023. Archived from the original on 12 January 2023. Retrieved 2 January 2023. - ^ \"2016 Full-year results – Wesfarmers\" (PDF). Archived (PDF) from the original on 20 November 2016. Retrieved 19 November 2016. - ^ \"Hardware giant Bunnings buys Adelaide Tools\" Archived 4 April 2020 at statista.com (Error: unknown archive URL), Australian Financial Review, 1 July 2024. - ^ \"Bunnings' Story of Becoming Australia's Most Trusted Brand\". MobileAppDaily. Retrieved 7 June 2025. - ^ \"Arthur and Robert Bunning migrated from London to Perth in 1886 and in 1887 they purchased their first sawmill in the south-west of Western Australia, marking the formation of Bunning Brothers Limited. They purchased several more sawmills throughout Western Australia.\": Battye Library, MN 2701, Bunnings Limited records, ACC 7471A - ^ a b \"Bunnings History\". Bunnings. Archived from the original on 24 June 2021. Retrieved 21 February 2008. - ^ a b Carman-Brown, Kylie (2021). \"Charles Robert Bunning (1905–1994)\". Australian Dictionary of Biography. Vol. 19. - ^ Takeover Threatens Timber Giant Archived 5 August 2021 at the Wayback Machine Australian Financial Review 24 September 1987 - ^ Regrouped Wesfarmers moves to enhance profile Archived 20 October 2021 at the Wayback Machine Canberra Times 18 October 1994 page 21 - ^ \"Bunnings drops iconic 'lowest prices' slogan\". www.9news.com.au. 14 February 2020. Archived from the original on 22 July 2020. Retrieved 21 July 2020. - ^ \"Wesfarmers > Bunnings\". Wesfarmers. Retrieved 23 October 2024. - ^ \"Bunnings Warehouse Sunshine\". Flickr. 28 September 2013. Retrieved 23 October 2024. - ^ Bunnings BBC marriage could kill off traditional hardware stores[dead link] - ^ a b McIlwraith, Ian (22 January 1990). \"Will the Lord stay with the baby?\". Australian Financial Review. Archived from the original on 4 February 2022. Retrieved 7 February 2022. - ^ \"BBC HARDWARE (NZ) LIMITED\". opencorporates.com. Open Corporates. Archived from the original on 4 February 2022. Retrieved 7 February 2022. - ^ a b Bingham, Eugene (24 October 2003). \"Retailers jostle for the DIY dollar\". Wilson & Horton. New Zealand Herald. Archived from the original on 5 February 2022. Retrieved 7 February 2022. - ^ Bradley, Grant (5 January 2008). \"Battle of the giant hardware barns\". APN News & Media. New Zealand Herald. Archived from the original on 4 February 2022. Retrieved 7 February 2022. - ^ Bunnings Group – acquisition of five Mitre 10 stores Archived 28 May 2010 at the Wayback Machine Australian Competition & Consumer Commission - ^ a b \"Costco and Woolies drive big box format\". Australian Food News. 28 December 2010. Archived from the original on 7 March 2011. Retrieved 6 May 2011. - ^ \"Michael Schneider\". www.wesfarmers.com.au. Archived from the original on 12 March 2022. Retrieved 18 March 2022. - ^ Evans, Simon (11 October 2019). \"Hardware giant Bunnings buys Adelaide Tools\". Australian Financial Review. Retrieved 22 February 2024. - ^ Evans, Simon (30 March 2020). \"ACCC green light for Bunnings' buy of Adelaide Tools\". Australian Financial Review. Retrieved 22 February 2024. - ^ Blake, Dean (14 September 2021). \"Adelaide Tools rebrands ahead of expansion out of South Australia\". Inside Retail Australia. Retrieved 22 February 2024. - ^ Gibson, Anne (12 May 2020). \"Bunnings to shut seven NZ stores, 145 staff affected\". The New Zealand Herald. Archived from the original on 12 May 2020. Retrieved 12 May 2020. - ^ \"Bunnings to close seven NZ stores, with 145 job cuts\". Radio New Zealand. 12 May 2020. Archived from the original on 12 May 2020. Retrieved 12 May 2020. - ^ \"Bunnings Warehouse\". bunnings.co.nz. Wesfarmers. Archived from the original on 1 February 2022. Retrieved 7 February 2022. - ^ \"Bunnings owner pushes for shutdown exemption as 168 stores set to close\". Sydney Morning Herald. 4 August 2020. Archived from the original on 1 May 2021. Retrieved 1 May 2021. - ^ \"Bunnings crowned best Australian online retailer\". The West. 30 April 2021. Archived from the original on 1 May 2021. Retrieved 1 May 2021. - ^ Evans, Simon (28 April 2021). \"Hardware giant Bunnings buys Beaumont Tiles\". Australian Financial Review. Retrieved 22 February 2024. - ^ Blake, Dean (30 September 2021). \"Bunnings' acquisition of Beaumont Tiles gets ACCC approval\". Inside Retail Australia. Retrieved 22 February 2024. - ^ Druce, Alex (9 November 2021). \"Shoppers score at Bunnings and Officeworks\". news.com.au. Archived from the original on 16 February 2022. Retrieved 17 February 2022. - ^ Greenblat, Eli (25 April 2022). \"Bunnings plans to double processing plants making wooden frames and trusses for home building\". The Australian. Retrieved 22 February 2024. - ^ Bleby, Michael (6 September 2023). \"Bunnings invests $75m in a changing home-build market\". Australian Financial Review. Retrieved 22 February 2024. - ^ LaFrenz, Carrie (27 February 2023). \"Bunnings launches biggest product expansion in decades with pet care\". Australian Financial Review. Retrieved 5 July 2024. - ^ Greenblat, Eli (20 November 2023). \"Bunnings to move into $5bn cleaning market with bulk packaged goods to compete with supermarkets\". The Australian. Retrieved 5 July 2024. - ^ \"What's behind this Bunnings store's puzzling new rebrand?\". 1News. TVNZ. 2 February 2024. Archived from the original on 2 February 2024. Retrieved 2 February 2024. - ^ \"Hammerbarn for real life\". Bluey TV. Retrieved 25 February 2024. - ^ \"Bunnings turns stores across Australia into Bluey's Hammerbarn\". Retrieved 25 February 2024. - ^ Crawford, Hal (26 March 2025). \"Hammer time: All eyes on Bunnings as retail media era begins\". Mumbrella. Retrieved 7 June 2025. - ^ Parkinson, Giles (22 July 2025). \"Bunnings launches zero up-front offer for home batteries and rooftop PV\". RenewEconomy. Retrieved 13 August 2025. - ^ \"Services\". Bunnings Warehouse. Archived from the original on 1 September 2019. Retrieved 28 August 2019. - ^ \"Local Community Support\". Bunnings. Archived from the original on 7 February 2016. Retrieved 7 February 2016. - ^ \"49 Thoughts Everyone Has While Shopping at Bunnings\". BuzzFeed. 24 April 2014. Archived from the original on 3 March 2016. Retrieved 7 February 2016. - ^ Lavoipierre, Ange (19 November 2024). \"Bunnings breached privacy laws by using facial recognition on customers, Commissioner finds\". ABC. Retrieved 18 March 2025. - ^ \"2021 Full-year results briefing presentation\". Archived from the original on 14 October 2022. Retrieved 18 March 2022. - ^ \"2020 Full-year results briefing presentation\" (PDF). Archived (PDF) from the original on 13 March 2022. Retrieved 3 May 2022. - ^ Neilan, Catherine (29 February 2016). \"Homebase to be rebranded Bunnings after Wesfarmers completes £340m acquisition from Home Retail Group – now what's happening with Argos?\". City AM. Archived from the original on 3 March 2016. Retrieved 29 February 2016. - ^ Chessum, Victoria (25 April 2017). \"Bunnings Warehouse chain to replace former B&Q site in Folkestone\". kentonline.co.uk. Archived from the original on 25 April 2017. Retrieved 25 April 2017. - ^ \"Homebase sold for £1 as DIY disaster ends for Wesfarmers\". BBC News. 25 May 2018. Archived from the original on 16 October 2021. Retrieved 16 October 2021. - ^ Homebase sold for £1 as DIY disaster ends for Wesfarmers Archived 24 July 2018 at the Wayback Machine BBC News 25 May 2018 - ^ \"'Homebase is the most disastrous retail acquisition in the UK ever'\". the Guardian. 30 March 2018. Archived from the original on 12 November 2020. Retrieved 12 March 2021. - ^ \"Matador\". Matador. Archived from the original on 23 January 2024. Retrieved 4 February 2024. External links [edit]- Hawker Siddeley - Home improvement companies of Australia - Home improvement companies of New Zealand - Retail companies established in 1952 - Wesfarmers - Australian companies established in 1952 - 1886 establishments in Australia - Companies based in Melbourne - Garden centres - Horticultural companies of Australia - Plant nurseries"
}