{
  "url": "https://www.tasteofhome.com/collection/healthy-vegetarian-recipes/",
  "title": "45 Healthy Vegetarian Recipes",
  "text": "No-meat doesn't alway mean super healthy. Here are healthy vegetarian recipes for each meal of the day that are meat-free, good for you—and most importantly—absolutely delicious! 44 Healthy Vegetarian Recipes 1/44 Chickpea and Potato Curry From the Recipe Creator: I make chana masala, the classic Indian chickpea curry, in my slow cooker. First browning the onion, ginger and garlic really makes the sauce amazing. —Anjana Devasahayam, San Antonio, Texas Nutrition Facts: 1-1/4 cups chickpea mixture: 240 calories, 6g fat (0 saturated fat), 0 cholesterol, 767mg sodium, 42g carbohydrate (8g sugars, 9g fiber), 8g protein. 2/44 Fiesta Time Omelet From the Recipe Creator: I created this dish when I needed to use up some black olives and jalapenos. With the abundant filling, two of these large omelets can feed four people if served with side dishes.—Jennine Victory, Bee Branch, Arkansas. Nutrition Facts: 1/2 omelet: 242 calories, 16g fat (5g saturated fat), 383mg cholesterol, 601mg sodium, 7g carbohydrate (3g sugars, 2g fiber), 18g protein. Diabetic Exchanges: 2 medium-fat meat, 1 fat, 1/2 starch. 3/44 Italian Herb-Lentil Patties with Mozzarella From the Recipe Creator: My family has requested this meatless recipe over and over again. It is simple to prepare and even meat lovers like it. —Geri Lucas, Oldsmar, Florida Nutrition Facts: 1 patty: 416 calories, 12g fat (4g saturated fat), 74mg cholesterol, 517mg sodium, 54g carbohydrate (2g sugars, 9g fiber), 26g protein. 4/44 Lemony Chickpeas From the Recipe Creator: These saucy chickpeas add just a little heat to meatless Mondays. They're especially good over hot, fluffy brown rice. —April Strevell, Red Bank, New Jersey Nutrition Facts: 1 cup chickpea mixture with 1 cup rice: 433 calories, 9g fat (0 saturated fat), 0 cholesterol, 679mg sodium, 76g carbohydrate (10g sugars, 12g fiber), 13g protein. 5/44 Black Bean & White Cheddar Frittata From the Recipe Creator: This is one of my favorite comfort foods for breakfast or even a quick dinner. I like to make it with lime salsa. But if you're looking for something with more kick, use hot salsa or add some chipotle pepper. —Aysha Schurman, Ammon, Idaho Nutrition Facts: 1 wedge (calculated without toppings): 183 calories, 10g fat (4g saturated fat), 196mg cholesterol, 378mg sodium, 9g carbohydrate (2g sugars, 2g fiber), 13g protein. Diabetic Exchanges: 2 medium-fat meat, 1/2 starch, 1/2 fat. 6/44 Spicy Lentil & Chickpea Stew From the Recipe Creator: This recipe came to me from a friend who had worked at a health food store. I changed a few things until I found a version that my family loved. My son doesn't like things too spicy, so I make the stew milder for him and add a sprinkle of extra spice in mine. My husband, who farms, works outdoors for long hours at a time and finds this soup hearty enough to keep him satisfied. —Melanie MacFarlane, Bedeque, Prince Edward Island Nutrition Facts: 1-1/3 cups: 266 calories, 4g fat (0 saturated fat), 0 cholesterol, 712mg sodium, 45g carbohydrate (11g sugars, 10g fiber), 14g protein. Diabetic Exchanges: 2 starch, 2 vegetable, 1 lean meat. 7/44 Mango-Peach Smoothies From the Recipe Creator: This is my toddler son's favorite breakfast—he'll take one of these over pancakes any day! Get creative when mixing fruits and fruit-flavored yogurts; we love peach yogurt with mango, strawberry yogurt with blueberries or pina colada yogurt with mango and banana. —Dana Herra, DeKalb, Illinois Nutrition Facts: 1 cup: 180 calories, 1g fat (1g saturated fat), 5mg cholesterol, 71mg sodium, 39g carbohydrate (36g sugars, 3g fiber), 6g protein. 8/44 Southwest Tortilla Scramble From the Recipe Creator: Here’s my version of a deconstructed breakfast burrito that’s actually good for you. Go for hefty corn tortillas in this recipe. Flour ones can get lost in the scramble. —Christine Schenher, Exeter, California Nutrition Facts: 1 cup: 195 calories, 7g fat (3g saturated fat), 217mg cholesterol, 391mg sodium, 16g carbohydrate (2g sugars, 2g fiber), 17g protein. Diabetic Exchanges: 2 lean meat, 1 starch. 9/44 Hearty Asian Lettuce Salad From the Recipe Creator: This meatless version of your favorite restaurant salad packs 13 grams of protein per serving and is bursting with juicy flavor. It's a brilliant choice for lunch or a busy-day dinner. —Taste of Home Test Kitchen Nutrition Facts: 1 salad: 329 calories, 10g fat (1g saturated fat), 0 cholesterol, 430mg sodium, 44g carbohydrate (12g sugars, 7g fiber), 13g protein. 10/44 Sweet Potato Lentil Stew From the Recipe Creator: I fell in love with the spicy aromas in this sweet potato lentil stew. Add whatever ingredients you have on hand, like zucchini, spinach, kale and corn. —Heather Gray, Little Rock, Arkansas Nutrition Facts: 1-1/3 cups: 290 calories, 1g fat (0 saturated fat), 0 cholesterol, 662mg sodium, 58g carbohydrate (16g sugars, 15g fiber), 15g protein. 11/44 Cool Summertime Oatmeal From the Recipe Creator: Start this breakfast the night before so you can get a few extra z's in the morning. My husband adds coconut to his, and I stir in dried fruit. —June Thomas, Chesterton, Indiana Nutrition Facts: 1 serving: 350 calories, 12g fat (2g saturated fat), 4mg cholesterol, 53mg sodium, 55g carbohydrate (31g sugars, 5g fiber), 10g protein. 12/44 Fiery Stuffed Poblanos From the Recipe Creator: I love Southwest-inspired cuisine, but the dishes are often unhealthy. As a dietitian, I try to come up with nutritious twists on recipes, which is how my stuffed peppers dish was born. —Amber Massey, Argyle, Texas Nutrition Facts: 1 stuffed pepper: 223 calories, 5g fat (2g saturated fat), 15mg cholesterol, 579mg sodium, 32g carbohydrate (9g sugars, 7g fiber), 11g protein. Diabetic Exchanges: 2 vegetable, 1 starch, 1 lean meat, 1 fat. 13/44 Shakshuka From the Recipe Creator: Shakshuka is a dish of poached eggs with tomatoes, onion and cumin. I learned about it while traveling through Southeast Asia, and it's been my favorite way to eat eggs since. —Ezra Weeks, Calgary, Alberta Nutrition Facts: 1 serving: 159 calories, 12g fat (3g saturated fat), 186mg cholesterol, 381mg sodium, 6g carbohydrate (3g sugars, 2g fiber), 7g protein. Diabetic Exchanges: 1-1/2 fat, 1 medium-fat meat, 1 vegetable. 14/44 Veggie Nicoise Salad From the Recipe Creator: More and more people in my workplace are becoming vegetarians. When we cook or eat together, the focus is on fresh produce. This salad combines some of our favorite ingredients in one dish—and with the hard-boiled eggs and kidney beans, it also delivers enough protein to satisfy those who are skeptical of vegetarian fare. —Elizabeth Kelley, Chicago, Illinois Nutrition Facts: 1 serving: 329 calories, 19g fat (4g saturated fat), 140mg cholesterol, 422mg sodium, 28g carbohydrate (6g sugars, 7g fiber), 12g protein. Diabetic Exchanges: 3 fat, 2 vegetable, 2 medium-fat meat, 11/2 starch. 15/44 Ricotta-Stuffed Portobello Mushrooms From the Recipe Creator: These mushrooms are rich and creamy and bright at the same time because of the fresh herbs and tomato. I especially like to serve them with grilled asparagus. —Tre Balchowsky, Sausalito, California Nutrition Facts: 1 stuffed mushroom: 201 calories, 13g fat (4g saturated fat), 22mg cholesterol, 238mg sodium, 9g carbohydrate (5g sugars, 2g fiber), 12g protein. Diabetic Exchanges: 1-1/2 fat, 1 medium-fat meat, 1 vegetable. 16/44 Grilled Peach, Rice & Arugula Salad From the Recipe Creator: This hearty salad was created when I needed to clear out some leftovers from the fridge—and it became an instant hit! The grilled peaches are the ultimate \"tastes like summer\" salad booster. —Lauren Wyler, Dripping Springs, Texas Nutrition Facts: 1 serving: 218 calories, 11g fat (3g saturated fat), 20mg cholesterol, 530mg sodium, 23g carbohydrate (9g sugars, 2g fiber), 7g protein. Diabetic Exchanges: 2 fat, 1 starch, 1 vegetable. 17/44 Mushroom Bolognese From the Recipe Creator: A traditional Bolognese sauce is meat-based with everything from pork to pancetta. Skipping the meat, I loaded this pasta dish with baby portobellos and veggies. —Amber Massey, Argyle, Texas Nutrition Facts: 1-1/3 cups sauce with 1 cup pasta: 369 calories, 6g fat (2g saturated fat), 6mg cholesterol, 483mg sodium, 65g carbohydrate (15g sugars, 12g fiber), 17g protein. 18/44 Black Bean-Sweet Potato Skillet From the Recipe Creator: My fiancé loves sweet potatoes. By adding black beans, I came up with a nutritionally complete main dish. Its bright orange and black color makes it fun for Halloween. —April Strevell, Red Bank, New Jersey Nutrition Facts: 1 cup black bean mixture with 1/2 cup couscous : 294 calories, 3g fat (0 saturated fat), 0 cholesterol, 727mg sodium, 54g carbohydrate (9g sugars, 10g fiber), 12g protein. 19/44 Asparagus Omelet Tortilla Wrap From the Recipe Creator: Since this omelet is packed with whole grains, veggies and protein, all I have to do is add a side of fresh fruit for a healthy breakfast before work. Instead of asparagus, sometimes I make this with fresh spinach. —Bonita Suter, Lawrence, Michigan Nutrition Facts: 1 wrap: 319 calories, 13g fat (5g saturated fat), 225mg cholesterol, 444mg sodium, 28g carbohydrate (4g sugars, 3g fiber), 21g protein. Diabetic Exchanges: 2 lean meat, 2 fat, 1-1/2 starch. 20/44 Vegetarian Tacos From the Recipe Creator: I love Mexican food but was looking for a healthier option to share. My family devours these tasty tacos whenever I make them. —Amanda Petrucelli, Plymouth, Indiana Nutrition Facts: 1 taco (calculated without optional toppings): 413 calories, 9g fat (1g saturated fat), 9mg cholesterol, 774mg sodium, 66g carbohydrate (8g sugars, 16g fiber), 17g protein. 21/44 Curry Scramble From the Recipe Creator: I have eggs every morning, and this is a delightful change from the classic scrambled egg meal. I like to add sliced peppers on top if I have them on hand. —Valerie Belley, St. Louis, Missouri Nutrition Facts: 1 serving: 160 calories, 10g fat (3g saturated fat), 372mg cholesterol, 299mg sodium, 4g carbohydrate (3g sugars, 1g fiber), 14g protein. Diabetic exchanges: 2 medium-fat meat. 22/44 Quinoa & Black Bean Stuffed Peppers From the Recipe Creator: If you're thinking about a meatless meal, give these no-fuss peppers a try. They come together with just a few ingredients and put a tasty spin on a low-fat dinner! —Cindy Reams, Philipsburg, PA Nutrition Facts: 1 stuffed pepper: 393 calories, 8g fat (4g saturated fat), 20mg cholesterol, 774mg sodium, 59g carbohydrate (10g sugars, 10g fiber), 18g protein. 23/44 Stir-Fry Rice Bowl From the Recipe Creator: My meatless version of Korean bibimbap is tasty, pretty and easy to tweak for different spice levels. —Devon Delaney, Westport, Connecticut Nutrition Facts: 1 serving: 305 calories, 11g fat (2g saturated fat), 186mg cholesterol, 364mg sodium, 40g carbohydrate (4g sugars, 4g fiber), 12g protein. Diabetic Exchanges: 2 starch, 1 vegetable, 1 medium-fat meat, 1 fat. 24/44 Quinoa and Black Beans From the Recipe Creator: Some vegan quinoa recipes are boring, but this one definitely isn't. My daughter’s college asked parents for the best quinoa recipes to use in the dining halls. This healthy quinoa recipe fits the bill. —Lindsay McSweeney, Winchester, Massachusetts Nutrition Facts: 1-1/4 cups: 375 calories, 10g fat (1g saturated fat), 0 cholesterol, 668mg sodium, 60g carbohydrate (5g sugars, 10g fiber), 13g protein. 25/44 Rustic Summer Vegetable Pasta From the Recipe Creator: My veggie pasta proves you can’t have too much of a good thing. Feel free to change it up with whatever fresh veggies are in the garden or farmers market. —Bryn Namavari, Chicago, Illinois Nutrition Facts: 2 cups: 315 calories, 8g fat (2g saturated fat), 4mg cholesterol, 445mg sodium, 50g carbohydrate (9g sugars, 8g fiber), 15g protein. 26/44 No-Fry Black Bean Chimichangas From the Recipe Creator: My chimichangas get lovin’ from the oven so they’re a bit healthier. Black beans and corn make it meatless. And it’s a smart way to use leftover rice. —Kimberly Hammond, Kingwood, Texas Nutrition Facts: 1 chimichanga: 337 calories, 5g fat (0 saturated fat), 0 cholesterol, 602mg sodium, 58g carbohydrate (2g sugars, 10g fiber), 13g protein. 27/44 Tropical Fusion Salad with Spicy Tortilla Ribbons From the Recipe Creator: Fresh fruits and veggies pair up for a fantastic summer salad that's savory, sweet and spicy all at once. Make the tortilla strips with your pizza cutter—so easy! —Jennifer Fisher, Austin, Texas Nutrition Facts: 1 serving: 321 calories, 8g fat (1g saturated fat), 0 cholesterol, 380mg sodium, 58g carbohydrate (20g sugars, 11g fiber), 9g protein. 28/44 Greek Orzo Salad From the Recipe Creator: This tart, refreshing salad is a big hit in my home. All the tasty toppings—including red onions, tomatoes, olives, feta cheese and a zesty dressing—give it extra interest. —Judy Roberts, Las Vegas, Nevada Nutrition Facts: 3/4 cup: 167 calories, 6g fat (1g saturated fat), 4mg cholesterol, 427mg sodium, 24g carbohydrate (3g sugars, 2g fiber), 6g protein. Diabetic Exchanges: 1-1/2 starch, 1 fat. 29/44 Southwest Vegetarian Bake From the Recipe Creator: This veggie-packed casserole hits the spot on chilly nights. It's a healthy canned vegetable recipe that's perfect any time I have a taste for Mexican food with all the fixings. —Patricia Gale, Monticello, Illinois Nutrition Facts: 1 cup: 285 calories, 10g fat (5g saturated fat), 21mg cholesterol, 759mg sodium, 36g carbohydrate (6g sugars, 4g fiber), 15g protein. Diabetic exchanges: 2 starch, 2 vegetable, 1 lean meat, 1 fat. 30/44 Spinach-Mushroom Scrambled Eggs From the Recipe Creator: My husband and I had breakfast at a hotel and enjoyed an amazing mushroom and egg dish. As soon as I got home, I made my own rendition. —Rachelle McCalla, Batesville, Arkansas Nutrition Facts: 1 serving: 162 calories, 11g fat (5g saturated fat), 226mg cholesterol, 417mg sodium, 2g carbohydrate (1g sugars, 0 fiber), 14g protein. Diabetic Exchanges: 2 medium-fat meat. 31/44 No-Cook Fresh Tomato Sauce From the Recipe Creator: Try this sauce at times when you have a box of pasta or a store-bought pizza shell and need a sure-fire topping. Dinner is served. —Julianne Schnuck, Taste of Home Designer Nutrition Facts: 3/4 cup sauce: 64 calories, 4g fat (1g saturated fat), 0 cholesterol, 9mg sodium, 7g carbohydrate (5g sugars, 2g fiber), 2g protein. Diabetic Exchanges: 1 vegetable, 1 fat. 32/44 Spinach ‘n’ Broccoli Enchiladas From the Recipe Creator: I like to top this wonderful meatless meal with lettuce and serve it with extra picante sauce. It's quick, easy, filled with fresh flavor and definitely satisfying! —Lesley Tragesser, Charleston, Missouri Nutrition Facts: 1 enchilada: 246 calories, 8g fat (3g saturated fat), 11mg cholesterol, 614mg sodium, 32g carbohydrate (4g sugars, 2g fiber), 13g protein. Diabetic Exchanges: 1-1/2 starch, 1 vegetable, 1 lean meat, 1/2 fat. 33/44 Tomato-Garlic Lentil Bowls From the Recipe Creator: An Ethiopian recipe inspired this feel-good dinner that's tangy, creamy and packed with hearty comfort. —Rachael Cushing, Portland, Oregon Nutrition Facts: 3/4 cup: 294 calories, 3g fat (0 saturated fat), 0 cholesterol, 419mg sodium, 49g carbohydrate (5g sugars, 8g fiber), 21g protein. Diabetic Exchanges: 3 starch, 2 lean meat, 1/2 fat. 34/44 Quinoa-Stuffed Squash Boats From the Recipe Creator: My colorful “boats” with quinoa, garbanzo beans and pumpkin seeds use delicata squash, a winter squash with edible skin that’s cream-colored with green stripes. In a pinch, acorn squash will do—but don't eat the skin! —Lauren Knoelke, Milwaukee, Wisconsin Nutrition Facts: 1 stuffed squash half: 275 calories, 8g fat (2g saturated fat), 9mg cholesterol, 591mg sodium, 46g carbohydrate (9g sugars, 10g fiber), 9g protein. Diabetic Exchanges: 3 starch, 1 lean meat, 1/2 fat. 35/44 Warm Rice & Pintos Salad From the Recipe Creator: During my undergrad years, my roommate taught me how to cook vegetarian dishes like brown rice with pintos. It's so versatile; you can turn it into a wrap or casserole. —Natalie Van Apeldoorn, Vancouver, British Columbia Nutrition Facts: 1 serving: 331 calories, 8g fat (2g saturated fat), 7mg cholesterol, 465mg sodium, 50g carbohydrate (5g sugars, 9g fiber), 12g protein. Diabetic Exchanges: 2-1/2 starch, 2 vegetable, 1 lean meat, 1/2 fat. 36/44 Broccoli Casserole From the Recipe Creator: Even people who don’t like broccoli beg me to make this comforting broccoli cheese casserole recipe. It's similar to a classic green bean casserole, but the melted cheese just puts it over the top. —Elaine Hubbard, Pocono Lake, Pennsylvania Nutrition Facts: 3/4 cup: 359 calories, 26g fat (11g saturated fat), 30mg cholesterol, 641mg sodium, 19g carbohydrate (4g sugars, 3g fiber), 8g protein. 37/44 Mushroom-Bean Bourguignon From the Recipe Creator: In our family, boeuf bourguignon has been a staple for generations. I wanted a meatless alternative. All this dish needs is a French baguette. —Sonya Labbe, West Hollywood, California Nutrition Facts: 1 cup: 234 calories, 6g fat (1g saturated fat), 0 cholesterol, 613mg sodium, 33g carbohydrate (6g sugars, 7g fiber), 9g protein. Diabetic Exchanges: 2 starch, 2 vegetable, 1 lean meat, 1 fat. 38/44 Veggie Bean Tacos From the Recipe Creator: In the summer when fresh corn and just-picked tomatoes are in season, authentic Mexican dishes like this leave you always wanting that next bite. My personal preference is to serve them with a slice of lime to squeeze over the avocado. —Tonya Burkhard, Davis, Illinois Nutrition Facts: 2 tacos (calculated without sour cream): 378 calories, 16g fat (4g saturated fat), 13mg cholesterol, 517mg sodium, 52g carbohydrate (7g sugars, 10g fiber), 13g protein. 39/44 Coconut-Ginger Chickpeas & Tomatoes From the Recipe Creator: This is my go-to quick dish. When you add tomatoes, you can also toss in some chopped green peppers (jalapenos, if you like heat) to make it even more colorful. —Mala Udayamurthy, San Jose, California Nutrition Facts: 2/3 cup chickpea mixture with 3/4 cup rice: 402 calories, 12g fat (3g saturated fat), 0 cholesterol, 590mg sodium, 65g carbohydrate (10g sugars, 10g fiber), 11g protein. 40/44 Portobello Mushrooms Florentine From the Recipe Creator: A fun and surprisingly hearty breakfast dish packed with flavor and richness. —Sara Morris, Laguna Beach, California Nutrition Facts: 1 stuffed mushroom: 170 calories, 10g fat (4g saturated fat), 204mg cholesterol, 428mg sodium, 9g carbohydrate (3g sugars, 3g fiber), 12g protein. Diabetic Exchanges: 2 vegetable, 1 lean meat, 0.500 fat. 41/44 Sweet Potatoes with Cilantro Black Beans From the Recipe Creator: As a vegan, I'm always looking for impressive dishes to share. Sweet potatoes loaded with beans and a touch of peanut butter are one of my mom’s favorites. —Kayla Capper, Ojai, California Nutrition Facts: 1 potato with 1/2 cup black bean mixture: 400 calories, 6g fat (1g saturated fat), 0 cholesterol, 426mg sodium, 77g carbohydrate (26g sugars, 12g fiber), 11g protein. 42/44 Buckwheat Pancakes From the Recipe Creator: This buckwheat pancake recipe uses buckwheat flour instead of the wheat-based variety. The light and tender buckwheat pancakes offer a nutty flavor and hearty texture. —Taste of Home Test Kitchen Nutrition Facts: 2 pancakes (calculated without syrup and additional butter): 195 calories, 6g fat (3g saturated fat), 63mg cholesterol, 667mg sodium, 31g carbohydrate (11g sugars, 3g fiber), 7g protein. Diabetic exchanges: 2 starch, 1 fat. 43/44 Veggie Tacos From the Recipe Creator: These vegetarian tacos are stuffed with a blend of sauteed cabbage, peppers and black beans so filling, you won't miss the meat. Top with avocado, cheese or a dollop of sour cream. —Taste of Home Test Kitchen Nutrition Facts: 2 tacos: 430 calories, 22g fat (5g saturated fat), 14mg cholesterol, 770mg sodium, 47g carbohydrate (8g sugars, 10g fiber), 12g protein. 44/44 Mediterranean Chickpeas From the Recipe Creator: Add this to your meatless Monday lineup. It's great with feta cheese on top. —Elaine Ober, Brookline, Massachusetts Nutrition Facts: 1 cup chickpea mixture with 2/3 cup couscous: 340 calories, 10g fat (1g saturated fat), 0 cholesterol, 677mg sodium, 51g carbohydrate (9g sugars, 9g fiber), 11g protein."
}