{
  "url": "https://www.verywellhealth.com/thymus-gland-overview-4582270",
  "title": "Thymus Gland Role in Your Immune System",
  "text": "Thymus Gland Role and Immune Function By Lynne Eldridge, MD Updated on December 25, 2025 Medically reviewed by Doru Paul, MD Table of Contents View All Table of Contents Function Types of Thymus Cells Disorders Close Key Takeaways The thymus gland makes white blood cells called T-cells that help fight infections.The thymus produces hormones that regulate immune response, including thymosin and thymulin.As you age, the thymus gland shrinks, which may make you more likely to get sick. The thymus gland, located behind the breastbone and between the lungs, plays a vital role in the immune system. This small organ makes white blood cells, called T-cells, and is important in fighting off infection. It also plays a messaging role in the endocrine system. Your thymus is most active in your younger years. Certain conditions, as well as advancing age, can lead to thymus-related health issues. Illustration by Nez Riaz for Verywell Health Function The thymus gland is usually located behind the breastbone, in front of the heart and between the lungs. In some people, though, this organ is found in the neck or upper chest. Up through puberty, your thymus gland is very active. Then it starts to shrink slowly. Some researchers believe the shrinking of the thymus may be what triggers the aging process. That's why aging often means getting sick more and responding to vaccines less. The thymus serves both the immune and endocrine systems, with a role in the following: T-cell production: The thymus produces and trains T-cells that help to fight bacteria, viruses, and toxins. They assist with producing antibodies. They also identify and attack cancer cells, and help to prevent autoimmune disorders. The three main types of T-cells include regulatory, helper, and cytotoxic T-cells. Hormone production: The thymus gland produces several hormones that regulate immune response. They include thymosin, thymic humoral factor, thymopoietin, and thymulin. The thymus gland also makes small amounts of hormones produced in other areas of the body. These include melatonin, which helps you sleep, and insulin, which helps control your blood sugar. Types of Thymus Cells Inside the thymus gland, there are many different cells: Epithelial cells line all body surfaces and act as a protective barrier. Kulchitsky cells make hormones, chemical messengers for the thymus and other cells. Thymocytes are cells that become mature T lymphocytes, specialized infection fighters. Dendritic cells are found in the skin and other tissues. They help protect against toxins and other foreign substances. Macrophages are cells that are sometimes called the \"garbage trucks\" of the immune system. They eat foreign matter and clear away tumors. B lymphocytes are cells that make antibodies, proteins that attack viruses and bacteria. Myoid cells are muscle-like cells. Scientists believe they trigger the autoimmune response in a muscle disorder. Disorders Many conditions can affect the thymus gland, ranging from genetic disorders to cancers in older adults. These can lead to problems with immunity and autoimmunity. These conditions include: DiGeorge syndrome: This causes a T-cell deficiency due to an absent or underdeveloped thymus gland at birth, in turn leading to infection risk and immune system problems. This can cause severe combined immunodeficiency (SCID), which is fatal early in life without treatment. Thymic hyperplasia: With this condition, the thymus becomes swollen and inflamed. This can occur in autoimmune disorders such as myasthenia gravis (MG), lupus, and rheumatoid arthritis (RA). Thymic cysts: Cysts are abnormal growths filled with liquid. They're tiny, less than 3 centimeters (cm). Thymic cysts are usually not a problem. Tumors of the thymus gland: Thymomas are tumors that occur within the thymus gland. They can be benign, but thymus cancers can become aggressive and spread to other areas. Thymic lymphomas, germ cell tumors, and carcinoids also occur. Symptoms of Thymus Cancer Symptoms of thymus cancer include shortness of breath, a cough (which may include bloody sputum), chest pain, difficulty swallowing, and appetite and weight loss. These can be the result of a thymus tumor pressing on nearby blood vessels, airways, or the esophagus. Sometimes persons with thymomas can develop other immune conditions. These include: Myasthenia gravis (MG): This is a condition where your muscles weaken and tire, and you lose your ability to control them. About 75% of people diagnosed with myasthenia gravis have impaired thymus function.Pure red cell aplasia: This is a condition where your T-cells attack young red blood cells. This causes severe anemia, a lack of oxygen-carrying red blood cells. It occurs in roughly 5% of people with thymomas.Hypogammaglobulinemia: This is a condition where the B-cells don't make enough antibodies.Thymoma-associated multiorgan autoimmunity: This condition is similar to the rejection seen in some people with organ transplants. In these cases, the tumor produces T-cells that attack a person's body. Can You Live Without a Thymus Gland? Surgically removing the thymus (thymectomy) is sometimes required to treat certain conditions, such as thymic tumors or myasthenia gravis. It is possible for people to live without a thymus.However, studies have linked removing the thymus in infants to an increased risk of infections and autoimmune disorders. Adults who undergo this procedure are often less affected. Read more: Health A-Z Cancer Lymphoma 16 Sources Verywell Health uses only high-quality sources, including peer-reviewed studies, to support the facts within our articles. Read our editorial process to learn more about how we fact-check and keep our content accurate, reliable, and trustworthy. Li YR, Zúñiga-Pflücker JC. Thymus aging and immune reconstitution, progresses and challenges. Semin Immunol. 2023;70:101837. doi:10.1016/j.smim.2023.101837 Paúl C, Teixeira L, Ribeiro O. Active aging in very old age and the relevance of psychological aspects. Front Med (Lausanne). 2017;4:181. doi:10.3389/fmed.2017.00181 Thapa P, Farber DL, The role of the thymus in the immune response. Thorac Surg Clin. 2019;29(2):123-131. doi:10.1016/j.thorsurg.2018.12.001 Janeway CA, Travers P, Walport M, Shlomchik MJ. T cell-mediated immunity. Immunobiology: The Immune System in Health and Disease 5th edition. New York. Garland Science. Csaba G. The immunoendocrine thymus as a pacemaker of lifespan. Acta Microbiol Immunol Hung. 2016;63(2):139-158. doi:10.1556/030.63.2016.2.1 Kenhub. Thymus histology. American Academy of Allergy, Asthma, & Immunology. DiGeorge Syndrome (DGS). Yamada D, Matsusako M, Kurihara Y. Review of clinical and diagnostic imaging of the thymus: from age-related changes to thymic tumors and everything in between. Jpn J Radiol. 2024;42(3):217-234. doi:10.1007/s11604-023-01497-w Jung W, Cho S, Yum S, Lee YK, Kim K, Jheon S. Differentiating thymoma from thymic cyst in anterior mediastinal abnormalities smaller than 3 cm. J Thorac Dis. 2020;12(4):1357-1365. doi:10.21037/jtd.2020.02.14 National Cancer Institute. Thymoma and thymic carcinoma treatment (PDQ)—Patient version. American Cancer Society. Signs and symptoms of thymus cancers. Kabir A, Alizadehfar R, Tsoukas CM. Good's syndrome: Time to move on from reviewing the past. Front Immunol. 2022;12:815710. doi:10.3389/fimmu.2021.815710 Okui M, Yamamichi T, Asakawa A, Harada M, Horio H. Pure red cell aplasia associated with Good syndrome. Korean J Thorac Cardiovasc Surg. 2017;50(2):119–122. doi:10.5090/kjtcs.2017.50.2.119 Fukushima A, Ichimura Y, Obata S, et al. Thymoma-associated multi-organ autoimmunity: A case of graft-versus-host disease-like erythroderma complicated by Good syndrome successfully treated by thymectomy. J Dermatol. 2017;44(7):830-835. doi:10.1111/1346-8138.13777 Northwestern Medicine. Thymectomy. Stosio M, Ruszkowski J, Mikosik-Roczyńska A, Haponiuk I, Witkowski JM. The significance of neonatal thymectomy for shaping the immune system in children with congenital heart defects. Kardiochir Torakochirurgia Pol. 2017;14(4):258–262. doi:10.5114/kitp.2017.72231 Additional Reading Fahy GM, Brooke RT, Watson JP, et al. Reversal of epigenetic aging and immunosenescent trends in humans. Aging Cell. 2019;18(6):e13028. doi:10.1111/acel.13028 Zdrojewicz Z, Pachura E, Pachura P. The thymus: a forgotten, but very important organ. Adv Clin Exp Med. 2016;25(2):369-375. doi:10.17219/acem/58802 By Lynne Eldridge, MD Lynne Eldrige, MD, is a lung cancer physician, patient advocate, and award-winning author of \"Avoiding Cancer One Day at a Time.\" See Our Editorial Process Meet Our Medical Expert Board Share Feedback Was this page helpful? Thanks for your feedback! What is your feedback? Helpful Report an Error Other Submit"
}