{
  "url": "https://www.stmmcs.net/",
  "title": "St. Mary Magdalene & St. Martin Church and Preschool",
  "text": "Come as you are. Come as you can. We've saved you a seat. At the Episcopal Church of St. Mary Magdalene and St. Martin, it doesn't matter where you are on your spiritual journey or where you hope to go. It doesn't matter what you believe, or even what you doubt. It doesn't matter whom you love. Our church congregation welcomes you with open arms. We call ourselves “St. MM&M’s.” We are a loving, diverse, and progressive Christian community of faith. We worship God by following the way of Christs’ love. Our congregation is energetic, optimistic, and fun and we are engaged with the community helping to better the lives of individuals, families and the entire community. Seek solace, take action - all at Sts. MM&M. The Episcopal Church of St. Mary Magdalene & St. Martin understands that faith is about more than the individual - it's about serving each other and creating a more just and loving future for all people. Serve. Grow. Thrive. Let's walk the \"Way of Love\" togetherThe Episcopal Church of St. Mary Magdalene & St. Martin in Coral Springs is the space to connect with a community inspired by the unconditional love of Jesus Christ. Empower Hope. Transform Lives. Your generosity ignites change, turning hope into action and transforming lives within our community and beyond. At Sts. MM&M, your support fuels bold ministries—feeding the hungry, uplifting the vulnerable, and empowering lasting impact. Find Connection and Care at Sts. MM&M. Find out what's happening at Sts. MM&M. There is no full life without relationships. Find caring relationships and camaraderie at Sts. MM&M, sustained by the love of God. We Can't wait to get to know you. Worship Times Join us this Sunday 8:30 am - Worship in English 10:20 am - Sunday School Begins 10:30 am - Worship in English 12:20 pm - Sunday School in Spanish Begins 12:30 pm - Worship in Spanish Weekday Worship Monday, 7:00 pm, Evening Prayer Online Wednesday, 7:00 pm, Anamchara Prayer Online"
}