{
  "url": "https://cnes.osceolaschools.net/",
  "title": "Chestnut Elementary School for Science and Engineering - Home",
  "text": "Homepage See What Makes Us Great At Chestnut Elementary School, our students are immersed in an academically rich curriculum that fosters educational excellence through an enhanced focus on STEAM. Since 1995, Chestnut has been a pillar within the Poinciana community, thriving on excellence and sparking a passion for learning among our youngest learners. Latest News Stay up to date on the latest news from Chestnut Elementary and the Osceola County School District! Upcoming Events View the full calendar to see all the exciting events we have happening in the next few weeks and months! What We Offer: Excellence. Success. Future Ready. - We Embrace CHOICE As a Choice District, we allow parents to select the school they want their children to attend, as long as that school has capacity and program availability. - Safety and Security Each one of our public schools has a full-time sworn law enforcement officer serving as a School Resource Officer on campus every day. - Outstanding Certified Educators and Staff Our students have highly-qualified, certified teachers who provide engaging, relevant, and rigorous instruction. - Rigorous Curriculum & Student Support We offer a rigorous curriculum and systems of support, complete with college preparatory and career and technical education paths to meet the needs of every student - Acceleration Opportunities Abound Students have the opportunity to take high school credit courses in middle school and to earn college/postsecondary credit at no cost to parents while still in high school. - State-of-the-Art-Career Training Programs We offer courses that allow students to explore career interests, master workplace competencies, gain employable skills, and earn industry certifications and licensing upon graduation Testimonials Stay Connected Whether it’s celebrating student achievements, sharing resources for parents, or providing essential updates, our social media channels are a great way to stay informed. Follow us now and never miss a moment!"
}