{
  "url": "https://oldnavy.gap.com/browse/info.do?cid=56526",
  "title": "Earn Super Cash In Stores & Online! | Old Navy",
  "text": "Start Earning With These How it works: Spend: $25+ Earn: One universal Super Cash coupon Redeem: $20 off if you spend $50-$99.99 $40 off if you spend $100-$149.99 $60 off if you spend $150+ Can't find your Super Cash? Sign in to Your Account to access the Value Center. Select the Rewards & Offers option from the menu. See your Super Cash codes, rewards balance and other special offers. Apply them to your purchase with just a click. Need more help? Call us for further assistance at 1-800-653-6289 What is Super Cash? Super Cash is a program for customers to get more savings at Old Navy stores and online. The coupons can be earned and redeemed during specific 'Super Cash' periods throughout the year. Don't worry, we'll let you know when those times are. How will I receive my Super Cash? For retail stores and online there is a single universal coupon. One coupon per transaction while supplies last. Customers shopping in our retail stores will recieve a Super Cash coupon for any transaction made over $25 - limit one coupon issued per transaction. Online customers will receive Super Cash coupon via email within approximately 24 hours of completing qualifying purchase. Coupons may be saved to a mobile device for later use. *New Starting 8/2/25* Navyist Rewards Members & Gap Inc. credit card holders shopping online & in-store will now receive a simple, coupon code via email after qualifying purchases. The code can only be used by the Navyist Rewards Member and can be used as many times as Super Cash was earned with qualifying purchases. How do I use my Super Cash? Regardless of whether you earned Super Cash in-stores or online, you can redeem it in either place for up to $60 in Super Cash. You have the flexibility to spend less than the full required threshold to redeem a Super Cash coupon, but you will receive a corresponding lower value discount based on the amount you spend. You will forfeit the remaining potential online earned Super Cash value from that coupon. You can only use one Super Cash coupon per transaction, but there is no limit to how many Super Cash coupons you can redeem overall. Super Cash is not valid at any other Gap Inc. brands, or at our clearance centers. *New Starting 9/27/25* when shopping online, Navyist Rewards Members & Gap Inc. credit card holders are required to sign-in to their Navyist Rewards Member account in order to apply their coupon code at checkout. When shopping in stores, Rewards Members and Cardmembers should let store associate know they have Super Cash and provide their account info (email or phone number) to apply their coupon code at checkout. Can I combine my Super Cash with other coupons? Can I combine my Super Cash with other coupons? Your eligible purchase total will be determined after your Super Cash discount is applied. Super Cash cannot be redeemed with any other coupons or promotions. However, Gap Inc. credit card members may redeem reward points. Points can be applied to online transactions at checkout by selecting My Points and Rewards in 100-point increments. Rewards can also be applied in-store at checkout. Old Navy Super Cash Program Terms Qualifying merchandise purchases at participating Old Navy and Old Navy Outlet/Factory stores and online at www.oldnavy.com or www.oldnavy.ca in the United States, Puerto Rico and Canada, during eligible time periods will earn Super Cash coupons which can be redeemed for a discount on a future purchase during a subsequent eligible time period. Super Cash cannot be earned at other Gap Inc. brand stores or websites, or in our clearance centers. Minimum purchase thresholds to earn Super Cash do not include: (a) amounts spent on purchases of gift cards; (b) amounts spent on purchases which occur outside the eligible earn time period; (c) any applicable costs of packaging, shipping & handling, gift wrap, or taxes. Super Cash is earned on the resulting cost of merchandise after all applicable discounts are first applied to the purchase price. Earn Super Cash coupons for each qualifying purchase of $25 or more within the eligible earn time period. Store purchasers will receive a Super Cash coupon from an associate while supplies last based on the qualifying transaction total. Online purchasers will receive a Super Cash coupon via email based on the qualifying transaction total. *New Starting 8/2/25* Navyist Rewards Members & Gap Inc. credit card holders shopping online & in-store will now receive a simple, coupon code via email after qualifying purchases. Super Cash coupons can be redeemed on qualifying merchandise purchases either at participating Old Navy and Old Navy Outlet/Factory stores and online at www.oldnavy.com or www.oldnavy.ca in the United States, Puerto Rico and Canada, during the eligible redeem time period regardless of which channel they were earned. Super Cash cannot be redeemed at other Gap Inc. brand stores or websites, or in our clearance centers. Minimum purchase thresholds to redeem Super Cash do not include: (a) amounts spent on purchases of gift cards; (b) amounts spent on purchases which occur outside the eligible earn time period; (c) any applicable costs of packaging, shipping & handling, gift wrap, or taxes. Minimum purchase thresholds to redeem Super Cash are calculated on the resulting cost of merchandise after all applicable discounts are first applied to the purchase price. Limit one Super Cash coupon redeemed up to a maximum of $60 per transaction within the eligible redeem time period. If the amount of a purchase is less than the threshold to use the full value of a coupon, any unused balance of the Super Cash coupon will be forfeited. Super Cash coupons are valid for one time use only, have no cash value, and cannot be combined with other offers/discounts or employee discount (except Gap Inc. credit card holders can redeem up to 3 reward certificates in addition to Super Cash in a single transaction). Super Cash coupons must be presented at time of purchase in-store, or code entered at online checkout. The amount of discount to the purchase price resulting from the application of a Super Cash coupon will be allocated equally across all items purchased in the transaction. If you return some or all of the merchandise purchased with a Super Cash coupon, the dollar value discount of the Super Cash coupon will not be refunded or credited back. *New Starting 9/27/25* when shopping online, Navyist Rewards Members & Gap Inc. credit card holders are required to sign-in to their Navyist Rewards Member account in order to apply their coupon code at checkout. When shopping in stores, Rewards Members and Cardmembers should let store associate know they have Super Cash and provide their account info to the store associate (email or phone number) to apply their coupon code at checkout. Old Navy is not responsible for lost or stolen Super Cash coupons. Super Cash coupons cannot be applied to previous purchases. Super Cash coupons cannot be used toward payment on a Gap Inc. credit card account. Super Cash coupons are non-transferable and not for resale. Any unused Super Cash coupons remaining after the valid redemption period are forfeited. Rewards program members may convert unused Old Navy Super Cash (a coupon) to Rewards points. Each dollar of the Cash Coupon value converts to 1 Reward Point. Rewards Program Members must convert unused Cash Coupon(s) to points within 30 days of the last day to redeem your cash coupon. See Rewards Program Terms for details. Call customer service at 1-800-653-6289 with questions. By participating in the Super Cash Program (\"Program\"), customer agrees to release and hold harmless Old Navy, and its advertising and promotion agencies and their respective parents companies, subsidiaries, affiliates, partners, agents, representatives, successors, assigns, employees, officers, and directors (collectively, the \"Released Parties\") from any and all liability, loss, harm, damage, injury, cost or expense whatsoever including without limitation, property damage, which may occur in connection with the Program, or possession, acceptance and/or use or misuse of Super Cash. Old Navy reserves the right, in its sole discretion, to cancel, terminate, modify, extend or suspend this Program should cheating, fraud or other causes beyond its control corrupt or affect the administration, security, fairness or proper conduct of the Program."
}