{
  "url": "https://oglobo.globo.com/mundo/clima-e-ciencia/noticia/2026/02/01/cientistas-descobrem-que-tubaroes-brancos-desenvolvem-novo-tipo-de-dente-apenas-para-cortar-ossos-quando-envelhecem.ghtml",
  "title": "Cientistas descobrem que tubarões-brancos desenvolvem novo tipo de dente apenas para cortar ossos quando envelhecem",
  "text": "Cientistas descobrem que tubarões-brancos desenvolvem novo tipo de dente apenas para cortar ossos quando envelhecem Forma como sistema de alimentação dessa espécie é finamente ajustada ao longo da vida ajuda a explicar seu sucesso como predadora, indica novo estudo RESUMO Sem tempo? Ferramenta de IA resume para você GERADO EM: 31/01/2026 - 17:15 Evolução Dentária dos Tubarões-Brancos: Adaptação ao Envelhecimento Cientistas descobriram que tubarões-brancos desenvolvem novos tipos de dentes ao envelhecer, adaptando-se para cortar ossos. Estudo publicado na revista Ecology and Evolution revela que essas mudanças dentárias são cruciais para o sucesso dos tubarões como predadores. Os dentes evoluem de formas finas e acessórias para espessos e serrilhados, refletindo uma transição na dieta e no estilo de vida à medida que crescem. O tubarão-branco é uma obra-prima da engenharia evolutiva. Esses belos predadores deslizam sem esforço pela água, com cada movimento lento e deliberado da poderosa cauda impulsionando um corpo especializado em furtividade, velocidade e eficiência. Visto de cima, o dorso escuro se confunde com o azul profundo do oceano; visto de baixo, o ventre claro desaparece na superfície iluminada pelo sol. Em um instante, o deslizar calmo se transforma em ataque, com aceleração para mais de 60 quilômetros por hora, a forma elegante, semelhante a um torpedo, cortando a água com pouca resistência. Então surge sua característica mais icônica: fileiras de dentes afiados como lâminas, perfeitamente moldados para a vida no topo da cadeia alimentar. Há muito tempo os cientistas são fascinados pelos dentes do tubarão-branco. Exemplares fossilizados são coletados há séculos, e a estrutura larga e serrilhada dos dentes é facilmente reconhecida em mandíbulas e marcas de mordida de tubarões contemporâneos. Mas, até agora, surpreendentemente pouco se sabia sobre um dos aspectos mais fascinantes dessas estruturas tão bem moldadas: como elas mudam ao longo da mandíbula para atender as diferentes exigências ao longo da vida do animal. Uma nova pesquisa, publicada na revista Ecology and Evolution, buscou responder a isso. De dentes em forma de agulha a lâminas serrilhadas Diferentes espécies de tubarões evoluíram dentes adequados às suas necessidades alimentares, como dentes em forma de agulha para segurar lulas escorregadias; molares largos e achatados para esmagar moluscos; e lâminas serrilhadas para fatiar carne e gordura de mamíferos marinhos. Os dentes de tubarão também são descartáveis — eles são constantemente substituídos ao longo da vida, como uma esteira rolante que empurra um novo dente para a frente em poucas semanas. Os tubarões-brancos são mais conhecidos por seus grandes dentes triangulares e serrilhados, ideais para capturar e comer mamíferos marinhos como focas, golfinhos e baleias. Mas a maioria dos mais novos não começa a vida caçando focas. Na verdade, eles se alimentam principalmente de peixes e lulas e geralmente só passam a incorporar mamíferos à dieta quando atingem cerca de 3 metros de comprimento. Isso levanta uma questão fascinante: os dentes que surgem nessa “esteira rolante” mudam para enfrentar desafios específicos das dietas em diferentes estágios de desenvolvimento, assim como a evolução produz dentes adaptados às dietas de diferentes espécies? Estudos anteriores tendiam a se concentrar em um pequeno número de dentes ou em um único estágio da vida. O que faltava era uma visão completa, ao longo de toda a mandíbula, de como o formato dos dentes muda — não apenas entre a mandíbula superior e a inferior, mas da frente da boca até o fundo, e da fase juvenil à adulta. Os dentes mudam ao longo da vida Quando foram examinados dentes de quase 100 tubarões-brancos, padrões claros emergiram. Primeiro, o formato dos dentes muda drasticamente ao longo da mandíbula. Os seis primeiros dentes de cada lado são relativamente simétricos e triangulares, bem adequados para agarrar, perfurar ou cortar a presa. Depois do sexto dente, porém, o formato muda. Os dentes tornam-se mais parecidos com lâminas, mais adaptados para rasgar e cisalhar a carne. Essa transição marca uma divisão funcional dentro da mandíbula, em que diferentes dentes desempenham papéis distintos durante a alimentação, de forma semelhante ao que ocorre com os incisivos na frente e os molares no fundo da boca humana. Ainda mais marcantes são as mudanças que ocorrem à medida que os tubarões crescem. Com cerca de 3 metros de comprimento corporal, os tubarões-brancos passam por uma grande transformação dentária. Os dentes juvenis são mais finos e frequentemente apresentam pequenas projeções laterais na base, chamadas cúspides acessórias (cusplets), que ajudam a segurar presas pequenas e escorregadias, como peixes e lulas. À medida que os tubarões se aproximam dos 3 metros, essas cúspides desaparecem e os dentes se tornam mais largos, mais espessos e serrilhados. De muitas formas, essa mudança reflete um ponto de virada ecológico. Tubarões jovens dependem de peixes e presas pequenas, que exigem precisão e capacidade de agarrar corpos menores. Tubarões maiores passam a mirar cada vez mais mamíferos marinhos: animais grandes e rápidos, que exigem poder de corte, e não apenas aderência. Quando os tubarões-brancos atingem esse tamanho, eles desenvolvem um estilo completamente novo de dente, capaz de fatiar carne densa e até mesmo ossos. Alguns dentes se destacam ainda mais. Os dois primeiros dentes de cada lado da mandíbula — os quatro dentes centrais — são significativamente mais espessos na base. Eles parecem ser os principais dentes de “impacto”, que absorvem a força da mordida inicial. Enquanto isso, o terceiro e o quarto dentes superiores são um pouco mais curtos e inclinados, sugerindo um papel especializado em segurar presas que se debatem. Seu tamanho e posição também podem ser influenciados pela estrutura do crânio subjacente e pela localização de tecidos sensoriais importantes envolvidos no olfato. Também encontramos diferenças consistentes entre as mandíbulas superior e inferior. Os dentes inferiores são moldados para agarrar e segurar a presa, enquanto os superiores são projetados para cortar e desmembrar — um sistema coordenado que transforma a mordida do tubarão-branco em uma ferramenta de alimentação altamente eficiente. Uma história de vida escrita nos dentes Em conjunto, essas descobertas contam uma história convincente. Os dentes dos tubarões-brancos não são armas estáticas, mas registros vivos do estilo de vida em mudança do animal. A substituição contínua compensa dentes perdidos e danificados, mas, tão importante quanto isso, permite atualizações de design que acompanham as mudanças na dieta ao longo do desenvolvimento. Essa pesquisa ajuda a entender melhor como os tubarões-brancos têm sucesso como predadores de topo e como seu sistema de alimentação é finamente ajustado ao longo da vida. Ela também destaca a importância de estudar os animais como organismos dinâmicos, moldados tanto pela biologia quanto pelo comportamento. No fim, os dentes de um tubarão-branco não revelam apenas como ele se alimenta — eles revelam quem ele é, em cada fase da vida. * Emily Hunt é doutoranda, Escola de Ciências da Vida e Ambientais, Universidade de Sydney. David Raubenheimer é cátedra Leonard P. Ullman em Ecologia Nutricional, líder do eixo de Nutrição do Charles Perkins Centre, presidente da Sydney Food and Nutrition Network, Universidade de Sydney. Ezequiel M. Marzinelli é professor associado, Faculdade de Ciências, Universidade de Sydney. * Este artigo foi republicado de The Conversation sob licença Creative Commons. Leia o original."
}