{
  "url": "https://dublinohiousa.gov/abbey-theater/",
  "title": "The Abbey Theater of Dublin – City of Dublin, Ohio, USA",
  "text": "Located in the Dublin Community Recreation Center (5600 Post Rd.), the 200-seat Abbey Theater of Dublin offers a wide variety of theatrical and musical performances, movies and lectures at community prices. The intimate venue is perfect for Central Ohio-based performing arts groups to produce outstanding entertainment. Under the direction of Joe Bishara, the Abbey Theater of Dublin has become a destination for theater companies and artists to premiere diverse and inclusive productions featuring artists of all ages for patrons of all ages. Support the arts in your community. Tickets are available online, at the door, or by calling 614.410.4550. All major credit cards are accepted. Joe Bishara has collaborated on more than 300 theatrical productions nationwide as an award-winning actor, director, educator and producer. He serves as the Theater Supervisor for the City of Dublin (Abbey Theater of Dublin), Founder and Managing Director of New Albany Youth Theatre and as a Creative Consultant for Broadway2LA Acting Studio. A dedicated champion of new work, Joe created the Abbey Theater of Dublin’s Virtual Theatre Project and its Pre-Professional Programs, co-founded the Otterbein Playwrights Collective and spent six years as Program Coordinator for the Greater Columbus Arts Council’s playwriting fellowship. He also completed six terms as President of the Central Ohio Theatre Roundtable. Joe is a proud member of Actors’ Equity Association (AEA) and the Musical Theatre Educators’ Alliance (MTEA), an associate member of the Stage Directors and Choreographers Society (SDC) and a Board Member of the Ohio Alliance for Arts Education (OAAE). The Dublin Community Recreation Center (DCRC) will be closed Saturday, Aug. 29 through Monday, Sept. 7, 2026 for annual cleaning, maintenance and repairs. The DCRC will reopen at 5:30 a.m. Tuesday, Sept. 8. Offices will be staffed for phone calls from 8 a.m. to 5 p.m. Monday through Friday. For additional closings and construction updates visit our website. Bocce Ball Courts Two regulation bocce ball courts are available for public use, subject to senior adult programming and league play. Bocce ball sets may be checked out at the Welcome Desk by players 18 and older. Classrooms The classrooms house a variety of programs, including pottery and arts & crafts—meeting the needs of preschoolers, children, teens, adults and senior adults. Community Hall The Community Hall provides space for parties, receptions, meetings and community events. The facility seats up to 300 or can be divided into smaller rooms. Abbey theater of Dublin A 200-seat theater can be used for musical, theatrical and dance performances; film/video; lectures; and seminars. Computer Lab Equipped with workstations and a variety of software programs, the computer lab provides high-speed Internet access and opportunities for beginning and intermediate instruction. Open to ages 18 & up. Family Locker Rooms Each family locker room has its own shower, restroom and lockers. One locker room, designed for people with special needs, features a dressing table. Fitness Area Looking for free weights and cardiovascular equipment? Check out the fully equipped fitness area on the first floor. You will find treadmills, elliptical machines, bicycles and stair steppers along with free weights, Nautilus and a complete set of Cybex strength equipment. Group Fitness Studios If you enjoy group fitness, check out the myriad of classes offered. Two state-of-the-art studios feature suspended floors to help reduce impact and injury. Several pass options are available, allowing participants to choose from a weekly schedule of classes that include Spinning®, Pilates and TRX. Jogging/Walking Track Joggers and walkers on the second floor track can cover a mile in 13 laps. An expanse of windows provides views of the pools and the outdoors. Multi-Purpose Pool The competitive/lap pool measures 25 yards by 25 meters and has two one-meter diving boards. This pool often is divided for activities such as aqua aerobics, open swim, swim team practice and instruction. Bleachers provide ample seating and a separate entrance makes it perfect for area swim meets. The natatorium walls in both the lap and leisure pools are lined with sound-absorbing material. Leisure Pool A unique feature of the DCRC is the leisure pool, which includes a lazy river, frog slide for children, double helix slide for those a little more daring and a zero-foot entry point for cautious tots. The warmer water and 3.5-foot maximum depth make this pool perfect for children, adults and senior adults. Senior Adult Lounge An elegant, cozy lounge welcomes senior adults to our center. Enjoy playing cards with friends, reading by a fireplace or simply relaxing in this peaceful environment. Teen Lounge A teen lounge offers space and a variety of programming opportunities for Dublin teens. Wee folk/Youth Lounge While moms and dads are working out, attending a class or relaxing in the hot tub, they can rest assured that their children—from ages 6 weeks to 12 years—are nearby and safe. Children can play in the indoor or outdoor area or engage in age-appropriate games and activities. Hours of Operation Our parks are open for your enjoyment from dawn to dusk, unless otherwise noted at the park or during certain special events. Shelters/Pavilions A number of our shelters and pavilions are available to reserve on a first-come, first serve basis. Please be courteous of your neighbors and abide by your reservation times. Keep it Clean We’re sure you’ll find Dublin’s parks and bikeways to be clean, beautiful places to enjoy with your family. The City strives to keep its parks, playgrounds and bikeways clean and free of litter. Please leave the parks as clean as you find them so that others will enjoy them as much as you do. Disposal of litter in public places is prohibited unless placed in public trash containers or using City-authorized containers as part of the City’s refuse, recycling and yard waste collection programs. Pets We know your furry friends enjoy nature as much as you do. We ask you to be safe and courteous with your pets. Animals may not run at-large in our parks. All animals must be under the owner’s control at all times. All pets must be securely leashed, kept in a vehicle or suitably caged. Animal owners also must pick up and properly dispose of any fecal matter left by their pets. It’s not just courteous — it’s the law! Horses Horses are allowed in designated areas of Glacier Ridge Metro Park. Hunting and Fishing For the safety of our residents, hunting is forbidden in the City. Fishing is permitted in designated areas, including certain City park ponds and in the Scioto River (with a license). Please fish only in ponds where signs prohibiting fishing are not posted. Respect our Parks Plants and animals also are part of the Dublin community. Please respect the plant and animal life and ecosystems of our natural areas. Enjoy the flowers, trees and other flora without picking or damaging plants. Touching or disturbing wildlife, including animal and bird nesting areas and eggs can be dangerous to humans — not to mention our flora and fauna! And please do not damage or remove any property or natural feature, including stones and minerals, earth, wood, and nuts. Take only pictures and leave only footprints in our parks. Dublin Recreation Services is committed to providing quality recreation programs and facilities for the Dublin community. Use of the facilities by families and citizens is strongly encouraged. The following policies have been established to operate the DCRC and to ensure our patrons quality and safe recreation experiences: The following activities, although not an exhaustive list, are examples of behaviors that will result in disciplinary action and police reports when applicable: Recreation Services 614.410.4550 Parks, Shelter Houses & Kaltenbach Rentals 614.410.4510 24-Hour Information Hotline: 614.410.4946 Dublin Community Recreation Center Rentals 614.410.4550 Report an Issue Request a service or report an Issue. Tell Dublin Send us your public input. 5555 Perimeter Drive Dublin, Ohio, 43017 Mon – Fri: 8 a.m. – 5 p.m."
}