{
  "url": "https://www.cnn.com/2026/02/02/entertainment/kpop-demon-hunters-golden-grammy-intl-hnk",
  "title": "‘Golden’ wins K-pop’s first Grammy. Is this a breakthrough moment? | CNN",
  "text": "“We’re goin’ up, up, up, it’s our moment,” proclaim virtual girl band Huntr/x in their hit song “Golden.” And the lyrics couldn’t have been more apt as the song from Netflix megahit “Kpop Demon Hunters” made history on Sunday by claiming K-Pop’s first-ever Grammy. “Golden” was already a global chart-dominating force, but taking home the Best Song Written for Visual Media award in Los Angeles is a milestone moment for K-pop – a genre that despite its growing influence on Western pop culture has long been considered niche. “It does feel so miraculous in some ways. And destined in other ways … We’re just trying to process it all,” said Audrey Nuna, who lends her voice to a member of Huntr/x in the film. The Grammy itself went to the songwriters of “Golden” EJAE, Park Hong Jun, Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Seo Jeong Hoon and Mark Sonnenblick. And is the first win for any Korean songwriters, or producers. Accepting the award, Seo Jeong Hoon, who goes by the name 24, paid tribute to his mentor Park Hong Jun – known as Teddy – who he called “the pioneer of K-pop.” It was only in 2021 that a K-pop act first earned a Grammy nomination – that was superband BTS, who have been nominated five times but have never won. This year, songs released by K-pop – or K-pop-adjacent – artists received nominations in five categories, though only “Golden” took away a prize. In recent years the genre has gained huge global fandom as more groups – like Blackpink and Twice – broke into the US charts, went on world tours, and collaborated with big American artists. And the genre’s influence was evident throughout Sunday’s Grammys broadcast. The awards kicked off with Blackpink’s Rose singing the chart-topping collaboration “APT” with Bruno Mars, as stars in the audience sang along. Later, a multinational K-pop girl group KATSEYE grasped the stage with its “Gnarly” performance. Both were nominated for number of categories but were short of winning an award. While the win for “Golden” is historic, K-pop fans questioned if the song really fits the genre. “Not to say they didn’t deserve it (because they did). But I still don’t understand which part of Golden was Kpop. It was a 100% English song, in an English animation, for an English speaking audience. The only thing “K” about it were the singers,” one wrote on X after the award was announced. Areum Jeong, assistant professor of Korean Studies at Arizona State University, told the Associated Press that songs like “APT” and KATSEYE’s “Gabriela” – also Grammys nominees – “seem less K-pop than other K-pop songs that could have been nominated over the years.” She said the nominations strike her more as “a de-territorialized, hybrid idea of K-pop,” rather than a recognition of K-pop. The number of K-pop nominations for Grammys in 2026 “tells you that K-pop is not considered as something niche anymore,” Mathieu Berbiguier, a visiting assistant professor in Korean Studies at Carnegie Mellon University, told Associated Press. “Now, when we think about pop music in general, we also think of K-pop as part of it,” he said."
}