{
  "url": "https://coloradomountaindogs.com/classifieds",
  "title": "Available Pups — Colorado Mountain Dogs",
  "text": "Available CMDR Colorado Mountain Dog Puppies Colorado Mountain Dogs are bred to work on small farms. Check out our articles for owner information. *To place an ad for CMDR registered Colorado Mountain Dogs, please send one to two photos ( can be a composite photo), and your text and contact info to wendyjfrancisco@gmail.com Make sure to include parents names with farm letters, and litter #. Anne our registrar can help you get a litter number if you need. Classified adds remain posted for 3 months, and are $25, Pay for ads in our store link above. Email wendyjfrancisco@gmail.com if your ad doesn’t appear within 2 days. POSTED JAN 22,2026— Colorado. Frisky Goat Ranch - G5 (Purebred) Puppies Litter #: FGR025LIT2CMDR Born: December 30 th 2025 Location: Morrison, CO Meet our Colorado Mountain Dog puppies from the pairing of FGR Diego and CNK Penny of FGR—our first G5 purebred Colorado Mountain Dog litter! Diego is an affectionate, confident guardian who remains deeply attuned to his surroundings and is never one to turn down a good belly rub. Penny is a thoughtful, attentive presence with strong maternal instincts and a steady, intuitive approach to her role. Together, they represent the purpose and balance this breed was developed to achieve. These puppies are being raised with intentional early handling and exposure to farm life, including goats, chickens, small house dogs, barn cats, children, and regular visitors. This early exposure supports healthy development while allowing each puppy’s individual temperament to emerge naturally. We are committed to mindful, responsible breeding practices with a strong focus on temperament, structure, and overall health, supporting the future of the breed and the farms and families who rely on it. What’s Included: First and set of vaccinations, and deworming Microchip, Embark DNA test results. Raised in a working environment with exposure to goats, chickens, family life, and visitors Pricing: $1,650 each, $3,000 for a compatible pair (recommended for working guardians) Contact Cassie: Email: friskygoatranch@gmail.com Text: 303-909-2305 Learn more about individual puppies: https://friskygoatranch.com/litters/cmd-litter-penny-diego-2025/ Bring home one of these dogs and add both reliable protection and meaningful connection to your farm or family. POSTED Jan 15, 2025 - Colorado. “The Ranch” in Southwest Colorado has one female G4 Colorado Mountain Dog “Izzy” left from our litter by HWH Josey of TRCH and CNK Erebor. Both of these parents have a clean genetic slate and are exceptional with people and animals. Josey has proven herself to be a fabulous guardian dog as she has deterred several bears and mountain lions from our sheep and barnyard area just recently. She has been with the pups regularly and is “teaching them” everyday. Izzy is a laid back female with gentle playfulness and willingness to please. Izzy has all her pup vaccinations, leash training, and some general dog obedience. We are asking $1850. Please contact us if you have any questions 970-570-3002. Posted Dec 30,2025 - Arizona. G3 Puppies - Litter # ERR025LITG3 Elk Run Ranch (ERR) welcomed our first litter of G3 Colorado Mountain Dogs on November 21, 2025. This litter includes 3 males and 4 females, all with single dewclaws. Puppies have been living outside full-time since December 1, gaining early exposure to farm life and guardian routines. Mom - ABF Daisy Mae, now lovingly known as Mamma Mae, is the true guardian of the farm. Mae is very independent-minded and takes her job very seriously. She loves being outside, and almost never wants to come in the house. Mae always comes and checks in, but almost immediately goes back to her duty of watching over the farm. She is tall and lean, with a very refined face. Dad - OUM Uhtred is truly a spectacular dog. While many of his physical traits aren't the ideal for a CMD, his personality is spot on for what a Colorado Mountain Dog should be. Uhtred only barks only when needed, doesn't wander, he's huge and surprisingly gentle, and he naturally guards both the farm and his people. Both parents have been exposed to cattle, sheep, pigs, turkeys, chickens, cats, kids and the visiting elk. We have never had a chicken loss to predator attack since getting these dogs; they have been a game changer for the farm. We have coyotes, bobcat, mountain lions, badgers and (recently) a bear near our homestead. We sleep soundly with our chickens free ranging knowing that we have our two guardians watching over the farm. And we always know when someone is driving up our dirt road because the dogs alert us before we can even see the car. But once our visitors arrive, they greet them with wagging tales and have never shown aggression towards a guest. Uhtred and Mae truly are our team-mates helping to keep the farm safe, they are an integral part of our life and have exceeded our hopes for what livestock guardian dogs should be. The combination of OUM Uhtred and ABF Mae should produce some remarkable dogs that, I believe, will make the CMD breed proud. The puppies will be ready to go to their new homes on February 1st. Asking $1,200 per puppy, or 2 for $2,000. Feel free to call or text for more information on these adorable little teddy bears. I will have plenty of extra pictures ready! Heather Saur 512-787-8892. heather_marie214@hotmail.com POSTED DEC 14, 2025, Colorado. Born 11/12/25 Ready 1/07/26 - Breeders, — Can I get a drumroll please?!? Introducing a G2 litter of outcrosses! Litter #Number: LSK025LIT3G2 New genetics for your program! IJR Nio x UUU Rogue Laskowski Homestead We did bring in UUU Rogue… brand new genetics. Potential Buyers, these dogs will be phenomenal guardians. Rogue is our G1 outcross that we brought in comes from New Mexico. She is 50/50 Anatolian / Great Pyrenees. She is so loving and sweet. My favorite thing about her is how vigilant she is when it comes to protecting her animals. She has lived with her herd since 8 weeks old and has never taken a wrong step. She always has her eyes on the sky! Ariel predators don’t get past this girl! Nio is an outstanding guardian for his animals and loves his kiddos! Nio is a perfect family dog and ranch dog. He is a sole guardian and nothing gets past him. He is 100% Great Pyrenees. This litter is set for success through DNA/ OFA testing. Puppies have the potential of being 1 copy carrier of CT, although our breed is not affected. AVK:100% COI:0%, 4 males and 2 females available ! Discounts for multiple aka those starting their “pack” ! 2 vaccines/microchipped/ registered / puppy package/Dewormed 2/4/6/8 weeks -> 2 year health guarantee. For more information 951-492-8043 Laskowskihomestead@gmail.com Shaela Laskowski SOLD - Posted Dec 14, 2025 — Colorado G1 Colorado Mountain Dog Pup - Born 9/20/25 We have one male available to an approved home — we’ve been calling him Kairos. Lexi is a purebred Boz, new genetics, now officially accepted as a CMD foundation dog, and the pups are registered G1. Both parents, Lexi and Liam, are proven livestock guardians who are protective when needed, yet friendly, steady, and social once introduced. Exactly the kind of temperament that makes a dependable guardian. This cross brings together the calm CMD nature with the athletic ability and strong instincts of the Turkish Boz. We also keep our pups with both parents until at least 12 weeks, which gives them a strong foundation and better guardian behavior. Kairos is ready for his new home. Rehoming fee: $1650. Blake Minger — blakeminger@gmail.com Posted Dec 3, 2025 - Michigan (Update,Brooke sold, males available as of 12/22/25). Holy Trinity Monastery has 3 excellent G5 puppies available from our litter # HTM025LIT1CMDR out of FWF Bailey of HTM by NWF Maximo of HTM The puppies were born 10/14/25 and will be ready to start going to new families, farms and homesteads starting 12/9! The puppies have had all age appropriate dewormings and have received their vet wellness checks and first vaccine. They are being raised full time with our sheep & goats with their mentoring parents and big brother. They also have exposure to our herding dogs, cats and poultry. They have been well socialized by the monks at our monastery as well as our eager-to-volunteer visitors of all ages! This is a pretty balanced and well rounded litter. The 2 remaining boys and 1 female all show great potential to be effective guardians with the good nature of a Colorado Mountain Dog. Both of their parents work here on our farm along with their 1 year old brother from last year's litter. Their brother, Rousso, to me speaks volumes about what this breeding has to offer. He has one of the best dispositions of any dog we've owned and that includes some very stiff competition!! He is so sweet and good with visitors of all types but is an alert, effective guardian who really seems to love his job! We are asking $1000 for these puppies. This price will increase after Christmas to cover additional expenses and vaccinations. Please feel free to reach out for more information, pictures or videos. Fr Nick Garber agarberimat@gmail.com 810-941-8195 POSTED November 29, 2025 — Michigan. We are so excited to offer these future livestock and family guardians! Puppies are 11 week old G5 purebred Colorado Mountain Dogs who would really love to spend the Christmas season with their forever families and farms! Known for their loyal protection of livestock, their gentle temperaments with children and farm visitors, plus less barking and wandering, these pups are perfect for small farms and homesteads! Located in Hudsonville, MI. Puppies come: Vet checked Vaccinated Microchipped UTD on flea/tick/heartworm prevention Exposed to goats, chickens, and cats Already used to living outside Registered with the Colorado Mountain Dog Registry (litter #LWA025LIT2CMDR) With pedigrees and health records With a puppy care package With lifetime breeder mentorship and support Parents are: Guarding livestock 24/7 onsite Registered with the Colorado Mountain Dog Registry (NMSR Tecumseh of LWA and GHH Alcott of LWA) DNA tested Mom is OFA hip and elbow tested and received highest rankings, dad will be OFA tested when he turns two We are asking $1650 per puppy (w/$200 per puppy discount if you buy more than one), and are accepting reservations and deposits at this time. You can see full profiles of the litter, including parents' pedigrees, test results, and temperament information here. Our puppy interest form is available here. Please text, call, or email Katrina Curtis with any questions! 616-502-7631 littlewayacresmi@gmail.com We are asking $1650 per puppy (w/$200 per puppy discount if you buy more than one), and are accepting reservations and deposits at this time. You can see full profiles of the litter, including parents' pedigrees, test results, and temperament information here. Our puppy interest form is available here. Please text, call, or email Katrina Curtis with any questions! 616-502-7631 littlewayacresmi@gmail.com SOLD — Posted November 25, 2025 South Carolina - Male Colorado Mountain Dog puppy born August 1, 2025. He was purchased to be a guardian for our goats so our older dog can retire but he continues to climb over our gate to go back to our barn where our birds are. He loves people and would probably prefer to be a pet dog than a guardian. Located in Upstate SC. sydneycare@hotmail.com call or text 864-354-7331. Posted November 25,2025 — Florida! - Victory Family Farm is excited to introduce CMDR Colorado Mountain Dogs to Florida and South Alabama! Litter # VFF025LIT1CMDR. Puppies were born on 10/19/2025. These G5 purebred pups were born to an excellent pair, TOF Raven of VFF and ABF Marshall of VFF – both steady-tempered and exceptional with livestock and people. Raised right here with our family, the puppies have already been introduced to our goats, chickens, and friendly visitors of all ages. Their parents are proven guardians who faithfully protect our animals and property from bears, coyotes, hawks, and stray dogs, yet remain calm, confident, and trustworthy with people. We are asking $1,250. Local pickup in Crestview, FL is preferred. Our desire is to help introduce the Southeast to Colorado Mountain Dogs and educate people in our area about the breed. Feel free to contact me with any questions, and please visit our website http://www.VictoryFamilyFarm.com for more info! Posted Nov 24, 2025 - Colorado Crack O’ Noon — CNK Aslan x BUAF Andreth of CNK, 9 G5 pups, BORN Dec 15th! 7 males, 2 females (2 females and 4 males reserved) BAUF Andreth (G4) is one of the largest females I have had, at 31.5 inches at the shoulder, she is big even for a male. She is very tame, gentle, sings a happiness song when she sees me coming to the barn. She is in with goats and chickens, is a natural with poultry, no training needed for her. Andreth has single dews, and is DNA clear. She’s an amazing mom! Thank you to BAUF for this amazing amazing girl. CNK Aslan (G4) is magic… he is at least 32 at the shoulder, has a tiny single dew on one side and the other side is clean. Aslan went to a farm as a pup, but was returned to me last July at 3.5 years of age after being out in a field with sheep… and he is shy, but continues to open up. There is zero aggression to people in him. But he is an intense guardian, as this line always is. Aslan loads, enjoys the car, leashes, spends time with me on the couch in the house, and I can call him out of the barn to help me graze my goats. He is permanently home, I love him, and I keep mistakenly calling him Caspian… he is that much like his great grand dad. He is a natural with poultry like Caspian… no training needed with him. He exudes an essence that is hard to describe, and is wonderfully paired with Andreth. Pups are $2500, 9 born, 6 reserved This is a very special litter… we will be evaluating them very carefully, intending to keep pups, and the rest will go to the best homes for specifically who they are. We expect some to be bold, and some to be sensitive, but all to be loving and diligent guardians… and perhaps unusually easy to integrate with poultry. wendyjfrancisco@gmail.com www.crackonoonfarms.com, call or text 970-623-0598. Posted Nov 18, 2025. - OREGON Panther Ridge Guardian Colorado Mountain Dog Puppies Available! We are thrilled to announce the arrival of our G4 litter: PRG025LIT1G4! These adorable Colorado Mountain Dog puppies are ready to find their forever homes. This litter includes 5 females and 4 males. Parent Information: • Mother: STHH Suki of PRG - A loving and gentle guardian, Suki is devoted to her family and diligent in her protective roles. • Father: ABF Toby of PRG - As the latest member of our pack, Toby has quickly proven his worth with his strong genetics and protective instincts. Both parents are G3 and hail from strong genetic farms, ensuring that these puppies have excellent lineage. Puppy Details: • Raised in a large ranch environment • Introduced to goats and horses, acclimating them to farm life and livestock from an early age If you are interested and would like more information, feel free to: Email us at panther.ridge.guardians@gmail.com, or Call us at 360-771-0981 SOLD — Posted Nov 10, 2025 - Colorado. TRCH “Paige”, G4, HWH Josie x CNK Erebor, Aug 15, 2025. Absolutely adorable daughter of our stud CNK Erebor, G4 pup, both parents clean DNA. Up to date shots and vet check. Born on a sheep ranch, now at CNK with my goats. - 1850 970-623-0598, Mancos, CO. wendyjfrancisco@gmail.com. :-) Posted NOV 4, 2025 — COLORADO. Dirty Hoe Acres is happy to announce the birth of seven Colorado Mountain Dog pups born August 2nd. These G2 pups were born to G4 OUM Freja (Dam) and G1 Professor MadEye Moody (Sire). Available are two females, and one male. Freja is our alpha pack leader and the most hardworking dog we have ever met of any breed. She is never not on duty, and takes our flock's security as her utmost priority. We have never lost a single animal to predation on her watch. She is smart, tenacious, and driven. She understands boundaries and respects them, unless our flocks’ physical safety is at risk; she has jumped fences to rescue multiple hens from eagles and hawks. She is a pillar guardian for every child that visits our property. She and MadEye take their job of escorting small humans around very seriously, never straying more than a few feet from children while on the property. She responds well to most commands and has an almost maintenence free self cleaning coat and self filing nails. Freja has impressed us daily with her instincts, intelligence, drive and compassion. Her partner MadEye is a huge presence physically, but is our heart and soul guardian. He loves his puppies, and has been in charge of nanny duties since the pups were 3 weeks old. No one is allowed to pass him by without a lean and several pets. He has won over every human who has visited the farm without exception. MadEye is the balance for our highly driven alpha, providing backup and physical size in confrontation with bears, mountain lions, coyotes, foxes, and aerial predators every single day. He is nurturing and playful with his pups, and checks on the pups every single time before offering backup to our alpha. Freja provides security to our property, while MadEye’s priority is always the safety of his charges from pups to small chicks that have gotten loose. He will standby until they have been retrieved and secured. Now for the part you’ve been waiting for… Orion- our largest male, and largest pup of the litter. He is spunky and outgoing and has natural guarding instincts. He is the first to alert and sound when he hears something unfamiliar. An excellent mix of both parents' personalities and strengths. Orion would make a fantastic solo guardian or pack leader in time. Orion works well with others and absolutely adores parents and siblings. He will most likely be a very very big boy, which is excellent for guarding. Mack- such a sweet and loving pup. She has an almost even split of both parents' personalities, leaning slightly more towards dads easy going nature. Mack would do well as an outdoor sporting companion, house pet, or as a full time guardian. She would make an excellent addition to any farm, especially with established guardians. Mack is affectionate and attentive with people and enjoys the company of other dogs. She won’t be the biggest pup, but she will win your heart for sure. Greyheart- beautiful pup, who got most of her dams (our alpha and pack leader) personality. She is a natural guardian, instinctively patrolling boundaries, moving toward unfamiliar sights and sounds. She has a fantastic relationship with her siblings, and would make an excellent addition to any farm. She would definitely do best where she can grow into a leadership role. She’s got all the qualities her dam had at her young age. She is sharp, on point, and relentless in investigating and rounding in her environment. She really enjoys cuddles and is always watching for something to defend. She’s a beauty and will likely turn out to be a fierce guardian who doesn’t miss a beat. We are listing the 12 week old pups at $1000 individually, or $1800 for two. The best set in our opinion is Mack and Orion, or Mack and Greyheart if you are looking for a team. It’s the best match of alpha and beta instincts in our opinion. Please reach out to us with any questions. Dirty Hoe Acres — Morrison, CO 80465 Dirtyhoeacresllc@gmail.com 303-598-6628. 720-322-4327 POSTED NOV 2, 2025 - Colorado These are high G (G4 and G5)) near outcross pups from two fantastic litters - a purebred litter with 1 male and 2 females, all of whom are expected to grow into big, wonderful dogs with fantastic temperaments. The puppies are from Liberty BAUF24F0007G4 and Junior, our new stud, UUUBUAF24M0001G4. We also have a litter of G4 pups from Kiowa UUUBAUF210101G3 and Kaycee PNP024M0001G3. We’re proud of our Kiowa/Oso daughter BUAF Andreth, now at Crack O’Non Farms with a litter on the ground. DNA testing, all shots including Rabies and Microchipped. 1650. My breeding approach blends a strong lineage with a future-focused vision to ensure the legacy and excellence of the Colorado Mountain Dog. Please reach out with a text or call 303-961-3068. https://breedercloudpro.com/bumblingacres POSTED Oct 19, 2025 MICHIGAN Holy Trinity Monastery G5 puppies available starting December 9. We are very excited to announce the birth of 5 male & 5 female puppies out of FWF Bailey of HTM by NWF Maximo of HTM. The puppies were born on 10/14/25 and are growing well! The puppies are registered and will have received age appropriate vaccinations and dewormings. The puppies are being raised with our sheep & goats and will also be exposed to our poultry, barn cats, herding dogs, the monks of our brotherhood and some of our mamy visitors. Both sire & dam work on our farm and have lived up to our hopes of what a CMD would be. They are accpeting of our visitors while still excelling at guarding our mixed flock from aerial & four legged predators. As a bonus, they both have nearly maintenance free coats. They really have provided us with such peace of mind and joy. We bred our pair last year and we ended up keeping one of the resulting puppies. We are glad we had the opportunity to see how one of the offspring of this cross turns out firsthand. We really could not be more pleased! Both of his parents are excellent livestock guardians but each excel in different qualities. The puppy we kept really is the best parts of both of his parents. He has his mother's superior watchfulness and eagerness to guard against aerial predators and his father's amazing disposition that is friendly, calm and simply charming. Our many guests are always very delighted by our dogs! We have also received very good reports from the new homes of the other puppies from our previous litter. We are asking $1,000. Please feel free to contact us with any questions. Fr Nick Garber 810-941-8195 agarberimat@gmail.com"
}