{
  "url": "https://www.sokolovelaw.com/product-liability/monsanto-roundup/lawsuit-updates/",
  "title": "Latest Monsanto Roundup Lawsuit Updates | February 2026",
  "text": "Roundup Claim & Settlement Updates As of February 2026, about 170,000 Roundup claims have been filed. The majority of these claims allege that victims developed various types of non-Hodgkin’s lymphoma as a result of exposure to the herbicide. Roundup Lawsuit Updates at a Glance - Over 3,902 Roundup claims are currently pending in federal court. - Bayer has been ordered to pay more than $6 Billion in Roundup verdicts since October 2023. - There have been 24 Roundup trials in court so far, with over $8 Billion awarded to victims. - The company has settled around 100,000 claims for approximately $11 Billion. At Sokolove Law, we have over 45 years of experience holding powerful companies like Bayer and Monsanto accountable. Our firm has already helped hundreds of families seek justice from Roundup lawsuits. There are no upfront costs or hourly fees to work with our Roundup attorneys. Contact us now to see if we can pursue the compensation you deserve. Latest News: Roundup Lawsuit Updates 2025-2026 Families across the country have filed Roundup claims against Bayer and Monsanto, seeking justice for cancer caused by glyphosate weed killers. To date, billions of dollars have been paid out to victims and their loved ones. At Sokolove Law, we’re committed to providing you with the latest Roundup claim updates. Find out more about what's going on with current developments in the Roundup litigation. 1. Retracted Glyphosate Study Raises New Doubts About Roundup Safety Roundup Cancer Lawsuit Update | January 5, 2026 A landmark study used to defend the safety of glyphosate, the key ingredient in Roundup, was retracted by the journal that published it 25 years ago over ethical concerns. Regulatory Toxicology and Pharmacology cited undisclosed involvement by Monsanto, which is now owned by Bayer. The authors reportedly failed to disclose financial ties to Monsanto, relied heavily on the company's unpublished research rather than independent data, and didn’t list the names of Monsanto employees who helped write the paper. The paper had influenced decisions by the Environmental Protection Agency, which maintains glyphosate is safe despite lawsuits and scientific research to the contrary. \"Concerns were raised regarding the authorship of this paper, validity of the research findings in the context of misrepresentation of the contributions by the authors and the study sponsor, and potential conflicts of interest of the authors.\" – Regulatory Toxicology and Pharmacology 2. $28 Million Roundup Award Affirmed Monsanto Roundup Litigation Update | December 3, 2025 A California appeals court has upheld a $28 Million Roundup verdict awarded to Mike Dennis, who developed non-Hodgkin's lymphoma after using the weed killer for more than 20 years. The original 2023 judgment included $7 Million in economic damages and $325 Million in punitive damages, which was later reduced to $21 Million. Monsanto appealed, arguing that the failure-to-warn claims are barred by the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA). The court disagreed, noting that a pesticide is considered misbranded under FIFRA if it lacks “warnings adequate to protect health.” 3. Roundup Lawsuit in Georgia Added to MDL Georgia Roundup Lawsuit | November 13, 2025 Marietta, Georgia resident Steven Ragsdale has filed a Roundup lawsuit after developing Waldenström macroglobulinemia, a rare form of Non-Hodgkin's lymphoma, in 2012. Ragsdale claims that he began using Roundup in 1974 and continued applying and selling the herbicide through 2021, following \"all safety and precautionary warnings during the course of use.\" He is seeking to have his case transferred to the federal Roundup litigation, where thousands of similar claims involving glyphosate exposure and cancer are currently being coordinated. 4. $38 Million Bayer Securities Settlement Awaits Final Approval Roundup Litigation Update | October 16, 2025 A $38 Million Roundup settlement agreement between Bayer and the company's shareholders is currently under review by a judge. The settlement would resolve a securities class action lawsuit filed in 2020, which alleges that Bayer misled investors about the litigation risks associated with Monsanto's Roundup. Bayer acquired Monsanto in 2018 and has since been ordered to pay billions of dollars to individuals who developed non-Hodgkin's lymphoma after using the weed killer. 5. Thousands of Roundup Lawsuits Still Pending Monsanto Roundup Litigation Update | September 15, 2025 As more Roundup users are diagnosed with non-Hodgkin lymphoma, additional victims continue to take legal action and seek compensation for their injuries. At least 4,464 Roundup lawsuits remain active in the federal multidistrict litigation, with thousands more pending in state courts across the country. Bayer has estimated that roughly 61,000 Roundup claims remain unresolved. 6. Bayer Sets Aside $1.37 Billion for Roundup Litigation Bayer Roundup Lawsuit Update | August 29, 2025 In a recent press release, Bayer announced their plan to add $1.37 Billion to the company's Roundup litigation reserves, which may increase the funds available to those harmed by the glyphosate-based weedkiller. To date, nearly $11 Billion has already been paid to patients who developed non-Hodgkin’s lymphoma and other cancers after using Roundup. With thousands of lawsuits still pending, the company's decision suggests they may be preparing to resolve additional claims in the near future. In fact, \"settlements are part of the company’s multi-pronged strategy to significantly contain the US litigation by the end of 2026,\" according to Bayer. 7. Judge Recommends Roundup Trial in Washington Roundup Cancer Litigation Update | July 29, 2025 The judge overseeing the multidistrict litigation (MDL), which is similar to a Roundup class action lawsuit, has recommended that the case of Joselyn Ethel Kooi be sent back to her home state of Washington for trial. Most Roundup lawsuits settle before reaching this stage, but Kooi’s will likely move forward and go before a jury after Monsanto’s attempt to dismiss her expert witnesses from testifying was denied. 8. Missouri Court Affirms $611 Million Verdict Roundup Claims Update | June 12, 2025 The Missouri Court of Appeals for the Western District affirmed a $611 Million Roundup verdict for three plaintiffs who developed non-Hodgkin’s lymphoma after using the herbicide. In 2024, the original $1.5 Billion award in this case was reduced to $611 Million. Monsanto appealed, disputing the admissibility of expert testimony and raising other issues, but the court rejected their arguments and confirmed the verdict. 9. Court Upholds $177 Million Roundup Verdict Roundup Cancer Lawsuit Update | May 15, 2025 The Superior Court of Pennsylvania upheld a $177 Million verdict in the case of Monsanto v. Caranci, denying Monsanto’s request for a new trial. Monsanto challenged the verdict on multiple grounds, including claims of improper juror communications and excessive damages. However, the appellate court found no basis to overturn the decision. 10. Georgia Jury Awards $2 Billion to Cancer Patient Roundup Trial Update | April 14, 2025 A jury in Georgia ordered Bayer to pay more than $2 Billion to John Barnes, who was diagnosed with non-Hodgkin's lymphoma after using Roundup on weeds around his home for over 20 years. The verdict included $65 Million in compensatory damages to help Barnes with expenses linked to his illness and $2 Billion in punitive damages to punish Bayer for their negligence. Bayer plans to appeal the verdict. 11. Appeals Court Considers Roundup Expiration Label Lawsuit Monsanto Roundup Litigation Update | March 14, 2025 The 9th Circuit Court of Appeals is reviewing whether to revive a proposed Roundup class action lawsuit involving the lack of an expiration date on these products. This class action was previously dismissed by a lower court in 2023. Plaintiffs argue that glyphosate in Roundup can break down into the carcinogen N-nitrosogyphosate when exposed to nitrites in air and water. With no expiration date, consumers may unknowingly use degraded products that pose a risk to their health. 12. Multiple States Consider Bills to Protect Bayer Roundup Claims Update | February 10, 2025 Lawmakers in multiple states, including Missouri and Iowa, are considering bills that would shield Bayer from Roundup claims. This legislation would limit failure to warn claims, making it harder for those diagnosed with cancer to seek justice. Supporters argue these bills are necessary to protect the agricultural industry, while opponents believe they grant Bayer immunity and prevent victims from being able to hold the company accountable for their illnesses. 13. Monsanto Appeals $175 Million Roundup Verdict Roundup Cancer Lawsuit Update | January 13, 2025 Monsanto has asked the Pennsylvania Superior Court to overturn an October 2023 verdict that awarded more than $175 Million to Ernest Caranci, a home gardener who claimed he developed cancer from using Roundup. The company alleges that the jury’s decision was influenced by a court officer who pressured them into reaching a verdict. They also claim the judge wrongfully excluded evidence that was critical to their defense. 14. Monsanto Looks Toward Supreme Court Monsanto Roundup Litigation Update | December 1, 2024 Multiple Roundup claims have examined if federal law overrides state-based failure to warn claims in Roundup cancer lawsuits. This issue has created a split among federal appellate courts, prompting Monsanto to look toward the Supreme Court. The company is currently reviewing cases that could be suitable to submit to the U.S. Supreme Court for review. If granted, the Court would likely decide the matter during the 2025-2026 session. 15. Womack v. Monsanto Trial Concludes Roundup Cancer Lawsuit Update | November 15, 2024 In the latest Roundup trial, a Philadelphia jury sided with Monsanto, determining that the company was not liable for Judith Womack’s non-Hodgkin's lymphoma diagnosis. Judith, who used Roundup several times in a residential setting starting in 2015, was diagnosed with cancer in 2019. 16. Around 58,000 Roundup Claims Still Pending Roundup Claims Update | November 1, 2024 Despite previously settling thousands of lawsuits, Bayer is still facing approximately 58,000 active Roundup cancer claims. More than 4,300 of these claims have been consolidated into a Roundup class action lawsuit or multidistrict litigation, while the remainder are pending across various state courts. 17. Couple Awarded $78 Million in Roundup Cancer Verdict Roundup Trial Update | October 10, 2024 A Pennsylvania jury ordered Bayer to pay William Melissen and his wife Margaret $78 Million. William developed a form of non-Hodgkin's lymphoma after using Roundup at his home and work between 1992 and 2020. The verdict included $3 Million in compensatory damages and $75 Million in punitive damages meant to punish the company. 18. Sixth Philadelphia Roundup Trial Underway Monsanto Roundup Litigation Update | October 8, 2024 The latest Roundup trial, Melissen v. Monsanto, is currently in progress. This marks the sixth Roundup cancer lawsuit to go before a jury in Philadelphia. Monsanto previously attempted to dismiss this case before it went to trial, but a judge denied the company's motion for summary judgment and allowed the case to proceed. 19. Philadelphia Jury Rules in Favor of Monsanto Roundup Claim Update | September 11, 2024 In the case of Young v. Monsanto, a Philadelphia jury determined that Roundup is defective, but it was not the cause of Ryan Young’s non-Hodgkin’s lymphoma. Young used the glyphosate-based weed killer Roundup multiple times a year starting in 1998 before being diagnosed with cancer. Despite this loss, victims have already won 3 previous trials in Philadelphia, and another Roundup case is set to begin in the city by the end of September. Call (800) 995-1212 now to see if we can help you seek compensation from a Roundup claim. 20. Cancer Warning on Roundup Label Not Required Roundup Cancer Litigation Update | August 15, 2024 The 3rd Circuit Court of Appeals in Philadelphia ruled that Monsanto is not required to add cancer warnings to Roundup labels. The court agreed with Monsanto’s argument that federal law, which regulates pesticide labels, overrides state requirements. This ruling conflicts with other appeals courts throughout the country, where judges have found that states can require additional warning requirements beyond federal regulations. 21. Monsanto Verdict Overturned, Allowing for a New Trial Roundup Lawsuit Update 2024 | July 10, 2024 An Oregon appeals court overturned a previous trial win by Monsanto in favor of Larry Johnson, who developed non-Hodgkin's lymphoma after using Roundup for over 20 years. During his initial trial, Johnson was denied the chance to present key evidence from Dr. Charles Benbrook, a former executive director of the National Academy of Sciences Board on Agriculture. Dr. Benbrook has criticized the Environmental Protection Agency’s findings on the safety of glyphosate. The appellate judges found that excluding information about the research used by the EPA to support their stance on glyphosate was a mistake. This decision could allow Johnson to seek a new trial against Monsanto. 22. Bayer Asks Congress for Protection from Roundup Litigation Roundup Claims Update | June 20, 2024 For the past year, Bayer has lobbied Congress to include language in the Farm Bill — legislation that addresses agriculture and food programs — that would shield the company from lawsuits related to Roundup and cancer. The proposed addition would make it difficult for landscapers and agricultural workers to claim Bayer failed to properly warn them about the risks associated with glyphosate in Roundup. 23. Roundup Verdict Reduced to $611 Million Roundup Claim Recent Update | April 5, 2024 In November 2023, a Missouri jury awarded $1.56 Billion to three victims who claimed Roundup caused them to develop non-Hodgkin’s lymphoma. The wife of one victim was also awarded $100,000 for suffering caused by her husband’s diagnosis. Bayer later appealed this verdict, and a judge reduced the amount to $611 Million. The judge upheld the original $61.1 Million awarded in compensatory damages but slashed punitive damages, which are meant to punish the company for their wrongdoing, from $1.5 Billion to $549.9 Million. Find out if you may be eligible for a Roundup settlement or verdict. 24. Mistrial Declared in Roundup Wrongful Death Lawsuit Roundup Cancer Lawsuit Update | March 1, 2024 In Delaware, a Roundup wrongful death lawsuit resulted in a mistrial after the jury was unable to reach a unanimous decision. Members of the jury deliberated for three days before announcing they were deadlocked. The lawsuit was brought by the family of Anthony Cloud, a landscaper who passed away from non-Hodgkin’s lymphoma in 2021. His loved ones were seeking $142 Million from Monsanto for failing to warn about the risks associated with Roundup. Cloud’s family will have the opportunity to pursue another lawsuit against Bayer and Monsanto in the future if they choose to do so. 25. Over 4,200 Lawsuits Consolidated in Roundup MDL Monsanto Roundup Lawsuit Update | February 5, 2024 As of February 2024, more than 4,200 Roundup claims have been consolidated in the U.S. District Court for the Northern District of California. The number of claims in the Roundup class action lawsuit or multidistrict litigation (MDL) has continued to grow. 26. Latest Roundup Trial Awards $2.25 Billion to Cancer Patient Roundup Trial Update | January 29, 2024 Bayer has been ordered to pay $2.25 Billion to John McKivison, a Pennsylvania man who developed non-Hodgkin’s lymphoma after years of using Roundup for yard work. This is the largest Roundup verdict against Bayer to date. The jury awarded McKivison $250 Million in compensatory damages and $2 Billion in punitive damages. Bayer plans to appeal the verdict, finding it to be excessive. If you were diagnosed with a Roundup-related cancer after using the weed killer, Sokolove Law is here to help. We’ll handle every step of the legal process on your behalf, so you can focus on your health and loved ones. Update on Roundup Settlements & Trial Verdicts Between the previous global Roundup settlement and multiple trial verdicts, Bayer has paid out billions to families impacted by cancer linked to glyphosate. The latest update on Roundup settlements and verdicts include: - November 2025: A California appeals court upheld a $28 Million Roundup verdict for Mike Dennis, who developed non-Hodgkin’s lymphoma after decades of use. The 2023 judgment included $7 Million in actual losses and $325 Million in punitive damages, which was reduced to $21 Million afterwards. - June 2025: The Missouri Court of Appeals upheld a $611 Million Roundup verdict awarded to three plaintiffs with non-Hodgkin's lymphoma. - May 2025: Monsanto’s appeal of a $177 Million Roundup verdict awarded to Ernest Caranci has been denied by the Pennsylvania Superior Court. - April 2025: A Georgia jury awarded over $2 Billion to John Barnes, who was exposed to Roundup for decades at his home before being diagnosed with non-Hodgkin's lymphoma. - October 2024: In Pennsylvania, a jury awarded William and Margaret Melissen $78 Million. William was diagnosed with a form of non-Hodgkin's lymphoma after nearly 30 years of Roundup use. - January 2024: John McKivison, a gardener in Pennsylvania, was awarded $2.25 Billion after he was diagnosed with non-Hodgkin’s lymphoma. This amount was later reduced to $400 Million. - December 2023: In the fifth consecutive win for victims, Pennsylvania resident Kelly Martel was awarded $3.5 Million in her lawsuit against Monsanto. She used Roundup for approximately 15 years before getting sick. - November 2023: In Missouri, a jury awarded $1.56 Billion to three non-Hodgkin's lymphoma patients. Bayer appealed this verdict, and it was later lowered to $611 Million. - October 2023: Plaintiffs won three Roundup trials this month. A Pennsylvania jury awarded over $175 Million to home gardener Ernest Caranci, a Missouri jury granted $1.25 Million to non-Hodgkin’s lymphoma patient John Durnell, and 51-year-old Mike Dennis was awarded $332 Million in California. Dennis’ verdict was reduced to $28 Million on appeal. - June 2020: Bayer agreed to pay $10.9 Billion to settle around 100,000 Roundup cancer claims. - May 2019: Alva and Alberta Pilliod were awarded $2.05 Billion after both were diagnosed with cancer following years of Roundup use on their crops. After Bayer appealed, the verdict was lowered to $87 Million. - March 2019: In California, Monsanto was ordered to pay $80 Million to Edwin Hardeman, who used Roundup on his property for 20 years before being diagnosed with cancer. This award was later lowered to $25 Million. - August 2018: The first Roundup trial resulted in a $289 Million verdict for Dewayne Johnson, a former school groundskeeper with non-Hodgkin’s lymphoma. The verdict was reduced to $78 Million on appeal. Roundup settlements can help families pay for medical bills, pain and suffering, lost wages, and more. Call (800) 995-1212 now to find out if you may qualify for compensation from a Roundup claim. It costs nothing to speak with us. Past Roundup Weed Killer Lawsuit Updates The Roundup litigation has been ongoing for years. Find out more about the past Roundup weed killer lawsuit updates that have helped shape recent events. 1. Over $2 Billion Awarded to Roundup Victims in 3 Months Roundup Litigation Update | December 6, 2023 From October 2023 to December 2023, five Roundup trials were decided in favor of the victims, including: - Durnell v. Monsanto: $1.25 Million, Missouri - Caranci v. Monsanto: $175 Million, Pennsylvania - Dennis v. Monsanto: $332 Million, California - Anderson v. Monsanto: $1.56 Billion, Missouri - Martel v. Monsanto: $3.5 Million, Pennsylvania In total, juries awarded more than $2 Billion to victims and their loved ones over the course of three months. 2. Bayer Secures First Roundup Cancer Lawsuit Win Roundup Trial Update | October 5, 2021 Bayer has achieved their first Roundup cancer trial victory in the case of Clark v. Monsanto. Destiny Clark, who used Roundup at her home, claimed the weed killer caused her child to develop Burkitt’s lymphoma, a rare form of non-Hodgkin’s lymphoma. The jury found that Clark’s attorney didn’t adequately establish a connection between the child’s cancer diagnosis and his exposure to Roundup. 3. Bayer Agrees to Over $10 Billion Roundup Settlement Roundup Settlement Update | June 24, 2020 Bayer agreed to resolve around 100,000 lawsuits through a $10.9 Billion Roundup settlement. Of that amount, $2 Billion will be put aside for future claims by Roundup cancer victims. Some judges have criticized this amount as insufficient, suggesting it may not be enough to adequately pay victims for the harm they’ve suffered. Find out if you may qualify for Roundup compensation. It costs nothing to determine your eligibility. 4. Jury Awards $2 Billion Roundup Verdict to California Couple Monsanto Roundup Lawsuit Update | May 13, 2019 Alva and Alberta Pilliod were awarded over $2 Billion by a California jury after they were both diagnosed with non-Hodgkin’s lymphoma. The couple used Roundup on their residential properties for years before getting sick. The verdict included $55 Million in compensatory damages and $2 Billion in punitive damages. 5. First Roundup Cancer Trial Results in $289 Million Verdict Roundup Trial Update | August 10, 2018 A California jury awarded $289 Million to Dewayne “Lee” Johnson. He previously worked as a school groundskeeper, which required him to routinely use Roundup. Two years before his non-Hodgkin's lymphoma diagnosis, Johnson was in an accident that doused him in the weed killer. This groundbreaking verdict marks the first significant legal victory for plaintiffs in Roundup litigation, highlighting concerns about the safety of glyphosate. 6. Roundup Claims Consolidated into Multidistrict Litigation (MDL) Roundup Litigation Update | October 4, 2016 The U.S. Judicial Panel on Multidistrict Litigation consolidated multiple Roundup claims into a single multidistrict litigation (MDL) in the U.S. District Court for the Northern District of California. The MDL centralizes cases alleging that glyphosate, the active ingredient in Roundup, causes cancer. The consolidation aims to streamline the legal process and help with evidence collection. 7. Glyphosate Classified as “Probably Carcinogenic to Humans” Roundup Claims Update | March 20, 2015 The International Agency for Research on Cancer, which is part of the World Health Organization, classified glyphosate as \"probably carcinogenic to humans.\" This classification was based on evidence that glyphosate can cause cancer in laboratory animals and is linked to an increased risk of non-Hodgkin's lymphoma in humans. If you or a loved one was diagnosed with cancer after being exposed to Roundup, contact us now to see if we may be able to pursue compensation for your family. Get the Money You Deserve Our Roundup attorneys have already secured millions from glyphosate claims. Let us get you the money you deserve. Get the Latest Monsanto & Bayer Roundup Lawsuit Updates At Sokolove Law, we’re committed to providing families with the latest Monsanto and Bayer Roundup claim updates. As a national Roundup law firm, our glyphosate lawyers can fight for compensation and justice on behalf of cancer victims in all 50 states. We’ve helped thousands of clients stand up to negligent corporations like Bayer, securing more than $10.2 Billion for those injured through no fault of their own. There are no upfront costs or hourly fees to work with our Roundup attorneys. We only get paid if you do, so you can take legal action without any financial risk. Call (800) 995-1212 now or fill out our contact form to get started with a free, no-obligation case review. Monsanto Roundup Lawsuit Update FAQs What is the status of the Roundup lawsuit? As of February 2026, more than 100,000 Roundup claims have been settled for around $11 Billion, and juries have awarded over $8 Billion in trial verdicts. Over 3,902 Roundup claims are still pending against Bayer and Monsanto. Find out if you may qualify to file a Roundup claim during a free case review. How much can I expect from a Roundup claim? Roundup compensation can range from tens of thousands to millions of dollars, if not billions in some court cases. How much you may get from a Roundup claim will vary based on: - How long you were exposed to Roundup - Cost of your related medical bills - Severity of your illness At Sokolove Law, we’ll fight hard to get you everything you’re entitled to. Call (800) 995-1212 now. Let us get you the money you deserve. Has anyone received money from a Roundup claim? Yes. Bayer has paid nearly $11 Billion in Roundup settlements to resolve approximately 100,000 claims. Additionally, juries have ordered the company to pay over $8 Billion in trial verdicts to victims with cancer, though some verdict amounts have later been reduced on appeal. What proof do you need for a Roundup claim? To file a Roundup claim, your lawyer will need to prove that you were repeatedly exposed to glyphosate weed killers and later diagnosed with non-Hodgkin’s lymphoma or another qualifying cancer. Evidence linking your cancer to Roundup may include: - Employment records - Invoices from landscapers - Medical records - Roundup receipts - Testimony from experts Our Roundup lawyers can gather the evidence needed to build a strong case on your behalf. What cancers are covered under the Roundup claim? Exposure to glyphosate in Roundup has been linked to several types of cancer, including non-Hodgkin’s lymphoma and leukemia. Cancers that may be covered under the Roundup claim include: - B-cell lymphoma - Burkitt lymphoma - Chronic lymphocytic leukemia - Follicular lymphoma - Hairy cell leukemia - Lymphoblastic lymphoma - Mantle cell lymphoma - Marginal zone lymphoma - Non-Hodgkin’s lymphoma - Small lymphocytic lymphoma - T-cell leukemia - T-cell lymphoma Get a free case review now if you or a loved one has been diagnosed with any of these cancers after using the weed killer. You may be eligible for compensation from Roundup litigation. How long does it take to get a Roundup settlement check? It typically takes 1 to 2 months to receive a Roundup settlement check after your attorney has completed negotiations with Bayer. While the payout timeline may vary between each case, we’ll work hard to secure money for you as quickly as possible. Is it too late to file a Roundup cancer claim? No. You may still be able to file a Roundup claim if you or a loved one was diagnosed with cancer linked to glyphosate. However, you typically only have 1 to 3 years to file a Roundup claim after your diagnosis or the death of a loved one due to laws called statutes of limitations. Call (800) 995-1212 now to get started before it’s too late. It costs nothing to speak with us."
}