{
  "url": "https://www.polet.network/blog/polet-at-ist2024-four-phases-of-technology-growth-and-the-price-tag-for-just-transitions",
  "title": "POLET at IST2024: Four phases of technology growth and the price tag for just transitions — POLET",
  "text": "POLET at IST2024: Four phases of technology growth and the price tag for just transitions On June 16-19 2024, at the IST2024 conference, Jessica Jewell and Lola Nacke presented POLET recent research. Jessica demonstrated that technology growth is better understood and predicted if divided into four, not three phases, with the middle crucial phase reflecting a prolonged period of stable quasi-linear growth in the middle of the S-curve. Lola presented the findings of POLET recent analysis of the socio-political costs of just transitions away from coal. The annual IST Conference brings together researchers exploring changes in socio-technical systems necessary to address climate change and other sustainability issues. An overarching theme of this year’s conference was accelerating sustainability transitions. The expansion of low-carbon technologies such as wind and solar power and the decline of carbon-intensive energy such as coal - analysed by POLET team - are key elements of such transitions. In her talk, Jessica Jewell argued that growth of new technologies occurs in several phases, each driven by different mechanisms such as technological innovation, policy support, market dynamics and public acceptance. She has shown that for prolonged periods drivers and barriers to new technology balance each other resulting in stable growth. Using this insight, we can predict future technology by measuring its growth in countries where it has already stabilised. In the other presentation, Lola Nacke explored the flip-side of energy transition: phase-out of coal power. She presented the recent study where POLET researchers quantified costs paid by governments to communities, workers and companies negatively affected by premature retirement of coal power plants. The current compensation costs amount to over $200 bln, half of them paid internationally, but up to $1.3 trl would be needed if China and India phase out coal in line with 1.5°C climate mitigation pathways. Below are the full titles of the two talks delivered: Jessica Jewell, Vadim Vinichenko, Aleh Cherp. “Four phases of technology growth - Implications for anticipating and guiding clean energy transitions” Lola Nacke, Jessica Jewell, Aleh Cherp, Vadim Vinichenko, Avi Jakhmola. “Policy approaches for redistributing costs and benefits of sustainability transitions - The case of compensation for coal phase-out”"
}