{
  "url": "https://en.wiktionary.org/wiki/frou-frou",
  "title": "frou-frou - Wiktionary, the free dictionary",
  "text": "frou-frou Appearance English [edit]Alternative forms [edit]Etymology [edit]Borrowed from French frou-frou, an onomatopoeia. Pronunciation [edit]Noun [edit]frou-frou (plural frou-frous) - (onomatopoeia) A rustling sound, particularly the rustling of a large silk dress. - 1870 June 4, Athenaeum, page 734: - The modern frou-frou of satin and gros-de-Naples skirts is nothing to the rustling of brocaded silks. - 1876, William Besant et al., The Golden Butterfly, act I, scene vi, line 108: - […] the frou-frou of life was lost to her […] - 1901, Jack London, “The Great Interrogation”, in The God of His Fathers[1], New York: McClure, Phillips & Co., page 34: - She was pretty, charming, and, moreover, a widow. And because of this she at once had at heel any number of Eldorado Kings, officials, and adventuring younger sons, whose ears were yearning for the frou-frou of a woman’s skirts. - 1904 December, A[rthur] Conan Doyle, “The Adventure of the Second Stain”, in The Return of Sherlock Holmes, New York, N.Y.: McClure, Phillips & Co., published February 1905, →OCLC: - “Now, Watson, the fair sex is your department,” said Holmes, with a smile, when the dwindling frou-frou of skirts had ended in the slam of the front door. - 1905 January 12, Baroness Orczy [i.e., Emma Orczy], The Scarlet Pimpernel, popular edition, London: Greening & Co., published 20 March 1912, →OCLC, page 94: - Lord Grenville took a hasty farewell of the ladies and slipped back into his box, where M. Chauvelin had sat all through this entr’acte, with his eternal snuff-box in his hand, and with his keen pale eyes intently fixed upon a box opposite to him, where, with much frou-frou of silken skirts, much laughter and general stir of curiosity amongst the audience, […] - 2014 September 6, Tony Roberts, “Poem to a Friend Feeling Out of His Element”, in The Guardian[2], →ISSN: - Impervious to the cheap perfumes and the frou-frou of young ladies' skirts, he finally and with deepest dread plunged ahead, banging in his ignorance on the keys as if they were a snare drum. Adjective [edit]frou-frou (comparative more frou-frou, superlative most frou-frou) - Liable to create the sound of rustling cloth, similar to 19th-century dresses. - Highly ornamented, overly elaborate; excessively girly. - They ate in a frou-frou restaurant at the top of a skyscraper. - 2009 September 1, Michael Chapman; Matthew Chapman, “Strong Bad Email #204: dictionary”, in Homestar Runner[3], spoken by Strong Bad (Matthew Chapman): - Kinda like a frou-frou dessert at a chichi restaurant, restaurant. - 2023 January 21, Andrew Lawrence, “Netflix’s Reed Hastings changed the way we watch TV – for better or for worse”, in The Guardian[5], →ISSN: - For the price of a frou-frou Starbucks drink, a Netflix subscriber could binge this content ad nauseam without suffering through a single commercial – the ideal home viewing experience. - (derogatory) Unimportant, silly, useless. - 2008 July 15, Matthew Yglesias, “Obama's Elitism Problem, Continued”, in The Atlantic[6]: - Barack Obama, out of touch with the working man as usual, has an aggressive program for carbon emissions reductions and has spoken of the need for such frou-frou measures as increased investment in transit infrastructure, intercity rail, and even bicycling. - 2024 September 28, Harry Blank, “Not Ready for Prime Time”, in Deadlined, →ISBN, pages 580–581: - Dr. Okorie: Those paintings on the walls have a definite effect on people. A very specific definite effect, with wildly variable results. Would you call them de-inhibitors, Lillian? Dr. Lillihammer: I'd call them cognition divergence vectors. I've already got the paper half-written in my mind. Dr. Blank: Explain it to us froufrou hard and social scientists. Dr. Wettle: I'm not froufrou, you're froufrou. Verb [edit]frou-frou (third-person singular simple present frou-frous, present participle frou-frouing, simple past and past participle frou-froued) - (uncommon, intransitive) To move with the sound of rustling dresses. - 1894 October, The Vassar Miscellany, volume 26, page 81: - “Oh, you funny girl! You look so surprised. Confess, now, there's nothing you can hide from me,” and ruffling my hair as she passed she frou-froued out of the room. - 1905 May 18, Truth, page 1289: - […] frou-frouing femininities […] Usage notes [edit]Almost exclusively seen in the form frou-frouing. References [edit]- “frou-frou, n.”, in OED Online , Oxford: Oxford University Press, 2021. - “frou-frou, v.”, in OED Online , Oxford: Oxford University Press, 2021. French [edit]Etymology [edit]Pronunciation [edit]Noun [edit]frou-frou m (plural frous-frous) - a frou-frou; a rustling sound, as of silk fabric Derived terms [edit]Descendants [edit]Further reading [edit]- “frou-frou”, in Trésor de la langue française informatisé [Digitized Treasury of the French Language], 2012 Categories: - English terms borrowed from French - English terms derived from French - English 2-syllable words - English terms with IPA pronunciation - English terms with audio pronunciation - English lemmas - English nouns - English countable nouns - English multiword terms - English onomatopoeias - English terms with quotations - English adjectives - English terms with usage examples - English derogatory terms - English verbs - English terms with uncommon senses - English intransitive verbs - en:Sexism - French onomatopoeias - French 2-syllable words - French terms with IPA pronunciation - French lemmas - French nouns - French countable nouns - French multiword terms - French masculine nouns - fr:Sound"
}