{
  "url": "https://www.nature.com/articles/s41392-025-02473-8",
  "title": "Targeting KRAS mutations: orchestrating cancer evolution and therapeutic challenges | Signal Transduction and Targeted Therapy",
  "text": "Abstract Activating KRAS mutations are highly relevant to various cancers, and KRAS is the most frequently altered oncogenic protein in solid tumors. While historically considered undruggable, two KRASG12C inactive state-selective inhibitors are currently approved for treating patients with non-small cell lung cancer. However, these agents only demonstrate a 30–40% response rate and a median progression-free survival of approximately 6 months, with the inevitable emergence of resistance mechanisms, hence remaining far from achieving a cure. Additionally, several cancers with poor prognostic outcomes, such as pancreatic adenocarcinoma, are driven by other non-G12C KRAS mutations and thus have no effective targeted therapies. Improvements in understanding RAS signaling, RNA, and nucleic acid chemistry, as well as the role of the tumor microenvironment, have sparked a paradigm shift in the approach to KRAS inhibition and suggested the potential for several novel combination therapies. In this review, we provide an overview of the RAS pathway and discuss the ongoing development and status of therapeutic strategies for targeting the oncogenic RAS. We further delve into the challenges of resistance mechanisms to better understand the rationale behind these developing strategies, describe their mechanisms of action, and offer insights into the current clinical trial status of each of these approaches. Similar content being viewed by others Introduction Kirsten rat sarcoma viral oncogene homolog (KRAS) is an isoform of the Ras superfamily of proteins, which also includes Harvey rat sarcoma virus oncogene (HRAS) and neuroblastoma RAS virus oncogene homolog (NRAS). KRAS proteins are known for their intrinsic GTPase activity and are “the most mutated protein in cancer”.1 KRAS mutation is foundational to in vivo oncogenic transformation2,3 and is widely associated with pancreatic ductal adenocarcinoma (PDAC), colorectal cancer (CRC), non-small cell lung cancer (NSCLC), cholangiocarcinoma, and uterine endometrial carcinoma.1,2,3 Approximately 30% of all human cancers harbor RAS mutations, with KRAS mutations being prevalent. RAS genes have tissue-specific profiles, which explains the predilection of KRAS for PDAC, CRC, and NSCLC. NRAS mutations are observed specifically in cutaneous melanoma, whereas HRAS mutations are detected in head and neck squamous cell carcinoma.3 All RAS isoforms are membrane-bound, small monomeric G proteins, with a highly conserved catalytic region responsible for nucleotide exchange.4,5 KRAS proteins operate as GDP-GTP-regulated on-off switches,3 which are regulated by guanine nucleotide exchange factors (GEFs), such as SOS, and GTPase-activating proteins (GAPs), such as neurofibromin 1 (NF1). When cells are activated by relevant stimuli, GEFs promote a KRAS-GTP (on) configuration, culminating in the activation of downstream RAS effector pathways, including RAF-MEK-ERK, PI3K-AKT-mTOR, and RALGD pathways.6 Oncogenic transformation of the KRAS gene allows increased signaling via the MAPK and PI3K/AKT pathways, culminating in increased cellular survival and proliferation. It also leads to the dysregulation of pathways that are responsible for cellular functions such as apoptosis, membrane vesicle trafficking, growth arrest and differentiation, cytoskeletal organization, calcium transport, and cell-cell junction signaling.7 Figure 1 summarizes the KRAS signaling pathway and its downstream effectors. Despite its critical role in tumorigenesis, KRAS has long been considered an undruggable target for focused pharmacological therapy because of its inviolable structure. However, the identification of a new allosteric target in the switch pocket II region of the KRAS G12C mutation that can covalently bind with specific inhibitors and subsequently induce apoptosis paves the way for therapeutic developments of the first KRAS inhibitors.8,9 The FDA has since approved AMG510 (sotorasib) and MTRX849 (adagrasib) for the treatment of lung adenocarcinoma.10 These developments have led to increased vigor in the development of inhibitors specifically targeting KRAS. In this review, we provide a brief overview of KRAS mutations in cancers and tumorigenesis, specifically focusing on currently approved therapies for targeting KRAS, ongoing advances, resistance mechanisms, and novel combinational approaches. KRAS mutations in cancer: summary of research history and milestones KRAS is among the most frequently mutated oncogenes in human cancers, particularly in lung, colorectal, and pancreatic cancers.11 Most mutations are gain-of-function and single-base missense changes, with 98% occurring at codons 12 (G12), 13 (G13), and 61 (Q61).2 Codon G12 mutations are the most common, producing 3 distinct mutant subtypes: G12D (29.19%), G12V (22.17%), and G12C (13.43%).6 According to the Cancer Genome Atlas (TCGA) data, KRAS mutations appear in approximately 11.2% of all cancers, with higher rates (up to 45%) reported in other studies depending on cancer type. They are most prevalent in patients with PDAC (82.1%), with G12D accounting for 37.0% of those patients. CRC follows (~40%), with the G12D (12.5%) and G12V (8.5%) mutant variants being the most prevalent. In NSCLC, 21.20% of patients harbor KRAS mutations, primarily G12C (13.6%). Lower frequencies are observed in cholangiocarcinoma (12.7%), uterine endometrial carcinoma (14.1%), testicular germ cell tumor (11.7%), and cervical squamous cell carcinoma (4.3%). Figure 2 summarizes the prevalence of KRAS mutations across solid malignancies. Owing to their strong oncogenic role, especially in lethal cancers such as PDAC, NSCLC, and CRC, KRAS mutations have been intensively studied over the past 40 years. This section reviews key research milestones, leading to the most recent approvals of KRAS inhibitors and their clinical indications. Figure 3 provides a timeline summary of these research endeavors. KRAS structural and functional characterization: a historical perspective Our understanding of the role of KRAS in tumorigenesis began in 1982 when point mutations in human RAS orthologs were identified as oncogenic drivers in human cancer cell lines.12,13,14,15,16,17,18,19,20 Cooper et al. first reported a transforming human DNA fragment, homologous to viral KRAS, in LX-1, a lung cancer cell line.12 Similar findings were independently reported in additional human lung, colon, gallbladder, pancreas, and rhabdomyosarcoma cell lines.21 Sequencing of vial KRAS and cloning of the transforming fragments led to the identification of an activating point mutation in codon 12 in both lung (Calu-1) and colorectal (SW480) cancer cell lines.22 These mutations introduce amino acid substitutions, confirming that KRAS is a proto-oncogene.18,19,20 Research has subsequently focused on the functional structure and biochemical activity of KRAS to enable drug targeting. However, extensive structural and biochemical studies have established that KRAS is a challenging drug target (reviewed in ref. 23). In the late 1980s, studies showed that epidermal growth factor (EGF) binding to its respective receptor (EGFR) stimulated guanine nucleotide binding to RAS but that oncogenic RAS activation was EGFR independent.24,25 Subsequent work further characterized the involvement of RAS proteins in the activation of phospho-inositol phosphate (PIP) signaling pathways.26,27 The discovery of GEFs, initially in yeast models, was key to understanding RAS signaling biology and activity.28,29,30 The subsequent isolation of SOS in Drosophila and mammalian models established the regulatory role of GEFs as cellular activators of RAS GTPases via the modulation of nucleotide binding to RAS proteins.31,32 Another important discovery that shaped our understanding of RAS regulation was described in 1987 by Trahe and McCormick: using mouse and human cell lines, a protein capable of inactive RAS GTPase activity was identified and shown to act through inducing a factorial increase in the intrinsic GTP hydrolytic activity of cellular RAS proteins.33,34 This protein was named GTPase-activating protein (GAP). Interestingly, oncogenic mutations in RAS render the RAS protein insensitive to GAP. Since this initial discovery, 14 other mammalian RAS GAPs have been discovered, including NF1, GAP1, and SynGAP.35,36 The molecular dissection and elucidation of RAS signaling further characterized GRB2, an adapter protein that acts as an intermediate link between surface receptors and RAS activation, through the intracellular binding of phosphorylated tyrosine residues on transmembrane receptors on the one hand and RAS/SOS on the other hand, hence triggering GEP exchange activity on RAS proteins at the plasma membrane.37,38,39,40 These discoveries led to the first description of the complete RAS pathway in 1994, starting with EF-dependent receptor activation, dimerization, and autophosphorylation; the recruitment of GRB2 and its associated SOS GEP proteins to the plasma membrane; the subsequent activation of RAS; and downstream intracellular signaling activation to the nucleus.41 The first downstream effector of RAS, RAF-1, was first described in 1993 and was shown to bind RAS only in its active GTP-bound state, leading to subsequent activation of the MAPK cascade.42,43 Other effectors, such as PI3K, PKCζ, and RALGDS, were subsequently described (reviewed in ref. 44), along with their downstream signaling, ultimately resulting in the regulation of protein synthesis, glucose transport, and proliferation.45,46,47,48,49 While the function of KRAS was understood, its structural characterization did not fully mature until 1998, when it was characterized through crystallographic studies.50 In early mutagenesis studies, functional domains were classified as “essential” if mutations within that region reduced the biological activity of RAS proteins and “dispensable” if not.51 Through such mutagenic approaches, specific regions responsible for RAS-GAP interactions and for binding guanine nucleotides have been identified.50,52 The first crystal structure published in 1988 included four α-helixes and six β-sheets connected by nine loops and confirmed the spatial locations of the functional domains previously identified by mutagenesis. Later studies precisely defined the amino acids responsible for GTP binding, as well as the relevance of the switch-I and switch-II pockets in RAS-GEF interactions.50,53,54,55,56,57,58,59 KRAS as a therapeutic target: clinical research endeavors toward the approval of clinical indications Early efforts to inhibit KRAS focused on blocking its membrane localization, which is essential for its activation.60,61 Farnesyltransferase inhibitors (FTIs) aim to prevent the lipid modification of the CAAX motif necessary for this localization.62 However, despite promising preclinical results, FTIs have shown limited clinical efficacy in KRAS-mutant cancers.63,64,65,66 Other strategies, including disrupting KRAS palmitoylation via calcium channel blockers; targeting proteins required for membrane localization, such as refs. 67,68,69; and targeting proteins required for KRAS membrane localization, such as PDEδ, have also failed in clinical trials (NCT00005989 and NCT00005648)70,71 (reviewed in ref. 72). Owing to these limitations, attention has shifted to indirect targeting of KRAS through the inhibition of its downstream effectors, particularly the RAF-MEK-ERK-MAPK and PI3K/AKT/mTOR pathways. While effective in preclinical models, their clinical outcomes are often disappointing due to a combination of factors, including toxicity, compensatory mechanisms, and paradoxical signaling activation.73,74 For example, MAPK pathway inhibitors in KRAS-driven cancers have shown limited efficacy, along with significant toxicity and unexpected dynamic feedback mechanisms.75,76 Similarly, inhibition of the PI3K pathway via PI3K inhibitors (BKM120, GDC0941, XL147) in KRAS-mutated NSCLC resulted in modest efficacy, with preliminary data suggesting insensitivity to PI3K inhibition as a monotherapy, likely due to the activation of multiple alternative KRAS-activated pathways and their crosstalk.77,78 Because of the limitations of targeting downstream effectors, further research efforts have shifted toward direct targeting of KRAS itself. The discovery of a cryptic pocket (switch-II pocket) in KRAS G12C by Shokat and colleagues in 2013 was a major milestone in direct KRAS targeting, which was previously considered undruggable.9 Preclinical work has characterized the difference between G12C, on the one hand, and G12D and G12V KRAS mutations, on the other hand, in terms of their ability to maintain alternative interactions with their downstream effectors, although active cycling between the GDP-bound and GTP-bound states. This difference allowed early attempts to target and lock KRAS G12C in its inactive conformation, with the goal of overcoming the challenges of drug permeability and specificity.79,80 The subsequent identification of the thiol group in the cysteine residue that forms a disulfide bridge allowed the development of specific inhibitors with prolonged target engagement, remarkable selectivity, and greater activity, given the location of the cysteine 12 residue near the switch regions involved in the interaction with effectors and the nucleotide.9 The crystal structure of the initial inhibitor compound combined with the KRAS G12C-GDP complex revealed that the compound extended from the cysteine residue into an adjacent pocket, termed the switch-II pocket (S-IIP), rather than binding to the nucleotide pocket previously targeted by earlier compounds.9 This new targeting strategy had not been described before, and Shokat and colleagues pursued further structural modifications, including the introduction of acrylamides, vinyl sulfonamides, and carbon-based electrophiles, rather than continuing with disulfide-based compounds, thus increasing selectivity and, for the first time, irreversible inhibitory effects. The most potent acrylamide compound was tested in cells harboring the KRAS G12C mutation, which resulted in reduced viability and increased apoptosis.9 The discovery of this new allosteric pocket in KRAS G12C and relatively specific inhibitors provided the first structure-based validation that KRAS is targetable.81 On the basis of prior compounds described by Shokat and colleagues, renewed interest and efforts have emerged to develop novel compounds with potential for clinical success: ARS-853, for example, was developed by optimizing electrophilic localization and modifying the scaffold that interacts with a hydrophobic portion of S-IIP.82,83 The compound was shown to inhibit the KRAS G12C protein by locking it in an inactive state.84,85 ARS-1620 was the first proof-of-concept molecule tested in vivo and differed from ARS-853 in that it has an additional covalent interaction with the His95 residue of KRAS G12C, providing a more stable and preferred conformation.86 This new structure provides the basis for exploring AMG510 (sotorasib) in the clinical arena. AMG510 is the first small-molecule inhibitor that specifically targets KRAS G12C to enter clinical trials (NCT03600883). The molecule specifically and irreversibly binds to the cysteine 12 residue in the inducible S-IIP pocket and locks KRAS G12C in its inactive state.86,87 Compared with ARS-1620, AMG510 has an additional novel surface groove via an alternative orientation of His95 on KRAS, thus resulting in a 10-fold improvement in efficacy.88,89 AMG510 received its first approval in 2021 as the first treatment for adult patients with KRAS G12C-mutated NSCLC who had received at least one prior line of systemic therapy.90 This milestone approval of the first inhibitor to directly target mutated KRAS was the culmination of several years of clinical evaluation: in the phase I trial of AMG510 monotherapy (NCT03600883), 129 patients received the drug and had responses across all dose levels, with no dose-limiting toxicity or treatment-related deaths.91 In terms of response, patients with NSCLC (n = 59) had an objective response rate (ORR) of 32.2%, a disease control rate (DCR) of 88.1%, and a median progression-free survival (PFS) of 6.3 months. The efficacy data and the recommended phase II dose (960 mg daily) supported the phase II trial of AMG510 (NCT03600883), which evaluated 126 patients with KRAS G12C-mutated NSCLC. In this trial, an ORR of 37.1%, including 3 complete responses and 43 partial responses, was reported, along with a DCR of 80.6% and a median PFS of 6.8 months, which is in line with the phase 1 results. The details of these trials, as well as other trials using AMG510, will be discussed later in the “Therapeutic strategies to target KRAS” section of this review. MRTX849 (adagrasib) is another KRAS inhibitor that successfully targets the KRAS G12C protein.92 This drug, with a slightly different chemical structure, also irreversibly and selectively binds and locks KRAS G12C in its inactive GDP-bound state, with a longer half-life than AMG510.93 MRTX849 is the second (and last) KRAS G12C direct inhibitor to be approved and is indicated as a 2nd-line treatment for metastatic NSCLC with the KRAS G12C mutation.94 This approval was based on the Krystal-1 (NCT03785249) trial, which we discuss in detail later in this review. Currently, AMG510 (sotorasib) and MTRX849 (adagrasib) are the only two approved KRAS G12C inhibitors. The next sections explore the central role of KRAS signaling, its regulatory mechanisms, the challenges of resistance, and, finally, therapeutic strategies. KRAS signaling pathways and molecular crosstalk KRAS signaling is central to several pathways regulating cell growth, survival, and differentiation. Upon activation by upstream RTKs, KRAS triggers and regulates several downstream signaling pathways, which we review below.73,84 In the RAF-MEK-ERK pathway, activated KRAS directly activates the mitogen-activated protein kinase (MAPK) pathway by first recruiting and activating RAF kinases (RAF-1, BRAF, ARAF).95 Activated RAF, in turn, phosphorylates and activates MEK1/2, leading to downstream phosphorylation and activation of ERK1/2. ERK translocates to the nucleus and promotes transcriptional activation, resulting in increased proliferation, differentiation, and survival.96 On the one hand, ERK is also involved in molecular crosstalk through the inhibition of components of the PI3K pathway, and on the other hand, via negative feedback loops that suppress upstream RAF and RTKs.97 In the PI3K-AKT-mTOR pathway, activated KRAS interacts with phosphoinositide 3-kinase (PI3K), leading to the phosphorylation of phosphatidylinositol 4,5-bisphosphate (PIP2) into its active PIP3 form. PIP3 recruits and activates AKT, which phosphorylates (and inhibits) proapoptotic proteins (BAD, FOXO) while activating mTOR, a key regulator of protein synthesis and cell growth.98 The net effect is the upregulation of cell survival and metabolism. As described earlier, PI3K-AKT signaling can be modulated by the MAPK pathway through ERK-mediated inhibition of the PI3K pathway, and vice versa.98,99 In the Ral-GEF pathway, KRAS also activates Ral GEFs, leading to the activation of RalA and RalB.100 Ral proteins regulate cytoskeletal dynamics, resulting in increased vesicle trafficking and cell migration, which are necessary for metastasis.101 The Ral pathway modulates endocytosis and exocytosis processes that are also influenced by other KRAS-driven pathways (such as the PI3K‒AKT pathway).102 The RAC1-PAK pathway: RAS indirectly activates RAC1, a GTPase involved in cytoskeletal remodeling.101 Activated RAC1 results in the activation of PAK kinases involved in cell motility and survival.103 The RAC1/PAK signaling pathway, in turn, modulates both the MAPK and PI3K pathways, hence impacting cellular proliferation and metastasis.104,105 The YAP/TAZ Hippo pathway: Ras activation indirectly activates the YAP/TAZ Hippo pathway. It does so by inhibiting LATS kinases, thus leading to increased YAP/TAZ activity.106 LATS kinases are key components of the Hippo pathway and normally phosphorylate and inhibit YAP/TAZ. By inhibiting LATS kinases, RAS relieves YAP/TAZ from inhibition, leading to its nuclear translocation, resulting in the upregulation of genes involved in stemness, invasion, and drug resistance.106,107 RAS also interacts with Rho and RASSF, resulting in another indirect mechanism of YAP/TAZ activation. YAP/TAZ is also involved in molecular crosstalk and enhances MAP and PI3K signaling, hence reinforcing oncogenic effects.108 Given the central role of KRAS in regulating key regulatory cellular pathways, KRAS mutations that cause constitutive activation of KRAS result in uncontrolled downstream signaling. Continuous activation of the MAPK pathway and the resulting ERK activation promote unchecked proliferation and survival, often rendering tumors resistant to MAPK inhibitors due to feedback reactivation. Similarly, hyperactivation of the PI3K-AKT pathway contributes to metabolic reprogramming, increased survival, and therapeutic resistance, highlighting the potential value of dual targeting of MAPK and PI3K in KRAS-mutated cancer. Uncontrolled upregulation of the Ral-GEF and RAC1 pathways leads to enhanced invasion, cell motility, and metastasis. Finally, increased YAP/TAZ activation has been shown to enhance stem-like properties and therapy resistance in KRAS-driven tumors. Taken together, these observations highlight not only the central role of KRAS but also the plethora of potential therapeutic interventions that have been developed. Understanding the regulatory mechanisms of KRAS is key to developing such therapeutic strategies. In the next section, we review these regulatory mechanisms and their variation across tumor types before discussing currently approved and ongoing investigations of KRAS-targeted therapeutic strategies. KRAS regulatory mechanisms and impact of mutations on tumorigenesis As a master regulator of multiple cancer-promoting pathways, KRAS itself is under tight regulatory control at different levels of the signaling pathway. In addition, as discussed earlier, KRAS controls major signaling pathways involved in tumorigenesis, highlighting the need to understand the clinical impact of mutated KRAS on cancer development and progression, as well as potential differences in prevalence and KRAS-related molecular heterogeneity across tumor types. KRAS regulatory mechanisms The regulation of KRAS occurs mainly through molecular switch controls that alter the cycling between its activated and inactivated conformations. Three main mechanisms/pathways upstream of KRAS are involved in KRAS regulation: (i) the GRB2-SOS1 complex, (ii) RAS-GRF1, and (iii) Src homology phosphatase 2 (SHP2).109,110,111,112,113,114,115,116,117,118,119 The GRB2-SOS1 complex is an intermediary that relays signals between RTKs and KRAS: upon activation of EGFR, growth factor receptor-bound protein 2 (GRB2) acts as an adapter molecule that binds phosphorylated EGFR via its SH2 domain and SOS1 through its SH3 domain.37,38,39,109 SOS1 itself is a GEF that is activated once bound to GRB2 and promotes the binding of GTP and KRAS, hence converting KRAS from an inactive state to an active state. More recently, novel mechanisms of KRAS activation independent of membrane activation have been described, whereby fusion proteins that contain portions of RTK can combine with GRB2-SOS to form a cytoplasmic protein granule that directly activates KRAS.50,110 RAS protein-specific guanine nucleotide releasing factor 1 (RAS-GRF1) is another key upstream regulator of KRAS that is expressed primarily in the brain.111 As a GEF, it connects molecular signals from glutamate receptors in mature neurons to KRAS, thereby promoting its activation and downstream MAPK/ERK cascade signaling.111 RAS-GRF1-mediated activation of KRAS is dependent on the calcium concentration, revealing mutual communication between KRAS and calcium signaling, as well as metabolism.112,113 RAS-GRF1 can also be activated by protein kinase A, itself under the regulation of the chemokine receptor-mediated production of cyclic AMP.114 Finally, SHP2 is a key molecule in KRAS activation.115,116,120 SHP2 is a protein tyrosine phosphatase (PTP) that uniquely acts as a common signaling hub between multiple signaling pathways and the KRAS-ERK pathway117: SHP2 acts as a scaffolding protein for GRB2, facilitating its recruitment, while also exerting the catalytic activity needed to promote the activation of KRAS through dephosphorylation of the SHP2 substrate.118,119 Some dephosphorylated substrates of SHP2 promote KRAS activation. SHP2 also indirectly activates KRAS by dephosphorylating p120-RASGAP, thus relieving its negative effect on KRAS.121,122 We have previously described downstream effector pathways that are directly controlled by KRAS activation, including the RAF-MEK-ERK, the PI3K-AKT-mTOR, and other signaling pathways. While they act mainly as effector pathways, they also exert feedback regulation on KRAS. KRAS mutations across tumors: differences in prevalence, biochemical heterogeneity, and impact of comutations Despite the well-described structure, signaling, and regulation of KRAS in cancer, KRAS mutations are neither equally prevalent in different tumor types nor exert similar biochemical effects. As described earlier, KRAS is one of the most frequently mutated oncogenes in human cancers, particularly in lung, colorectal, and pancreatic cancers.11 KRAS mutations are most prevalent in patients with PDAC, followed by patients with CRC or NSCLC. KRAS mutations are also observed in cholangiocarcinoma, uterine endometrial carcinoma, testicular germ cell tumors, and cervical squamous cell carcinoma.74 The three mutation subtypes (G12C, G12D, and G12V) are also differentially prevalent across tumor types (Fig. 2). Pancreatic adenocarcinoma (PDAC): KRAS mutations are highly prevalent in PDAC, with some studies reporting that up to 90% of cases harbor mutations, with the G12D subtype being the most commonly reported.123 PDAC is characterized by high mortality rates and is the third leading cause of cancer-related deaths in the United States.11 KRAS oncogene activation is also foundational to oncogenic transformation, which is observed in low-grade noninvasive pancreatic intraepithelial neoplasms and acinar-to-ductal metaplasia.124,125 KRAS mutations are thus considered to be an initiating event for this aggressive cancer type.123 Sequencing of PDAC exomes revealed a preponderance of KRAS oncogene activation along with inactivation of tumor suppressor genes (CDKN2A, TP53, SMAD4, and BRCA2), extensive chromosomal loss, gene amplification, and telomere shortening.124,126 While mostly characterized in NSCLC, understanding the impact of co-occurring mutations and alterations, along with KRAS, is important not only for potential prognostication but also for developing potential therapeutic interventions. For example, patients with resected PDAC (n = 587) with the KRAS G12D isoform and TP53 comutation have a better prognosis, as reflected by improved OS and PFS, than those with the co-occurrence of TP53 with other KRAS isoforms (G12V/R or others) (median OS 25.9 vs. 16.9 months; p = 0.038).127 CRC is the second most common cancer with KRAS mutations.128 CRC is also the second leading cause of cancer-related deaths in the United States.11,129 Similar to PDAC, KRAS activation is an essential step in the CRC adenoma-to-carcinoma sequence: following the initial mutagenic loss of the adenomatous polyposis coli (APC) gene, which results in the loss of intestinal differentiation, activating mutations in KRAS and subsequent nuclear translocation of β-catenin are responsible for progression to carcinoma by increasing the growth rate of the adenoma and expansion of the “malignant clone” for further spread and metastasis.130 KRAS and BRAF mutations facilitate the transformation of adenomas into larger tumors. Other mutations in PIK3CA, SMAD4, and TP53 facilitate malignant growth with the potential for invasion.131 KRAS mutations occur in ~40% of cases, and the most common KRAS mutation subtypes in CRC are KRASG12D and KRASG12V.132 The mutation itself confers resistance to upstream anti-EGFR therapy, hence leading to a worse prognosis.133 Lung cancer is the third most common cancer with KRAS mutations (~21.20%), with an even higher prevalence (up to 40%) reported in some studies.74,134 The most common KRAS mutation subtype found in NSCLC (which accounts for 85% of all lung cancers) is the G12C mutation (39.11%), followed by variants such as G12V and G12D, which account for 17.78% and 18.44%, respectively.135,136,137,138 This likely partially explains the clinical outcomes of lung cancer, which remains the leading cause of cancer-related deaths in the United States,11 as point mutations in G12C are indicative of a worse outcome than other mutations (G12V and G12D).138 While the specific role of KRAS in carcinogenesis leading to NSCLC is not as clearly defined as it is in PDAC and CRC, multiple oncogenic events and mutations co-occur with KRAS mutations, contributing to resistance through compensatory mechanisms and highlighting the important role of delineating and characterizing those comutations.139 In fact, comutations in tumor suppressor genes such as STK11, KEAP1, TP53, SMARCA4, and CDKN2A/CDKN2B are common in KRAS-mutant lung cancers and play key roles in molecular and clinical heterogeneity, such as defining disease subsets on the basis of distinct biology, immune microenvironments, and therapeutic susceptibilities.136,140 Compared with nonsmokers, KRAS-mutated cancers in smokers have a complex mutational profile with comutations such as STK11 (10.3–28.0%), KEAP1 (6.3–23.0%), and TP53 (17.8–50.0%).136,137 Co-occurring gene mutations, such as those in STK11 and KEAP1, are associated with poor outcomes with chemotherapy.136 KRAS mutations are infrequent in breast cancer (BCa) and have been reported in certain triple-negative breast cancers (TNBCs).141 However, KRAS proteins are still known to be upregulated in BCa (compared with adjacent normal breast tissue), mostly through upstream activation by human epidermal growth factor 2 (HER2) and EGFR, both of which are frequently overexpressed in breast cancer, resulting in amplification of the RAS signaling pathway.141,142,143 Activated, wild-type KRAS also plays an important role in promoting the activation of oncogenic pathways; for example, depletion of the p21WAF1/CIP1 cyclin-dependent kinase inhibitor in BCa exaggerates KRAS signaling, leading to PI3K activation and de novo lipid biogenesis.144,145 Finally, one BCa-unique regulatory mechanism of KRAS activation is miRNA-382-5p, which interacts with and regulates the RAS-like estrogen-regulated growth inhibitor (RERG)/RAS/ERK axis, leading to enhanced BCa progression. In TNBC specifically, RAS protein activator like 2 (RASAL2) acts as a GAP gene and activates RAC1, hence promoting TNBC progression.146 The activation of the RAS-MAP pathway in TNBC has been linked to immune evasion and increased metastasis.147 In addition to mutations in PIK3CA and PTEN, KRAS mutations are the most frequent mutations in gynecological cancers, accounting for 22, 18, and 12% of all mutations, respectively. In ovarian cancer, co-occurring KRAS and BRAF mutations have been described in low-grade serous ovarian cancer.148 In cervical cancer, KRAS mutations have been identified as the second most common oncogenic mutation following PIK3CA, albeit with a low prevalence (2–4.3%), making it a rare event.149 In type I estrogen-related endometrial cancer, KRAS mutations occur at a relatively high frequency of 10–30%.150 Unlike other cancer types, the exact role of the KRAS pathway in tumorigenesis is not clearly defined and remains investigational, including a potential role in upregulating estrogen receptors and hypermethylation of the KRAS promoter as a mechanism of activation in endometrial carcinogenesis.151,152,153 Mutations in KRAS have also been detected in other solid tumors, but with a lower frequency and rarer occurrence. KRAS mutations account for 7% of prostate cancer (PCa) cases, leading to the activation of downstream effector proteins.128 Mutant KRAS plays a transformative role in PCa tumorigenesis by promoting cancer stemness and metastasis to bone, with KRAS rearrangements shown to promote PCa metastatic progression.153,154,155,156 In melanoma, while mutations in KRAS are even rarer, accounting for only 1.7% of cases, inhibiting its downstream effector BRAF is one example of a success story of targeting downstream effectors of KRAS for cancer therapy. Indeed, mutations in BRAF are prominent in melanoma, and inhibition of BRAF is a common, standard therapy for the treatment of BRAF-mutant melanoma. Recent work has shown that inhibition of wild-type KRAS in BRAF-mutant melanoma can be a potential strategy to overcome resistance to BRAF inhibition, since inhibition of KRAS functions synergistically with BRAF inhibition to reduce proliferation and induce apoptosis independent of BRAF mutation status.157 KRAS mutations are rare in gliomas, including glioblastomas, where alterations in the RTK/PI3K pathway are relatively common drivers.158 When present, KRAS mutations in gliomas are typically associated with a subset of pediatric low-grade gliomas rather than adult high-grade tumors. KRAS mutations are also observed in digestive cancers other than PDAC and CRC: in gastric cancer (~5-10% of gastric adenocarcinomas, mainly in the intestinal subtype), esophageal cancer (more prevalent in adenocarcinoma than in squamous cells, particularly in association with Barrett’s esophagus), biliary tract cancer (often coexisting with FGFR and IDH1/2 mutations), and hepatocellular carcinoma (uncommon, with greater prominence of other pathways, such as Wnt/β-catenin and TP53).159,160,161,162,163 The variation in the prevalence, subtypes, and regulation of KRAS mutations, as well as the impact of co-occurring mutations, not only reflects differences in disease behavior but is also important when designing therapeutic strategies to target KRAS. In fact, such differences reflect biochemical heterogeneity, manifested by variations in mutational characteristics such as binding affinity to downstream effectors, response to therapy, and metastatic patterns.74 For example, KRAS mutations lead to constitutive activation of KRAS proteins either by impeding their interaction with GAPs or by decreasing their intrinsic GTPase activity.77,161 The intrinsic GTPase activity of KRAS, which allows it to auto-inactivate downstream signal propagation, was highly variable for each KRAS mutant; however, G12C has no impact on the intrinsic inactivation rate, G12D results in a 7-fold decrease in GTPase activity, and G12V and G13D mutations result in an intermediate decrease in the hydrolysis rate. Similarly, with GAP-mediated inactivation/hydrolysis of KRAS, mutations in codons 12 and 13 result in a subdued response to extrinsic GTPases, with most mutants showing a 97–99% decrease in GAP-mediated hydrolysis.164,165 KRAS mutants with high RAF affinity (WT, G12A, G12C, G13D, and Q61L) and low intrinsic GTPase rates (G12A, G12R, G12V, Q61L, and Q61H) were found to have increased RAF activation and sustained RAF activation compared with mutant forms with low RAF affinity (G12R, G12V, and G12D) and high intrinsic GTPase rates (WT, G12C, G12D, and G13D). KRAS-G12C and G12V preferentially activate the RAL A/B signaling pathway, whereas KRAS-G12D tends to activate the PI3K-AKT-mTOR pathway.74 Analyzing the distinct biochemical properties of KRAS isoforms and categorization of KRAS-driven cancers will help streamline and focus on specific targets of therapy, whether a specific effector, an isoform, or a pathway. Similarly, understanding co-occurring mutations and intra-driver heterogeneity is crucial for the development of novel therapeutic interventions, namely, combinational approaches. A collection of co-occurring mutations alongside driver mutations plays a significant role in tumor heterogeneity.140 These comutations can markedly affect KRAS function and influence tumor development and progression.74 A study analyzing NSCLC samples (n = 1078) bearing KRAS mutations revealed that 53.3% of these patients also had comutation, with TP53 being the most common (39.4%). Other comutations identified include the serine/threonine kinase 11 gene (STK11; 19.8%), Kelch-like ECH-associated protein 1 gene (KEAP1; 12.9%), ATM serine/threonine kinase gene (ATM; 11.9%), Met amplifications (15.4%) and others, including the rare co-occurrence of EGFR (1.2%), which were initially thought of as mutually exclusive with KRAS mutations.6,136,138,165 These different comutations result in variable impacts. For example, NSCLC tumors with KRAS/STK11 comutations are associated with a “cold” tumor microenvironment (TME) that has a paucity/exclusion of CD8+ tumor-infiltrating T cells, a preponderance of T-regulatory cells, innate resistance to PD-L1 inhibition, and inferior outcomes with PD-L1 inhibitor therapy and chemoimmunotherapy.74,136,166 Tumors with cooccurring KRAS/TP53 mutations have a TME that is rich in inflammatory cells and dendritic cells. They are also associated with genomic instability, a high tumor mutational burden, and a better response to PD-L1 inhibitors due to increased expression of PD-L1 receptors and shorter OS in patients treated with platinum-based adjuvant chemotherapy.136 KRAS mutations control the intrinsic features of tumors, such as proliferation and survival, as well as the extrinsic environment that allows them to spread by promoting immune escape. The tumor microenvironment associated with KRAS is often inflammatory, which increases the occurrence and development of cancer. KRAS-mutant cancers are known to evade the immune response and contort with the TME by upregulating PD-L1 receptor expression, downregulating MHC-I expression on tumor cells, and increasing the secretion of IL-10 and NFκB to induce immunosuppressive T-regulatory cells.74,167 Thus, these comutations call for caution when treating KRAS-driven cancers to allow for a personalized therapeutic approach for a better response.74 The approval of next-generation sequencing (NGS) by the FDA will help advance care for heterogeneous cancer populations and advance our grasp of the role of comutations and KRAS mutation subtypes in disease pathogenesis and outcomes.138 Clinical and prognostic implications of mutated KRAS Clinically, and as a reflection of the previously described pathways, patients with KRAS mutations have a predilection for metastasis to the lung and brain, with G12C and G12D variants being inclined toward bony metastasis and G12V mutants favoring pleuropericardial spread.74 The biochemical and molecular heterogeneity described above also reflects differences in the clinical and prognostic implications of mutated KRAS, as highlighted below. In a study of patients with left-sided CRC with microsatellite stability (MSS), KRAS-mutant variants were found mostly in the lung metastatic group, with a lower proportion in the liver metastatic group. Another study of metastatic CRC with mutations between primary and metastatic lesions (progressive and regressive subgroups) revealed a strong association between the KRAS regression trajectory (mut-KRAS→ wild-type-KRAS) and oligometastatic status. The study also revealed a favorable response to chemotherapy in metastatic CRC patients with regressive discordant mutational profiles.168 Overall, patients with metastatic KRAS-mutant CRC have lower overall survival (OS) and relapse-free survival (RFS).133 KRAS status also affects the response to non-KRAS-targeted therapies: metastatic KRAS-mutant cancers are known to be resistant to anti-EGFR therap"
}