{
  "url": "https://www.elki.com/inside-elki",
  "title": "Inside Elki | Elki",
  "text": "Sign In / My Account Quick Order Form Basket (0 items) Checkout Specialty Foods NEW PRODUCTS Jam / Preserves (Scandinavian Delights) Gourmet Crackers Crostini Spreads Bruschettas Pesto / Tapenade Fire Grilled Vegetables / Antipasti Gourmet Dips Salsa Asian Sauces All about Lingonberries - #1 Seller Gluten Free | Gifts | Home | Recipes | Special Offers | Catalog | Join email list | Contact Us Elki > Inside Elki \"The Finest Specialty Foods\" The ELKI Story... In the beginning… Since I was a young girl, I have had a passion for great food. Little did I know my passion for the food world would be fulfilled by a company my father started “unintentionally” in 1984. My father already had a kitchenware business which he loved. He had no intention of starting another business until a couple of people from Scandinavia asked that he help them market their homemade, high quality preserves from Denmark. After tasting these special preserves, he agreed to take them to a gourmet products trade show. Little did he know, this little line of preserves would be a huge hit! Customer demand was so high they kept telling him to just send the preserves as soon as he got them in stock. You see, this line is manufactured in Denmark; however the fruit and berries in each jar come only from the very best regions of the world that have the perfect harvesting conditions for the best quality, best tasting fruit and berries. For instance, we use naval oranges from southern Spain and our lingonberries are hand-picked in Denmark and Finland. Our wild blueberries are special, small blueberries that grow in north Scandinavian forests close to the polar circle with 24 hour sunlight. This is the same time honored tradition that you receive today in each jar of Scandinavian Delight Preserves. This quality and taste captured a following and ELKI WAS BORN! Looking back... As a little girl, I was raised with a love of good food. This passion led to a love of entertaining and cooking as an adult. My family still jokes that I have my dinner planned before I’ve eaten breakfast. Growing up with a father in the kitchenware business, I had the opportunity to earn “fun” money or “candy” money by assembling kitchen tools for $.05 per piece. My mother also owned a beautiful kitchen store. My sister and I loved being there and serving hot cider during the holidays in our traditional Norwegian holiday dresses called Bunads. This industry has been in my blood since day one and I’m grateful for the joy of good food and entertaining. The story continues… My father realized he needed to start a new company for this line. He named the company ELKI after my sister and I….Elizabeth and Kirsten. Years went by and the Scandinavian Delight Preserve sales grew and grew. During a summer break in college, I helped out at ELKI and realized I really wanted to be a part of this industry. In 1995, fresh out of college with a degree in business administration and marketing, I began full-time work at ELKI. I have always laughed about the fact that I didn’t even have an inbox when I started, but I drove to work each day full of excitement and passion for gourmet foods, cooking, and entertaining. I was excited to get started developing new product lines with innovative flavors. After a few incredible and fun years, I bought the company from my father in 2000. It’s been an exciting and fun adventure from day one. I truly believe I have the best job in the world, working with incredible products, loyal customers and amazing staff who make ELKI what it is today. There is hardly a week that goes by where ELKI doesn’t receive an email, letter, or phone call stating that it’s great to know “customer service is still alive” or “everyone at ELKI is so positive and happy, are you all really like that?” The answer is YES! ELKI today… Since entering ELKI in 1995, I quickly realized that using only high-quality ingredients to create the finest products had to remain our continued focus. Today, ELKI has earned a solid reputation in the gourmet food industry. We have won several National Awards for our food products and beautiful packaging. ELKI sells to specialty shops, kitchen stores, delis, upscale grocery, and gift basket companies. Our mission is to continue introducing the finest gourmet foods while maintaining our reputation as one of the best in service. ELKI’s attitude toward customer service, backed by a commitment to creating the finest products, has resulted in several product lines and a base of customers who are dedicated to ELKI and our products. ELKI has been exhibiting its products for 34 years at the Fancy Food Shows, both in San Francisco and New York to industry buyers. We also exhibit at a variety of regional shows with our team of sales reps. ELKI continues to grow its product assortment, always remembering our core values and commitment to use high-quality ingredients and create product lines with both classic and innovative flavors. Our goal has been to create foods with the perfect balance of texture, color, and layering of flavors, resulting in products that you crave and can’t stop thinking about. We value our amazing employees, our incredible team of salespeople, and our wonderful, loyal customers who make our job exciting, motivating us to continue our passion every day. Sincerely, Elizabeth join our email list! Receive the latest deals and new product arrivals."
}