{
  "url": "https://www.polet.network/publications/preprints/vetier2025",
  "title": "Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe — POLET",
  "text": "Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe Marta Vetier, Vadim Vinichenko, Jessica Jewell, Anastasia Pavlenko, and Aleh Cherp (pre-print) Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe. POLET Working Paper series 2025-1 ABSTRACT Accelerating mature low-carbon technologies is vital for sustainability transitions, yet little is known about how to measure, explain, or anticipate such acceleration. The S-curve theory assumes continuous acceleration up to an inflection point, followed by a steady slowdown. Using three decades of onshore wind data from 18 European countries, we challenge this idealised view. We identify turning points in deployment and propose metrics suited to both linear and non-linear growth. Acceleration typically stops once wind has reached about 2% (median, IQR 1-4%) of its capacity potential or 4% (2-6%) of electricity supply, much earlier than standard S-curve expectations. Thereafter, deployment enters a steady-growth phase – quasi-linear expansion of roughly 0.8 percentage points (p.p.) (0.6-1.0 p.p.) of electricity per year – punctuated by policy-driven growth pulses. These cruising speeds remain remarkably consistent across countries and over time, reflecting a stable balance between technical, economic, political, and socio-technical constraints. Responding to the 2022 energy crisis and rising climate concerns, recent policies aim to double the median cruising speed but without exceeding maximum historical speeds. Policy-driven acceleration of mature technologies is possible and should be interpreted in terms of sustaining fast growth for longer periods rather than continuously increasing the speed. Download the working paper: Vetier et al. 2025. Conceptualising and measuring acceleration of mature policy-driven technologies: the case of onshore wind power in Europe"
}