{
  "url": "https://en-academic.com/dic.nsf/enwiki/454565",
  "title": "Novgorod Republic",
  "text": "- Novgorod Republic - The Novgorod Republic (Russian: Новгородская республика / Novgorodskaja respublika Old Church Slavonic: Новгородская земьля / Novgorodskaja zemľa) was a large medieval Russian state which stretched from the Baltic Sea to the Ural Mountains between the 12th and 15th centuries, centred on the city of Novgorod. Citizens referred to their city-state as \"His Majesty (or Sovereign) Lord Novgorod the Great\" (Gosudař Gospodin Velikij Novgorod), or more often as \"Lord Novgorod the Great\" (Gospodin Velikij Novgorod). The Republic prospered as the easternmost port of the Hanseatic League. History See also: Kievan RusOriginally Novgorod was the capital of the Rus until 882 when Oleg transferred the capital to Kiev. From that time and up until 1019-1020 Novgorod was a part of Kievan Rus. Novgorod Princes were appointed by the Grand Prince of Kiev (usually one of the elder sons). Novgorod was sort of a spiritual center as by the legend it was the first city of Rus. Remarkably, to this day Novgorod still possesses the relics of the old traditional beliefs that preceded Christianity and are now part of the long forgotten history. Novgorod continuously played a key role in the politics of Rus by assisting Vladimir the Great of Kiev, and later playing a key role in placing Yaroslav the Wise on the Kiev throne. One of his first actions as a Grand Prince was to grant loyal Novgorodians (who had helped him to regain the throne) numerous freedoms and privileges. Thus, the foundation for the Novgorod Republic was laid. While still being a part of Kiev Rus, Novgorod eventually evolved into a powerful regional center that was largely independent. While the city had a more participatory government than much of the rest of Rus', and it chose its officials locally, it still was very much a part of the political and cultural landscape of Kiev Rus. The Novgorod boyars began to dominate the offices of posadnik and tysyatsky, which up until about the mid-12th century had been appointed by the grand prince in Kiev. In 1136, the Novgorodians dismissed Prince Vsevolod Mstislavich and over the next century and a half were able to invite in and dismiss a number of princes, although these invitations or dismissals were often based on who the dominant prince in Rus' or Appanage Russia was at the time, and not on any independent thinking on the part of Novgorod.[1] Cities such as Staraya Russa, Staraya Ladoga, Torzhok and Oreshek, were part of the Novgorodian Land. According to some accounts, a vicar of the archbishop ran the city of Staraya Ladoga in the 13th century. The city of Pskov was initially part of the Novgorodian Land, but had de facto independence from at least the 13th century after joining the Hanseatic League. Several princes such as Dovmont and Vsevolod Mstislavich reigned in Pskov without any deference to or consultation with the prince or other officials in Novgorod. Pskov's independence was acknowledged by the Treaty of Bolotovo in 1348 (see Pskov Republic). Even after this, however, the Archbishop of Novgorod headed the church in Pskov and kept the title \"Archbishop of Novgorod the Great and Pskov\" until 1589. In the 12th–15th century, the Novgorodian Republic expanded east and northeast. The Novgorodians explored the areas around Lake Onega, along the Northern Dvina, and coastlines of the White Sea. In the beginning of the 14th century the Novgorodians explored the Arctic Ocean, Barents Sea, Kara Sea, and the West-Siberian river Ob. The Ugric tribes, which inhabited the Northern Urals, had to pay tribute to Novgorod the Great. The lands to the north of the city, rich with furs, sea fauna, salt etc., were of great economic importance to the Novgorodians and they fought a protracted series of wars with Moscow beginning in the late 14th century in order to keep these lands. Losing them meant economic and cultural decline for the city and its inhabitants. Indeed, the ultimate failure of the Novgorodians to win these wars led to the downfall of the Republic. The name \"feudal republic\" has been frequently used in the Soviet-era scholarship, where it was often used by Marxist scholars to place the Novgorodian Republic within the Marxist historiographic periodization (slavery - feudalism - capitalism - socialism - communism).[2] Many scholars today, however, question whether or not Russia ever really had a feudal political system parallel to that of the medieval West.[3] The term \"Feudal Republic\" was never used by the Novgorodians themselves (indeed, feudalism is a seventeenth-century scholarly term); rather they referred to their city-state as \"His Majesty (or Sovereign) Lord Novgorod the Great\" (Государь Господин Великий Новгород / Gosudar' Gospodin Velikiy Novgorod), or more often as \"Lord Novgorod the Great\" (Господин Великий Новгород / Gospodin Velikiy Novgorod);[4] The entire region - the city and its vast hinterlands - was known as The Novgorodian Land. Internal organization The precise constitution of the medieval Novgorodian Republic is uncertain, although traditional histories have created the image of a highly institutionalized network of veches (public assemblies) and a government of posadniks (mayors), tysyatskys (\"thousandmen,\" originally the head of the town militia, but later a judicial and commercial official), other members of aristocratic families, and the archbishops of Novgorod. Some scholars argue that the archbishop was the head of the executive branch of the government, although it is difficult to determine the exact competence of the various officials. It is possible that there was a \"Council of Lords\" (Совет Господ) that was headed by the archbishop and met in the archiepiscopal palace (and in the Palace of Facets after 1433),[5] but more recently Jonas Granberg has called into doubt whether such a body every really existed; he argues it is, in fact, an invention of historians reading too much into sparse sources.[6] The (at least nominal) executives of Novgorod were always the Princes of Novgorod, invited by Novgorodians from the neighboring states, even though their power waned in the thirteenth and early 14th centuries.[7][8] It's unclear if the archbishop of Novgorod was the real head of state or chief executive of the Novgorod Republic, but in any case he remained an important town official; in addition to overseeing the church in Novgorod, he headed embassies, oversaw certain court cases of a secular nature, and carried out other secular tasks, but the archbishops appeared to have worked with the boyars to reach a consensus and almost never acted alone. The archbishop was not appointed, but elected by Novgorodians, and approved by Metropolitan bishop of Russia.[9] The archbishops were probably the richest single land-owner in Novgorod, and also made money off court fees, fees for the use of weights and measures in the marketplace, and through other means.[10] Another important executive was Novgorod Posadnik, who chaired Veche, co-chaired courts together with Prince, oversaw tax collection and managed current affairs of the city. Most of the Prince's major decisions had to be approved by the Posadnik. In mid-14th century instead of one Posadnik, Veche began electing 6. These 6 posadniks kept their status for their lifetimes, and each year elected among themselves a chief Stepennoy Posadnik.[11] The precise makeup of the veche is also uncertain, although it appears to have comprised members of the urban population, as well as of the free rural population. Whether it was a democratic institution or one controlled by the boyars has been hotly debated. The posadniks, tysiatskys, and even the bishops and archbishops of Novgorod(starting from 1156) (elevated to archiepiscopal status in 1165 were often elected or at least approved by the veche.[12] Tradespeople and craftsmen also participated in the political affairs of Novgorod the Great. The traditional scholarship argues that they were organized into five \"kontsy\" (ends) - konets (конец; pl. концы) in Russian - i.e., the boroughs of the city they lived in); each end was then organized by the streets in which they were living). The ends and streets often bore names indicating that certain trades were concentrated in certain parts of the city (there was a Carpenter's End and a Potters' End for example). The trade groups had sotnyas (сотни, or hundredmen) (see also Ivan’s Hundred, though to have been the first Russian guild although there is no evidence of guilds existing in Rus' such as they were in, say, the Low Countries, Germany, France, or England). Like much of the rest of Novgorod's medieval history, the precise composition of these trade or crafts organizations is uncertain and they ought not to be confused with the much more organized guilds (or later unions) of Western Europe. It is quite possible that the \"ends\" and \"streets\" were simply neighborhood administrative groups rather than guilds or \"unions\". Street organizations were known to build churches in their neighborhoods and to have buried the dead of their neighborhoods during outbreaks of the plague, but beyond that their activities are uncertain. As for Ivan's Hundred, its exact nature is not known. It was organized around the Church of St. John the Forerunner on the Opoki, just north of the marketplace, and each member had to pay an entrance fee of a bolt of Ypre cloth (from northern France) to the archbishop. The tysyatsky arbitrated disputes between the members. Other than that, the activities of Ivan's Hundred is unknown. \"Streets\" and \"ends\" may have taken part in political decision-making in Novgorod in support of certain boyar factions or to protect their interests. Merchant \"elders\" are also noted in treaties and other charters, but only about a hundred of these charters exist. A half dozen date from the 12th century, while most are from after 1262. Thus it is difficult to determine Novgorod's political structure due to the paucity of sources.[13] The prince, while his status in Novgorod wasn't heritable and his power was much reduced, remained an important figure in Novgorodian life. Of around 100 princes of Novgorod, many, if not most, were invited in or dismissed by the Novgorodians. At least some of them signed a contract called a r'ad (ряд) which protected the interests of the Novgorodian boyars and laid out the prince's rights and responsibilities. The r'ads that have been preserved in archives describe relationship of Novgorod with twelve invited Princes: five of them from Tver', four from Moscow and three from Lithuania.[14] First and foremost among the prince's functions, he was a military leader. He also patronized churches in the city and held court, although it was often presided over by his namestnik or lieutenant when he was personally absent from the city. Posadnik had always to be present in the court and no court decision could be made without his approval. Also, without the posadnik's approval the prince could neither give out Novgorod lands nor issue laws.[15] Besides, the prince couldn't own land in Novgorod and couldn't himself collect taxes from the Novgorod lands. He lived from money given to him by the city.[16] According to several r'ads, the prince couldn’t extradite or prosecute a Novgorodian outside of the Novgorodian Land.[17] The princes had two residences, one on the Marketplace (called Yaroslav's Court, after Yaroslav the Wise), and the (Городище / Riurkovo Gorodische) several miles south of the Market Side of the city. The administrative division of Novgorod Republic is not definitely known; the country was divided into several tysyachas (in the core lands of the country) and volosts (lands in the east and north that were being colonised or just paid tribute). The city of Novgorod with its vicinity, as well as a few other towns were not part of any of those. Pskov achieved an autonomy from Novgorod in the 13th century; its independence was confirmed by the Treaty of Bolotovo in 1348. Several other towns had special status as they were owned jointly by Novgorod and one of neighbouring states. See also: Administrative division of Novgorod LandEconomy The economy of the Novgorodian Republic included farming and animal husbandry (e.g., the archbishops of Novgorod and others raised horses for the Novgorodian army), hunting, beekeeping, and fishing were also widespread. In most of the regions of the republic, these different \"industries\" were combined with farming. Iron was mined on the coast of the Gulf of Finland. Staraya Russa and other localities were known for their saltworks. Flax and hop cultivation were also of significant importance. Countryside products, such as furs, beeswax, honey, fish, lard, flax, and hop, were sold on the market and exported to other Russian cities or abroad. The real wealth of Novgorod, however, came from the fur trade. The city was the main entrepôt for trade between Rus' and northwestern Europe. It stood on the northwestern end of the Silk Road from China and at the eastern end of the Baltic Trade network established by the Hanseatic League. From Novgorod's northeastern lands (\"The Lands Beyond the Portages\" as they were called in the chronicles), the area stretching north of Lakes Ladoga and Onega up to the White Sea and east to the Ural Mountains[18] had so much fur that medieval travel accounts tell of furry animals raining from the sky.[19] The Novgorodian merchants traded with Swedish, German, and Danish cities. In early years, the Novgorodians sailed the Baltic themselves (several incidents involving Novgorodian merchants in Gotland and Denmark are reported in the Novgorodian First Chronicle. Orthodox churches for Novgorodian merchants have been excavated on Gotland. Likewise, merchants from Gotland had their own S:t Olof church and trading house in Novgorod. However the Hanseatic League disputed the right of the Novgorod merchants to carry out sea trade independently and to deliver cargoes to the West-European ports by their own ships. More than a half of all Novgorodian privately owned lands had been concentrated in the hands of some 30–40 noble boyar families by the 14th–15th century. These vast estates served as material resources, which secured political supremacy of the boyars. The House of Holy Wisdom (Дом святой Софии, Dom Svyatoy Sofiy) — the main ecclesiastic establishment of Novgorod — was their chief rival in terms of landownership. Its votchinas were located in the most economically developed regions of the Novgorod Land. The Yuriev Monastery, Arkazhsky Monastery, Antoniev Monastery and some other privileged monasteries are known to have been big landowners. There were also the so-called zhityi lyudi (житьи люди), who owned less land than the boyars, and unprivileged small votchina owners called svoyezemtsy (своеземцы, or private landowners). The most common form of labor exploitation — the system of metayage — was typical for the afore-mentioned categories of landowners. Their household economies were mostly serviced by slaves (kholopy), whose number had been constantly decreasing. Along with the metayage, monetary payments also gained significant importance by the 2nd half of the 15th century. Some scholars argue that the feudal lords tried to legally tie down the peasants to their land. Certain categories of feudally dependent peasants, such as davniye lyudi (давние люди), polovniki (половники), poruchniki (поручники), dolzhniki (должники), were deprived of the right to leave their masters. The boyars and monasteries also tried to restrict other categories of peasants from switching their feudal lords. However, there was a tradition in Russia that peasants could leave their land if they had paid all their debts. They were able to leave during the weeks preceding and coming after \"St. George's day in the autumn\". This tradition was \"temporarily\" suspended only by Ivan the Terrible, more than a century after the Muscovite conquest of Novgord; thus full serfdom never existed in the Novgorodian Republic. The temporary suspension was, in fact, never lifted and serfs were formally tied to their land by the Ulozhenie (law code) of 1649. Marxist scholars (e.g., Aleksandr Khoroshev) often spoke of class struggle in Novgorod. There were some 80 major uprisings in the republic, which often turned into armed rebellions. The most notable among these took place in 1136, 1207, 1228–29, 1270, 1418, and 1446–47. The extent to which these were based on \"class struggle\" is unclear. Many were between various boyar factions or, if a revolt did involve the peasants or tradesman against the boyars, it did not consist of the peasants wanting to overthrow the existing social order, but was more often than not a demand for better rule on the part of the ruling class. There did not seem to be a sense that the office of prince should be abolished (it didn't seem to cross the medieval mind to do that) or to let the peasants run the city. Foreign relations Novgorod struggled for centuries against Swedish, Danish, and German crusaders. During the Swedish-Novgorodian Wars, the Swedes invaded first Finland and then Karelia, lands where some of the population had on previous occasions paid tribute to Novgorod. The Germans, for their part, had been trying to conquer the Baltic region since the late 12th century. Novgorod had to go to war 26 times with Sweden and 11 times with the Livonian Brothers of the Sword. The German knights along with the Danish and Swedish feudal lords launched a series of uncoordinated attacks in 1240-1242. Their campaigns, however, failed after the Battle of the Neva (1240) and Battle on the Ice (1242). On August 12, 1323, the Treaty of Nöteborg, a treaty between Sweden and Novgorod regulating their border, was signed. This was the first time the border between what was to become Russia and Sweden-Finland was regulated. The army of Novgorod successfully repelled subsequent attacks, as well. The Novgorod Republic managed to escape the horrors of the Mongol invasion, because the Mongol commanders probably did not want to get bogged down in the marshlands surrounding the city and turned back 100 km from Novgorod. In spite of never being formally conquered, the Republic began to pay tribute to the khans of the Golden Horde. In 1259, Mongol tax-collectors and census-takers arrived in the city leading to political disturbances in the city and forcing Alexander Nevsky to punish a number of town officials (he cut off their noses) for defying him as Grand Prince of Vladimir (soon to be the khan's tax-collector in Russia) and his Mongol overlords. In the 14th century, the raids of Novgorod's pirates (or ushkuiniki),[20] who sowed fear as far as Kazan and Astrakhan, assisted Novgorod in their wars with Muscovy. Fall of the Republic Tver, Moscow, and Lithuania fought over control of Novgorod and its enormous wealth from the 14th century. Upon becoming the Grand Prince of Vladimir, Mikhail Yaroslavich of Tver sent his governors to Novgorod. A series of disagreements with Mikhail pushed Novgorod towards closer ties with Moscow during the reign of Grand Prince George. In part, Tver's proximity (the Tver Principality is contiguous with the Novgorodian Land) threatened Novgorod. It was feared that a Tverite prince would annex Novgorodian lands and thus weaken the Republic. At the time, though, Moscow did not touch Novgorod, and since the Muscovite princes were further afield, they were more acceptable as princes of Novgorod. They could come to Novgorod's aid when needed, but would be too far away to meddle too much in the Republic's affairs. As Muscovy grew in strength, however, the Muscovite princes became a serious threat to Novgorod. Ivan Kalita, Simeon the Proud and other Muscovite monarchs sought to limit Novgorod's independence. In 1397, a critical conflict took place between Muscovy and Novgorod, when Moscow annexed the Dvina Lands along the course of the Northern Dvina. These lands were crucial to Novgorod's well-being since much of the city's furs came from there.[21] This territory was returned to Novgorod the following year. Resisting the Muscovite oppression, the government of Novgorod sought an alliance with Poland-Lithuania. Most Novgorodian boyars wished to maintain the Republic's independence since if Novgorod was to be conquered, the boyars' wealth would flow to the grand prince and his Muscovite boyars and the Novgorodians would fall into decline. 77.8% of them didn't earn enough to pay for war.[22] According to tradition, the proponent of an alliance with Poland-Lithuania to save the Republic, called the Lithuanian party, was led by Marfa Boretskaya, the wife of Posadnik Isak Boretskii. According to this legend, Boretskaya invited the Lithuanian princeling Mikhail Olelkovich and asked him to become her husband and the ruler of Novgorod. She also concluded an alliance with Casimir, the King of Poland and Grand Duke of Lithuania. The prospects of changing allegiance in favor of the allied Kingdom of Poland and Grand Duchy of Lithuania caused major commotion among the commoners. Janet Martin and Gail Lenhoff have recently argued that Boretskaya was scapegoated, probably by Archbishop Feofil (r. 1470-1480) in order to shift the blame from him for his betrayal of the terms of the Treaty of Yazhelbitsy, which forbade Novgorod from conducting foreign affairs without grand princely approval.[23] While the extent of Boretskaya's role in the Lithuanian party is probably exaggerated, Novgorod did, indeed try to turn to the King of Poland. A draft treaty, allegedly found among the loot after the Battle of Shelon River, was drawn up between Casimir and the Novgorodians.[24] Muscovite authorities saw Novgorod's behavior as a repudiation of the Treaty of Yazhelbitsy and went to war against the city. The army of Moscow won a decisive victory in the Battle of Shelon River in July 1471, which severely limited Novgorod's freedom to act thereafter, although the city maintained its formal independence for the next seven years. In 1478, Ivan III sent his army to take the city. He massacred the population and destroyed the veche, including the library and archives, at which point the history of the Republic of Novgorod can be said to have ended. Ivan took 81.7% of Novgorod's land half for himself the rest for his allies.[25] Rulers of Novgorod See also: Prince of Novgorod- Rus - Novgorod Land - Vladimir the Great 969–977 - Dobrynya 977–988 - Vysheslav Vladimirovich 988–1010 - Yaroslav the Wise 1010–1019 - Konstantin Dobrynich - Vladimir 1036–1052 (assisted by Vyshata) - Ostromir 1052–1054 (probably as a representative before being replaced by Mstislav) - Mstislav Iziaslavich 1054-1067 (son of Izyaslav I of Kiev) - part of Principality of Polotsk 1067–1069 - Gleb Svyatoslavich 1069–1073 - Sviatopolk Iziaslavovich 1078–1088 - Mstislav the Great 1088–1117 - Vsevolod 1117–1132 - Novgorod Republic See also References - ^ Michael C. Paul, \"Was the Prince of Novgorod a 'Third-rate bureaucrat' after 1136?\" Jahrbücher für Geschichte Osteuropas 56, No. 1 (Spring 2008): 72-113. - ^ Karl Marx and Friedrich Engels, The Communist Manifesto. - ^ See, for example, Igor Froianov, Kievskaia Rus; ocherki sotsial’no-ekonomicheskoĭ istorii. (Leningrad: Leningrad State University, 1974). - ^ Gospodin Velikiy Novgorod is also the name of a 1984 Soviet film starring future People's Artist of the Soviet Union Oleg Strizhenov. It was, however, about Novgorod in the Second World War, and was not set in the medieval period. - ^ V. O. Kliuchevskii, Boiarskaia Duma drevnei Rusi; Dobrye liudi Drevnei Rusi (Moscow: Ladomir1994), 172-206; Idem., Sochinenii, vol. 2, pp. 68-69; George Vernadsky, Kievan Russia (New Haven: Yale University Press, 1948), 98, 197-201; - ^ Jonas Granberg, “The Soviet Gospod of Novgorod, in Russian and German Sources,” Jahrbücher für Geschichte Osteuropas 47 (1998): 396-401 - ^ Valentin Yanin \"Outline of history of medieval Novgorod. - ^ Paul, \"Was the Prince of Novgorod a 'Third-rate bureaucrat' after 1136?\" passim. - ^ Valentin Yanin \"Outline of history of medieval Novgorod. - ^ Michael C. Paul, “Secular Power and the Archbishops of Novgorod Before the Muscovite Conquest.” Kritika: Explorations in Russian and Eurasian History 8, no. 2 (Spring 2007): 231-270; Idem, “Episcopal Election in Novgorod, Russia 1156-1478.” Church History: Studies in Christianity and Culture 72, No. 2 (June 2003): 251-275. - ^ Valentin Yanin Novgorod posadniks - ^ Michael C. Paul, \"The Iaroslavichi and the Novgorodian Veche 1230-1270: A Case Study on Princely Relations with the Veche,\" Russian History/ Histoire Russe 31, No. 1-2 (Spring-Summer, 2004): 41. - ^ Valk, ed. Gramoty Velikogo Novgoroda i Pskova - ^ Valentin Yanin Novgorod acts of XII-XV centuries - ^ Valentin Yanin \"Sources of Novgorod statehood. - ^ Valentin Yanin \"Outline of history of medieval Novgorod. - ^ Paul, \"Was the Prince of Novgorod a 'Third-rate bureaucrat' after 1136?\" 100-107. - ^ Janet Martin, Treasure of the Land of Darkness: the Fur Trade and its Significance for Medieval Russia (Cambridge: Cambridge University Press, 1985). - ^ Paul, \"Secular Power and the Archbishops of Novgorod Before the Muscovite Conquest,\" 258. - ^ Janet Martin, “Les Uškujniki de Novgorod: Marchands ou Pirates.” Cahiers du Monde Russe et Sovietique 16 (1975): 5-18. - ^ Martin, Treasure of the Land of Darkness; Paul, \"Secular Power and the Archbishops of Novgorod Before the Muscovite Conquest,\" 258-259. - ^ Richard Pipes, Russia under the old regime, page 80 - ^ Gail Lenhoff and Janet Martin. “Marfa Boretskaia, Posadnitsa of Novgorod: A Reconsideration of Her Legend and Her Life.” Slavic Review 59, no. 2 (2000): 343-68. - ^ Paul, \"Secular Power and the Archbishops of Novgorod,\" 262. - ^ Richard Pipes, Russia under the old regime, page 93 External links Categories:- Former countries in Europe - States and territories established in 1136 - States and territories disestablished in 1478 - East Slavic history - Novgorod Republic - Trading posts of the Hanseatic League - Former Slavic countries - 1478 disestablishments Wikimedia Foundation. 2010."
}