{
  "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/page/4/",
  "title": "On cheese - Page 4 - Dairy and Eggs - Moutfulsfood",
  "text": "Wilfrid Posted November 23, 2024 Author Posted November 23, 2024 Scissors or very sharp knives, yes. Do these brands do panel tests to see if their shit packages will open as intended? Quote relbbaddoof Posted December 15, 2024 Posted December 15, 2024 (edited) Cato Corner carries around this time full vertical versions of many of their cheeses. You can get, for example, Vivace Bambino, Vivace, & Vivace Molto Womanchego, Mrs. Robinson, & Wise Womanchego as I did (in addition to Gossamer, and suchlike). This year's Hooligan is about to be released they say. But tragedy has struck. I bought these vertical tastings to take to a big family reunion in Leeds (complicated reasons) over Christmas, but that fucking Indian colony, the UK, does not permit dairy products being brought in. I looked at the list of what is and is not allowed, and there's a pattern: mangoes, guavas allowed, apples no. Protectionism anyone? I'll have to drown my sorrow in Yorkshire Blue. Anything else? Edited December 15, 2024 by relbbaddoof Quote voyager Posted December 16, 2024 Posted December 16, 2024 On 11/22/2024 at 8:00 PM, Wilfrid said: Scissors or very sharp knives, yes. Do these brands do panel tests to see if their shit packages will open as intended? I've resigned myself to having entered my second childhood. What else explains that 90% of shelf goods now come in \"childproof\" packaging. Quote relbbaddoof Posted January 18, 2025 Posted January 18, 2025 (edited) Fans of Hooligan -- not everybody is -- can say hurray! It's now in season. I've just had 1/2 wheels of the normal, the extra-, and the drunken- shipped, but haven't tried any yet. I'd referred above to the Vivace vertical, and the stupid laws that blocked me from taking them to the UK. As it turned out I could have done so in good conscience -- had I simply bothered NOT to read the regulations. Flying to Leeds from Boston via Dublin does not involve passing any obvious customs checkpoint. You show your passport in Dublin and are legally out of the USA. But your bags are checked through, so no customs check. At Leeds you pick up your bags at carousel-whatever along with domestic travelers and simply walk out. Yes, there's a green line painted on the floor, but people seem to view that more as decoration. But the cheeses were great on later tasting and, more importantly, life savers. Ten days after our return my wife had to go to a professional meeting at a resort (to name names, the Gaylord National Harbor in Maryland). I tagged along. The food there was both hideous and hideously expensive ($46 for a tough, chewy pork chop at one of their in-resort restaurants, $18 for a Boars Head turkey wrap at their market). But we took the three ages of Vivace with us, a wheel of Gossamer, some boiled eggs (plus a ziplock of coarse salt and coarsely cracked pepper), and some good crackers. We were able to at least breakfast well and snack well. Edited January 18, 2025 by relbbaddoof added a hyphen Quote small h Posted January 18, 2025 Posted January 18, 2025 3 hours ago, relbbaddoof said: Fans of Hooligan (raises hand) I was at USQ today and tasted Cato Corner's Drunken Monk, which may be even more pungent that Hooligan. I elected to take home a milder cheese, 'cause the mister's tolerance for stink is essentially zero. I get my Hooligan fix when he's out of the house. Quote relbbaddoof Posted January 19, 2025 Posted January 19, 2025 1 hour ago, small h said: the mister's tolerance for stink is essentially zero So is that of whose Mr. I am. But -- I've a vague memory of having said this before -- we got ourselves a daughter who loved Hooligan from 8. That has pitted maternal instincts against stink. All I have had to do is break out the popcorn and watch the Hooligan-in-the-house \"discussion\". Our daughter is no longer with us. (No, no, she's just in New Hampshire.) But I can still play that card when the Hooligan arrives -- it's for fooddabbler-junior I say, and watch my wife wilt. How does that help you? Dunno, but I'm not here to be helpful. 1 Quote MitchW Posted January 19, 2025 Posted January 19, 2025 5 hours ago, relbbaddoof said: $18 for a Boars Head turkey wrap at their market). Are you crazy? https://defector.com/residual-ham-material-usda-inspection-boars-head-plants Quote relbbaddoof Posted January 19, 2025 Posted January 19, 2025 Hey, an eighteen dollar Boar's Head wrap ain't worth the paper $18 is printed on if it doesn't involve an eighteen-hundred dollar trip to the ER. Having said that I have to say I ate one and am alive to tell the tale. I was a bit queasy the day after but it's hard to tell if it was contamination or conscience. The rest of the time we were purish (good cheese, etc., as listed above) -- but we did have that pricey, dry pork chop, a couple of indifferent burgers at the resort (also $18 -- that seemed to be their base price for everything), and a \"Southern dinner\" at a nearby branch of Succotash. I gotta say that Gaylord is barely a motel, let alone a hotel. It's certainly not a resort in any sense of the word. We're not resort people, but we occasionally succumb. We stayed at one in Puerto Vallarta a few years ago where, for prices similar to Gaylord, we were offered massages on arrival, champagne in our room, and a sauna on our large, private deck. And don't get me started on the one in Agra, with a close view of the Taj from the room, and golf carts to schlep us there (an awkward experience for me, who like other men-of-the-people likes the subway). The American Astronomical Society -- naming names again -- has a lot to answer for. Quote Wilfrid Posted January 20, 2025 Author Posted January 20, 2025 I've been to more than conference at the Gaylord in Denver, which is certainly large and has the Rockies in the background. But I always stayed in an airport hotel nearby and at restaurants outside the resort. Quote Wilfrid Posted February 16, 2025 Author Posted February 16, 2025 Manigodine I did not know. Not unlike good Vacherin, wrapped in spruce bark, amazingly creamy and uncontrollably runny. Recommended. Formaggio Essex. Quote Wilfrid Posted May 19, 2025 Author Posted May 19, 2025 When I first moved to New York there was almost nowhere to buy cheese. Okay there was Murray's; there was a place on Eighth Avenue; and you could get Italian cheese at an Italian specialty store. And you would search hard for a cheese course even in the old school French restaurants. Now there are more cheese shops than I can keep up with. I wandered Cobble Hill at the weekend and came across Lea Fromages on Smith Street. French run, nice curation of French cheese and charcuterie, lovely people. And here I am strolling down to Francie, and at that end of Bedford Avenue there's a bijou cheese shop called Eastern Districts. I didn't go in because I am kind of loaded up on cheese right now. Quote relbbaddoof Posted June 4, 2025 Posted June 4, 2025 On 12/15/2024 at 2:31 PM, relbbaddoof said: Cato Corner carries around this time full vertical versions of many of their cheeses. There is still a selection, if not full. At a family meal in honor of my wife, and her major research award from the Smithsonian (she snuck in with her astronomical work days before their mission was shifted from human knowledge to \"american glory\", and Lonnie Bunch, their Director who handed her the prize, was to be attacked by that great intellectual, Steven Cheung), I put out three generations of Vivace, and two each of Bloomsday and Dairyerre. 1 Quote StephanieL Posted June 27, 2025 Posted June 27, 2025 (edited) Found the most gorgeously runny Reblochon at a cheese shop in Salzburg, one evening, which became our dinner when spread on some locally made seeded rolls. It was seriously liquid. Edited June 27, 2025 by StephanieL 1 Quote StephanieL Posted June 28, 2025 Posted June 28, 2025 (edited) This one was pretty good too: https://www.montafon.at/en/my-montafon/special-features/sura-kees Edited June 28, 2025 by StephanieL Quote MitchW Posted July 19, 2025 Posted July 19, 2025 Today was the final day in the Pyrenees at the Tour de France. And I just happened to stop by Formaggio Essex yesterday (they get a lot of stuff on Fridays, evidently). Both the Ekiola and Pardou are fab (the Comté ain't too shabby, either (though I usually buy one with a bit more age)). Quote Anthony Bonner Posted July 19, 2025 Posted July 19, 2025 That ekiola is amazing. I swear sometimes it has a finish of strawberries 1 Quote MitchW Posted July 19, 2025 Posted July 19, 2025 2 hours ago, Anthony Bonner said: That ekiola is amazing. I swear sometimes it has a finish of strawberries And apparently they are the sole importers of it - it's so good and the wheel had just been cut open. From their website: Quote Formaggio Kitchen cheese buyers discovered Ekiola Ardi Gasna back in 2010 on a trip to the Basque Country. Since then it has become an all-time monger and customer favorite. Ardi Gasna or \"sheep's milk cheese\" is produced all over the French Basque region, but Ekiola (roughly translating to \"hut in the sun\") is unusual in that it is a fermier or farmstead cheese. This means that owners Désiré and Kati Loyatho raise their own sheep, make the cheese themselves, AND age it themselves. It is a true farmstead Ossau-Iraty AOP cheese, which is rare to find. Désiré and Kati make their cheese in the small town of Gamarthe, France in the Pyrénées. This is a small sheep dairy (with about 700 sheep). On our most recent trip to visit in June 2022, Désiré was at higher altitudes making summer cheese (known as Fromage d’Estive) in a hut with 300 sheep. He is painstakingly passionate about raising healthy sheep, using the highest quality diverse feed. His cheeses’ flavor and nutritional value reflect his philosophy. Ekiola Ardi Gasna is deliciously bright and fruity, with the sweetness of fresh mountain flowers, wild grass, and a nutty finish. It’s a perfect balance between mild and sharp. Formaggio Kitchen is the only importer of this cheese in the United States, so grab a wedge and be one of a few lucky people in the country to taste this incredibly special cheese. We recommend pairing this cheese with a black cherry jam, as the locals do. Quote Wilfrid Posted October 24, 2025 Author Posted October 24, 2025 Because it's pretty, Brebirousse from Formaggio. 1 Quote StephanieL Posted January 4 Posted January 4 For my most recent birthday, my father gave me a gift card to La Fromagerie, a cheese & sandwich shop with 3 branches in SF. We happened to be near the Marina store, so I bought a dry Norman cider (small bottle) and the following French cheeses, which we sampled this afternoon along with an American-made Fontina with Herbes de Provence: Camembert Fermier: absolutely in top form. While it's made with pasteurized rather than raw milk, it still has the gorgeous mushroom taste and beautiful rind. I'd suspected it was the cause of the funky smell in the cooler bag (and the car, and the refrigerator), but I think the culprit was... Délice des Deux-Sèvres, a small, ash-coated goat cheese. Very creamy pate. N remarked that it appears I like aged goat cheeses better than fresh ones, and she's probably right. Beaufort Alpages: a really nice Alpine raw-milk cheese, firm but not in the crumbly state. $47.99/lb, though. Bleu d'Auvergne: a cheese made for port, this is a brawny, powerhouse blue, possibly a bit too intense. Another raw-milk cheese. We'll probably have the rest with one of our new muscadine jellies. I have enough on the card to get one of their sandwiches and possibly a pastry for a lunch someday--they're a short bus ride from my office. Quote Wilfrid Posted yesterday at 02:06 AM Author Posted yesterday at 02:06 AM Bonne D'Antan, French goat milk and Ekiola Ardi Gasna, Basque sheep's milk. Quote MitchW Posted yesterday at 12:12 PM Posted yesterday at 12:12 PM Ekiola definitely great. As mentioned above, they're the sole importers of the cheese, and it has that lovely fruitiness to it. Quote relbbaddoof Posted 16 hours ago Posted 16 hours ago 10 hours ago, Wilfrid said: Did not know that. You should read MF more often. Quote"
}