{
  "url": "https://support.microsoft.com/pt-br/office/como-entrar-no-hotmail-c378938b-c0eb-40c1-b99e-338dd9e776a8",
  "title": "Como entrar no Hotmail - Suporte da Microsoft",
  "text": "Como entrar no Hotmail Aplica-se a Entre em Hotmail ou Outlook.com Hotmail agora está Outlook.com Para entrar no Hotmail, você precisará do seu nome de usuário e senha da conta Microsoft. Entre em outlook.live.com Dicas: - Se você não puder entrar ou tiver esquecido seu nome de usuário ou senha, use nossa solução de problemas de entrada. - Se você estiver procurando abrir uma nova conta, poderá criar uma no https://signup.live.com/. Solução de problemas: não é possível entrar no Hotmail ou Outlook.com Observações: - Sua senha de Hotmail ou Outlook.com é a mesma que a senha da Conta Microsoft. - Se você puder entrar, mas estiver tendo problemas com Outlook.com, marque o status de serviço. Se o status não for verde, aguarde até que o serviço esteja funcionando normalmente e tente outra vez. - A Microsoft está sempre atenta a atividades incomuns no processo de entrada, apenas para o caso de alguém estar tentando entrar na sua conta. Se você estiver viajando para um novo local ou usando um novo dispositivo, poderemos solicitar que você confirme que realmente é você. Se você não conseguir entrar, experimente a ferramenta de solução de problemas de entrada abaixo ou marcar outras soluções listadas. A conta pode estar temporariamente bloqueada porque percebemos algumas atividades de entrada incomuns. Se a conta estiver bloqueada, confira o artigo Desbloquear uma conta do Outlook.com. A Microsoft está sempre atenta a atividades incomuns no processo de entrada, apenas para o caso de alguém estar tentando entrar na sua conta. Se você estiver viajando para um novo local ou usando um novo dispositivo, poderemos solicitar que você confirme que realmente é você. Para mais informações, leia Como acessar Outlook.com quando estiver viajando. O Hotmail agora está Outlook.com. Para entrar em sua conta do Hotmail, acesse www.outlook.com e selecione Entrar. Se você esqueceu seu nome de usuário ou senha, use nossa solução de problemas de entrada, mas observe que se você não entrou em sua conta por mais de dois anos, sua conta poderá ter sido excluída. A experiência de logon do navegador da Web será alterada quando você entrar em qualquer produto ou serviço usando sua conta Microsoft. A partir de fevereiro de 2025, você permanecerá conectado automaticamente, a menos que saia ou use a navegação privada. Se você usar o Outlook em seu próprio computador, seu navegador lembrará de suas informações de entrada, mas se você entrar em um computador, telefone ou tablet que não pertence a você ou for acessado por outras pessoas, você deverá seguir as etapas abaixo para usar uma janela de navegação privada. A navegação privada garante que outras pessoas não poderão: - Acessar sua conta Microsoft, OneDrive ou caixa de correio do Outlook.com. - Ver seu histórico de pesquisa e navegação. Para sair do Outlook em um navegador da Web, selecione sua imagem de perfil e selecione Sair. Como alternativa, você pode sair manualmente abaixo. Dica: Sempre feche todas as janelas do navegador após sair. Se você não tiver mais acesso a um dispositivo em que estava conectado, leiaComo sair de todos os lugares. Confira também Introdução ao novo Outlook para Windows Gerenciar as contas de email no Outlook.com Desbloquear a minha conta do Outlook.com Navegadores compatíveis com o Outlook na web e o Outlook.com Se você entrar com uma conta corporativa ou de estudante, leia Como entrar no Outlook na Web"
}