{
  "url": "https://comparaiso.com.co/servicio-cliente/claro",
  "title": "Atención al cliente Claro Colombia teléfonos y centros",
  "text": "Teléfonos y atención al cliente Claro en Colombia Las líneas de atención de Claro son opciones rápidas y efectivas para resolver tus dudas y gestionar tus trámites. Lo mejor es que puedes hacer las consultas desde tu celular, ya sea por la app Mi Claro o a través de WhatsApp al 311 200 0000. Números de Claro Claro ofrece atención en horarios de oficina, de 8:00am a 5:00pm de lunes a domingo. Lo cual te puede resultar muy útil para resolver problemas relacionados con los servicios hogar Claro o incluso si eres cliente de otro operador, hacer la portabilidad a Claro. Número de WhatsApp de Claro Esta línea de atención Claro brinda servicio inmediato las 24 horas del día, los 7 días a la semana. Para ello, solo debes proporcionar los datos solicitados y un bot especializado dará solución a tu requerimiento. Aquí te recomendamos que manejes una comunicación muy clara y puntual para que las respuestas sean lo más acertadas posible. Lo que sí debes tener en cuenta es que esta línea es solo para WhatsApp, por lo que si pensabas que este era un número para llamar a Claro te equivocas, ya que no recibirás respuesta. ¿Cómo comunicarte por WhatsApp con Claro? - Guarda el número en los contactos de tu celular o ingresa desde el navegador de internet - Escribe una palabra o frase corta para iniciar el chat - En segundos, recibirás un saludo y los principales temas que puedes consultar por medio de ese canal - Elige entre las opciones el que mejor se adecúe a tu solicitud. También puedes elegir la opción ‘Menú principal’ para ver más opciones - Y listo, solo tienes que seguir los pasos que te arroja el bot Centros de atención Claro Si prefieres atención presencial, puedes visitar cualquier punto de servicio Claro en el país. Para ello, te recomendamos que cuentes con tiempo suficiente para esperar a que un asesor te atienda. Sin embargo, esta es una excelente oportunidad para dar solución a tus solicitudes e iniciar trámites con el operador. ¿Cómo instaurar una PQR? Una de las formas más sencillas de presentar una solicitud, queja o reclamo por medio de los números de Claro especializados para reclamos: Una vez te comuniques con un asesor, solo tienes que hacerle saber que quieres instaurar una PQR y este tomará nota de tu solicitud. Otros canales disponibles para radicar una PQR son: - La app Mi Claro - Directamente en el link del operador minisitiosclaro.claro.com.co/PQRWeb/ - Enviando un correo electrónico a [email protected] - Acercándote a un CAV - O por medio de las redes sociales de la compañía Y, para consultar el estado de tu PQR puedes hacerlo a través de Mi Claro o a través del link del operador https://minisitiosclaro.claro.com.co/PQRWeb/QueryCun.aspx Soporte técnico Claro En caso de que tus servicios de internet Claro, pospago Claro u otros presenten alguna inconsistencia solicitar soporte Claro hogar a través de: - Escribir a la línea de WhatsApp y explicar cuál es tu falla. Allí serás atendido por un asesor que te pedirá tus datos e intentará resolver tu solicitud remotamente. En caso de que no se solucione, te programará una visita de soporte técnico Claro. - Ingresa a la app Mi Claro y dirígete al módulo ‘Atención al cliente y soporte’ y reporta que el servicio no está funcionando correctamente. - Comunícate a las líneas de atención en Bogotá 6017441818 y 601750050 o desde cualquier lugar del país al 01 8000 341818 o desde tu celular al *611. ¿Qué puedes gestionar desde la app Mi Claro? Si necesitas consultar algo sobre tus servicios móviles tienes la opción de hacer recargas Claro, pagar tu factura, comprar paquetes prepago Claro, consultar los detalles de tu consumo, gestionar tu equipo, adelantar saldo y más. Si eres cliente hogar también cuentas con varias opciones como pagar tu recibo, cambiar la clave de tu WiFI, hacer seguimiento de visitas técnicas, reiniciar tu módem, solicitar servicios técnicos, entre otros. Y, además puedes encontrar acceso a la tienda Claro, Claro música, Claro video, Claro gaming, Cloud, Claro Drive, Claro club y más opciones de entretenimiento como poder hacer la suscripción a las plataformas de streaming. Preguntas Frecuentes ¿Cuál es el número para cancelar Claro? Llama en Bogotá al 6017441818 y 601750050 o desde cualquier lugar del país al 01 8000 341818 o desde tu celular al *611 ¿Cuál es el número de quejas y reclamos de Claro? Lo más sencillo es que llames desde tu celular al *611 y seguir el menú hasta que encuentres la opción de instaurar una PQR. ¿Puedes hacer reclamos a través de redes sociales? Sí, Claro ofrece atención a través de sus redes sociales oficiales."
}