{
  "url": "https://chernogolovka.com/",
  "title": "Черноголовка — производитель напитков, снеков и кондитерских изделий в России - Главная",
  "text": "Открой для себя энергетик X-Turbo, представленный в трех линейках: Focus, Active и Party. Уникальный микс в каждой линейке обеспечивает максимальный эффект. X-Turbo — это мощь внутри тебя, готовая зажигать в любой момент. Выбери свою линейку и наслаждайся энергией X-Turbo! ПродуктыТе самые легендарные лимонады, которыми уже более 25 лет наслаждаются люди по всей стране. Эти незабываемые вкусы у большинства ассоциируются с детством, праздниками и просто приятными моментами. А получаются лимонады такими особенными благодаря натуральным ингредиентам в составе. Они созданы на основе артезианской воды и настоев трав и фруктов, собранных по всей территории нашей страны. Подарите себе вкус радости! ПродуктыВсеми любимая кола, но с особенными нотами во вкусе! Мы делаем нашу колу на основе специально подготовленной артезианской воды, кофеина — для бодрости и карамельного колера — для насыщенного приятного цвета, добавляем авторскую композицию натуральных ароматизаторов и создаем две версии — колу с сахаром и без него. Этот незабываемый вкус наполнит радостью, подарит потрясающее настроение и освежит в самый жаркий день! Попробуйте нашу колу – колу с тем самым особым вкусом! ПродуктыВкусный натуральный, освежающий, холодный чай, приготовленный на основе свежезаваренного зеленого чая и с яркими ароматами лайма и мяты или лимона и лайма. Такое сочетание даёт интересный и яркий вкус, который прекрасно освежает в самый жаркий день! Extra вдохновляет людей отдаваться удовольствию полностью. Гранола и печенье Extra – это уникальное сочетание запеченных злаковых кусочков и ингредиентов премиум-класса, которые доставляют невероятное наслаждение. Твоё Extra удовольствие! «Черноголовка» — вода для современных людей, живущих в режиме многозадачности, которым мы предлагаем воду, прошедшую природную фильтрацию, дающую вкус живой природы в городе и переключающую на природное состояние, в котором чувствуешь правильный выбор и находишь свой естественный путь. «Черноголовка» — верный выбор от природы! Готовые завтраки Mätti — это идеальное сочетание простых ингредиентов для того, чтобы каждое утро стало счастливым! ПродуктыЦельные злаки – основной ингредиент всех наших продуктов, ценный источник медленных углеводов и клетчатки, зарядит вас энергией для новых свершений. Фрукты и ягоды – бережно обработанные по специальной технологии сублимации, сохраняют витамины и минералы. Это очень важно для поддержания иммунитета и отличного самочувствия. ДЕТСКОЕ ПИТАНИЕ GIPOPO – это продуманная экспертами система питания, учитывающая ключевые потребности малыша на каждом этапе его развития. Широкий ассортимент продуктов разработан с учетом возрастных особенностей и предпочтений каждого ребенка и включает в себя: сухие каши, жидкие кашки, фруктовые, овощные, мясные и мясорастительные пюре, снеки. Линейка воды с мягкой газацией ЧЕРНОГОЛОВКА H2FRUIT - НОВИНКА от экспертов во вкусе, создателей всеми любимых лимонадов Черноголовка, на базе чистейшей артезианской воды с соком и витаминами в уникальных трендовых миксах вкусов. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Запечённые чипсы Cheesl's - аппетитная новинка в мире чипсов! Мы делаем вкус Cheesl’s по-настоящему сырным благодаря оригинальной технологии производства, в которой настоящий сыр добавляется внутрь каждого кусочка, а инновационный процесс запекания и уникальная форма позволяют ощутить особую хрусткость. Запеченные чипсы Cheesl's со 100% настоящим сыром - созданы для сырных моментов и хрустящих впечатлений! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Этот вкус любят все. Он главный гость на каждой вечеринке и всегда в центре внимания. Он помогает заговорить с любым гостем и начать танцевать в ритм музыки. Бывает с сахаром и без. Идеален сам по себе, но еще отлично сочетается с другими ингредиентами в коктейлях! Миксуйте, пробуйте! Лимонад для самых стильных, модных и ярких! В линейке Fantola есть классические, знакомые вкусы колы и апельсина, удивительный освежающий микс лимона и лайма, а также самый неожиданный вкус — Bubble Gum. Благодаря этим ярким игристым бутылочкам любой момент жизни становится еще более красочным и свежим. Не веришь? Просто сделай глоток и посмотри, как тебе захлестнет волна классных эмоций! Сristelle – тот случай, когда внутреннее содержание полностью соответствует идеальной форме. С такой природной водой приятно провести вечер в ресторане, небольшой отпуск в элегантном отеле или… совершить полёт бизнес-классом. Над дизайном бутылки Cristelle поработали итальянские мастера дизайна. Над внутренним содержанием - природа. Как утверждают геологи, ещё 300 миллионов лет назад. Cosmos - это космическая энергия, воплощённая в оригинальном и тропическом вкусах. В составе сочетаются кофеин, таурин и витамины группы B, а экстракты гуавы и женьшеня дополняют композицию, придавая напитку уникальный вкус и дополнительные полезные свойства. Почувствуй космическую энергию в каждой капле — выбери Cosmos для ярких достижений и новых горизонтов! ПродуктыМожно ли пить энергетики и вести здоровый образ жизни? Конечно! Энергетические напитки БАЙКАЛ natural energy — натуральные энергетические напитки нового поколения с естественными вкусами. Только природные источники бодрости: натуральный кофеин, элеутерококк и соки, без таурина и консервантов, с витаминами группы В, которые помогают бороться с усталостью. Попробуйте натуральную энергию Байкала! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Такие вкусные и необычные, наполненные удовольствием продукты EXTRASI придают экстра ценность моментам жизни каждый день. EXTRASI - скажи удовольствию ДА! Для всех фанатов самых шипучих шипучек! Тысячи пузырьков в бутылочке «FUN кола» подчеркнут насыщенный вкус любимого миллионами напитка, а игристый «Буратино» перенесет всех в беззаботное веселое детство. Те, кто уже попробовал эти напитки, знают — весь FUN начинается с «Пшш…». ПродуктыМы создали Chocozavr для самых больших ценителей шоколадных готовых завтраков. Хрустящие подушечки с нежнейшей начинкой или фигурки «Шоксики» с настоящим шоколадом – вот секрет потрясающе вкусного и питательного завтрака. А еще, подушечки идеально подходят как самостоятельный перекус или десерт к чаю. Утоли свою жажду шоколада! Обычные, рифленые или соломкой — какие ваши любимые чипсы? В линейке Fry´s есть натуральные картофельные чипсы любой формы и вкуса! Любителям всего поострее понравятся чипсы васаби, чили или горчица. Ценителям изысканных вкусов подойдут Fry´s с крабом или с лососем в сливочном соусе. А почитателям классики — с сыром, солью или с зеленым луком. ПродуктыЧипсы Bon Giorno – это коллекция разнообразных изысканных вкусов, вдохновленных путешествиями в разные страны, которые добавят хрустящего удовольствия и приятной атмосферы любым моментам вашей жизни. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Настоящее вкусовое комбо! В пачках Chaka — смесь орешков, печеных зерен кукурузы и хрустящих чаксов. Миксуйте их по-разному между собой и получайте каждый раз новые вкусовые сочетания! А для особых любителей арахиса мы создали отдельные пачки: арахис с сыром, беконом, вареными раками или классический — с солью. Сухарики по старинным русским рецептам придутся по вкусу всем богатырям и честным молодцам! Тем, кто любит все самое традиционное, понравятся крутецы с холодцом и хреном или красной икоркой. Тем, кому хочется чего-то новенького, стоит попробовать сухарики со спайси томатом или копченым кальмаром. А лучше все это миксовать! Для этого мы специально придумали особые крутецкие комбо. ПродуктыВ ассортименте нашей компании есть сиропы для приготовления безалкогольных напитков в разливном охлажденном виде. Это отличное решение для кафе, баров, ресторанов и кинотеатров! Вся польза Алтая в одном маленьком батончике! Перекус из цельных злаков от «БИОКЕЙ» — это только натуральные ингредиенты, клетчатка, микроэлементы, пищевые волокна и витамины группы B. А еще 4 разных вкуса! Полезная для иммунитета куркума и абрикос, сладкая клубника, питательный кокос и витаминная черника. ПродуктыБолее 100 лет назад купец Савинов основал кондитерскую фабрику, чтобы радовать людей вкусными конфетами. Кондитерская фабрика «Алтай» продолжает дело кондитера Савинова, соблюдая главный принцип его работы: пробовать новое и сохранять самое вкусное. «Савинов» сделает любой день вкуснее, все дело в конфетах! Мы понимаем, как важно для родителей заботиться о малышах, об их правильном питании каждый день. «Черноголовка Бэйби» — это вкусное и полезное детское питание высокого качества, созданное с заботой о малышах и их родителях. Наш ассортимент — это фруктовые пюре, соки, фрикадельки, питьевые кашки и вода для самых маленьких. В основе наших продуктов только качественные натуральные ингредиенты, без красителей, консервантов и ГМО. Для малышей с заботой от «Черноголовка Бэйби»! Открой для себя энергетик X-Turbo, представленный в трех линейках: Focus, Active и Party. Уникальный микс в каждой линейке обеспечивает максимальный эффект. X-Turbo — это мощь внутри тебя, готовая зажигать в любой момент. Выбери свою линейку и наслаждайся энергией X-Turbo! ПродуктыТе самые легендарные лимонады, которыми уже более 25 лет наслаждаются люди по всей стране. Эти незабываемые вкусы у большинства ассоциируются с детством, праздниками и просто приятными моментами. А получаются лимонады такими особенными благодаря натуральным ингредиентам в составе. Они созданы на основе артезианской воды и настоев трав и фруктов, собранных по всей территории нашей страны. Подарите себе вкус радости! ПродуктыВсеми любимая кола, но с особенными нотами во вкусе! Мы делаем нашу колу на основе специально подготовленной артезианской воды, кофеина — для бодрости и карамельного колера — для насыщенного приятного цвета, добавляем авторскую композицию натуральных ароматизаторов и создаем две версии — колу с сахаром и без него. Этот незабываемый вкус наполнит радостью, подарит потрясающее настроение и освежит в самый жаркий день! Попробуйте нашу колу – колу с тем самым особым вкусом! ПродуктыВкусный натуральный, освежающий, холодный чай, приготовленный на основе свежезаваренного зеленого чая и с яркими ароматами лайма и мяты или лимона и лайма. Такое сочетание даёт интересный и яркий вкус, который прекрасно освежает в самый жаркий день! Extra вдохновляет людей отдаваться удовольствию полностью. Гранола и печенье Extra – это уникальное сочетание запеченных злаковых кусочков и ингредиентов премиум-класса, которые доставляют невероятное наслаждение. Твоё Extra удовольствие! «Черноголовка» — вода для современных людей, живущих в режиме многозадачности, которым мы предлагаем воду, прошедшую природную фильтрацию, дающую вкус живой природы в городе и переключающую на природное состояние, в котором чувствуешь правильный выбор и находишь свой естественный путь. «Черноголовка» — верный выбор от природы! Готовые завтраки Mätti — это идеальное сочетание простых ингредиентов для того, чтобы каждое утро стало счастливым! ПродуктыЦельные злаки – основной ингредиент всех наших продуктов, ценный источник медленных углеводов и клетчатки, зарядит вас энергией для новых свершений. Фрукты и ягоды – бережно обработанные по специальной технологии сублимации, сохраняют витамины и минералы. Это очень важно для поддержания иммунитета и отличного самочувствия. ДЕТСКОЕ ПИТАНИЕ GIPOPO – это продуманная экспертами система питания, учитывающая ключевые потребности малыша на каждом этапе его развития. Широкий ассортимент продуктов разработан с учетом возрастных особенностей и предпочтений каждого ребенка и включает в себя: сухие каши, жидкие кашки, фруктовые, овощные, мясные и мясорастительные пюре, снеки. Линейка воды с мягкой газацией ЧЕРНОГОЛОВКА H2FRUIT - НОВИНКА от экспертов во вкусе, создателей всеми любимых лимонадов Черноголовка, на базе чистейшей артезианской воды с соком и витаминами в уникальных трендовых миксах вкусов. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Запечённые чипсы Cheesl's - аппетитная новинка в мире чипсов! Мы делаем вкус Cheesl’s по-настоящему сырным благодаря оригинальной технологии производства, в которой настоящий сыр добавляется внутрь каждого кусочка, а инновационный процесс запекания и уникальная форма позволяют ощутить особую хрусткость. Запеченные чипсы Cheesl's со 100% настоящим сыром - созданы для сырных моментов и хрустящих впечатлений! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Этот вкус любят все. Он главный гость на каждой вечеринке и всегда в центре внимания. Он помогает заговорить с любым гостем и начать танцевать в ритм музыки. Бывает с сахаром и без. Идеален сам по себе, но еще отлично сочетается с другими ингредиентами в коктейлях! Миксуйте, пробуйте! Лимонад для самых стильных, модных и ярких! В линейке Fantola есть классические, знакомые вкусы колы и апельсина, удивительный освежающий микс лимона и лайма, а также самый неожиданный вкус — Bubble Gum. Благодаря этим ярким игристым бутылочкам любой момент жизни становится еще более красочным и свежим. Не веришь? Просто сделай глоток и посмотри, как тебе захлестнет волна классных эмоций! Сristelle – тот случай, когда внутреннее содержание полностью соответствует идеальной форме. С такой природной водой приятно провести вечер в ресторане, небольшой отпуск в элегантном отеле или… совершить полёт бизнес-классом. Над дизайном бутылки Cristelle поработали итальянские мастера дизайна. Над внутренним содержанием - природа. Как утверждают геологи, ещё 300 миллионов лет назад. Cosmos - это космическая энергия, воплощённая в оригинальном и тропическом вкусах. В составе сочетаются кофеин, таурин и витамины группы B, а экстракты гуавы и женьшеня дополняют композицию, придавая напитку уникальный вкус и дополнительные полезные свойства. Почувствуй космическую энергию в каждой капле — выбери Cosmos для ярких достижений и новых горизонтов! ПродуктыМожно ли пить энергетики и вести здоровый образ жизни? Конечно! Энергетические напитки БАЙКАЛ natural energy — натуральные энергетические напитки нового поколения с естественными вкусами. Только природные источники бодрости: натуральный кофеин, элеутерококк и соки, без таурина и консервантов, с витаминами группы В, которые помогают бороться с усталостью. Попробуйте натуральную энергию Байкала! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Такие вкусные и необычные, наполненные удовольствием продукты EXTRASI придают экстра ценность моментам жизни каждый день. EXTRASI - скажи удовольствию ДА! Для всех фанатов самых шипучих шипучек! Тысячи пузырьков в бутылочке «FUN кола» подчеркнут насыщенный вкус любимого миллионами напитка, а игристый «Буратино» перенесет всех в беззаботное веселое детство. Те, кто уже попробовал эти напитки, знают — весь FUN начинается с «Пшш…». ПродуктыМы создали Chocozavr для самых больших ценителей шоколадных готовых завтраков. Хрустящие подушечки с нежнейшей начинкой или фигурки «Шоксики» с настоящим шоколадом – вот секрет потрясающе вкусного и питательного завтрака. А еще, подушечки идеально подходят как самостоятельный перекус или десерт к чаю. Утоли свою жажду шоколада! Обычные, рифленые или соломкой — какие ваши любимые чипсы? В линейке Fry´s есть натуральные картофельные чипсы любой формы и вкуса! Любителям всего поострее понравятся чипсы васаби, чили или горчица. Ценителям изысканных вкусов подойдут Fry´s с крабом или с лососем в сливочном соусе. А почитателям классики — с сыром, солью или с зеленым луком. ПродуктыЧипсы Bon Giorno – это коллекция разнообразных изысканных вкусов, вдохновленных путешествиями в разные страны, которые добавят хрустящего удовольствия и приятной атмосферы любым моментам вашей жизни. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Настоящее вкусовое комбо! В пачках Chaka — смесь орешков, печеных зерен кукурузы и хрустящих чаксов. Миксуйте их по-разному между собой и получайте каждый раз новые вкусовые сочетания! А для особых любителей арахиса мы создали отдельные пачки: арахис с сыром, беконом, вареными раками или классический — с солью. Сухарики по старинным русским рецептам придутся по вкусу всем богатырям и честным молодцам! Тем, кто любит все самое традиционное, понравятся крутецы с холодцом и хреном или красной икоркой. Тем, кому хочется чего-то новенького, стоит попробовать сухарики со спайси томатом или копченым кальмаром. А лучше все это миксовать! Для этого мы специально придумали особые крутецкие комбо. ПродуктыВ ассортименте нашей компании есть сиропы для приготовления безалкогольных напитков в разливном охлажденном виде. Это отличное решение для кафе, баров, ресторанов и кинотеатров! Вся польза Алтая в одном маленьком батончике! Перекус из цельных злаков от «БИОКЕЙ» — это только натуральные ингредиенты, клетчатка, микроэлементы, пищевые волокна и витамины группы B. А еще 4 разных вкуса! Полезная для иммунитета куркума и абрикос, сладкая клубника, питательный кокос и витаминная черника. ПродуктыБолее 100 лет назад купец Савинов основал кондитерскую фабрику, чтобы радовать людей вкусными конфетами. Кондитерская фабрика «Алтай» продолжает дело кондитера Савинова, соблюдая главный принцип его работы: пробовать новое и сохранять самое вкусное. «Савинов» сделает любой день вкуснее, все дело в конфетах! Мы понимаем, как важно для родителей заботиться о малышах, об их правильном питании каждый день. «Черноголовка Бэйби» — это вкусное и полезное детское питание высокого качества, созданное с заботой о малышах и их родителях. Наш ассортимент — это фруктовые пюре, соки, фрикадельки, питьевые кашки и вода для самых маленьких. В основе наших продуктов только качественные натуральные ингредиенты, без красителей, консервантов и ГМО. Для малышей с заботой от «Черноголовка Бэйби»! Открой для себя энергетик X-Turbo, представленный в трех линейках: Focus, Active и Party. Уникальный микс в каждой линейке обеспечивает максимальный эффект. X-Turbo — это мощь внутри тебя, готовая зажигать в любой момент. Выбери свою линейку и наслаждайся энергией X-Turbo! ПродуктыТе самые легендарные лимонады, которыми уже более 25 лет наслаждаются люди по всей стране. Эти незабываемые вкусы у большинства ассоциируются с детством, праздниками и просто приятными моментами. А получаются лимонады такими особенными благодаря натуральным ингредиентам в составе. Они созданы на основе артезианской воды и настоев трав и фруктов, собранных по всей территории нашей страны. Подарите себе вкус радости! ПродуктыВсеми любимая кола, но с особенными нотами во вкусе! Мы делаем нашу колу на основе специально подготовленной артезианской воды, кофеина — для бодрости и карамельного колера — для насыщенного приятного цвета, добавляем авторскую композицию натуральных ароматизаторов и создаем две версии — колу с сахаром и без него. Этот незабываемый вкус наполнит радостью, подарит потрясающее настроение и освежит в самый жаркий день! Попробуйте нашу колу – колу с тем самым особым вкусом! ПродуктыВкусный натуральный, освежающий, холодный чай, приготовленный на основе свежезаваренного зеленого чая и с яркими ароматами лайма и мяты или лимона и лайма. Такое сочетание даёт интересный и яркий вкус, который прекрасно освежает в самый жаркий день! Extra вдохновляет людей отдаваться удовольствию полностью. Гранола и печенье Extra – это уникальное сочетание запеченных злаковых кусочков и ингредиентов премиум-класса, которые доставляют невероятное наслаждение. Твоё Extra удовольствие! «Черноголовка» — вода для современных людей, живущих в режиме многозадачности, которым мы предлагаем воду, прошедшую природную фильтрацию, дающую вкус живой природы в городе и переключающую на природное состояние, в котором чувствуешь правильный выбор и находишь свой естественный путь. «Черноголовка» — верный выбор от природы! Готовые завтраки Mätti — это идеальное сочетание простых ингредиентов для того, чтобы каждое утро стало счастливым! ПродуктыЦельные злаки – основной ингредиент всех наших продуктов, ценный источник медленных углеводов и клетчатки, зарядит вас энергией для новых свершений. Фрукты и ягоды – бережно обработанные по специальной технологии сублимации, сохраняют витамины и минералы. Это очень важно для поддержания иммунитета и отличного самочувствия. ДЕТСКОЕ ПИТАНИЕ GIPOPO – это продуманная экспертами система питания, учитывающая ключевые потребности малыша на каждом этапе его развития. Широкий ассортимент продуктов разработан с учетом возрастных особенностей и предпочтений каждого ребенка и включает в себя: сухие каши, жидкие кашки, фруктовые, овощные, мясные и мясорастительные пюре, снеки. Линейка воды с мягкой газацией ЧЕРНОГОЛОВКА H2FRUIT - НОВИНКА от экспертов во вкусе, создателей всеми любимых лимонадов Черноголовка, на базе чистейшей артезианской воды с соком и витаминами в уникальных трендовых миксах вкусов. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Запечённые чипсы Cheesl's - аппетитная новинка в мире чипсов! Мы делаем вкус Cheesl’s по-настоящему сырным благодаря оригинальной технологии производства, в которой настоящий сыр добавляется внутрь каждого кусочка, а инновационный процесс запекания и уникальная форма позволяют ощутить особую хрусткость. Запеченные чипсы Cheesl's со 100% настоящим сыром - созданы для сырных моментов и хрустящих впечатлений! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Этот вкус любят все. Он главный гость на каждой вечеринке и всегда в центре внимания. Он помогает заговорить с любым гостем и начать танцевать в ритм музыки. Бывает с сахаром и без. Идеален сам по себе, но еще отлично сочетается с другими ингредиентами в коктейлях! Миксуйте, пробуйте! Лимонад для самых стильных, модных и ярких! В линейке Fantola есть классические, знакомые вкусы колы и апельсина, удивительный освежающий микс лимона и лайма, а также самый неожиданный вкус — Bubble Gum. Благодаря этим ярким игристым бутылочкам любой момент жизни становится еще более красочным и свежим. Не веришь? Просто сделай глоток и посмотри, как тебе захлестнет волна классных эмоций! Сristelle – тот случай, когда внутреннее содержание полностью соответствует идеальной форме. С такой природной водой приятно провести вечер в ресторане, небольшой отпуск в элегантном отеле или… совершить полёт бизнес-классом. Над дизайном бутылки Cristelle поработали итальянские мастера дизайна. Над внутренним содержанием - природа. Как утверждают геологи, ещё 300 миллионов лет назад. Cosmos - это космическая энергия, воплощённая в оригинальном и тропическом вкусах. В составе сочетаются кофеин, таурин и витамины группы B, а экстракты гуавы и женьшеня дополняют композицию, придавая напитку уникальный вкус и дополнительные полезные свойства. Почувствуй космическую энергию в каждой капле — выбери Cosmos для ярких достижений и новых горизонтов! ПродуктыМожно ли пить энергетики и вести здоровый образ жизни? Конечно! Энергетические напитки БАЙКАЛ natural energy — натуральные энергетические напитки нового поколения с естественными вкусами. Только природные источники бодрости: натуральный кофеин, элеутерококк и соки, без таурина и консервантов, с витаминами группы В, которые помогают бороться с усталостью. Попробуйте натуральную энергию Байкала! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Такие вкусные и необычные, наполненные удовольствием продукты EXTRASI придают экстра ценность моментам жизни каждый день. EXTRASI - скажи удовольствию ДА! Для всех фанатов самых шипучих шипучек! Тысячи пузырьков в бутылочке «FUN кола» подчеркнут насыщенный вкус любимого миллионами напитка, а игристый «Буратино» перенесет всех в беззаботное веселое детство. Те, кто уже попробовал эти напитки, знают — весь FUN начинается с «Пшш…». ПродуктыМы создали Chocozavr для самых больших ценителей шоколадных готовых завтраков. Хрустящие подушечки с нежнейшей начинкой или фигурки «Шоксики» с настоящим шоколадом – вот секрет потрясающе вкусного и питательного завтрака. А еще, подушечки идеально подходят как самостоятельный перекус или десерт к чаю. Утоли свою жажду шоколада! Обычные, рифленые или соломкой — какие ваши любимые чипсы? В линейке Fry´s есть натуральные картофельные чипсы любой формы и вкуса! Любителям всего поострее понравятся чипсы васаби, чили или горчица. Ценителям изысканных вкусов подойдут Fry´s с крабом или с лососем в сливочном соусе. А почитателям классики — с сыром, солью или с зеленым луком. ПродуктыЧипсы Bon Giorno – это коллекция разнообразных изысканных вкусов, вдохновленных путешествиями в разные страны, которые добавят хрустящего удовольствия и приятной атмосферы любым моментам вашей жизни. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Настоящее вкусовое комбо! В пачках Chaka — смесь орешков, печеных зерен кукурузы и хрустящих чаксов. Миксуйте их по-разному между собой и получайте каждый раз новые вкусовые сочетания! А для особых любителей арахиса мы создали отдельные пачки: арахис с сыром, беконом, вареными раками или классический — с солью. Сухарики по старинным русским рецептам придутся по вкусу всем богатырям и честным молодцам! Тем, кто любит все самое традиционное, понравятся крутецы с холодцом и хреном или красной икоркой. Тем, кому хочется чего-то новенького, стоит попробовать сухарики со спайси томатом или копченым кальмаром. А лучше все это миксовать! Для этого мы специально придумали особые крутецкие комбо. ПродуктыВ ассортименте нашей компании есть сиропы для приготовления безалкогольных напитков в разливном охлажденном виде. Это отличное решение для кафе, баров, ресторанов и кинотеатров! Вся польза Алтая в одном маленьком батончике! Перекус из цельных злаков от «БИОКЕЙ» — это только натуральные ингредиенты, клетчатка, микроэлементы, пищевые волокна и витамины группы B. А еще 4 разных вкуса! Полезная для иммунитета куркума и абрикос, сладкая клубника, питательный кокос и витаминная черника. ПродуктыБолее 100 лет назад купец Савинов основал кондитерскую фабрику, чтобы радовать людей вкусными конфетами. Кондитерская фабрика «Алтай» продолжает дело кондитера Савинова, соблюдая главный принцип его работы: пробовать новое и сохранять самое вкусное. «Савинов» сделает любой день вкуснее, все дело в конфетах! Мы понимаем, как важно для родителей заботиться о малышах, об их правильном питании каждый день. «Черноголовка Бэйби» — это вкусное и полезное детское питание высокого качества, созданное с заботой о малышах и их родителях. Наш ассортимент — это фруктовые пюре, соки, фрикадельки, питьевые кашки и вода для самых маленьких. В основе наших продуктов только качественные натуральные ингредиенты, без красителей, консервантов и ГМО. Для малышей с заботой от «Черноголовка Бэйби»! Открой для себя энергетик X-Turbo, представленный в трех линейках: Focus, Active и Party. Уникальный микс в каждой линейке обеспечивает максимальный эффект. X-Turbo — это мощь внутри тебя, готовая зажигать в любой момент. Выбери свою линейку и наслаждайся энергией X-Turbo! ПродуктыТе самые легендарные лимонады, которыми уже более 25 лет наслаждаются люди по всей стране. Эти незабываемые вкусы у большинства ассоциируются с детством, праздниками и просто приятными моментами. А получаются лимонады такими особенными благодаря натуральным ингредиентам в составе. Они созданы на основе артезианской воды и настоев трав и фруктов, собранных по всей территории нашей страны. Подарите себе вкус радости! ПродуктыВсеми любимая кола, но с особенными нотами во вкусе! Мы делаем нашу колу на основе специально подготовленной артезианской воды, кофеина — для бодрости и карамельного колера — для насыщенного приятного цвета, добавляем авторскую композицию натуральных ароматизаторов и создаем две версии — колу с сахаром и без него. Этот незабываемый вкус наполнит радостью, подарит потрясающее настроение и освежит в самый жаркий день! Попробуйте нашу колу – колу с тем самым особым вкусом! ПродуктыВкусный натуральный, освежающий, холодный чай, приготовленный на основе свежезаваренного зеленого чая и с яркими ароматами лайма и мяты или лимона и лайма. Такое сочетание даёт интересный и яркий вкус, который прекрасно освежает в самый жаркий день! Extra вдохновляет людей отдаваться удовольствию полностью. Гранола и печенье Extra – это уникальное сочетание запеченных злаковых кусочков и ингредиентов премиум-класса, которые доставляют невероятное наслаждение. Твоё Extra удовольствие! «Черноголовка» — вода для современных людей, живущих в режиме многозадачности, которым мы предлагаем воду, прошедшую природную фильтрацию, дающую вкус живой природы в городе и переключающую на природное состояние, в котором чувствуешь правильный выбор и находишь свой естественный путь. «Черноголовка» — верный выбор от природы! Готовые завтраки Mätti — это идеальное сочетание простых ингредиентов для того, чтобы каждое утро стало счастливым! ПродуктыЦельные злаки – основной ингредиент всех наших продуктов, ценный источник медленных углеводов и клетчатки, зарядит вас энергией для новых свершений. Фрукты и ягоды – бережно обработанные по специальной технологии сублимации, сохраняют витамины и минералы. Это очень важно для поддержания иммунитета и отличного самочувствия. ДЕТСКОЕ ПИТАНИЕ GIPOPO – это продуманная экспертами система питания, учитывающая ключевые потребности малыша на каждом этапе его развития. Широкий ассортимент продуктов разработан с учетом возрастных особенностей и предпочтений каждого ребенка и включает в себя: сухие каши, жидкие кашки, фруктовые, овощные, мясные и мясорастительные пюре, снеки. Линейка воды с мягкой газацией ЧЕРНОГОЛОВКА H2FRUIT - НОВИНКА от экспертов во вкусе, создателей всеми любимых лимонадов Черноголовка, на базе чистейшей артезианской воды с соком и витаминами в уникальных трендовых миксах вкусов. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Запечённые чипсы Cheesl's - аппетитная новинка в мире чипсов! Мы делаем вкус Cheesl’s по-настоящему сырным благодаря оригинальной технологии производства, в которой настоящий сыр добавляется внутрь каждого кусочка, а инновационный процесс запекания и уникальная форма позволяют ощутить особую хрусткость. Запеченные чипсы Cheesl's со 100% настоящим сыром - созданы для сырных моментов и хрустящих впечатлений! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Этот вкус любят все. Он главный гость на каждой вечеринке и всегда в центре внимания. Он помогает заговорить с любым гостем и начать танцевать в ритм музыки. Бывает с сахаром и без. Идеален сам по себе, но еще отлично сочетается с другими ингредиентами в коктейлях! Миксуйте, пробуйте! Лимонад для самых стильных, модных и ярких! В линейке Fantola есть классические, знакомые вкусы колы и апельсина, удивительный освежающий микс лимона и лайма, а также самый неожиданный вкус — Bubble Gum. Благодаря этим ярким игристым бутылочкам любой момент жизни становится еще более красочным и свежим. Не веришь? Просто сделай глоток и посмотри, как тебе захлестнет волна классных эмоций! Сristelle – тот случай, когда внутреннее содержание полностью соответствует идеальной форме. С такой природной водой приятно провести вечер в ресторане, небольшой отпуск в элегантном отеле или… совершить полёт бизнес-классом. Над дизайном бутылки Cristelle поработали итальянские мастера дизайна. Над внутренним содержанием - природа. Как утверждают геологи, ещё 300 миллионов лет назад. Cosmos - это космическая энергия, воплощённая в оригинальном и тропическом вкусах. В составе сочетаются кофеин, таурин и витамины группы B, а экстракты гуавы и женьшеня дополняют композицию, придавая напитку уникальный вкус и дополнительные полезные свойства. Почувствуй космическую энергию в каждой капле — выбери Cosmos для ярких достижений и новых горизонтов! ПродуктыМожно ли пить энергетики и вести здоровый образ жизни? Конечно! Энергетические напитки БАЙКАЛ natural energy — натуральные энергетические напитки нового поколения с естественными вкусами. Только природные источники бодрости: натуральный кофеин, элеутерококк и соки, без таурина и консервантов, с витаминами группы В, которые помогают бороться с усталостью. Попробуйте натуральную энергию Байкала! Любятово — это любимый вкус, который объединяет миллионы сердец, живущих по всей стране. Миллионы завтраков, пропитанных заботой и миллионы чаепитий, которые делают нас чуточку ближе. Такие вкусные и необычные, наполненные удовольствием продукты EXTRASI придают экстра ценность моментам жизни каждый день. EXTRASI - скажи удовольствию ДА! Для всех фанатов самых шипучих шипучек! Тысячи пузырьков в бутылочке «FUN кола» подчеркнут насыщенный вкус любимого миллионами напитка, а игристый «Буратино» перенесет всех в беззаботное веселое детство. Те, кто уже попробовал эти напитки, знают — весь FUN начинается с «Пшш…». ПродуктыМы создали Chocozavr для самых больших ценителей шоколадных готовых завтраков. Хрустящие подушечки с нежнейшей начинкой или фигурки «Шоксики» с настоящим шоколадом – вот секрет потрясающе вкусного и питательного завтрака. А еще, подушечки идеально подходят как самостоятельный перекус или десерт к чаю. Утоли свою жажду шоколада! Обычные, рифленые или соломкой — какие ваши любимые чипсы? В линейке Fry´s есть натуральные картофельные чипсы любой формы и вкуса! Любителям всего поострее понравятся чипсы васаби, чили или горчица. Ценителям изысканных вкусов подойдут Fry´s с крабом или с лососем в сливочном соусе. А почитателям классики — с сыром, солью или с зеленым луком. ПродуктыЧипсы Bon Giorno – это коллекция разнообразных изысканных вкусов, вдохновленных путешествиями в разные страны, которые добавят хрустящего удовольствия и приятной атмосферы любым моментам вашей жизни. ПродуктыUnicorn – это яркие цвета и интересные вкусы, чтобы радовать детей, и 100% натуральные ингредиенты в составе, которым может довериться мама. Наш волшебный единорог создает мир, в котором место только радости и беззаботности! Добавьте немного волшебства и ярких красок в каждый свой день вместе с готовыми завтраками и печеньем Unicorn. Одобрено единорогами! Настоящее вкусовое комбо! В пачках Chaka — смесь орешков, печеных зерен кукурузы и хрустящих чаксов. Миксуйте их по-разному между собой и получайте каждый раз новые вкусовые сочетания! А для особых любителей арахиса мы создали отдельные пачки: арахис с сыром, беконом, вареными раками или классический — с солью. Сухарики по старинным русским рецептам придутся по вкусу всем богатырям и честным молодцам! Тем, кто любит все самое традиционное, понравятся крутецы с холодцом и хреном или красной икоркой. Тем, кому хочется чего-то новенького, стоит попробовать сухарики со спайси томатом или копченым кальмаром. А лучше все это миксовать! Для этого мы специально придумали особые крутецкие комбо. ПродуктыВ ассортименте нашей компании есть сиропы для приготовления безалкогольных напитков в разливном охлажденном виде. Это отличное решение для кафе, баров, ресторанов и кинотеатров! Вся польза Алтая в одном маленьком батончике! Перекус из цельных злаков от «БИОКЕЙ» — это только натуральные ингредиенты, клетчатка, микроэлементы, пищевые волокна и витамины группы B. А еще 4 разных вкуса! Полезная для иммунитета куркума и абрикос, сладкая клубника, питательный кокос и витаминная черника. ПродуктыБолее 100 лет назад купец Савинов основал кондитерскую фабрику, чтобы радовать людей вкусными конфетами. Кондитерская фабрика «Алтай» продолжает дело кондитера Савинова, соблюдая главный принцип его работы: пробовать новое и сохранять самое вкусное. «Савинов» сделает любой день вкуснее, все дело в конфетах! Мы понимаем, как важно для родителей заботиться о малышах, об их правильном питании каждый день. «Черноголовка Бэйби» — это вкусное и полезное детское питание высокого качества, созданное с заботой о малышах и их родителях. Наш ассортимент — это фруктовые пюре, соки, фрикадельки, питьевые кашки и вода для самых маленьких. В основе наших продуктов только качественные натуральные ингредиенты, без красителей, консервантов и ГМО. Для малышей с заботой от «Черноголовка Бэйби»! Открой для себя энергетик X-Turbo, представленный в трех линейках: Focus, Active и Party. Уникальный микс в каждой линейке обеспечивает максимальный эффект. X-Turbo — это мощь внутри тебя, готовая зажигать в любой момент. Выбери свою линейку и наслаждайся энергией X-Turbo! ПродуктыТе самые легендарные лимонады, которыми уже более 25 лет наслаждаются люди по всей стране. Эти незабываемые вкусы у большинства ассоциируются с детством, праздниками и просто приятными моментами. А получаются лимонады такими особенными благодаря натуральным ингредиентам в составе. Они созданы на основе артезианской воды и настоев трав и фруктов, собранных по всей территории нашей страны. Подарите себе вкус радости! ПродуктыВсеми любимая кола, но с особенными нотами во вкусе! Мы делаем нашу колу на основе специально подготовленной артезианской воды, кофеина — для бодрости и карамельного колера — для насыщенного приятного цвета, добавляем авторскую композицию натуральных ароматизаторов и создаем две версии — колу с сахаром и без него. Этот незабываемый вкус наполнит радостью, подарит потрясающее настроение и освежит в самый жаркий день! Попробуйте нашу колу – колу с тем самым особым вкусом! ПродуктыВкусный натуральный, освежающий, холодный чай, приго"
}