{
  "url": "https://www.totara.com/customer-stories/west-suffolk-nhs-foundation-trust/",
  "title": "West Suffolk NHS Foundation Trust - Totara Learning",
  "text": "West Suffolk NHS Foundation Trust (WSFT) provide clinical services to children and families in Suffolk with specialist and complex health needs. To deliver the best possible care, WSFT support people and organisations who interact with these children, including their parents, carers, and teachers with targeted patient and condition management education. First for Staff. First for Patients. First for the Future. The Challenge To address the need for delivering high-quality and engaging learning content to school staff in a manner that is accessible while optimising NHS clinician time and minimising administrative burden, WSFT embarked on a strategic shift in its educational approach. Previously, WSFT relied on face-to-face sessions to deliver education packages to school staff. However, escalating NHS service demands and logistical challenges in coordinating training sessions with schools rendered this approach unsustainable. Recognising the imperative to enhance the reach and impact on patient care, WSFT sought to revamp its education delivery method. Transitioning to Totara presented both opportunities and challenges. While it offered a platform for accessible and engaging content delivery, there were concerns about navigating administrative processes and translating existing face-to-face sessions into compelling digital formats. Key considerations included maintaining the ability to verify learning through quizzes and knowledge checks, as well as leveraging reporting functionality for insights and feedback. By embracing Totara and implementing tailored strategies, WSFT aimed to streamline education delivery, empower school staff with valuable knowledge, and ultimately enhance patient care outcomes. The Solution In response to the necessity for an alternative user enrolment method, WSFT developed a comprehensive self-registration solution tailored to the needs of school staff. This solution included the following key components: - Bespoke Login Page: A customised login page specifically designed for school staff, providing a user-friendly interface tailored to their requirements. - Dedicated Tenant: A new tenant was established to facilitate the customisation of page design, content, and branding, ensuring alignment with the preferences and expectations of school staff users. - Self-Registration Form: A user-friendly self-registration form was implemented, featuring a drop-down list containing pre-approved schools in the county, streamlining the enrolment process. - Email Domain Configuration: To maintain security and restrict access to school staff exclusively, email domains were configured to validate user identities. This mechanism ensured that only individuals associated with verified educational institutions could register and access the platform, enhancing data security and user accountability. By implementing these measures, WSFT successfully established a robust self-registration solution that not only simplified the enrolment process for school staff but also upheld stringent security standards and facilitated seamless access to educational resources. In developing the new content, our approach began with a thorough examination of the PowerPoint presentation previously delivered face-to-face. Collaborating closely with our clinical staff, we meticulously assessed how we could replicate and enhance elements of the presentation using Totara. Given the complexity of the clinical topics, particularly those related to neuroscience, maintaining clarity and engagement in the online delivery was paramount. Leveraging the capabilities of Totara, we crafted an interactive course using the articulate authoring tool. This allowed us to seamlessly integrate animations developed in Vyond, 360 imaging, and instructional videos, enhancing the overall learning experience. To ensure accessibility and accommodate teaching staff schedules, the course was structured into three distinct sections, allowing for manageable learning chunks. Integral to the course’s effectiveness are the quizzes and feedback forms, which harness Totara’s robust reporting functionality. These assessments provide invaluable insights into the reception and impact of the course on the health and education of our paediatric patients. Upon successful completion of the course, each user receives a certificate, validating their achievement. Through this comprehensive approach, we aim to continually refine and optimise our educational offerings, ultimately improving patient care outcomes and supporting the professional development of our staff. The Result Since the implementation of the self-registration process and course content, we are delighted to report a seamless experience for school staff users. Not a single difficulty accessing the platform or the learning materials has been reported, underscoring the effectiveness of our approach. The impact of delivering a single course to schools via Totara has been substantial. In the first year alone, it has resulted in a remarkable saving of £10,000 and more importantly 7 weeks of specialist NHS clinician time, which has been reallocated to patient care activities. This not only demonstrates the efficiency of digital solutions but also highlights their crucial role in alleviating pressure on healthcare resources. Engagement with the content has been impressive, with 244 school staff members across Suffolk actively participating. The course’s accessibility has effectively cleared a waiting list of teaching staff seeking to attend, while also alleviating constraints on physical room space for face-to-face sessions. Amidst unprecedented challenges facing the NHS, the ability of digital solutions to free up specialist clinician time is invaluable. The success of the initial course has sparked significant interest, leading to 10 additional requests from other WSFT services to develop similar courses aimed at enhancing patient care and relieving clinical staff capacity pressures. The development and deployment of the platform, along with the initial course, were accomplished within approximately 3 months. The feedback received from the 244 enrolled users has been overwhelmingly positive, further validating the impact and importance of our digital education initiatives. Excellent style of presentation – great to have visual, auditory, and kinaesthetic elements. The information was detailed enough to be very informative but not too much to be overwhelming. I thought the neuroscience components were explained particularly well. The training helped me to understand sensory needs. I was completing the course for a particular child but thought it could benefit so many more."
}