{
  "url": "https://www.santander.com.br/atendimento-para-voce/internet-banking",
  "title": "Internet Banking — Santander",
  "text": "App Santander Internet Banking - Santander Como acessar o Internet Banking do Santander? Para acessar, é fácil. Basta você ter em mãos seu número do CPF e seguir o passo a passo abaixo: Veja também: 1. Acesse: www.santander.com.br 2. Preencha o campo CPF e clique em “OK”. 3. Na página seguinte serão apresentadas as condições gerais de uso do Internet Banking. Leia o contrato com atenção e, caso concorde, selecione essa opção e clique em “Confirmar”. 4. Em seguida, insira os dados solicitados para confirmação. 5. Depois, crie a sua senha multicanal de seis números. 6. Para realizar transações no Internet Banking será necessário um QR Code que deve ser gerado no App Santander. Pronto! Seu cadastro foi finalizado. Para realizar seu acesso no Internet Banking, clique no botão \"Acessar minha conta” no topo desta página e informe a senha de acesso. 1. Acesse: www.santander.com.br 2. Preencha o campo CPF e clique em “OK”. 3. Na página seguinte serão apresentadas as condições gerais de uso do Internet Banking. Leia o contrato com atenção e, caso concorde, selecione essa opção e clique em “Confirmar”. 4. Em seguida, insira os dados solicitados para confirmação. 5. Depois, crie a sua senha multicanal de seis números. 6. Para realizar transações no Internet Banking será necessário um QR Code que deve ser gerado no App Santander. Pronto! Seu cadastro foi finalizado. Para realizar seu acesso no Internet Banking, clique no botão \"Acessar minha conta” no topo desta página e informe a senha de acesso. Caso você não tenha conta corrente aqui no Santander, mas possua uma conta poupança, pode acessar o Internet Banking normalmente. Se tiver um cartão ou uma previdência com a gente, recomendamos que realize seu acesso pela página de não correntista na opção “Atendimento”. Agora se você não tem cartão, conta poupança ou previdência e deseja acessar o Internet Banking, será necessário abrir uma conta. Aqui no Santander, você pode fazer isso de forma 100% digital, é só clicar aqui. Se tiver um cartão ou uma previdência com a gente, recomendamos que realize seu acesso pela página de não correntista na opção “Atendimento”. Sua senha será criada no primeiro acesso. Caso esqueça sua senha, você poderá criar uma nova informando alguns dados na tela de entrada do Internet Banking. Mas atenção, por medida de segurança, o acesso será bloqueado após três tentativas inválidas. Então preste atenção. Atenção: Caso você tenha esquecido seu CPF, clique no link “Esqueci meu CPF”, localizado ao lado do campo de CPF. A partir dele, você poderá concluir o seu cadastro fornecendo número de agência, conta e senha. Sua senha será criada no primeiro acesso. Caso esqueça sua senha, você poderá criar uma nova informando alguns dados na tela de entrada do Internet Banking. Mas atenção, por medida de segurança, o acesso será bloqueado após três tentativas inválidas. Então preste atenção. Atenção: Caso você tenha esquecido seu CPF, clique no link “Esqueci meu CPF”, localizado ao lado do campo de CPF. A partir dele, você poderá concluir o seu cadastro fornecendo número de agência, conta e senha. Dúvidas Frequentes: Não, mesmo sem conexão com a internet é possível gerar o código para realizar as transações no Internet Banking. Para isso, faça sua transação normalmente e, na hora de validar, abra o seu App Santander. Em seguida, selecione o ícone ID Santander, disponível antes do login. Não, mesmo sem conexão com a internet é possível gerar o código para realizar as transações no Internet Banking. Para isso, faça sua transação normalmente e, na hora de validar, abra o seu App Santander. Em seguida, selecione o ícone ID Santander, disponível antes do login. Ligue imediatamente para a nossa Central de Atendimento: (11) 4004-3535 (para Capitais e Regiões Metropolitanas) 0800 702 3535 (Demais localidades – sem custo na ligação) Ligue imediatamente para a nossa Central de Atendimento: (11) 4004-3535 (para Capitais e Regiões Metropolitanas) 0800 702 3535 (Demais localidades – sem custo na ligação) Nos casos de perda ou roubo, ligue imediatamente para a nossa Central de Atendimento: (11) 4004-3535 (para Capitais e Regiões Metropolitanas) 0800 702 3535 (Demais localidades – sem custo na ligação) Nos casos de perda ou roubo, ligue imediatamente para a nossa Central de Atendimento: (11) 4004-3535 (para Capitais e Regiões Metropolitanas) 0800 702 3535 (Demais localidades – sem custo na ligação)"
}