{
  "url": "https://eyewiki.org/Epidemic_Keratoconjunctivitis",
  "title": "Epidemic Keratoconjunctivitis - EyeWiki",
  "text": "Epidemic Keratoconjunctivitis All content on Eyewiki is protected by copyright law and the Terms of Service. This content may not be reproduced, copied, or put into any artificial intelligence program, including large language and generative AI models, without permission from the Academy. Diagnostic Codes - 2012 ICD-9-CM 077.1 Epidemic keratoconjunctivitis[2] - 2015 ICD-10-CM B30.0 Keratoconjunctivitis due to adenovirus Background Conjunctivitis refers to the inflammation of the conjunctiva, which is a membrane that covers the sclera and inside of the eyelids. The inflammation results in a pink or red coloration of the eye, hence the disease being commonly referred to as “pink eye.”[3] Epidemic keratoconjunctivitis (EKC) is a highly contagious form of viral conjunctivitis.[4][5] The development of corneal inflammation (keratitis) distinguishes epidemic keratoconjunctivitis from other forms of conjunctivitis and usually arises after the fourth day following the initial onset of symptoms.[3] Epidemic keratoconjunctivitis is caused by a group of viruses known as adenoviruses. In addition to causing infections of the ocular surface, adenoviruses are responsible for causing infectious diseases of the gastrointestinal tract and respiratory system (e.g., the common cold).[6][7][8] The adenovirus serotypes 8, 4, 19 (now 64 by whole genome sequencing), and 37 are often associated with EKC.[7][8] Serotypes 53 and 54 have been identified as the causative agent in a few recent outbreaks of EKC. Some data suggest that as metagenomics-based methods of viral detection improve, other viruses may be implicated in EKC.[9] Signs and Symptoms Ocular Signs/Symptoms - Conjunctival hyperemia/erythema (redness) of bulbar conjunctiva (Fig. 1-4) - Conjunctival hyperemia/erythema (redness) of palpebral conjunctiva (Fig. 5-7) - Follicular reaction (Fig. 5 and 6) - Chemosis (conjunctival edema) (Fig. 1-4) - Epithelial keratitis - Subepithelial infiltrates - Membranes or pseudomembranes - Dacryoadenitis - Clear or yellow discharge from the eye(s) - Ocular itchiness and irritation - Photophobia - Epiphora (excessive tearing) (Fig. 1-2) - Foreign body sensation - Blurred vision/loss of visual acuity - Few cases of dacryocystitis have been reported Systemic Signs/Symptoms - Lymphadenopathy (swollen nymph nodes, specifically the preauricular lymph nodes) (Fig. 8) - Fever - Headache - Fatigue In about 70% of cases, the symptoms may progress to the other eye, though the symptoms may be milder for the other eye.[5][10] Conjunctival inflammation can progress to focal epithelial keratitis, and the resulting lesions can last for up to 2 weeks. After this period, subepithelial infiltrates (also known as “nummuli”), which are thought to be related to the immune response, can form beneath the lesions. Nummuli occur at approximately day 10 and can give rise to irregular astigmatism and photophobia. These symptoms and decreased visual acuity can persist for months or years.[5][11][12] In about 25% of cases of EKC, patients can develop severe findings, including membranous or pseudomembranous conjunctivitis, causing scarring of the conjunctiva and symblepharon formation, where the eyelid adheres to the cornea.[5][13] Pathogenesis Adenovirus D (AdV) is a lytic, nonenveloped double-stranded DNA virus with a genome encoding more than 40 structural and nonstructural proteins. The classification of AdV into its serotype groups (A-G) is based on hemagglutination properties, tissue tropism, serology, DNA homology, and host-receptor usage. The presence of AdV on the ocular surface causes secretion of interleukin-8 from ocular surface epithelial cells and eventually leads to internalization and replication of the virus.[14] Clinical Photographs Figure 1: Epiphora, chemosis, and diffuse erythema of the bulbar conjunctiva in a patient with EKC; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 2: Epiphora, chemosis, and diffuse erythema of the bulbar conjunctiva in a patient with EKC, shown under higher magnification; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 3: Erythema and chemosis of the bulbar conjunctiva in a patient with EKC. View is of the temporal portion of conjunctiva as the patient looks nasally; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 4: Erythema and chemosis of the bulbar conjunctiva in a patient with EKC. View is of the nasal portion of conjunctiva as the patient looks temporally; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 5: Follicular reaction of the palpebral conjunctiva in a patient with EKC, view with upper eyelid everted; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 6: Follicular reaction of the palpebral conjunctiva in a patient with EKC, view with upper eyelid everted; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 7: Erythema of the palpebral conjunctiva in a patient with EKC, view with lower eyelid everted; Clinical photograph captured courtesy of the UNC Ophthalmic Imaging Department. Figure 8: Palpable preauricular lymph node (area between arrows) in a patient with EKC, view of de-identified left face; Clinical photograph captured courtesy Dr. Couser by permission from patient. Diagnosis Epidemic keratoconjunctivitis is usually diagnosed based on patient history and a physical examination.[5][11][15] A slit lamp is used during the physical examination; however, a penlight can suffice when a slit lamp is not available.[15] However, because the signs and symptoms of conjunctivitis tend to be nonspecific and make it difficult to pinpoint the exact cause or type of the disease, diagnoses based solely on patient history and examination can be inaccurate.[15] Discharge type is one of the main features used to differentiate among the types of conjunctivitis; viral conjunctivitis tends to have a watery discharge, while bacterial conjunctivitis tends to have discharge with pus, though these features do not guarantee the conjunctivitis type.[15] Of the available EKC testing methods, the most commonly used are cell cultures and immunoassays. Polymerase chain reaction (PCR) is another method that has been shown to be more accurate than the combination of cell cultures + immunoassays (CC-IFA). However, these diagnostic methods are expensive and are not readily available in most outpatient settings.[11] In-Office Point-of Care Adenovirus Testing The RPS Adeno Detector (Rapid Pathogen Screening, AD1) was approved by the US FDA in 2006 as a point-of-care antigen-based immunoassay for diagnosing adenovirus infections.[16] Previously called AdenoPlus now renamed QuickVue AC test[17], is the enhanced second-generation device by RPS and was approved in 2012. It can deliver a result in 10 minutes, and uses direct sampling of tears and microfiltration technology to improve sensitivity. In 2013, Sambursky et al[18] published the results of a prospective, sequential, masked multicenter clinical trial of 128 patients with clinically diagnosed adenoviral conjunctivitis that compared the sensitivity and specificity of the QuickVue AC test with CC-IFA and PCR. The study demonstrated that the QuickVue AC test had a sensitivity and specificity of 90% and 96%, respectively, vs CC-IFA, and of 85% and 98%, respectively, vs PCR. The sensitivity and specificity were 93% and 98%, respectively, compared with both CC-IFA and PCR. In 2015, Kam et al[19] also reported a high specificity with QuickVue AC test, but a much lower sensitivity than had been previously published (39.5% vs PCR). The authors concluded that PCR is a more sensitive test, and therefore the use of the QuickVue AC test should be limited to diagnostically challenging cases. Advantages of In-Office Testing Given the highly contagious nature of adenoviral conjunctivitis, a delay in diagnosis can lead to unnecessary isolation or empiric antibacterial or antiviral therapy.[15] As the QuickVue AC test detects the presence of viral particles, the results may correlate with disease infectivity, allowing patients a speedier return to school and work when the virus is no longer detectable. In a cost-effectiveness study, utilization of the RPS Adeno Detector was shown to save $429.4 million and avoid 1.1 million cases of inappropriate antibiotic use.[20] In addition, the ability to confirm adenoviral infection might allow for the study and use of novel therapies for adenoviral infections such as ganciclovir, povidone-iodine, N-chlorotaurine, and cyclosporine A.[21] [22] [23] [24] Treatment - Epidemic keratoconjunctivitis usually resolves on its own, and there is currently no effective treatment. [10][11][15] Management is centered on symptom reduction through the use of cold compresses, artificial tears, and topical cycloplegic medications to alleviate significant complaints of photophobia.[5] [25][11][15] - Topical corticosteroids are often prescribed in severe cases, and while they do assist in reducing inflammatory symptoms and reducing subepithelial corneal infiltrates, they do not significantly reduce recovery time.[11] Some studies have in fact shown that the use of corticosteroids may increase the duration of disease by inhibiting removal of the adenovirus by the immune system and aggravating virus replication. [10][11] [17] - Guidelines currently recommend that antibiotics only be used in patients who have bacterial co-infection or in high-risk individuals.[26] - In limited studies, antiviral ganciclovir gel has been shown to shorten the duration of EKC and reduce the development of subepithelial infiltrates. However, other antivirals have not shown effectiveness, and more studies are needed to evaluate its treatment efficacy in EKC.[27] - Povidone-iodine is a disinfectant and antiseptic agent that has been shown in some studies to decrease the duration of acute EKC. It has also been shown to lower the risk of subepithelial infiltrate development when used alone or in combination with a topical steroid. However, no interventions have established the superiority of povidone-iodine in resolving subepithelial infiltrates once they have developed. Povidone-iodine is a promising agent in the treatment of EKC. The optimal concentration of povidone-iodine is not known, and further studies are warranted.[28] [29][17] - Patients should be followed closely for the formation of conjunctival membranes. If these are present, they should be removed and the patient should be given topical corticosteroids to minimize scar and symblepharon formation.[9] - Topical cyclosporine shows promise as a treatment for subepithelial corneal infiltrates in acute EKC.[17] Epidemiology/Prevention Epidemic keratoconjunctivitis is a highly contagious disease. Given that no effective treatment yet exists, prevention is the best method to tackle it. The virus can be spread by contact with infected surfaces or objects, and it can remain alive on porous surfaces for 10 days and on nonporous surfaces for over 1 month.[9] A patient can spread the disease by touching or rubbing their eyes and then touching another object. Objects that come into contact with the eyes, such as cosmetics, should not be shared or allowed into contact with others.[11] According to an analysis done at the Illinois Eye and Ear Infirmary in Chicago, the risk of infection from household contacts is estimated at 10-20%.[30] Epidemic keratoconjunctivitis can also spread via respiratory or infected bodily secretions that enter the body through the nose, throat or conjunctiva.[10] The incubation period is about a week before the symptoms manifest.[11] A person can be contagious for 2 weeks or longer after first showing symptoms, and this should be taken into consideration when deciding whether to return to work or school.[11] A person is especially contagious if there is ocular discharge present, and they should not return to work or school until the discharge has ceased. The physician's office or hospital setting is often the point of origin for many EKC outbreaks and prevention measures should be exercised thoroughly in these locations. These include using disposable instruments and tools, employing gloves, and using disposable covers for instruments that cannot be disposed of routinely (e.g., tonometers).[11] Guidelines on how to clean nondisposable instruments vary. Studies have shown differing effectiveness in cleaning agents such as hydrogen peroxide and isopropyl alcohol in their ability to eliminate adenovirus. Given the lack of universal guidelines, it has been suggested that the instrument manufacturer’s cleaning protocols should be followed. [11] A recent study from Hashizume et al[31] found that treatment with 1% potassium peroxymonosulfate led to significant reduction in all tested human AdV types and is a promising disinfectant for EKC. It has been postulated that in addition to causing acute outbreaks, EKC can also be endemic, in some instances arising from reservoirs found within individual communities. This would make the term “epidemic” not always true.[9] Additional Resources - Pogorelc D. This company turned technology used to detect explosives into a rapid test for viral pink eye. Medcity News. Published October 24, 2012. Accessed March 18, 2025. http://medcitynews.com/2012/10/this-company-turned-technology-used-for-detecting-explosives-into-a-rapid-test-for-viral-pink-eye/ - Adenoplus. Rapid Pathogen Screening, Inc. http://www.rpsdetectors.com/in/products/adenoplus/about/product-info/ References - ↑ American Academy of Ophthalmology. Epidemic keratoconjunctivitis. Accessed March 18, 2025. https://www.aao.org/image/epidemic-keratoconjunctivitis-2. - ↑ American Academy of Ophthalmology. Epidemic keratoconjunctivitis. https://www.aao.org/image/epidemic-keratoconjunctivitis-2 Accessed June 28, 2019. - ↑ 3.0 3.1 Boyd, Kierstan. Conjunctivitis: what is pink eye? eyeSmart, American Academy of Ophthalmology. Accessed March 18, 2025. http://www.aao.org/eye-health/diseases/pink-eye-conjunctivitis. - ↑ Adenovirus-associated epidemic keratoconjunctivitis outbreaks – four states, 2008-2010, Morbidity and Mortality Weekly Report (MMWR). 2013;62(32):637-641. - ↑ 5.0 5.1 5.2 5.3 5.4 5.5 Bawazeer A. Epidemic keratoconjunctivitis (EKC). Medscape. Updated February 6, 2023. Accessed March 18, 2025. http://emedicine.medscape.com/article/1192751-overview#a0101 - ↑ Adenoviruses. Centers for Disease Control and Prevention. Accessed March 18, 2025. http://www.cdc.gov/adenovirus/about/index.html - ↑ 7.0 7.1 Jin X, Ishiko H, Ha NT, et al. Molecular epidemiology of adenoviral conjunctivitis in Hanoi, Vietnam. Am J Ophthalmol. 2006;142:1064-1066. - ↑ 8.0 8.1 Kinchington PR, Romanowski EG, Gordon YJ. Prospects for adenoviral antivirals. J Antimicrob Chemother. 2005;55:424-429. - ↑ 9.0 9.1 9.2 9.3 Jonas RA, Ung L, Rajaiya J, et al. Mystery eye: human adenovirus and the enigma of epidemic keratoconjunctivitis. Prog Retinal Eye Res. 2020;76:100826. doi.org/10.1016/J.PRETEYERES.2019.100826 - ↑ 10.0 10.1 10.2 10.3 Meyer-Rüsenberg B, Loderstädt U, Richard G, et al. Epidemic keratoconjunctivitis: the current situation and recommendations for prevention and treatment. Dtsch Arztebl Int. 2021;108(27):475-480. - ↑ 11.00 11.01 11.02 11.03 11.04 11.05 11.06 11.07 11.08 11.09 11.10 11.11 Pihos A. Epidemic keratoconjunctivitis: a review of current concepts in management. J Optometry. 2013;6(2):69-74. - ↑ McKenzie M, Whitley W.. A closer look at corneal inflammation. Rev Cornea Contact Lenses. Published November 15, 2012. Accessed March 18, 2025. https://www.reviewofcontactlenses.com/content/d/irregular_cornea/c/37560/ - ↑ The Free Dictionary by Farlex. Symblepharon. Accessed March 18, 2025. https://medical-dictionary.thefreedictionary.com/symblepharon - ↑ Chigbu DI, Labib BA. Pathogenesis and management of adenoviral keratoconjunctivitis. Infect Drug Resist. 2018;11:981-993. - ↑ 15.0 15.1 15.2 15.3 15.4 15.5 15.6 Azari AA, Barney NP. Conjunctivitis: a systematic review of diagnosis and treatment. JAMA. 2013;310(16):1721-1730. - ↑ Sambursky R, Tauber S, Schirra F, et al. The RPS adeno detector for diagnosing adenoviral conjunctivitis. Ophthalmology. 2006;113(10):1758-1764. - ↑ 17.0 17.1 17.2 17.3 Shaikh S, Choudhry HS, Khan H, Patel R, Mothy D, Dastjerdi MH. A Comprehensive Review of Adenoviral Conjunctivitis: Exploring the Role of Povidone-iodine in Treatment. Int Ophthalmol Clin. 2025 Apr 1;65(2):1-11. doi: 10.1097/IIO.0000000000000556. Epub 2025 Mar 21. PMID: 40116403. - ↑ Sambursky R, Trattler W, Tauber S, et al. Sensitivity and specificity of a point-of-care matrix metalloproteinase 9 immunoassay for diagnosing inflammation related to dry eye. JAMA Ophthalmology. 2013;131(1): 24-28. - ↑ Kam KYR, Ong HS, Bunce C, et al. Sensitivity and specificity of the AdenoPlus point-of-care system in detecting adenovirus in conjunctivitis patients at an ophthalmic emergency department: a diagnostic accuracy study. Br J Ophthalmol. 2015;99(9):1186-1189. - ↑ Udeh BL, Schneider JE, Ohlsfeldt RL. Cost effectiveness of a point-of-care test for adenoviral conjunctivitis. Am J Med Sci. 2008;336(3):254-264. - ↑ Tabbara KF. Ganciclovir effects in adenoviral keratoconjunctivitis. Poster presented at: Association for Research and Vision in Ophthalmology; April 29-May 4, 2001; Fort Lauderdale, Fla. - ↑ Isenberg SJ, Apt L, Valenton M, et al. A controlled trial of povidone-iodine to treat infectious conjunctivitis in children. Am J Ophthalmol. 2002;134(5):681-688. - ↑ Yoon J, Jekle A, Najafi R, et al. Virucidal mechanism of action of NVC-422, a novel antimicrobial drug for the treatment of adenoviral conjunctivitis. Antiviral Res. 2011;92(3):470-478. - ↑ Romanowski EG, Pless P, Yates KA, et al. Topical cyclosporine A inhibits subepithelial immune infiltrates but also promotes viral shedding in experimental adenovirus models. Cornea. 2005;24(1):86-91. - ↑ NSW Health. Epidemic keratoconjunctivitis. Last updated September 3, 2018. Accessed March 18, 2025.http://www.health.nsw.gov.au/Infectious/factsheets/Pages/Epidemic-Keratoconjunctivitis.aspx - ↑ Imparato R, Rosa N, de Bernardo M. Antiviral drugs in adenovirus-induced keratoconjunctivitis. Microorganisms. 2022;10:2014. - ↑ Liu SH, Hawkins BS, Ren M, et al. Topical pharmacologic interventions versus active control, placebo, or no treatment for epidemic keratoconjunctivitis: findings from a Cochrane systematic review. Am J Ophthalmol. 2022;240:265-275. - ↑ Grzybowski A, Kanclerz P, Myers WG. The use of povidone-iodine in ophthalmology. Curr Opin Ophthalmol. 2018;29(1):19-32. - ↑ Pepose JS, Ahuja A, Liu W, et al. Randomized, controlled, phase 2 trial of povidone-iodine/dexamethasone ophthalmic suspension for treatment of adenoviral conjunctivitis. Am J Ophthalmol. 2018;194:7-15. - ↑ Kuo IC. Adenoviral keratoconjunctivitis: diagnosis, management, and prevention. Curr Ophthalmol Rep. 2019;7(2):118-127. - ↑ Hashizume M, Aoki K, Ohno S, et al. Disinfectant potential in inactivation of epidemic keratoconjunctivitis-related adenoviruses by potassium peroxymonosulfate. Eur J Ophthalmol. 2021;31(2):379-384."
}