{
  "url": "https://toufayan.com/pita-bread/",
  "title": "Pita Bread | Toufayan Bakeries",
  "text": "HEARTY. LIGHT.BAKED FRESH DAILY. Our old world recipes use only top quality, hearty ingredients. True to the original pita tradition, we hearth bake each bread to a perfect golden brown. Toufayan Pitas are convenient and versatile. Just cut in half or at the top and fill with meats, salads or cheese. Great for tacos, sloppy joes and fajitas, or cut into bite sizes for appetizers. Enjoy. From our family to yours – The Toufayans OUR FRESHEST RECIPES TOUFAYAN BAKERIES The Toufayan family is proud to make the finest tasting and heartiest breads for your family. Leave a comment below, we’re always glad to hear from you! 237 Comments Can you tell me where I can purchase your items locally? I was able to get it at Food Lion at 2.99 each and now they are 5.49. Why has the price gone up so much. Also, Walmart used to carry them and now I cannot find them there anymore. ReplyYou can use our Store Finder to find retailers near you, and many of our products are also available on Amazon. Retailers such as IGA, Carlie C’s, Food Lion, and Walmart may carry Toufayan products, but selection and pricing are set independently by each store. This means prices can vary by location and may change over time based on factors like distribution costs, promotions, and local market conditions. If you don’t see a specific product at your store, we encourage you to ask the store manager about carrying it. Many retailers are happy to take customer requests into account when deciding what to stock. ReplyHi, I’m a first time buyer of your products. I just bought the whole wheat pita bread and it is very good! I was wondering if it is organic because I did not see that designation on the label and that is important to me. Thank you. We appreciate your endorsement. Our whole wheat pita is not certified organic, however, we do strive to select the best ingredients and suppliers. ReplyHave enjoyed your pita bread for quite some time but now feel it necessary to let you know that your change to a smaller zip lock is most inconvenient. Very difficult to close. Would be nice if you went back to the previous larger style. Thank you ReplyThanks for your feedback. We did improve the reseal strip after the initial launch of our new package, which has been rolling out to stores over the last few months, so keep your eye out for it near you. ReplyHello Toufayan Bakeries, I love using your products in my small fast food business. A growing concern is about using Halaal products that certified according to Islamic standards. Would it be possible to get an extensive list of all Halaal certified products? They should not contain any trace of alcohol. Thanks in advance. ReplyThanks for your endorsement! None of our products contain alcohol. For some of our products we use propylene glycol or plant-derived sorbitol (neither are not manufactured with animal enzymes or alcohol-based solvents), which are both widely recognized as halal. Here is a list of our products that are officially certified as halal – we’re working on getting certifications for more, but based on our ingredients and sources, all of our products qualify. Enjoy! ReplyThank you for making the very best pita bread we’ve ever had! We have been eating only Toufayan pita bread for more than 20 years and recommend it highly to everyone. And thank you for keeping the price very affordable at Publix, as well as offering BOGO deals there on a regular basis. Please keep up the great baking and making such delicious, high-quality breads! ReplyThe new “resealable” bags are only semi-resealable. I wish you would have kept using the twist and clip closure instead. ReplyAre you still making you organic sprouted whole wheat pita? I love them but have not seen them in my wild by nature store. ReplyI’m sorry to say that Organic Sprouted Whole Wheat Pita Bread has been discontinued. Please consider trying our Keto Pita, Hearth Baked Whole Wheat Pita, or Smart Pita. ReplyThanks for your question. All of our facilities are peanut and tree nut free. Toufayan pita and all of our products are peanut free. Always check the physical product’s packaging for the latest allergen and ingredient information. Enjoy! I read a previous comment from 2022 that you changed the ingredients to more sustainable reducing the diameter of the pita while maintaining the same volume. I just noticed this smaller diameter of the white pita recently as of the last two purchases during October and November 2024 from Food Lion and Wal Mart in Greensboro, North Carolina. Recently they were bigger but less dense. I prefer the larger thinner pita for my egg sandwiches. Will you consider returning to the previous size? ReplyThanks for your comment, Sherif. The pita I have here measures 6″ across (just purchased from Shop Right in NJ). We notice that the diameter varies slightly based on conditions such as humidity and temperature at the bakery and at the grocer. However, some other customers have already asked for a larger diameter, so we’ll mention that request to the bakers. DO YOUR PRODUTS HAE ANY SOY IN THEM – PLEASE NAME TH EONES WITHOU SOY FLOUR O SOYBEAN OIL HANK YOU ReplyMany of our products are made without soy of any kind, including all varieties of our Hearth Baked Bagels and Mini Bagels, Crispy Breadsticks, Hearth Baked Flat Bread, Gluten Free Tortilla Wraps, Hearth Baked Pita, Pitettes®, and Mini Pitettes®, as well as our Smart Pockets™, Hearth Baked Wraps, and Tortillas. Select one of the varieties found on any of the pages listed here and you can find nutritional information for that product. While labeling regulations require allergens such as soy to be listed in the “allergen declaration,” just below the ingredients, you should always check the information on the physical package before consuming any product that might contain allergens Thank you for putting out such a great product. As a senior citizen on a fix income i have a limited food budget so i was wondering if you have coupons or samples that you could send. Would help me out alot since i enjoy your products so much. jeff ReplyThanks for your endorsement! Sign up for special offers here: toufayan.com/#sign-up ReplyYour product pita whole wheat is listed as naturally vegan, but sugar is often processed through bone char. Can you confirm that the sugar you use in your pita bread whole wheat ? I have alpha gal and need to make sure this product will not cause an allergic reaction ReplyThere is no bone char in the ingredients or in the manufacturing process of our Pitas. Download the official statement from our ingredient supplier: bone-char.pdf ReplyThanks for your comment. Unfortunately the batch code can’t tell us the expiration date. Our Pita should be coded by the grocer, for a 6 day shelf life, when they are displayed for sale. Please let us know where you purchased your Pita. Toufayan Pita are approximately 6 inches in diameter, however, they may vary slightly for several reasons including ambient temperature and humidity. These factors affect Pita size at the bakery and at the grocery store. ReplyThree years ago y’all had gluten-free pita chips that were the actual best pita chips I’d ever had – even of those with gluten. They have since disappeared. Please bring them back! ReplyThanks for your comment. They were good. Unfortunately there was just not enough interest among grocers, so we had to discontinue them. We currently don’t have any plans of bringing them back. ReplyWhy not let us GF eaters order them directly from you? I would be willing to buy a case (?) at a time. I can eat a whole bag at one time. PLEASE! ReplySorry Emily, we’re not set up to produce small batches. I purchased your all natural whole wheat pitas recently and the ingredients list was much cleaner than what I find on your website. I can not find the “all natural” and the ingredient list on what I bought does not list these ingredients that I try to stay away from! maltodextrin, microcrystalline cellulose, dough conditioner (bromelain), preservative (calcium propionate). Why are the ones I bought not listed on your website? Hello Sarah, thanks for your comment. Unfortunately, due to a lack of consumer interest, we are discontinuing our All Natural Pita. The new recipe and packaging (shown here), have already rolled out to stores in most regions, which is why we no longer display the old product on this website. All Natural Pita may still be available in your area for a little longer, however, they are expected to be replaced within the next two to three months. Hi! Once opened, how long will your white pita bread and pitettes stay fresh room temperature? Thanks! ReplyWe recommend that your grocer marks Toufayan Pita and Pitettes® with a 6 day date code, when they display our product for retail. Once opened, if you reseal the bags, removing as much air as possible and keeping moisture out of the bag, the expiration date should be unaffected. Keep out of direct sunlight and away from heat sources. In our bread box at home, we usually get at least 8 days, but various conditions will affect the duration, including how often they are opened and the humidity. Reply"
}