{
  "url": "https://es.wikipedia.org/wiki/Semana_Santa",
  "title": "Semana Santa - Wikipedia, la enciclopedia libre",
  "text": "Semana Santa La Semana Santa (Ἁγία καὶ Μεγάλη Ἑβδομάς) conmemora los siete días previos a la Pascua, también conocida como Semana Grande y Semana Mayor,[1] es la conmemoración cristiana anual de la pasión de Cristo, es decir, comienza con la conmemoración de la entrada triunfal de Cristo en Jerusalén el Domingo de Ramos, marca la traición de Judas el Miércoles Santo, y culmina con la conmemoración de la Última Cena el Jueves Santo y la Pasión de Jesús el Viernes Santo. La Semana Santa concluye con la muerte de Cristo y su descenso a los infiernos el Sábado Santo.[2][3][4][5] aunque su celebración suele iniciarse en varios lugares el viernes anterior, es decir, el Viernes de Dolores. La fecha de la celebración es variable: entre mediados de marzo y abril. En el cristianismo oriental, que también la denomina «Semana Santa», es la semana siguiente a la Cuaresma y al Sábado de Lázaro, que comienza la tarde del Domingo de Ramos y concluye la tarde del Gran Sábado.[6] En el cristianismo occidental,[nota 1][7] La Semana Santa es la sexta y última semana de la Cuaresma, que comienza con el Domingo de Ramos y concluye con el Sábado Santo.[8][4][2][3] Los cristianos creen que Jesús descansó en la muerte desde la hora novena (3 p. m.) del Viernes Santo hasta justo antes del amanecer del domingo por la mañana, el día de su resurrección de entre los muertos, conocido como Domingo de Pascua. Sin embargo, en 1 Pedro 3:19, puede haber una pista sobre una tarea que Jesús realizó durante este período entre la muerte y la resurrección: «Por lo cual también fue y predicó a los espíritus encarcelados». Esto marca el comienzo de la temporada de Pascua, cuya primera semana se conoce como Semana Santa (o Semana Brillante). Sigue siendo Cuaresma hasta el atardecer del Jueves Santo, cuando da comienzo el Triduo Pascual: ese mismo día se celebra la institución de la Eucaristía en la última cena; el Viernes Santo, la crucifixión y muerte del Señor, y la noche del Sábado Santo, la Vigilia Pascual. Durante la Semana Santa tienen lugar numerosas muestras de religiosidad popular a lo largo de todo el mundo destacando las procesiones, penitencias y las representaciones de la Pasión, muerte y resurrección de Jesús.[9] Las liturgias de la Semana Santa suelen atraer a las multitudes más numerosas del año. Muchas culturas cristianas tienen diferentes tradiciones, como liturgias o servicios especiales, carrozas, esculturas o recreaciones en vivo de la vida de Cristo, su arresto y crucifixión (también llamada la Pasión del Señor o Pasión de Jesús); a menudo son producciones interconfesionales.[10] En las iglesias de rito oriental también hay muchos medios para conmemorar las grandes fiestas y enfatizar el tema de la resurrección.[11] Muchos canales de televisión emiten películas relacionadas con la Semana Santa, como La pasión de Cristo, La mayor historia jamás contada y Jesús.[12] En algunos países se ha tomado como días de asueto, lo que también le ha valido la denominación de Semana De Dios. Historia [editar]La Semana Santa en el año litúrgico es la semana inmediatamente anterior a la Pascua. La primera alusión a la costumbre de celebrar esta semana con observancias especiales se encuentra en las Constituciones Apostólicas (v. 18, 19), que datan de la segunda mitad del siglo III y del siglo IV. En este texto, se ordena la abstinencia de carne durante todos los días, mientras que para el viernes y el sábado se ordena un ayuno absoluto. Dionisio Alejandrino, en su epístola canónica (260 d. C.), se refiere a los 91 días de ayuno, lo que implica que su observancia ya se había convertido en una costumbre establecida en su época.[13] Existen algunas dudas sobre la autenticidad de una ordenanza atribuida al emperador romano Constantino, en la que se imponía la abstinencia de los asuntos públicos durante los siete días inmediatamente anteriores al Domingo de Pascua, así como durante los siete días posteriores. Sin embargo, el Codex Theodosianus es explícito al ordenar que se suspendan todas las acciones legales y se cierren las puertas de todos los tribunales durante esos 15 días (1. ii. tit. viii.). De los días concretos de la «semana santa», el primero en cobrar especial relevancia fue, naturalmente, el Viernes Santo. Le seguía el «Sabbatum Magnum» («Gran Sábado», es decir, el Sábado Santo o víspera de Pascua) con su vigilia, que en la Iglesia primitiva se asociaba con la expectativa de que la segunda venida tendría lugar el día de Pascua. Otros escritos que hacen referencia a tradiciones relacionadas con la Iglesia primitiva incluyen, sobre todo, La peregrinación de Eteria (también conocida como La peregrinación de Egeria), que detalla toda la celebración de la Semana Santa en aquella época. [14] Hoy en día, en la Iglesia cristiana occidental, entre luteranos, anglicanos, metodistas, presbiterianos y católicos, las liturgias utilizadas para la Semana Santa son casi idénticas.[15] En la Iglesia Episcopal, la principal rama estadounidense de la Comunión Anglicana, el Libro de Oración Común de 1979 identifica la Semana Santa —que comprende desde el Domingo de Ramos (Domingo de la Pasión) hasta el Sábado Santo— como una temporada separada después de la Cuaresma,[16] en lugar de como parte de ella; pero los días laborables de la Semana Santa, al igual que los de la Cuaresma, son días de devoción especial que deben observarse con actos especiales de disciplina y abnegación,[17] por lo que el efecto práctico es el mismo que si la Semana Santa se considerara parte de la Cuaresma. En la Iglesia Morava, los servicios de la Semana Santa ( Semana de Pasión) son muy extensos, ya que la congregación sigue la vida de Cristo a lo largo de su última semana en servicios diarios dedicados a la lectura de una armonía de las historias del Evangelio, respondiendo a las acciones con himnos, oraciones y letanías, que comienzan la víspera del Domingo de Ramos y culminan en la mañana de Pascua o en el servicio del amanecer de Pascua iniciado por los moravos en 1732.[18][19] Semana Santa en el cristianismo occidental [editar]Domingo de Ramos (sexto domingo de Cuaresma) [editar]La Semana Santa comienza con el Domingo de Ramos, completo: Domingo de Ramos y Pasión (en latín, Dominica in Palmis de Passione Domini). Tradicionalmente, el Domingo de Ramos conmemora la entrada triunfal en Jerusalén descrita en los cuatro evangelios canónicos. Según se describe en estos relatos, la entrada de Cristo en Jerusalén fue observada por la multitud presente, que gritaba alabanzas y agitaba ramas de palmera. En el rito romano, antes de 1955 se conocía simplemente como Domingo de Ramos, y el domingo anterior como Domingo de Pasión. De 1955 a 1971 se denominó Segundo Domingo de Pasión o Domingo de Ramos. Entre los luteranos y anglicanos, este día se conoce como Domingo de la Pasión: Domingo de Ramos.[20] En muchas denominaciones litúrgicas, para conmemorar la entrada de Cristo en Jerusalén para cumplir su misterio pascual, es costumbre bendecir hojas de palma u otras ramas, por ejemplo, ramas de olivo. La ceremonia de bendición incluye la lectura de un relato del Evangelio en el que Jesús entra humildemente en Jerusalén montado en un burro, lo que recuerda la procesión de la victoria de David, y la gente coloca palmas y otras ramas en el suelo ante él. Inmediatamente después de este gran momento de celebración por la entrada de Jesús en Jerusalén, comienza su camino hacia la cruz. Así, a la bendición le sigue una procesión o entrada solemne en la iglesia, con los participantes sosteniendo las ramas bendecidas en sus manos. La liturgia incluye la lectura solemne de la Pasión, la narración de la captura, el sufrimiento y la muerte de Cristo, tal y como se relata en uno de los Evangelios sinópticos. En la Misa Tridentina la Pasión es siempre la de San Mateo.[21] Antes de la reforma del rito por parte del papa Pío XII, la bendición de las palmas se realizaba dentro de la iglesia, en el marco de una liturgia que seguía el esquema general de una misa, con colecta, epístola y evangelio, hasta el Sanctus. A continuación, se bendecían las palmas con cinco oraciones y se realizaba una procesión fuera de la iglesia, que a su regreso incluía una ceremonia de reapertura de las puertas, que entretanto se habían cerrado. Después de esto se celebraba la misa normal.[22] Las iglesias de muchas denominaciones, incluidas las tradiciones luterana, católica, metodista, anglicana, morava y reformada, distribuyen ramas de palma a sus feligreses durante las liturgias del Domingo de Ramos. Los cristianos llevan estas palmas, que a menudo son bendecidas por el clero, a sus hogares, donde las cuelgan junto a arte cristiano (especialmente cruces y crucifijos) o las guardan en sus Biblias o devocionarios.[23] Lunes Santo y Martes Santo [editar]Los días entre el Domingo de Ramos y el Jueves Santo se conocen como Lunes Santo, Martes Santo (Martes de Figos) y Miércoles Santo (Miércoles de Espías). Existen celebraciones tradicionales que llevan a cabo las denominaciones litúrgicas para conmemorar los acontecimientos de los últimos días de la vida de Jesucristo. Entre ellas: - El Lunes Santo, los acontecimientos que se conmemoran en la liturgia pueden incluir a Jesús maldiciendo la higuera, la purificación del Templo, el cuestionamiento de la autoridad de Jesús y la unción de Jesús en Betania (12:1–11), un acontecimiento que en el Evangelio de Juan ocurrió antes del Domingo de Ramos, como en Juan 12:12–19. - El Martes Santo, algunos observan las predicciones de Cristo sobre su propia muerte, tal y como se describen en Juan 12:20–36 y Juan 13:21–38. (En la misa tridentina se lee en su lugar la Pasión según San Marcos). Miércoles Santo (Miércoles de Espías) [editar]El Miércoles Santo,[24] se recuerda la historia de Judas acordando su traición a Jesús con los principales sacerdotes; él era un espía entre los discípulos de Jesús (26:14–25).[25] Por esta razón, a veces se le llama «Miércoles del Espía».[2] (En la misa tridentina se lee en su lugar la Pasión según San Lucas). Otros acontecimientos relacionados con esta fecha incluyen los sucesos en la casa de Simón el Leproso, especialmente la unción de Jesús por María de Betania, que precedió directamente a la traición de Jesús por Judas al Sanedrín.[26] Tenebrae (latín para «sombras» u «oscuridad») se celebra dentro del cristianismo occidental durante la Semana Santa, especialmente el Miércoles Santo.[27][28] El Tenebrae se caracteriza por el apagado gradual de las velas mientras se canta o se recita una serie de lecturas y salmos. Las liturgias de Tenebrae son celebradas por algunas parroquias del rito romano de la Iglesia católica, la Iglesia Nacional Católica Polaca, las Iglesias luteranas, la Iglesia morava, la Comunión anglicana, las iglesias metodistas y la ortodoxia de rito occidental dentro de la Iglesia ortodoxa oriental.[29] Jueves Santo [editar]El Jueves Santo conmemora la Última Cena, en la que Cristo establece el modelo de la Eucaristía o Santa Comunión. Durante la cena, Jesús predijo los acontecimientos que seguirían inmediatamente, incluyendo su traición, las negaciones de Pedro, y su muerte y resurrección. La celebración litúrgica de la Última Cena el Jueves Santo marca el comienzo del Triduo Pascual. Las parroquias católicas y luteranas practican tradicionalmente la ceremonia del lavatorio de pies (Maundy) el Jueves Santo, una práctica que también se mantiene en otras confesiones. [30] En la Iglesia católica, en este día está prohibida la celebración privada de la misa.[31] Por lo tanto, aparte de la Misa Crismal para la bendición de los Santos Óleos que el obispo diocesano puede celebrar en la mañana del Jueves Santo, pero también en algún otro día cercano a la Pascua, la única misa en este día es la Misa de la Cena del Señor, que inaugura el período de tres días conocido como el Triduo Pascual, que incluye el Viernes Santo, que se considera que comienza con la liturgia de la noche anterior, el Sábado Santo y el Domingo de Pascua hasta las oraciones vespertinas de ese día.[32] La Misa Crismal, cuyos textos el Misal Romano y las rúbricas utilizadas en las Iglesias luteranas ahora dan bajo el Jueves Santo, pero antes del Triduo Pascual que comienza esa noche, puede adelantarse al principio de la Semana Santa, para facilitar la participación del mayor número posible de clérigos de la diócesis junto con el obispo.[33] Esta misa no se incluyó en las ediciones del Misal Romano antes de la época del papa Pío XII. En esta misa, el obispo bendice aceites separados para los enfermos, utilizados en la Unción de los enfermos, para los catecúmenos, utilizados en el bautismo, y el crisma, utilizado en el bautismo, la confirmación y las Órdenes sagradas, así como en ritos como la dedicación de un altar y una iglesia.[34] La Misa de la Cena del Señor conmemora la Última Cena de Jesús con sus Doce Apóstoles, «la institución de la Eucaristía, la institución del sacerdocio y el mandamiento del amor fraternal que Jesús dio después de lavar los pies a sus discípulos».[35] Todas las campanas de la iglesia, incluidas las campanas del altar, pueden tocarse durante el Gloria in Excelsis Deo de la misa (el Gloria no se canta tradicionalmente los domingos de Cuaresma). A continuación, las campanas callan y el órgano y otros instrumentos musicales solo pueden utilizarse para acompañar el canto hasta el Gloria de la Vigilia Pascual.[36][30] El Misal Romano recomienda que, si se considera pastoralmente apropiado, el sacerdote celebre, inmediatamente después de la homilía, el rito del lavatorio de los pies de doce hombres, como es costumbre, recordando el número de los apóstoles.[37] En la Iglesia católica, las iglesias luteranas de orientación católica evangélica y las iglesias anglicanas de orientación anglo-católica, se consagra un número suficiente de hostias para su uso también en la liturgia del Viernes Santo, y al final, el Santísimo Sacramento se lleva en procesión a un lugar de reposición alejado del cuerpo principal de la iglesia, que, si se trata de un altar, a menudo se denomina «altar de reposo».[38][30] En algunos lugares, especialmente en Filipinas y Malta, los católicos van de iglesia en iglesia rezando en el altar de reposo de cada una de ellas, en una práctica llamada «Visita Iglesia» o Visita a las Siete Iglesias. En las iglesias luteranas, anglicanas y metodistas, el altar tiene paramentos negros o se retiran por completo los manteles del altar.[39][40] Al término de la liturgia del Jueves Santo en las iglesias luteranas, «el atril y el púlpito [también] se dejan desnudos hasta Pascua para simbolizar la humillación y la esterilidad de la cruz».[41] La costumbre metodista sostiene que, aparte de las representaciones de las Estaciones del Vía Crucis, otras imágenes (como la cruz del altar) continúan con la costumbre cuaresmal de permanecer veladas.[42] En la Iglesia católica, los altares de la iglesia (excepto el que se utiliza como altar de reposo) se despojan posteriormente y, en la medida de lo posible, se retiran las cruces de la iglesia (o se cubren con velos en el rito anterior al Concilio Vaticano II), los crucifijos y las estatuas se cubren con mantos violetas durante la Semana Santa, pero los mantos de los crucifijos pueden ser blancos en lugar de violetas el Jueves Santo. [43] Ritual de Semana Santa [editar]Es un libro litúrgico donde aparece toda la liturgia de la Semana Santa como es: Domingo de Ramos, Lunes, Martes y Miércoles Santo; y donde aparece el triduo pascual que comienza el Jueves Santo con la Santa Cena del Señor. Continúa con el Viernes Santo donde se celebra la pasión y muerte del Señor, el Sábado de Gloria que es el último día de este triduo pascual y el Domingo de Resurrección para celebrar que Jesús ha resucitado. Es un libro católico sacerdotal que tiene lecturas y oraciones propios de la Semana Santa. Viernes Santo [editar]El Viernes Santo conmemora la crucifixión de Jesús y su posterior muerte. Las conmemoraciones suelen ser solemnes y tristes, y muchas confesiones religiosas aprovechan el Viernes Santo para realizar el Vía Crucis u otras conmemoraciones de la Pasión, ya sea como un momento de reflexión y veneración autoguiado o como una procesión de estatuas o imágenes de las estaciones. La celebración litúrgica vespertina del Jueves Santo da comienzo al primero de los tres días del Triduo Pascual, que continúa en un ambiente de duelo litúrgico durante todo el día siguiente, a pesar del nombre de «bueno» que se le da en inglés a este día. Para los cristianos católicos, metodistas, luteranos, reformados y anglicanos, el Viernes Santo se celebra ampliamente como un día de ayuno.[44] El «Manual para la disciplina de la Cuaresma» recomienda la pauta luterana de «ayunar el Miércoles de Ceniza y el Viernes Santo con una sola comida sencilla durante el día, normalmente sin carne».[45] La práctica de la Iglesia católica occidental es tomar solo una comida completa y, si es necesario, dos pequeños tentempiés que, juntos, no constituyen una comida completa. La Comunión Anglicana define el ayuno de forma más genérica como: «La reducción de la cantidad de comida ingerida».[46] En algunos países, como Malta, Filipinas, Italia y España, se celebran procesiones con estatuas que representan la Pasión de Cristo. - La Iglesia llora la muerte de Cristo, venera la cruz y se maravilla de su vida por su obediencia hasta la muerte. - En la Iglesia católica, los únicos sacramentos que se celebran son la penitencia y la unción de los enfermos. Aunque no se celebra la Eucaristía, la Sagrada Comunión se distribuye a los fieles solo en la Celebración de la Pasión del Señor, pero se puede llevar a cualquier hora a los enfermos que no pueden asistir a esta liturgia. - Fuera de la celebración litúrgica de la tarde, el altar permanece completamente desnudo en las iglesias católicas, sin mantel, candelabros ni cruz. En las iglesias luteranas y metodistas, el altar suele estar cubierto con un paño negro. - Es costumbre vaciar las pilas de agua bendita en preparación para la bendición del agua en la Vigilia Pascual.[47] - La celebración de la Pasión del Señor tiene lugar por la tarde, idealmente a las tres en punto, pero por razones pastorales se puede elegir una hora más tardía. - En la Iglesia católica, el color de las vestiduras es el morado. La Iglesia luterana, la Iglesia metodista y la Iglesia presbiteriana siguen utilizando el negro, como era la práctica de la Iglesia católica hasta 1970. Si la celebra un obispo, este lleva una mitra sencilla. - La liturgia del rito romano consta de tres partes: la liturgia de la palabra, la veneración de la cruz y la comunión. - Liturgia de la Palabra - «Postración» del celebrante ante el altar. - Se leen las lecturas del Isaías 53 (sobre el Siervo Sufriente) y la Epístola a los Hebreos. - Se canta o se lee la narración de la Pasión del Evangelio de Juan, a menudo dividida entre más de un cantante o lector. - Intercesiones generales: La congregación reza por la Iglesia, el Papa, los judíos, los no cristianos, los no creyentes y otros. - Veneración de la Cruz: Se descubre solemnemente un crucifijo ante la congregación. El pueblo lo venera de rodillas. Durante esta parte, a menudo se cantan los «Reproches». - Distribución de la Sagrada Comunión: Se distribuyen entre el pueblo las hostias consagradas en la misa del día anterior. (Antes de la reforma del Papa Pío XII, solo el sacerdote recibía la comunión en el marco de lo que se denominaba la «Misa de los Presantificados», que incluía las oraciones habituales del Ofertorio, con la colocación del vino en el cáliz, pero que omitía el Canon de la Misa.[22]) La liturgia del Viernes Santo no es una misa y, de hecho, está prohibido celebrar la misa católica el Viernes Santo. Lo que se distribuye es la Eucaristía consagrada la noche anterior (Jueves Santo). - Aunque se utilice música en la liturgia, no se utiliza para abrir y cerrar la liturgia, ni hay una procesión formal de clausura. - La solemnidad y la sobriedad de la ocasión han favorecido la persistencia a lo largo de los siglos de formas litúrgicas sin modificaciones sustanciales. - En algunos países, especialmente en Inglaterra, era costumbre colocar una ostensorio velado con el Santo Sacramento o una cruz en un Santo Sepulcro.[48] - Si los crucifijos se cubrieron a partir del penúltimo domingo de Cuaresma, se descubren sin ceremonia después de la liturgia del Viernes Santo. En algunas parroquias de la Iglesia Anglicana, la Iglesia Católica, la Iglesia Luterana y la Iglesia Metodista, se observa la «Devoción de las Tres Horas». Tradicionalmente, consiste en una serie de sermones, intercalados con cantos, uno sobre cada una de las Siete últimas palabras de la cruz, junto con una introducción y una conclusión.[49][50] Otro ejercicio piadoso que se lleva a cabo el Viernes Santo es el de las Estaciones de la Cruz, ya sea dentro de la iglesia o fuera de ella. La celebración en el Coliseo con la participación del Papa se ha convertido en un evento tradicional.[51] La Novena a la Divina Misericordia comienza ese día y dura hasta el sábado anterior al Día de la Misericordia.[52][53] Los moravos celebran una Fiesta del Amor el Viernes Santo, ya que reciben la Sagrada Comunión el Jueves Santo. Los comulgantes de la Iglesia Morava practican la tradición del Viernes Santo de limpiar las lápidas de los cementerios moravos.[54] |Divina Misericordia]] comienza ese día y dura hasta el sábado anterior al Día de la Misericordia.[52][53] Sábado Santo (Sábado Negro) [editar]El Sábado Santo es el día entre la crucifixión de Jesús y su resurrección. Al ser día de reposo, todos los evangelios relatan que Jesús fue enterrado apresuradamente en una tumba excavada en la roca tras su crucifixión, con la intención de completar los rituales funerarios y de embalsamamiento el domingo, una vez finalizado el día de reposo, ya que las prohibiciones de este día habrían impedido a los judíos observantes llevar a cabo un entierro adecuado. En la tradición católica, después del servicio del Viernes Santo, que representa el entierro de Jesús, hasta la Vigilia Pascual del sábado por la noche, no se celebra ninguna misa en el Sábado Santo. La celebración de la Vigilia Pascual pertenece litúrgicamente al Domingo de Pascua. En el Sábado Santo, la Iglesia espera en la tumba del Señor, en oración y ayuno, meditando sobre su Pasión y Muerte y sobre su Descenso a los Infiernos y esperando su Resurrección. La Iglesia se abstiene del sacrificio de la misa, dejando la mesa sagrada desnuda, hasta después de la solemne vigilia, es decir, la anticipación nocturna de la resurrección, cuando llega el momento de las alegrías pascuales, cuya abundancia se desborda hasta ocupar cincuenta días. La Sagrada Comunión solo puede administrarse en este día como Viático.[55] En algunas iglesias anglicanas, incluida la Iglesia Episcopal en los Estados Unidos, se prevé una liturgia sencilla de la palabra con lecturas que conmemoran el entierro de Cristo. Las puertas del tabernáculo vacío del altar mayor se dejan abiertas, para simbolizar que Jesucristo se ha ido. La lámpara o vela que suele situarse junto al tabernáculo para indicar la presencia de Cristo se apaga. [56] En las tradiciones católica, anglicana, luterana, metodista y presbiteriana, la Vigilia Pascual, una de las liturgias más largas y solemnes, dura hasta tres o cuatro horas y consta de cuatro partes:[15][57] - El Servicio de la Luz - La Liturgia de la Palabra - La Liturgia del Bautismo: Los sacramentos del Bautismo y la Confirmación para los nuevos miembros de la Iglesia y la Renovación de las Promesas Bautismales por parte de toda la congregación. - Eucaristía La liturgia comienza después de la puesta del sol del Sábado Santo, cuando la multitud se reúne dentro de la iglesia a oscuras. En la oscuridad (a menudo en una capilla lateral del edificio de la iglesia o, preferiblemente, fuera de la iglesia), se enciende un nuevo fuego que es bendecido por el sacerdote. Este nuevo fuego simboliza la luz de la salvación y la esperanza que Dios trajo al mundo a través de la resurrección de Cristo, disipando la oscuridad del pecado y la muerte. Con este fuego se enciende el candelabro pascual, que simboliza la luz de Cristo. Este cirio pascual se utilizará durante toda la temporada de Pascua, permaneciendo en el santuario de la iglesia o cerca del atril, y se conserva en el baptisterio durante todo el año litúrgico para que, en las celebraciones de bautismos, las velas de los bautizados puedan encenderse con el cirio.[58] Las velas de los presentes se encienden con el cirio pascual. A medida que esta simbólica «luz de Cristo» se extiende entre los reunidos, la oscuridad va disminuyendo. Un diácono, o el sacerdote si no hay diácono, lleva el cirio pascual a la cabeza de la procesión de entrada y, en tres puntos, se detiene y canta la proclamación «La luz de Cristo» (hasta la Pascua de 2011, el texto oficial en inglés era «Christ our Light»), a lo que el pueblo responde «Demos gracias a Dios». Una vez que la procesión concluye con el canto de la tercera proclamación, se encienden las luces de toda la iglesia, excepto las velas del altar. A continuación, el diácono o un cantor canta el Exultet, también llamado «Proclamación Pascual». Después, los fieles apagan sus velas y se sientan para la Liturgia de la Palabra.[59] La Liturgia de la Palabra incluye nueve lecturas, siete (o al menos tres) del Antiguo Testamento, seguidas de dos del Nuevo (una epístola y un evangelio). La lectura del paso del Mar Rojo (Éxodo 14) nunca debe omitirse. Cada lectura del Antiguo Testamento va seguida de un salmo o cántico (como Éxodo 15:1-18) y una oración que relaciona lo leído con el Misterio de Cristo.[59] Una vez concluidas las lecturas del Antiguo Testamento, se entona el Gloria in excelsis Deo, que ha estado suspendido durante la Cuaresma, y se tocan las campanas. Se proclama una lectura de la Epístola a los Romanos. Se canta el Aleluya por primera vez desde el comienzo de la Cuaresma. A continuación, se lee el Evangelio de la Resurrección, junto con la salmo responsorial.[59] Tras la conclusión de la liturgia de la palabra, se bendice el agua de la pila bautismal y los catecúmenos o candidatos a la plena comunión son iniciados en la Iglesia mediante el bautismo o la confirmación. Tras la celebración de estos sacramentos de iniciación, la congregación renueva sus votos bautismales y recibe la aspersión de agua bautismal. A continuación tienen lugar las intercesiones generales.[59] Tras la liturgia del bautismo, la liturgia de la Eucaristía continúa como de costumbre. Esta es la primera misa del día de Pascua. Durante la Eucaristía, los recién bautizados reciben la Sagrada Comunión por primera vez siempre que tengan la edad adecuada y los conocimientos precisos. Según las rúbricas del Misal, la vigilia pascual «termina antes del amanecer del domingo».[60] Día de Pascua [editar]El Domingo de Pascua (o Domingo de Resurrección), que sigue inmediatamente a la Semana Santa y comienza con la Vigilia Pascual, es la gran fiesta y el apogeo del año litúrgico cristiano: en este día se celebra la resurrección de Jesucristo. Es el primer día de la nueva temporada de los Cincuenta Días, o Tiempo Pascual, que va desde el Domingo de Pascua hasta el Domingo de Pentecostés. La resurrección de Cristo el día de Pascua es la razón principal por la que los cristianos celebran cada domingo como el día principal de observancia religiosa. Indulgencia plenaria [editar]En la Iglesia católica romana, la indulgencia plenaria se lucra una vez al día según el Enchiridion Indulgentiarum de 1999, en los siguientes casos:[61] - Adoración del Santo Sacramento durante al menos media hora; - El piadoso ejercicio del Vía Crucis; - Recitación del Rosario mariano o del himno «Akathistos», en una iglesia u oratorio; o en una familia, una comunidad religiosa, una cofradía de fieles o, en general, cuando varios fieles se reúnen con cualquier buen propósito; - Lectura o escucha devota de las Sagradas Escrituras durante al menos media hora.[cita requerida] Celebraciones de la Semana Santa [editar]Entre las ciudades famosas por sus procesiones de Semana Santa se encuentran: Brasil [editar]La Semana Santa se ha convertido en uno de los principales símbolos de identidad comunitaria de Brasil, más concretamente en la ciudad sureña de Campanha. La Semana Santa de Campanha comienza el lunes por la tarde con la Procesión del Depósito. La figura de Nuestro Señor de las Estaciones, que representa a Jesús manchado de sangre llevando la cruz, se saca de la iglesia en una gran caja negra y se expone en la plaza principal. A continuación, es llevada solemnemente a la iglesia, seguida de una banda y una procesión de personas.[62][63] Fuera de la iglesia, se pronuncia un sermón sobre la historia pascual de la muerte y resurrección de Jesucristo. Tras el sermón, un coro dentro de las puertas abiertas de la iglesia canta el Miserere de Manoel Dias de Oliveria, mientras se introduce la caja negra en la iglesia y la gente entra para besar la figura de Cristo a tamaño real. Las procesiones del martes y el miércoles se detienen en diferentes capillas, en cada una de las cuales hay un gran cuadro que representa episodios del Vía Crucis y se canta un himno relacionado con ellos. El jueves por la mañana se celebra la Misa Crismal, con la bendición de los óleos.[62][63] Las ceremonias de la tarde del Viernes Santo son seguidas por el principal espectáculo de la semana, el Descendimiento de la Cruz frente a la catedral, seguido de la Procesión Fúnebre de Nuestro Señor Muerto. La representación muestra a Cristo siendo bajado de la cruz y colocado en un ataúd, que luego es llevado en procesión al son de la «Canción de Verónica». El sábado por la mañana, los jóvenes representan una obra teatral.[62][63] La noche siguiente se celebra la Vigilia Pascual y las calles se transforman en un hermoso despliegue de intrincadas y coloridas alfombras para preparar el día siguiente. El Domingo de Pascua comienza antes del amanecer con los cantos del coro y las actuaciones de la banda para celebrar la resurrección de Cristo. A las campanas y los fuegos artificiales les sigue una misa que termina con el «Coro Aleluya».[62][63] Guatemala [editar]La Semana Santa en Guatemala incluye procesiones con imágenes de santos transportadas en enormes plataformas de madera. Las pesadas andas son llevadas por los lugareños, tanto hombres como mujeres, que suelen vestir túnicas moradas. La procesión está encabezada por un hombre que lleva un recipiente con incienso, acompañado por una pequeña banda de trompas y flautas. Durante la semana de celebración, las calles se cubren con intrincadas alfombras. Las procesiones de Semana Santa comienzan al amanecer y todo el mundo se une a las festividades En Amatenango, la figura de Judas, que traicionó a Cristo, ha sido el centro de atención durante la Semana Santa maya. El sacerdote llama a Judas «el asesino de Cristo». La figura solía ser golpeada después de la representación de la crucifixión el Viernes Santo, pero ahora se trata con más calma.[64][65] Honduras [editar]Esta festividad se celebra en Comayagua. La tradición se sigue practicando tal y como la introdujeron los conquistadores españoles en el siglo XVI. Cada Semana Santa, la gente confecciona las famosas «alfombras de aserrín», unas alfombras de colores hechas con serrín de madera que representan escenas de la vida y muerte de Jesucristo de la Virgen María y otros santos o del Espíritu Santo. La Semana Santa también se celebra ampliamente en Tegucigalpa siguiendo tradiciones similares a las de Comayagua, principalmente en el centro histórico de la ciudad. Al igual que en Guatemala, la Semana Santa hondureña incorpora procesiones con imágenes de santos transportadas en enormes plataformas de madera. En otras comunidades, como Gracias Lempira y diferentes pueblos, también se celebra ampliamente. Italia [editar]La Semana Santa en Italia (Pasqua, Archivo de audio \"ˈpaskwa\" no encontrado) es una de las fiestas más importantes del país.[66] La Semana Santa (Settimana santa, Archivo de audio \"settiˈmaːna ˈsanta\" no encontrado) se celebra en algunas zonas del sur de Italia, especialmente en Sicilia. La más famosa es la Semana Santa de Trapani, que culmina con la Processione dei Misteri di Trapani o, simplemente, los «Misteri di Trapani» (en español, la Procesión de los Misterios de Trapani o los Misterios de Trapani). Se trata de una procesión de la Pasión que dura todo el día y en la que participan 20 carrozas con esculturas realistas hechas de madera, lienzo y pegamento. Estas esculturas representan escenas individuales de los acontecimientos de la Pasión, una representación teatral en el centro y la culminación de la Semana Santa en Trapani. Los Misteri se encuentran entre los eventos religiosos más antiguos de Europa que se celebran de forma ininterrumpida, ya que se representan cada Viernes Santo desde antes de la Pascua de 1612 y duran al menos 16 horas seguidas, aunque en ocasiones superan las 24 horas, lo que los convierte en las fiestas religiosas más largas de Sicilia y de Italia.[67] Otras Semanas Santas dignas de mención en Italia son la Semana Santa en Barcellona Pozzo di Gotto y la Semana Santa en Ruvo di Puglia. La Semana Santa en Barcellona Pozzo di Gotto tiene sus raíces en la historia de la Sicilia española (1516-1713), cuando toda la isla, sometida al dominio de la Corona de Aragón, junto con el Reino de Nápoles, pasa a estar bajo la jurisdicción de la Corona de España. En 1571, los «pozzogottesi» obtuvieron del Gran Tribunal del arzobispo de Messina permiso para elegir a su capellán destinado en San Vito, que ya no dependía del arcipreste de Milazzo. La primera procesión se llevó a cabo en 1621 como un movimiento de protesta contra los jurados de la ciudad de Milazzo, bajo cuya jurisdicción dependía Pozzo di Gotto política y físicamente, proporcionando un pueblo distante y como voto y promesa de romper el vínculo de subordinación que se interrumpió definitivamente el 22 de mayo de 1639. [68] Los ritos de la Semana Santa en Ruvo di Puglia son el principal evento que tiene lugar en la ciudad de Apulia. El folclore y las tradiciones sagradas o seculares, típicas de la tradición ruvestina, representan un gran atractivo para los turistas de las ciudades vecinas y del resto de Italia y Europa,[69] y han sido incluidas por el I.D.E.A. entre los eventos del patrimonio inmaterial de Italia. La prueba de la existencia de las primeras cofradías ruvestinas se encuentra en el políptico, una obra bizantina firmada por Z. T., que representa a la Virgen con el Niño y los cofrades y en la que figura la inscripción Hoc opus fieri fec(e)runt, confratres san(c)ti Cleti, anno salut(i)s 1537» y conservada en la iglesia del Purgatorio, en la nave izquierda, la dedicada a San Anacleto.[70] Triduo pascual [editar]Los días más importantes de la Semana Santa son los correspondientes al Triduo Pascual, que conmemoran la pasión, muerte y resurrección del Señor en Jerusalén . En la liturgia romana de la Iglesia católica, comprende desde la tarde del Jueves Santo —cuando concluye la Cuaresma— hasta el Domingo de Resurrección.[71] La fecha de la Semana Santa [editar]Es en el Concilio de Nicea I, en el año 325, donde se llega finalmente a una solución para este asunto. En él se estableció que la Pascua de Resurrección había de ser celebrada cumpliendo unas normas: - Que la Pascua se celebrase en un domingo. - Que no coincidiese nunca con la Pascua judía, que se realizaba independientemente del día de la semana (de esta manera se evitarían paralelismos o confusiones entre ambas religiones). - Que los cristianos no celebrasen nunca la Pascua dos veces en el mismo año. Esto tiene su explicación, porque el año nuevo empezaba con el equinoccio de primavera, por lo que se prohibía la celebración de la Pascua antes del equinoccio real (antes de la entrada del sol en Aries). No obstante, siguió habiendo diferencias entre la Iglesia de Roma y la Iglesia de Alejandría, si bien el Concilio de Nicea dio la razón a los alejandrinos, estableciéndose la costumbre de que la fecha de la Pascua se calculaba en Alejandría, que lo comunicaba a Roma, la cual difundía el cálculo al resto del cristianismo. Finalmente, Dionisio el Exiguo (en el año 525), desde Roma convenció de las bondades del cálculo alejandrino, unificándose al fin el cálculo de la Pascua cristiana. La Pascua de Resurrección es el domingo inmediatamente posterior a la primera luna llena tras el equinoccio de marzo, y se debe calcular empleando la luna llena astronómica. Por ello puede ocurrir no antes del 22 de marzo y el 25 de abril como máximo.[72][73] Días de la Semana Santa [editar]Estos son todos los días de Semana Santa: - Lunes Santo. Unción de Jesús en casa de Lázaro. Jesús expulsa a los mercaderes del Templo de Jerusalén. - Miércoles Santo. Judas Iscariote conspira con el Sanedrín para traicionar a Jesús por treinta monedas de plata. Celebraciones [editar]En gran parte del mundo existen celebraciones asociadas a la Semana Santa, algunas de ellas de un enorme interés a nivel internacional. Asia [editar]Filipinas [editar]En Filipinas, siendo un país de mayoría católica y antigua provincia española, se celebra la Semana Santa, también conocida como Mahal na araw en tagalo. La celebración empieza con el Domingo de Ramos (o Linggo ng Palaspas, 'Domingo de Palmas') y termina con el Linggo ng Pagkabuhay ('Domingo de la resurrección').[74] Días de la Semana Santa en Filipinas - Domingo de Ramos/Linggo ng Palaspas - Lunes Santo - Martés Santo - Miyérkoles Santo (Miércoles santo) - Huwebes Santo (Jueves Santo) - Biyernes Santo (Viernes Santo) - Sábado de Gloria - Linggo ng Pagkabuhay/Pasko ng Pagkabuhay (Domingo de la Resurrección) La Visita Iglesia es una tradición católica en la que los católicos visitan 7 diferentes iglesias entre el Huwebes Santo y el Biyernes Santo.[75] El Huwebes Santo indica el comienzo de los días no laborales, mientras que el Sábado de Gloria marca su fin. Europa [editar]España [editar]En España, son reconocidas de interés turístico internacional la Semana Santa de Palencia, Semana Santa de León, Semana Santa de Zamora, Semana Santa de Sevilla, Semana Santa de Granada, la Semana Santa en Málaga, la Semana Santa de Valladolid, de Cuenca, Zaragoza, Lorca, Córdoba, Medina del Campo, Viveiro, Toledo o Cartagena entre otras. Y son reconocidas de interés turístico nacional, la Semana Santa marinera de Valencia (2011), Semana Santa de Jerez de la Frontera (1993), la Pasión viviente de Castro Urdiales (2012), Los Picaos de San Vicente de la Sonriera (2005) y Semana Santa de Cáceres (2011) entre otras de igual titulación. Independientemente de la emoción que se vuelque en esta celebración, en todos los territorios españoles se conmemora la Pasión de Cristo Italia [editar]En Italia la Semana Santa es muy sentida, principalmente en el sur, se celebra la Semana Santa en más de 112 pueblos y ciudades, 83 solamente en Sicilia. América [editar]México [editar]En México es destacada como días santos, su celebración se lleva a cabo en varias entidades del país pero sobre todo destacan 2 principales, las cuales son conocidas por mayoría en algunas partes del mundo como lo son la representación de Taxco de Alarcón la segunda más importante del país y la primera y principalmente importante la cual es la Pasión de Cristo en Iztapalapa que se celebra año con año desde 1843 en esa demarcación de la Ciudad de México. Cabe destacar la particular Semana Santa de los pueblos Yoremes de los estados de Sinaloa y Sonora, es una celebración fascinante de carácter sincrético entre las tradiciones prehispánicas Mayo Yoreme y la tradición católica. Perú [editar]En Perú, destaca la Semana Santa en Ayacucho, evento religioso de mucho sincretismo, realizado ininterrumpidamente desde hace más de 150 años y con una duración inusual de diez días. También sobresale la"
}