{
  "url": "https://www.chathamsquareapartments.com/4-bedroom-apartments-orlando/",
  "title": "4 Bedroom Apartments in Orlando | Chatham Square",
  "text": "4 BEDROOM APARTMENTS IN ORLANDO Explore one of the most exciting cities in Florida when you live at Chatham Square. With a unique location just minutes from the biggest amusement parks in the country, our 1 bedroom, 2 bedroom, 3 bedroom, and 4 bedroom apartments in Orlando have many luxurious features and community amenities. Experience endless ways to have fun and relax when you live at Chatham Square. Floor Plans We have stunning 4 bedroom apartments in Orlando that make having staycations easy and comfortable. Our D1 floor plan is perfect for roommates or your growing family with multiple bathrooms and a spacious living space. A full-size washer and dryer are included in every unit, making those weekend chores as easy as could be. Enjoy having extra storage space with your large closets and patio storage as well. Our D1g floor plan has everything you need and more, including an attached garage. Step out onto your private patio and breathe in the fresh air after a long day. When you live in our D2 floor plan, each resident gets their own walk-in closet to store their favorite outfits and personal belongings. Indulge in our newly renovated interiors, complete with modern cabinetry, sleek countertops, and new flooring. No matter what you’re looking for, you’ll never want to leave our 4 bedroom apartments in Orlando. Community Amenities Even though living in Orlando gives you access to many incredible and fun things to do, our community at Chatham Square will make you never want to leave. Dive into luxury with our resort-style swimming pool, or just lounge on our expansive sundeck. You can even barbecue for friends and neighbors at our grilling station, or play with friends on our outdoor pool table or outdoor ping pong table. Step into our beautiful clubhouse and break a sweat in our fitness center with free weights and the latest equipment. If you’d prefer to work out outside, bring a group of friends for a great match at our sand volleyball court. Our gated, pet-friendly community also has a business center that makes it easy to get all of your work done before embarking on a journey into Orlando. We have storage and garages available to you for any additional belongings. Chatham Square is just minutes away from the nearest veterinary clinic, Petco, and a dog park so you can take your furry friend wherever they need to go with ease. Shopping is also made easy with The Mall at Millenia and the Orlando Vineland Premium Outlets just a short drive away. Grab some groceries from Costco or Publix to enjoy a delicious home-cooked meal in your gourmet kitchen. You can even branch out and try new restaurants like Benihana, Ford’s Garage, and Da Silva Steakhouse. Dining options are endless when you live in our 4 bedroom apartments in Orlando. For those of you who enjoy learning new things and appreciating your local arts and culture, visit nearby attractions like the Dr. Phillips Center for the Performing Arts, the Orlando Science Center, and the Mead Botanical Garden. You can even take a drive to Disney World, Epcot, or SeaWorld with easy access from Chatham Square. Take advantage of our unique location and beautiful amenities when you stay in our 4 bedroom apartments in Orlando. Contact us to learn more about how you can turn Chatham Square into your home today!"
}