{
  "url": "https://www.aarp.org/health/conditions-treatments/dementia-warning-signs/",
  "title": "15 Early Warning Signs and Symptoms of Dementia",
  "text": "AARP Hearing Center You’re running late because you can’t find your keys. Of course, they’re buried in your bag. You walk into the living room to retrieve something important. What was it again? An acquaintance greets you in the grocery store. Her name escapes you. Moments of forgetfulness can happen at any age, and according to the National Institute on Aging (NIA), may happen even more as you age. Still, memory lapses can provoke anxiety for older adults who are often left wondering whether it’s all normal or a sign of something more serious. “It’s important for people not to be too upset at every little cognitive change,” says John Dickson, M.D., a neurologist at Massachusetts General Hospital in Boston. Still, research suggests many are. Results from a 2019 National Poll on Healthy Aging found that nearly half of respondents ages 50 to 64 are worried about developing dementia. Similarly, a 2021 survey from AARP found that nearly half of adults 40 and older think it’s likely they will get dementia. In reality, about 1 in 9 Americans 65 and older has dementia, according to the Centers for Disease Control and Prevention. While dementia is not inevitable, it is important to know the warning signs so that you or a loved one can get evaluated if there are concerns, Dickson says. Here’s what to look out for. What is dementia? Dementia is an umbrella term for a decline in mental ability that interferes with daily life. It can diminish focus, attention, language skills, problem solving and visual perception. Dementia can also make it difficult for a person to control emotions and can even lead to personality changes. More than 55 million people worldwide have dementia, according to the World Health Organization. 15 warning signs of dementia 1. Short-term memory loss. It’s one thing to forget the name of the actor who starred in the movie you went to see with friends yesterday. It’s another to forget you went to see a movie with friends yesterday. “Those more significant lapses” — especially when it comes to recent events — are concerning, says Judith Heidebrink, M.D., a neurologist and clinical professor at University of Michigan Health. Short-term memory loss can be a common symptom of Alzheimer’s disease, the most common type of dementia, Dickson says. “That’s because the short-term memory-forming center of the brain, called the hippocampus, is affected early in the disease process.” 2. Word loss. We’ve all experienced a time or two when your brain can’t find the right word, even though it’s on the tip-of-the-tongue. That can be normal, says Heather Whitson, M.D., a professor of medicine at Duke University School of Medicine and director of the Duke Center for the Study of Aging and Human Development. But if it’s happening a lot and you find that a person is substituting in words that don’t fit the conversation, that’s worrying. AARP Brain Health Resource Center Find in-depth journalism and explainers on diseases of the brain — dementia, stroke, Parkinson’s disease, mental-health topics. Learn about healthy habits that support memory and mental skills. For example, Whitson says, a person might want to ask, “Have you seen my jacket?” But when they can’t find the word for jacket, they ask, “Have you seen my shirt?” Another warning sign is difficulty joining, following or completing conversations. “Those types of communication skills can be an early symptom,” Heidebrink says. 3. Difficulty multitasking. If you’re someone who has always put out a Thanksgiving dinner without a hitch, and suddenly you find that staple side dishes are missing from the spread, the rolls are burned and dinner is delayed by two hours, that could signal something more serious is at play. “If it just doesn't seem like it's happening well, or it's happening with a lot more effort, that would be a sign that there are executive function issues,” Whitson says."
}