{
  "url": "https://www.imdb.com/title/tt5535276/",
  "title": "Maestro (2023) - IMDb",
  "text": "This love story chronicles the lifelong relationship of conductor-composer Leonard Bernstein and actress Felicia Montealegre Cohn Bernstein.This love story chronicles the lifelong relationship of conductor-composer Leonard Bernstein and actress Felicia Montealegre Cohn Bernstein.This love story chronicles the lifelong relationship of conductor-composer Leonard Bernstein and actress Felicia Montealegre Cohn Bernstein. - Nominated for 7 Oscars - 27 wins & 180 nominations total - Director - Writers - All cast & crew - Production, box office & more at IMDbPro Featured reviews Even with its 4 strong nominations at the Golden Globes (Picture, Director, Actor, Actress), I must say my appreciation of Cooper's new film is not as stellar, as organic and fantastic as A Star Is Born (2018) - 8 Oscar noms. Netflix's firs real Oscar contender was Alfonso Cuarón's Roma (2018) which won 3 of its 10 nominations. Last year's Germany's remake of All Quiet on the Western Front (2022) was nominated for 9 Oscars and won 4. My all-time Netflix favorite is Noah Baumbach's Marriage Story which I rewatched recently. It is much better than that year's Best Picture co-nominee Martin Scorsese's The Irishman (2019) which was still as solid movie. Neither won and Netflix's overall 8 Best Picture nominees did not win since a decade at the Oscars. This year, Scorsese produces Maestro (2023) with Spielberg, but his own slow burn of a movie Killers of the Flower Moon (2023) has more flair yet not a Netflix production (he produces it with DiCaprio). I think this year's Netflix better picture is Todd Haynes's May December (2023 - also nominated for 4 Golden Globes). So why did Bradley Cooper not exactly deliver? Carey Mulligan's performance is certainly good, yet his directing lacks the creation of intimacy like he did with Lady Gaga in A Star Is Born. Most interactions are superficial, and you have to wait until the 75th minute to see the first powerful scene with strong dialogue and directing. The intro scenes are compelling up until the two main characters meet, but I found the rest of the first hour a mess. The second half of the film is surely better yet lacks urgency or dramatic tension in directing, even in the hospital scene. There is also a shortage of real wisdom or realisation in the script. We are left with a light and superficial understanding of the two main characters, even to the point where their respective love for music and acting and their love for each other is not really felt. Nolan's Oppenheimer (2023) was much more successful in that aspect and Emily Blunt's performance. Cooper's acting also lacked some charm in my view, save perhaps a few scenes like in the end when he teaches a young conductor. Finally, Cooper's directing choices for cinematography left the very talented Matthew Libatique with not much to work with. In Black & White, 4:3 aspect ratio or even 16:9 color, few scenes seem to tell the story like a more claustrophobic The Whale (2022) was able to with his Darren Aronofsky collaboration. Libatique was nominated for an Oscar for his work with Aronofsky's fantastic Black Swan (2011) and with Cooper's sublime A Star is Born (2018). Better luck next time Coop! Good effort. 6.5/10. We can still see growth, grit and gusto, but misses the mark as a whole. Netflix's firs real Oscar contender was Alfonso Cuarón's Roma (2018) which won 3 of its 10 nominations. Last year's Germany's remake of All Quiet on the Western Front (2022) was nominated for 9 Oscars and won 4. My all-time Netflix favorite is Noah Baumbach's Marriage Story which I rewatched recently. It is much better than that year's Best Picture co-nominee Martin Scorsese's The Irishman (2019) which was still as solid movie. Neither won and Netflix's overall 8 Best Picture nominees did not win since a decade at the Oscars. This year, Scorsese produces Maestro (2023) with Spielberg, but his own slow burn of a movie Killers of the Flower Moon (2023) has more flair yet not a Netflix production (he produces it with DiCaprio). I think this year's Netflix better picture is Todd Haynes's May December (2023 - also nominated for 4 Golden Globes). So why did Bradley Cooper not exactly deliver? Carey Mulligan's performance is certainly good, yet his directing lacks the creation of intimacy like he did with Lady Gaga in A Star Is Born. Most interactions are superficial, and you have to wait until the 75th minute to see the first powerful scene with strong dialogue and directing. The intro scenes are compelling up until the two main characters meet, but I found the rest of the first hour a mess. The second half of the film is surely better yet lacks urgency or dramatic tension in directing, even in the hospital scene. There is also a shortage of real wisdom or realisation in the script. We are left with a light and superficial understanding of the two main characters, even to the point where their respective love for music and acting and their love for each other is not really felt. Nolan's Oppenheimer (2023) was much more successful in that aspect and Emily Blunt's performance. Cooper's acting also lacked some charm in my view, save perhaps a few scenes like in the end when he teaches a young conductor. Finally, Cooper's directing choices for cinematography left the very talented Matthew Libatique with not much to work with. In Black & White, 4:3 aspect ratio or even 16:9 color, few scenes seem to tell the story like a more claustrophobic The Whale (2022) was able to with his Darren Aronofsky collaboration. Libatique was nominated for an Oscar for his work with Aronofsky's fantastic Black Swan (2011) and with Cooper's sublime A Star is Born (2018). Better luck next time Coop! Good effort. 6.5/10. We can still see growth, grit and gusto, but misses the mark as a whole. The acting is superb and particularly Carey Mulligan who is astonishing, as usual, and Bradley Cooper's transformation is incredible. The look and feel throughout is very polished. But, and this isn't a minor quibble -- I found it really hard to understand the dialogue! Characters speak so quickly, in a mumble, that I actually considered putting on subtitles. Anyway, it wouldn't have made a difference, I thought the movie was so empty and plotless and uninteresting. There was really no tension in the wife's dealing with her husband's bisexuality, no real exploration or understanding of Bernstein's conflicts, and no delving into his achievements or their context, so there wasn't much left! This movie is not real. It exists only as a selfish desire to be award bait from all involved. It's not the first one and not the last one. But it feels so devoid of realness that it hurts. It is also a contradiction because the actors are very capable of bringing a kind of realness that is necessary for bringing the characters to life but the realness is so painfully manufactured and not natural...it doesn't have that cinema magic, it's all in the eyes. They were patting themselves on the back after every scene: \"My, my, this is so \"insert generic award here\" worthy.\" I'm talking here about the technical aspects as well. The black and white left me cold. It's not a bad movie in any sense. I just wanted to be fooled more and not be so paperthin and melodramatic. It's not a bad movie in any sense. I just wanted to be fooled more and not be so paperthin and melodramatic. I was very excited when I heard Maestro was coming out. With all this filmmaking firepower, it would have to be worthy of its subject. Now I've seen the movie and am stunned by the wasted talent and energy expended for what turned into another movie about rich, talented people who appear to have it all, but get sad and emotional just like the rest of us. They just talk about it a LOT more. The film is beautifully photographed, but I have no idea what the format change and the black and white to color change accomplished. The acting was good, but rather than being shown that the characters are going through something emotional, we are told, All these immensely talented people seem to talk about is their feelings, not their motivations, plans and aspirations. Leonard Bernstein wrote and conducted some of the most memorable music of the 20th century. He singlehandedly (with help from Bugs Bunny) kept interest in classical music alive when jazz and rock were kings. But we learn nothing of this in this film. Bernstein's talents and accomplishments are presented as facts, without exploration. What a waste. The film is beautifully photographed, but I have no idea what the format change and the black and white to color change accomplished. The acting was good, but rather than being shown that the characters are going through something emotional, we are told, All these immensely talented people seem to talk about is their feelings, not their motivations, plans and aspirations. Leonard Bernstein wrote and conducted some of the most memorable music of the 20th century. He singlehandedly (with help from Bugs Bunny) kept interest in classical music alive when jazz and rock were kings. But we learn nothing of this in this film. Bernstein's talents and accomplishments are presented as facts, without exploration. What a waste. Think of a biopic of a famous person as like a complex cake - you can carefully dissect one slice of it to examine the contents, or you can bravely try to examine the whole lot to see what it's made of. This biopic of American composer and conductor Leonard Bernstein is like looking at only the surface of the cake through a slice of Swiss cheese - a lot of loosely connected vignettes with no depth. If you don't know much about the man, you would leave the theatre with no great insights about him. The film jumps around in time and gives you snippets of the man's life and work. There are scenes about his bisexuality and penchant for men, his role as a conductor and composer, his drug addictions and his relationship with his daughter, but none of these are examined in any depth at all. His bipolar relationship with his wife and her later death from cancer are given the most screen time, but still feels unfulfilled and lacking in substance. Bradley Cooper directs in a rather disjointed style. The first half is shot in black and white, then we change to colour for no good reason except maybe historical chronology - it doesn't work. Neither does the curiously tight aspect ratio, which again inexplicably opens up to full screen near the end. Some scenes are beautifully shot but too often Cooper relies on the slow zoom in and the very long takes, which don't always seem to match the scene. The film also could have ended perfectly with the penultimate scene, but inexplicably ruins the moment with one extra shot that completely fails to land. Carey Mulligan is excellent as Bernstein's wife but Cooper as Bernstein doesn't quite work for me. He tends to overact, gives you little insight into the man himself, and the nasal voice starts to grate after a while - maybe it was inevitable with the prosthetic nose he was required to wear. Even the grand concert scene in the cathedral, conducting his beloved Mahler, didn't quite generate the depth of feeling it could have - contrast this with the Tchaikovsky concert scene in the French-Russian film Le Concert, which takes emotion (actors and viewers) to a much higher level. All in all this is not a bad movie, and to be fair it does engage the viewer a little more in the second half. But it tackles too many themes with a disturbing superficiality, giving very little substance to almost any. It could have been a lot better. No doubt however it will get lots of Oscar nominations, but then the Academy lost the plot years ago and succumbs to hype more than merit. This biopic of American composer and conductor Leonard Bernstein is like looking at only the surface of the cake through a slice of Swiss cheese - a lot of loosely connected vignettes with no depth. If you don't know much about the man, you would leave the theatre with no great insights about him. The film jumps around in time and gives you snippets of the man's life and work. There are scenes about his bisexuality and penchant for men, his role as a conductor and composer, his drug addictions and his relationship with his daughter, but none of these are examined in any depth at all. His bipolar relationship with his wife and her later death from cancer are given the most screen time, but still feels unfulfilled and lacking in substance. Bradley Cooper directs in a rather disjointed style. The first half is shot in black and white, then we change to colour for no good reason except maybe historical chronology - it doesn't work. Neither does the curiously tight aspect ratio, which again inexplicably opens up to full screen near the end. Some scenes are beautifully shot but too often Cooper relies on the slow zoom in and the very long takes, which don't always seem to match the scene. The film also could have ended perfectly with the penultimate scene, but inexplicably ruins the moment with one extra shot that completely fails to land. Carey Mulligan is excellent as Bernstein's wife but Cooper as Bernstein doesn't quite work for me. He tends to overact, gives you little insight into the man himself, and the nasal voice starts to grate after a while - maybe it was inevitable with the prosthetic nose he was required to wear. Even the grand concert scene in the cathedral, conducting his beloved Mahler, didn't quite generate the depth of feeling it could have - contrast this with the Tchaikovsky concert scene in the French-Russian film Le Concert, which takes emotion (actors and viewers) to a much higher level. All in all this is not a bad movie, and to be fair it does engage the viewer a little more in the second half. But it tackles too many themes with a disturbing superficiality, giving very little substance to almost any. It could have been a lot better. No doubt however it will get lots of Oscar nominations, but then the Academy lost the plot years ago and succumbs to hype more than merit. Did you know - TriviaOf the scene in which Leonard Bernstein conducts the London Symphony Orchestra at the Ely Cathedral in 1976, Bradley Cooper said, \"That scene I was so worried about because we did it live... I was recorded live. I had to conduct them. And I spent six years learning how to conduct six minutes and 21 seconds of music. I was able to get the raw take where I just watched Leonard Bernstein [conduct] at Ely Cathedral... And so I had that to study.\" - GoofsThe day after Bernstein makes his wildly successful debut with the N.Y. Philharmonic in November of 1943, the story is carried on the front page of the N.Y. Times. One of his friends notes that the front page also includes a headline reading \"Hitler Bombs Poland.\" Germany had bombed and conquered Poland in September, 1939, so the country had already been under German occupation for over four years at the time of Bernstein's debut concert. - Quotes Leonard Bernstein: Summer sang in me a little while, it sings in me no more. Edna St. Vincent Millay. Felicia Montealegre: If the summer doesn't sing in you, then nothing sings in you. And if nothing sings in you, then you can't make music. - ConnectionsFeatured in Chris Plante: The Right Squad: Episode #1.70 (2023) - How long is Maestro?Powered by Alexa Details - Release date - Countries of origin - Official site - Language - Also known as - Rybernia - Filming locations - Production companies - See more company credits at IMDbPro Box office - Budget - $80,000,000 (estimated) - Gross worldwide - $383,532 - Runtime - 2h 9m(129 min) - Color - Sound mix - Aspect ratio - 1.33 : 1 Contribute to this page Suggest an edit or add missing content"
}