{
  "url": "https://www.behindthename.com/name/laura",
  "title": "Meaning, origin and history of the name Laura - Behind the Name",
  "text": "Gender Feminine Usage English, Spanish, Italian, Portuguese, Romanian, Catalan, French, Finnish, Estonian, Hungarian, Polish, Slovene, Croatian, Czech, Slovak, Swedish, Norwegian, Danish, German, Dutch, Lithuanian, Latvian, Late Roman Pronounced Pron. /ˈlɔɹ.ə/(English) /ˈlau̯.ɾa/(Spanish) /ˈlau̯.ra/(Italian, Czech, Slovak) /ˈlaw.ɾɐ/(Portuguese) /ˈlau.ra/(Romanian) /ˈlaw.ɾə/(Catalan) /lɔ.ʁa/(French) /ˈlɑu̯.rɑ/(Finnish) /ˈlɒ.u.rɒ/(Hungarian) /ˈlaw.ra/(Polish) LOW-rah(Swedish, Norwegian, Danish) /ˈlaʊ̯.ʁa/(German) /ˈlɑu̯.raː/(Dutch) [key·simplify] Meaning & History Feminine form of the Late Latin name Laurus, which meant \"laurel\". This meaning was favourable, since in ancient Rome the leaves of laurel trees were used to create victors' garlands. The name was borne by the 9th-century Spanish martyr Saint Laura, who was a nun thrown into a vat of molten lead by the Moors. It was also the name of the subject of poems by the 14th-century Italian poet Petrarch.As an English name, Laura has been used since the 13th century. Famous bearers include Laura Secord (1775-1868), a Canadian heroine during the War of 1812, and Laura Ingalls Wilder (1867-1957), an American author who wrote the Little House on the Prairie series of novels. Related Names Rootlaurus VariantsLaureen, Laurene, Lora, Laurissa(English) Laurinda(Portuguese) Laure, Laurine(French) Lavra(Slovene) DiminutivesLaurie, Lori, Lorie, Lorinda, Lorri, Lorrie, Lauressa(English) Laurita(Spanish) Lauretta, Loretta(Italian) Laurita(Portuguese) Laurette, Laurie(French) User SubmissionLaùra Popularity People think this name is Name Days Images Laura de Noves, love of Petrarch Categories American Gods characters, Anne Rice characters, Aphra Behn characters, Ascendance of a Bookworm characters, asteroids, Belgian royal family, Belgium in the Eurovision Song Contest, Billy Joel songs, blues musicians, brand names, Carradine showbiz family, Charles Dickens characters, child actors, Code Lyoko characters, country music singers, Craig of the Creek characters, crown, D. H. Lawrence characters, Desperate Housewives characters, Dharma and Greg characters, Dislyte characters, Downton Abbey characters, Dynasty characters, Elite characters, Estonia in the Eurovision Song Contest, Family Affair characters, female US presidential candidates, feminine forms, film titles, Final Destination characters, Finland in the Eurovision Song Contest, Fire Emblem characters, first ladies of the USA, folk heroes, Frasier characters, Friends characters, Hamtaro characters, Harry Potter characters, House of Cards US characters, Infinite Stratos characters, Jane Austen characters, Land characters, Latin words, Latvia in the Eurovision Song Contest, Lego Friends characters, literature, Lithuania in the Eurovision Song Contest, Love Island Czechoslovakia, Love Island Germany, Love Island Netherlands, Love Island Poland, Love Island UK, Luxembourg in the Eurovision Song Contest, martyrs, Marvel characters, metals, Michael Cunningham characters, movies, nature, Netherlands in the Eurovision Song Contest, never out of the US top 1000, Orthodox saints, Oscar Wilde characters, philosophers, plants, Portugal in the Eurovision Song Contest, potato varieties, Precure characters, Quantico characters, retired Atlantic hurricane names, rugby union Las Leonas, saints, Silent Hill characters, Simpsons characters, Sisters of Dorley characters, song titles, Squishmallows, Star Wars actors, Stephen King characters, storms, Street Fighter characters, television, Tennessee Williams characters, The Four Hundred members, The Great British Bake Off contestants, The IT Crowd characters, The Man in the High Castle characters, The Marvelous Mrs. Maisel characters, The Midnight Club characters, The West Wing characters, Thomas Hardy characters, Three's Company characters, Tolkien characters, top 10 in Austria, top 10 in Belgium, top 10 in Denmark, top 10 in Estonia, top 10 in Hungary, top 10 in Switzerland, top 10 in the US, top 100 Portugal, Tori Amos lyrics, trees, TV Girl songs, Twin Peaks characters, Two and a Half Men characters, United Kingdom in the Eurovision Song Contest, Ursula K. Le Guin characters, US The Extra Mile memorial honorees, Virtua Tennis opponent characters, W. Somerset Maugham characters, Westworld characters, When Calls the Heart characters, Wii Sports Club opponent Miis, Wii Sports series opponent Miis, William Faulkner characters, WITCH characters, women and death, women's history, X-Men, Yellowjackets characters, YouTubers"
}