{
  "url": "https://liverfoundation.org/liver-diseases/fatty-liver-disease/nonalcoholic-steatohepatitis-nash/mash-causes-and-risk-factors/",
  "title": "MASH Causes & Risk Factors",
  "text": "Researchers have learned that people with a medical condition called metabolic syndrome are at higher risk of developing MASLD (metabolic dysfunction-associated steatotic liver disease) and MASH (metabolic dysfunction-associated steatohepatitis). These diseases were formerly called nonalcoholic fatty liver disease and nonalcoholic steatohepatitis (NAFLD and NASH). Metabolic syndrome is a mix of conditions linked to being overweight or obese, and it makes people more likely to get type 2 diabetes and heart disease. In order to be diagnosed with metabolic syndrome, any three of the following conditions must be present: If you are overweight or obese, have type 2 diabetes or prediabetes, have abnormal levels of fats in your blood, and/or have been diagnosed with metabolic syndrome, you are at risk for developing MASLD. Most people who develop MASLD will not advance to MASH, but some people are at risk for worsening liver damage. There are also some less common reasons why you may get MASLD or MASH, including… Much like adults, children who have certain health conditions like obesity and conditions related to obesity – type 2 diabetes/prediabetes, high blood pressure, and abnormal levels of cholesterol – are at risk for developing MASLD and MASH. Experts don’t know why some children with MASLD have simple fatty liver while others have MASH. Research suggests that MASH is more common in children who have both MASLD and type 2 diabetes. In addition, certain genes may also increase a child’s chance of developing MASH. MASLD is the most common cause of chronic liver disease in children in the United States. Researchers estimate that close to 10 percent of U.S. children ages two to 19 – about six million children – have MASLD. It’s become more common in children in recent decades, in part due to the growing epidemic of childhood obesity. MASLD is more common in boys than in girls; however, among children with MASLD, boys and girls are equally likely to have MASH. The majority of children with MASLD have simple steatotic liver disease*. Children with simple steatotic liver disease typically don’t develop liver complications. However, compared with adults who develop MASLD, children with MASLD are more likely to have MASH and related complications or liver disease as adults. The good news is that steatotic liver disease can be controlled or reversed with through healthy changes to your child’s lifestyle. It is important to be aware of the risk factors associated with MASLD and take steps to lessen your child’s chance of getting it, or keep it from progressing if your child has been diagnosed with the disease. *Steatotic liver disease is the new name for fatty liver disease. *Metabolic dysfunction-associated steatotic liver disease (MASLD) is the new name for nonalcoholic fatty liver disease (NAFLD). *Metabolic dysfunction-associated steatohepatitis is the new name for nonalcoholic steatohepatitis (NASH). Medically reviewed on April 2025. Last updated on July 7th, 2025 at 12:53 pm"
}