{
  "url": "https://en.wikipedia.org/wiki/Gallina",
  "title": "Gallina - Wikipedia",
  "text": "Gallina The Gallina or Largo-Gallina culture was an occupation sequence during the pre-Hispanic period in the American Southwest from approximately 1050 to 1300. The culture was located in north-central New Mexico roughly north of the Jemez Mountains, and was named after the Rio Gallina (and Largo Canyon), which runs through the region. Ancestry [edit]The Gallina are tentatively linked to the Rosa Phase of the Ancestral Puebloans.[1] Evidence indicates a connection to the Rosa people, due to similar skills such as basket weaving, black on white pottery, and architecture. They also have similar ornaments such as shells pierced for stringing, bone beads, and stone pipes. More recent scholarship has suggested the Gallina phase emerged through a social movement.[2] Tools and artifacts [edit]Artifacts from the Gallina time period are found commonly throughout the region, artifacts include vessels, and lithic tool remains such as projectile points/remnants, evidence of lithic reduction from cores and cobble, hand grinding tools such as the mano and corresponding metate, and the prominent tri notched axe head. There are indications that the Gallina were advanced at basket weaving. Most flakestone found on Gallina sites is made from quartzite, obsidian, and chert. The lithic materials can be traced to local stone deposits such as Jemez Mountain Obsidian and Pedernal Chert. Pottery [edit]Some of the ceramic reusable bowls and jars share similarities with Rosa era pieces, yet there are key differences. For instance, the wide mouth cook pots found commonly at Gallina sites are not seen among Rosa artifacts. Also, all jars found at Rosa sites have flat bottoms whereas the Gallina jars commonly have a tapering underbody that end in a point.[3] This was probably designed to allow the jar to be settled upright in a bed of ashes in the fire pit.[3] The Gallina also modified the necks of their jars, more than likely designed to allow the jar to be easier to hold. The Gallina are recognized for their black on white, grey utility, corrugated and basket impressed pottery designs.[4] Architecture [edit]Gallina architecture was also influenced by the Rosa style.[citation needed] Villages ranged from three to twenty dwellings and were generally combinations of surface structures and pit houses with north-south orientation. The pit houses were often dug in the high points of mesas and then completely palisaded. The house interiors are seen to have two hearths with banquets, or benches which skirt the walls, these are believed to be used as beds as well as seats. Pit houses often include wing walled storage units. Unit houses often had storage bins that extended off the east and west side of the house. Evidence supports the idea that these bins were used primarily for food/grain storage as remains are often found within. These houses were generally \"unit-type\" which have thick walls of unworked stones in mud mortar. The interiors of these houses were smooth and neatly plastered. They also contained fire pits with U-shaped deflectors that directed heat and caught ash. There was generally a ventilator shaft through the wall that followed the north-south orientation of the house. The interior roofs were left as beams and bags were hung from them as a storage method. The surface houses were always rectangular, however, the pit houses could be round or rectangular. Both styles of houses were accessed through roof entry, this is evident from the structural remains of ladders. Towers [edit]The Gallina constructed masonry towers along ridges. The towers generally had thick walls and better than usual masonry. This thickness was probably designed to support the weight. The towers were about 20-30 Ft one story buildings entered on the high level by a ladder. These towers were possibly signal stations similar to a line of telegraph stations. While the possibility of reuse for food storage is plausible, the fact remains that was not the intended use.[2] Religion [edit]Sipapus and kivas, the standard material indications of Ancestral Puebloan religions that were contemporaneous with the Gallina, have not been discovered in the Gallina area. A few possible examples were noted by Florence Hawley Ellis, but their identification is tenuous. Drought [edit]Starting in 1161, the ecological condition shifted toward drought conditions. Although not every year was bad, the pattern was increasingly dry. From 1250 to 1265 the drought was particularly bad, and the years 1278 and 1292 were the worst. All of the dates for droughts and predicted impact on crops are based on conifer growth (from tree rings).[citation needed] Camps and mountain dwellings [edit]At some point during difficult drought conditions, some members traveled from villages to camp on Canjilon Mountain in order to hunt and gather. Each of these mountain camps had two to ten people and brought a cook pot, water jar, food bowl, and canteen with them, opting not actually to make pottery in the camps. The camps were thought to be more hunting-oriented based on the arrows, knives, and scrapers found at the sites. The camps were most frequently located on lava beds because of the retention and radiation of the sun’s heat off the rock. The warmth may have allowed small plots for farming, although this is still under debate. The dwellings and drying areas had paths leading to them that were sometimes \"paved\" with slabs of rock or filled in with chinking stones. Ellis believed these sites to be associated with the Gallina; many other archaeologists, however, do not. Abandonment and/or migration [edit]In the 1300s the region was slowly depopulated. Contemporary archaeologists suggests a social movement as a potential cause.[2] Most Gallina sites discovered are found to have been left in perfect order and followed a ritualistic pattern. The fire pits were filled to the rim and then the floors were cleaned. The house was given a quick burning and then the roof timbers were removed. Some archaeologists who follow the belief of abandonment tend to think that this was a process designed to minimize the abilities of someone to use personal artifacts left behind in witchcraft. While forensic evidence of violence and exist within the region, there is no certainty in regards to the cause. Hypotheses of the past have included explanations from genocide to internecine war. Although there is no hard evidence for either, research is ongoing. References [edit]- ^ Ford et al. 1972 - ^ a b c Borck, Lewis; Bremer, J. Michael (Winter 2015). \"Ordinary, yet Distinct: the allure of Gallina\". Archaeology Southwest. 29 (1). - ^ a b \"Ordinary, yet Distinct\". - ^ Wilson, Gordon P. (2007). Guide to Ceramic Indetification: Northern Rio Grande Valley and Galisteo Basin to AD 1700 (2nd ed.). Santa Fe, New Mexico: Laboratory of Anthropology. Bibliography [edit]- Ford, R.I., A.Schroeder, and S.L. Peckham 1972 Three Perspectives on Puebloan Prehistory. In New Perspectives on the Pueblos, edited by A. Ortiz, School of American Research. University of New Mexico Press, Albuquerque. - Ellis, Florence. “Canjilon Mountain Hunting and Gathering Sites.” From Drought to Drought: Gallina Cultural Patterns Volume 1. 1988. - Ancient Massacre Discovered in New Mexico -- Was It Genocide?, by Blake de Pastino, National Geographic News, July 12, 2007. - Stuart, David. Glimpses of the Ancient Southwest. Santa Fe, New Mexico: Ancient City Press. 1984. (Only pages 86–92) - Historical Dictionary of North American Archeology - Handbook of North American Indians - Borck, Lewis(2018). “Sophisticated Rebels: Meaning Maps and Settlement Structure as Evidence for Social Movement in the Gallina Region of North American Southwest” In Life Beyond Boundaries: Constructing Identity in Edge Regions of the North American Southwest Boulder: University Press of Colorado."
}