{
  "url": "https://www.thefreedictionary.com/near",
  "title": "Near - definition of near by The Free Dictionary",
  "text": "near Also found in: Thesaurus, Medical, Financial, Acronyms, Idioms, Encyclopedia, Wikipedia. near (nîr)near (nɪə)near (nɪər)adv.andadj. near•er, near•est, prep., v. adv. near closeIf something is near, near to, or close to a place or thing, it is a short distance from it. When close has this meaning, it is pronounced /kləʊs/. When near and close have this meaning, don't use them immediately in front of a noun. Instead use nearby. However, the superlative form nearest can be used immediately in front of a noun. You can use near immediately in front of a noun to say that something is almost a particular thing. You can also use near immediately in front of an adjective and a noun to say that something almost has a particular quality. You can use near, near to, or close to immediately in front of a noun to say that someone or something is almost in a particular state. You can refer to someone you know well as a 'close friend'. Don't refer to someone as a 'near friend'. You can refer to someone who is directly related to you as a 'close relative'. You can also refer to someone as a 'near relative', but this is less common. Be Careful! Don't confuse the adjective 'close' with the verb close /kləʊz/. If you close something, you move it so that it fills a hole or gap. near Past participle: neared Gerund: nearing near close far, removed, remote, distant, out-of-the-way, far-off, far-removed, far-flung, faraway, outlying imminent remote, distant, far-off, faraway intimate remote, distant near adverbadjectivenear [nɪəʳ]he lives quite near → vive bastante cerca don't come any nearer! → ¡no te acerques más! so near and yet so far the shore was so near and yet so far → la orilla estaba al alcance de la mano pero llegar a ella era imposible victory was so near and yet so far → la victoria parecía estar asegurada pero ese último esfuerzo para obtenerla les resultó imposible the agreement brings peace a little nearer → este acuerdo nos acerca un poco más a la paz winter is drawing near → el invierno se acerca the nearer it gets to the election the more they look like losing → a medida que se acercan las elecciones mayor parece la posibilidad de que pierdan to be near at hand [object] → estar al alcance de la mano; [event, season] → estar a la vuelta de la esquina the nearest I ever came to feeling that was when → la única vez que llegué a sentir algo parecido fue cuando ... you as near as dammit killed me > → no me mataste, pero por un pelo that's near enough (numbers) → no merece la pena precisar más; (amount) → con eso vale you won't get any nearer than that to what you want → no vas a encontrar otra cosa que se aproxime más a lo que buscas the nearest I ever got to winning → lo más cerca que estuve de ganar it's nowhere near enough → con eso no basta ni mucho menos \"have you finished it yet?\" - \"nowhere near\" → -¿has terminado ya? -qué va, me falta muchísimo as near as I can recall → que yo recuerde I live near Liverpool → vivo cerca de Liverpool is there a bank near here? → ¿hay algún banco por aquí cerca? I sat near the fire → me senté cerca de la chimenea the schools near where I live → los colegios de mi barrio the person nearest the door → la persona que está más cerca de la puerta he won't let anyone near his toys → no deja que nadie se acerque a sus juguetes we don't live anywhere near Lincoln → vivimos bastante or muy lejos de Lincoln if you come near me I'll kill you → como te me acerques, te mato nobody comes anywhere near him at swimming → en natación nadie le llega ni a la suela del zapato the passage is near the end of the book → el trozo viene hacia el final del libro don't go near the edge → no te acerques al borde we were nowhere near the station → estábamos bastante or muy lejos de la estación my house is near enough to walk → mi casa está muy cerca, se puede ir andando where's the nearest service station? → ¿dónde está la gasolinera más cercana? these glasses make things look nearer → con estas gafas todo parece estar más cerca he had a near miss (Aer) → por poco se estrelló (Aut) → por poco chocó it was a near miss (target) → por poco dio en el blanco £250 or nearest offer → 250 libras o precio a discutir calculate to the nearest decimal place → para el cálculo sólo utilicen el primer decimal he calculated the price to the nearest pound → redondeó el precio a la libra entera in the near future → en un futuro cercano the time is near when → falta poco cuando ... that's the nearest thing to a compliment you'll get from him (iro) → eso es lo más parecido a un elogio que vas a conseguir de él a near thing she won, but it was a near thing → ganó, pero por los pelos near [ˈnɪər]It's fairly near → C'est assez près d'ici. My office is quite near → Mon bureau est tout près. It's near enough to walk → On peut facilement y aller à pied., C'est assez près pour y aller à pied. the nearest → le plus proche Where's the nearest service station? → Où est la station-service la plus proche? The nearest shops were three kilometres away → Les magasins les plus proches étaient à trois kilomètres. Christmas is quite near now → Noël est tout proche. in the near future → dans un proche avenir in near darkness → dans la quasi-obscurité We were sitting in near darkness → Nous étions assis, dans la quasi-obscurité. a near tragedy Very often tragedies or near tragedies occurred → Très souvent, des tragédies se produisaient, ou manquaient de se produire. to come near → s'approcher Don't come any nearer! → Ne vous approchez pas! Don't go any nearer! → Ne vous approchez pas! to draw near [day, time] → approcher The wedding day drew near → Le jour du mariage approchait. near and far → d'ici et d'ailleurs to come from near and far → venir des quatre coins du pays People came from near and far → Les gens venaient des quatre coins du pays. a near perfect landing → un atterrissage quasi parfait a near disastrous exercise BUT un exercice qui a bien failli tourner au désastre. near enough an hour (= just about) → pas loin d'une heure I've been working at it for near enough an hour → Je travaille dessus depuis pas loin d'une heure. I live near Liverpool → J'habite près de Liverpool. I stood very near them → Je me tenais très près d'eux. He pulled her nearer him → Il l'attira vers lui. near my house → près de chez moi near here → près d'ici Is there a bank near here? → Est-ce qu'il y a une banque près d'ici? near there → non loin de là near to → près de It's very near to the school → C'est tout près de l'école. to not come near sb Don't come near me! → Ne t'approche pas de moi! He hasn't come near us since I asked him for a petrol contribution → On ne l'a plus revu depuis que je lui ai demandé de participer aux frais d'essence. to not go near sth He won't go near a hospital → Il refuse de mettre les pieds dans un hôpital. He will absolutely not go near a hospital → Il refuse absolument de mettre les pieds dans un hôpital. near the beginning of [+ match, show, book] → en début de It happened near the beginning of the game → C'est arrivé en début de match. near the end of [+ match, show, book] → en fin de nearer the time of sth → lorsque l'heure de qch approchera to near completion The work is near completion → Le travail est près d'être achevé. to be near collapse → être au bord de l'effondrement The country was near economic collapse → Le pays était au bord de l'effondrement économique. to be near the truth → être proche de la vérité Her views were fairly near the truth → Ses vues étaient assez proches de la vérité. They were nearing the end of their training → Ils approchaient de la fin de leur formation. confusion, nearing hysteria → une confusion frisant l'hystérie to be nearing completion → être près d'être achevé(e) The building is nearing completion → Le bâtiment est près d'être achevé. to be nearing [person] [+ age] → approcher de He might be nearing fifty → Il devait approcher de la cinquantaine. near (+er)? to be near at hand → zur Hand sein; (shops) → in der Nähe sein; (help) → ganz nahe sein; (event) → unmittelbar bevorstehen ? draw ? near enough (that’s) near enough → so gehts ungefähr, das haut so ungefähr hin (inf); … no, but near enough → … nein, aber es ist nicht weit davon entfernt; there were near enough 60 people at the party → es waren knapp 60 Leute auf der Party ? as near as makes no difference they’re the same length or as near as makes no difference → sie sind so gut wie gleich lang; it’s as near stopped as makes no difference → es hat so gut wie aufgehört (also ADV: near to) → sich nähern (+dat); he was nearing his end → sein Leben neigte sich dem Ende zu; to be nearing something (fig) → auf etw (acc) → zugehen; she was nearing fifty → sie ging auf die Fünfzig zu; to near completion → kurz vor dem Abschluss stehen (time, event) → näher rücken; the time is nearing when … → die Zeit rückt näher, da … near :near :near [nɪəʳ]I like to know that you are near → mi piace sapere che tu sei (qui) vicino or accanto near at hand → a portata di mano (event) → imminente, alle porte to come or draw near (person, event) → avvicinarsi come nearer → vieni più vicino, avvicinati to bring sth nearer (to) → portare qc più vicino (a) he came near to being drowned → per poco non è annegato near to tears → sul punto di piangere that's near enough → va bene così there were 100 people there, near enough → c'erano pressappoco 100 persone nowhere near full → ben lontano/a dall'essere pieno/a near here/there → qui/lì vicino he was standing near the door → era in piedi vicino alla porta it was somewhere near midnight → era circa mezzanotte it's somewhere near here → dev'essere da queste parti the passage is near the end of the book → il brano è verso la fine del libro his views are very near my own → è di vedute molto simili alle mie nobody comes anywhere near her at cooking → nessuno può competere con lei in cucina in the near distance → a breve distanza the nearest way → la via or strada più breve £25,000 or nearest offer (Brit) → 25.000 sterline trattabili in the near future → in un prossimo futuro the building is nearing completion → il palazzo è quasi terminato or ultimato"
}