{
  "url": "https://www.nationalgeographic.com/culture/article/julius-caesar",
  "title": "Julius Caesar—facts and information | National Geographic",
  "text": "Few Romans would have chosen young Julius Caesar (ca 100–44 B.C.) as the man most likely to succeed on a grand scale and dominate their world. But when he led his troops across the Rubicon River in defiance of the Roman Senate, he distinguished himself for the ages and set Rome on a path of transformation from republic to empire. Caesar made the political prime time at around age 40 by forging the First Triumvirate with Pompey the Great, noted general and statesman, and Marcus Licinius Crassus, one of Rome’s richest men. In 59 B.C., Caesar was elected consul. He knew he needed a great military victory to win lasting glory beyond politics, so he set out to conquer the long-defiant Gauls—Celts who lived in modern-day France. Caesar’s seven-year Gaul campaign ended triumphantly in 51 B.C. The Gaul leader Vercingetorix was paraded in chains through Rome before being ritually strangled. In all, Caesar’s campaign killed or enslaved more than a million Gauls, a crushing victory that deepened the growing rivalry with Pompey, who had taken Caesar’s place as consul. In January 49 B.C., Julius Caesar and his army crossed the Rubicon River into Italy, the boundary beyond which he could not legally command troops. The act was a declaration of civil war and a direct challenge to Pompey and his troops, who were enlisted to protect the interests of the Senate. Caesar drove Pompey out of Italy and chased him to Greece. Though Pompey had assembled an army twice the size of Caesar’s, Caesar defeated him decisively at Pharsalus in 48 B.C. Pompey fled to Egypt, but he was betrayed and killed when he came ashore. As Caesar pursued Pompey loyalists in North Africa, he became politically and romantically entangled with the queen Cleopatra and had a son with her named Caesarion. Caesar returned, triumphant, to Rome in 46 B.C. As ruler, he enacted several beneficial measures for Rome. He increased the size of the Senate for broader participation and opened citizenship to more foreigners. He also was magnanimous to his opponents, including Marcus Junius Brutus, a supporter of Pompey. Caesar’s ambitious power grabs through political reform alienated many senators. When he declared himself dictator for life in 45 B.C., he sealed his fate. Threatened by Caesar’s tyranny, a group of conspirators—led by Brutus—plotted against him. On the Ides of March (March 15), 44 B.C., Caesar was assassinated, stabbed 23 times. Though the conspirators eliminated Caesar himself, they neither thwarted his plans nor saved the republic. His designated heir, Octavian, outlasted Caesar’s antagonists and became the first Roman emperor. In keeping with Caesar’s eternal quest for glory, in death he acquired one last title and tribute. The Senate posthumously granted him the title Divine Julius, making him the first historical Roman to be deified."
}