{
  "url": "https://support.google.com/youtube/answer/9080341?hl=it",
  "title": "Première di un nuovo video - Guida di YouTube",
  "text": "YouTube Première consente a te e ai tuoi spettatori di guardare e scoprire nuovi video insieme in tempo reale. Stimola il passaparola sulla première condividendo la pagina di visualizzazione per consentire agli spettatori di impostare promemoria, chattare e lasciare commenti. Creare una première Gli spettatori possono guardare la première su qualsiasi piattaforma, ad esempio computer, iPhone, iPad, Android e web mobile. - Accedi a YouTube Studio. - Nella parte superiore, fai clic su Crea Carica video. Nota: gli Short non sono supportati per le première. - Seleziona il video da caricare e inserisci i relativi dettagli. Nota: i video a 360°/VR180 o gli output con risoluzione superiore a 1080p non sono supportati per le première. - Per avviare subito la première di un video, fai clic su Salva o pubblica Pubblico Imposta come première istantanea. La première inizierà al termine dell'elaborazione del video. Per programmare la première per un secondo momento, fai clic su Programma immetti data e ora seleziona Imposta come première. - Per scegliere il tema e la durata del conto alla rovescia, fai clic su Configura première. - Fai clic su Fine o Programma. Suggerimento: puoi anche creare una première quando carichi un video dall'app YouTube. Dalla pagina \"Imposta visibilità\", seleziona Imposta come première. Cosa succede quando crei una première Prima dell'inizio della première Si crea una pagina di visualizzazione pubblica per il tuo video nella quale verrà presentata la première. Puoi condividere l'URL della pagina di visualizzazione, dato che è pubblica prima dell'inizio della première. Le première sono disponibili su YouTube come i normali caricamenti. Le troverai nella pagina di ricerca, nella home page e nei consigli sui video. Chiunque può accedere alla pagina di visualizzazione e impostare un promemoria, lasciare un commento o chattare (e anche inviare messaggi Superchat, se l'opzione è attivata). Se hai caricato un trailer, verrà riprodotto. Nota: se il tuo account riceve un avvertimento relativo alle Norme della community, la première non verrà pubblicata durante il periodo della sanzione, ma sarà impostata come privata. Una volta trascorso il periodo, dovrai riprogrammarla. Scopri di più sulle nozioni di base sugli avvertimenti relativi alle Norme della community. Panoramica della pagina di visualizzazione Durante la première Quando programmato, inizierà un tema con il conto alla rovescia per la durata selezionata. Se l'inizio della première era impostato alle 12:00, il conto alla rovescia inizierà alle 12:00. Una volta terminato il conto alla rovescia, gli spettatori guarderanno il video insieme in tempo reale. Gli spettatori possono riavvolgere il video ma non possono mandare avanti la trasmissione dal vivo. Tu e i tuoi spettatori potete continuare a interagire nei commenti e nella chat live. Al termine della première Al termine della première, il video rimarrà sul tuo canale come un normale caricamento. Il tema del conto alla rovescia non sarà incluso nel video. La funzionalità di riproduzione chat è disponibile per gli spettatori che vogliono leggere la chat della première dopo che si è conclusa. In YouTube Studio puoi anche utilizzare YouTube Analytics per valutare il rendimento della première. Il numero delle visualizzazioni della première sarà trasferito al video al termine della stessa."
}