{
  "url": "https://www.thefreedictionary.com/stare",
  "title": "Stare - definition of stare by The Free Dictionary",
  "text": "stare Also found in: Thesaurus, Medical, Legal, Financial, Acronyms, Idioms, Encyclopedia, Wikipedia. stare steady gaze; to look at intently: It’s not polite to stare. Not to be confused with: stair – step or flight of steps: walk up the stairs Abused, Confused, & Misused Words by Mary Embree Copyright © 2007, 2013 by Mary Embree stare (stâr)v. stared, star·ing, stares v.intr. To look directly, fixedly, or vacantly, often with a wide-eyed gaze. See Synonyms at gaze. v.tr. To look at directly and fixedly: stared him in the eyes. n. Phrasal Verb: An intent gaze. stare down Idiom: 1. To stare at (a person or animal) until that person or animal blinks or turns away. 2. To confront boldly or overcome by direct action: stared down his opponents. stare in the face 1. To be plainly visible or obvious to (one); force itself on (one's) attention: The money on the table was staring her in the face. 2. To be obvious to (one) though initially overlooked: The explanation had been staring him in the face all along. 3. To be imminent or unavoidable to (one): Bankruptcy now stares us in the face. 4. To be about to experience or undergo (something dire): We are staring bankruptcy in the face. star′er n. American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. stare (stɛə)vb 1. (often foll by: at) to look or gaze fixedly, often with hostility or rudeness 2. (Zoology) (intr) (of an animal's fur, bird's feathers, etc) to stand on end because of fear, ill health, etc 3. (intr) to stand out as obvious; glare 4. stare one in the face to be glaringly obvious or imminent n the act or an instance of staring [Old English starian; related to Old Norse stara, Old High German starēn to stare, Greek stereos stiff, Latin consternāre to confuse] ˈstarer n stare (stɛə)n (Animals) dialect a starling [Old English stær] Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 stare (stɛər)v. stared, star•ing, n. v.i. 1. to gaze fixedly and intently, esp. with the eyes wide open. 2. to be boldly or obtrusively conspicuous. 3. (of hair, feathers, etc.) to stand on end; bristle. v.t. 4. to stare at: to stare a person up and down. 5. to effect or have a certain effect on by staring. 6. stare down, to intimidate or discomfit with a stare. n. 7. a staring gaze; a fixed look with the eyes wide open. Idioms: stare one in the face, to be urgent or impending, as a deadline. [before 900; Middle English; Old English starian, c. Middle Low German staren, Old High German starēn, Old Norse stara; akin to stark] star′er, n. star′ing•ly, adv. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. stare - extant - Comes from Latin ex-, \"out,\" and stare, \"to stand,\" and means \"currently or actually in existence.\" - stare - Its etymological notion is \"fixity\" or \"rigidity,\" from a Germanic base meaning \"be rigid.\" - gaure - To stare in astonishment. - gorgonize - To stare at with a petrifying look. Farlex Trivia Dictionary. © 2012 Farlex, Inc. All rights reserved. Stare of owls.Dictionary of Collective Nouns and Group Terms. Copyright 2008 The Gale Group, Inc. All rights reserved. gaze stare1. 'gaze' If you gaze at something, you look at it for a long time, often because you think it is beautiful or impressive. The little girl gazed in wonder at the bright lights. 2. 'stare' If you stare at something or someone, you look at them for a long time, often because you think they are strange or shocking. He stared at the scar on her face. Collins COBUILD English Usage © HarperCollins Publishers 1992, 2004, 2011, 2012 stare Past participle: stared Gerund: staring Collins English Verb Tables © HarperCollins Publishers 2011 ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. stare verb gaze, look, goggle, watch, gape, eyeball (slang), ogle, gawp (Brit. slang), gawk, rubberneck (slang) Mahoney tried not to stare. stare someone in the face be obvious, be clear, be evident, be apparent, be blinding, be plain, be patent, be unmistakable, be self-evident, be crystal clear, be as plain as the nose on your face, be right under your nose The answer had been staring me in the face. Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 stare verbnoun The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations جَريءيُحَمْلِقيُحَمْلِقُ zíratupřený pohled stirrestirrenglo tuijottaa zuriti merev tekintet stara, einblínastarandi augnaráî, stara じっと見つめる 응시하다 būti aiškiai matomambūti aiškiamspoksojimasstebeilyti cieši raudzītiesciešs skatiens upretý pohľad buljitistrmenjestrmeti stirraglo จ้อง gözlerini dikip bakmagözlerini dikip bakmakgözünü dikip bakmak nhìn chằm chằm stare [stɛəʳ]B. VT to stare sb out or down → mirar a algn fijamente hasta que aparte la vista it's staring you in the face → salta a la vista it's staring you in the face → salta a la vista C. VI → mirar fijamente he wouldn't stop staring → no paraba de mirar fijamente don't stare! → ¡no mires tan fijo! to stare at sth/sb → mirar algo/a algn fijamente, mirar algo/a algn de hito en hito it's rude to stare at people → está mal visto fijar la mirada en la gente to stare into the distance; stare into space → estar con la mirada perdida or mirando a las nubes he wouldn't stop staring → no paraba de mirar fijamente don't stare! → ¡no mires tan fijo! to stare at sth/sb → mirar algo/a algn fijamente, mirar algo/a algn de hito en hito it's rude to stare at people → está mal visto fijar la mirada en la gente to stare into the distance; stare into space → estar con la mirada perdida or mirando a las nubes Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 stare [ˈstɛər] n → regard m fixe vi → regarder avec insistance to stare at sth → regarder fixement qch, fixer son regard sur qch to stare at sb → fixer qn He stared at us in disbelief → Il nous fixa d'air incrédule. to stare into space → regarder dans le vide to stare at sth → regarder fixement qch, fixer son regard sur qch to stare at sb → fixer qn He stared at us in disbelief → Il nous fixa d'air incrédule. to stare into space → regarder dans le vide vt to be staring sb in the face (= be very obvious) → être sous le nez de qn to stare sb out → faire baisser les yeux de qn to be staring sb in the face (= be very obvious) → être sous le nez de qn stare out vt septo stare sb out → faire baisser les yeux de qn Collins English/French Electronic Resource. © HarperCollins Publishers 2005 stare n → (starrer) Blick; the village idiot looked at me with a vacant stare → der Dorftrottel sah mich mit stierem Blick an; to give somebody a stare → jdn anstarren vt the answer was staring us in the face → die Antwort lag klar auf der Hand; to stare death/defeat in the face → dem Tod/der Niederlage ins Auge blicken; defeat was staring us in the face → wir blickten der Niederlage ins Auge vi (vacantly etc) → (vor sich hin) starren; (cow, madman) → stieren, glotzen (inf); (in surprise) → große Augen machen; (eyes) → weit aufgerissen sein; he stared in disbelief → er starrte ungläubig; it’s rude to stare → es ist unhöflich, andere Leute anzustarren; to stare at somebody/something → jdn/etw anstarren; (cow, madman also) → jdn/etw anstieren or anglotzen (inf); don’t stare (at me)! → starr (mich) nicht so (an)!; to stare at somebody in horror/amusement/disbelief etc → jdn entsetzt/verblüfft/ungläubig etc anstarren; to stare after somebody → jdm nachstarren or hinterherstarren Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 stare [stɛəʳ]2. vt it's staring you in the face (obvious) → salta agli occhi; (very near) → ce l'hai sotto il naso Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995 stare (steə) verb (often with at) to look at with a fixed gaze. They stared at her clothes in amazement; Don't stare – it's rude! noun a staring look. a bold stare. stare in the face to be easy to see or obvious. The answer to the problem was staring me in the face. Kernerman English Multilingual Dictionary © 2006-2013 K Dictionaries Ltd. stare → يُحَمْلِقُ zírat stirre starren κοιτάζω επίμονα quedarse mirando tuijottaa fixer zuriti fissare じっと見つめる 응시하다 staren stirre gapić się olhar fixamente пристально глядеть stirra จ้อง gözünü dikip bakmak nhìn chằm chằm 盯着看Multilingual Translator © HarperCollins Publishers 2009 stare n. mirada fija; v. mirar fijamente. English-Spanish Medical Dictionary © Farlex 2012 stare vi fijar la vista; Stare at that point on the wall..Fije la vista en ese punto en la pared.English-Spanish/Spanish-English Medical Dictionary Copyright © 2006 by The McGraw-Hill Companies, Inc. All rights reserved."
}