{
  "url": "https://schaller.info/en/",
  "title": "Official Schaller webshop. Buy all Schaller products directly from the manufacturer.",
  "text": "Official Schaller Onlineshop Our product variety News Here we always keep you up to date on the latest developments and important events. April 13th, 2023: We present the worldwide first double locking tremolo, that allows individual adjustment to different fretboards, whether straight or compound radius: improved to the next level! June 12th, 2023: The classic contact pickup, now available in an elegant nickel or pure brass shell. June 29th, 2023: The new Schaller poti knob with knurled engraving and the toggle switch knobs with internal SAE 8-32 or M 3.5 thread expand the range of knobs. June 29th, 2023: While other tuning machine heads feature 1:14 to 1:16 ratio, the Schaller Original G-Series Deluxe KeyStone now offers the improved gear ratio of 1:18. March 7th, 2017: In 1981, Schaller presented the newly developed Megaswitch models for the first time, with previously unimagined possibilities for connection types and switching of pickups. March 13th, 2013: Expand the sonic possibilities of your instrument with our wiring diagrams for Megaswitch guitar and bass. January 25th, 2018: These new revolutionary S-Locks are silent. They feature one-piece hardened steel strap buttons, aesthetic design, perfect handling, an elegant Lock-Wheel and all former hiccups have been tackled! August 5th, 2024: Schaller is setting new standards in the packaging of guitar accessories with reinpapier®. August 9th, 2024: Our web shop now offers a new, user-friendly configurator interface and a shopping experience that has been improved in many details. November 5th, 2024: The Schaller BM family is growing. With Music Man® & Rickenbacker® style tuners, we are expanding our range for electric basses. November 11th, 2024: On the way to CO₂ reduction with photovoltaics from AMPERIOS 80 Years: World´s Finest Guitar Parts Schaller GmbH in Postbauer-Heng near Nuremberg in Bavaria has been on the market since 1945 and is now the world market leader for guitar components. The legendary company directed by Dr. Lars Bünning has around 65 employees. It has become an indispensable part of the musical instrument industry today. Schaller supplies precision products in the field of musical instrument hardware. The machine heads, bridges, tremolos, strap locks and other guitar accessories \"Made in Germany\" are well received worldwide. And that is a tradition. Learn more. 80 Years: World´s Finest Guitar Parts Schaller GmbH in Postbauer-Heng near Nuremberg in Bavaria has been on the market since 1945 and is now the world market leader for guitar components. The legendary company directed by Dr. Lars Bünning has around 65 employees. It has become an indispensable part of the musical instrument industry today. Schaller supplies precision products in the field of musical instrument hardware. The machine heads, bridges, tremolos, strap locks and other guitar accessories \"Made in Germany\" are well received worldwide. And that is a tradition. Learn more."
}