{
  "url": "https://www.sildaviaviajes.com/7-cosas-no-sabias-los-templos-angkor-camboya/",
  "title": "Templos de Angkor en Camboya. 7 cosas a descubrir - Sildavia Viajes",
  "text": "7 cosas que no sabías sobre los templos de Angkor en Camboya Todo el mundo que realiza un viaje a Camboya dedica al menos un día a pasear entre los templos de Angkor, declarados Patrimonio de la Humanidad por la Unesco. Prácticamente todos los visitantes se hacen una foto en sus icónicos santuarios, pero muy pocos exploran sus enigmas. ¡Te decimos 7 cosas sobre los templos de Angkor en Camboya que seguramente no sabías! Representados en la bandera de Camboya Para el país, este complejo arquitectónico es su verdadero símbolo. Sus habitantes se ven personificados en los valores que transmite: belleza, tranquilidad, espiritualidad, inmensidad, etc… Quizás por esta razón, los templos de Angkor se encuentran representados en la bandera de Camboya, formada por tres franjas horizontales: dos de color azul y una central de color rojo de mayor tamaño. En esta última es donde aparece una representación de la entrada principal al templo de Angkor Wat con tres torres en color blanco. Lo más curioso es que, a pesar de que la bandera de Camboya ha variado en diferentes ocasiones durante los últimos siglos, Angkor siempre ha estado presente en ella. Solo hay dos excepciones: la bandera que se utilizó durante el dominio de Japón (1942-1945) y la que se empleó cuando la Autoridad Transitoria de las Naciones Unidas (1991-1993) se instaló en Camboya. Un origen de leyenda Hay dos preguntas que aparecen automáticamente en la mente de los viajeros al contemplar este lugar: ¿para qué se construyó este recinto? ¿Cuál era su papel? Durante casi un siglo, Angkor fue el centro político y religioso del gran imperio jemer, albergando en su interior a más de 20.000 personas. Muchos historiadores, sin embargo, afirman que el rey Suryavarman II, el soberano que mandó edificarlo, lo construyó por una sencilla razón: estaba avergonzado de la manera en la que había accedido al trono y quería volver a congraciarse con los dioses. No en vano, Suryavarman II asesinó a su hermano mayor para poder convertirse en el rey del imperio, por lo que es más que probable que los dioses no estuviesen muy contentos con él. Imita a un monte sagrado Los templos de Angkor intentan imitar el Monte Meru, un monte sagrado considerado como la morada de los dioses. Aunque, está dedicado, especialmente a Vishnú, el Dios de la preservación y la bondad. Fruto de un plan matemático El templo más emblemático del conjunto, Angkor Wat, es mucho más que lo que ves a simple vista. Es fruto de un cuidado plan matemático elaborado por expertos en astronomía y cosmología. Ubicado a 5,5 kilómetros al norte de la actual ciudad de Siem Riep, el Angkor Wat se alinea con la posición del sol durante el equinoccio de primavera. Cada año, el día del equinoccio a las 6:35 am exactamente, desde el camino que lleva al templo, se puede observar cómo el sol se eleva por detrás de la cúpula principal. Lo mismo ocurre durante los tres días posteriores, aunque tendremos que variar un poco nuestra posición para poder disfrutar de este espectáculo. La intención de este maravilloso momento, conseguido a base de cálculos y de mucho esfuerzo, era transmitir la sensación de que Visnú estaba bendiciendo de esta manera el nuevo ciclo, aportando luz y calor. Es la mayor estructura religiosa jamás construida Este es el mayor complejo religioso del mundo. De dimensiones colosales, está compuesto por más de mil templos, que se extienden por el interior de la selva, por lo que es prácticamente imposible que un viajero pueda verlos todos. Abarca cerca de 200 km², pero sus límites reales llegan, incluso, a las fronteras de Camboya hacia Tailandia y Laos, en cuyos territorios se encuentran vestigios de templos que formaron parte del complejo religioso. Y sus medidas también esconden secretos. 365.24, la cantidad de días que dura un año solar, es el resultado que obtenemos si sumamos la longitud de los muros exteriores del recinto. Un dato que fascina a los investigadores. Tan solo 37 años tardó su construcción Pero si hay algo que verdaderamente intriga a los historiadores es cómo se pudo construir todo este complejo arquitectónico en tan solo 37 años. Los expertos calculan que a día de hoy se tardaría trescientos años en edificar un recinto similar. Casi nada. De ahí que a muchos les obsesione este centro espiritual. No siempre fueron templos hinduistas Los templos de Angkor nacieron hinduistas, pero los diferentes vaivenes políticos provocaron que, durante diversos períodos de tiempo, como cuando Srindravarman ascendió al poder, se convirtieran en templos budistas. Esto era algo habitual en el imperio jemer dado que la religión de la nación cambiaba en función de la fe que profesara el monarca de turno. Después de haber leído estas curiosidades sobre el centro religioso de Angkor, irás a tu viaje a Camboya más preparado para asimilar toda la divinidad y enigmas que se esconden en este tesoro arqueológico, para nosotros el más deslumbrante del planeta."
}