{
  "url": "https://www.metric-conversions.org/temperature/celsius-to-fahrenheit.htm",
  "title": "Celsius to Fahrenheit conversion : ºC to ºF calculator",
  "text": "Simple, quick °C to °F conversion Celsius to Fahrenheit conversion is probably the most confusing conversion there is, but a simple °C to °F conversion is actually quite easy – just double the °C figure and add 30. This should be reasonably accurate for weather temperatures. Celsius and Fahrenheit definition The Celsius temperature range was originally defined by setting zero as the temperature at which water froze. Zero degrees C was later redefined as the temperature at which ice melts. The other point at which Celsius was set – 100 degrees Celsius – was defined as the boiling point of water. Since its definition, the Celsius scale has been redefined to peg it to Kelvin. Zero degrees Celsius is now defined as 273.15K. As one degree Celsius is equal to one Kelvin, boiling point of water is equal to 273.15 + 100 = 373.15 Kelvin. The Fahrenheit temperature range is based on setting the freezing point of water at 32 degrees, and boiling to 212 degrees. This means that boiling and freezing point are 180 degrees apart. Absolute zero is defined as -459.67°F. Why is converting Celsius to Fahrenheit so difficult? Because both Celsius and Fahrenheit scales are offset– ie neither are defined as starting at zero. On top of that, for every additional unit of heat energy the Celsius and Fahrenheit scales add a different additional value. Because of this setup, it’s impossible to say that doubling the °C or °F value doubles the amount of heat energy, so it’s difficult to get an intuitive grasp of how much energy 1 degree Fahrenheit or Celsius actually is. The only temperature system that works intuitively – where a doubling of value doubles the energy – is Kelvin, where absolute zero is 0, body temperature is 310.15K and boiling water is 373.15K. The problem with the Kelvin scale is that the zero end of the scale is too far from human experience to be useful – as anyone who set their room temperature to 20.5 Kelvin would attest, if they lived long enough. What is the difference between Centigrade and Celsius? It’s just a naming convention. Degrees Centigrade and degrees Celsius are the same thing. Degrees Celsius (invented by Anders Celsius) are sometimes called Centigrade, because the scale was defined between 0 and 100 degrees, hence centi-grade meaning a scale consisting of 1/100ths. Common conversions from Celsius to Fahrenheit 25°C= 77°F 30°C= 86°F 33°C= 91.4°F 35°C= 95°F 40°C= 104°F 180°C= 356°F Common misspellings of Celsius Celcius Common misspellings of Fahrenheit Farenheit Farenheight Ferenheit Ferenheight Ferinheit Ferinheight Fahrinheight Fahenhiet Reference temperatures in Celsius and Fahrenheit Absolute zero, the theoretical coldest temperature where no thermal energy is present: -273.15°C / -459.67°F Parity, where the same value in both Celsius and Fahrenheit represents the same temperature: -40°C / -40°F The freezing point of water at 1 atmosphere of pressure: 0°C / 32°F The boiling point of water at 1 atmosphere of pressure: 100°C / 212°F The average human body temperature: 37°C / 98.6°F"
}