{
  "url": "https://en.wikipedia.org/wiki/Kellogg's",
  "title": "Kellogg's - Wikipedia",
  "text": "Kellogg's The Kellogg Company, doing business as Kellogg's, was an American multinational food manufacturing company headquartered in Battle Creek, Michigan, United States. Kellogg's produced cereal and convenience foods, including crackers and toaster pastries, and marketed their products by several well-known brands including Corn Flakes, Rice Krispies, Frosted Flakes, Pringles, Eggo, and Cheez-It. As of 2018, Kellogg's mission statement was \"Nourishing families so they can flourish and thrive.\"[3] Kellogg's products were manufactured and marketed in over 180 countries.[4] Kellogg's largest factory was at Trafford Park in Trafford, Greater Manchester, United Kingdom, which was also the location of its UK headquarters.[5] Other corporate office locations outside of Battle Creek included Chicago, Dublin (European Headquarters), Shanghai, and Querétaro City.[6] Kellogg's held a Royal Warrant from Queen Elizabeth II until her death in 2022.[7] In October 2023, the company changed its name to Kellanova, and spun off some assets into WK Kellogg Co. The companies have been acquired by Mars Inc. and Ferrero SpA respectively as of 2025. History In 1876, John Harvey Kellogg became the superintendent of the Battle Creek Sanitarium (originally the Western Health Reform Institute founded by Ellen White) and his brother, W. K. Kellogg, worked as the bookkeeper. This is where corn flakes were created and led to the eventual formation of the Kellogg Company. For years, W. K. Kellogg assisted his brother in research to improve the vegetarian diet of the Battle Creek Sanitarium's patients, especially in the search for wheat-based granola. The Kelloggs are best known for the invention of the famous breakfast cereal corn flakes. The development of the flaked cereal in 1894 has been variously described by those involved: Ella Eaton Kellogg, John Harvey Kellogg, his younger brother Will Keith Kellogg, and other family members. There is considerable disagreement over who was involved in the discovery, and the role that they played.[8] It is generally agreed that upon being called out one night, John Kellogg left a batch of wheat-berry dough behind. Rather than throwing it out the following day, he sent it through the rollers and was surprised to obtain delicate flakes, which could then be baked.[8] W. K. Kellogg persuaded his brother to serve the food in a flake form. Soon the flaked wheat was being packaged to meet hundreds of guest mail-order requests after they left the Sanitarium. However, Dr. John Harvey forbade his brother Will from distributing cereal beyond his consumers. As a result, the brothers fell out, and W. K. launched the Battle Creek Toasted Corn Flake Company on February 19, 1906.[9][10] On July 4, 1907, a fire destroyed the main factory building. W.K. Kellogg had the new plant in full operation six months after the fire.[11] Convincing his brother to relinquish rights to the product, Will's company produced and marketed the hugely successful Kellogg's Toasted Corn Flakes and was renamed the Kellogg Toasted Corn Flake Company in 1909, taking on the current name of the Kellogg Company in 1922.[9] By 1909, Will's company produced 120,000 cases of Corn Flakes daily. John, who resented his brother's success, filed suit against Will's company in 1906 for the right to use the family name. The resulting legal battle, which included a trial that lasted an entire month, ended in December 1920 when the Michigan Supreme Court ruled in Will's favor.[12] In 1931, the Kellogg Company announced that most of its factories would shift towards 30-hour work weeks from the usual 40. W.K. Kellogg stated that he did this so that an additional shift of workers would be employed to support people through the depression era. This practice remained until World War II and continued briefly after the war, although some departments and factories remained locked into 30-hour work weeks until 1980.[13] From 1969 to 1970, the slogan “Kellogg's puts more into your day” was used on Sunday morning TV shows. From 1969 to 1977, Kellogg's acquired various small businesses, including Salada Tea, Fearn International,[14] Mrs. Smith's Pies, Eggo, and Pure Packed Foods;[15] however, it was later criticized for not diversifying further like General Mills and Quaker Oats were. After underspending its competition in marketing and product development, Kellogg's US market share hit a low of 36.7% in 1983. A prominent Wall Street analyst called it \"a fine company that's past its prime\" and the cereal market was being regarded as \"mature\". Such comments stimulated Kellogg chairman William E. LaMothe to improve, which primarily involved approaching the demographic of 80 million baby boomers rather than marketing children-oriented cereals. In emphasizing cereal's convenience and nutritional value, Kellogg's helped persuade U.S. consumers aged 25 to 49 to eat 26% more cereal than people of that age ate five years prior. The U.S. ready-to-eat cereal market, worth $3.7 billion at retail in 1983, totaled $5.4 billion by 1988 and had expanded three times as fast as the average grocery category. Kellogg's also introduced new products, including Crispix, Raisin Squares, and Nutri-Grain Biscuits, and reached out internationally with Just Right aimed at Australians and Genmai Flakes for Japan. During this time, the company maintained success over its top competitors: General Mills, which largely marketed children's cereals, and Post, which had difficulty in the adult cereal market.[16] In 2001, Kellogg's acquired the Keebler Company for $3.87 billion.[17][18][19] Over the years, it has also gone on to acquire Morningstar Farms and Kashi divisions or subsidiaries. Kellogg's also owns the Bear Naked, Natural Touch, Cheez-It, Murray, Austin cookies and crackers, Famous Amos, Gardenburger (acquired 2007), and Plantation brands. Presently, Kellogg's is a member of the World Cocoa Foundation.[20] In 2012, Kellogg's became the world's second-largest snack food company (after PepsiCo) by acquiring the potato crisps brand Pringles from Procter & Gamble for $2.7 billion in a cash deal.[21] In 2015, Kellogg's announced that it would source 100% cage-free eggs and eliminate gestation stalls from its pork supply chain by 2025.[22] In 2017, Kellogg's acquired Chicago-based food company Rxbar for $654 million.[23] Earlier that year, Kellogg's also opened new corporate office space in Chicago's Merchandise Mart for its global growth and IT departments.[24] In the UK, Kellogg's also released the W. K. Kellogg brand of organic, vegan and plant-based cereals (such as granolas, organic wholegrain wheat, and \"super grains\") with no added sugars.[25] In 2018, Kellogg's decided to cease their operations in Venezuela due to the economic crisis the country is facing.[26] Their factories were taken by the Venezuelan state under the Nicolás Maduro administration. In mid-2019, Venezuelan Kellogg's cereal boxes began portraying the Venezuelan flag and a motto from Maduro: \"Together, everything is possible\" (Spanish: Juntos todo es posible) alongside Kellogg's logo and mascots were sold all over the country. Kellogg's considers it as an illicit use, and the company stated they would take legal action.[27] On April 1, 2019, it was announced that Kellogg's was selling Famous Amos, Murray's, Keebler, Mother's, and Little Brownie Bakers (one of the producers of the cookies for the Girl Scouts of the USA) to Ferrero SpA for $1.4 billion.[28][29][30] On July 29, 2019, that sale was completed.[31] Kellogg's kept the Keebler cracker line and replaced the Keebler name on their crackers with the Kellogg's name. In June 2019, Kellogg's announced their next-generation Kellogg's® Better Days global commitment, focusing on hunger, children, and farmers, with specific targets to reach by 2030.[32] In October 2019, Kellogg's partnered with GLAAD by \"launching a new limited edition \"All Together Cereal\" and donating $50,000 to support GLAAD's anti-bullying and LGBTQ advocacy efforts\". The All Together cereal combined six mini cereal boxes into one package to bring attention to anti-bullying.[33] In January 2020, Kellogg's decided to work with suppliers to phase out the use of glyphosate by 2025, which some farmers have used as a drying agent for wheat and oats supplied to Kellogg's.[34] In October 2021, workers at all of Kellogg's cereal-producing plants in the United States went on a strike conducted by the Bakery, Confectionery, Tobacco Workers and Grain Millers' International Union over disagreements over the terms of a new labor contract.[35] On December 3, 2021, a tentative deal was struck to end the worker strike,[36] but the union members overwhelmingly rejected the tentative agreement[37] and Kellogg's management announced they would seek to replace all 1,400 striking workers.[38] On December 21, 2021, about 1,400 Kellogg workers approved a collective bargaining agreement, ending the strike, which had lasted 77 days.[39][40][41] On June 21, 2022, Kellogg's announced that the company would spin off three cereal, snacks, and plant-based food divisions.[42][43] The North American cereal and plant-based food spin-off companies will keep Battle Creek as their headquarters and the new snack and international cereal company will be based in Chicago.[44] The successor company, known as Global Snacking Co. temporarily, represents 80 percent or $11.4 billion of Kellogg's sales. 60 percent of Global Snacking's business was snacks, and nearly half of the company's business was in the United States. The cereal business, temporarily called North America Cereal Co., would be the second-largest American cereal company and the largest in Canada and the Caribbean, with 5 of the top 11 brands and $2.4 billion in annual sales. Plant-based foods, representing $340 million in annual sales, would be called \"Plant Co.\" and could even be sold.[45] In January 2023, Kellogg's shelved its plans to spin off its plant food business and would retain it as part of Global Snacking Co.[46] On March 15, 2023, Kellogg's announced that the North America Cereal Co. will be formally named WK Kellogg Co. while the Global Snacking Co. will be called Kellanova. The ticker symbol \"K\" will be used by Kellanova on the NYSE.[47] The split was completed on October 2, 2023.[48] Finances For the fiscal year 2017, Kellogg's reported earnings of US$1.269 billion, with an annual revenue of US$12.932 billion, a decline of 0.7% over the previous fiscal cycle. Kellogg's market capitalization was valued at over US$22.1 billion in November 2018.[49] Brands - Bear Naked, Inc. - Cheez-It Crackers - Eggo - Fruit Winders - Fruity Snacks - Kashi (company) - Krave - Morningstar Farms - Club Crackers - Nutri-Grain - Pop-Tarts - Pringles - Rxbar - Sunshine Biscuits - Town House - Zesta Crackers - Carr's - Rice Krispies Treats - Incogmeato - Froot Loops - Joybol - All-Bran - Apple Jacks - Austin Sandwich Cookies - Corn Pops - Cracklin' Oat Bran - Crispix - Frosted Mini-Wheats - Gardenburger - Honey Smacks - Jumbo Snax Cereal - Frosted Flakes - Corn flakes - Frozen Breakfast - Raisin bran - Mueslix Cereal - Pure Organic Fruit Bars - Smart Start Cereal - Smorz - Toasteds Crackers - Special K Cereal A list of cereal products produced by Kellogg's, with available varieties: - All-Bran: All-Bran Original, All-Bran Bran Buds, All-Bran Bran Flakes (UK), All-Bran Extra Fiber, All-Bran Guardian (Canada) - Apple Jacks - Apple Jacks Apple vs Cinnamon Limited Edition - Apple Jacks 72 Flavor Blast (Germany) - Bran Buds (New Zealand) - Bran Flakes - Chocos (India, Europe) - Chocolate Corn Flakes: a chocolate version of Corn Flakes. First sold in the UK in 1998 (as Choco Corn Flakes or Choco Flakes), but discontinued a few years later. Re-released in 2011. - Cinnabon - Cinnamon Mini Buns - Coco Pops Coco Rocks - Coco Pops Special Edition Challenger Spaceship - Coco Pops Crunchers - Coco Pops Mega Munchers - Coco Pops Moons and Stars - Cocoa Krispies or Coco Pops (also called Choco Pops in France, Choco Krispies in Portugal, Spain, Germany, Austria, and Switzerland, Choco Krispis in Latin America) - Cocoa Flakes - Corn Flakes - Complete Wheat Bran Flakes/Bran Flakes - Corn Pops - Country Store - Cracklin' Oat Bran - Crayola Jazzberry Cereal: In 2021, Kellogg and Crayola teamed up to create a fruit flavored cereal with a coloring book on the box.[62] - Crispix - Crunch: Caramel Nut Crunch, Cran-Vanilla Crunch, Toasted Honey Crunch - Crunchy Nut (formerly Crunchy Nut Cornflakes) - Crunch Nut Bran - Cruncheroos - Disney cereals: Disney Hunny B's Honey-Graham, Disney Mickey's Magix, Disney Mud & Bugs, Pirates of the Caribbean, Disney Princess - Donut Shop - Eggo - Extra (Muesli): Fruit and Nut, Fruit Magic, Nut Delight - Froot Loops: Froot Loops, Froot Loops 1⁄3 Less Sugar, Marshmallow Froot Loops, Froot Bloopers - Frosted Flakes (Frosties outside of the US/Canada): Kellogg's Frosted Flakes, Kellogg's Frosted Flakes 1⁄3Kellogg's Banana Frosted Flakes, Kellogg's Birthday Confetti Frosted Flakes, Kellogg's Cocoa Frosted Flakes, Less Sugar, Tony's Cinnamon Krunchers, Honey Nut - Frosted Mini-Wheats (known in the UK as Toppas until the early 1990s, when the name was changed to Frosted Wheats. The name Toppas is still applied to this product in other parts of Europe, as in Germany and Austria) - Fruit Harvest: Fruit Harvest Apple Cinnamon, Fruit Harvest Peach Strawberry, Fruit Harvest Strawberry Blueberry - Fruit 'n Fibre (not related to the Post cereal of the same name sold in the US) - Fruit Winders (UK) - Genmai Flakes (Japan) - Guardian (Australia, NZ, Canada) - Happy Inside: Bold Blueberry, Simply Strawberry, Coconut Crunch - Honey Loops (formerly Honey Nut Loops) - Honey Nut Corn Flakes - Honey Smacks (US)/Smacks (other markets) - Jif Peanut Butter Cereal (US only) - Just Right: Just Right Original, Just Right Fruit & Nut, Just Right Just Grains, Just Right Tropical, Just Right Berry & Apple, Just Right Crunchy Blends – Cranberry, Almond & Sultana (Australia/NZ), Just Right Crunchy Blends – Apple, Date & Sultana (Australia/NZ) - Khampa Tsampa- Roasted Barley (Tibet)[63] - Kombos - Krave – chocolate cereal introduced in the UK in 2010, then rolled out in Europe as Tresor or Trésor in 2011, and in North America in 2012 - Komplete (Australia) - Low-Fat Granola: Low-Fat Granola, Low-Fat Granola with Raisins - Mini Max - Mini Swirlz - Mini-Wheats: Mini-Wheats Frosted Original, Mini-Wheats Frosted Bite Size, Mini-Wheats Frosted Maple & Brown Sugar, Mini-Wheats Raisin, Mini-Wheats Strawberry, Mini-Wheats Vanilla Creme, Mini-Wheats Strawberry Delight, Mini-Wheats Blackcurrant - Mueslix: Mueslix with Raisins, Dates & Almonds - Nutri-Grain - Nut Feast - Oat Bran: Cracklin' Oat Bran - Optivita - Pop-Tarts Bites: Frosted Strawberry, Frosted Brown Sugar Cinnamon - Raisin Bran/Sultana Bran: Raisin Bran, Raisin Bran Crunch, Sultana Bran (Australia/NZ), Sultana Bran Crunch (Australia/NZ) - Raisin Wheats - Rice Krispies/Rice Bubbles: Rice Krispies, Frosted Rice Krispies (Ricicles in the UK), Gluten Free Rice Krispies, Rice Bubbles, LCMs, Rice Krispies Cocoa (Canada only), Rice Crispies Multi-Grain Shapes, Rice Krispies Treats Cereal[64] - Rocky Mountain Chocolate Factory Chocolatey Almond cereal - Scooby-Doo cereal: Cinnamon Marshmallow Scooby-Doo! Cereal - Smart Start: Smart Start, Smart Start Soy Protein Cereal - Smorz - Special K: Special K, Special K low carb lifestyle, Special K Red Berries, Special K Vanilla Almond, Special K Honey & Almond (Australia), Special K Forest Berries (Australia), Special K Purple Berries (UK), Special K Light Muesli Mixed Berries & Apple (Australia/NZ), Special K Light Muesli Peach & Mango flavour (Australia/NZ), Special K Dark Chocolate (Belgium), Special K Milk Chocolate (Belgium), Special K Sustain (UK) - Spider-Man cereal: Spider-Man Spidey-Berry - SpongeBob SquarePants cereal - Strawberry Pops (South Africa) - Super Mario Cereal - Sustain: Sustain, Sustain Selection - Tresor (Europe) - Variety - Vector (Canada only) - Yeast bites with honey - Kringelz (formerly known as ZimZ!): mini cinnamon-flavored spirals. Only sold in Germany and Austria[65][66] Discontinued cereals and foods - Banana Bubbles[67] - Banana-flavoured variation of Rice Krispies. First appeared in the UK in 1995, but discontinued shortly thereafter. - Banana Frosted Flakes[68] - Bart Simpson's No Problem-O's and Bart Simpson's Eat My Shorts[69][70] - Sold in the UK for a limited period - Bart Simpson Peanut Butter Chocolate Crunch Cereal[71] - Bigg Mixx cereal[71] - Buckwheat & Maple[72] - Buzz Blasts (based on Buzz Lightyear from the Toy Story movies)[71] - C-3PO's cereal: Introduced in 1984 and inspired by the multi-lingual droid from Star Wars, the cereal called itself \"a New (crunchy) Force at Breakfast\" and was composed of \"twin rings phased together for two crunches in every double-O\". In other words, they were shaped like the digit 8. After severing the cereal's ties to Star Wars, the company renamed it Pro-Grain and promoted it with sports-oriented commercials.[73] - Cinnamon Crunch Crispix - Cinnamon Mini-Buns - Cocoa Hoots: Manufactured briefly in the early 1970s, this cereal resembled Cheerios but was chocolate-flavored. The mascot was a cartoon character named Newton the Owl, and one of its commercials featured a young Jodie Foster. - Coco Pops Strawss - Complete Oat Bran Flakes - Concentrate[74] - Corn Flakes with Instant Bananas - Corn Soya cereal - Crunchy Loggs[71] - Double Dip Crunch[64] - Eggo Waf-Fulls - Frosted Krispies - Frosted Rice: This was a combination of Frosted Flakes and Rice Krispies, using Rice Krispies with frosting on them. Tony Jr. was the brand's mascot. - Fruit Twistables - Fruity Marshmallow Krispies - Golden Crackles - Golden Oatmeal Crunch (later revised to Golden Crunch) - Gro-Pup Dog Food and Dog Biscuits - Heartwise (which contained psyllium, an Indian-grown grain used as a laxative and cholesterol-reducer)[75] - Homer's Cinnamon Donut Cereal (based on The Simpsons TV cartoon)[71] - Kenmei Rice Bran cereal[76] - KOMBOs (orange, strawberry and chocolate flavors)[71][77] - Kream Krunch - Krumbles cereal:[78] Manufactured from approximately the 1920s to the mid-1960s; based on shreds of wheat but different from shredded wheat in texture. Unlike the latter, it tended to remain crisp in milk. In the Chicago area, Krumbles was available into the late 1960s. It was also high in fiber, although that attribute was not in vogue at the time. - Marshmallow Krispies (later revised to Fruity Marshmallow Krispies)[64] - Most - Mr. T's Muscle Crunch (1983–1985) - Nut & Honey Crunch[71] - OJ's (\"All the Vitamin C of a 4-oz. Glass of Orange Juice\")[79] - OKs cereal (early 1960s): Oat-based cereal physically resembling the competing brand Cheerios, with half the OKs shaped like letter O's and the other half shaped like K's, but did not taste like Cheerios. OKs originally featured Big Otis, a giant, burly Scotsman, on the box; this was replaced by the more familiar Yogi Bear. - Pep: Best remembered as the sponsor of the Superman radio serial. - Pokémon Cereal: A limited edition cereal that contained marshmallow shapes in the forms of Gen I Pokémon Pikachu, Oddish, Poliwhirl and Ditto. They later returned with marshmallows formed like Cleffa, Wobbuffet and Pichu for a short time. - Pop-Tarts Crunch[64] - Powerpuff Girls Cereal - Product 19: Discontinued in 2016 - Pro Grain[80] - Puffa Puffa Rice (late 1960s–early 1970s) - Raisin Squares[81] - Raisins Rice and Rye[82] - Razzle Dazzle Rice Krispies - Ricicles - Sugar Stars/Stars/All-Stars cereal - Strawberry Rice Krispies - Strawberry Splitz - 3 Point Pops[83] - Tony's Cinnamon Krunchers[71] - Tony's Turboz - Triple Snack[77] - Yogos: Discontinued in 2011 - Yogos (Berry, Mango, Strawberry, 72 Flavor Blast (Germany), Cookies and Cream, Tacos (Mexico)) - Yogos Rollers: Discontinued in 2009 - Zimz: Cinnamon Cereal Discontinued - Start (UK) Marketing Various methods have been used in the company's history to promote the company and its brands. Among these is the design of the Kellogg's logo by Ferris Crane under the art direction of the typeface designer Y. Ames.[citation needed] Another was the well-remembered jingle \"K E double-L, O double-good, Kellogg's best to you!\".[citation needed] With the rising popularity of patent medicine in early 20th century advertising, The Kellogg Company of Canada published a book named A New Way of Living that showed readers \"how to achieve a new way of living; how to preserve vitality; how to maintain enthusiasm and energy; how to get the most out of life because of a physical ability to enjoy it\". It touted the All-Bran cereal as the secret to leading \"normal\" lives free of constipation.[84] Kellogg's was a major sponsor throughout the run of the hit CBS panel show What's My Line?[85] It and its associated products Frosted Flakes and Rice Krispies were also major sponsors for the PBS Kids children's animated series Dragon Tales.[86] Kellogg's is a sponsor of USA Gymnastics and produced the Kellogg's Tour of Gymnastics, a 36-city tour held in 2016 after the Olympic games and featured performances by recent medal-winning gymnasts from the United States.[87] Kellogg's is currently the title sponsor of three college football bowl games. First, it was announced in 2019 that Kellogg's would become the new title sponsor of the Sun Bowl game, with the game being branded as the \"Tony the Tiger Sun Bowl\".[88] This was followed in 2020 by the company using its Cheez-It brand to sponsor of the game now known as the Pop-Tarts Bowl.[89] In 2022, Kellogg's added the Citrus Bowl to its bowl sponsorships, with the game branded as the \"Cheez-It Citrus Bowl\".[90] Premiums and prizes W.K. Kellogg was the first to introduce prizes in boxes of cereal. The marketing strategy that he established has produced thousands of different cereal box prizes that have been distributed by the tens of billions.[91] Children's premiums Beginning in 1909, Kellogg's Corn Flakes had the first cereal premium with The Funny Jungleland Moving Pictures Book. The book was originally available as a prize that was given to the customer in the store with the purchase of two packages of the cereal.[92] But in 1909, Kellogg's changed the book giveaway to a premium mail-in offer for the cost of a dime. Over 2.5 million copies of the book were distributed in different editions over a period of 23 years.[93] Cereal box prizes In 1945, Kellogg's inserted a prize in the form of pin-back buttons into each box of Pep cereal. Pep pins have included U.S. Army squadrons as well as characters from newspaper comics and were available through 1947. There were five series of comic characters and 18 different buttons in each set, with a total of 90 in the collection.[91] Other manufacturers of major brands of cereal, including General Mills, Malt-O-Meal, Nestlé, Post Foods, and Quaker Oats, followed suit and inserted prizes into boxes of cereal to promote sales and brand loyalty. Mascots Licensed brands have been omitted since the corresponding mascots would be obvious (for example, Spider-Man is the mascot for Spider-Man Spidey-Berry). - Cocoa Hoots cereal: Newton the Owl - Cocoa Krispies cereal (Known as Choco Krispis in Latin America, Choco Krispies in Germany, Austria, Spain, and Switzerland, Chocos in India, and Coco Pops in Australia, the UK, and Europe): Jose (monkey), Coco (monkey), Melvin (elephant), Snagglepuss (Hanna-Barbera character), Ogg (caveman), Tusk (elephant), and Snap, Crackle and Pop (who were also, and remain as of February 2014, the Rice Krispies mascots; see below) - Corn Flakes cereal: Cornelius (rooster) - Frosted Flakes (known as Frosties outside the US/Canada, Zucaritas in Latin America and Sucrilhos in Brazil) cereal: Tony the Tiger - Froot Loops cereal: Toucan Sam - Honey Smacks (US)/Smacks (other markets) cereal: Dig 'Em Frog - Raisin Bran cereal: Sunny the Sun - Rice Krispies (known as Rice Bubbles in Australia and New Zealand) cereal: Snap, Crackle and Pop - Ricicles (UK Only) cereal: Captain Rik - Apple Jacks cereal: CinnaMon and Bad Apple - Honey Loops cereal: Loopy (bumblebee), Pops (honey bee) - Keebler cookies and crackers: Ernie and the Elves Motorsports Kellogg's made its first foray into auto racing between 1991 and 1992 when the company sponsored the #41 Chevrolets fielded by Larry Hedrick Motorsports in the NASCAR Winston Cup Series and driven by Phil Parsons, Dave Marcis, Greg Sacks, Hut Stricklin, and Richard Petty, but they gained greater prominence for their sponsorship of two-time Winston Cup Champion Terry Labonte from 1993 to 2006, the last 12 years of that as the sponsor for Hendrick Motorsports' No.5 car. Kellogg's sponsored the No.5 car for Labonte, Kyle Busch, Casey Mears, and Mark Martin until 2010, and it then served as an associate sponsor for Carl Edwards' #99 car for Roush Fenway Racing. Kellogg's placed Dale Earnhardt on Kellogg's Corn Flakes boxes for 1993 six-time Winston Cup champion and 1994 seven-time Winston Cup champion, as well as Jeff Gordon on the Mini Wheats box for the 1993 Rookie of the Year, 1995 Brickyard 400 inaugural race, 1997 Champion, and 1998 three-time champion, and a special three-pack racing box set with Dale Earnhardt, Jeff Gordon, Terry Labonte, and Dale Jarrett in 1996. Merchandising Kellogg's has used some merchandising for their products. Kellogg's once released Mission Nutrition, a PC game that came free with special packs of cereal. It played in a similar fashion as Donkey Kong Country; users could play as Tony the Tiger, Coco the Monkey, or Snap, Crackle, and Pop. Kellogg's has also released \"Talking\" games. The two current versions are Talking Tony and Talking Sam. In these games, a microphone is used to play games and create voice commands for their computers. In Talking Tony, Tony the Tiger, one of Kellogg's most famous mascots, would be the main and only character in the game. In Talking Sam, Toucan Sam, another famous mascot, would be in the game, instead. Some [toy cars] have the Kellogg's logo on them, and occasionally their mascots. There was also a Talking Snap Crackle and Pop software. Olympic Games Kellogg's frequently partners with the Olympic Games to feature American athletes from the Olympic Games on the packages of their cereal brands.[94] In 2017, the company announced its marketing campaign for the 2018 Winter Olympic Games featuring American athletes Nathan Chen, Kelly Clark, Meghan Duggan and Mike Schultz.[95] Misleading claims Advertising We expect more from a great American company than making dubious claims—not once, but twice—that its cereals improve children's health... On June 3, 2010, Kellogg's was found to be making unsubstantiated and misleading claims in advertising their cereal products by the Federal Trade Commission (FTC).[96][97][98] Kellogg's responded by stating \"We stand behind the validity of our product claims and research, so we agreed to an order that covers those claims. We believe that the revisions to the existing consent agreement satisfied any remaining concerns.\"[98] The FTC had previously found fault with Kellogg's claims that Frosted Mini-Wheats cereal improved kids' attentiveness by nearly 20%.[99] The Children's Advertising Review Unit of the Council of Better Business Bureaus has also suggested that the language on Kellogg Pop-Tarts packages saying the pastries are \"Made with Real Fruit\" should be taken off the products.[100] In July 2012, the UK banned a \"Special K\" advertisement due to its citing caloric values that did not take into account the caloric value of milk consumed with the cereal.[101] In 2016 an ad telling UK consumers that Special K is “full of goodness” and “nutritious” was banned.[102] Questionable nutritional value Some of Kellogg's marketing has been questioned in the press, prompted by an increase in consumer awareness of the mismatch between the marketing messages and the products themselves.[103] Food bloggers are also questioning the marketing methods used by cereal manufacturing companies such as Kellogg's, due to their high sugar content and use of ingredients such as high-fructose corn syrup.[104] 2021 Pop-Tarts lawsuit A class-action lawsuit was filed against Kellogg's in October 2021 claiming they are not putting enough strawberries in their strawberry flavored Pop-Tarts, and seeking $5 million in damages.[105] In April 2022, the lawsuit was dismissed by a federal judge.[106] Another lawsuit was filed against Kellog's in 2021, with the plaintiff claiming that Kellogg's defrauded customers regarding the contents of its Frosted Chocolate Fudge Pop-Tarts. The plaintiff stated she would not have purchased the Pop-Tarts had she known they did not contain milk, milkfat, or butter. In June 2022, a US district judge dismissed the lawsuit, stating that a reasonable consumer would not expect those ingredients.[107] Recalls 2010 cereal recall On June 25, the company voluntarily began to recall about 28 million boxes of Apple Jacks, Corn Pops, Froot Loops and Honey Smacks because of an unusual smell and flavor from the packages' liners that could make people ill. Kellogg's said about 20 people complained about the cereals, including five who reported nausea and vomiting. Consumers reported the cereal smelled or tasted waxy or like metal or soap. Company spokeswoman J. Adaire Putnam said some described it as tasting stale. However, no serious health problems had been reported.[108] The suspected chemical that caused the illnesses was 2-methylnaphthalene, used in the cereal packaging process. Little is known about 2-methylnaphthalene's impact on human health as the Food and Drug Administration has no scientific data on its impact on humans, and the United States Environmental Protection Agency (EPA) also does not have health and safety data. This is despite the EPA having sought information on it from the chemical industry for 16 years. 2-Methylnaphthalene is a component of crude oil and is \"structurally related to naphthalene, an ingredient in mothballs and toilet-deodorant blocks\" that the EPA considers a possible human carcinogen.[109][110] Kellogg's offered consumers refunds in the meantime.[111] Only products with the letters \"KN\" following the use-by date were included in the recall.[112] The products were distributed throughout the US and began arriving in stores in late March 2010. Products in Canada were not affected.[113] 2012 cereal recall Kellogg's issued a voluntary recall of some of its \"Frosted Mini-Wheats Bite Size Original\" and \"Mini-Wheats Unfrosted Bite Size\" products due to the possibility of flexible metal mesh fragments in the food. The affected products varied in size from single-serving bowls to large 70-ounce cartons. Use-by dates printed on the recalled packages ranged from April 1, 2013, to September 21, 2013, and were accompanied by the letters KB, AP or FK.[114] Human rights violations and strikes Human right violations of palm oil in 2016 According to Amnesty International in 2016, Kellogg's palm oil provider Wilmar International profited from 8 to 14-year-old child labor and forced labor. Some workers were extorted, threatened or not paid for work. Some workers suffered severe injuries from chemicals such as Paraquat.[115][116] Kellogg's alleged not being aware of the child abuses due to traceability; Amnesty's human rights director replied that \"Using mealy-mouthed excuses about 'traceability' is a total cop-out.\"[117] 2021 strike In October 2021, over a thousand employees at four Kelloggs manufacturing plants in the United States went on strike for better working conditions and higher wages. Two months into the strikes, Kelloggs fired all the striking workers and posted their jobs in December after negotiations with the BCTGM union failed. During the talks, Kelloggs had threatened to move jobs to Mexico if the union did not agree to Kelloggs' proposal.[118] Kelloggs also filed a lawsuit against the union.[119] As a result, several calls for a boycott went viral.[120][121] Political involvement Genetically modified foods labelling Kellogg's donated around US$2 million opposing California Proposition 37, a 2012 ballot initiative that, if enacted, would have required compulsory labeling of genetically engineered food products.[122] In March 2016, though, they vowed to label all of their products with genetically modified organisms as such by 2020.[123] Climate change In August 2014, Kellogg's called on the President to support the Paris Agreement on climate change.[124] In 2016, Kellogg Company urged President-elect Donald Trump to \"continue the Paris Climate Agreement\".[125] Voter ID laws Kellogg's has donated to notable groups opposing voter-ID laws, such as the Applied Research Center (now RaceForward).[126] The company also decided to remove their advertisements from the Breitbart News website.[127] Breitbart News in turn called for a boycott of Kellogg's products.[128] Education grant In January 2012, Kellogg's gave the Calhoun School a $250,000 grant for a \"three-part youth-based project on issues of white privilege and institutionalized racism\".[129] Operations - Australia: - Pagewood[131] - Charmhaven (snack and cereal plant closed in 2014.)[132] - Belgium: Zaventem & Mechelen plant - Brazil: São Paulo - Colombia: Bogotá - Canada: - Mississauga, Ontario – Canadian head office - Anjou, Quebec – Eastern Canada sales office - Calgary, Alberta – Western Canada sales office - London, Ontario – manufacturers and distributes cereals (including Corn Flakes) in Canada. Closed at end of 2014,[133] - Belleville, Ontario – cereal production plant opened 2009 and upgraded 2011; took over some operations from London after 2014 - China: Shanghai – Joint venture with agribusiness and food company Yihai Kerry - Ecuador: Guayaquil - France: Noisy-le-Grand, Paris[134] - Germany: Hamburg (sales and marketing for Germany, Austria, Switzerland, and Scandinavia; production in Germany shut down in 2018)[135] - India: Mumbai - Republic of Ireland: European Head Office - Kellogg Europe Trading, Swords, Dublin[136] - Italy: Milan - Japan: Shinjuku, Tokyo[137] - Malaysia: Bandar Enstek, Negeri Sembilan[138][139] - Mexico: Querétaro - Middle East[140] - Netherlands: Den Bosch[141][142] - Philippines: Alaska Milk Corporation[143] - Poland: Kutno[144] - Portugal: Lisbon - Russia: Kellogg Rus LLC[136] (Sold to the Russian company Chernogolovka in July 2023)[145] - South Africa: Springs[146] - South Korea: Seoul - Spain: Valls (cereal production plant) and Alcobendas (Spanish head office)[136] - Sri Lanka: Colombo; Sri Jayawardenapura Kotte - Thailand: Bangkok, Rayong (snacks and cereals) - United Kingdom: - England: Manchester[136] - Scotland: Portable Foods Manufacturing Livingston[136] - Wales: Wrexham including Portable Foods Manufacturing[136] - United States: - Morocco See also - W. K. Kellogg Foundation - Kellogg's Cereal City USA – a former tourist attraction in Battle Creek, Michigan focused on the company's history - List of breakfast cereals - Toucan Sam#Maya Archaeology Initiative for a 2011 trademark dispute over another organization's toucan logo - A. D. David Mackay References - ^ a b c d e f Kellogg Company Form 10-K for 2018 Annual Report. SEC.gov (Report). U.S. Securities and Exchange Commission. Archived from the original on May 16, 2019. Retrieved September 26, 2019. - ^ \"Proxy Statement\". Archived from the original on July 15, 2022. Retrieved March 27, 2023. - ^ \"Our Vision & Purpose\". Kelloggcompany.com. Archived from the original on January 16, 2018. Retrieved December 3, 2016. - ^ \"Kellogg Company Fact Sheet (PDF)\" (PDF). kelloggcompany.com. Retrieved April 24, 2014. - ^ a b \"Global brand, local values\". Manchester Evening News. May 27, 2008. Archived from the original on July 19, 2012. Retrieved August 3, 2011. - ^ \"Our Locations\". kelloggcareers.com. Archived from the original on May 28, 2018. Retrieved May 27, 2018. - ^ \"Kellogg Marketing & Sales Co (UK) Ltd\". royalwarrant.org. Royal Warrant Holders Association. Archived from the original on January 28, 2018. Retrieved January 28, 2018. - ^ a b Markel, Howard (2017). The Kelloggs: The Battling Brothers of Battle Creek. Pantheon. pp. 110–112, 129–133. ISBN 978-0307907271. Archived from the original on March 27, 2023. Retrieved March 27, 2023. - ^ a b Shurtleff, William; Aoyagi, Akiko (January 6, 2014). History of Seventh-day Adventist Work with Soyfoods, Vegetarianism, Meat Alternatives, Wheat Gluten, Dietary Fiber and Peanut Butter (1863-2013): Extensively Annotated Bibliography and Sourcebook. Soyinfo Center. pp. 994–95. ISBN 978-1-928914-64-8. Archived from the original on March 27, 2023. Retrieved August 20, 2018. - ^ Benjamin, André (June 30, 2013). Conquer The Recession. Andre J Benjamin. p. 27. GGKEY:6SA764GJCF1. Archived from the original on March 27, 2023. Retrieved August 20, 2018. - ^ \"The Kelloggs: The Battling Brothers of Battle Creek, book review on Adventist Today website\". Archived from the original on March 14, 2023. Retrieved March 27, 2023. - ^ Kellogg v. Kellogg Toasted Corn Flake Co., 212 Mich. 95. 180 N.W. 397 (1920) - ^ Kaplan, Jeffrey (May–June 2008). \"The Gospel of Consumption\". Archived from the original on November 14, 2014. Retrieved June 25, 2010. - ^ Ennis, Thomas W. (September 2, 1970). \"Bravo Acquires Marks Tractor\". The New York Times. Retrieved September 7, 2025. - ^ \"Kellogg Company History\". FundingUniverse.com. Archived from the original on February 17, 2020. Retrieved November 28, 2019. - ^ Sellers, Patricia (August 29, 1988). \"How King Kellogg Beat the Blahs\". Fortune. Retrieved June 10, 2015. - ^ Winter, Greg (October 27, 2000). \"Kellogg Agrees to Buy Keebler Foods for $3.86 Billion\". The New York Times. Retrieved August 18, 2025. - ^ \"Kellogg Plans to Cut 470 Jobs As Part of Keebler Acquisition\". The Wall Street Journal. March 30, 2001. Archived from the original on December 31, 2019. Retrieved September 11, 2019. - ^ \"USA: Kellogg completes acquisition of Keebler\". Just Food. March 27, 2001. Retrieved August 18, 2025. - ^ \"What are you doing about sustainable cocoa?\". Kelloggs. Archived from the original on October 3, 2021. Retrieved October 3, 2021. - ^ \"Kellogg to buy Pringles for $2.7 billion\". Reuters.com. February 15, 2012. Archived from the original on August 26, 2022. Retrieved March 27, 2023. - ^ \"Kellogg switching to cage-free eggs, crate-free pork | WATTAgNet\". WATTPoultry.com. November 1, 2015. Retrieved August 22, 2025. - ^ Wilkins, Peter. \"What $600M RXBar Acquisition By Kellogg's Says About Chicago's Simple Food And Beverage Industry\". Forbes. Archived from the original on August 15, 2020. Retrieved January 28, 2018. - ^ Ori, Ryan; Trotter, Greg (April 3, 2017). \"Kellogg opens 50-employee Merchandise Mart office\". chicagotribune.com. Archived from the original on January 28, 2021. Retrieved March 1, 2021. - ^ \"Kellogg targets health-conscious consumers with W.K.Kellogg line\". Foodbev.com. Foodbev Media. November 14, 2017. Archived from the original on August 24, 2018. Retrieved August 23, 2018. - ^ \"Kellogg Says It's Discontinuing Venezuela Operations\". Bloomberg. Retrieved May 17, 2018.[dead link] - ^ Olmo, Guillermo D. (November 15, 2019). \"Kellogg's: cómo los cereales más famosos del mundo se volvieron chavistas en Venezuela\" [Kellogg's in Venezuela: how the world's most famous cereals became Chavez-ian]. BBC.com (in Spanish). Archived from the original on January 1, 2020. Retrieved December 9, 2019. - ^ Hirsch, Lauren (April 1, 2019). \"Kellogg to sell Keebler, Famous Amos to Nutella-owner Ferrero\". CNBC.com. Archived from the original on January 28, 2021. Retrieved April 6, 2019. - ^ Reddy, Arjun. \"Kellogg has agreed to sell its Keebler and Famous Amos businesses to Ferrero for $1.3 billion\". Business Insider. Archived from the original on August 12, 2020. Retrieved April 2, 2019. - "
}