{
  "url": "https://krinos.com/Markets/",
  "title": "Markets – Krinos",
  "text": "Markets and Capabilities Markets We Serve Ethnic Market We have a long tradition of serving ethnic food retailers and distributors of all sizes from industrial size to mom-and-pop stores selling Greek, Turkish, Russian, Eastern European, and Middle Eastern specialty foods. Decades of on-the-ground relationships with customers yield long-lasting relationships and deep understanding of the ethnic food market and consumers. Mainstream Market We partner with national distributors, club stores, and supermarket chains to create custom programs and product offerings to meet their needs, as well as trade promotional strategies that are focused on driving sales and volume. We supply specialty grocery items, dairy and deli items, and a full range of bulk programs including olives and antipasti. Foodservice We offer a wide range of products to restaurants (from national chains to small operators), distributors, and foodservice in healthcare, K-12 schools, colleges and universities. We offer high quality products from around the world, meeting diverse culinary needs and preferences. Private Label The Olive Packing Company (part of the Krinos family) is a premier manufacturer and co-packer of private label gourmet olives and specialty products for some of the biggest retail brands. It has a 35,000 sq. ft. facility purpose-built for the specialty food category with state-of-the-art refrigeration, processing and packing equipment, and significant storage capacity. Nationwide Distribution Krinos Foods distributes its products all across the United States. We have state-of-the-art distribution facilities in New York, Atlanta, Chicago, Texas, Louisiana and California. Warehouse Capability Our warehouses contain nearly ten million cubic feet of dry storage and over two million cubic feet of cold storage—making available to our customers over 1,800 SKUs of products in cheeses, olives, olive oils, pasta, confectionary, canned goods, frozen foods, meats, coffees, beverages and more. Manufacturing and R&D Krinos Foods’ packaging lines have annual production capacities of over 5 million cases. Krinos’ in-house Research and Development department regularly develops new items and can adapt or create products to customer specifications. The company also maintains full-service Quality and Control departments to ensure that it produces and distributes products of only the highest quality that meet all government standards. Krinos Foods’s production facility in Texas is also SQF certified. Nationwide Distribution Krinos Foods distributes all across the United States and, in Canada, through Krinos Foods Canada. Manufacturing and R&D Krinos Foods’ packaging lines have annual production capacities of over 5 million cases. In addition, the Toronto facility utilizes patented Fillo Dough machines that each produces over 900 pounds of dough per hour. Krinos’ in-house Research and Development department regularly develops new items and can adapt or create products to customer specifications. The company also maintains full-service Quality and Control departments to ensure that it produces and distributes products of only the highest quality that meet all government standards. Krinos Foods’s production facility in Texas is also SQF certified."
}