{
  "url": "https://www.veuveclicquot.com/en-us/visitus.html",
  "title": "Veuve Clicquot - Visit our Cellars",
  "text": "The abuse of alcohol is dangerous for your health. Drink responsibly. Veuve Clicquot supports the responsible consumption of wines and spirits, through Moët Hennessy, member of Spirits EUROPE, Discus and Wine in Moderation. Plunge into the Clicquot art of living: the House invites you to a total immersion in its history and exceptional heritage, through a tour in the Unesco World Heritage-listed Crayères, a stroll among the vines, a Rosé-themed picnic on the estate of the Manoir de Verzy, or lunch on the sunny terrace of the brand-new Café Clicquot. Choose the experience that suits you best below! Closed from December 28, 2025 Reopening from Tuesday to Sunday, from April 7 to June 28, 2026 Open every day of the week from June 29 to August 30, 2026 Open Tuesday to Sunday from September 1 to November 1, 2026 Open Wednesday to Sunday from November 4 to January 3, 2027 *Closed on May 1st, December 25th and January 1st, 2027 9:30 am - 5:30 pm 1 Rue Albert Thomas 51100 Reims Visit, boutique and café accessible to people with reduced mobility (to be mentioned when making an appointment). 30 min walk from the city center 10 min drive from Reims Champagne-Ardenne train station 15 min by car from City Centre Station Public tours: visitscenter@veuve-clicquot.fr Private tours: Our House also offer private tours of our Cellars and Vineyards. Please contact us for more information. Open since March 2023, our first permanent Clicquot Café in the world is open to all visitors. Extend your experience at our House's Visit Center to the Café Clicquot terrace for a chic and relaxed bistronomic experience. 1. Can I bring my pet with me to the cellars? The site will not accept animals inside. We meet standards related to our food safety certifications and cannot accept animals throughout the visitor centre. 2. Is there free parking near your cellars? There is a car park for our visitors - it consists of 5 bus spaces and 20 car spaces. There is also a drop-off point right in front of our reception if you arrive by cab. There is also a space for bicycles. However, we do not have space to keep your strollers or wheelchairs. Nevertheless, upon request at the reception, you will be able to go down to the cellars with your strollers or wheelchairs for your visit. Any items left unattended are under the responsibility of our visitors. 3. Is there a shop on site? Due to renovation work in the shop, in 2025 the visitor center will be open only on: December 19, 20, 21, 26, 27, and 28. Closed from December 28, 2025. Reopening from Tuesday to Sunday, from April 7 to June 28, 2026. Open every day of the week from June 29 to August 30, 2026. Opening hours: 9:30am - 5:30pm 4. Where can I access the General Terms and Conditions of Sale? The General Terms and Conditions of Sale are available here."
}