{
  "url": "https://techcommunity.microsoft.com/blog/spblog/sharepoint-in-the-era-of-ai-spring-2025-updates/4411598",
  "title": "SharePoint in the Era of AI: Spring 2025 Updates | Microsoft Community Hub",
  "text": "Every day, customers add over 2 billion pieces of content to SharePoint and create over 2 million sites. People in organizations of all sizes engage with each other and their content using SharePoint as the world’s most flexible content platform: creating files, sharing videos, publishing intranet sites, managing processes, and more – all backed by a single governance and control plane. Inside all this collaboration, communication, and automation lies an organization’s greatest store of knowledge – that’s why SharePoint is the primary citation source for Copilot. It’s been a community-fueled 2025 for us on the SharePoint team. We started off the year with a January online event about the General Availability of our new AI-fueled UX for site creators. We followed up with a March Hackathon that showcased inspiring examples of what customers can create with SharePoint sites and agents. And now this week there are hundreds of Microsoft product makers on site in Las Vegas to engage with our customers and partners at the Microsoft 365 Community Conference, our biggest community event of the year. Before we dig into the details, there is a lot to take in! Let's start with both a summary text below & an audio summary, generated using OneDrive’s new audio overview skill! Summary: Spring 2025 Updates for SharePoint With the M365 Community Conference this week, now is the time to share the big picture – both what’s new and what’s important right now for everyone leveraging SharePoint to deliver on their organization’s content & AI strategy: - Knowledge: SharePoint agents enable users to quickly turn SharePoint sites and documents into scoped agents that are subject matter experts. Since their general availability four months ago, we continue to invest in SharePoint agent’s response quality, governance, and integration with Teams & the Copilot app. - Collaboration: OneDrive is the AI-powered files app that enables content collaboration throughout Microsoft 365. Today, we are announcing enhancements to Copilot in OneDrive (including more file skills like audio summaries) and a new simple, smart, and secure sharing experience for files. - Automation: Workflows, metadata, and agents are at the heart of every information governance and content process digitization strategy. Recently, we’ve simplified the approvals on all content, reduced the price of AI-based metadata autofill, and more tightly integrated SharePoint into Copilot Studio. And we've streamlined document management and electronic signing with Agreements and SharePoint eSignature. Giving you a secure, end to end experience within Microsoft Word, accelerating approvals and reducing reliance on physical signatures. - Communication: SharePoint is the simplest place to create compelling content & generate engagement on your intranet and news post. New AI-based section creation makes it easier than ever to call on Copilot to create stunning web content & a new FAQ webpart uses AI to streamline this common intranet tasks. On the SharePoint team, we believe developers and IT administrators are incredible enablers for an organization’s AI transformation and we are excited about investments here: Developers: - SharePoint Framework & Graph: We released the SharePoint Framework (SPFx) 1.21 this Spring which included support for 3P web parts in flexible sections and enhancements to Viva Connections cards. We are also introducing new ways to manage the throttling behavior for your apps working with SharePoint data. - SharePoint Embedded: SharePoint Embedded brings SharePoint as a platform to any custom application that needs document storage integrated with Microsoft Office and Microsoft Purview. We’re excited to share the preview of custom SharePoint Embedded Agents. IT Administrators: - Security & Compliance: Securing your content for AI remains a top priority for every organization, which is why SharePoint Advanced Management (SAM) is now included when organizations purchase Copilot. Recently, we’ve added new permissions reports, added site lifecycle policies, and provided insights on agent usage on SharePoint content. - Backup & Archive: The Microsoft 365 Backup & Microsoft 365 Archive products provide organizations with effective ways to manage growing content, recover quickly from disruptions, and keep storage costs in check. M365 Backup will soon provide dynamic policies and granular file/folder restore. M365 Archive now has more predictable billing and an end user search experience. Knowledge: What’s new for SharePoint Agents With SharePoint agents, anyone can create a knowledge agent that is stored alongside the content itself, and SharePoint agents have built-in governance controls to help organizations manage their creation, access, and usage effectively. Even though it's only been a few months since general availability, it’s been amazing to talk to customers who are using SharePoint agents in so many unique ways. Customers like Amey, a leading provider of engineering, operations and decarbonization solutions across the United Kingdom, are just one example of how agents have impacted their work. SharePoint agents allow their employees to easily access accurate health and safety protocols-in their native language-and on their mobile devices, keeping them safe while on the job. Similarly, as customer zero, Microsoft’s government affairs team explains how they have been able to streamline access to critical data and enhance productivity through SharePoint agents. The team details how agents act as “force multipliers,” enabling them to quickly pull relevant data and create customized talking points on specific issues in a fraction of the time. Over the next several months, we’re excited to continue to invest in the user experience and response quality of SharePoint agents. Expect to see SharePoint agents in Copilot Chat and stronger integration with Teams - all designed to help anyone get started quickly with AI on their content. We are also investing in agent governance, including: - Improved monitoring and analytics through SharePoint Online, Microsoft 365 Admin Center, SharePoint Advanced Management, and Copilot Analytics Dashboard - Greater billing controls through departmental billing and budget limits See all the details on the public roadmap and this dedicated blog about SharePoint agents for IT administrators. You can learn more about how customers are using SharePoint agents, plus quick start guides and agent inspiration ideas on the SharePoint agents adoption site. Collaboration: A simple, more intelligent sharing experience Link-based sharing over the last 10 years has become a standard in today’s modern work force, empowering organizations to collaborate on content across teams. We are improving on this experience by implementing new improvements to the undying sharing model to make the collaboration experience simpler, more secure, and AI-powered. The new sharing experience The new hero link experience gives each file a single, dedicated link for easy and secure sharing—just copy, email, or share within your organization. Permissions can be updated quickly, ensuring security or enabling collaboration—all with just a few clicks. Enhanced with Copilot Copilot also elevates the sharing experience. Imagine giving your team a concise summary of the file you’re sharing to keep everyone aligned. With a single tap on the Copilot button, you can generate a useful summary to include in your sharing notification, offering coworkers the essential details without needing to open the file. We're making sharing not just smarter and safer, but less hassle and maintenance—easy to customize, a breeze to understand, and secure right out of the box! You’ve asked for these features, and now they’re finally here: - Bulk Editing Permissions: Update sharing settings for multiple files or folders in one go—no more clicking through each item individually. - Sharable Address Bar URLs: Instantly copy and share the link straight from your browser’s address bar, making collaboration feel as simple as browsing your favorite website And more are coming with this new improvement. To read more about the hero link and features read our full blog covering all you need to know to be the hero of your sharing and collaboration experience. Check out our OneDrive blog for more Automation: Workflow, metadata and agents Over 2 billion flows are orchestrated on SharePoint every week from simple document approvals inside SharePoint and Teams to custom workflows built in Power Automate or Copilot Studio. SharePoint is on a mission to simplify business processes for all M365 users, enable AI to easily extract metadata from your content, and provide state of the art API and connector support for building advanced multi-step business processes with Copilot Studio. Simple business process everywhere Many document processes involve a set of authors, an approver, and a method to record the document's approval. This is what simple approvals are built for starting with lists in 2024 and now available on all document libraries in SharePoint. Start in Word, save to SharePoint, and approve in Teams with just a few clicks. Enhancing metadata with AI Autofill columns is just one of the ways that AI helps enhance the automation process. It enriches content by extracting and generating structured metadata at scale – increasing the value of your content real estate. You can use natural language prompts to describe the metadata you need, easily classifying, extracting, or generating new content as metadata. Automating the process structuring new and modified files. We want everyone to experience the power of Autofill, which is why we introduced an incredible pricing adjustment. SharePoint Autofill pricing has adjusted from $0.05 per page to $0.005 per page since March 2025. Perfect opportunity to try Autofill yourself! Learn more about SharePoint pay-as-you-go services. Streamlined management for agreement documents and signatures In today’s business climate, speed and precision aren’t optional—they’re expected. That’s why we’re reimagining how organizations handle high-value documents with Agreements and SharePoint eSignature. Agreements brings automation, intelligence, and structure to your most critical documents—NDAs, contracts, HR letters, and more. Create, store, and manage everything in one place, with built-in insights and workflows that do the heavy lifting. And now, with SharePoint eSignature integrated directly into Microsoft Word, signing is as simple as clicking “Send.” No printing. No scanning. Just secure, compliant approvals—fast. This isn’t just about reducing paperwork. It’s about empowering teams to move faster, stay compliant, and focus on what matters. Read the blog for more details! Connecting Copilot Studio to SharePoint SharePoint is deeply integrated into the Power Platform and Copilot Studio to enable the best of breed autonomous agents. SharePoint starts as a seamless knowledge repository that you can connect an agent to. Right from the Copilot Studio builder you can add files, libraries, and sites to pull knowledge into your agent. And now you can go even further by using the SharePoint connector with Agent Flows in Copilot Studio. This gives every agent access to over 50 actions in SharePoint and 13 triggers all in the flow of an agent. Communication: Design beautiful, engaging, and powerful sites Our new UX for enabling web creators to build beautiful, engaging and powerful sites & pages is now generally available. And we are continuing to use AI in new ways to transform web content authoring – making it’s simpler than ever to express your ideas and use your content and brands within a SharePoint page. Customers like Avanade are already using these and more to get more out of their intranet investments. From concept to creation with Copilot Copilot in SharePoint allows you to get started with building great looking pages with just a single prompt. You can ground your pages in existing documents or meetings and use a range of pre-built templates to get a running start on creating relevant and engaging content for your intranet. We’re now thrilled to share that Copilot in SharePoint also lets you create and fine-tune beautiful sections right on the page. Just provide a prompt, and Copilot crafts a section using relevant content, automatically adopting visuals and layouts that match your page. You can refine it further with prompts or switch to the classic tried and tested GUI-based approach for extra tweaks—it’s seamless and engaging! Enhancing FAQ content for simple authoring SharePoint pages are frequently authoritative sources for content across the enterprise. We are now making this even easier by allowing authors to create highly relevant, great looking FAQs using AI. We are excited to announce the new FAQ web part for SharePoint. Page authors can use this to generate an FAQ from high relevance sources like policy documents or key meeting / event transcripts. You can easily refine and reorder categories, questions and answers before publishing to ensure accuracy and relevance. And the best part is you can add it to any SharePoint page just like you would any other web part. Unlock creativity with flexible sections With flex sections, you can freely move, resize, overlap, and group web parts on a 2-dimensional grid, giving you complete control over your page layout and look. With support for 1st and 3rd party web parts, flex sections allow authors to create pages that uniquely reflect their individual and organizational creativity. Flex sections are generally available and is already driving great impact for our customers: authors who use flex sections report satisfaction scores of up to 20 – 30% higher than those who don’t! Elevate your page with editorial cards The brand-new Editorial card is a simple, yet highly flexible web part that allows you to create stunning pages. Get started with just a few clicks, and if inclined use advanced image controls and a range of call to actions to make sections of your page truly stand out and drive traffic to key destinations across your enterprise. Manage your brand with brand center and themes The SharePoint Brand Center allows brand managers to host, manage and control their brand identity across M365 from a single source. Your brand managers can create and manage custom font packages, themes, press kits and an approved asset library to drive brand coherence across M365 for your organization. And SharePoint site owners can apply these guidelines with the single click of a button. Amplify from SharePoint Amplify is a centralized internal communications platform that allows communicators to orchestrate, manage, and analyze cross-channel communications campaigns across M365. However, we’ve also heard from our customers that they sometimes want to publish to one channel first and then go cross-channel, or that they prefer to start with the channel they are most familiar with and build from there. We’re excited to share more about Amplify from SharePoint, which brings all of the great cross-channel communications controls and analytics capabilities that Amplify provides right into SharePoint. Communicators can now take published news posts and increase their reach and engagement by Amplifying across other M365 channels such as email, Engage and Teams to reach users where they are. Developers: Extending the power of SharePoint With the power of SPFx, Microsoft Graph, and SharePoint Embedded, developers can create robust and dynamic solutions tailored to what the business requires. Building on these pieces enable solutions to inherit Microsoft 365’s secure environment by default and integration with Copilot and agents. We saw a glimpse at how creative our customers and partners can be with the SharePoint Hackathon. In the extensible intranet category, the winners were able to build a solution across Teams, SharePoint and Office.com in just a few weeks time leveraging SPFx for hosting, auth, connection to Graph, and page layout. SharePoint enables extensibility at every layer of the stack. You can innovate with webparts for flexible sections and custom cards with SPFx that work with SharePoint Agents. You can create open extensions on files for all your enterprise custom metadata needs or plumb SharePoint news with external content using the News link api in graph to name a few. Beyond building solutions on or integrated with SharePoint, we are also enabling new tools to scale those solutions. We are introducing a capability for customers to mark an application as business critical, giving it service priority with SharePoint. When enabled that application will be able to scale beyond normal limits and be the last to be throttled in your environment. We also added more transparency in our existing limits apps so applications developers can more easily understand scale. Watch the latest demo of this new capability. SharePoint Embedded SharePoint Embedded is a new way to build a new kind of app. An AI forward platform, SharePoint Embedded lets you deliver critical Microsoft 365 document management capabilities as part of every app you build, including Microsoft 365 Copilot, Microsoft Office, and Microsoft Purview. SharePoint Embedded delivers these powerful capabilities using the Microsoft Graph API. This year, we have announced a number of new capabilities. - The SharePoint Embedded Visual Studio Code extension is now GA and it quickly enables you to create everything you need to try SharePoint Embedded, both in your own code and in any of several sample apps. Learn more or see it in action. - Custom SharePoint Embedded Agents allow you to reason across documents inside of an isolated file storage container. These agents are quick and easy to deliver as part of any custom app. Learn more or watch a demo. - We launched a sample SharePoint Embedded Power Platform app a few months ago, and are excited to announce a forthcoming private preview of a formal Power Platform connector. Contact spe-connector@microsoft.com if you would like to be part of the private preview. You can learn more about SharePoint Embedded on Microsoft Learn or the SharePoint Embedded YouTube playlist. IT Administrators: Your data is secure, reliable, and managed with extra intelligence. For IT professionals, the evolving landscape of content management demands not only robust collaboration tools but also unwavering vigilance in data security and intelligent oversight. SharePoint stands at the heart of enterprise knowledge sharing—but its true value is realized when every document, conversation, and asset is safeguarded by advanced governance and powered by intelligent management. Ensuring sensitive information remains protected while enabling seamless access across your organization in today’s AI-accelerated world is essential. SharePoint Advanced Management (SAM) As you prepare for Copilot deployment, managing content permissions is crucial. To support deployment, we are introducing a private preview SAM report to identify all sites accessible to a specific user or group. The Restricted Content Discovery (RCD) policy is also now generally available, helping prevent unintended content exposure in Copilot and search. A private preview offers AI-driven content policy recommendations, allowing users to review and apply policies such as external sharing, block download, and device restrictions. Administrators can also leverage the agents Insights report to monitor agent usage and enhance site security with RAC or RCD features. You can learn more about SharePoint Advanced Management on What’s new in Content Governance in SharePoint, OneDrive, and Teams for AI Era. Microsoft 365 Backup & Microsoft 365 Archive Microsoft 365 Backup & Microsoft 365 Archive are one of the ways we help you do just that! Together, these products provide fast, reliable recovery, and low-cost, long-term storage for SharePoint content. The added benefit is keeping it within the Microsoft 365 trust boundary- giving you the confidence to know your data is safe. Wrapping Up Thank you to our customers, partners, and community for helping us co-design these innovations and sharing your stories of momentum and feedback. We look forward to sharing even more news and engaging with our community again at Microsoft Build on Monday, May 19th. More Resources: - The latest tutorial on building a SharePoint site. - NEW SharePoint agent adoption guide (adoption.microsoft.com) - SharePoint agents (adoption.microsoft.com) - Subscribe to the SharePoint community blog"
}