{
  "url": "https://www.iprima.cz/tv-program",
  "title": "Program kanálů TV Prima na dnes, zítra a další dny | prima+",
  "text": "TV Program Kamarádi 1. série, 83. epizoda ST Vesnici čeká první natáčecí den. A hned se bude točit velká davová scéna! Ženy se nadšeně chystají do komparzu a filmařská horečka dopadne i na muže. Všichni už se vidí pomalu jako filmové hvězdy. Majerovi přij… Co na to vaše zdraví 26. série, 5. epizoda ST Pořad je opatřen skrytými titulky (ST)Autosalon 17. série, 5. epizoda Světové novinky, nelítostné testy, koncepty budoucnosti v tradičním motoristickém magazínu. Anglický pacient Právě skončila válka a těžce popálený maďarský hrabě vypráví zdravotní sestře svůj smutný životní příběh o nešťastné lásce... Americko-britský oscarový film (1996). Hrají R. Fiennes, J. Binocheová, W. Dafoe a d… Stíny smrti 3. série, 12. epizoda Policistku Mayu čeká velmi podivný případ. Někdo zavraždil učitelku, která byla se skupinkou dětí na prohlídce katedrály, a následně zmizelo i všech devět dětí... Francouzský krimiseriál (2019). Hrají S. Forest… Rosamunde Pilcher Eric je vdovec, který vychovává dvě dospívající dcery. Jednoho dne narazí na mladou policistku a zamiluje se do ní. Problém nastane v momentě, kdy zjistí, že má přítele, a tím je navíc člověk, kterého Eric velm… Predátor vs. kořist 1. série, 3. epizoda ST Vrcholoví predátoři patří k nejimpozantnějším tvorům na Zemi. Odhalte jejich lovící strategie a triky, kdy lov selhal a kořist unikla... Britský dokumentární seriál (2024). Pořad je opatřen skrytými titulky (ST… Svatba na první pohled Austrálie 10. série, 2. epizoda Může vzniknout skutečná láska mezi dvojicí, která se poprvé uvidí až u oltáře...? Australská reality show (2023). Slunečno, místy vraždy 2. série, 9. epizoda ST Na školním hřišti je zastřelen trenér. Podezřelým je jeden ze studentů, u něhož ve skříňce se našla krabice s náboji. Ten se hájí tím, že zbraň náhodně vystřelila, když se o ni s trenérem tahal... Americký krim… Ráno M*A*S*H 1. série, 97. epizoda STAD Personál polní vojenské chirurgické nemocnice se s válkou vyrovnává po svém. Ani v Koreji jim nechybí humor a odvaha, vlastnosti, bez kterých by situaci jen stěží přežili... Americký válečný seriál (1972 – 1982… M*A*S*H 1. série, 98. epizoda STAD Personál polní vojenské chirurgické nemocnice se s válkou vyrovnává po svém. Ani v Koreji jim nechybí humor a odvaha, vlastnosti, bez kterých by situaci jen stěží přežili... Americký válečný seriál (1972 – 1982… M*A*S*H 1. série, 99. epizoda STAD Personál polní vojenské chirurgické nemocnice se s válkou vyrovnává po svém. Ani v Koreji jim nechybí humor a odvaha, vlastnosti, bez kterých by situaci jen stěží přežili... Americký válečný seriál (1972 – 1982… Zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. (Premiéra) Pořad je opatřen skrytými titulky (ST)Zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. (Premiéra) Pořad je opatřen skrytými titulky (ST)Polední zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. (Premiéra) Pořad je opatřen skrytými titulky (ST)Prima Pauza: Partička 1. série, 114. epizoda Námořní vyšetřovací služba 12. série, 19. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Námořní vyšetřovací služba 12. série, 20. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Námořní vyšetřovací služba 12. série, 21. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Pohoda venkova 1. série, 5. epizoda Pohoda venkova 1. série, 7. epizoda Není nad domácí pohodu! A k té jednoznačně patří nejen dobrá nálada, ale i dobré jídlo! Proto se s vámi „Karolína, domácí kuchařka“ podělí o své rodinné recepty, tipy a návody, které svou zkušeností doladila té… Pohoda venkova 2. série, 2. epizoda Prima SVĚT 25. série, 46. epizoda To nejzajímavější ze světa. Už od roku 1995! Příhody Bolka a Lolka 1. série, 59. epizoda Bolek a Lolek se nikdy nenudí a prožívají různá dobrodružství... Polský animovaný seriál (1972). (Premiéra) Příhody Bolka a Lolka 1. série, 60. epizoda Bolek a Lolek se nikdy nenudí a prožívají různá dobrodružství... Polský animovaný seriál (1972). (Premiéra) Sláva králi Jelimánovi: Ve vyhnanství 1. série, 16. epizoda Poznejte nová dobrodružství oblíbeného krále Jelimána, jeho věrného Morta a dalších kamarádů... Americký animovaný dětský seriál (2017). Sláva králi Jelimánovi: Ve vyhnanství 1. série, 19. epizoda Poznejte nová dobrodružství oblíbeného krále Jelimána, jeho věrného Morta a dalších kamarádů... Americký animovaný dětský seriál (2017). Sláva králi Jelimánovi: Ve vyhnanství 1. série, 20. epizoda Poznejte nová dobrodružství oblíbeného krále Jelimána, jeho věrného Morta a dalších kamarádů... Americký animovaný dětský seriál (2017). Kung Fu Panda: Tlapky osudu 1. série, 17. epizoda Pandí mazák Po má nový úkol. Musí naučit čtyři malé pandy, jak nakládat s nově nabytými silami... Americký animovaný seriál (2019). Kung Fu Panda: Tlapky osudu 1. série, 18. epizoda Pandí mazák Po má nový úkol. Musí naučit čtyři malé pandy, jak nakládat s nově nabytými silami... Americký animovaný seriál (2019). Jak vycvičit draky: Ochránci z ostrova Berk 1. série, 9. epizoda Akce a napětí čeká na každém kroku, když se Škyťák s Bezzubkou a jejich nebojácnými přáteli pouští do nových dobrodružství... Americký animovaný dětský seriál (2014). Jak vycvičit draky: Ochránci z ostrova Berk 1. série, 10. epizoda Akce a napětí čeká na každém kroku, když se Škyťák s Bezzubkou a jejich nebojácnými přáteli pouští do nových dobrodružství... Americký animovaný dětský seriál (2014). Sláva králi Jelimánovi: Ve vyhnanství 1. série, 13. epizoda Poznejte nová dobrodružství oblíbeného krále Jelimána, jeho věrného Morta a dalších kamarádů... Americký animovaný dětský seriál (2017). Sláva králi Jelimánovi: Ve vyhnanství 1. série, 14. epizoda Poznejte nová dobrodružství oblíbeného krále Jelimána, jeho věrného Morta a dalších kamarádů... Americký animovaný dětský seriál (2017). Kung Fu Panda: Tlapky osudu 1. série, 11. epizoda Pandí mazák Po má nový úkol. Musí naučit čtyři malé pandy, jak nakládat s nově nabytými silami... Americký animovaný seriál (2019). Kung Fu Panda: Tlapky osudu 1. série, 12. epizoda Pandí mazák Po má nový úkol. Musí naučit čtyři malé pandy, jak nakládat s nově nabytými silami... Americký animovaný seriál (2019). Jak vycvičit draky: Ochránci z ostrova Berk 1. série, 3. epizoda Akce a napětí čeká na každém kroku, když se Škyťák s Bezzubkou a svými nebojácnými přáteli pouští do nových dobrodružství... Americký animovaný dětský seriál (2014). Jak vycvičit draky: Ochránci z ostrova Berk 1. série, 4. epizoda Akce a napětí čeká na každém kroku, když se Škyťák s Bezzubkou a svými nebojácnými přáteli pouští do nových dobrodružství... Americký animovaný dětský seriál (2014). Pohoda venkova 1. série, 7. epizoda Angel 3. série, 53. epizoda ST Potřebujete pomoc? Už dál nehledejte. Prokletý upír Angel a jeho agentura jsou pro vás ti praví! Americký akční fantastický seriál (1999 - 2004). Hrají D. Boreanaz, A. Denisof, Ch. Carpenterová a další. Pořad j… Angel 3. série, 54. epizoda ST Potřebujete pomoc? Už dál nehledejte. Prokletý upír Angel a jeho agentura jsou pro vás ti praví! Americký akční fantastický seriál (1999 - 2004). Hrají D. Boreanaz, A. Denisof, Ch. Carpenterová a další. Pořad j… Den Námořní vyšetřovací služba 11. série, 17. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Námořní vyšetřovací služba 11. série, 18. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Show Jana Krause Jan Kraus, jak ho znáte, v úspěšné show! Aktuální hosté, témata bez cenzury a ta nejlepší late night show. Počasí 26. série, 35. epizoda HLAVNÍ ZPRÁVY 26. série, 35. epizoda Ty nejdůležitější aktuální zprávy z domova i ze světa v hlavní zpravodajské relaci. Atraktivně a srozumitelně. (Premiéra) Prima ZIMA 26. série, 35. epizoda ST Pořad je opatřen skrytými titulky (ST)Zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. (Premiéra) Pořad je opatřen skrytými titulky (ST)Krimi zprávy 26. série, 35. epizoda ST Aktuální události z oblasti kriminality. Zločiny očima profesionálů, zkušených reportérů i diváků. (Premiéra) Pořad je opatřen skrytými titulky (ST)Zprávy z regionů 26. série, 35. epizoda ST Aktuální zprávy ze všech regionů České republiky. Události, zajímavé příběhy, témata vašeho kraje. Pořad je opatřen skrytými titulky (ST)Co na to vaše peněženka 26. série, 25. epizoda ST Jak ušetřit, do čeho investovat a na co si dát pozor? Rady i své recepty nabídnou přední ekonomové i politici. (Premiéra) Pořad je opatřen skrytými titulky (ST)K věci 26. série, 35. epizoda ST Podrobný rozbor aktuálních událostí a témat s významnými osobnostmi veřejného života. (Premiéra) Pořad je opatřen skrytými titulky (ST)HLAVNÍ ZPRÁVY 26. série, 35. epizoda ST Ty nejdůležitější aktuální zprávy z domova i ze světa v hlavní zpravodajské relaci. Atraktivně a srozumitelně. Pořad je opatřen skrytými titulky (ST)Griffinovi 3. série, 39. epizoda ST Peter a Lois chtějí ještě jedno dítě. S tím ale zásadně nesouhlasí malý Stewie a dělá všechno možné, aby jim v početí zabránil... Americký kultovní animovaný seriál (2001). Pořad je opatřen skrytými titulky (ST… Griffinovi 3. série, 40. epizoda ST Griffinovi se musí v rámci programu na ochranu svědků přestěhovat. Chris se v novém bydlišti poprvé zamiluje a Stewie objeví krásu country hudby... Americký kultovní animovaný seriál (2001). Pořad je opatřen sk… Griffinovi 3. série, 41. epizoda ST Na Briana přišlo jaro, a tak při návštěvě u rodičů Lois svede jejich psí šampionku... Americký kultovní animovaný seriál (2001). Pořad je opatřen skrytými titulky (ST)Simpsonovi 33. série, 18. epizoda STAD Bartovi se líbí jeho nová učitelka a Líza se při natáčení dokumentárního filmu spřátelí s chobotnicí... Americký kultovní animovaný seriál (2022). Pořad je opatřen audiodeskripcí (AD) a skrytými titulky (ST)Simpsonovi 33. série, 19. epizoda STAD Když je Líza přijata jako náhradník za zraněného saxofonistu do pochodové kapely springfieldské střední školy, netuší, jakou kamarádku si najde... Americký kultovní animovaný seriál (2022). Pořad je opatřen aud… Simpsonovi 33. série, 20. epizoda STAD Bart zjistí, že je raubíř po matce Marge. Homer naopak prožívá další krizi, neboť dojde k závěru, že žádné z jeho dětí není po něm... Americký kultovní animovaný seriál (2022). Pořad je opatřen audiodeskripcí (… Simpsonovi 33. série, 21. epizoda STAD Děda Simpson se ocitne v pěkné bryndě, když ho doběhne jeho skrytá minulost v rychlém občerstvení. S Lízou odlétá do New Yorku, aby pomohl svému starému příteli vypořádat se s proradným Šášou Krustym... Americk… Griffinovi 4. série, 60. epizoda ST Lois si plní zakázaný sen z mládí a stává se modelkou... Americký kultovní animovaný seriál (2005). Pořad je opatřen skrytými titulky (ST)Griffinovi 4. série, 61. epizoda ST Brian jde místo Lois na schůzku knižního klubu a pozná tam učitelku ze školy Jamese Woodse. Protože nikdo neví, kdo Woods byl, rozhodnou se školu přejmenovat... Americký kultovní animovaný seriál (2005). Pořad … Griffinovi 4. série, 62. epizoda ST Peter při lovení ryb ztroskotá na opuštěném ostrově. Když se za dlouhou dobu vrátí domů, zjistí, že jeho místo v rodině zaujal někdo jiný... Americký kultovní animovaný seriál (2005). Pořad je opatřen skrytými … Simpsonovi 36. série, 6. epizoda STAD Jak se žije ženám a dívkám ve Springfieldu? Třaskavá muzikálová čísla na toto téma střídají hluboké myšlenky a miniaturní dramata s nedozírnými následky. A k tomu hrozí, že Patty a Selmě dojdou kvůli ucpanému P… Simpsonovi 36. série, 7. epizoda STAD Simpsonovi jdou navštívit létající cirkus, kde Líza potká tajemného potetovaného muže, který ji svými mystickými portály přenese do třech alternativních realit... Americký kultovní animovaný seriál (2024). Pořa… Čarodějnice Upozornění pro všechny děti i jejich rodiče! Čarodějnice z celého světa chystají proti dětem ďábelský plán. Naštěstí tu jsou malý Luke a jeho světaznalá babička... Americký film (1989). Hrají A. Hustonová, M. Z… Strážkyně času Jednoho dne čtyři dívky objeví v rodinném sídle průchod vedoucí do tajemného světa. Tímto světem je království Keoherus, ve kterém zůstávají nedobrovolně uvězněny, dokud neshromáždí kouzelné krystaly, které jim… Nikdy neříkej nikdy ST Teroristická organizace Spectre se zmocnila dvou jaderných hlavic a hrozí, že je použije, když nedostane peníze. Do akce jsou povoláni agenti a James Bond má za úkol zjistit, kde se hlavice nacházejí, a zachrán… Jake a tlusťoch 3. série, 25. epizoda ST Státní návladní J. L. McCabe je náladový bručoun, který je milý akorát na svého psa. Jeho hlavní vyšetřovatel Jake Styles je usměvavý hezoun, který se otočí za každou sukní. Společně jsou ale postrachem všech z… Julie Lescautová 3. série, 39. epizoda STAD Podivná smrt mladé ženy se osobně dotýká kolegy komisařky Lescautové. Rozhodne se pátrat na vlastní pěst, což se mu málem stane osudným... Francouzský kriminální seriál (1998). Hrají V. Genestová, M. Diouf, R. … Vraždy v Kitzbühelu 5. série, 5. epizoda ST Ctižádostivá kriminalistka Karin Koflerová se spolu se svým šarmantním kolegou pouští do vyšetřování často komplikovaných případů v malebném horském středisku a jeho nejbližším okolí. Tentokrát pátrají po vraho… Záchranáři z hor 12. série, 2. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Záchranáři z hor 12. série, 3. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Záchranáři z hor 12. série, 4. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Jak jsem poznal vaši matku 9. série, 5. epizoda ST Robin vyhraje v partičce pokeru Jamesův zásnubní prsten. Barney se na ni kvůli tomu zlobí. A Ted se pře s Lily a Marshallem o to, jestli jim dal svatební dar... Americký sitcom (2013). Hrají J. Radnor, J. Segel… Jak jsem poznal vaši matku 9. série, 6. epizoda ST Ted si vybírá partnerku na svatební víkend. Ale nemá zrovna šťastnou ruku. Robin a Barney jsou konfrontováni se svým oddávajícím a Marshall se dozvídá něco víc o Daphne... Americký sitcom (2013). Hrají J. Radno… Neuvěřitelné dorty 3. série, 5. epizoda Mistři cukráři vytváří neuvěřitelné dorty, které svou propracovaností mnohdy připomínají umělecká díla... Britská reality show (2018). Neuvěřitelné dorty 3. série, 6. epizoda Mistři cukráři vytváří neuvěřitelné dorty, které svou propracovaností mnohdy připomínají umělecká díla... Britská reality show (2018). Jak jsem poznal vaši matku 9. série, 19. epizoda ST Ted se snaží Barneymu pomoct vybrat ten pravý oblek. Lily začíná vyšilovat z toho, že Robin ze svatby vůbec nevyšiluje. Tak ji hecuje a hecuje... Americký sitcom (2013). Hrají J. Radnor, J. Segel, C. Smuldersov… Jak jsem poznal vaši matku 9. série, 20. epizoda ST Marshall požádá Teda a Barneyho, aby mu pomohli vypátrat, kam zmizela Lily uprostřed jejich hádky... Americký sitcom (2013). Hrají J. Radnor, J. Segel, C. Smuldersová, N. P. Harris, A. Hanniganová a další. Pořa… Záchranáři z hor 11. série, 14. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Záchranáři z hor 12. série, 1. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Angel 3. série, 63. epizoda ST Potřebujete pomoc? Už dál nehledejte. Prokletý upír Angel a jeho agentura jsou pro vás ti praví! Americký akční fantastický seriál (1999 - 2004). Hrají D. Boreanaz, A. Denisof, Ch. Carpenterová a další. Pořad j… Angel 3. série, 64. epizoda ST Potřebujete pomoc? Už dál nehledejte. Prokletý upír Angel a jeho agentura jsou pro vás ti praví! Americký akční fantastický seriál (1999 - 2004). Hrají D. Boreanaz, A. Denisof, Ch. Carpenterová a další. Pořad j… Večer Krimi zprávy 26. série, 35. epizoda Aktuální události z oblasti kriminality. Zločiny očima profesionálů, zkušených reportérů i diváků. SHOWTIME 26. série, 35. epizoda Exkluzivní zákulisí života celebrit – luxusní večírky, žhavé drby, slavnostní premiéry a módní trendy! Show Jana Krause Jan Kraus, jak ho znáte, v úspěšné show! Aktuální hosté, témata bez cenzury a ta nejlepší late night show. Show Jana Krause Jan Kraus, jak ho znáte, v úspěšné show! Aktuální hosté, témata bez cenzury a ta nejlepší late night show. Námořní vyšetřovací služba 11. série, 17. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Námořní vyšetřovací služba 11. série, 18. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… Prima Pauza: Partička 1. série, 102. epizoda Nový den 26. série, 35. epizoda Všechny informace pro úspěšný start vašeho dne na jednom místě. Exkluzivní hosté, zprávy, počasí i sport. (Premiéra) Krimi zprávy 26. série, 35. epizoda ST Aktuální události z oblasti kriminality. Zločiny očima profesionálů, zkušených reportérů i diváků. Pořad je opatřen skrytými titulky (ST)SHOWTIME 26. série, 35. epizoda ST Exkluzivní zákulisí života celebrit – luxusní večírky, žhavé drby, slavnostní premiéry a módní trendy! Pořad je opatřen skrytými titulky (ST)Co na to vaše zdraví 26. série, 5. epizoda ST Pořad je opatřen skrytými titulky (ST)Zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)Zprávy 26. série, 35. epizoda ST Ty nejnovější ověřené zprávy z domova i ze světa. Rychle, stručně a srozumitelně. (Premiéra) Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)HLAVNÍ ZPRÁVY 26. série, 35. epizoda ST Ty nejdůležitější aktuální zprávy z domova i ze světa v hlavní zpravodajské relaci. Atraktivně a srozumitelně. Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)360° 26. série, 35. epizoda ST Nejdůležitější události dne analyzované ze všech úhlů pohledu. Pokud o nich mluvíte, my taky. Pořad je opatřen skrytými titulky (ST)Nový den 26. série, 35. epizoda ST Všechny informace pro úspěšný start vašeho dne na jednom místě. Exkluzivní hosté, zprávy, počasí i sport. (Premiéra) Pořad je opatřen skrytými titulky (ST)Simpsonovi 36. série, 8. epizoda STAD Simpsonovi letí do Louisiany za rodinou Marge. Let se však stane Homerovou noční můrou – na palubě se totiž ocitne obklopen neukázněnými pasažéry, kteří ho začnou dohánět k šílenství... Americký kultovní animov… Simpsonovi 36. série, 9. epizoda STAD Homer, Selma a Patty se rozhádají a odmítají spolu mluvit. Marge už neví, jak situaci vyřešit, a tak sáhne po radikálním řešení... Americký kultovní animovaný seriál (2024). Pořad je opatřen audiodeskripcí (AD)… Autosalon 17. série, 5. epizoda Světové novinky, nelítostné testy, koncepty budoucnosti v tradičním motoristickém magazínu. Hrdinové ledových silnic 3. série, 6. epizoda Přidejte se k hrdinům, kteří proměňují třpytivé cesty severního Švédska ve sjízdné silnice. Sníh a led jsou zde každodenní výzvou jak pro odtahovky, tak pro pluhy... Švédský dokumentární seriál (2018). Simpsonovi 36. série, 6. epizoda STAD Jak se žije ženám a dívkám ve Springfieldu? Třaskavá muzikálová čísla na toto téma střídají hluboké myšlenky a miniaturní dramata s nedozírnými následky. A k tomu hrozí, že Patty a Selmě dojdou kvůli ucpanému P… Simpsonovi 36. série, 7. epizoda STAD Simpsonovi jdou navštívit létající cirkus, kde Líza potká tajemného potetovaného muže, který ji svými mystickými portály přenese do třech alternativních realit... Americký kultovní animovaný seriál (2024). Pořa… Simpsonovi 36. série, 8. epizoda STAD Simpsonovi letí do Louisiany za rodinou Marge. Let se však stane Homerovou noční můrou – na palubě se totiž ocitne obklopen neukázněnými pasažéry, kteří ho začnou dohánět k šílenství... Americký kultovní animov… Simpsonovi 36. série, 9. epizoda STAD Homer, Selma a Patty se rozhádají a odmítají spolu mluvit. Marge už neví, jak situaci vyřešit, a tak sáhne po radikálním řešení... Americký kultovní animovaný seriál (2024). Pořad je opatřen audiodeskripcí (AD)… Griffinovi 4. série, 60. epizoda ST Lois si plní zakázaný sen z mládí a stává se modelkou... Americký kultovní animovaný seriál (2005). Pořad je opatřen skrytými titulky (ST)Griffinovi 4. série, 61. epizoda ST Brian jde místo Lois na schůzku knižního klubu a pozná tam učitelku ze školy Jamese Woodse. Protože nikdo neví, kdo Woods byl, rozhodnou se školu přejmenovat... Americký kultovní animovaný seriál (2005). Pořad … Griffinovi 4. série, 62. epizoda ST Peter při lovení ryb ztroskotá na opuštěném ostrově. Když se za dlouhou dobu vrátí domů, zjistí, že jeho místo v rodině zaujal někdo jiný... Americký kultovní animovaný seriál (2005). Pořad je opatřen skrytými … Hrdinové ledových silnic 3. série, 6. epizoda Přidejte se k hrdinům, kteří proměňují třpytivé cesty severního Švédska ve sjízdné silnice. Sníh a led jsou zde každodenní výzvou jak pro odtahovky, tak pro pluhy... Švédský dokumentární seriál (2018). Anglický pacient Právě skončila válka a těžce popálený maďarský hrabě vypráví zdravotní sestře svůj smutný životní příběh o nešťastné lásce... Americko-britský oscarový film (1996). Hrají R. Fiennes, J. Binocheová, W. Dafoe a d… Námořní vyšetřovací služba 12. série, 21. epizoda ST Tým zvláštních agentů, kteří operují mimo vojenské velení, musí vyšetřit každý zločin, který má něco společného s námořními silami, bez ohledu na to, jakou hodnost mají podezřelí. Vede je zvláštní agent Leroy J… M*A*S*H 1. série, 76. epizoda STAD Personál polní vojenské chirurgické nemocnice se s válkou vyrovnává po svém. Ani v Koreji jim nechybí humor a odvaha, vlastnosti, bez kterých by situaci jen stěží přežili... Americký válečný seriál (1972 – 1982… M*A*S*H 1. série, 77. epizoda STAD Personál polní vojenské chirurgické nemocnice se s válkou vyrovnává po svém. Ani v Koreji jim nechybí humor a odvaha, vlastnosti, bez kterých by situaci jen stěží přežili... Americký válečný seriál (1972 – 1982… Přestávka ve vysílání Vraždy v Kitzbühelu 5. série, 6. epizoda ST Ctižádostivá kriminalistka Karin Koflerová se spolu se svým šarmantním kolegou pouští do vyšetřování často komplikovaných případů v malebném horském středisku a jeho nejbližším okolí. Tentokrát do Kitzbühelu př… Stíny smrti 3. série, 12. epizoda Policistku Mayu čeká velmi podivný případ. Někdo zavraždil učitelku, která byla se skupinkou dětí na prohlídce katedrály, a následně zmizelo i všech devět dětí... Francouzský krimiseriál (2019). Hrají S. Forest… Slunečno, místy vraždy 2. série, 10. epizoda ST V bažinách rezervace najdou skauti mrtvého divočáka a v jeho útrobách ostatky člena pobřežní stráže a bývalého seržanta námořnictva... Americký kriminální seriál (2011). Hrají M. Passmore, K. Sanchezová, C. Góm… Jake a tlusťoch 3. série, 25. epizoda ST Státní návladní J. L. McCabe je náladový bručoun, který je milý akorát na svého psa. Jeho hlavní vyšetřovatel Jake Styles je usměvavý hezoun, který se otočí za každou sukní. Společně jsou ale postrachem všech z… Slunečno, místy vraždy 2. série, 10. epizoda ST V bažinách rezervace najdou skauti mrtvého divočáka a v jeho útrobách ostatky člena pobřežní stráže a bývalého seržanta námořnictva... Americký kriminální seriál (2011). Hrají M. Passmore, K. Sanchezová, C. Góm… Julie Lescautová 3. série, 39. epizoda STAD Podivná smrt mladé ženy se osobně dotýká kolegy komisařky Lescautové. Rozhodne se pátrat na vlastní pěst, což se mu málem stane osudným... Francouzský kriminální seriál (1998). Hrají V. Genestová, M. Diouf, R. … Přestávka ve vysílání Záchranáři z hor 12. série, 5. epizoda ST Extrémní horolezec Andreas Marthaler se s kamarádem Stefanem Hoferem přidává k týmu horských záchranářů, kteří obětavě pracují v prostředí majestátních rakouských Alp... Německý seriál (2010). Hrají M. Gruber, … Rosamunde Pilcher Eric je vdovec, který vychovává dvě dospívající dcery. Jednoho dne narazí na mladou policistku a zamiluje se do ní. Problém nastane v momentě, kdy zjistí, že má přítele, a tím je navíc člověk, kterého Eric velm… Velvet 1. série, 63. epizoda Na konci padesátých let nabízí madridský obchodní dům Galerías Velvet elegantní, sofistikované a drahé oděvy. Alberto je pohledný dědic majestátního módního impéria, Ana chudá švadlena, která tu už celé roky pr… Velvet 1. série, 64. epizoda Na konci padesátých let nabízí madridský obchodní dům Galerías Velvet elegantní, sofistikované a drahé oděvy. Alberto je pohledný dědic majestátního módního impéria, Ana chudá švadlena, která tu už celé roky pr… Záchranáři na dálnici 401 6. série, 1. epizoda Rád pomůžuÚsek dálnice 401 v okolí Toronta je nejvytíženější na světě. Sledujte, jak se s náročnými dopravními situacemi a uvíznutými vozidly v oblasti jižního Ontaria vypořádává několik odtahových firem... Kan… Predátor vs. kořist 1. série, 3. epizoda ST Vrcholoví predátoři patří k nejimpozantnějším tvorům na Zemi. Odhalte jejich lovící strategie a triky, kdy lov selhal a kořist unikla... Britský dokumentární seriál (2024). Pořad je opatřen skrytými titulky (ST… Pozoruhodná planeta Země 1. série, 3. epizoda Polární záře, blesky, sopečné erupce i kruhové duhy – přírodní úkazy, které lze spatřit ve správný čas a na správném místě. Tým vědců, dobrodruhů a filmařů se vydává zachytit jejich neuvěřitelnou krásu... Brits… Katastrofy v přímém přenosu 2. série, 8. epizoda Katastrofy způsobené přírodními živly bývají tragické. Poznejte jejich sílu a zjistěte, jak tornáda, záplavy nebo zemětřesení vznikají... Americký dokumentární seriál (2023). Detektiv s detektorem 1. série, 4. epizoda Vášnivý dobrodruh Gibba se svým detektorem kovů prozkoumává místa, kde se odehrály důležité historické válečné události. Sleduje jejich stopy, aby našel poklady minulosti pohřbené hluboko v divoké přírodě... It… Titáni obrany 1. série, 1. epizoda Tanky a obrněné transportéryPři vývoji nejvýkonnějších zbraní hrají hlavní roli technologie a inženýrství. Tyto moderní zbraně mají odradit možné nepřátele, ale také určují ráz celosvětové bezpečnosti a geopoli… Hitlerova kronika 1. série, 6. epizoda Spousta nových nebo nově kolorovaných záběrů vám přiblíží život v Evropě v první polovině dvacátého století. S narůstajícími sociálními nepokoji se postupně dostává k moci všehoschopný vůdce, jehož plánům a poh… Setkání s UFO 1. série, 2. epizoda Po celém světě dosahuje počet případů pozorování UFO svého maxima. Obyčejní lidé jsou svědky záhadných úkazů na obloze. Poznejte jejich pozoruhodné příběhy... Kanadský dokumentární seriál (2021). Vetřelci dávnověku 14. série, 2. epizoda ST Podle některých badatelů dokazují staré legendy, záznamy z kronik a archeologické nálezy, že na naší planetě mnohokrát v minulosti přistáli mimozemšťané. Jsou tyto důkazy přesvědčivé? Byli mimozemšťané předobra… Mocné řeky 1. série, 5. epizoda Biolog a dobrodruh Jeremy Wade se vydává na pouť po šesti největších řekách světa. Jeho cílem je zjistit, proč v nich v poslední době ubývá ryb, a zejména těch velkých... Britský dokumentární seriál (2018). Pohoda venkova 2. série, 2. epizoda Přestávka ve vysílání Svatba na první pohled Austrálie 10. série, 2. epizoda Může vzniknout skutečná láska mezi dvojicí, která se poprvé uvidí až u oltáře...? Australská reality show (2023). Tyhle šaty beru! 6. série, 3. epizoda Navštivte nejvyhledávanější svatební salon v Atlantě. Zdejší personál udělá vše pro to, aby pomohl zoufalým nevěstám nalézt ty skutečně nejdokonalejší šaty... Americká reality show (2014). Tyhle šaty beru! 6. série, 4. epizoda Navštivte nejvyhledávanější svatební salon v Atlantě. Zdejší personál udělá vše pro to, aby pomohl zoufalým nevěstám nalézt ty skutečně nejdokonalejší šaty... Americká reality show (2014). Amerika hledá topmodelku 11. série, 9. epizoda Dívky ze všech koutů USA bojují o možnost stát se další americkou topmodelkou. Která z nich se nejlépe vypořádá nejen s náročnými modelingovými disciplínami, ale i se stresem a vypětím, jež soutěž nutně prováze… Svatba na první pohled USA 16. série, 20. epizoda Může vzniknout skutečná láska mezi dvojicí, která se poprvé uvidí až u oltáře...? Americká reality show (2023). Neuvěřitelné dorty 3. série, 5. epizoda Mistři cukráři vytváří neuvěřitelné dorty, které svou propracovaností mnohdy připomínají umělecká díla... Britská reality show (2018). Neuvěřitelné dorty 3. série, 6. epizoda Mistři cukráři vytváří neuvěřitelné dorty, které svou propracovaností mnohdy připomínají umělecká díla... Britská reality show (2018). Prostřeno v Británii 1. série, 32. epizoda Pět hostitelů v britské verzi úspěšného pořadu Prostřeno. Každý den jiné menu, spousta zábavy i závěrečné bodování. Reality show o vaření plná napětí a dobrého jídla... Britská soutěžní reality show (2010). Jake a tlusťoch 3. série, 24. epizoda ST Státní návladní J. L. McCabe je náladový bručoun, který je milý akorát na svého psa. Jeho hlavní vyšetřovatel Jake Styles je usměvavý hezoun, který se otočí za každou sukní. Společně jsou ale postrachem všech z… Prvních 48 hodin 24. série, 2. epizoda Nahlédněte do práce detektivů během prvních 48 hodin vyšetřování těch nejzávažnějších zločinů. Pokud se v této době nepodaří najít klíčovou stopu, šance na dopadení pachatele dramaticky klesá... Americký dokume… Doktor z hor: Nové příběhy 13. série, 13. epizoda ST Doktor Martin Gruber zachraňuje životy v prostředí krásných hor, kde na něj čeká spousta pracovních i osobních příběhů... Další řada německého seriálu (2020). Hrají H. Sigl, H. Ruprecht, M. Baumgartnerová a dal… Doktor z hor: Nové příběhy 13. série, 14. epizoda ST Doktor Martin Gruber zachraňuje životy v prostředí krásných hor, kde na něj čeká spousta pracovních i osobních příběhů... Další řada německého seriálu (2020). Hrají H. Sigl, H. Ruprecht, M. Baumgartnerová a dal… Pohoda venkova 1. série, 7. epizoda"
}