{
  "url": "https://support.google.com/googleplay/answer/113409?hl=es",
  "title": "Descargar aplicaciones Android y contenido digital de Google Play Store - Ayuda de Google Play",
  "text": "Google Play Store pone a tu disposición aplicaciones, juegos y contenido digital que puedes descargar en tu dispositivo. En algunos casos, también puedes usar aplicaciones instantáneas que no necesitan instalación. Algunos contenidos están disponibles sin coste económico y otros debes comprarlos. Buscar y descargar aplicaciones o contenido digital - En tu dispositivo, abre Google Play Store o ve a play.google.com en un navegador web. - Busca contenido. - Selecciona un elemento. - Selecciona Instalar o el precio del elemento. - Sigue las instrucciones que aparecen en pantalla para completar la transacción y obtener el contenido. - Si has hecho una compra anteriormente: selecciona tu método de pago con la flecha hacia abajo . - Si es tu primera compra: tu método de pago se añadirá a tu cuenta de Google. Nota: Para cambiar el idioma de visualización de Google Play, cambia el idioma en los ajustes de tu cuenta de Google. Buscar aplicaciones para tu reloj, tablet, televisión, coche u otro dispositivo Puedes usar los filtros de Play Store para buscar aplicaciones y juegos que sean compatibles con cada uno de tus dispositivos. En tu teléfono: - Abre la aplicación Google Play . - En la parte superior, busca una aplicación o un contenido concreto. - En el menú desplegable, elige un dispositivo asociado a tu cuenta. En tu ordenador: - Ve a play.google.com. - Arriba a la derecha, haz clic en la lupa . A continuación, busca una aplicación o el contenido que quieras. - Selecciona el desplegable Dispositivo y elige un dispositivo asociado a tu cuenta. Una vez que hayas seguido estos pasos, verás las aplicaciones que son compatibles con tu dispositivo en los resultados de búsqueda. Nota: Para utilizar el filtro de búsqueda, debes haber iniciado sesión con una cuenta asociada a varios dispositivos Android. Buscar tus aplicaciones y contenido Buscar aplicaciones y juegos Buscar libros, juegos y otro contenido digital El contenido digital aparece en una de las aplicaciones de Google Play en tu dispositivo en función del tipo de contenido: - Google Play Libros : descarga la aplicación Play Libros. - Aplicación móvil Google Play Juegos : descarga la aplicación móvil Play Juegos. - Google TV : descarga la aplicación Google TV. Instalar aplicaciones y contenido en otros dispositivos Las aplicaciones y el contenido digital están conectados a tu cuenta de Google, no solo al dispositivo. No tienes que volver a comprarlos si cambias de dispositivo. Puedes usarlos en varios dispositivos. Consulta cómo instalar aplicaciones y contenido desde tu teléfono u ordenador en otros dispositivos. El contenido no se puede transferir entre cuentas Si tienes varias cuentas, no podrás transferir contenido entre ellas en Google Play. Si utilizas varias cuentas en tu dispositivo, comprueba que has iniciado sesión con la cuenta que quieres usar antes de completar la compra. Si has comprado una aplicación con la cuenta equivocada, ponte en contacto con el desarrollador de la aplicación. Es posible que te reembolse el importe de la compra."
}