{
  "url": "https://www.wrdw.com/2023/02/21/conviction-upheld-local-mom-who-stabbed-2-year-old-daughter-death/",
  "title": "Conviction upheld for local mom who stabbed 2-year-old to death",
  "text": "Conviction upheld for local mom who stabbed 2-year-old to death ATLANTA (WRDW/WAGT) - The Georgia Supreme Court upheld the murder conviction of an Augusta mother accused of stabbing her 2-year-old daughter to death because she believed they had to get to heaven to avoid persecution. The case of Marina Middlebrooks was one of three local decisions Tuesday by the court. Middlebrooks pleaded not guilty by reason of insanity for the May 2, 2013, stabbing death of her 2-year-old daughter, Sky Allen. Testimony in the trial focused on Middlebrooks’ reported beliefs that she believed God had given her and Sky a “green aura” that made them “special and unique” and that she and her daughter were being “persecuted” by people who “would mean them harm” because “they would want to have access to that gift.” According to testimony, she believed that by committing suicide, she and Sky would “go to heaven so that they would be safe.” To get to heaven, she believed she and her daughter would have to die by their own hands and they had to be naked because the clothes, including any jewelry, would block the spirits from leaving their bodies, according to testimony. She also believed she could control and slow down time by moving her hands in a particular way, according to testimony. A jury found her guilty of murder and cruelty to children in the first degree, and she was sentenced to serve life in prison without parole plus 20 years in prison. After a hearing on Nov. 24, 2020, the trial court denied Middlebrooks’ motion for a new trial. She appealed, and her appeal was denied. Other cases Jonathan Tavarus Evans Evans had challenged his convictions for malice murder and other crimes in connection with the April 28, 2018, shooting death of Jamirus Wright and the non-fatal shooting of Brandon Martin. The shooting occurred as the victims were on an apartment patio, where Evans had followed them from a convenience store. He’d previously gotten into an altercation with them, according to authorities. Evans was convicted of malice murder, felony murder, aggravated assault and two counts of possession of a firearm during the commission of a felony. He was sentenced to life in prison without the possibility of parole for malice murder and 30 years consecutive for aggravated assault and the two firearm-possession convictions. He appealed on the grounds of ineffective counsel, but his appeal was denied. Jeremy Gene Taylor After a jury trial in December 2013, Jeremy Gene Taylor was convicted of the malice murder of Eric Bolar and the aggravated battery of Seaborn Roberts. Bolar died after an attack at the jail where he was a fellow inmate with Taylor, who’d been taken there after an altercation with Roberts at a sober-living house. Taylor admitted attacking Bolar, who had to be placed on life support after the attack and died two weeks later, according to testimony. When asked why, Taylor responded, “because I felt like it,” according to testimony. He appealed on a number of grounds, but lost. Copyright 2023 WRDW/WAGT. All rights reserved."
}