{
  "url": "https://stradivarisociety.com/history-of-stradivari-and-guarneri-del-gesu/",
  "title": "Stradivari and Guarneri del Gesù | Stradivari Society",
  "text": "Antonio Stradivari (1644-1737) and Giuseppe Guarneri del Gesù (1698-1744) are the two most celebrated violin makers of all time. Working in the small northern Italian city of Cremona, these two craftsmen left an unsurpassable legacy. Though violin making reached its zenith in the hands of Stradivari and Guarneri del Gesù, the story of the violin begins much earlier in Cremona. Andrea Amati (c 1505-1577) is the earliest recorded violin maker and, in all likelihood, the inventor of the violin. His sons Antonio and Girolamo, commonly referred to as the Brothers Amati, took over the shop after his death. Nicolò Amati, the most famous member of the family, was born to Girolamo in 1596 and took over the family business after 1630. For centuries, musicians and connoisseurs have prized Nicolò Amati violins for their superb craftsmanship and wonderfully responsive tone. During the 17th century, the name Amati was virtually a synonym for a fine violin. As important as Nicolò Amati was as a violin maker, he was perhaps even more significant to the ultimate success and perfection of the violin as a teacher and inspiration. As a result of his pupils and followers, nearly all violins made in the 17th century were based in some way on Amati models either from direct contact with the master or through imitation of his instruments. Both Stradivari and Guarneri del Gesù descended from the Amati violin-making tradition in Cremona. Antonio Stradivari The earliest known violin labeled by Antonio Stradivari was made in 1666, and on the label Stradivari proclaimed himself to be a pupil of Nicolò Amati. Beyond this particular label (which is not known to have been used on any subsequent instruments), his precise relationship to Nicolò Amati is not known. Stradivari made instruments in the Amati style during the first part of his career, from 1666 until about 1680. During this time he made relatively few violins, leading to some speculation that he may possibly have worked in some other trade or been involved in making other types of instruments. Despite the relatively few Stradivari violins from this period, the “Hellier” violin of 1679 demonstrates that Stradivari was not only an exceptional craftsman but also that his design and drafting skills were far better than any other violin maker of the time. As the 1680s progressed, Stradivari’s violins took on a more robust character both physically and tonally. While he continued to use the same fundamental Amati system of making, he developed a personal violin model which can be seen in the “Auer” of 1690. After 1690, Stradivari set off on a new course, developing a slightly longer form for the violin body that he continued using until nearly the turn of the 18th century. While both Amati and Stradivari, in his early period, used a warm, golden-colored varnish of various shades on their instruments, it was also during this period that Stradivari developed a varnish with a deeper reddish-orange color that would become his standard. At the onset of the 18th century, Stradivari reached what is referred to as his Golden Period, which lasted well into the 1720s. During this time he developed and perfected unique models and forms that would become the standard for violin makers of the future, using a broad and flat arching and giving a squarer appearance to the center bouts. He consistently used the choicest maple during this period and a brilliant reddish-orange varnish of incomparable quality. Stradivari’s sons, Francesco (1671-1743) and Omobono (1679-1742), were active in their father’s shop by 1700 and contributed to the master’s prodigious output of violins, violas, and cellos. Though one sees the occasional hint of their work on the violins that their father made during his Golden Period, apparently it was their lot to do the rougher beginning work and attend to the many other functions of an 18th-century violin making shop. In the later 1720s and into the 1730s, the work of the sons is more obvious on some of Antonio’s instruments, and there were a few instruments (such as the ‘Rawlins’) with special labels indicating that they were made by others under Stradivari’s direction. Stradivari continued to make outstanding instruments in the later 1720s until his death in 1737. The late instruments, though not quite so accurately finished as the earlier examples, are remarkable instruments by any standard. Many of the great soloists have chosen late Stradivari violins for their noble and powerful tone. Giuseppe Guarneri del Gesù The Guarneri dynasty began with Andrea Guarneri (c 1624-1698), who entered the Amati household as an apprentice in the 1640s and left the shop in the next decade to found his own business. Andrea’s elder son, Pietro (1655-1720), established himself in Mantua, leaving the younger son, Giuseppe (1666-1740), to take over the shop from his father. It was Giuseppe Guarneri’s son, named Bartolomeo Giuseppe Guarneri (1698-1744), who was to become known by the appellation Joseph Guarnerius del Gesù and achieve true greatness for the family. Shop apprentices of the time started working as young as the age of eleven, so we can assume that the young Giuseppe Guarneri was steadily learning the family craft during the second decade of the 18th century, although the instruments made during that period are labeled by his father. During the 1720s, a type of instrument appears from the Guarneri shop that is considerably advanced over the previous instruments, both tonally and visually. One sees the more forceful hand of Guarneri del Gesù at least in part and sometimes wholly during this time. About 1731, Guarneri del Gesù established his own shop and began labeling instruments with his own name. It is during this decade that he perfected the handsome and distinctive model that is truly an original and entirely comparable alternative to the forms used by Antonio Stradivari. The violins made during this period are exceedingly handsome. Toward the end of the 1730s, the violins take on a more rugged character and slightly rougher finish. In the 1740s, the maker’s final period, he took his concept to its ultimate extension. In the last few years of Guarneri del Gesù‘s life, he made a series of instruments that have no rival for sheer originality and forceful execution, both visually and tonally. There are scarcely more than twenty-five violins still in existence from the early period of Guarneri del Gesù‘s work. From 1731 until Guarneri’s death in 1744 there are approximately 110 surviving instruments, bringing the total to about 135 (all violins except for one cello). By comparison, there are approximately six hundred and fifty surviving Stradivari instruments including mostly violins, fifty cellos, about a dozen violas, three guitars, and a few other types of instruments. Stradivari lived nearly twice as long as Guarneri del Gesù. Virtually all of the makers who were trained in the Cremonese school between 1550 and 1750 made instruments of high merit. There was a system of design, construction, and varnishing passed from one generation to the next that was fundamentally superior to the other schools of violin making and virtually guaranteed a successful result. Most experts believe that the varnish makes a unique contribution to an instrument’s tone. The varnish formula used during the great period of Cremonese violin making disappeared in the middle of the 18th century and has never been completely reproduced, despite claims made in various quarters. While Stradivari and Guarneri del Gesù were not the only makers of the period who had access to the varnish formula, they rose above their contemporaries by reason of a superior conception and model that would produce the responsiveness, volume, and quality of tone to accommodate musical performance for the next several centuries. Stradivari and Guarneri del Gesù were certainly products of a long tradition, but each was endowed with the spark of genius that elevated his violins to works of art, masterpieces that have become a vital component of Western musical performance at the highest level."
}