{
  "url": "https://en.wikipedia.org/wiki/Levada_(Madeira)",
  "title": "Levada (Madeira) - Wikipedia",
  "text": "Levada (Madeira) A levada is an irrigation channel or aqueduct specific to the Portuguese Atlantic region of Madeira. Madeira island is wet in the northwest, but dry in the southeast. In the 16th century the Portuguese started building levadas (aqueducts) to carry water to the agricultural regions in the south. Due to the island's mountainous landscape, building levadas promised to be a difficult venture, often tasked to criminals and convicts from continental Portugal.[1] Many are cut into the mountainsides, accompanied by 40 km (25 mi) of tunnels, some of which are still accessible. Today levadas supply water and also provide hydro-electric power.[2] Over 2,170 km (1,350 mi) of levadas were built and later provided a network of walking paths. Paths can provide easy and relaxing walks through the countryside, while others are narrow, crumbling ledges where a slip could result in injury or death. Some improvements have been made to these pathways following the 2010 Madeira floods and mudslides.[3] Such improvements involved the continuous maintenance of streams, paving trails, and establishing safety fences on dangerous stretches.[4] History [edit]In Madeira, the levadas originated out of the necessity to bring large amounts of water from the west and northwest of the island to the drier southeast, which is more conductive to habitation and agriculture, such as sugar cane production. They were also used by women in the past to wash clothes in areas where running water was not available at homes. Similar examples can still be found in Iberia, such as some aqueducts in Spain.[citation needed] In the sixteenth century the Portuguese used slave labor to build the first levadas to carry water to the agricultural regions. The island's first levadas, funded by wealthy Genoese backers, were to transport water to cultivate a cash crop: sugar cane. Canary Island and African slaves played an integral role in Madeira's thriving sugar cane industry. [5] The most recent were made in the 1940s. Madeira is very mountainous, and building the levadas was often difficult. Many are cut into the sides of mountains, and it was also necessary to dig 25 kilometres (16 mi) of tunnels.[citation needed] Levadas today [edit]Today the levadas not only supply water to the southern parts of the island, they also provide hydroelectric power. There are more than 2,170 kilometres (1,350 mi) of levadas and they provide a remarkable network of walking paths. Some provide easy and relaxing walks through beautiful countryside, but others are narrow, crumbling ledges where a slip could result in serious injury or death.[citation needed] A popular levada to hike is the Levada do Caldeirão Verde which continues as the Levada Caldeirão do Inferno. Altogether it is about 37 km (23 mi) long. Along both parts there are long sections which may cause hikers to suffer vertigo; and several tunnels for which flashlights and helmets are essential. The Levada do Caniçal is a much easier walk. This levada runs 11.5 km (7+1⁄8 mi) from Maroços to the Caniçal Tunnel. It is known as the mimosa levada because acacias (commonly misnamed mimosas) are found all along the route.[6] Gallery [edit]- Levada do Rei, PR 10, near trailhead - Hiker on the path of a levada See also [edit]References [edit]- ^ Hancock, Matthew (13 November 2000). \"Madeira: Walking a heavenly tightrope\". Telegraph Travel. Telegraph Media Group. Archived from the original on 20 May 2018. Retrieved 20 May 2018. - ^ Centre, UNESCO World Heritage. \"Levadas of Madeira Island – UNESCO World Heritage Centre\". UNESCO. Archived from the original on 20 October 2017. Retrieved 19 October 2017. - ^ Secção Regional da Madeira, Tribunal de Contas (5 February 2011). \"Relatório n.º 6/2011-FC/SRMTC\" (PDF). tcontas.pt/index.shtm. Archived from the original (PDF) on 6 April 2019. Retrieved 6 April 2019. - ^ APCA, Aprender Madeira. \"Políticas Ecológicas\". Aprender Madeira. Archived from the original on 6 April 2019. Retrieved 6 April 2019. - ^ https://www.bbc.com/travel/article/20240123-the-dark-history-behind-madeiras-famous-levadas - ^ J. and P. Underwood, Landscapes of Madeira (Sunflower Books) is the most widely used guide to the levadas. It provides detailed instructions and maps covering 42 levadas and other walks."
}