{
  "url": "https://www.webstaurantstore.com/blog/2318/what-is-charcuterie.html",
  "title": "What is Charcuterie & How to Make the Perfect Board",
  "text": "Why does everyone love charcuterie boards? Besides the artful presentation that photographs so well on social media, charcuterie brings together all your favorite finger foods in one place. What used to be called a fancy \"meat and cheese board\" is now a star of tapas menus. Charcuterie boards are no longer a passing foodservice trend and have become a culinary staple for gatherings, catered events, and restaurant menus. If you're still wondering how you should say this French term, it's pronounced shahr-KOO-tuh-ree. Learn a little bit more about the tradition of charcuterie or get started with making your own board. Charcuterie Definition When describing charcuterie, there's a traditional definition and a modern definition to consider. The traditional art of charcuterie was developed in 15th century France and involves preparing cured meats and meat products. A French chef who performs charcuterie-style cooking is called a charcutier (shar-KOO-tee-ay). Our modern definition of charcuterie has evolved to include more types of foods and styles of boards. The basic cheese board that you see at every holiday gathering has morphed into a culinary marvel by including more finger foods like cut fruits, olives, nuts, and dips. You can also find many charcuterie trends like dessert boards, breakfast boards, and even vegan boards. It turns out that you don't even need the board to make charcuterie! Place your ingredients in a jar (jarcuterie) or a paper cone, and now you have a portable, single-serve charcuterie option. How to Make a Charcuterie Board Watch our video to learn how to make your own charcuterie board: How to Make a Charcuterie Board for Beginners If you're just getting started with charcuterie, we've created a simple guide to inspire you. The common elements of a cheeseboard are meats and cheeses, but there are no rules when it comes to charcuterie. Play around with your favorite ingredients and themes. Before serving your board, take a picture of it for future reference. It will come in handy the next time you want to build a charcuterie board. Choose Your Board There are so many shapes and styles of charcuterie boards that it can be a little overwhelming. Check out our tips for choosing the right board: - Shape - Rectangular boards are easy to work with and their shape makes a great canvas for laying out ingredients. Round boards are the next most popular shape, but they're a little more challenging when it comes to your portions. Once you've mastered a rectangular or round board, try experimenting with different shapes. - Size - For a standard-size board that feeds 4 to 6 guests, go with something around 8\" x 12\" or 9\" x 13\". A larger board with a length over 18\" or 20\" is suitable for a crowd. - Material - Melamine breadboards are a convenient option because they are more lightweight than slate or wood boards, but they provide the same rustic look. Large boards with many ingredients tend to become very heavy. Break-resistant melamine is also safe for your patio or outdoor dining space. Note: The charcuterie board recipe shown below was created by Ronne Day, the WebstaurantStore food stylist. To recreate this charcuterie board, use a 12\" by 24\" slate board. 1. Charcuterie Cheeses Everyone knows cheese is the main event! Begin by adding your cheeses and spacing them out evenly across the board. Shown here: Stilton, Manchego, Mimolette, herbed goat cheese, Saint-Andre cheese, Parmigiano Reggiano For smaller boards, stick with two types of cheese you know your guests will enjoy. If you want to go larger, increase the number to 4 or 6 kinds of cheese. When adding a unique or offbeat cheese, use it sparingly because it's probably more expensive and won't be as popular with all your guests. We recommend adding cheeses from these categories: - Soft cheese - Start with 8 ounces of soft cheese, like brie, chevre, or camembert. - Semi-firm cheese or hard cheese - Add 8 ounces of medium-firm and/or aged cheese like cheddar, gouda, or manchego. - Unique cheese - For your third cheese, add 4 to 6 ounces of something unexpected, like blue cheese or Mimolette (an aged cow's milk cheese from France). Please note: For ease of serving, pre-slice all the cheeses before putting them on the board. If you are serving a very soft cheese, such as chevre, you can set it on a small dish or a piece of parchment with a cheese knife, which helps to maintain the appeal of your board. 2. Charcuterie Board Meats The next step is to add charcuterie meats to your board. You can start to fill in some of the space between the cheeses. Shown here: Soppressata, hard salami, speck, prosciutto Think you’d like your board to be quick and classic? Go for popular meat options like salami and prosciutto. Expanding your horizons? Try some less typical selections like guanciale, coppa, or lardo. Try using charcuterie meats from these categories: - Dry-Cured Salami - Add 4 to 6 ounces of thinly sliced peppered salami, soppressata, or cinghiale. - Cured Ham - Add 2 to 4 ounces of thinly sliced cured ham like prosciutto or Italian speck. These meats usually come pre-sliced, but if you order from a charcuterie counter you can have it sliced to your desired thickness. - Pate or Mousse - For a traditional charcuterie board, add 6 to 8 ounces of country pate or mousse. Pate has a firm texture and can be placed directly on the board. Mousse has a smooth texture and should be served in a dish or ramekin to keep the board clean. Please note: If you choose a fatty meat, keep the board clean by placing a small piece of parchment beneath the slices. 3. Charcuterie Fruits Fruit adds color to your board and provides a flavor contrast to your meats and cheeses. Continue to fill in the spaces of your board with a variety of vibrant fruits. Shown here: Figs, plum, green and red grapes, strawberries, kumquats, pear, mini kiwis, dried apricots For a small board, a cluster of grapes and some sliced apple or pear should be sufficient. If you want to build a large board like ours, choose a fruit from each category below: - Grapes - Grapes are one of the best charcuterie fruits for easy grazing. If they're in season, try Champagne grapes because they look especially elegant on a charcuterie board. Cut the grape bunches into small clusters and arrange them on top of one another. - Apples and Pears - You can't go wrong with these cheeseboard-friendly fruits. After slicing but before serving, soak the apples or pears in lemon juice. Gently pat them dry before placing them on the board. The lemon juice prevents discoloration and adds a little extra citrus zing, which helps cut the richness of the cheese. - Berries - Stick to halved strawberries, whole blackberries, or large blueberries. Raspberries tend to be very soft and small blueberries can roll off the board. If you have your heart set on raspberries or small blueberries, place them in a small dish. - Fresh Figs - If they're in season, halve or quarter a few fresh figs for your board. They're not only beautiful, but they also pair well with cheese and charcuterie meats. - Dried fruit - Dried apricots, cherries, and dates are popular choices if you choose to add dried fruit to your board. You can also try some of the more unusual dried fruits like kiwis or mango. 4. Charcuterie Crackers Crackers and bread options are an important part of your charcuterie board! Guests can layer their favorite foods on top of a cracker for a combination of delicious flavors and textures. Start filling in some of the remaining space with your cracker options. Shown here: gluten-free crisps, jalapeno cheese crisps, raisin pecan crackers, pineapple basil crackers, grilled baguette (in basket) For a small, basic board, choose a sliced baguette and water crackers. If you're entertaining a larger crowd, pick one or more options from each category below: - Baguette - It’s never a bad idea to have some thinly sliced baguette in a basket next to your board. Some guests like to build a little crostino (Italian appetizer) with the choices you’ve provided. Warm the baguette whole and slice it before serving. Or drizzle the slices with olive oil and quickly grill them for a summertime crowd-pleaser. - Crackers - Pick one mild cracker that doesn't overpower the other flavors on the board, like a water cracker. Then choose one adventurous option, like a rye or seeded cracker. If you opt for three types of crackers, choose a variety of flavors and textures. - Grissini - Grissini are a type of thin breadstick with a crisp texture. Their pencil-like shape adds more visual interest to your charcuterie board. - Cookies - If you have the room, add a crumbly shortbread cookie or chocolate-dipped biscotti for a sweet option that pairs well with your other elements. Sweet and savory is a popular flavor combination! 5. Charcuterie Board Extras Now it's time to complete your board with extra elements that add visual interest and unique flavors. Fill in the last open spaces with your favorite finger foods, dips, and spreads. Shown here: radishes, rainbow carrot sticks, mixed olives, fresh thyme and rosemary, golden cherry tomatoes on the vine, raspberry preserves, white anchovies, honeycomb, Marcona almonds, candied pecans There are many interesting and creative ways to round out your cheeseboard. Here are a few of our favorites: - Jams or Preserves - Fruit preserves provide a sweet contrast to meats and cheeses. - Fresh Herbs - Add sprigs of rosemary or thyme to your board. - Edible Flowers - Try placing blooms of edible flowers throughout your board. - Nuts and Seeds - Arrangement depends on the type of nut. Large nuts, like whole pecans, can be placed directly on the board. Addia small dish for nuts like peanuts. - Olives - Olives are a popular choice for charcuterie boards thanks to their briny flavor. Serve pitted olives for convenience. - Smoked Shellfish - For an adventurous option, add a small ramekin of smoked clams, oysters, or mussels. - Anchovies - Try adding white anchovies, which are a mild, slightly sweet version of the tiny fish. - Tapenade - This spread, which is a savory combo of olives, capers, and anchovies, can be served right out of the jar or added to a ramekin. 4 Styles of Charcuterie Boards There are a few different approaches you can take while developing a concept for your charcuterie board. You can go with a regional approach and include items that all hail from the same country or town (i.e. you could make an entire board based on the flavors of Alsace, France, or Bologna, Italy). Or you can take a more freestyle approach and think about how your favorite flavors and textures would translate onto one board. Here are a few examples of the latter option, to spark your creativity. 1. Pickles and Spreads Pickled foods provide a tangy contrast to sweet, smokey meats and cheese. There are many types of pickles and pickled vegetables to choose from, like pickled cauliflower, sweet gherkins, or pickled red onion. 2. Cheese and Fruit Pairing the right cheese and fruit provides a flavorful contrast of taste and textures. Some classic fruit and cheese combinations are grapes with cheddar, pears with gouda, or cherries with brie. 3. Fresh Veggie and Citrus Think crunchy fennel and blood orange slices. The bright, fresh flavors of produce balance out heavier, fattier meats like salami. 4. Toasted Bread and Meat Slices of toasted bread provide a delicious vehicle for topping with meats, cheeses, and dips. Classic charcuterie items like prosciutto and fig jam pair perfectly with a toasted baguette. Charcuterie FAQ We answer some common charcuterie questions below: Do I Need Cheese on My Charcuterie Board? Technically, you can make a charcuterie board with your favorite ingredients, and if that doesn't include cheese, leave it out! Your dairy-free and lactose-intolerant guests will appreciate it. But, if you have no dietary restrictions to consider, including cheese will add a range of pleasing textures and flavors to your board. See our tips for choosing the right cheese above. What Size Charcuterie Board Do I Need for 20 Guests? For grazing, a crowd of 20 guests will usually be satisfied with a large charcuterie board that measures over 20\" in length. What Is the Correct Pronunciation of Charcuterie? Here in the US, charcuterie is pronounced shar-KOO-tuh-ree. The French pronunciation is shar-koo-TREE. What Does Charcuterie Mean in French? In the French language, charcuterie means \"pork-butcher-shop\". What Is a Cheese Board? A cheese board is an appetizer platter that features cut meats and cheeses. Before charcuterie took the culinary world by storm, we had the humble cheese board! When it comes to making a charcuterie board, there's no right or wrong way. Instead, focus on creating flavor combinations and providing your guests with a memorable dining experience. Knowledge of the types of ingredients used on a standard charcuterie board can help you break the rules effectively. Soon you'll grow more comfortable with the craft of developing a delicious, cohesive board for your restaurant, bar, or cocktail party."
}