{
  "url": "https://techcrunch.com/2025/09/03/brand-new-unicorn-iqm-sets-its-sights-beyond-europe-for-its-quantum-computers/",
  "title": "Brand new unicorn IQM sets its sights beyond Europe for its quantum computers | TechCrunch",
  "text": "Finnish quantum computing startup IQM is now a unicorn: The company just raised more than $300 million in a Series B funding round that was led by Ten Eleven Ventures, a U.S. investment firm focused on cybersecurity. A university spinout, IQM builds quantum computers meant for on-premises installations as well as a cloud platform that taps this hardware. The company has already sold its quantum computers to enterprises in APAC and the U.S., but its strongest market remains Europe. That’s what this round is intended to change: The startup is planning to use the fresh cash for both a commercial push as well as R&D to align with the market’s evolving understanding of what’s needed to turn advances in quantum science into practical impact. To win U.S. clients in the face of competition from big tech companies like IBM, Google, and Microsoft, IQM knows it must accelerate its roadmap for both hardware and software. According to its co-CEO and co-founder Jan Goetz, this means investing more in the company’s chip fabrication facilities, as well as in software development and error correction research. Error correction, the ability to detect and fix errors inherent in quantum systems, is a hot topic right now, given that the very notion of what makes a quantum computer competitive is being redefined — being able to compute a large number of qubits is less of a holy grail today than it used to be. “It’s always a trade-off between number of qubits and quality and reliability,” Goetz said. Navigating this trade-off will be critical for developing real-world uses for quantum computing that have long been envisioned but weren’t prioritized. But now that quantum advances over traditional supercomputers no longer seem the stuff of sci-fi, companies like IQM are trying to make sure their computers will have practical applications sooner than later. Reliability aside, IQM’s roadmap aligns with the sector’s growing focus on the software layer that will be required to put quantum computing in the hands of its first end users: experts with PhDs in fields that are not quantum computing. TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately Save up to $300 on your pass or save up to 30% with group tickets for teams of four or more. TechCrunch Founder Summit: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately Save up to $300 on your pass or save up to 30% with group tickets for teams of four or more. An immediate software-related objective for IQM is to build a developer platform that, Goetz says, is akin to “an SDK for quantum computing,” with the goal to “bring in as many developers as possible to start working on our machines.” As an alternative to IBM’s approach, this platform will rely on Qrisp, an open source project by Berlin-based research institute FOKUS. Second to its headquarters in Finland, Germany is where most of IQM’s 300 staffers are located, with a large R&D unit working out of Munich, Goetz said. “But with this round, we want to grow the team and create more commercial traction, especially in the U.S.” In the future, the company is considering becoming “a bit more operational in the U.S.,” said Goetz, adding that tariffs could play a role in this decision. “One thing that we are considering is that if we sell more systems in the U.S., we could do local assembly.” But IQM will remain focused on sales in the U.S. for the time being. The company recently sold an on-premise quantum computer to the Oak Ridge National Laboratory, a science lab run by the U.S. Department of Energy. According to Ten Eleven Ventures’ co-founder and managing general partner, Alex Doll, there’s a strong overlap between the investment firm’s thesis and IQM’s focus. “Quantum computing will be a pivotal pillar in the next era of cybersecurity and computational innovation,” said Doll, who is also joining IQM’s board as part of the fundraise. The fact that Ten Eleven Ventures has a strong network in the U.S. made it a strong fit for the startup, Goetz said. The Series B also saw investment from Finnish investment firm Tesi, as well as Schwarz Group, Winbond Electronics Corporation, EIC, Bayern Kapital, and World Fund. Per IQM, this new round brings its total funding to date to $600 million. Goetz feels the size of the round was justified by the commercial and technical milestones that the startup hit in the last few months. “We are now the company that has sold the most quantum computers globally, in all major continents,” he said. In absolute numbers, that’s still small — in late 2024, the company hit a production milestone of 30 quantum computers. That only serves to remind that the sector still has a long way to go before it reaches a wider audience. Still, IQM’s 54-qubit chips are already in use at computing centers, research labs, universities, and enterprises, and Goetz said that the company is now on track to deploying the first 150-qubit systems — a fact that seems to matter much more to him than IQM becoming a unicorn."
}