{
  "url": "https://www.reddit.com/r/amazonprime/comments/197rgdm/tip_to_download_amazon_orderreturn_information/",
  "title": "Reddit - The heart of the internet",
  "text": "Tip To Download Amazon Order/Return Information, Chat History, etc. Ever since Amazon got rid of order report functionality last year, I’ve been trying to find an easy way to export my order history. As it turns out, Amazon actually still offers a way to do this using their “Request My Data” tool, though it’s buried deep within their help pages. Here’s the direct link to access: https://www.amazon.com/hz/privacy-central/data-requests/preview.html There actually a number of different data sets you can download, most notably: - Your Orders - Search History - Advertising - Amazon Photos and Drive - Prime Video - Customer Support Communication Unfortunately, the process to access the data requires a few steps – you submit a request, then have to confirm it by clicking a link sent to your email. You will then receive a link a few hours later to download the requested data. I’ve only tried requesting order information thus far, but am pleasantly surprised with the robustness of the data. Here's a link to a high level summary I put together showing the full set of reports and fields Amazon provides when you request your order data There are obviously a ton of things you can look at in this data, though wanted to highlight a few based on common questions I see on this subreddit - Returns Tracking – a lot of folks have reported issues with not knowing the tracking numbers for returns (e.g., if they are dropped off at UPS via QR code). The “Return Requests” file lists the tracking number for all returns you’ve requested - Return Reimbursement – the return reports also provide a comprehensive list of refunds from Amazon. You should be able to compare this information to your return requests to make sure that there aren’t any items that you sent back but haven’t been refunded for (I’ve already identified a few in my data!) - Prime Subscription Tracking – transactions related to your Prime subscription are in the “digital order” reports, which may be worth checking to ensure you aren’t being double charged for Prime, etc. Hopefully others find this as helpful as I did (and apologies if this was common knowledge already!)"
}