{
  "url": "https://en.wikipedia.org/wiki/Cedrus",
  "title": "Cedrus - Wikipedia",
  "text": "Cedrus Cedrus, with the common English name cedar, is a genus of coniferous trees in the plant family Pinaceae (subfamily Abietoideae). They are native to the mountains of the western Himalayas and the Mediterranean region at high altitudes. The trees grow tall with a cylindrical trunk and a wide leafy crown. The cones are erect; the leaves grow in tufts of 15–45 needle leaves, which can be bright green or blue-green with a waxy coat. When the cones are mature, they disintegrate to release the seeds, which are winged. Both pollen and seeds are wind-dispersed. Cedars are often planted as ornamental trees in parks and large gardens, while others are grown as bonsai. Cedar wood and cedarwood oil are naturally repellent to moths, and have an attractive, long-persistent scent. Etymology [edit]The generic name Cedrus derives from Old English ceder, from the Latin word cedrus. This in turn is derived from Greek κέδρος kédros, meaning cedar or juniper.[2] Species of both trees are native to the area where Greek language and culture originated, though as the word kédros does not seem to be derived from any of the languages of the Middle East, it has been suggested the word may originally have applied to Greek species of juniper and was later adopted for species now classified in the genus Cedrus because of their aromatic woods.[3] The name was similarly applied to citron: the word citrus is derived from the same root.[4] As a loan word in English, cedar had become fixed to its biblical sense of Cedrus by the time of its first recorded usage in 1000 CE.[5] Description [edit]Habit [edit]Cedars are tall resinous trees growing to 30–40 metres (100–130 ft) tall, rarely to 65 m (213 ft),[6] with a cylindrical trunk and a narrow to wide crown, conical when young but often becoming irregular with age. In some individuals, several main branches may eventually rival the main trunk in size.[7] The bark is pale grey-brown and smooth in young trees, dark grey-brown to blackish and splitting into ridges and scales on older trees.[7] Foliage [edit]The shoots are dimorphic, made up of long thin leading shoots from terminal buds, each one accompanied by multiple short lateral shoots.[7] The leaves are evergreen and needle-like, 8–60 millimetres (1⁄4–2+1⁄4 in) long, arranged in an open spiral phyllotaxis on long shoots and in dense spiral clusters of 15–45 together on short shoots; they vary from bright grass-green to dark green to strongly glaucous pale blue-green, depending on the thickness of the white wax layer which protects the leaves from drying out.[6] - Bark on a young deodar cedar - Bark on a mature Lebanon cedar - Foliage of Lebanon cedar, showing long shoots with widely spaced needles, and short shoots with densely packed needles Cones [edit]Cedars are monoecious, with separate male and female cones on the same tree.[7] The seed cones are barrel-shaped, 6–12 centimetres (2+1⁄4–4+3⁄4 in) long and 3–8 cm broad, green maturing grey-brown, and, as in Abies, disintegrate at maturity to release the winged seeds. The seeds are 10–15 mm (3⁄8–5⁄8 in) long, with a 20–30 mm wing; as in Abies, the seeds have two or three resin blisters, containing an unpleasant-tasting resin, thought to be a defence against squirrel predation. Cone maturation takes one year, with pollination in autumn and the seeds maturing at the same time a year later. The pollen cones are slender ovoid, 3–8 cm long, produced in late summer, and shed pollen in autumn.[6][8] - Female (seed) cones of Lebanon cedar - Immature male (pollen) cone of Lebanon cedar - Pollen cone of deodar cedar, shedding pollen in the wind Evolution [edit]Fossil history [edit]The oldest fossil of Cedrus is Cedrus penzhinaensis known from fossil wood found in Early Cretaceous (Albian) sediments of Kamchatka, Russia.[9] An Early Miocene species, Cedrus anatolica, also from petrified wood and thought to be close to C. atlantica, is known from Turkey.[10] Phylogeny [edit]Cedars have a similar cone structure to firs (Abies) and were traditionally thought to be most closely related to them, but genetic evidence supports a basal position in the whole of the subfamily Abietoideae.[11][12][13] Taxonomy and internal phylogeny [edit]The genus Cedrus was described by the German botanist Christoph Jacob Trew in his Plantae Selectae Quarum Imagines in 1757.[7] The Cedrus taxa are assigned according to taxonomic opinion to between one and four species.[7][14][15][16] The deodar cedar is sister to the Mediterranean cedars. The Cyprus cedar for example is variously considered to be a variety or subspecies of Cedrus libani, or a species C. brevifolia in its own right;[17] some evidence from allozymes suggests it may even be embedded within the range of variation in the Turkish cedar.[18] Divergence ages are marked on the cladogram.[16][19][20] The species cannot hybridise in nature due to their geographical separation, but when brought together in cultivation, they do so freely. However, because cedars (particularly between the Mediterranean taxa) are so similar to each other, hybrids are notoriously to detect and identify. Hybrids between Atlas and Deodar cedars have been deliberately bred by the Tesi nursery in northern Italy since the 1980s, and were named in 2021 as the cultivar group Cedrus Tesi Group.[21][22] Distribution and ecology [edit]Cedars are adapted to mountainous climates; in the Mediterranean, they receive winter precipitation, mainly as snow, and summer drought, while in the western Himalaya, they receive primarily summer monsoon rainfall and occasional winter snowfall.[6] They are native to the mountains of the western Himalayas and the Mediterranean region, occurring at altitudes of 1,500–3,200 m (4,900–10,500 ft) in the Himalayas and 1,000–2,200 m (3,300–7,200 ft) in the Mediterranean.[6] In Lebanon, a small number of cedars of Lebanon survive in protected areas including the Cedars of God near the Qadisha Valley, a World Heritage Site.[23] Fungal diseases of cedars include canker; collar, crown, and root rot; needle blight; Gymnosporangium rusts;[24] and sirococcus blight, caused by Sirococcus tsugae, which kills shoots and branches.[25] Cedar trees are robust but become vulnerable to bark beetles in drought conditions.[24] Other pests include the giant conifer aphid, scale insects, and nematodes such as the pine wilt nematode.[24] Caterpillars of the pine processionary moth sometimes make their nests in cedars.[26] Uses [edit]Cedars have long been highly valued for their scented, durable, and decay-resistant wood, being in demand for building temples and palaces for over 4,000 years from the period of the Epic of Gilgamesh onwards, the longest record of any conifer in human use.[7] Cultivation of cedars for their wood has an equally long history, with recent genetic and environment studies corroborating local oral mythology and Hittite cuneiform text records that two small geographically isolated populations of Lebanon cedar in northern Anatolia 500 km north of its main native area are of human origin, deliberately planted over 3,200 years ago for cedar wood supply to the nearby capital of the Hittite Empire at Hattusa.[27] Cedars are popular ornamental trees and are often cultivated in temperate climates where winter temperatures do not fall below −25 °C. The Turkish cedar is slightly hardier, to −30 °C or just below. Extensive mortality of planted specimens can occur in severe winters when temperatures fall lower.[28] Cedars are suitable for training as bonsai in varied styles.[29] Cedar wood and cedarwood oil are naturally repellent to moths.[30] - Formally planted ornamental cedars at Chiswick House, London. - Glaucous Atlas cedar trained as a bonsai - Cedar wood has a strong sweet spicy-resinous scent, and a distinctive colour and grain. - Freshly cut cedar wood has yellowish sapwood and orange-brown heartwood, and exudes strongly scented resin. - Cedar wood panel from the reign of Thutmose IV, circa 1400-1391 B.C. See also [edit]References [edit]- ^ \"Cedrus\". International Plant Names Index. Retrieved 2025-12-10. - ^ \"cedar (n.)\". Online Etymology Dictionary. Retrieved 23 September 2025. - ^ Meiggs, R. (1982). \"The Cedars of Lebanon\". Trees and Timber in the Ancient Mediterranean World. pp. 49–87. - ^ Andrews, A. C. (1961). \"Acclimatization of citrus fruits in the Mediterranean region\". Agricultural History (35): 35–46. - ^ \"Cedar\". Oxford English Dictionary. Retrieved 23 September 2025. - ^ a b c d e Farjon, Aljos (1990). \"Cedrus\". Pinaceae: Drawings and Descriptions of the Genera. Koeltz Scientific Books. pp. 111–121. ISBN 3-87429-298-3. - ^ a b c d e f g \"Cedrus: Trew 1757\". The Gymnosperm Database. Retrieved 24 September 2025. - ^ Frankis, M.; Lauria, F. (1994). \"The maturation and dispersal of cedar cones and seeds\". International Dendrology Society Yearbook 1993. pp. 43–46. - ^ Blokhina, N. I.; Afonin, M. (2007). \"Fossil wood Cedrus penzhinaensis sp. nov. (Pinaceae) from the Lower Cretaceous of north-western Kamchatka (Russia)\" (PDF). Acta Paleobotanica. 47: 379–389. S2CID 54653621. - ^ Akkemik, Ünal (2021). \"A new fossil Cedrus species from the early Miocene of northwestern Turkey and its possible affinities\". Palaeoworld. 30 (4): 746–756. doi:10.1016/j.palwor.2020.12.003. - ^ Ran, Jin-Hua; Shen, Ting-Ting; Wu, Hui; Gong, Xun; Wang, Xiao-Quan (2018). \"Phylogeny and evolutionary history of Pinaceae updated by transcriptomic analysis\". Molecular Phylogenetics and Evolution. 129: 106–116. doi:10.1016/j.ympev.2018.08.011. Retrieved 2025-11-12. - ^ Gernandt, David S.; Magallón, Susana; Geada López, Gretel; Zerón Flores, Omar; Willyard, Ann; Liston, Aaron (2008). \"Use of Simultaneous Analyses to Guide Fossil‐Based Calibrations of Pinaceae Phylogeny\" (PDF). International Journal of Plant Sciences. 169 (8): 1086–1099. doi:10.1086/590472. ISSN 1058-5893. Retrieved 2025-11-12. - ^ Stull, Gregory W.; Qu, Xiao-Jian; Parins-Fukuchi, Caroline; Yang, Ying-Ying; Yang, Jun-Bo; et al. (19 July 2021). \"Gene duplications and phylogenomic conflict underlie major pulses of phenotypic evolution in gymnosperms\". Nature Plants. 7 (8): 1015–1025. Bibcode:2021NatPl...7.1015S. doi:10.1038/s41477-021-00964-4. PMID 34282286. S2CID 236141481. - ^ \"Cedrus\". NCBI Taxonomy Browser. - ^ \"Cedrus\". Flora of China. - ^ a b Qiao, C.-Y.; Ran, Jin-Hua; Li, Yan; Wang, Xiao-Quan (2007). \"Phylogeny and Biogeography of Cedrus (Pinaceae) Inferred from Sequences of Seven Paternal Chloroplast and Maternal Mitochondrial DNA Regions\" (PDF). Annals of Botany. 100 (3): 573–580. doi:10.1093/aob/mcm134. PMC 2533594. PMID 17611189. - ^ \"Cedrus libani var. brevifolia Hook.f.\" Plants of the World Online. Royal Botanic Gardens, Kew. Retrieved 27 August 2024. - ^ Scaltsoyiannes, A. (1999). \"Allozyme Differentiation and Phylogeny of Cedar Species\" (PDF). Silvae Genetica. 48 (2): 61–68. Retrieved 2025-11-12. - ^ Fady, B.; et al. (2003). \"Gene flow among different taxonomic units: evidence from nuclear and cytoplasmic markers in Cedrus plantation forests\" (PDF). Theoretical and Applied Genetics. 107 (6): 1132–1138. doi:10.1007/s00122-003-1323-z. PMID 14523524. - ^ Dagher-Kharrat, M. B.; et al. (2007). \"Geographical diversity and genetic relationships among Cedrus species estimated by AFLP\" (PDF). Tree Genetics & Genomes. 3 (3): 275–285. doi:10.1007/s11295-006-0065-x. - ^ Christian, Tom (2021). \"Cedrus Tesi Group\". International Dendrology Society Yearbook. 2020: 114–116. - ^ Christian, Tom (2025-11-11). \"Cedrus Tesi Group\". Trees and Shrubs Online. Retrieved 2025-11-12. - ^ Centre, UNESCO World Heritage. \"UNESCO World Heritage Committee Adds 30 Sites to World Heritage List\". UNESCO World Heritage Centre. Retrieved 2023-08-01. - ^ a b c \"How to Manage Pests: Cedar-Cedrus spp\". University of California Agriculture & Natural Resources. Retrieved 24 September 2025. - ^ \"Sirococcus tsugae\". Woodland Trust. Retrieved 24 September 2025. - ^ \"Pine processionary moth (Thaumetopoea pityocampa)\". Forest Research. Retrieved 24 September 2025. - ^ Özcan, Ali Uğur; Çiçek, Kerim (2023). \"How long do we think humans have been planting forests? A case study with Cedrus libani A.Rich\". New Forests. 54 (1): 49–65. doi:10.1007/s11056-021-09900-y. ISSN 0169-4286. Retrieved 2025-11-12. - ^ Ødum, S. (1985). \"Report on frost damage to trees in Denmark after the severe 1981/82 and 1984/85 winters\". Hørsholm Arboretum, Denmark. - ^ Walston, Brent. \"Cedars for Bonsai\". evergreengardenworks.com. Archived from the original on 29 May 2015. Retrieved 8 May 2015. - ^ Burfield, Tony (September 2002). \"Cedarwood Oils\". www.users.globalnet.co.uk. Retrieved 24 August 2016."
}