{
  "url": "https://www.yahoo.com/news/articles/mexico-agrees-more-predictable-water-031140280.html",
  "title": "Mexico agrees to make more predictable water deliveries to the US",
  "text": "Mexico agrees to make more predictable water deliveries to the US MEXICO CITY (AP) — Mexico and the United States said Tuesday that they had reached an agreement under which Mexico would send a minimum amount of water annually to the U.S. President Donald Trump had threatened to raise tariffs by 5% on Mexican imports if it did not deliver more water. The countries have been negotiating the issue for months. Under the new agreement, Mexico will send at least 350,000 acre-feet of water to the United States each year during the current five-year cycle. An acre-foot is the amount of water needed to cover 1 acre of land to a depth of 1 foot. Mexico’s commitment to a minimum annual delivery amount is a change from what is required under the 1944 Water Treaty. Under the existing treaty, Mexico must deliver 1.75 million acre-feet of water to the U.S. from six tributaries every five years. The average annual amount is 350,000 acre-feet, but the U.S. has complained that Mexico builds up a water debt in the first years of a cycle that hurts Texas farmers before eventually meeting the treaty requirement. The United States, in return, gives Mexico even more water from other water sources farther west along their shared border. The agreement reached between the governments would even out those deliveries from Mexico. Mexico’s Foreign Affairs, Environmental and Agriculture ministries confirmed an agreement with the U.S. in a statement Tuesday, but without including the agreed to amount. “Mexico confirmed its willingness to guarantee the delivery of an annual minimum quantity agreed to by both countries,” the statement said. While the U.S. government celebrated the agreement as a victory, it is a sensitive issue in Mexico, especially among farmers in northern states suffering drought conditions. In the border state of Tamaulipas, across from Texas, farmers have said in recent weeks that the lack of water has led some to not plant crops. The agreement followed a phone conversation last week between Trump and Mexican President Claudia Sheinbaum. In December, Sheinbaum had said Mexico would be sending more water to cover the existing debt."
}