{
  "url": "https://www.cbsnews.com/texas/news/how-to-apply-for-a-texas-education-freedom-account-school-choice-program/",
  "title": "How to apply for a Texas Education Freedom Account for school choice program - CBS Texas",
  "text": "How to apply for a Texas Education Freedom Account for school choice program Wednesday is a big day for education in Texas. Parents can start applying for a Texas Education Freedom Account to be used during the 2026-27 school year. Applications open for families to begin applying for TEFA at 9 a.m. CT. This is will be the nation's largest school choice program. The school choice program was created by Senate Bill 2, which passed in May 2025. It sets aside $1 billion of taxpayer money to help families pay for private school. Not every private school in the state is participating. According to the TEFA website, more than 1,400 private schools from Pre-K to high schools are involved in the program. Applicants should also know, participation in TEFA does not guarantee admission to a private school. Applicants still must go through that private school's admissions process, and they have the authority to accept or reject your student. One smaller private school in Argyle called Selwyn School said they're sitting it out this go around. \"I think there are too many unknowns,\" Head of School, Deborah Hof, said. \"That's the first conversation for me and the fact that we are an independent day school. To be independent, there is a certain understanding you're not taking from any other entity. Any student who came in with a voucher, I would have to report to the state their age, their sex, their ethnicity, and their zip code. I don't do that now for any of my students or my teachers. So it feels like I should wait and just see how this all shakes out.\" Who qualifies? Only U.S. citizens or legal residents can apply. Qualifying families will receive $10,474 per student for the school year to attend an approved private school. Students with disabilities who have an individualized education plan may receive up to $30,000 per year. Homeschool students may receive up to $2,000 per year. How it works This money can be used on tuition and education-related expenses like textbooks, uniforms, tutoring and meals provided by the school. It's important to note that if you are accepted into the program, funds will not be paid out all at once. Not every eligible child will be approved. A family's adjusted gross income will be used to determine prioritization. In case there are more applicants than funds, a lottery system will classify qualifications based on household income. For the 2026-27 school year, applicants will be prioritized as follows: - Children with a disability who are members of a household whose total annual income is at or below 500% of the Federal Poverty Level. - Children who are members of a household whose total annual income is at or below 200% of the Federal Poverty Level. - Children who are members of a household whose total annual income is between 200% and 500% of the Federal Poverty Level. - Children who are members of a household whose total annual income is at or above 500% of the Federal Poverty Level. Children who were enrolled in a Texas public school or charter school for at least 90% of the prior school year will be prioritized within this group. Funds for children in this category may not exceed 20% of the amount of money appropriated from the program fund for that school year. What you need to apply According to the Texas Comptroller's office, you can submit one application for your household, even if you are applying for multiple children. When applying, you'll need tax documents, social security numbers, proof of residency and, if applicable, your child's IEP. There's an information meeting scheduled in Dallas on Feb. 7 at the Shops at Redbird from 11 a.m. to 1 p.m. Applications close on March 17, 2026. Families will be notified in April."
}