{
  "url": "https://www.wikidex.net/wiki/Lista_de_movimientos_por_generación",
  "title": "Lista de movimientos por generación - WikiDex, la enciclopedia Pokémon",
  "text": "Lista de movimientos por generación Lista de movimientos que pueden aprender los Pokémon ordenados por generación. Hasta la tercera generación las clases físico y especial se clasificaban según el tipo. La única excepción a esta regla son los movimientos que, en su mayoría, no provocan daño directo al oponente clasificados en la clase de estado. Desde los videojuegos Pokémon Diamante y Pokémon Perla, en cambio, las categorías físico y especial es única para cada movimiento y ya no depende del tipo. Movimientos de la primera generación[editar código | editar] En la primera generación se agregaron 165 movimientos distribuidos de la siguiente manera: Movimientos de la segunda generación[editar código | editar] En la segunda generación se agregaron 86 movimientos distribuidos de la siguiente manera: Movimientos de la tercera generación[editar código | editar] En la tercera generación se agregaron 103 movimientos distribuidos de la siguiente manera: Movimientos de la cuarta generación[editar código | editar] En la cuarta generación se agregaron 113 movimientos distribuidos de la siguiente manera: Movimientos de la quinta generación[editar código | editar] En la quinta generación se agregaron 92 movimientos distribuidos de la siguiente manera: Movimientos de la sexta generación[editar código | editar] En la sexta generación se agregaron 62 movimientos distribuidos de la siguiente manera: Movimientos de la séptima generación[editar código | editar] En la séptima generación, además de los movimientos Z, se agregaron 68 movimientos distribuidos de la siguiente manera: Movimientos de la octava generación[editar código | editar] En la octava generación, además de los movimientos Dinamax y los movimientos Gigamax, se agregaron 89 movimientos distribuidos de la siguiente manera: Movimientos de la novena generación[editar código | editar] En la novena generación se han agregado 69 movimientos distribuidos de la siguiente manera: Véase también[editar código | editar] - Lista de movimientos de Pokémon GO - Lista de movimientos de Pokémon Masters EX - Lista de movimientos de Pokémon Quest Anotaciones[editar código | editar] - ↑ 1,0 1,1 1,2 1,3 Este movimiento era de tipo normal en la primera generación. - ↑ Maldición era de tipo (?) antes de la quinta generación. - ↑ 3,0 3,1 3,2 Este movimiento era de tipo normal antes de la sexta generación."
}