{
  "url": "https://www.royalcaribbean.com/california-cruises",
  "title": "Cruises from California | Royal Caribbean Cruises",
  "text": "Chart a course for adventure to the Mexican Riviera on sailings from San Diego and Los Angeles. Explore more of Southern California’s backyard on unforgettable adventures to Catalina Island. Or, stroll along world-famous coastlines in Cabo San Lucas before taking your tastebuds on a trip for some street food at the markets in Ensenada. These California coastal cruises from Los Angeles and San Diego can’t be beat. Cabo San Lucas is known for its ultimate luxury and once-in-a-lifetime views, making it a shining port city perched in the heart of the Mexican Riviera. Take a scenic boat tour to soak in the views of El Arco, a famous arch-shaped rock formation at Land’s End, or dive beneath the waves on a snorkeling adventure. Swim among the only living reef on Mexico’s Pacific Coast when you cruise from California to Cabo San Lucas. Wander through Ensenada’s colorful markets on your quest to savor the best Mexican food in the region when you cruise to Mexico from California. Ensenada is known for its locally caught seafood and tantalizing tequila. If you’re feeling particularly adventurous, venture down to La Bufadora blowhole. Immerse yourself in the dynamic spirit of Mexico’s costal community on your day ashore. Head 22 miles off the coast to Catalina Island on unforgettable California coast cruises. Catalina Island is known for having streets that stood as the backdrop of more than 600 movie film locations or use your time to get aquatinted with the island’s wild side. Take a Zipline tour across the island for unbeatable canyon and ocean views — or head off to the grazing grounds of Catalina’s world-famous bison. Mazatlán is known for being one of the most interesting resort towns on Mexico’s western coast. You’ll find it all here — stately plazas and shaded streets lined with restored landmarks in the city’s Centro Histórico. Beautiful white-sand beaches dotted with lively cafes and bars. Dive into Mazatlán’s unique history, which is filled with Spanish conquistadors, buccaneer battles, and delicious local dishes. There are so many different ways to cruise to Mexico from California. It doesn’t matter if you’re squeezing a getaway into a 4 day long weekend or if you’ve got weeks of PTO saved up for your ultimate vacation — there are cruises from California to Mexico for you. When it comes to exotic island sights, the southern Caribbean never disappoints. Discover some of its top-rated isles — like laid-back Aruba and Curaçao, culture-rich St. Maarten and spellbinding St. Lucia — on seven-night adventures from Barbados onboard Grandeur of the Seas®. Itinerary: • Bridgetown, Barbados • Cruising • Oranjestad, Aruba • Willemstad, Curacao • Cruising • Philipsburg, St. Marteen • Castries, St. Lucia • Bridgetown, Barbados All things action-packed. All in one epic place. Step onto the boldest cruises from California, where your getaway can last a weekend or a weeklong. Grab your travel buddy and experience the best dining, entertainment, and onboard activities at sea. Take on the boldest dares at sea, ripping the perfect swell on the 40-foot FlowRider® surf simulator. Go for a revved-up bumper car battle, or brave The Blaster®, the longest waterslide at sea. Then kick back Cali style in the Solarium, an adults-only paradise where the views rule and the vibes go unmatched. Sink your teeth into cuisine from around the world. Indulge in tantalizing specialties, like Tuscan favorites at Jamie’s Italian by Jamie Oliver or catch the lobster roll at Hooked Seafood℠ and go for fresh, hand-rolled sushi at Izumi Japanese Cuisine℠. Or savor authentic cuisine ashore, with fresh fish tacos and handmade tortillas on the menu. This is epic entertainment for the edge of your seat — and endless action to keep you out of it. It’s non-stop dance parties. Side-splitting comedy shows. And dazzling displays of talent. Turn up the heat when the sun goes down at The Lime and Coconut® pool bar — and hop from choreographed ice-skating spectaculars to spectacular Broadway-style shows. Set sail for the Mexican Riviera on the best California cruise ships. Cruise from Los Angeles on innovative ships like Ovation of the Seas®, Quantum of the Seas®, and Navigator of the Seas®. Only on Royal Caribbean®, voted Best Cruise Line Overall for 23 years running by Travel Weekly readers. If you’re ready to set sail on your big Baja adventure, there are a few tips you need to know before you head out. There’s no bad time to visit, but you’re likely to have the best weather if you plan your trip between December and April. If your vacation falls between May and November, you’re traveling during hurricane season when the weather can change at a moment’s notice. If you’re planning to sail to Mexico, you’ll need to have a valid passport in order to head ashore when you dock in Cabo San Lucas or Ensenada — and having a hearty appetite for authentic Mexican food, amazing eats and all-out adventure is a must, as well. There are tons of things to explore when you cruise to Mexico from California, so start planning your getaway today. 1 Navigating markets and connecting with locals is easier if you brush up on your Spanish before you set sail. 2 Lace up your walking shoes before you head to Catalina — there are no cars for tourists on the island. 3 Try snorkeling in Cabo San Lucas. It’s home to the only living coral reef on the Pacific side of Mexico."
}