{
  "url": "https://us.lorina.com/our-story/",
  "title": "Our story - Lorina",
  "text": "Our story THERE IS A STORY BEHIND EACH BUBBLE 1895 Victor Geyer’s exquisite libation to quench the most rebellious In 1895, Victor Geyer installed an uncanny laboratory in his tiny makeshift house in Munster, France. It is from this set up that Victor Geyer developed his exquisite libation by using heritage formulas kept secret by a small group of families in the Lorraine region. Victor Geyer made it a point to only craft his beverage using local ingredients, from the pure water coming out of the Vosges Spring next to his house to the beet sugar made in the village of Erstein. Add to that the best harvested lemons from the city of Grasse. This first beverage was only the beginning in a long line of masterfully crafted beverages. In a small notebook, the talented Artisan Limonadier would keep all the secrets of various recipes that he would pass on to his sons. The next generation of Geyer then used these recipes to create a gigantic collection of festive drinks. 1900 First deliveries and engraved glass bottles It is around 1900 that Mr Geyer introduced his engraved bottles topped by a mechanical top closing. This elegant closing was an innovation in preserving the carbonation level of beverages and for months Victor Geyer was the only one to adopt it for his beverages. The closing enable the few employees of the “Geyer Limonaderie” to Manufacture and bottle beverages then store them for the winter months. At the beginning of Spring, before the first heat waves, Victor Geyer’s rolling cart would make stops at all the local farms. 1929 Conquering the Youth’s Taste buds Kids from Lorraine used to have to hide to try to taste Mr. Geyer’s beverages in his Cellar. Now the beverages were made widely available to the public. Lorina could now be seen among the youth and adults celebrating in Village gatherings. The beverage that used to be mainly for hardworking farmers was now a delicious drink enjoyable year round in Dinners, parties, banquets & weddings. Victor Geyer’s sons also made sure to add new fruit flavors to satisfy the taste buds of its youngest fans. 1946 From Geyer Freres to Lorina, The birth of a brand. Post war, a Peaceful France gets back to work. Selling & bartering. Victor Geyer’s Grandson Auguste was a marine. He came up with the idea to name the Limonade :”Lorina” in honor of the Boat that helped saved thousands of british soldiers’ lives in 1940 Dunkirk’s beach battle. The name Lorina was perfect because it sounded similar to the “Lorraine” region and celebrated the heroes who sacrificed their lives to free Europe during WWII. Victor & Ernest were cautious at first with using the new brand name. Only putting it on the doors of their factory truck in a small blue print. Fairly quickly the name “Lorina” became more visible on labels. Traditions being sacred in Lorraine, to this day, the Mechanical top glass bottles are engraved with a drawing of Munster’s iconic village church. 1997 1997 : A Century later, Still bold and award winning. The workers at the Munster factory are still following Maitre Victor’s iconic original recipes. One can compare them to talented Jazzmen who are able to create and improvise a symphony of new flavors based on the masterpiece originally created by Victor Geyer. In 1997, Lorina won the award for the best beverage at the International Gourmet Tradeshow in New York. Lorina embodies A Century of Tradition, a splash of water and bubbles, natural flavors and a bold imagination. And tomorrow ? Groundbreaking since 1895. Lorina’s Artisan Limonadiers still thrive to create new flavors & beverages while staying close to the original values of the Limonaderie. Life is all about balance and so is the craftsmanship Artisan Limonadiers: precise maneuvers, an Artisanal know-how transmitted from one generation to the next , a few grams of sugar, Fresh lemons . These are the ingredients of creating an exquisite lemonade and capturing happiness in a bottle."
}