{
  "url": "https://www.yahoo.com/news/articles/elon-musk-calls-spain-pm-204100021.html",
  "title": "Elon Musk Calls Spain’s PM ‘Tyrant’ Over New Social Media Rule",
  "text": "Elon Musk Calls Spain’s PM ‘Tyrant’ Over New Social Media Rule - Spain’s Prime Minister Pedro Sanchez vows to hold tech companies responsible for harmful content on social media, calling the platform a “failed state” where laws are ignored and crimes are tolerated. Tesla CEO and X owner Elon Musk has protested against Spain’s proposal to ban social media use by teenagers. This comes as European countries change their policies around the growing technology. Spain’s Prime Minister, Pedro Sánchez, has vowed to protect children from the “digital wild west,” drawing criticism directly from Elon Musk. Elon Musk calls out Spain’s PM Spanish Prime Minister Pedro Sanchez has promised to protect children from the “digital wild west” and hold tech companies responsible for hateful and harmful content. On Tuesday, the Prime Minister said that urgent action was needed because social media was a “failed state where laws are ignored, and crimes are tolerated.” Sanchez also said Elon Musk’s platform amplified disinformation over his administration’s decision last week to regularize 500,000 asylum seekers and undocumented workers. He also pointed out that Musk himself was a migrant to the US (via The Guardian). The Tesla CEO hit back at the Prime Minister following this, accusing him of being a “tyrant.” He wrote on X, “Dirty Sánchez is a tyrant and a traitor to the people of Spain.” About an hour later, he further posted, “Sánchez is the true fascist totalitarian.” So far, no other social media platforms or their representatives have spoken out about Spain’s plan. According to a poll, about 82% of people in Spain said they believed children under 14 should be banned from social media platforms. Reports confirm that Greece is another country very close to implementing something similar. Britain and France already have a tougher stance on social media usage, and it seems that Spain and Greece are adopting similar policies. Australia has already banned access to social media for children under the age of 16. It seems that with other countries joining in, this may become a norm soon for many other countries across the world. Originally reported by Sourav Chakraborty on Mandatory. The post Elon Musk Calls Spain’s PM ‘Tyrant’ Over New Social Media Rule appeared first on Reality Tea."
}