{
  "url": "https://www.usmagazine.com/celebrity-news/news/dr-peter-attia-apologizes-after-epstein-files-family-icu-scandal/",
  "title": "Dr. Peter Attia Apologizes After Epstein Files, Family ICU Scandal | Us Weekly",
  "text": "Dr. Peter Attia issued a lengthy apology after newly-released files connected to the case against convicted pedophile Jeffrey Epstein claimed he chose to stay in New York City for a meeting with the sex trafficker while his wife and child were in the ICU. “I apologize and regret putting myself in a position where emails, some of them embarrassing, tasteless, and indefensible, are now public, and that is on me,” Attia, 52, wrote in a Monday, February 2, statement shared via X after allegedly sending the same message to his team and patients. “I accept that reality and the humiliation that comes with it.” Attia, a so-called longevity researcher, came under fire on Friday, January 30, after new emails allegedly sent between the late Epstein and influencers, including Attia, were released by the Department of Justice. (Epstein died by suicide in 2019 at the age of 66 while in jail awaiting trial on sex trafficking charges.) In one email dated July 12, 2017, Attia and Epstein allegedly engaged in a back and forth exchange to solidify plans to meet up the following morning. “Can you do before 10am? Tomorrow,” the email allegedly sent from Epstein read. Attia allegedly responded, “Sure. I can come earlier, also, if you have a hard stop at 10. Let me know.” While the exchange might not seem significant to most, Attia previously confessed to leaving his wife, Jill, and infant son to handle a health scare without him during that same timeframe. “Tuesday, July 11, 2017, at 5:45 p.m., to be exact — I had received a call from Jill, my wife,” Attia wrote in his book, Outlive: The Science and Art of Longevity, published in 2022. The physician recalled in his book that his wife called him from the back of an ambulance because their son had “suddenly stopped breathing” and had no heartbeat. The child was resuscitated through CPR by a nurse, but wasn’t out of the woods. “When Jill called me from the ambulance, I was in New York, in a taxi on Fifty-Fourth Street, on my way to dinner,” Peter wrote. “After she finished telling me the story, I just said, without a shred of emotion, ‘OK, call me when you get to the hospital, so I can talk to the doctors in the ICU.’” Eagle-eyed fans noticed that Jill called her husband one day before he allegedly emailed Epstein while in New York to cement their meeting. According to Attia’s book, he remained in New York “busy with my ‘important’ work” for 10 days after his son suffered cardiac arrest — and for the four days his wife and child were in the ICU in California. While Attia didn’t directly address the alleged connection between his 2017 trip to New York and leaving his wife and son alone, he did deny that he is an individual who “participated in criminal activity, enabled it, or witnessed it,” which Peter said is the “purpose” of the DOJ releasing the Epstein documents. “I am not in any of those categories, and there is no evidence to the contrary,” he claimed in his Monday statement. “To be clear: 1. I was not involved in any criminal activity. 2. My interactions with Epstein had nothing to do with his sexual abuse or exploitation of anyone. 3. I was never on his plane, never on his island, and never present at any sex parties.” In addition to seemingly abandoning his family to buddy up to Epstein in 2017, Attia’s name was mentioned more than 1,700 times in the latest set of released files. Attia attempted to explain his connection to Epstein in his statement, noting that they met in 2014 through a “prominent female healthcare leader while I was raising funds for scientific research.” Attia explained that between summer 2014 and spring 2019 he met with Epstein “on approximately seven or eight occasions at his New York City home, regarding research studies and to meet others he introduced me to.” He claimed he “never visited” Epstein’s ranch or island and “never” flew on any of his planes. “I was not his doctor, though several times I answered general medical questions and recommended other providers to him,” Attia alleged. He then cleared up one email exchange between him and Epstein that was reportedly sent in 2015 — and didn’t paint Attia in the best light. “In June 2015, I sent Epstein an email with the subject line ‘Got a fresh shipment,’” Attia recalled. “The email contained a photograph of bottles of metformin, a medication I had just received from the pharmacy for my own use. The subject line referred to the picture of the bottles of medication.” Epstein allegedly responded with the words “me too” and sent back a “photograph of an adult woman.” Attia confessed, “I responded with crude, tasteless banter,” admitting that it is now “very embarrassing,” to see how he engaged with Epstein. “I will not defend it. I’m ashamed of myself for everything about this. At the time, I understood this exchange as juvenile, not a reference to anything dark or harmful,” he added. Attia claimed that in 2018 he learned that Epstein’s 2008 conviction, which he allegedly characterized as “prostitution-related charges,” was “grossly minimized,” which is when he started to distance himself from the man. (Epstein was convicted in Florida in 2008 on a charge of soliciting prostitution from someone under 18.) “I was incredibly naïve to believe him. I mistook his social acceptance in the eyes of the credible people I saw him with for acceptability, and that was a serious error in my judgment,” Attia wrote. “To be clear, I never witnessed illegal behavior and never saw anyone who appeared underage in his presence.” He continued, “Nothing in this letter is meant to minimize the harm suffered by the young women Epstein abused. Their trauma is permanent.” Attia noted he was “not asking for a pass” from anyone, but claimed roughly 10 years after he sent the emails to Epstein — and being the man that he is today — he “would not write them and would not associate with Epstein at all.” “I recognize that my actions and words have consequences for the people I care deeply about, including all of you,” he concluded. “I regret the cost this has placed on you, and I take responsibility for it.” If you or someone you know has been sexually assaulted, contact the National Sexual Assault Hotline at 1-800-656-HOPE (4673). If you or someone you know is experiencing child abuse, call or text Child Help Hotline at 1-800-422-4453."
}