{
  "url": "https://health.clevelandclinic.org/organic-food",
  "title": "Organic Food: Is It Better for You?",
  "text": "Potential benefits include fewer pesticides and insecticides and more nutrients — but it all comes at an additional cost You’re strolling through your local farmers market or nearby grocery store checking items off your shopping list. You’re trying to eat healthier so you pick up fruits and vegetables, but as you reach for some tomatoes, you see there’s an “organic” option as well. Advertisement Cleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy Should you be eating organic foods instead of conventionally grown or raised foods? And what is organic food? The world of organic foods — produce, grains, meat, dairy and eggs — can be hard to understand. But we’re here to help wade through all the labels, regulations and options. Registered dietitian Maxine Smith, RD, LD, explains the pros and cons of eating organic foods and shares how to know if something is organic. Organic foods are foods that are grown and processed using government-regulated farming methods. Organic farming and foods use: “Organic food is not necessarily pesticide-free,” clarifies Smith. “Natural pesticides may be used in the production of organic foods.” You may also see the term “certified organic.” To be certified USDA (U.S. Department of Agriculture) Organic, farms and food producers must meet certain standards. Only products that contain at least 95% organic ingredients can be certified organic and display the USDA seal. Advertisement There are different certification levels of “organic.” These are: “Certified organic farms and food processors must be recertified every year,” says Smith. “Land can’t be certified organic until 36 months have passed since any prohibited substances were used on the land.” It can be confusing to walk down the produce aisle and tell what’s actually organic. Again, all foods labeled “USDA Organic” must meet standards set by the USDA. The USDA evaluates how food is grown, processed and handled. If a food meets these standards it may be labeled “USDA Organic.” And to make it even more unclear, small food producers who sell less than $5,000 per year may also call themselves organic if they meet these standards. However, they don’t have to go through the certification process (but also can’t label their food as “USDA Organic”). When it comes to meat, you may see some other labels: Advertisement No. The term “organic” refers to how food is processed in addition to the food itself. Currently, no formal definition for the use of “natural” on food labels has been issued by the USDA or the Food and Drug Administration (FDA). “Food manufacturers may use this term when food is free of synthetic preservatives and artificial sweeteners, additives, colors and flavors,” explains Smith. “Natural also can mean that meats are from livestock that weren’t given growth hormones or antibiotics and that produce wasn’t grown with pesticides or other synthetic crop enhancers.” The only government-regulated use of the term “natural” involves meat and poultry. Meat labeled “natural” may contain no artificial ingredient or added color and be only minimally processed. The label must explain the use of the term. But what if your food is “locally grown”? There’s no standard or regulation on what’s labeled “locally grown.” That bushel of strawberries could come from a farm down the street or a place more than 100 miles away. Is organic food better for you? “The health benefits that are linked to eating organic foods are increasing,” shares Smith. “However, it’s not certain that eating organic foods will make a difference in one’s health.” Advertisement So, what are the benefits of eating organic food? And are there any cons you should be aware of? When it comes to organic vs. nonorganic foods, organic foods offer: Advertisement And when it comes to the environment, organic foods have an upside. “Organic foods and organic farming are built on the principles of preserving soil and water quality and creating little or no effect on air quality,” highlights Smith. “Not using chemical or sewage as fertilizer reduces toxic runoff into rivers, lakes and ultimately into drinking water.” Additionally, animals are never given antibiotics or hormones and must have organic feed and safe, cage-free living conditions. Crop rotation, cover crops, dense planting and animal manures are methods used to provide nutrients to plants, as well as to control weeds and insects. The biggest downside to organic foods is higher production costs, which are passed on to consumers. That means that it costs more money to eat organic foods. If you want to buy organic foods but can’t afford to do so for all of your produce, the nonprofit Environmental Working Group reports the following fruits and vegetables have the highest and lowest pesticide levels when not purchased organic. It may be best to buy organic options for produce with the highest pesticide level. Highest pesticide levels: Lowest pesticide levels: “If you can’t afford to purchase organic produce, washing and scrubbing fresh fruits and vegetables under running water can help remove bacteria and chemicals from the surface of fruits and vegetables,” shares Smith. “Peeling fruits and vegetables can also remove surface pesticides, but this also reduces nutrients.” It’s a personal choice whether you want to buy and eat organic foods. Consider how much it may cost you, what you can afford and how important any potential health benefits may be. If you’re interested in organic foods, there are some ways you can reduce the costs. Try buying certain fruits and vegetables when they’re in season. You can also shop around at different grocery stores and farmers markets to see which has a better price. Look into joining a food co-op or a community-supported agriculture (CSA), both of which may offer lower prices for buying a membership or purchasing in bulk. “All fruits and vegetables and lean animal sources are your friend whether conventional or organic,” stresses Smith. “Don’t get stuck on organic or conventional food — most importantly foster your health by enjoying an array of these foods each day.” Learn more about our editorial process. Advertisement The tropical fruit is a good source of antioxidants and vitamin C High amounts of cholesterol and saturated fat in red meat may be linked to heart disease The leaves and pods from this tree are rich in essential nutrients This starchy root vegetable is a staple in many global cuisines — but it has to be prepared correctly, or it can cause serious concerns These delicate green sprouts can give you an extra dose of vitamin K and other nutrients — but they’re not safe for everyone Edamame, lentils and chicken breast are good sources of protein Eating this root vegetable can help support your eye, heart and brain health The flavorful herb is full of antioxidants that may help regulate blood sugar Wearing a scarf, adjusting your outdoor activities and following your asthma treatment plan can help limit breathing problems Your diet in the weeks, days and hours ahead of your race can power you to the finish line When someone guilt trips you, they’re using emotionally manipulative behavior to try to get you to act a certain way"
}