{
  "url": "https://www.wikihow.com/Take-a-Screenshot-with-the-Snipping-Tool-on-Microsoft-Windows",
  "title": "How to Take a Screenshot with the Snipping Tool on Windows",
  "text": "This article was co-authored by Ken Colburn and by wikiHow staff writer, Rain Kengly. Ken Colburn is a Consumer Electronics Expert and the Founder & CEO of Data Doctors Computer Services. With more than 34 years of experience, he specializes in computer checkups and repairs, data recovery, and teaching others about technology. Ken also provides one-minute tech tips through his broadcast, Data Doctors Tech Tips. This article has been fact-checked, ensuring the accuracy of any cited facts and confirming the authority of its sources. This article has been viewed 447,882 times. The Windows screen snip tool makes it easy to capture a screenshot of your screen. You can use the snipping tool to capture your entire screen or sections of it. You can even edit, annotate, and share snips with others easily. Here's how to take a screenshot with the snipping tool on Microsoft Windows 11, Windows 10, and earlier. How to Snip in Windows To use the Snipping Tool on Windows 10 or Windows 11, press the Windows key + Shift + S. To change the snip type, click the rectangle (default) and select a new one. Then, click and drag your cursor to screenshot the object. Steps Capturing a Screenshot - Open the Snipping Tool. Click the Start menu and enter \"snipping tool\". Click the first option to open the application. - If you're running an older version of Windows, you may not have all the options available for the Snipping Tool on Windows 11 and Windows 10 devices. - Click + New. This is at the top-left corner of the Snipping Tool window. - Alternatively, you can press Win + Shift + S to quickly start a new snip. Advertisement - Select the snipping mode. By default, your screenshots will be shaped like a rectangle. If you want to change this, click the Snipping Mode icon (rectangle icon, or current mode icon), and then select a new mode.[1] - Rectangle: drag the cursor to take a rectangular screenshot - Window: select and capture an entire window - Full screen: screenshot the entire screen - Freeform: draw a freeform shape around the object you want to screenshot - Select a delay (optional). If you want to take a screenshot after a short delay, you can set a timer. This is helpful if you need to navigate to a certain window or app before you take the screenshot. - Click the timer icon in the top toolbar, and then select: 3-second delay, 5-second delay, or 10-second delay. - To remove the timer, select No delay. - Select the screenshot object. This will vary depending on the snipping mode you selected. If you set a timer, you can start selecting when the screen turns gray. - Rectangle: click and drag the cursor to form a rectangle - Window: select the window you want to capture - Full screen: instantly captures the entire screen - Freeform: draw a shape around the object you want to screenshot - Your screenshot will be saved in your Screenshots folder, which is in your Pictures folder. Editing a Screenshot - Open your screenshot. If you just took a screenshot, it should automatically open in the Snipping Tool's editor. If it doesn't open, you can find it in Pictures > Screenshots. To open it in the editor, right-click the screenshot file, select Open with > Snipping Tool. - Annotate your snip. Once you capture your snip, you can annotate it in a few different ways. - Click the Pen or Highlighter tool to write or draw on your snip. - Select the Shapes tool to add shapes or emojis to your snip. - Select the Eraser tool to remove any annotations you added. - Select the Crop tool to crop your snip. - Select the Text actions tool to copy text from the snip. - Select the back or forward arrow to undo or redo your annotations. - Redact text. If you took a screenshot of a document with sensitive information, such as email addresses and phone numbers, you can use the Quick redact tool to quickly black out that information. - Click the Text actions tool to activate the Optical Character Recognition (OCR) feature. Then, select Quick redact. If you need to remove the redactions, click the drop-down menu and select Remove all redactions. - Edit your snip in Paint. If you want more customization options, such as enlarging, rotating, or cropping your snip, you can edit your snip in Paint. Just click Edit in Paint in the top-right corner to open your screenshot in Paint. - You can use Microsoft Paint to easily resize images, edit text, replace colors, and more. - For even more ways to edit your screenshot, check out How to Edit a Screenshot. Capturing a Video Snip - Open the Snipping Tool. You can also use the Windows Snipping Tool to record the screen. Click the Start menu and enter \"snipping tool\". Click the first option to open the application. - If you're running an older version of Windows, you may not have all the options available for the Snipping Tool on Windows 11 and Windows 10 devices. - Click the Record icon. This is the video camera icon next to the camera icon. - Click + New. This is at the top-left corner of the Snipping Tool window. - Alternatively, you can press Win + Shift + R to quickly start a new video snip. - Keep in mind that video snips can only be in rectangular form. - Select the area you want to record. Click and drag your cursor over the area you want to record. The non-recording area will be greyed out. - Click Start to start recording. You'll see a countdown on your screen before the Snipping Tool begins recording. The border will turn red when recording is active. - If you don't want sounds from your device to be recorded, click the icon next to the trash can to mute your system's audio. - If you need to pause, click the pause button, and then click the play button when you're ready to resume. - Click the stop button. This will stop recording. - Add captions or audio (optional). When you complete your video snip, you can finish editing in Clipchamp, Microsoft's video editor. - To add captions: - Click Edit in Clipchamp at the top-right corner. - Click the Captions tab and select Transcribe media. - Select your language, and then select Transcribe media. - You can also select the Text tool to manually add captions. - To add or detach audio: - Select the Audio tab. - Adjust the volume range if needed. - To detach the audio, click Detach audio. - To add captions: Community Q&A - QuestionHow do I create a snipping tool shortcut on my desktop?Alex MarchukCommunity AnswerRight click the windows icon, click search, type \"Snipping\" - the tool will appear. Right click the snipping tool icon and choose \"Pin to Start\". You can now drag the snipping tool icon from your start menu onto your desktop. - QuestionI can't paste the snipping tool in an email?Top SourceCommunity AnswerDon't paste directly in email. Just snip and save as an image and you can easily upload the image with an attachment. - QuestionHow can I create this red rectangular mark used in your presentation?Sylvia SaltaformajoCommunity AnswerYou need an image editor to do this. The easiest option for a Windows user is MS Paint. However, if you need extra editing tools, you can use other screenshot software with embedded draw options. It's not possible using the Snipping tool - you can only draw lines and highlight things in it. Video Tips - On many laptops, the \"Print Screen\" key is combined with another key. You will have to press Fn or Function to access it.Thanks References - ↑ https://support.microsoft.com/en-us/windows/use-snipping-tool-to-capture-screenshots-00246869-1843-655f-f220-97299b865f6b#id0edd=windows_11 - ↑ Ken Colburn. Computer Repair Expert. Expert Interview About This Article 1. Open Snipping Tool. 2. Select a snip type from the menu. 3. Click New. 4. Draw a box around the part of the screen you want to capture. Reader Success Stories - \"Just found out the shortcut not functioning. Important online transaction to be printed. This site solved my problem.\"...\" more"
}