{
  "url": "https://dictionary.cambridge.org/dictionary/english/old",
  "title": "OLD | English meaning - Cambridge Dictionary",
  "text": "old adjective uk /əʊld/ us /oʊld/old adjective (NOT YOUNG/NEW) an old man get old We're all getting older. - oldHe was an old man. - elderlyA large number of elderly people live alone. - the elderlyMany among the elderly cannot afford to pay their electricity bills. - agedHe has to look after his aged aunt. - ageingUK The ageing chairman was forced to retire. - A group of old men sat playing dominoes. - Many buildings in the old part of the city are falling down, and the government has no money to repair them. - As people get older, they often become set in their ways. - It would be a sacrilege to put a neon sign on that beautiful old building. - There's some wonderful calligraphy in these old manuscripts. old adjective (WHAT AGE) - An adult under British law is someone over 18 years old. - Most children in the UK remain in full-time education until they are at least 16 years old. - How old is his daughter? - The trial was held in camera because the accused was only 14 years old. - He asked me how old I was and, lying through my teeth, I said '29'. old adjective (FROM THE PAST) A2 [ before noun ] from a period in the past: In my old job I had less responsibility. Synonym - oldBe careful - that clock is very old. - formerHe's a former coworker of mine. - ancientWe need to protect ancient monuments. - archaic\"Thee\" is an archaic word for \"you\". - After six months of chopping and changing, we've decided to go back to our old system. - Just by coincidence, I met my old school-mate again 50 years later. - It will only complicate the situation if we invite his old girlfriend as well. - The new Prime Minister is cultivating relationships with old Eastern Bloc countries. - The new house is not dissimilar to our old one except that it's a bit bigger. old adjective (LANGUAGE) old adjective (VERY FAMILIAR) She's one of my oldest friends - we met in kindergarten. [ before noun ] informal - all day, week, year, etc. long - all-night - ancient - ancient forest - be going strong idiom - immemorial - immemorially - incorruptibility - incorruptible - incorruptibly - man and boy idiom - never-ending - nondurable - nondurable goods - of old idiom - timeless - timelessly - timelessness - unslaked - until doomsday You can also find related words, phrases, and synonyms in the topics: the old - The old are particularly vulnerable to these fraudsters. - These holidays are aimed at the old. - The old tend to have a different perspective on war."
}