{
  "url": "https://dictionary.cambridge.org/dictionary/english/sir",
  "title": "SIR | English meaning - Cambridge Dictionary",
  "text": "Meaning of sir in English Sir noun uk strong /sɜːr/ weak /sər/ us strong /sɝː/ weak /sɚ/Sir Walter (Scott) sir | American Dictionary sir noun [C] (USED TO ADDRESS) Sir | Business English Examples of sir sir Can you read us the wording of your proposed amendment, sir? From the Cambridge English Corpus One that was a woman, sir; but, rest her soul, she's dead. From the Cambridge English Corpus Forgive me, sir, consider my condition of unbearable suffering, consider my misfortune. From the Cambridge English Corpus Let go, sir, let go, sir, don't lift up the cloth of my veil! From the Cambridge English Corpus Our major issue of interest was children's spelling of words like sir. From the Cambridge English Corpus The best way send one to come and check this small thing quickly sir. From the Cambridge English Corpus His vocatives indicate this: the detachment of \"sir\" (2, 9), the conventional neutrality of \"thou\" (5), the intimacy of \"my friend\" (5). From the Cambridge English Corpus There must be someone in the background, sir; it can't be the cousin. From the Cambridge English Corpus Yes sir; so far as the official information is concerned, it is correct. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 No, sir; the reply to that part of the question is in the negative. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 My dear sir, it would be an excellent substitute for a sleeping draught. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 Why is it, sir, that the 10-minute rule comes into force only at 6 pm? From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 I am writing to ask if you, sir, can assist me to get the tenancy which was assigned to me. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 Surely that is a point that you can address, sir. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 Yes, sir; it has been thought that another method can be substituted for the portfolios: the men will have a book given them. From the Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 These examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors. Translations of sir in Spanish caballero, señor, tratamiento honorífico que se da en el Reino Unido a algunos hombres… in Marathi in Japanese in Turkish in French in Catalan in Dutch in Tamil in Hindi in Gujarati in Danish in Swedish in Malay in German in Norwegian in Urdu in Ukrainian in Telugu in Bengali in Czech in Indonesian in Thai in Vietnamese in Polish in Korean in Italian श्रीमान… 目上の男性に敬意を表す言葉, 見知（みし）らぬ男性（だんせい）への丁寧（ていねい）な呼称（こしょう）, 閣下（かっか）… beyefendi, bayım, Sayın...'… monsieur [masculine], Monsieur, mon commandant [masculine]… senyor… meneer, heer, Sir… ஒரு மனிதனுடன் பேசுவதற்கான முறையான மற்றும் கண்ணியமான வழியாகப் பயன்படுத்தப்படுகிறது, குறிப்பாக நீங்கள் ஒரு சேவையை வழங்குகிறீர்கள் அல்லது அதிகார நிலையில் இருப்பவர்… (औपचारिक और सभ्य प्रयोग) सर, महोदय, श्रीमान… સાહેબ… hr., Sir… min herre, herrn, sir… tuan, Tuan… (mein) Herr, der Sir… min herre [masculine], (høflig tiltaleform overfor en ukjent mann), Sir [masculine]… جناب, سر, حضورِ والا (اپنے مالک یا کسی اہم اوربااختیار شخص کو مخاطب کرنے کا شائستہ طریقہ)… сер, пан, добродій… సర్… স্যার, মহাশয়… pane, sir… tuan, Sir… คำสุภาพสำหรับเรียกผู้ชาย, คำเรียกนำหน้าชื่ออัศวินหรือขุนนางของอังกฤษ… thưa ông, ngài, tiên sinh!… proszę Pana, (Szanowny) Panie, Proszę Pana… 이름을 모르는 남자를 공손하게 부를때 씀… signore (usato per rivolgersi ad un uomo in modo gentile), signore, Sir…"
}