{
  "url": "https://schaller.info/en/tremolos/",
  "title": "Tremolos for electric guitars",
  "text": "Tremolos for electric guitars To be able to use the full range of Shopware 6, we recommend activating Javascript in your browser. English Deutsch English Español Français Italiano English Deutsch English Español Français Italiano Close menu Your account Log in or sign up Overview Your profile Addresses Payment methods Orders Quick order Credit Cards €0.00* Home Machine Heads Bridges Tremolos S-Locks Megaswitches, Preamp & Pickups Parts & Accessories News Close menu English Deutsch English Español Français Italiano Show all categories Tremolos Back Show Tremolos Tremolos Name A-Z Name Z-A Price ascending Price descending Topseller Please set the \"Comfort functions\" Cookies to activate the wishlist! LockMeister® 6 From €244.30* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! LockMeister® 6 left From €314.10* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! LockMeister® 7 From €349.00* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Schaller Tremolo From €209.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Vintage Tremolo From €157.10* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Vintage Tremolo Right powered by KTS (Strat style saddles) From €251.10* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Vintage Tremolo Right powered by KTS (block style saddles) From €391.60* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! SureClaw From €69.80* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Replacement Kits Tremolos Details Shop Service Merchant login Consumer login Shipping information Payment Contact us Newsletter facebook Instagram YouTube User Guides FlagShip Hannes®-Bridge Posts for machine heads Megaswitches Megaswitch Bass S-Locks Left or right machine head Information Imprint GTC Schaller Data protection policy Cancellation policy Statutory information obligation Cookie settings * All prices incl. VAT plus shipping costs and possible delivery charges, if not stated otherwise. This website uses cookies to ensure the best experience possible. More information... Deny Configure Accept all cookies"
}