{
  "url": "https://boards.soapoperanetwork.com/forum/11-discuss-the-soaps/",
  "title": "Discuss The Soaps - Soap Opera Network Community",
  "text": "I’m up to February 12, 1999. *Wendy Moniz (Dinah) is no longer in the credits, how sad! Jim decided to take the job offer at Spaulding and tells the family they’re moving to Springfield, which makes Harley and Daisy so happy. Jim settles into the new job, but it’s clear he’s annoyed with Phillip for all the accommodations and money he’s providing, which makes Jim believe he can’t support his own daughter. Meanwhile at the hospital, Harley introduces Daisy to Reva and Cassie, her grandma and great aunt LOL. Reva invites her to dinner so they can get to know each other and she can tell her about her father, Dylan. Vanessa is sharing a cell right next to Annie LOL. They throw barbs at each other all night about Dinah and how each of them were bad influences on her. Matt then shows up, which pisses off Vanessa who tells him that he gave up on her and Dinah so she never wants to see him again. He says he’s there to help get her out and that he changed his story on what happened, but the police don’t believe him. Vanessa is unimpressed and says he’s the reason she’s in jail, she doesn’t trust him and vows they’re no longer together. She screams at him to get out and he leaves, while Annie playfully says she always thought Matt was a first-class jerk anyway. Vanessa leaves with a guard to see Frank, and Annie finds a matchbook on the floor that came out of the guard’s pocket. She says this may be her ticket out of here. Matt goes to Beth and asks if she’ll change her story to align with his new one to help Vanessa, but she says she can’t do it. Hart wakes up again and Cassie/Blake are taking care of him in the hospital. Blake makes a quick call to Roger, which was a nice gesture, even though we don’t see or hear his voice. Ben shows up and tells Blake he got a call about Holly escaping her rehab clinic and they need to be vigilant since she’s angry. He convinces her to turn Holly in, so Blake tells Frank only that she ran away from her rehab. Frank says there’s nothing they can do and Ben encourages Blake to tell him the truth, but she can’t. Blake starts to leave and Ben tells the full truth to Frank, that Holly is the Stalker. Blake gets angry with him, but finally admits the truth to Frank, who is seething since Harley was a victim. Blake is still mad at Ben and walks out alone, after telling him he just killed her mother. Meanwhile, Holly finds Ken and she takes him to their old summer camp cabin when they were kids. She tells him her plan (offscreen), but we see Ken tell her she can’t go through with it because it’s too much. She tells him it’s too late, her plan is already in motion. She says no one will get hurt and Ken finally agrees to help her, just to be able to watch over her. She gives Ken power of attorney and wants him to go pull out cash from all her bank accounts. Ben follows Blake home, they argue and she tries to kick him out of her house. She goes to check on the boys and screams because they’re missing! She walks out and cries to Ben that her mother kidnapped her boys! They call Frank and he comes over and tells them she’s cleared out her bank accounts and taken her passport, so they’re afraid she took the boys out of the country. Ross shows up and they tell him about Holly being the Stalker. They all assume Ken is involved and Frank then gets a call that Ken is now missing, so he leaves for the diner where Ken was last seen. Ross then hugs a crying Blake. Selena and Buzz are hanging out with the boys and she’s trying to convince him to live and enjoy life without Jenna. She surprises him with hockey tickets for the night for him and Frank. Eleni then drops off Lizzie and Marina while she works her catering job. Buzz leaves for the diner to pick up Frank for the game, leaving Selena babysitting the four kids. She gets a call from a frantic woman at the diner saying there is an emergency, so she doesn’t know what to do with the kids, but Marina convinces her that she can babysit the boys because she has before and it will be ok. So Selena leaves for the diner and shows up finding Frank and Buzz talking about Holly kidnapping Jason/Kevin. They realize the call was a deception, while we then see a hidden figure ring the doorbell at the firehouse and Marina answering asking the person to come in. We then see Frank/Buzz/Selena get to the firehouse and all the kids are gone and they’ve realized Holly has taken them! Buzz says Holly took his wife Jenna, but vows he won’t let her take his kids for good. Harley tries to convince them that Holly might not be in her right mind, but she would never physically hurt the kids. We then see Holly driving her van with all the kids packed in LOL. Back at the hospital, Cassie leaves Hart to rest with a nurse and we see him looking at the nurse with a white light surrounding everything, which makes you think he may be dying! Outside his room, Jim walks by Cassie and recognizes her and says hi, but she said she doesn’t ever remember meeting him. Oh, he remembers her as a random stripper in Chicago, that’s weird to bring up. We then see a flashback to them meeting at her bar, with his moppy hair, and she remembers that he was nice. They bonded back then about how they want to protect and support their daughters, which is why Cassie is a stripper. Definitely seems like they’re chem testing the two here. Drew tries to make Jesse jealous by lying about a hot date she had, which Selena backs up as Jesse asks more about it. Meanwhile, Michelle takes Danny to the Bauer house to properly meet the family. Meta and Rick are there and Michelle mentions the wedding is in 2 days, but Rick tells her to count them out. Danny says that will be fine, but Meta privately tells Michelle she can’t fool her and she knows she’s not in love with Danny. Rick and Meta eventually decide they have to be there for Michelle regardless of what she’s doing. In her bedroom, Danny confesses to Michelle that he’s starting to have feelings for her and slowly kisses her ear. She stops him and says she doesn’t have those feelings, but he says maybe after time and once they’re married under the eyes of God, she’ll feel differently. Meanwhile, Jesse shows up to return Michelle’s things from their apartment, and is trying to convince Meta that he’s ready to move on from Michelle. Meta says she doesn’t believe that he’s ready yet and can see the pain in his eyes. Billy, Bill and Josh talk about Annie and Bill tries to tell them Annie has changed and was nice to him when he met her. They tell him everything she’s done to Reva and the family and he can’t believe he was duped. Bill then leaves to see Vanessa in jail, which Billy asks him to say hello (LOL, you’d think they would be visiting her ASAP, but I’ll just assume that happened off-screen already). On his way out, Billy asks Bill not to tell anyone, even Vanessa, about what they’re doing with Lewis Oil/Alan. Bill gets to the jail and Annie flirts with him, but he tells her that he knows all about her now. Annie says she doesn’t want anything from him, “little boy”, anymore. Bill tells her she won’t go anywhere because she’ll be in jail for life, which makes her think he knows something. After Bill leaves, she uses a match she swiped from the guard and starts a fire in her bed. As the guards are trying to get the fire out, she manages to slip away and escape. Meanwhile, Billy and Josh enlist David’s help to overtake Alan. Reva then brings Susan/Daisy by and introduces her to the whole Lewis family. They question what she should call Reva - Grandma (even though Susan doesn’t think she looks like one), Granny, etc - and they leave it open-ended. After Susan/Marah/Shayne/Tammy go play, Reva calls Billy ‘Grandpa’, but they all agree to wait and tell Susan about him and Dylan (her father) until Harley says it’s ok. Back at the fire station, the gang realize that Holly has threatened Cassie and Harley before about being bad mothers, so they think Tammy and Susan are in danger, so they call Reva’s house. Just before the call comes through, Marah comes back inside and Reva/Josh ask where the other kids are. Marah said they just left for their trip, the one where Holly picked up all the kids and were taking them on an adventure. The adults tell her they know nothing about a trip and press Marah on why she would allow the kids to get into a van without telling them, and Marah said she thought it was strange they would allow them to leave on a school night (duh). The phone then rings and Harley tells Reva that Holly is the Stalker and has kidnapped a bunch of kids, and Reva tells her she now has Tammy/Susan/Shayne. We then see Holly, Ken and all the kids arrive at the camp cabin. Marina asks when their parents are coming and Holly said later, but for now they just need to have fun without them. By alwaysAMC · 9 minutes ago 9 min"
}