{
  "url": "https://www.madaboutmacarons.com/mushrooms-champignons/",
  "title": "French Mushrooms (A guide to their types and recipes)",
  "text": "A guide to French mushrooms in France, what goes with them and healthy mushroom recipes. Even includes a popular French saying to step on one. - Mushroom Season - Common French Mushroom Types - What are the Wild Mushrooms in France? - What are Duxelles? - History of French Mushrooms - Do I need to Wash Mushrooms? - Are They Good for You? - How Best to Prepare - How Long do Mushrooms Keep? - Popular French Saying with Mushrooms - What Goes with Mushrooms? - French Mushroom Starters or Appetizers - French Mushroom Recipes - Mains Mushroom Season Common button mushrooms are available on sale all year round. However, the other wild edible varieties are in peak season in Autumn. So it's typically French to add them to all sorts of Autumn/fall dishes as a side with fresh herbs (e.g. parsley and chervil). Add these freshly chopped at the end of cooking in classic stews (see recipes below). Common French Mushroom Types France is the 3rd biggest producer of mushrooms in Europe, behind Poland and Holland. The major type you're most likely to see is the common button mushroom. Common Parisian, or button mushrooms ('Champignons de Paris' in French) are most popular in France and one of the most consumed mushrooms in the world (Agaricus bisporus). Champignons de Paris (pronounced 'shom-peey-nong de Paree') are available either white or chestnut brown (referred to as 'rose' - pink in French), they're also known as button or cremini mushrooms. What are the Wild Mushrooms in France? For all the wild types of mushrooms found in France, see this guide to identify different mushrooms if you like to forage. Although, please don't just follow online applications to forage - it's far too risky! So, if you're not sure of the poisonous ones, French pharmacists can check them for you. Major types in France: Shiitake (meaning chestnut mushroom in Japanese); Cepes/Porcini, Girolle, Morel, Chanterelle, Trompette des Maures, Pleurottes (oyster), Pieds de Mouton (Lobster) and truffle (truffe). What is 'à la Forestière'? In French cuisine, anything referred to à la forestière means in culinary terms that the food is garnished with wild mushrooms. Normally it's to garnish meat joints and you'll often see it on crêperie menus as a filling for buckwheat galettes or on pizza. Morels The French are the top consumers of morels in the world (French: Morilles). As with truffles, this expensive spongy wild mushroom (Latin: Morchella esculenta) is widely used for holiday menus. While Europe has strict controls, imports often come from sources that do not. They could be toxic false morels, been sprayed with cancerous pesticides, or not washed or prepared correctly for consumption. So, the 'moral' of the story? Check they are true morels before buying and ensure they are well cooked. French Cèpe Mushrooms French cepes are also known as bolets (bolete in English) which have their distinctive cap. Instead of the usual gills underneath like other mushrooms, have a spongy surface with pores. Although expensive, it's easy to find dried mushrooms in French supermarkets: particularly cèpes and morels. Soak them in water for 30 minutes and add them to pasta sauces for a real depth of flavour. What are Duxelles? Duxelles are not a type of mushroom. Instead, Duxelles is a French cooking term which refers to finely chopped mushrooms, onions/shallots and fresh herbs slowly sautéed in butter and reduced to a paste. History of French Mushrooms Louis XIV's botanist, La Quintinye cultivated mushrooms at the Potager du Roi in Versailles but it wasn't until the 19th Century that Champignons de Paris were born. As of 1810, they were cultivated in abandoned quarries or caves around Paris - see my post on Renoir's Chatou and Carrières Near Paris). Another famous location is around the Loire Valley due to their constant temperatures and ideal mushroom growing environment with troglodytes. \"Wash and dry them, slice them then coat with salt and pepper and fry them in butter in a frying pan over a fierce fire. Sprinkle them with chopped parsley at the last moment.\" Chef Auguste Escoffier on the most popular way to prepare mushrooms: Champignons Sautés (Entry 2073 in his Guide to Modern Cookery) Do I need to Wash Mushrooms? Avoid eating raw mushrooms as they contain bacteria. So, always before cooking them, wash them carefully under water and remove any traces of dirt. Do this as close as possible before eating, as they spoil quickly. Are They Good for You? According to the Harvard School of Public Health, mushrooms are rich in B vitamins: B2, B3, folate, B5 and B9 (folic acid), plus are a good source of Phosphorus, vitamin D, selenium and potassium. French dietician, Dr Jean-Michel Cohen confirms that mushrooms are the best source of Vitamin D out of the Autumnal vegetables, especially those exposed to UV rays. With up to 1000 UI of vitamin D per 100g (according to their exposition to the light), they contain more vitamin D than squash, broccoli or cabbage. So, to increase your Vitamin D levels in winter, eat more mushrooms, add egg yolks to your diet, consume fatty fish in dishes such as mackerel salad or pan-fried mackerel with mustard, and spend time in the sunlight outdoors. How Best to Prepare So, to enjoy mushrooms at their best and extract the most flavour, first sauté them chopped in a hot non-stick pan without any oil or butter. Dry fry them just until some of their natural liquid is released to concentrate their flavour then add a little butter and olive oil to finish off the process. How Long do Mushrooms Keep? Fresh mushrooms are best eaten as soon as possible. They can keep up to 4-5 days in the fridge, only if stored well and absolutely fresh when purchased (i.e. not slimy in any way). Avoid storing them closed in plastic. Keep them open to the air on a fridge shelf rather than in the vegetable drawer and away from strong smelling foods, as they absorb odours quickly. Avoid chopping them well in advance of cooking as, like apples and pears, they oxidise. Prepare them as soon as possible prior to cooking, otherwise steep them in a little water with lemon juice. Popular French Saying with Mushrooms \"Appuyer sur le champignon\" (pronounced: apwee-aye soor le chompeeng-nong) Colloquial French expression (literally translated as 'to press on the mushroom') which means to accelerate a vehicule, to go faster, as a champignon is often referred to as the accelerator. What Goes with Mushrooms? According to both Niki Segnit's 'The Flavour Thesaurus' (2010) and Raphaël Haumont in 'Les Papilles du Chimiste' (2017), all mushrooms have their own particular earthy flavour. However, each contain a flavour-identifying compound called I-octen-3-one. As a result, other foods with similar compounds go very well with mushrooms: almonds, apricot, bacon, chestnut, garlic, onion, asparagus, pumpkins, aromatic herbs (parsley, tarragon, mint, rosemary, thyme), truffle, plus another ingredient you have to discover in this creamy mushroom soup! According to the Harvard Nutrition Source, mushrooms create savoury rich flavours called umami (contains glutamate). So, the good news is, when added to dishes (stews, pasta or rice dishes and soups), there's no need for too much salt. Matching with French wine: traditionally in France, mushroom dishes (in particular morels) are often served with a chilled white from the Jura. For special occasions, enjoy particularly with a vin jaune. French Mushroom Starters or Appetizers Known as l'entrée in France, the French appetizer (UK starter) features all kinds of mushrooms in season around Autumn. Perhaps the most popular is simply a plate of mixed wild mushrooms, sautéed in butter, shallot and chopped fresh herbs. Otherwise try these fun appetizers to open the appetite. The ultimate flavours to start off a French menu is this fun creamy mushroom soup in the style of a cappuccino. Try this soup with some coffee in it and it's guaranteed a hit. Perfectly dosed, the coffee brings out the mushrooms without overpowering. Serve in coffee cups and dust with unsweetened coffee powder for best effect. Even more fun, serve the mushroom cappuccinos with a savoury mushroom macaron with a hint of truffle. French Mushroom Recipes - Mains Button mushrooms are one of the main ingredients in the classic French Blanquette de Veau. To appreciate the best flavours in this veal stew, sauté the mushrooms separately with pearl onions and add towards the end of cooking and add the famous white sauce. Sauté mushrooms and add them to these stuffed mini pumpkins, known as Jack-be-Little in France. Either vegetarian topped with cheese or with added bacon. Cook mushrooms separately with bacon and add towards the end of cooking to the classic French Coq au Vin casserole dish. These days we don't cook with rooster (le coq) but rather with chicken. However, even if it looks longer to marinade in the wine overnight (authentic with red wine), it's worth it! The flavours are beautifully intense and the meat incredibly tender. Another French slow-cooked main dish is the Burgundy beef stew, Boeuf Bourguignon. Like the Blanquette and Coq au Vin, mushrooms are added as part of the garnish at the end of cooking to retain their flavours. Add sautéd mushrooms (cooked separately) to this butternut and walnut gratin. Mushrooms are a highlight in this Autumnal chestnut flour tart. It's so worth making the homemade pastry and enjoy all the flavours of fall. This post was first published September 9th 2021 but is now completely updated."
}