{
  "url": "https://techcommunity.microsoft.com/blog/microsoftteamsblog/whats-new-in-microsoft-teams-at-enterprise-connect-2025-leading-the-future-of-co/4393733",
  "title": "What's new in Microsoft Teams at Enterprise Connect 2025: Leading the Future of Collaboration | Microsoft Community Hub",
  "text": "Enterprise Connect 2025 (March 17-20, 2025), is the premier conference for enterprise communications and collaboration in North America, and we were excited to attend to highlight some of our newest Microsoft Teams innovations. Ilya Bukshteyn, CVP of Microsoft Teams Calling, Devices, and Premium Experiences, delivered a keynote address to introduce and demonstrate some of these advancements. The features he highlighted and others announced during the event represent different areas of Teams, including Places, chat and collaboration, meetings, events, Teams Phone, Teams Rooms, fundamentals, and security. All of these features are designed to highlight how Microsoft Teams is transforming the future of work. From seamless communication to advanced AI-driven features, these new capabilities can be instrumental in helping businesses thrive in a hybrid work environment. Let’s take a look at what we introduced. Chat and Collaboration Meetings, Webinars and Town halls Teams Phone Workplace: Places and Teams Rooms Teams Devices Fundamentals and Security Frontline workers Chat and Collaboration The new chat and channels experience: Generally available in early 2025 (Q1) The new chat and channels experience is designed to help you collaborate more efficiently and effectively. It’s simple by default, enabling everyone to stay on top of what matters, and it’s powerful on demand, allowing you to organize information and communicate your way. Catch up on chat, channels and teams in one place, use filters to triage messages, create custom sections to organize conversations by topics, and more. Learn more here. We’re committed to making Teams more streamlined with enhancements like threaded conversations, coming to broad availability in mid-2025. Chat @nearby: Available in public preview in April You can now connect with colleagues who are physically nearby via Teams chat using @nearby. By showing which colleagues are nearby, this feature can help to spur impromptu in-person connections, such as scheduling a spontaneous lunch or meeting up for a quick chat. Resize Teams windows and panes: Available now in public preview Teams now offers more options to arrange your Teams app window across your screen real estate, allowing you to keep your communication in context, tailoring it to your needs. Learn more here. - Resize Teams app: snap and resize the Teams app with Windows 11 Snap layouts to efficiently multitask by viewing multiple applications side by side. Enabling access to chat, channel, and meetings functions at smaller window sizes ensures that you can work across all aspects of Teams, alongside other apps. - Resize Teams panes: adjust the size of your Teams panes to prioritize what is currently most important to you, and Teams' fluid experience will instantly adapt to fit the new layout. For instance, you can expand the meeting chat pane during a meeting. Simply hover over the edge of the chat, channels, meetings or activity panes, and drag the arrows to resize the panes - Zoom levels: Teams now offers additional zoom levels to help you find the size that works best for you. Whether you're using a 6k display or have low vision and need larger text, icons, and controls, you can zoom in without sacrificing functionality or needing to scroll in two directions to read the text. Shared collaborative space in channels: Available in public preview in April A new collaborative space is now available directly from channels, enabling real-time collaboration, organization of key information, and streamlined communications. You will be able to add a Loop workspace tab to standard channels, allowing your team to brainstorm, co-create, collect, and organize content together in real-time. Everyone in the Team gets access to the Loop workspace, even as Team membership changes, and the workspace adheres to the governance, lifecycle, and compliance standards set by the Microsoft 365 Group backing the team. To get started, click the plus sign (+) at the top of the channel and select Loop from the app list. This will be generally available in April. Live chat: Generally available now in the US, rest of world by end of March Live chat in Microsoft Teams enables small businesses to provide quick and helpful customer service by allowing website visitors to chat directly with their team in Teams. This feature includes notifications for incoming chat requests, a dashboard for managing conversations, and the ability to view previous customer interactions. To use Live chat, companies are limited to a maximum of 25 users. This is generally available in the US now and will be available worldwide in March. Learn more about how to set up live chat. Share file (forward): Available in Public preview in March You will be able to directly share a file from chat or channel conversation to other chat or channels, making sharing easier with fewer clicks. To share a file, select the file’s ellipsis menu and choose ‘share’. You can add additional content to the message to provide context and clarity for the recipient. You can share in 1:1 chats, group chats or channels. Improvements to “Shared” tab in chat: Generally available now Filter files by keywords: locate previously shared files or links by entering keywords to the Shared tab’s search bar. Type name, file title, the person who shared it, or even the time when it was shared, and find the file you need. Go-to-chat: Select the go-to-chat icon to quickly navigate to the specific message in which the file or link was shared. Storylines integrated into Teams: Generally available in early 2025 (Q1) Employee communications are often scattered across multiple locations, leading to frustration, delays, and overload. Storyline in Teams empowers leaders to share updates and vision with all of employees and simplifies the ways that people share and connect. The storyline integration brings the same communication benefits from Viva Engage right into Teams, providing a new way for employees to stay on top of company initiatives, discover what leaders are talking about, and contribute ideas and perspectives. Meetings, Webinars and Town halls Intelligent meeting recap for Events [Premium]: Generally available now Intelligent recap is now available for town hall and webinar event instances, just like the intelligent recap experience you are used to in meetings. Event organizers, co-organizers, and presenters can now easily explore the meeting recording by speakers and topics, and access AI-generated meeting notes, AI-generated tasks, and name mentions. In addition to availability with a Teams Premium license, intelligent event recap features are available with a Microsoft 365 Copilot license. End the Session for attendees and presenters return to green room: Generally available now Organizers and presenters can now end the session with this new \"End Event\" button for town halls, webinars, and structured meetings. After selecting this button, attendees will see a message on stage stating that the session has concluded, and presenters will return to the Green Room. Post and reply to questions as an organizer: Generally available in early 2025 (Q2) Town hall and webinar organizers now have the ability to post and reply to questions using the title “organizer” in the Q&A experience, instead of their individual names. This feature allows instance organizers to present a unified and official voice when responding to attendee questions. DVR Support for Town hall: Generally available in April Digital Video Recording (DVR) functionality in town halls now enables event attendees to interact with an instance of a live streaming town hall instance in the same way they would a recorded piece of content, when viewing via desktop or web. This makes it easier to digest the content being presented, giving viewers the ability to pause and move forward or back within a town hall, navigate to any previously-streamed timestamp, and interact in other ways that make viewing a town hall more convenient. This feature is available for all town halls regardless of license assigned to the organizers. Town hall concurrent attendee increase to 50K: Generally available in March Organizers of town hall instances can now reach wider audience in a single event with an expansion to a maximum of 50,000 simultaneous attendees. This increase serves as a significant jump from the previous attendee cap of 20,000 for organizers with a Teams Premium license. The quality and stability of town halls up to this new limit will remain constant, providing high-quality and reliable content to participants. For events with more than 20,000 concurrent attendees, some interactivity features are disabled for all attendees. Organizations can get support for audiences up to 50,000 concurrent attendees by reaching out to the Microsoft 365 Live Event Assistance Program (LEAP) for assistance (Microsoft 365 Live Event Assistance Program – Microsoft Adoption). ). Pop out meetings panels: Generally available in April When you are in meetings or calls, you can now pop out, drag, and resize your meeting panes from the meeting window. With this feature, you’ll be able to view multiple meeting features at the same time, so you don’t miss anything in the chat while monitoring meeting notes. The ability to pop out and move/resize is available for Chat, Copilot, and Notes side panes. Town hall Attendee/Presenter email dial in details: Generally available now With the release of this feature, the Townhall attendee and presenter invites will have dial in details available in the body of the email. This provides an additional level of convenience, giving attendees easy access to important event information. Separate policies to control transcription and recording for Town halls and Webinars: Generally available now Town halls and webinars now have separate policies from meetings to allow or disable transcription and recording in instances. Previously, the transcription and recording policies for town halls and webinars automatically inherited the transcription and recording policy set for meetings. Town hall and webinars can now also have distinct transcription and recording policies from each other. This option to implement different policies for town hall and webinars is available for users on all licenses. Ability to separate out the Townhall attendee invites: Generally available now Organizers can now maintain separate invites for Townhall attendees, distinct from the events crew. This feature helps manage large-scale events more efficiently by ensuring that only intended participants receive the necessary information Teams Phone Teams Phone extensibility for Microsoft Dynamics 365 Contact Center and certified ISVs solutions: Available in public preview in April We’re introducing Teams Phone extensibility for Dynamics 365 Contact Center and certified ISV solutions to help customers benefit from and extend their existing telephony investment with Teams Phone into the contact center. Beginning next month customers with Teams Phone and Dynamics 365 Contact Center will be able to leverage Teams Phone as a single, integrated solution to power calling across their unified communications as a service (UCaaS) and contact center as a service (CCaaS) solutions—streamlining the deployment, management, and billing of their telephony infrastructure. Teams Phone extensibility is also supported by ISV solutions that leverage Azure Communication Services (ACS) for this integration, offering customers a wide range of options to bring Teams Phone to their preferred contact center app of choice. Learn more. Copilot in Teams Phone: Use Copilot during Teams calls without turning on transcription or recording : Available now in public preview This new feature allows users to leverage Copilot's capabilities during live call sessions without retaining transcripts or an audio recording afterward. This ensures that users can benefit from Copilot during sensitive conversations where a persistent record is not desired. f Once the admin has enabled this option, users can initiate Copilot without transcription or recording simply through clicking the Copilot button in the header menu. Copilot in Teams Phone helps automate important administrative tasks of a call, such as capturing key points, task owners, and next steps, allowing users to stay focused on the content of the call. Copilot in Teams Phone: Copilot summary for transferred calls: Available in public preview in April Use AI to facilitate seamless call transfers. When a call is forwarded/transferred to another colleague, users can prompt Copilot to automatically create AI notes for the call as a briefing for the receiving colleague. This feature ensures that the recipient is well-informed about the previous conversations related to the transferred call, enhancing their understanding and preparedness. By providing this context, the Copilot summary helps streamline communication and reduce the need for repetitive explanations. Copilot summary for transferred calls will also be supported for certified Teams Phone certified devices. Queues app: barge/whisper/monitor/takeover: available in public preview in April The \"Queues app: barge/whisper/monitor/takeover\" feature in Teams Phone helps team leads and supervisors manage and train junior agents effectively. This feature allows supervisors to: - Monitor: Listen to the conversations their agents are having with callers without being heard. - Whisper: Provide assistance to agents during a call without the caller hearing. - Barge: Join a call in progress to assist both the agent and the caller. - Takeover: Remove an agent from a call and take over the conversation, if necessary. These capabilities are particularly useful for teams that have to manage a lot of inbound calls to serve internal or external customers - such as IT help desk center environments – and where supervisors need to provide oversight in helping agents follow the right procedures when handling customer calls. The feature is part of the Queues app, which is available with a Teams Premium license. SMS for Teams Calling Plans in US & CA: Generally available in US and Canada Teams Calling Plans customers in US & Canada can now send and receive SMS messages directly from the Teams app on desktop or mobile, making it easy to connect with individuals outside of their organizations who are not using Teams. Registration with The Campaign Registry (TCR), which Microsoft helps facilitate during the setup process, is required before Microsoft Teams Calling Plan numbers can be enabled for SMS in Teams Admin Center. Users can then simply open the Teams app, create a new chat, enter the phone number they want to send a message to, then type and send their message. The message will be sent from the user’s phone number, not a generic number. Learn more. Peripherals: Unified call control across multiple Bluetooth audio devices: Generally available now When multiple peripheral devices are connected to Teams, the device used to answer a call will temporarily become the primary device that synchronizes with Teams for button functions. Post-call, the original device selected in Teams Settings will resume its role. Initially, this feature was exclusive to USB devices; however, it now extends to native Bluetooth devices. Users can confidently operate multiple Bluetooth devices, ensuring correct call control functionality. This feature is currently available on Windows, with MacOS support anticipated in the future. Phone devices: Shared call history for call delegates: Generally available now Call delegates can now have access to the call history of the delegator's shared line. This feature allows delegates to view and manage calls made or received on behalf of the delegator, ensuring seamless communication and collaboration. Phone devices: Line keys on phone devices with touch screens: Generally available now Line keys allow you to set up custom contacts and speed dial on the line key buttons of your Teams-certified phone devices with touch screens. They enable one-touch dialing capabilities, making it easier to quickly access frequently dialed contacts and improve productivity. Phone devices: Line key support for shared line and call transfers: Available in public preview in April This feature will enable you to assign shared lines to a line key and view the boss and delegates of the line along with their presence on Teams Phone devices with touch screens. This feature allows delegates to pick up calls on behalf of the boss by pressing the line key and join active calls. Additionally, users will be able to assign the transfer action to the line key, enabling them to transfer active calls by simply pressing that line key. Teams Phone Mobile is now generally available with several new operators, including Bell Canada, Odido (Netherlands), Vodafone UK, and Vodafone Germany. Teams Phone Mobile enables end-users to make and receive calls using a single number across their mobile phone and all their Teams endpoints. This expanding set of mobile operators providing Teams Phone Mobile allows more and more customers, such as Maternal and Family Health Services, to enjoy seamless mobile and Teams integration with unified a calling experience for enhanced flexibility. This feature will be available with additional operators and markets in the future. PSTN call extensibility: Generally available now PSTN Call Extensibility in Microsoft Teams allows third-party application developers to extend the PSTN calling experience with contextual information. Third-party apps can open within the calling interface, allowing end-users to access customer contact information during calls, streamline workflows, and improve customer interaction. Workplace: Places and Teams Rooms Room recommender: Generally available in April 2025 Room recommender makes it easy to collaborate in-person by suggesting suitable meeting rooms. If no room is booked for a meeting, this feature recommends rooms in the meeting chat an hour before the start time when two or more attendees are in the same building. It considers participants’ locations, room availability, and capacity to find the best meeting space. Users can reserve the suggested room with one click and update the meeting invite for everyone. Room recommender will be available on Teams mobile (iOS) to Teams Premium license holders. Ad-hoc individual desk booking: Generally available in April Instantly reserve a desk by plugging into a peripheral on a shared desk, enabling a more streamlined workplace experience for employees. IT admins also benefit from a streamlined backend experience, with automatic peripheral association based on desk booking data and access to desk utilization data in the Teams Rooms Pro Management portal. Auto-update workplace presence with Wi-Fi: Public preview in April A user's work location can automatically be updated to \"office\" when their device connects to the onsite corporate Wi-Fi. This feature helps colleagues easily see who is in the office, facilitating in-person connections and collaboration, and enables chat @nearby. Facilitator agent support in Teams Rooms: public preview available now The Facilitator agent support in Teams Rooms provides real-time AI-generated notes and action items during both scheduled hybrid and impromptu in-person meetings. The Facilitator agent appears in the notes panel for hybrid meetings and can be activated via a QR code for in-person meetings, enhancing collaboration and productivity for all. The feature is available to preview in Teams Rooms on Windows and coming to rooms with Android devices in April. Learn more. Occupancy status on Teams panels: Generally available early next quarter Teams panels can now smartly utilize signals from Teams Rooms devices (Windows or Android) or occupancy sensors paired with panels to indicate when a room is in use (e.g., LED glow), so you’re not surprised to find an available room is actually occupied. Learn more. Teams Rooms on Windows app release: Generally available early next quarter In addition to the presenter support in Teams Rooms on Windows for town halls and webinars recently rolled out (See the February WNIT blog), there are exciting features coming in the first 2025 app release for Teams Rooms on Windows. Updates include support for live transcription controls during a meeting from the console, additional language support, and real-time translation for captions, making meetings more inclusive and accessible for multilingual participants. And, with the updated gallery view which arranges participants in consistent tile sizes, prioritizes those with video, offers additional layout options, and optimizes for single and dual displays, users get a consistent meeting experience whether meeting from their desktop or in a room. Learn more. Teams Rooms on Android app release: Generally available early next quarter As in Teams Rooms on Windows, rooms with Android devices are able to identify speakers during live transcription, ensuring clear and precise voice capture for every participant. Cloud services bring intelligent speaker functionalities to existing speakers, offering intelligent meeting recaps and enhanced M365 Copilot value by attributing content and actions to individuals. Additionally, it provides AI-enhanced audio and video experiences in meetings. Additionally, users benefit from enhanced room availability information with real-time calendar updates. And with a first to Android feature, users can control the Pan-Tilt-Zoom (PTZ) of the active camera to keep the focus where they want it. Learn more. Teams Rooms Pro Management portal update: Generally available early next quarter Admins now have expanded device health signals with sign-on, Teams Rooms app heartbeat, and network status for Android devices, offering consistency across operating systems. You’ll also get poor call quality signals which help identity root causes and create tickets saving time and effort for IT. In April, GCC-H customers can take advantage of the Pro Management service with assurance that their high security and privacy needs are met. In response to customer demand for consolidation of admin portals, IT admins will have a unified device management experience, for all Teams Rooms on Windows, through the Pro Management portal. Access is being expanded to Basic and Standard licensed rooms, providing the same functionality found in Teams admin center for that license type. These devices will be in the Pro Management portal May 1st, and will no longer be available in Teams admin center (TAC) after June 1, 2025. First focusing on Windows, the unified experience will include Teams Rooms on Android in the future. And, lastly, IT admins can manage rooms more effectively with the AI assistant in the Pro Management portal. It’s designed to quickly provide product help and information specific to your device environment, it’s available for public preview in the coming weeks. You’ll want to be sure to explore this feature. Learn more. Teams Devices Logitech Zone Wireless 2 (Native Bluetooth certification ): Generally available now This dongle-free headset is the first headset with Native Bluetooth capability to earn Microsoft Teams certification. It brings a host of benefits, including the convenience of one less thing to carry (or lose!) as people switch work environments from home, in the office, or on the go, while also freeing up a USB port. Logitech's dongle-free headset features AI noise suppression, noise-canceling mics, hybrid ANC, and premium stereo sound. Advanced Call Clarity (enabled with Logi Tune) suppresses far-end ambient noise so employees can hear colleagues better. Four noise-canceling mics elevate the user’s voice above background conversations. Hybrid ANC makes it easy to concentrate in noisy environments. Personal EQ (enabled with Logi Tune) automatically adjusts to the wearer’s hearing range and the headset features interchangeable earpads and a replaceable battery for longevity. Yealink SkySound CM50 Dante Audio Kit: Generally available now Certified for Teams, the Yealink SkySound CM50 Dante Audio Kit is perfect for large rooms. It includes a CM50 Ceiling Mic, CS10-D Ceiling Speaker, and AP08 DSP. With 127 wide-range mics, advanced beamforming, customizable pickup zones, and AI-based sound optimization, it ensures premium audio coverage and an immersive sound experience, making it a comprehensive solution for Teams Rooms. Learn more. Logitech Rally Bar No-Radio: Generally available now Certified for Teams, the Rally Bar No-Radio transforms any mid-sized room into a Microsoft Teams Room. It features a motorized PTZ camera, room-filling speakers, and a sensitive microphone array for a premium user experience. With premium materials, thoughtful cable management, and a range of mounts, it ensures a professional appearance and outstanding coverage for various room shapes and layouts. Learn more. AudioCodes RXVCam50M Camera: Generally available now Certified for Teams, the AudioCodes RXVCam50M camera is ideal for medium meeting rooms and conference rooms. It delivers vivid image quality with HD 4K resolution for exceptional video conferencing. Smart zoom and face detection enable auto framing, adjusting the camera’s ePTZ to ensure every participant is clearly seen without user intervention. Easily configure settings via the AudioCodes RX-PAD or Teams client Settings menu. Learn more. AudioCodes RXVCam70 Dual-Lens PTZ Camera: Generally available now Certified for Teams, the RXVCam70 delivers an optimal audio and video meeting experience for all participants. It features a 12x optical zoom close-up lens, a 119º DFOV panoramic lens, and a built-in mic array. Advanced AI features, including auto-framing, speaker tracking, and smart gallery, ensure every moment is captured automatically. Included in AudioCodes solution bundles for medium-large Android and Windows Microsoft Teams Rooms, it creates an optimized environment for hybrid Teams meetings. Learn more. Fundamentals and Security Auto-upgrade meeting protection based on shared file: sensitivity label inheritance [Premium]: Generally available in April Now Microsoft Teams can automatically upgrade the sensitivity level of a meeting based on the sensitivity of files shared during the meeting. When an attendee shares a file with a higher sensitivity label, the meeting's protection settings are enhanced to match the file's sensitivity. This feature helps ensure that sensitive information is adequately protected throughout the meeting. It requires an Microsoft 365 E5 and Teams Premium license with Purview enabled. Message safety – URL and file protection: Generally available next quarter (Q2) This feature will enhance security for Teams messaging by blocking weaponizable file types and warning users of harmful URLs sent in Teams messages. The File and URL detection components are embedded in the Teams messaging layers providing comprehensive and robust protection across internal and external one-on-one chats, group chats, meeting chats and channels, to all Teams users. These protections will integrate with Microsoft Defender for Office to enable end-to-end security operations for Teams messaging. Active meeting protection: detect sensitive content while screensharing and notify [Premium]: Generally available next quarter (Q2) This new feature enhances security during meetings by using AI to automatically detect potentially sensitive information, such as social security numbers and credit card numbers, during screen sharing. When such content is detected, the feature alerts both the presenter and the meeting organizer to prevent unintentional sharing. This helps mitigate the risk of exposing sensitive information and ensures a more secure and private meeting experience. This feature is available to meeting organizers who have Teams Premium. All other participants in a meeting can benefit from this feature while in a meeting, however this feature is enabled when the meeting is scheduled by the meeting organizer. iPad split window: Generally available in next quarter (Q2) The iPad Split Window feature in Microsoft Teams supports multiple windows on iPad, allowing users to effortlessly switch between meetings and chats without losing context. Customize your split view for the perfect setup, enhancing multitasking and productivity. Frontline workers QR Code Authentication: Generally available in June 2025 Multiple frontline workers often share the same device across shifts throughout the day. Manual sign-in processes are time consuming and decrease productivity, especially on shared devices. This new, highly requested feature enables sign-in with the scan of a unique QR code and entry of a personal PIN number, significantly decreasing time to log in without affecting security. Shared Device Mode – iOS support for Jamf: Generally available Shared Device Mode now enables more efficient and secure device sharing for Frontline workers. Microsoft's Shared Device Mode (SDM) allows frontline workers, whose device may be shared among multiple users, to login once to access the device and every app on the device and sign out across apps so the device is ready for the next user. In addition, SDM enables conditional access policies to enable customized security policies. Jamf support for Shared Device Mode is now generally available. Customers with iOS Jamf-managed devices can now enable Shared Device Mode at scale with zero-touch provisioning and leverage device compliance conditional access. Open shifts across locations: Generally available The Open shifts across locations feature in Microsoft Teams allows frontline managers to offer open shifts across multiple locations, making it easier to balance workforce needs and fill last-minute gaps. This feature provides flexibility for frontline workers, enabling them to pick up shifts at different locations that suit their schedules. By optimizing staffing and improving customer satisfaction, this feature ensures that businesses are always fully staffed and ready to serve"
}