{
  "url": "https://play.google.com/store/apps/details?id=com.whatsapp&hl=es",
  "title": "WhatsApp Messenger - Aplicaciones en Google Play",
  "text": "WhatsApp de Meta es una aplicación GRATUITA de mensajes y videollamadas. Lo utilizan más de 2000 millones de personas en más de 180 países. Es simple, confiable y privado, por lo que puedes mantenerte en contacto fácilmente con tus amigos y familiares. WhatsApp funciona tanto en dispositivos móviles como en computadoras, incluso con conexiones lentas, y sin cargos de suscripción*. Mensajería privada en todo el mundo Tus mensajes y llamadas personales a amigos y familiares están cifrados de extremo a extremo. Nadie fuera de tus chats, ni siquiera WhatsApp, puede leerlos ni escucharlos. Conexiones simples, seguras y al instante Solo necesitas tu número de teléfono, sin nombres de usuario ni inicios de sesión. Puedes ver rápidamente tus contactos que usan WhatsApp y comenzar a chatear. Llamadas y videollamadas de alta calidad Realiza llamadas y videollamadas seguras con hasta 32 personas de forma gratuita*. Tus llamadas funcionan en diferentes dispositivos móviles mediante el servicio de Internet de tu teléfono, incluso con conexiones lentas. Chats grupales para mantenerte en contacto Mantente en contacto con tus amigos y familiares. Los chats grupales con cifrado de extremo a extremo te permiten compartir mensajes, fotos, videos y documentos tanto en dispositivos móviles como en computadoras. Mantén la conexión en tiempo real Comparte tu ubicación solo con los participantes de tus chats individuales o grupales, y deja de compartirla en cualquier momento. También puedes grabar un mensaje de voz para conectarte de forma rápida. Comparte momentos cotidianos a través del estado Con los estados, puedes compartir actualizaciones de texto, fotos, videos y GIF que desaparecen después de 24 horas. Puedes elegir compartir publicaciones de estado con todos tus contactos o solo con algunos seleccionados. Usa WhatsApp en tu reloj Wear OS para continuar conversaciones, responder mensajes y recibir llamadas, todo desde tu muñeca. Además, puedes aprovechar los mosaicos y las complicaciones para acceder fácilmente a tus chats y enviar mensajes de voz. *Ten en cuenta que tu proveedor de telefonía móvil podría aplicar cargos por el uso de datos. Ponte en contacto con tu proveedor para obtener más detalles. ______________________________________________________________ Si tienes algún comentario o pregunta, ve a WhatsApp > Ajustes > Ayuda > Contáctanos. Condiciones del servicio: https://www.whatsapp.com/legal/terms-of-service Más información sobre la mensajería privada: https://www.whatsapp.com/privacy Más información sobre la seguridad en WhatsApp: https://www.whatsapp.com/security Última actualización 30 ene 2026 Comunicación Seguridad de los datos arrow_forward La seguridad empieza por entender cómo recogen y comparten tus datos los desarrolladores. Las prácticas de privacidad y seguridad de los datos pueden variar en función de tu uso de la aplicación, el territorio donde la uses y tu edad. El desarrollador ha proporcionado esta información y puede actualizarla con el tiempo. No se comparten datos con terceros Más información sobre cómo los desarrolladores declaran lo que comparten Esta aplicación puede recoger estos tipos de datos Ubicación, Información personal y otros 5 Los datos están cifrados durante el tránsito Puedes solicitar que se eliminen los datos Ver detalles Valoraciones y reseñas phone_androidTeléfono watchReloj laptopChromebook tablet_androidTablet 4,6 218 M reseñas 5 4 3 2 1 Martín González Herrera Marcar como inapropiada 31 de diciembre de 2025 Quizá mucha gente ignore mi comentario, pero para mí es una excelente app para mantenerse en contacto con otras personas. Me gusta bastante, aunque hay cosas que podrían mejorar. Una es que la descripción del contacto tenga duración limitada; sería mejor que pueda quedar permanente o eliminar ese límite. También sugiero que haya estados solo para “mejores amigos”, como en Instagram, y otros visibles para todos. 1.134 personas han valorado esta reseña como útil Oscar Estrada López Marcar como inapropiada Mostrar historial de reseñas 7 de enero de 2026 El filtro de selección de contenido multimedia es una basura, empeoraron algo que estaba bien, ahora se ve feo y es horrible de usar, es mucho más fácil y rápido compartir una imagen desde la propia galería, que desde la aplicación por su horrible filtro de contenido multimedia, además llevo 1 mes con un bug de mis contactos fijados, básicamente uno de esos contactos que intenté fijar, ahora ya no puedo desfijarlo, aparece sin la marca, pero está fijado y no puedo fijar a más de 2 por el bug 😡 5.568 personas han valorado esta reseña como útil diana lanzziano Marcar como inapropiada Mostrar historial de reseñas 25 de noviembre de 2025 a pesar de que la utilizó a diario tiene tantas fallas que no sé por dónde empezar. hay una opción para que escuches los audios y que nadie más pueda por medio de ponértelo en la oreja pero cuando son muchos audios y cambian entre uno y el otro te reviento un pito en la oreja y es lo más desagradable. para guardar los audios y utilizarlos nuevamente en otras oportunidades es demasiado complicado encontrarlos en las carpetas cómo si pretendieran que uno fuese un ingeniero de sistemas para encon 2.763 personas han valorado esta reseña como útil Novedades • Ahora puedes añadir una etiqueta de miembro personalizada para que todos conozcan tu rol en el chat en grupo. Abre el chat en grupo, toca el nombre del grupo y desplázate a la lista de miembros. Toca Añadir etiqueta de miembro y escribe tu rol para mostrar a la gente quién eres o cómo te conocen en este grupo. Estas funciones se lanzarán las próximas semanas. Gracias por usar WhatsApp."
}