{
  "url": "https://www.clinicaladvisor.com/features/np-profile-gina-a-friel-dnp-rn-crnp-pc-creates-screening-tool-for-childhood-obesity/",
  "title": "Dr Gina Friel Creates Screening Process for Childhood Obesity",
  "text": "Gina A. Friel, DNP, CRNP-PC, is a pediatric nurse practitioner at Annapolis Pediatrics, a large primary care pediatric practice in Annapolis, Maryland. Dr Friel has a special interest in children with overweight and obesity and fostering healthy lifestyle habits in patients of all ages. Dr Friel’s research focuses on patients with overweight and obesity, food insecurity, and efforts to improve human health and wellbeing, diet quality, and social equity. She is also interested in the intersection of how environmental exposures and climate change challenges affect health, the engagement of people, communities, and diverse groups. This passion stems, in part, from living on the shores of the Chesapeake Bay, where she is witness to the vulnerabilities pediatric patients and families face related to climate change. Q: Who was your mentor(s) in the NP field? Dr Friel: I have had so many fabulous mentors throughout my career in nursing. Each one of them has guided me with their knowledge, patience, boundless energy, clinical, and professional expertise during different phases of navigating this journey. Roseanne Thompson, CRNP, Joan Green, CRNP, Catherine Haut, DNP, CRNP, Denise Gruccio-Paolucci, DNP, CRNP, and Karen Duderstadt, PhD, CRNP, are amazing mentors with whom I have deep admiration and gratitude for their continued support, guidance, and friendship. Q: What unique projects have you started to advance your patients’ health? Dr Friel: My Doctor of Nursing Practice project implemented a screening process to identify patients and families with food insecurity utilizing the Hunger Vital Sign screening tool in our primary care setting. This screening tool has enabled providers to assist our patients and families in obtaining critical resources to aid with food, water, electricity, and transportation needs on both a federal and local level. Screening and referring for food insecurity needs to be a standardized process in the primary care setting to support overall physical health, mental health, and well-being. Table. Hunger Vital Signa Source: Hager ER, Quigg AM, Black MM, et al. Development and validity of a 2-item screen to identify families at risk for food insecurity. Pediatrics. 2010;126(1):e26-32. doi:10.1542/peds.2009-314 Obesity prevention and treatment strategies must take food insecurity into consideration. The identification and management of food insecurity strategically positions providers in efforts to meet the challenges of children with overweight and obesity promoting timely, effective, patient-centered care in pediatric patients and their families. Patients and families need more than their providers giving them information on food and how to eat better. In the trusted environment of the primary care setting, providers must remain diligent in continuing a conversation regarding available resources for food insecurity at the local and national level and encourage families to leverage available resources. Q: What can you tell us about your fellowship at Columbia University pertaining to climate change and health education? Dr Friel: We are a generation of health professionals that has never been trained in the effects of climate on health. Climate change is a health issue that affects morbidity, mortality, and the ability to deliver health care and support healthy living. As the first nursing fellow with The Global Consortium on Climate and Health Education (GCCHE) at the Columbia University’s Mailman School of Public Health, I joined a team of health professionals throughout the world working to train, prevent, reduce, and respond to the health impacts of climate change. The focus of this work is to empower this generation and the next generation of nurses and health care professionals to become knowledgeable advocates and collaborators regarding the effects of climate change on health with a special emphasis on the most vulnerable populations, especially children. One team within the Global Consortium has worked to create an evidence-based expert repository of resources to support climate and health education for the medical community. The Climate Resources for Health Education (CRHE) are available at https://climatehealthed.org. My task is to create a team of nurses to develop a similar expert-reviewed repository of resources while aiming to address the nuances of nursing education to amplify the work currently being done in nursing institutions/workplace by creating a high-quality, evidence-based, central resource hub for faculty, students, and nursing professionals to be accessible globally. The Global Nurses Working Group, which I am leading, is an amazing team of nurses, nurse practitioners, Doctor of Nursing Practice (DNP), and PhDs from all over the world including Australia, Canada, Italy, United Kingdom, and the United States. We have joined together in a collaborative effort to develop and to expand the existing Climate Resources for Health Education. Stay tuned for the expanding repository of educational resources to support a climate-ready nursing health sector. Q: Can you give us an update on the food insecurity screening program you implemented in your practice last year? Dr Friel: Since implementing the Hunger Vital Sign screening tool, we have identified 105 patients and 79 families in our practice with food insecurity. Each family has been referred to the Maryland Hunger Solutions non-profit organization. This organization assists patients and families by connecting them with federal resources such as the Supplemental Nutrition Assistance Program (SNAP). If a family does not qualify for federal assistance, then they can be connected with available local resources. Maryland Hunger Solutions can also assist patients and families with resources to obtain assistance with transportation, electricity bills, water bills, and new this year, assistance with broadband for internet access. Having access to the internet is crucial for patients and families. There are resources that are available and we’re connecting our patients and families with those resources. This also connects to climate change because changing climate directly and indirectly affects the health of children, who are the most vulnerable population. For example, droughts, wildfires, and extreme heat not only can affect respiratory health, mental health and amplify the risk of infectious diseases, but can also affect the nutritional quality and quantity of food. Extreme heat, droughts, and wildfires pose challenges for farmers working in extreme conditions and it is important to understand how these variables can affect them and the food they are growing, which in turn further impacts our food security or insecurity. Ultimately the interactions of climate change, undernutrition, overnutrition, and food security are complex in nature. Q: Is there anything else you would like to tell our readers? Dr Friel: Every day is a gift. Embrace each day and be the best you can be. If you have a blessing, recognize it, share it, and do your best to help others anyway you can. Show kindness to each other and to our planet."
}