{
  "url": "https://denmark.dk/people-and-culture/danish-language",
  "title": "The Danish Language | A Story of History and Identity",
  "text": "The Danish Language: A Story of History and Identity Where did Danish come from? Between 200 and 800 AD there was a shared Nordic language that originated from the Germanic family of languages and was spoken by people across what we now call Denmark, Sweden, and Norway. The first glimpses of this Nordic language were carved in runes on knives, jewellery, and stones, discovered during archaeological excavations of ancient settlements and villages. During the Viking Age, this shared language began to split into different versions. In Denmark, the version that became Danish was part of an eastern dialect, which also included Swedish and parts of southern Norway. Over time, the languages in these areas became more distinct, eventually turning into the separate languages we know today. Even though Danish, Swedish, and Norwegian are now different languages, they still share a lot of similarities because of their shared past. This makes it easier for people in the Nordic countries to understand each other—sometimes with a bit of effort. Did you know When the royal family started speaking Danish For a long time, the royal family and wealthy nobles in Denmark spoke German as their main language. But things started to change during the Reformation (around 1520–1539). The Reformation in Denmark encouraged several institutions, starting with the church, to begin writing in Danish. It was also after the Reformation that the first attempts were made to establish a standard for Danish spelling. This development likely spread to the rest of society, accompanied by a sense of stronger unity within the kingdom’s borders. By the 1700s, people in Denmark began to feel prouder of their country and language, and in 1775, a school reform stated that students should learn to speak and write ‘proper Danish’. This sense of patriotism made Danish more important to everyone, and people started calling it their modersmål, or “mother tongue.” Different dialects of Danish Even though Denmark is a small country, the way people speak Danish can vary a lot depending on where they live. There are many prominent Danish dialects but one of the most prominent and distinct is the one spoken in the south of Jutland. The dialect is called “Sønderjysk” and varies from other Danish dialects not only in pronunciation but also in vocabulary. This is partly because the southernmost part of Jutland has in turns been part of both Germany and Denmark over the course of history. Danish has a tricky sound One thing that makes Danish special is the glottal stop or in Danish “stød”. It is a sound that has a sort of creaky noise. It is a bit like how rolling an “r” in Spanish can be tricky for non-native speakers—it takes practice to get it right! The glottal stop is one reason why Danish can be hard for foreigners to learn. Even some Danes find it confusing because it is not used the same way in every Danish dialect. Why Danes speak many languages Since Danish is a small language that not many people outside of Denmark speak, Danes have always been good at learning other languages. After World War II, English had a big influence on the Danish language - not since the Middle Ages had so many new words from another language been adopted into Danish. Most Danes speak English very well, and many also learn German, French, or Spanish in school. English/Danish phrase book Phrases: Hello! / Hej! My name is / Mit navn er I don't speak Danish / Jeg taler ikke dansk How much does it cost? / Hvad koster det? How are you? / Hvordan går det? Do you speak English? / Taler du engelsk? I come from... / Jeg kommer fra... America / Amerika / USA Brasil / Brasilien China / Kina Egypt / Egypten Germany / Tyskland Indonesia / Indonesien Israel / Israel Italy / Italien Kenya / Kenya Lebanon / Libanon Netherlands / Holland Numbers 1 to 10: One / Én Two / To Three / Tre Four / Fire Five / Fem Six / Seks Seven / Syv Eight / Otte Nine / Ni Ten / Ti Weekdays: Monday / Mandag Tuesday / Tirsdag Wednesday / Onsdag Thursday / Torsdag Friday / Fredag Saturday / Lørdag Sunday / Søndag You may also like - Art Danish literature has international reach Although Danish is not a widely-spoken language – only about 6 million people can speak it – translated versions of Danish literature is popular all over the world. 04.06.2024Read more - CULTURE The history of Denmark Since the end of the last Ice Age - approximately 10,000 BC - people have migrated from the Eastern and Southern parts of Europe to the Northern area we now know to be Denmark. The flat terrain, rich soil, close proximity to water and at times harsh climate, has shaped Danish history and culture ever since.30.05.2018Read more - kingdom of denmark One of the world's oldest monarchies The Danish monarchy is one of the oldest in the world. King Frederik X's heritage can be traced back more than a thousand years to a king believed to be born around year 900. 06.03.2024Read more"
}