{
  "url": "https://forums.terraria.org/index.php?threads/this-is-how-you-actually-maximize-the-terra-blade.142904/",
  "title": "This is how you actually maximize the Terra Blade | Terraria Community Forums",
  "text": "TheFlyingSoda Terrarian Overview The Terra Blade is one of, if not the most iconic weapons in the entire game. It's a weapon that's favored by most players for its visuals and mechanics. What quite a lot of people may not realize, however, is how it plays in the meta. There's a chance that even some of you browsing the forums wouldn't know much about the full potential of the weapon. That's why I'm here. In this discussion, I'll explain to you how you can use the weapon to full advantage, both in post-Plantera and in post-Golem. There's not much to say in the intro, let's get into it. The Basics of the Terra Blade Before I get into the loadouts, I should first explain the basics. The Terra Blade is a projectile sword that swings in a big wave alongside shooting it. Prior to Labor of Love, it used to shoot a sword beam as well as having stats consisting of 115 damage (95 prior to 1.4 and 88 in Legacy), 6.5 knockback, 4% critical chance, and 14 (16 both prior to 1.4 and in Legacy). Each beam only pierces up to 3 enemies and all beams that are shot from the blade are only affected by use time, not use animation. In this version, however, it has 85 damage and 18 use time. Both knockback and crit chance are the same. While the stats are nerfed, it makes up for it by having it shoot a larger projectile that pierces more enemies, although it loses 25% damage upon hitting the first enemy, and both use time and use animation are linked together in this weapon. Use time and use animation are entirely different beasts. The former affects how the sword shoots projectiles and any melee speed boost except weapon prefixes won't affect it. This likewise goes to mining speed. The latter affects how fast you swing your sword and all melee speed boosts will affect it regardless. The Terra Blade has both of these mechanics merged into one uniquely to itself. The key thing to note, however, is that it only gains 75% of melee speed buffs as opposed to the usual 100% like almost all other melee weapons. You may think that with stats like these, the Terra Blade would be a decent or even mediocre weapon, right? To that I answer: wrong. The Terra Blade is far more potent and versatile than you might realize, and this is where we get to a bigger picture. Loadouts (Post-Plantera) I elected to split the loadout choices into 2 stages because, although you can technically do the same thing as the post-Golem one which we will get into later, realistically speaking, there aren't many options where you can go whole-hog on melee speed benefits. Yes, the best way to boost the Terra Blade is to NOT shove all your efficiency credits on melee speed, but rather, to find a smoother balance between damage and speed. So for post-Plantera, the max melee speed you want to cap is 81%. The reason for that is that it gives the weapon a 9 use time, and that number gives the Terra Blade the most sustainable hits in this available stage. To achieve that, you'll need a Hallowed Helmet, a Berserker's Glove, a Mechanical Glove, a Fire Gauntlet, a Moon Stone, and buffs consisting of Ale and Exquisitely Stuffed, with the latter being preferred with bacons from pigronatas. Two of your accessories will be reforged to Violent and the rest will go to Menacing. You may lose out on a few of those benefits during the day, but realistically speaking, fighting bosses during the night is a far more appropriate decision. Loadouts (Post-Golem) If you think the Terra Blade is already great in post-Plantera, that is nothing compared to what it is in post-Golem. The best number to achieve in this stage is 104%. Yup, 104%. This number gives the Terra Blade a use time of 8 and it's surprisingly super effective. For the loadouts in this stage, same gravy, different fried chicken. The buffs remain the same but now, instead of using 3 gloves, you only need a Mechanical Glove, a Fire Gauntlet, and a Celestial Shell. This is because your main armor of choice, the Beetle Armor with the Scale Mail, greatly buffs melee speed alongside melee damage. You also only need 2 accessories reforged to Violent (1 during the night due to the Moon Charm effect) while the rest will be Menacing. Again, this is very optimal. Not only does this number give more room for more damage boosts, but also more mobility-based accessories, making this very efficient for bosses. And as for events, you can switch the wings, Ninja Gear, and Insignia into more damage boosts, making the Terra Blade even stronger than it already is, regardless of stage. These loadouts make the Terra Blade easily the most versatile weapon in the late game barring Vampire Knives and Razorblade Typhoon while also arguably being amongst the strongest. Conclusion And... that's it. That's how you max out the Terra Blade in both stages in the late game. I'm aware that I'm not perfect with how I tackle these things so I'm open to any criticism. I'm also aware that this isn't for everybody since everyone has their own ways of playing the game, given that Terraria is a sandbox game and not an RPG or something like that. But if you care about exploring more of the meta, especially when doing a melee playthrough, I highly recommend you give these a try because I promise you, they're a game-changer, especially in post-Golem. The Terra Blade is one of, if not the most iconic weapons in the entire game. It's a weapon that's favored by most players for its visuals and mechanics. What quite a lot of people may not realize, however, is how it plays in the meta. There's a chance that even some of you browsing the forums wouldn't know much about the full potential of the weapon. That's why I'm here. In this discussion, I'll explain to you how you can use the weapon to full advantage, both in post-Plantera and in post-Golem. There's not much to say in the intro, let's get into it. The Basics of the Terra Blade Before I get into the loadouts, I should first explain the basics. The Terra Blade is a projectile sword that swings in a big wave alongside shooting it. Prior to Labor of Love, it used to shoot a sword beam as well as having stats consisting of 115 damage (95 prior to 1.4 and 88 in Legacy), 6.5 knockback, 4% critical chance, and 14 (16 both prior to 1.4 and in Legacy). Each beam only pierces up to 3 enemies and all beams that are shot from the blade are only affected by use time, not use animation. In this version, however, it has 85 damage and 18 use time. Both knockback and crit chance are the same. While the stats are nerfed, it makes up for it by having it shoot a larger projectile that pierces more enemies, although it loses 25% damage upon hitting the first enemy, and both use time and use animation are linked together in this weapon. Use time and use animation are entirely different beasts. The former affects how the sword shoots projectiles and any melee speed boost except weapon prefixes won't affect it. This likewise goes to mining speed. The latter affects how fast you swing your sword and all melee speed boosts will affect it regardless. The Terra Blade has both of these mechanics merged into one uniquely to itself. The key thing to note, however, is that it only gains 75% of melee speed buffs as opposed to the usual 100% like almost all other melee weapons. You may think that with stats like these, the Terra Blade would be a decent or even mediocre weapon, right? To that I answer: wrong. The Terra Blade is far more potent and versatile than you might realize, and this is where we get to a bigger picture. Loadouts (Post-Plantera) I elected to split the loadout choices into 2 stages because, although you can technically do the same thing as the post-Golem one which we will get into later, realistically speaking, there aren't many options where you can go whole-hog on melee speed benefits. Yes, the best way to boost the Terra Blade is to NOT shove all your efficiency credits on melee speed, but rather, to find a smoother balance between damage and speed. So for post-Plantera, the max melee speed you want to cap is 81%. The reason for that is that it gives the weapon a 9 use time, and that number gives the Terra Blade the most sustainable hits in this available stage. To achieve that, you'll need a Hallowed Helmet, a Berserker's Glove, a Mechanical Glove, a Fire Gauntlet, a Moon Stone, and buffs consisting of Ale and Exquisitely Stuffed, with the latter being preferred with bacons from pigronatas. Two of your accessories will be reforged to Violent and the rest will go to Menacing. You may lose out on a few of those benefits during the day, but realistically speaking, fighting bosses during the night is a far more appropriate decision. Loadouts (Post-Golem) If you think the Terra Blade is already great in post-Plantera, that is nothing compared to what it is in post-Golem. The best number to achieve in this stage is 104%. Yup, 104%. This number gives the Terra Blade a use time of 8 and it's surprisingly super effective. For the loadouts in this stage, same gravy, different fried chicken. The buffs remain the same but now, instead of using 3 gloves, you only need a Mechanical Glove, a Fire Gauntlet, and a Celestial Shell. This is because your main armor of choice, the Beetle Armor with the Scale Mail, greatly buffs melee speed alongside melee damage. You also only need 2 accessories reforged to Violent (1 during the night due to the Moon Charm effect) while the rest will be Menacing. Again, this is very optimal. Not only does this number give more room for more damage boosts, but also more mobility-based accessories, making this very efficient for bosses. And as for events, you can switch the wings, Ninja Gear, and Insignia into more damage boosts, making the Terra Blade even stronger than it already is, regardless of stage. These loadouts make the Terra Blade easily the most versatile weapon in the late game barring Vampire Knives and Razorblade Typhoon while also arguably being amongst the strongest. Conclusion And... that's it. That's how you max out the Terra Blade in both stages in the late game. I'm aware that I'm not perfect with how I tackle these things so I'm open to any criticism. I'm also aware that this isn't for everybody since everyone has their own ways of playing the game, given that Terraria is a sandbox game and not an RPG or something like that. But if you care about exploring more of the meta, especially when doing a melee playthrough, I highly recommend you give these a try because I promise you, they're a game-changer, especially in post-Golem."
}