{
  "url": "https://www.iprima.cz/",
  "title": "prima+ | sledujte filmy, seriály a pořady TV Prima na Prima plus",
  "text": "prima+ Každé úterý a čtvrtek Nový rodinný seriál, který každé úterý a čtvrtek uvidíte na Primě a v předpremiéře na prima+. V městečku Polabí se všichni znají. I když nikdo z našich hrdinů nemá ideální život a ani ideální rodinu, všichni se snaží žít nejlépe, jak umí. Jedné noci se ale vše změní. Je zavražděna mladá dívka, kterou lidé znali od narození. Seriál ukazuje, jak kriminální čin ovlivní přátelství, partnerské vztahy i sousedské soužití. Hrají: J. Matoušková, S. Rašilov, V. Vydra, M. Etzler, V. Cibulková, M. Písařík, T. S. Pšenička, J. Vyorálek, J. Hampl 41 epizod Novinka Padesátiletý manažer Marek navenek žije úspěšným životem rozděleným mezi Bratislavou a Brnem. Ve skutečnosti však žije několik pečlivě utajovaných paralelních vztahů a léta buduje složitou síť lží. Když se jeho oddělené světy začnou nebezpečně přibližovat, dosavadní jistoty se začnou hroutit... Slovenský seriál (2024). Hrají M. Kral, S. Norisová, J. Schneiderová, D. Nesvačilová a další 8 epizod Novinka NOVÉ DÍLY 11.2. Ray Donovan pracuje pro velkou advokátní kancelář, která zastupuje bohaté a slavné osobnosti v Los Angeles. Při své práci se nebojí použít násilí, úplatky a vyhrožování. Potom, co je jeho otec Mickey, známý gangster, propuštěn z vězení, staré křivdy vyplouvají na povrch a Rayovi se pomalu začne rozpadat život… Americký kriminální seriál (2013). Hrají L. Schreiber, J. Voight, P. Malcomsonová, E. Marsan a další 6 epizod Reese Witherspoon je typická blondýnka. Rozhodne se znovu získat srdce svého milého, který jí dal košem. Neváhá proto začít studovat na Harvardu jako on, jen s trochu odlišným přístupem... Americká komedie (2001). Dále hrají L. Wilson, M. Davis, S. Blairová a další. Režie R. Luketic 93 min•USA Každou středu Seriál Kamarádi sleduje osudy tří nejlepších přátel z dětství Veroniky, Petra a Olivera, kteří společně vyrostli v malebné vesnici jménem Stráně. I přes to, že se rozutekli do světa a začali žít své životy, přátelství jim zůstalo. Po letech se vracejí do své rodné vesnice, kterou se rozhodli oživit. Rodinný seriál 2024. Hrají A. Chocholatá, D. Gránský, J. Komínek, P. Děrgel, A. Dvořáková, M. Preissová, P. Řezníček, R. Řandová, I. Korolová, D. Syslová, J. Houf. Režie P. Zahrádka. 84 epizod Brzy třicetiletá Julie stále hledá své místo ve světě a experimentuje, zatímco její starší přítel Aksel by se rád usadil a začal novou životní etapu. Věci se zkomplikují, když zvídavá Julie pronikne na večírek, na kterém potká mladého a okouzlujícího Eivinda... Film na pomezí dramatu a komedie vypráví vtipně, pravdivě a s citem o vztazích a životě v době, kdy můžeme mít téměř nekonečné možnosti, a přesto si připadat jako nejhorší člověk na světě. 124 min•DÁNSKO, FRANCIE Kriminální minisérie vypráví o renomovaném kardiochirurgovi MUDr. Hartovi, jehož život se zhroutí poté, co je policií považován za hledaného sériového vraha, kterému říkají Noční operatér. V závodě s časem a pod tlakem senzacechtivých médií je jeho jedinou šancí, jak dokázat svou nevinu, návrat na operační sál. 4 epizody Každý pátek Seriál Zrození alchymistky nás zavede do tajemné školy alchymistů, kde se hlavní hrdinka, dvanáctiletá Ariana, postupně učí tomuto magickému umění. Současně také pátrá po svém původu a snaží se zjistit, kdo jsou její rodiče. 3 epizody Když Kristýna zjistí, že ji podvádí přítel, rozhodne se vzít život do vlastních rukou. Ačkoli ji od velkých změn odrazují rodiče, kamarádka Tamara ji podporuje, aby se neohlížela a žila podle sebe. Když už chce Kristýna dát starému životu sbohem, potká charismatického Tomáše. Mohl by on být její pravou láskou? Česká romantická komedie (2025). Hrají M. Babišová, A. Mišík, K. Bartoš, M. Šteindler, J. Sedláčková a další. Režie F. Oberfalcer 90 min•ČR Vstupte do světa Zrádců Doporučené filmy Seriálové a filmové tipy Kinoboxu Vybrané seriály Ponořte se do našeho seriálového světa. Připravujeme Žánry Prima+ ORIGINALS Prima pořady To nejlepší z Viaplay Bez reklam s prima+ PREMIUM Reklama Znáte z České televize Zpravodajství Nejaktuálnější zprávy z domova i ze světa Zahraniční seriály České a slovenské filmy Zahraniční filmy Turecké seriály Kriminálky Vrahem nemusí být jenom zahradník. Romantické filmy Reality Show Prima+ ORIGINALS Skutečné zločiny Bez reklam s prima+ PREMIUM Reklama COOLtovní podívaná Animované seriály, které má každý rád Filmy na MAX Bez reklam s prima+ PREMIUM Reklama"
}