{
  "url": "https://westseattleblog.com/2025/06/west-seattle-saturday-37-options/",
  "title": "West Seattle Blog… | WEST SEATTLE SATURDAY: 37 options!",
  "text": "(Photo by Theresa Arbow-O’Connor) Our list of West Seattle happenings begins with today’s two biggest events: MORGAN JUNCTION COMMUNITY FESTIVAL: The Morgan Community Association presents this festival, 10 am-2 pm in and around Morgan Junction Park (west side of California north of Fauntleroy Way), with free entertainment (see the schedule here), kids’ activities, local organizations and businesses (see the lineups here) – four hours of free fun to celebrate your community! ‘NO KINGS’ DEMONSTRATIONS: While the biggest Seattle gathering is on Capitol Hill, and local resistance group West Seattle Indivisible plans to travel there, several small rallies have been announced around West Seattle – here’s the list we published last night, also including rallying points for those taking Metro. Here’s what else we have for today/tonight, mostly from the WSB West Seattle Event Calendar: GAME OF SHROOMS: Up for a scavenger hunt? West Seattle’s own Potterings has hidden pottery mushrooms around the peninsula for you to find, as explained here, starting today. SATURDAY GROUP RUN: Meet at West Seattle Runner (2743 California SW; WSB sponsor) at 8 am for the free weekly group run. WEST SEATTLE BRAKE SERVICE SALE: As previewed here, moving/closure sale for contents of the longtime business at 4464 37th SW, 9 am-2 pm today (and tomorrow). FREE PRENATAL FITNESS CLASS: This morning at the beach: At 9:00 am, FIT4BABY West Seattle in collaboration with Prepare the Nest is holding a free prenatal fitness class open to anyone wanting to move their body during pregnancy. The class will take place at the Alki Statue of Liberty and welcomes mothers at any stage of pregnancy! Immediately following the class will be a short conversation with Birth Doula Bri Music from Prepare the Nest to discuss the benefits of having a doula present at birth and answer any questions people might have. Register here. (61st/Alki) INTRODUCTORY WALK: First of two sequential weekly walking events – meeting at the same spot, 47th/Fauntleroy, first at 9:30 am for a flat-terrain 1-mile walk. WALKING FOR WELL-BEING: That’s followed immediately by this walk in which you can participate regardless of whether you were on the introductory stroll. Meet at 47th/Fauntleroy. DELRIDGE FARMERS’ MARKET: 10 am-2 pm, Saturdays through October, at Hope Academy in South Delridge (9421 18th SW). Fresh produce, cooked-on-site food, body-care products, more. MASTER GARDENERS: They’re ready to answer your questions! Saturdays this spring and summer, they’re at The Home Depot (7345 Delridge Way SW), 10 am-2 pm. MORNING MUSIC AT THE COFFEEHOUSE: 10:30 am-noon at C & P Coffee (5612 California SW; WSB sponsor), Marco de Carvalho and Friends perform. Info about Marco’s music is here. FREE WRITING GROUP: 10:30 am – Canceled again, back June 28. WEST SEATTLE BOOK CLUB: 10:30 am-12:30 pm, pop-up silent-reading event at West Seattle (Admiral) Library (2306 42nd SW). ALKI HISTORY WALKING TOUR: Meet at 11 am at Log House Museum (61st/Stevens), after registering here. Suggested donation $15. SPRAYPARK SEASON CONTINUES: Highland Park Spraypark (1100 SW Cloverdale) continues daily operations today, 11 am-8 pm. CHIEF SEALTH IHS STUDENT-ORGANIZED CAR SHOW: 11 am-4 pm in the school parking lot, first one ever! (2600 SW Thistle) EMERALD CITY ROMANCE WRITERS: Author and reader event 11 am-5 pm at South Seattle College‘s Brockey Center (6000 16th SW), as previewed here! Meet your fave love-story-teller, discover locally based writers you haven’t read yet, explore romance-related vendors, more. FAMILY READING TIME: At Paper Boat Booksellers, 11 am family reading time. (4522 California SW) SIXTH WEEKEND FOR COLMAN POOL: The heated salt-water outdoor pool at Lincoln Park (8011 Fauntleroy Way SW) is open today to start the final of six preseason weekends before its 7-day-a-week season begins next week, noon-7 pm, with four hour-and-a-half swim sessions, each half lap swimming and half open swim – see the schedule here. GEORGETOWN CARNIVAL: Our neighbors to the northeast invite you to come on over, noon-10 pm, Airport Way S between Corson Ave & Bailey St. for “all kinds of quirky fun.” Details in our calendar listing. LOG HOUSE MUSEUM OPEN: Explore the present and past at the home of West Seattle history, open for your visit, noon-2 pm (closing early today) – see the exhibit about the West Duwamish Greenbelt! (61st/Stevens) VIETNAMESE CULTURAL CENTER OPEN: The center is open to visitors noon-3 pm, as explained here. (2236 SW Orchard) VISCON CELLARS TASTING ROOM/WINE BAR: Tasting room open – wine by the glass or bottle – 1-6 pm at Viscon Cellars (5910 California SW; WSB sponsor). NORTHWEST WINE ACADEMY TASTING ROOM, WINE BAR, STORE: On the north end of the South Seattle College (6000 16th SW; WSB sponsor) campus: The Northwest Wine Academy Tasting Room, Wine Bar and Retail Store are open Thursday-Saturday from 1-6 pm. Come taste and purchase our student-produced wine! The Northwest Wine Academy features a large tasting room and retail store. While tasting one of our current releases, you can you may request a tour of our barrel room and bottling area. Come support our student winemakers and join us for a student tasting. LIVE AT KENYON HALL: 1:30 pm matinee show for the Pride edition of Kenyon Hall Cabaret – get tickets here. (7904 35th SW) NORTHWEST FIRELIGHT CHORALE: In concert, 2 pm at St. John the Baptist Episcopal Church (3050 California SW), info and ticket link in our calendar listing. HIGH SCHOOL WATER POLO CLINIC: 3 pm with the West Seattle HS Girls’ Water Polo team at Southwest Pool (2801 SW Thistle) – signup info is in our calendar listing. FREE MASSAGE: Walk into Nepenthe (9447 35th SW) 3-5 pm for short, specific free massage. ROLLER DERBY: Rainier Roller Riot bout “The Pack Is Queer,” 5:30 pm at Southgate Roller Rink (9646 17th SW, White Center). THE BREWS BROTHERS: Acoustic trio live at C & P Coffee (5612 California SW; WSB sponsor), 6-8 pm, no cover, all ages. DUB SEA FISH STICKS: 6:05 pm home game vs. the Seattle Blackfins at Steve Cox Memorial Park‘s Mel Olson Stadium. (1321 SW 102nd, White Center). Go here for tickets. ONE-ACT PLAY: Chief Sealth Drama student-directed production, “The Angel Intrudes,” 6:15 pm. Tickets $2. (2600 SW Thistle) LIVE AT EASY STREET RECORDS: Brittany Davis album-release show for “Black Thunder,” 7 pm at Easy Street Records (4559 California SW), free, all ages. LIVE AT THE SKYLARK: Mountain Holler, The Flameglo, Oscillatina at The Skylark (3803 Delridge Way SW), doors at 7 pm, music at 8 pm, $10 cover, all ages. REVELRY ROOM DJ: Saturday spinning starts at 9 pm – tonight it’s Soul Focus FM at Revelry Room. (4547 California SW). DANCE! Monthly Machine Learning night at The Lumber Yard in White Center, 9 pm-2 am. (9630 16th SW) KARAOKE AT TALARICO’S: Up for Saturday night singing? 10 pm karaoke at Talarico’s Pizzeria. (4718 California SW) Got a West Seattle event coming up? If community members are welcome, your event is welcome on our calendar! Please email info to westseattleblog@gmail.com – thank you!"
}