{
  "url": "https://www.city-data.com/forum/health-insurance/617485-west-coast-folks-your-opinion-where.html",
  "title": "West Coast Folks, in your opinion, where is best to live if you have Kaiser Medical Insurance and a little arthritus (plan, hospital) - Health Insurance -Private Insurance, Medicare, Medicaid, Military, COBRA - City-Data Forum",
  "text": "04-10-2009, 01:41 PM 41 posts, read 154,977 times Reputation: 25 My Mom is going to retire in about a year. She currently lives in Northern California. For the sake of our post a little information: 1. My Mom has a little arthritis but in very good health otherwise. 2. She is recently divorced and would like to make a few friends to go to listen to classical concerts, dinner once a month or so. She is considering Portland, but not sure about the weather. She wants a city with a little culture. Maybe some sunshine, Ocean too? Who out there has some advice for us? My mom is open to ideas but needs to stay close to a Kaiser medical center (below is a list of cities) Thank you!! California - Northern Georgia Hawaii Maryland/Virginia/Washington D.C. Ohio Oregon/Washington Last edited by lobster5757; 04-10-2009 at 01:42 PM .. Reason: We are open to All advice, not just West coast. Thank you 04-11-2009, 11:50 AM Location: We_tside PNW (Columbia Gorge) / CO / SA TX / Thailand 36,821 posts, read 64,169,457 times Reputation: 50413 if cost is no object, it is hard to beat SF. (at least they have some sun) for Portland, consider SE area, and there is a KP hospital and medical center in Clackamas. There is good public transit access to downtown. Woodstock area would be handy, and close to Reed College for many concerts and venues. I attend the free rehearsals during Chamber Music NW (July), Chamber Music Northwest and then walk across the street and enjoy the Rhodie garden Portland Parks & Recreation :: Crystal Springs Rhododendron Garden Portland does have a very EZ airport, I often use the SWA $89 fares to seek sun. There are several other nice areas in SE (Sellwood, westmoreland, Johnson Creek) (spectacular ocean views are 1 hr away, Columbia gorge is 30 min) rain / clouds = 200+ days / yr. It doesn't look like Kaiser is available in the dry area of PNW, so Nor CA is the only choice. You might consider getting her closer to family, as that will be important for her transition to single life. 04-15-2009, 03:11 PM 5,138 posts, read 9,323,018 times Reputation: 5262 what about San Diego? 04-24-2009, 03:35 PM 41 posts, read 154,977 times Reputation: 25 No, thank you on San Diego Quote: Originally Posted by loveautumn what about San Diego? I just moved from San Diego. Dirty, overpriced and not a friendly city. Thanks though! 04-28-2009, 01:01 AM Location: Redondo Beach, California 71 posts, read 387,806 times Reputation: 42 Check the premium! All Kaiser premium is not equal. Retired from State of CA I paid no premium out of pocket for Kaiser. If I move to any other state I pay hundreds per month for Kaiser out of state. I had to change to another plan entirely when I moved to Oregon because I could not afford that. If your mother has the medicare option (I'm too young for it) then that may cancel that problem out, I don't know. But check to make sure before making a decision. Kaiser is in very limited geographical areas of each state also so be sure you are within a Kaiser area before making a decision on a state with Kaiser. I really miss Kaiser in So California, they took excellent care of me. This whole PPO thing is a nightmare to me. But the living is better in Oregon for me so that's the trade off. Good luck to your mom. 04-28-2009, 07:59 PM 5,089 posts, read 16,008,949 times Reputation: 7027 If your mother has arthritis which is bothersome, then you should really consider a dry, low humidity area to live. You have ruled out San Diego and you have not mentioned Southern California, so I assume you are not interested in these areas. They would be the best areas to live, on the west coast, for arthritis. You have listed other Kaiser Regions but there is also Colorado. Colorado on the eastern slopes of the Rockies has a mild semi-arid climate with very low humidity. Kaiser is in the Denver Metro area with the traditional HMO. In Colorado Springs it operates under the PPO type plan. However, it has introduced, this year, the expansion of the HMO plan which covers Medicare, to Southern Colorado Cities which includes the cities of Pueblo and Canyon City. These cities are even more dry and are in what is called the \"Banana Belt\" because of the very mild weather. It attracts many retirees and have good amenities to support a very good lifestyle. I am a covered by Kaiser under their Senior Advantage Plan, the medicare plan, in the the Denver area and I have severe arthritis. This area is good for my condition and I have been using Kaiser for many decades. Kaiser extends very far out of Denver and includes cities like Broomfield, Longmont, Boulder, Louisville and Lafayette. These cities are often listen as some of the best places to live in the US. In addition, a brand new hospital with with a large Kaiser facility attached, has been built in Lafayette. This facility has all the speciality clinics and is a double of the services provided in Denver. You would not have to go to Denver for any care. Though Denver is a great city to live. Perhaps you should look into Colorado. Livecontent 06-20-2009, 05:32 PM 1 posts, read 7,888 times Reputation: 10 Quote: Originally Posted by lobster5757 My Mom is going to retire in about a year. She currently lives in Northern California. For the sake of our post a little information: 1. My Mom has a little arthritis but in very good health otherwise. 2. She is recently divorced and would like to make a few friends to go to listen to classical concerts, dinner once a month or so. She is considering Portland, but not sure about the weather. She wants a city with a little culture. Maybe some sunshine, Ocean too? Who out there has some advice for us? My mom is open to ideas but needs to stay close to a Kaiser medical center (below is a list of cities) Thank you!! California - Northern Georgia Hawaii Maryland/Virginia/Washington D.C. Ohio Oregon/Washington Don't go to Georgia. Atlanta is the only place they have Kaiser and it's a terrible city. The humidity is very HIGH. I moved to Alabama but am moving back to San Francisco. I too am looking for a town that has low humidity and snow in the winter. I hate the desert so that's out. Good luck 06-20-2009, 07:58 PM Location: Sacramento 14,048 posts, read 28,582,679 times Reputation: 7391 I'd go with Walnut Creek, CA. Best combination of life style and weather, per your requirements. 06-25-2009, 06:28 AM Location: Laguna Beach, California 98 posts, read 407,938 times Reputation: 80 Calif. is just too expensive. I am looking in Kentucky and Tenn, and perhaps North Carolina. If you call your insurance, they will tell you what the premiums will be if you move out of state. Calif. has the best insurance coverage and prices going. Housing and other things will be the trade off....it is very hard if you don't have much money. Please register to post and access all features of our very popular forum. It is free and quick. Over $68,000 in prizes has already been given out to active posters on our forum. Additional giveaways are planned. Detailed information about all U.S. cities, counties, and zip codes on our site: City-data.com ."
}