{
  "url": "https://www.healthcare4ppl.com/physician/pennsylvania/pottsville/manish-k-mishra-1306089222.html",
  "title": "Dr. Manish K Mishra - Internal Medicine, Pottsville PA",
  "text": "Manish K Mishra Dr. Manish K Mishra is an Internal Medicine Specialist in Pottsville, Pennsylvania. He graduated with honors in 2003. Having more than 23 years of diverse experiences, especially in INTERNAL MEDICINE, Dr. Manish K Mishra affiliates with many hospitals including Geisinger Medical Center, Schuylkill Medical Center - South Jackson Street, Lehigh Valley Hospital, St Luke's Miners Memorial Hospital, Geisinger St. Luke's Hospital, cooperates with many other doctors and specialists in many medical groups including Integrated Medical Group, P.c., Phoenix Rehabilitation And Health Services Inc, The Weston Group Inc, Img Nursing Home Care, P.c.. Call Dr. Manish K Mishra on phone number (570) 516-9444 for more information and advice or to book an appointment. Doctor Profile Basics Medical Specialities - INTERNAL MEDICINE Credentials - Doctor of Medicine (MD) Education & Training - Dr. Manish K Mishra attended to a university and then graduated in 2003 NPPES Information - NPI #: 1306089222 - Enumeration Date: Apr 7th, 2009 - Last Update Date: Jan 12th, 2017 Medical Licenses Dr. Manish K Mishra has primarily specialised in Internal Medicine for over 23 years. Affiliated Hospitals Medical Group Practices Practice Location Suuite 5a Pottsville, Pennsylvania 17901-3849 Map and Directions Phone: (570) 516-9444 Fax: (570) 728-2360 - Monday - Friday: 8:00 AM - 5:00 PM - Saturday - Sunday: Closed This doctor profile was extracted from the dataset publicized on Jan 29th, 2026 by the Centers for Medicare and Medicaid Services (CMS) and from the corresponded NPI record updated on Jan 12th, 2017 on NPPES website. If you found out anything that is incorrect and want to change it, please follow this Update Data guide. Most Viewed Physicians - Stephen T. Olex 106 S Claude A Lord Blvd, Pottsville - Joseph L Russino 700 E Norwegian St, Pottsville - Carl J Forster 13 S Centre St, Pottsville - Stephen O Slusser 48 Tunnel Rd Suite 104, Pottsville - Lisa M Marsicano 1851 W End Ave, Pottsville - Gary Scheib 307 Mahantongo St, Pottsville - Mohamed Mohame Meeran 100 Schuylkill Medical Plz Ste 206, Pottsville - Barry L Jenkins 420 S Jackson St, Pottsville Nearby Physicians - Syed T. Ibrahim 420 S Jackson St, Pottsville - Mathew Mills 2650 Woodglen Rd, Pottsville - Loretta Mestishen 1311 E Norwegian St, Pottsville - Marylou Rainone 100 Schuylkill Medical Plz Ste 204, Pottsville - Cianna Elizabeth Corbacio 495 N Claude A Lord Blvd, Pottsville - Cassandra Phillips 529 Terry Reiley Way, Pottsville Newly Added Physicians - Mandy L Bixler 48 Tunnel Rd, Pottsville - Stephen O Slusser 48 Tunnel Rd Suite 104, Pottsville - Stephen T. Olex 106 S Claude A Lord Blvd, Pottsville - Gregory J Elberfeld 420 S Jackson St, Pottsville - Kristina M Thornburg 100 Schuylkill Medical Plz, Pottsville - Kay L Hranichny 26 S Centre St, Pottsville"
}