{
  "url": "https://en.wikipedia.org/wiki/D",
  "title": "D - Wikipedia",
  "text": "D D, or d, is the fourth letter of the Latin alphabet, used in the modern English alphabet, the alphabets of other western European languages and others worldwide. Its name in English is dee (pronounced /ˈdiː/ ⓘ), plural dees.[1] History The Semitic letter Dāleth may have developed from the logogram for a fish or a door.[2] There are many different Egyptian hieroglyphs that might have inspired this. In Semitic, Ancient Greek[3] and Latin,[4] the letter represented /d/; in the Etruscan alphabet[5] the letter was archaic but still retained. The equivalent Greek letter is delta, Δ.[3] The minuscule (lower-case) form of 'd' consists of a lower-story left bowl and a stem ascender. It most likely developed by gradual variations on the majuscule (capital) form 'D', and is now composed as a stem with a full lobe to the right. In handwriting, it was common to start the arc to the left of the vertical stroke, resulting in a serif at the top of the arc. This serif was extended while the rest of the letter was reduced, resulting in an angled stroke and loop. The angled stroke slowly developed into a vertical stroke.[6] Use in writing systems English In English, ⟨d⟩ generally represents the voiced alveolar plosive /d/. The letter ⟨d⟩ is the tenth most frequently used in the English language. Other languages In most languages that use the Latin alphabet, ⟨d⟩ generally represents the voiced alveolar or voiced dental plosive /d/. In the Vietnamese alphabet, it represents the sound /z/ in northern dialects or /j/ in southern dialects. In Fijian, it represents a prenasalized stop /ⁿd/.[7] In some languages where voiceless unaspirated stops contrast with voiceless aspirated stops, ⟨d⟩ represents an unaspirated /t/, while ⟨t⟩ represents an aspirated /tʰ/. Examples of such languages include Icelandic, Scottish Gaelic, Navajo and the pinyin transliteration of Mandarin. Other systems In the International Phonetic Alphabet, ⟨d⟩ represents the voiced alveolar plosive /d/. Other uses - In the hexadecimal (base 16) numbering system, D is a number that corresponds to the number 13 in decimal (base 10) counting.[8] - The Roman numeral D represents the number 500.[9] - Unit prefix d, meaning one tenth. - D is the grade below C but above E/F in the school grading system. - D is the international vehicle registration code for Germany (also .de as its top-level domain). - In Cantonese: Because the lack of Unicode CJK support in early computer systems, many Hong Kongers and Singaporeans used the capitalized D to represent 啲 (di1; 'a little').[10] - In the Gregory-Aland system for cataloging Biblical manuscripts, D can refer to documents in the Western text-type tradition, either Codex Bezae or Codex Claromontanus. - d. is the standard abbreviation for the Penny (British pre-decimal coin) (from Latin: denarius) Related characters Descendants and related characters in the Latin alphabet - Ɖ ɖ : African D - Ð ð : Latin letter Eth - D with diacritics: Đ đ Ꟈ ꟈ[11] Ɗ ɗ Ḋ ḋ Ḍ ḍ Ḑ ḑ Ḓ ḓ Ď ď Ḏ ḏ - Phonetic symbols related to D: - Ƌ ƌ : D with topbar - 𝼥: D with mid-height left hook – Used by the British and Foreign Bible Society in the early 20th century for romanization of the Malayalam language.[17] - Ꝺ ꝺ: Insular D is used in various phonetic contexts[18] Ancestors and siblings in other alphabets - 𐤃: Semitic letter Dalet, from which the following symbols originally derive: Derived signs, symbols and abbreviations - ₫: Đồng sign - ⅆ: Unicode symbol for d used as derivative symbol - ∂: the partial derivative symbol, Other representations Computing The Latin letters ⟨D⟩ and ⟨d⟩ have Unicode encodings U+0044 D LATIN CAPITAL LETTER D and U+0064 d LATIN SMALL LETTER D. These are the same code points as those used in ASCII and ISO 8859. There are also precomposed character encodings for ⟨D⟩ and ⟨d⟩ with diacritics, for most of those listed above; the remainder are produced using combining diacritics. Variant forms of the letter have unique code points for specialist use: the alphanumeric symbols set in mathematics and science, plosive sounds in linguistics and halfwidth and fullwidth forms for legacy CJK font compatibility. Other In British Sign Language (BSL), the letter 'd' is indicated by signing with the right hand held with the index and thumb extended and slightly curved, and the tip of the thumb and finger held against the extended index of the left hand. References - ^ \"D\" Oxford English Dictionary, 2nd edition (1989); Merriam-Webster's Third New International Dictionary of the English Language, Unabridged (1993); \"dee\", op. cit. - ^ \"The letter D\". issuu. Archived from the original on 2021-08-29. Retrieved 2021-07-06. - ^ a b \"Definition of DELTA\". www.merriam-webster.com. Retrieved 2022-05-03. - ^ \"Latin Alphabet\" (PDF). Archived (PDF) from the original on 2010-12-26. - ^ Rex Wallace (2008) 𐌆𐌉𐌙 𐌓𐌀𐌔𐌍𐌀 𐌀 Zikh Rasna: A Manual of the Etruscan Language and Inscriptions - ^ \"Introduction to Old English\". The Linguistics Research Center. Retrieved 2022-05-03. - ^ Lynch, John (1998). Pacific languages: an introduction. University of Hawaii Press. p. 97. ISBN 0-8248-1898-9. - ^ \"Hexadecimal Number System | There are Many Ways to Write Numbers\". u.osu.edu. Retrieved 2022-05-20. - ^ Gordon, Arthur E. (1983). Illustrated Introduction to Latin Epigraphy. University of California Press. pp. 44. ISBN 9780520038981. Retrieved 3 October 2015. roman numerals. - ^ \"The Roman Alphabet in Cantonese\". University of Pennsylvania. March 23, 2011. Retrieved 13 September 2023. - ^ Everson, Michael; Lilley, Chris (2019-05-26). \"L2/19-179: Proposal for the addition of four Latin characters for Gaulish\" (PDF). Archived (PDF) from the original on 2019-06-13. - ^ Everson, Michael; et al. (2002-03-20). \"L2/02-141: Uralic Phonetic Alphabet characters for the UCS\" (PDF). Archived (PDF) from the original on 2013-08-19. - ^ Miller, Kirk; Ashby, Michael (2020-11-08). \"L2/20-252R: Unicode request for IPA modifier-letters (a), pulmonic\" (PDF). Archived (PDF) from the original on 2021-07-30. - ^ Cook, Richard; Everson, Michael (2001-09-20). \"L2/01-347: Proposal to add six phonetic characters to the UCS\" (PDF). Archived (PDF) from the original on 2013-08-19. - ^ Constable, Peter (2003-09-30). \"L2/03-174R2: Proposal to Encode Phonetic Symbols with Middle Tilde in the UCS\" (PDF). Archived (PDF) from the original on 2013-08-19. - ^ a b Constable, Peter (2004-04-19). \"L2/04-132 Proposal to add additional phonetic characters to the UCS\" (PDF). Archived (PDF) from the original on 2013-08-19. - ^ Miller, Kirk; Rees, Neil (2021-07-16). \"L2/21-156: Unicode request for legacy Malayalam\" (PDF). Archived (PDF) from the original on 2021-09-07. - ^ Everson, Michael (2006-08-06). \"L2/06-266: Proposal to add Latin letters and a Greek symbol to the UCS\" (PDF). Archived (PDF) from the original on 2013-08-19."
}