{
  "url": "https://www.royalcaribbean.com/cruise-from/baltimore-maryland",
  "title": "Cruises from Baltimore, Maryland | Royal Caribbean Cruises",
  "text": "We've circled the globe and couldn't find any sailings that match your search. View All Cruises We're having trouble retrieving these cruises. View All Results What draws so many people to Baltimore? Perhaps it's the top places to visit in Baltimore the world-famous and historic inner harbor which boasts tall ships and reveals the city's maritime legacy. Or maybe it's the star-shaped Fort McHenry, the birthplace of America's \"Star-Spangled Banner\" anthem. Or maybe it's the world-renowned museums, award-winning restaurants or jazz music scene. Not to mention, the city is a gateway to everywhere from the Northeast and Canada, to the exotic Caribbean islands and Bermuda. Celebrate sports at the Babe Ruth Birthplace Museum, view world's largest collection of art by Henri Matisse at the Baltimore Museum of Art or gaze at the 55 centuries worth of art within the walls of The Walters Art Museum. Whatever you choose to experience during your cruise from Baltimore, you'll surely come to understand why so many return to Charm City. ANCHORED IN ADVENTURE Cruise from Baltimore to a one-of-a-kind escape that has something for every kind of adventurer. Soak up the sun along the turquoise waters of the Bahamas or revel in the southern charm and laid-back coastal culture of Charleston, South Carolina. If you love memory maxing, you’ll love Vision of the Seas® — where you’ll always find plenty of incredible ways to fill your days at sea. Reach new heights on the rock-climbing wall 40 feet above deck. Indulge in gourmet globe-trotting with mouthwatering dishes from Italy to Japan. And applaud dazzling Broadway-style entertainment. Baltimore is your gateway to a thrilling getaway to the tropics. From postcard-perfect beaches at Grand Bahama Island to record-breaking thrills and endless ways to chill at our private destination, Perfect Day at CocoCay. Inner Harbor Downtown Dock Ship, Baltimore, Maryland No visit to Baltimore is complete without exploring the historic Inner Harbor. Step aboard a collection of impressive ships— a Pearl Harbor-era cutter, a 1930s lightship, a sail-powered warship dating back to 1797. Then stroll around brick walkways flanked by chic boutiques, restaurants serving Mid-Atlantic seafood, and photo-worthy views of the water. American Flag Fort McHenry, Baltimore, Maryland Relive the Battle of Baltimore at Fort McHenry, where in 1814, by dawn’s early light, Francis Scott Key wrote the lyrics of The Star-Spangled Banner, the United States’ national anthem. Enter this star-shaped citadel to follow a period costumed guide around the grounds, watch an educational film, and see a replica of the 15-starred American flag. Cruises out of Baltimore facilitate encounters with almost 20,000 sea creatures spanning seven stories of interactive exhibits at the National Aquarium. Widely considered one of the best in America, this mind-boggling aquatic space includes a rooftop rainforest, multistory shark tank and reef recreations that are home to sea turtles, stingrays, bottlenose dolphins, sharks and more. You can’t leave Baltimore without feasting on Chesapeake Bay blue crabs, which are steamed in Old Bay seasoning or served as golden brown cakes. Little Italy’s trattorias serve up pasta, tiramisu and cannoli— and National Bohemian Beer, lovingly nicknamed Natty Boh, is a local staple. Lexington Market is a foodie’s paradise where nearly 100 vendors shuck raw bar fare, plus enjoy deli sandwiches and the famous Berger cookie. Satisfy all your souvenir needs and more at Harborplace, a festival marketplace during your Baltimore cruise. Mount Vernon’s Antique Row houses a string of retailers dating to the 1840s. The Hampden neighborhood is known for indie stores and vintage clothing outfitters— or browse Thames Street in Fells Point for vinyl records, books and trendy clothing."
}