{
  "url": "https://www.primetimer.com/features/love-island-all-stars-belle-accuses-lucinda-of-being-inconsiderate-in-heated-argument",
  "title": "Love Island: All Stars' Belle accuses Lucinda of being inconsiderate in heated argument - PRIMETIMER",
  "text": "Love Island: All Stars alum Belle did not mince her words when calling out Lucinda for her inconsiderate behavior. In the latest episode of the ITV series, released on February 3, 2026, she sat down with Lucinda for a private conversation after their major fallout in the previous episode. During the conversation, she accused Lucinda of disrespecting her and disregarding her feelings by developing a relationship with her partner, Sean, while she was away at Villa USA. “Let me get one thing straight. You’ve not once gave a f**k about my feelings or making me comfortable in this. So, don’t expect that same thing from me, ‘cause that ain’t gonna happen,” Belle said. Although Lucinda apologized for how everything unfolded and attempted to justify her actions with Sean, Belle refused to listen to her reasons. Belle continued to criticize Lucinda for her “s**t behavior,” pointing out that she allegedly smiled at her while heading to the Secret Garden, a private area, with Sean. One thing led to another, and the conversation turned into a heated argument. While Lucinda defended herself and her choices, Belle criticized her for being self-centered. The mood of the Love Island: All Stars villa shifted as soon as Belle called Lucinda for a conversation. The other islanders sitting on the sidelines knew immediately that things would not go down well. Lucinda started the conversation by apologizing to Belle, saying she was “very sorry about this whole situation.” But before she could continue, Belle cut her off, convinced the apology was not sincere. “You’re not sorry,” she added. Regardless, she allowed Lucinda to continue with what she had to say. Lucinda then said that had Belle been in the main villa instead of Villa USA, things wouldn’t have unfolded the way they did. She tried to elaborate her stance by suggesting that Sean had been her “top pick” ever since she entered the villa, but Belle was not convinced. “Don’t agree with that ‘cause I don’t even think you know your top pick ‘cause you’ve said that in the kitchen that it was Ciaran. You just didn’t say that to throw the girls off,” Belle said. She then asked Lucinda, “What’s real?” taking a dig at her fickle feelings and inability to make a choice. Lucinda was not very pleased to hear Belle’s remarks, as she requested that they refrain from starting an argument. But before Lucinda could respond, Belle criticized her inconsiderate behavior, stating that she would not sit and “validate” her actions. She then pointed out that it was unnecessary to laugh at her face while going to the Secret Garden with Sean. Lucinda disagreed with the allegation, but Belle refused to change her stance. Lucinda reached her limit when Belle began to look down on her and her “nice girl” personality. Even after she told Belle that she felt disrespected, Belle continued, clarifying that the two of them would “never be on the same page ever.” Lucinda felt the remarks were unfair and too personal since Belle had only known her for a few days in the villa. But that was not going to stop Belle from speaking her mind. “I don’t need to know you for any longer,” she added. Regardless, Lucinda justified her choices by arguing that she was in the show for herself and to find a compatible partner. Upon hearing that, Belle accused her of only thinking about herself without considering how her actions would make others feel. Belle ended the chat by calling Lucinda’s connection with Sean “fake” and clarifying that she would never be able to see eye to eye with her. Stay tuned for more updates. TOPICS: Love Island: All Stars, Love Island: All Stars Lucinda, Love Island: All Stars Sean Stone, Love Island: All Stars season 3 Belle Hassan"
}