{
  "url": "https://help.hbomax.com/us-en/Answer/Detail/000002554",
  "title": "HBO Max | Find out what to do if your HBO Max provider isn't listed on the Connect Your Provider screen.",
  "text": "My provider isn't listed Here's how to find your provider on the Connect Your Provider screen: - In the search box, type your provider's name. Then, select your provider from the search results. -or- - Below the company logos and search box, scroll down through the list of providers. Do I need to connect my provider? It depends on how you get HBO Max (or HBO): - No: If you subscribed through an app store (Amazon, Apple, Google, Roku, Samsung), HBOMax.com, or already activated HBO Max via Philo or the Disney+, Hulu, HBO Max, Bundle, go back and choose Sign In. Then, sign in with your HBO Max email and password. - Yes: If you get HBO Max with your internet, mobile, or TV package, you need to connect your provider before signing in to HBO Max. Activate HBO Max If you get HBO Max through the Disney+, Hulu, HBO Max Bundle or the Philo Core package you need to activate HBO Max before signing in to HBO Max (instead of connecting your provider). To find out how to activate HBO Max, choose how you get HBO Max: Once you activate HBO Max, you'll sign in using your HBO Max account email and password. Provider Q&A Your provider is who you subscribed through and who bills you for HBO Max (or HBO). For a list of providers, go to HBO Max providers. To leave the Connect Your Provider screen and sign in: - Do one of the following: - Android mobile or HBOMax.com: Choose the HBO Max logo (upper left). - iPhone or iPad: Choose Cancel (top of screen) > Cancel (if needed) > OK. - Choose Sign In. For Comcast, choose the Xfinity logo on the Connect Your Provider screen or type Xfinity in the search box. If you're an active student in campus-provided housing at: Central Connecticut State University University of Southern California Western Connecticut State University Choose Boldyn Networks on the Connect Your Provider screen and then choose your university. If you're an active student in campus-provided housing at: Cal Poly Pomona Cal State Monterey Bay Elon University Fairfield University Fordham University Marist University Missouri State University NYU Rice University San Diego State University Streeme Workspace Texas A&M University Choose University Video Services on the Connect Your Provider screen and then choose your school. Can't connect your provider? If you found your provider and can't connect them, go to Can't connect provider."
}