{
  "url": "https://sports.yahoo.com/nfl/breaking-news/article/steelers-hire-brian-angelichio-as-offensive-coordinator-mike-mccarthy-191300181.html",
  "title": "Steelers hire Brian Angelichio as offensive coordinator - Yahoo Sports",
  "text": "Steelers hire Brian Angelichio as offensive coordinator The Pittsburgh Steelers hired former Minnesota Vikings passing-game coordinator and tight ends coach Brian Angelichio as their next offensive coordinator, the team announced Wednesday. Angelichio’s hiring fills out the main trio of coordinator positions under new Steelers head coach Mike McCarthy. The team hired former Raiders DC Patrick Graham as defensive coordinator and is reportedly expected to hire Danny Crossman as the special teams coordinator. Angelichio, 53, joined the Vikings staff under Kevin O’Connell in 2022, with prior stops with the Cleveland Browns, Tampa Bay Buccaneers, Green Bay Packers and Carolina Panthers. The Vikings ranked in the top six in the league in passing yards and passing touchdowns in three of his four seasons with the team. McCarthy confirmed in his introductory news conference that he would call the plays and “obviously will run the offense,” though Angelichio will hold the official title of offensive coordinator. There are plenty of questions regarding what that offense may look like, however. As veteran Aaron Rodgers hits free agency in the coming month, questions at the quarterback position continue to loom over the franchise, though there is still the possibility he could return in 2026. Rodgers and McCarthy have a long-standing relationship, having been together with the Green Bay Packers from 2006-18. Despite the fact that McCarthy says he “definitely” wants Rodgers back next season, reports have indicated that his hiring wasn’t an attempt to “lure” the veteran quarterback back to the Steelers in free agency. While the quarterback position remains up in the air, the Steelers will have several weapons returning on offense this year, including veteran wideout DK Metcalf, who was acquired in a trade with the Seahawks last season, as well as tight ends Pat Freiermuth and Darnell Washington, and running back Jaylen Warren. The team has also made a concerted effort to rebuild its offensive line in recent years."
}