{
  "url": "https://www.cfodive.com/news/uber-names-new-cfo-robotaxi-av-push-earnings/811344/",
  "title": "Uber taps insider for CFO amid robotaxi push | CFO Dive",
  "text": "Dive Brief: - Uber Technologies VP of strategic finance Balaji Krishnamurthy will step into the role of CFO effective Feb. 16: succeeding finance chief Prashanth Mahendra-Rajah, the rideshare company announced Wednesday along with its Q4 earnings report. - After serving two years as CFO for the San Francisco-based rideshare company, Mahendra-Rajah said during the company’s earnings call Wednesday that he is leaving for another opportunity “where I could serve America and give back to the country that has given me and my family so much,” he said Wednesday. He said the opportunity presented itself over the holidays but did not provide any further details on it. - Following the transition, Mahendra-Rajah will serve as a senior finance advisor and will report to CEO Dara Khosrowshahi until July 1, the company said Wednesday in the filing with the Securities and Exchange Commission. His departure will be “treated as a qualifying termination for purposes of the Company’s Amended and Restated 2019 Executive Severance Plan,” and is not the result of any disagreements relating to financial disclosures or accounting matters, the company said according to the filing. Dive Insight: Under the terms of Uber’s severance agreement, Mahendra-Rajah is entitled to receive benefits that include a lump sum cash payment equal to 12 months of his base salary, his target annual bonus, and 12 months of medical and dental premiums, according to its latest proxy filed in March. That he is departing under such terms and is eligible for the benefits provided by the plan is “a sign that this was an amicable separation, further supported by his ongoing advisory status,” Shawn Cole, president and co-founder of executive search firm Cowen Partners told CFO Dive in an email. “It’s common for companies to treat a negotiated, orderly transition as an involuntary termination without cause for plan purposes, even when the departure is amicable,” Cole said. “It’s a clean way to standardize the economics (severance and any related equity treatment) without implying fault or a dispute.” Regarding the choice of Krishnamurthy as incoming CFO, the move “reads as continuity and investor-messaging discipline,” Cole said. “I wouldn’t expect material changes to the business plan or operating model on the back of this move as it looks like a steady-hand CFO choice for a ‘cash flow plus optionality’ phase, where you protect the core while selectively funding longer-dated initiatives.” The promotion of an insider to the CFO seat could be a way to bring the finance function at Uber “back to a stable state,” Josh Crist, co-managing partner at Crist Kolder told CFO Dive. “Quite honestly, this reads to me like an external CFO was brought in, and that CFO was essentially a ‘tissue reject’ as we call it in our industry,” Crist said of the move. “I’m not sure if this move says anything directly about company strategy, but certainly inserting a known entity into the CFO chair speaks to stabilization.” Krishnamurthy is taking the finance reins as the company focuses more fully on expansion plans for its robotaxi and autonomous vehicle technology — an area where he has been a long-time advocate. Krishnamurthy joined Uber in November 2019 as a senior manager of investor relations, according to his LinkedIn profile, and has served in his current role as VP of strategic finance and investor relations since January 2025. His past roles include an eight-year span as a vice president at Goldman Sachs, and Krishnamurthy has served as a board member for autonomous truck company Waabi since September 2024. As CFO, Krishnamurthy will receive an annual base salary of $600,000 as well as a one-time restricted stock unit award of $5 million, according to the filing. He will also receive an RSU award of approximately $9.4 million subject to both time and performance-based vesting conditions, as well as an option to purchase $3.1 million of common stock. Krishnamurthy will be eligible to participate in Uber’s executive bonus plan as well as its executive severance plan. The company signaled Wednesday i is continuing to marshaling plans to expand its AV technology, Uber reported a 22% year-over-year surge in gross bookings for the quarter ended Dec. 31, and is entering 2026 with “a clear path to becoming the largest facilitator of AV trips in the world,” Khosrowshahi said in a stattement included in its earnings release. The company is aiming to bring its AV offerings — which include partnerships with electric vehicle manufacturer Lucid and autonomous driving technology firm Nuro, among others — to 15 cities by the end of this year, Khosrowshahi said during the earnings call according to a transcript. The rideshare company faces growing competition in the robotaxi and AV space, including from companies such as EV creator Tesla, where such technology has long been a passion project of CEO Elon Musk. CFO Dive previously reported. Kristhnamurthy has noted in previous social media posts that the AV growth curve may be slower than others: though also expressing his belief that AV technology could potentially open up a $1 trillion total addressable market in the U.S. alone for Uber, according to a Feb. 6, 2025 post on X. The incoming CFO reiterated his belief in the technology’s potential during the Wednesday earnings call. By the end of full year 2025, Uber generated approximately $10 billion in free cash flow, a 65% jump YoY: something which “gives us a lot of room to make investments in ensuring that we are advancing our AV strategy and potentially evaluating any selective bolt-on M&A opportunities as they come along,” Krishnamurthy said during the call in response to analyst questions. Though the company reported a jump in gross bookings as well as free cash flow, for the quarter ended Dec. 31, net income attributable to Uber Technologies for the quarter ended Dec. 31 also fell by 96% to $296 million: partially due to a $1.6 billion net headwind related to revaluations of its equity investments, according to its earnings report. Stock fell by approximately 5% following the earnings report and CFO announcement. However, “business continues to perform well with accelerating growth, and it continues to expand profitability margins year-over-year,” according to a William Blair client note written by analysts led by Ralph Schackart. “We believe its AV strategy will continue to evolve and the company’s scale should position it as a global AV competitor going forward.” This story was updated with comments from analysts and additional details."
}