{
  "url": "https://www.isitbadforyou.com/questions/is-dasani-sparkling-water-bad-for-you",
  "title": "Is Dasani Sparkling Water Bad For You? - Here Is Your Answer.",
  "text": "Short answer Dasani sparkling water is bad for you. Carbonation causes a lot of irritation to the gastrointestinal system. Additionally, Dasani is a low-quality water with harmful additives. Recommended Alternative Long answer This “pure” water is essentially tap water purified by the process of reverse osmosis. Aside from the purification process, Dasani contains three additives that are included in order to improve the flavor of the water, including Magnesium Sulfate, Potassium Chloride, and Salt. If you drink an occasional bottle of Dasani, it is unlikely that you will have a severe unhealthy response—though it is always good to know exactly what is hiding in your foods and beverages. In spite of the minor risks, it is wise for pregnant women to avoid the beverage, due to the contraindication with some of the additives. Magnesium sulfate is a naturally occurring mineral, commonly known as Epsom salt. When used externally, Epsom salt is perfect for soaking sore muscles in the bathtub. However, it is also used internally, as a laxative in both prescription and over-the-counter form. Though some may benefit from its use as a laxative, some adverse side effects can be harmful to the body. As with most laxatives, it can cause intestinal discomfort, cramping, vomiting, diarrhea, and hemorrhoids. The Food and Drug Administration (FDA) has rated it as a category D medication in pregnancy. This means that research has proved that a mother’s consumption of the mineral is dangerous to unborn children. When abused, laxatives can produce addicting effects, dependency, and cathartic colon, affecting future natural bowel movements. Even if you are not one to intentionally abuse laxatives, drinking several bottles of Dasani each day can have an effect on the health of your bowels Potassium chloride is a naturally occurring mineral. It has dangerous side effects including digestive distress, weakness in the muscles, and cardiac arrest. Ironically, it is one of the chemicals used in the lethal injection cocktail. It is also used to fertilize plants, as they thrive on potassium. Salt causes numerous problems when used excessively, including hypertension, edema, dehydration, heart disease, and it can complicate existing illnesses Dasani sparkling water is not much different from the original Dasani water. The main difference with the sparkling Dasani is that is contains dissolved or pressurized carbon dioxide gas. This chemical process creates the “fizzy water” that some pallets enjoy. The carbonation in this drink interferes with the digestion process, causes bloating, flatulence, hiccups, and stomach discomfort. Carbonation can be an irritant for those who suffer from Irritable Bowel Syndrome (IBS) or other digestive disorders. Dasani offers a plain sparkling water without any flavor additives or artificial sweeteners. If you must consume sparkling water, is essential to avoid artificial flavorings, artificial colors, and artificial sweeteners. If it is artificial—go ahead and skip it! Drinking carbonated water can cause unnecessary abdominal discomfort. It is wise to stick with regular purified spring water, as your body naturally craves. When it comes to water in general, Dasani is not much more than fancy tap water with additives. It is best to drink the water from pure sources without additives or carbonation. Possible short-term side effects - abdominal discomfort - bloating - flatulence - hiccups Possible long-term side effects - hypertension - heart disease - birth defects Ingredients to be aware of - tap water - potassium chloride - magnesium sulfate - sodium Healthier alternatives - natural spring water Our Wellness Pick (what is this?) LaCroix Lime Water - Zero calories - Refreshing lime flavor - No artificial sweeteners - Sodium-free - Convenient 12 pack"
}