{
  "url": "https://m.imdb.com/name/nm0577376/bio/",
  "title": "Melanie - Biography - IMDb",
  "text": "- Born - DiedJanuary 23, 2024 (undisclosed) - Birth nameMelanie Ann Safka - With her sweet, captivating voice, quirky yet insightful songwriting and bubbly, upbeat, free-spirited hippie persona, pop and folk singer/songwriter Melanie totally epitomized the whole \"flower power\" counterculture of the 1960s and 1970s. She was born Melanie Anne Safka on February 3, 1947, in Queens, New York, and grew up in the Astoria neighborhood of Queens. She made her first public appearance at age four, singing \"Gimme a Little Kiss\" on the radio show \"Live Like A Millionaire.\" She began singing in Greenwich Village folk clubs while attending New York's American Academy of Dramatic Arts and initially signed to Columbia Records in 1967. Her debut single, \"Beautiful People\", was a flop in America but a hit in the Netherlands. Melanie subsequently left Columbia Records and signed with Buddah Records. Her song \"Bobo's Party\" was a #1 hit in France in 1969. Melanie also sang \"Birthday of the Sun\" at the Woodstock music festival in 1969. In 1970 she had a Top 10 hit with \"Lay Down (Candles in the Rain).\" A powerful cover of The Rolling Stones' \"Ruby Tuesday\", and \"Peace Will Come (According to Plan)\" likewise did well. In 1971 she scored her greatest smash success with the cute, catchy and funny \"Brand New Key\"; the song peaked at #1 on the Billboard charts for three weeks, sold over three million copies, was featured on the soundtrack of the film Boogie Nights (1997) and has been covered by such artists as Deana Carter, Cher, Rasputina and The Dollyrots (the British comedy folk group The Wurzels had a 1976 #1 UK hit with a parody version of \"Brand New Key\" called \"Combine Harvester\".) The follow-up songs \"Ring the Living Bell\" and \"The Nickel Song\" were also successful. Melanie was awarded Billboard's #1 Top Female Vocalist in 1972. She had her last Top 40 hit with \"Bitter Bad\" in 1973. She won a Primetime Emmy Award in 1989 for writing the lyrics to the song \"The First Time I Loved Forever\" for the TV series Beauty and the Beast (1987). Her children Leilah, Jeordie and Beau-Jarred are all musicians. Almost all of her albums have been produced by her husband, Peter Schekeryk. She lives in Nashville, Tennessee, and continues to record the occasional album and perform live all over the world.- IMDb mini biography by: woodyanders (qv's & corrections by A. Nonymous) - SpousePeter Schekeryk(December 31, 1968 - October 26, 2010) (his death, 3 children) - ChildrenLeilah Safka Schekeryk - ParentsFrederick Matthew SafkaPauline Agnes Altomare - RelativesStephanie Safka(Sibling) - She played an acoustic guitar every time she performed onstage. - Long dark hair. - Dark brown eyes. - (In her later years) Light blonde streaks in her dark hair. - She often wore long flowing garments with folksy patterns on them. - Melanie identified herself politically as a libertarian, stating: \"I'm a total Libertarian, and I am not a Democrat, a Socialist, or a Republican.\". - Noted pop and folk singer, performed at the original Woodstock rock festival in 1969. - Melanie resided in the Nashville, Tennessee area. - She recorded \"Psychotherapy\", sung to the tune of the \"Battle Hymn of the Republic\", which parodies aspects of Freudian psychoanalysis. It has been played on The Dr. Demento Show. - Recorded several hit records in the late 1960s and early 1970s including \"Lay Down (Candles in the Rain) which peaked at #6 on the Billboard charts and \"Brand New Key\" which hit #1. - There's nothing nicer than singing an unnecessary peace song. - My idea about songs is that once you write them, you have very little say in their life afterward. It's a lot like having a baby. You conceive a song, deliver it, and then give it as good a start as you can. After that, it's on its own. People will take it any way they want to take it. Contribute to this page Suggest an edit or add missing content"
}