{
  "url": "https://www.latvia.travel/en/10-must-see-riga",
  "title": "10 must-see in Riga",
  "text": "From magnificent cathedrals to fresh food markets and opera to a one-of-a-kind car museum, Riga has everything for a memorable visit. This inspiring city will make you smile! Timeless charm Steeped in over 800 years of history and recognised by UNESCO as a World Heritage site, Old Riga is the heart and soul of Latvia’s capital. Many nations have helped build this unique place, and famous figures from Peter the Great to Richard Wagner have spent time here. Magnificent churches, architectural masterpieces like the House of Blackheads, romantic cobblestone lanes, squares bursting with summer life and much more await you. Shopping on a grand scale For a shopping experience like no other, head to Riga’s Central Market. One of the largest markets in Europe, the vast territory is dominated by five zeppelin hangars filled with cheese, fish, smoked meat, honey, fresh fruit and vegetables and lots more superb seasonal produce. The atmosphere is friendly and filled with local colour. Lady liberty Latvians have struggled hard for their country’s independence, and the sacrifice and triumph are summed up in one magnificent work of art in Riga. Unveiled in 1935, the Freedom Monument has also played a major role in the country’s subsequent tumultuous history. The ensemble by sculptor Kārlis Zāle depicts the nation singing, working and fighting for liberty, crowned by a beautiful girl holding three stars aloft. The art of the city Riga experienced its golden age in the early 20th century just as Art Nouveau architecture was coming into fashion, and so the city has one of the world’s richest collections of this exuberant style. There are over 800 amazing Art Nouveau structures throughout the city, but the greatest concentration is on Alberta iela, a street largely built in a flurry of creativity by a single architect, Mikhail Eisenstein. A treat for eyes and ears The birthplace of stars from dancer Mikhail Baryshnikov to diva Elīna Garanča, Riga is a city with a musical soul. Nowhere is this better showcased than the Latvian National Opera and Ballet, a magnificent neo classical building dating from 1882 in the heart of town. Attend a performance, take a guided tour behind the scenes, and relax by the Opera Nymph fountain on a sunny day and enjoy the beautiful opera gardens. Heavenly sounds Almost as old as Riga itself, Doma Cathedral is the city's, spiritual heart. With construction begun by Riga’s first Bishop Albert in 1211, it has been a work in progress ever since, with Gothic, Romanesque, Baroque and even Art Nouveau elements in one harmonious whole. The interior holds many works of art, and the adjacent Cloister Garden displays intriguing artefacts from Riga’s history. And don’t miss a performance on the famous organ, built in 1884 and still considered today to be one of the finest instruments in the world. It takes a village You don’t have to travel far in Riga to escape the urban bustle. Located right on the city’s doorstep, the Open Air Ethnographic Museum is a luscious lakeside park where fine examples of vernacular architecture from all over Latvia have been lovingly preserved. Step back in time by visiting peasant homes, workshops, windmills and priceless treasures like the richly ornamented Usma Church. Drive into history Just reopened after an extensive facelift, Riga Motor Museum will bring joy to the whole family. Located beside a racetrack in suburban Riga in a building resembling the front of a car, the museum houses many magnificent examples from motoring history, from Model T Fords to vehicles once owned by Stalin, Khrushchev and Brezhnev. Kids will love the interactive displays. Talk to the animals Founded in 1912, Riga Zoo is the oldest in the Baltics and one of the loveliest in Europe. Set on the banks of Lake Ķīšezers, it is home to a diverse range of mammals, birds and reptiles. Kids will love the petting zoo, and the steamy Tropical House will keep you warm all year round. A visit to the zoo is perfectly combined with a stroll around Mežaparks, the heritage garden suburb next door. Picture perfect The Latvian National Museum of Art is a wonderful venue for discovering Latvia’s artistic heritage through both permanent and visiting exhibitions. And fresh from a major reconstruction, the building is a work of art to savour. Built originally in 1905, the grand neo-Classical structure is seamless and blends the original grand columns, sweeping stairs and impressive murals with post-modern elements like a light-embracing glass cupola, observation deck and transparent storage areas, so you can literally see the art behind the scenes."
}