{
  "url": "https://www.bordeaux.com/en/appellations/bordeaux-bordeaux-superieur-and-cremant/cremant-de-bordeaux/",
  "title": "Crémant de Bordeaux rosé",
  "text": "Crémant de Bordeaux, always sparkling company Traditional know-how + modern Made in Bordeaux energy = Crémant de Bordeaux, sparkling wines that have enjoyed a boom in popularity over the past decade. Fresh, straightforward and festive, these bubbles are suited to all occasions big and small. What is the Crémant de Bordeaux PDO wine region? Key points to remember - 337 winegrowers and 1,930 hectares, with bubbles produced throughout the Bordeaux region. - As with all of France’s great sparkling wines, the traditional winemaking process is highly demanding and scrupulously respected: 100% hand-picked grapes, natural secondary fermentation in bottle, minimum of 12 months aging on the lees, daily riddling… Not a single detail is left to chance. - The variety and versatility of these wines really are astonishing, whether you’re talking color (white or rosé), sweetness (dry or demi-sec), style (vintage or non-vintage), format (bottle or magnum) or even the way they are served (on their own or in cocktails). Why do people love Crémant de Bordeaux? - Because those ethereal little bubbles never fail to deliver the “wow” effect - Because you can add some sparkle to your special moments without breaking the bank - Because it makes an ideal aperitif, whether served on its own or in cocktails, adding an enjoyable aromatic twist - Because you can serve Crémant from starter to desert – perfect for those big festive feasts! Puff pastries? The perfect match. Seafood? Just the ticket. Roast chicken? You’re going to love it. Chocolate fondant? You get the idea - Because these impeccably crafted wines are the result of a long-standing local tradition dating back to the 19th century - Because that lively sparkle is typical of Bordeaux’s approach to the art of living: a region in constant motion, with so much to see and experience What is the Crémant de Bordeaux style? Let us paint you a (delicious) picture: a vibrant color, a light texture, delicate aromas and a long, fruity finish. And of course, a steady stream of bubbles, famous for their finesse. Such a sparkling character is a natural match for any festive occasion. Crémant de Bordeaux whites tend to reveal elegant nuances of citrus fruit and white flowers, mingled with notes of lemon, hazelnut, butter and toasted bread. The rosés are more fruit-forward, with pleasant tart aromas that will titillate your senses. Red berry notes lead the way, with lashings of redcurrant, strawberry and raspberry. Perfect as an aperitif, but also a versatile match for all sorts of dishes. There is just one golden rule to make sure that you experience the very best of your Crémant: serve it well-chilled, somewhere between 6 and 10°C (straight out of the refrigerator). You can tuck bottles away for two or three years, but sparkling Bordeaux wines are ready to be opened and enjoyed straight away. Which kind of wines can be found in this PDO? Sparkling white wines, almost 90% of the time, as well as rosés. The color will depend on the grape varieties used, from among Bordeaux’s wide range of options: - White wines can actually be made with either white or red grape varieties. But most of the sparkling wines produced here are made with merlot, cabernet franc and sémillon, three of Bordeaux’s star grape varieties. Some are more specialized than others: “Blanc de Blancs” is a wine made exclusively from white grapes, while “Blanc de Noirs” is made entirely from grapes with red skins but colorless juice. - The rosés, meanwhile, are made with any and all of Bordeaux’s red-skinned varieties, as well as some white varieties. Fun facts Three fun facts you need to know about Crémant de Bordeaux Before you start stocking up on bubbles for the rest of the year, here are a few more interesting tidbits about this enticing appellation. 1. Over the past ten years, the number of hectares of vines devoted to producing Crémant de Bordeaux has increased by 278%. We weren’t kidding when we said that Crémant de Bordeaux was booming! 2. In the cellars, the bottles are aged for at least 9 months on wooden laths, laid down on their sides so that the wine remains in contact with the yeasts which power secondary fermentation, as well as enriching those aromas. The next step is known as riddling. This involves gradually tilting the bottles so that the yeasts slide down toward the neck. And here’s the really important part: every day, the bottles are rotated by 90° three times. Making Crémant de Bordeaux is a painstakingly precise process. 3. Take a bottle of white Crémant de Bordeaux, three basil leaves, the zest of a lemon and a few ice cubes – and what have you got? An unbelievable cocktail. And you can pull the same trick with a rosé Crémant, the zest of an orange, a blackberry (chopped in half) and some more ice. Simple, but effective. Let’s talk about the soil Crémant de Bordeaux is actually made all over Bordeaux. En voir plus That diversity really comes through in the wines, with each Crémant expressing the character of the unique terroir that crafted it – as you know, different grape varieties thrive in different soils. But the biggest producer of Crémant de Bordeaux is the Entre-deux-Mers region, where the clay-silt soils lend themselves perfectly to the production of lively and fresh sparkling wines. Let’s travel back in time The clay-limestone hills of the Garonne and Dordogne valleys have been a haven for humans since prehistoric times. Our distant ancestors sheltered in caves here, and in more recent times the hills were quarried for the stone from which many local houses are built, not to mention Bordeaux’s famous 18th-century façades. En voir plus The network of underground tunnels left behind by this quarrying later turned out to be ideal for a different purpose: down there the temperature and humidity remain stable all year round, providing perfect conditions for secondary fermentation in bottle. The first white and rosé sparkling wines were produced in Bordeaux in the 19th century, laying the foundations of a long-running local tradition. “Bordeaux mousseux” (Bordeaux sparkling) was officially recognized as an appellation in the next century, in 1943 to be precise. A few decades later, Bordeaux’s winegrowers decided to take things to the next level by adopting stricter production standards: the “Crémant de Bordeaux” PDO was created in 1990, joining the illustrious family of Crémants made in seven other winegrowing regions across France (Alsace, Burgundy, Die, Jura, Limoux, Loire and Savoie). Crémant de Bordeaux may be one of the region’s youngest appellations, but it already has a rich history behind it!"
}