{
  "url": "https://www.pa.gov/services/dhs/apply-for-medicaid-health-insurance-premium-payment-program-hipp",
  "title": "Apply for Medicaid Health Insurance Premium Payment Program (HIPP) | Commonwealth of Pennsylvania",
  "text": "Overview Through HIPP, the state purchases cost-effective, employer-sponsored health insurance for Medicaid recipients. Participating in HIPP gives Medicaid recipients more options when it comes to choosing a healthcare provider since some providers do not accept Medicaid payments but do accept private insurance. In addition, if a family is already paying for their benefits through their employers, enrolling in HIPP would mean that they get those benefits reimbursed to them. Eligibility Medicaid recipients who are eligible for medical insurance through employment can be referred to HIPP either by calling the HIPP regional office or through their local county assistance office (CAO). A HIPP team member will conduct a review of the medical insurance that is available through the employer. If the employer's health insurance is determined to be cost effective, you are required to participate in HIPP as a condition of continued eligibility for Medicaid. You will still be enrolled in Medicaid, but the employer insurance is used as the primary medical insurance. Frequently Asked Questions Yes. You must remain enrolled in Medicaid to be eligible for HIPP. If needed, Medicaid can help pay for services not covered by your employer's plan, so keep your Medicaid card so you have plan information in those situations. When you are enrolled in HIPP, you are automatically disenrolled from managed care and entered into a fee-for-service coverage. No. Although most HIPP referrals are received from CAOs, if you want to be considered for enrollment in HIPP, or other agencies acting on their behalf, you may do so by calling the toll-free number of your HIPP Regional Office. No! You will still be a Medicaid recipient, so you cannot be billed for any Medicaid-covered service as long as it is administered by a participating Medicaid provider. We encourage you to use doctors that accept both Medicaid and your employer's insurance as much as possible. When a case is determined to be cost effective, a HIPP staff member will work with you and your employer to enroll in the employer’s insurance program. HIPP payments are usually sent directly to the employer, but payment can be made to you when necessary. Members of your household who are not Medicaid recipients are not considered when determining the cost effectiveness of the employer insurance. But, when non-Medicaid recipients are eligible for enrollment without increasing the premium amounts, they may enroll in coverage. Contact HIPP Regional Office For questions or more information, contact your regional HIPP office."
}