{
  "url": "https://www.georgiancollege.ca/admissions/register/",
  "title": "How to register for full-time or part-time courses - Georgian College",
  "text": "Register for courses Get registered for your courses at Georgian! If you are a new or returning student, getting ready to register at Georgian is an exciting period of time. Find out everything you need to know about registering for your courses in Banner. For information about registering for courses or co-op beyond your first semester, you can also visit MyGCLife. What’s next? Once you’ve registered for your classes, there a few next steps that you should take to ensure you’re ready to start your first or next semester at Georgian. New students Browse our Guide for New Students to learn about: - how to purchase your textbooks - how to get your ONEcard (student card) - upcoming orientation events - and more! Current students Check out MyGCLife for more information on: - how to view your timetable - checking your account balance - how to purchase your textbooks - and more! Frequently asked questions (FAQs) Registration dates for each term can be easily found on the important dates page of our website. To verify your specific registration date and time, select Check Registration Status in Banner. You can also watch this how-to video. After you have successfully registered, you may view your timetable online at any time. Georgian College reserves the right to alter course availability as well as the right to withdraw a student from a course if the student has failed a prerequisite. For this reason, you must check to see if any changes have been made online even after you have printed your timetable. It is essential that you do this before the start of classes and again at the end of add/drop. You may not attend any courses you’re not registered in – you’ll not receive a grade and will be required to retake and repay for the course in a future semester. You’re expected to be attending ALL courses that are showing on your timetable. If you’re not attending the course (because you already took it or you’re getting an exemption but it hasn’t been processed yet, etc.), you’re required to drop or withdraw from it on Banner. You’ll receive a grade for every course in which you’re registered, even if you’re not attending. If you miss your registration window, you may still be able to register if full-time blocks of courses are still available. If they are no longer available, you may need to register via our add/ drop process. Yes, your academic credits or experiences may transfer to your Georgian program. Be sure to inquire or apply for transfer credits or PLAR at least 60 days before your term begins. Be mindful of processing times. Visit the Credit for Prior Learning webpage to learn more. If you have relevant postsecondary experience, our Transfer Equivalency Tool can help you explore course exemptions or advanced standing. If you have relevant work or life experience, our Transfer Experience System can determine your eligibility for Prior Learning Assessment and Recognition (PLAR)/exemptions. While the registration process will recognize courses you’ve taken before or have exemptions for, it will still tell you that you need to pick one communications course or one General education course because that’s what is recommended for your program that semester. If you know that you’ve already taken that course, do not pick one and ok the error message that will pop up telling you that you need one. You’re expected to be attending ALL courses that are showing on your timetable. If you’re not attending the course (because you already took it or you’re getting an exemption but it hasn’t been processed yet, etc.) you’re required to drop or withdraw from it on Banner. You’ll receive a grade for every course in which you’re registered, even if you’re not attending. MyPath outlines all the courses you need to take to successfully complete your program. You should contact your program co-ordinator if you have any questions. Changes can be made to your timetable once add/drop opens (we cannot make any changes before that). See important dates for the exact date for this semester. - In Banner, click on add/drop/withdraw (please note, the link won’t be visible until the morning add/drop opens) - View the cheat sheet for step by step instructions - Make sure you check your account summary as changes to your schedule may result in extra charges Part-time students cannot drop courses in Banner and must complete a withdraw from part-time courses form. Yes, you’ll be able to add or drop courses online. Check important dates to verify the add/drop period for each semester. If you’re a first-year student, we recommend that you seek advice from your program co-ordinator prior to dropping courses. Part-time students cannot drop courses in Banner and must complete a withdraw from part-time courses form. The last day to add or drop a course to receive a refund is the 10th business day from the start of classes. See important dates for exact dates. You’ll be able to withdraw from a course up to the two-thirds point in the semester. See important dates for specific dates for your program. Beyond this date, you’ll receive a grade for your course. Once you register, you’ll be able to see your booklist by clicking on the View booklist link in Banner’s registration menu options. For additional support, we encourage you to watch our instructional video. You can also search for books and order them online directly through Georgian Stores. If you want to withdraw from just a few courses, you need to do this through the add/drop feature on Banner. Part-time students cannot drop courses in Banner and must complete a withdraw from part-time courses form. If you want to withdraw from your entire program or the term, you must complete the online withdrawal form. Part-time students use the withdraw from part-time courses form. You have until the end of the 10th business day of the term to submit your withdrawal request to receive a partial refund (if applicable) or have your balance owing adjusted. From the 11th day of the term until the withdrawal deadline, you can withdraw from your program without academic penalty. Your transcript will show a grade of WD beside withdrawn courses. You won’t not receive a refund after the 11th day. Check important dates to see the withdrawal dates specific to your program. After you accept your offer to Georgian, you’ll receive an email with a link to apply for entrance awards. Visit our awards, scholarships and bursaries webpage to learn what’s available, and find out how and when to apply. Contact us The Office of the Registrar offers remote and in-person services to students across all campuses Monday to Friday from 8:30 a.m. to 4:30 p.m. Submit an inquiry or chat with us online Connect with the Office of the Registrar by submitting a question, searching knowledge articles, or starting a live chat via MyGCLife. Give us a call Inquiries: Call 705.722.1511 MORE ways to connect Visit us at our Get to Know Georgian event on March 3 Learn more and RSVP Take a guided, in-person tour of our campuses. Book a campus tour. Book a phone appointment with a recruitment specialist. Connect with a recruiter. Join our email list for event updates, contest information and more. Sign up for Georgian updates. Delivery methods, campus locations, timetables, and course access are subject to change. Georgian College may adjust or cancel offerings at its discretion and will support affected students in completing their program requirements."
}