{
  "url": "https://en.wikipedia.org/wiki/Ritter_Sport",
  "title": "Ritter Sport - Wikipedia",
  "text": "Ritter Sport Ritter Sport is a brand of chocolate bar from the family-owned Alfred Ritter GmbH & Co. KG, which has its headquarters in Waldenbuch, Germany. The company was founded in 1912 by Clara and Alfred Eugen Ritter and has been family-owned ever since. Andreas Ronken has been the CEO since 2015. Each 100 g (3.5 oz) square bar is divided into 16 smaller squares, creating a four-by-four pattern. In 2013 the company introduced a new version divided into 9 bigger squares using a three-by-three pattern. Large bars weighing 250 g (8.8 oz) and 16.67 g (0.588 oz) mini bars are also available, although in fewer varieties. History [edit]In 1912, Alfred (1885–1952) and Clara Ritter (1877–1959) founded a chocolate and confectionery factory in Stuttgart-Bad Cannstatt.[3] Later, in 1919, it introduced its own brand of chocolate, named \"Alrika (Alfred Ritter Cannstatt)\".[4][5] By 1926, the company had 80 employees and had bought their first company truck to transport the chocolate.[6] When production needs required a factory expansion in 1930, the company moved to Waldenbuch, a site a couple of miles outside Stuttgart. The chocolate brand known today, Ritter's Sport Schokolade, was launched in 1932 after Clara suggested creating a chocolate bar that would fit into any sport jacket pocket without breaking but weighed the same as a normal bar.[6][7] Ritter Sport replaced the Alrika brand.[5] The Second World War halted production and Ritter chocolates disappeared until the 1950s, when chocolate rationing was ended in West Germany. The end of chocolate rationing did not mark the end of troubles for the firm since in 1952 the company's founder, Albert Ritter, died. His son, Alfred Otto Ritter, took over and focused the company on the chocolate square.[6] From 1960 to 1970, sales tripled.[5] In 1966, Clara Ritter also died and the company was left solely in the hands of Alfred Otto. In 1964, he dispensed with many other product lines in order to focus on the square Ritter Sport bar.[8][9] The 1970s saw Ritter packaging become more colourful with a brighter unique colour assigned to each flavour. The brighter labels were seen in parallel with colour television, on which Ritter advertised. Another advance in packaging came with the snap-open pack (called the 'Knick-Pack'), which Ritter marketed as \"practical and modern\".[10] In 1972 the company achieved sales of over 100 million DM for the first time.[5] After Alfred Otto Ritter's death in 1974, the company was managed by his wife, Marta,[11] and in 1978 the company passed into the hands of the third generation, brother and sister Alfred T. Ritter and Marli Hoppe-Ritter.[6] Alfred Theodor Ritter and his sister Marli Hoppe-Ritter joined the advisory board, and increasingly brought social, environmental and sustainability issues into the company management.[11][12] Alfred Theodor Ritter took over the chairmanship of the advisory board in 1983.[13] In 2005, he also took over the operational chairmanship of Alfred Ritter GmbH.[14][15] In 2008 the company was making a profit again.[16] In 2015, Ritter handed over the chairmanship to the previous managing director of production and technology, Andreas Ronken, and moved to the chairmanship of the advisory board, which his sister previously held.[17] In 1990, they launched project(s) \"Cacaonica\", which supports organic cocoa agriculture and reafforestation in Nicaragua,[18] and \"Ritter Solar\", now the European market leader of solar thermal products and large solar thermal systems. The Ritter company owns a CHP power plant, which supplies 70% of the factory's energy needs, and since 2002 the company has been run entirely on renewable energy.[18] The monomaterial chocolate packaging is designed to minimize its ecological footprint and is recyclable.[18] The company has been certified to ZNU standard.[19] The Ritter Museum, opened in 2005, contains the collection of Marli Hoppe-Ritter, which consists of nearly 600 paintings, objects, sculptures and graphic works, a breadth of painterly and sculptural confrontation with the square form used as the design for the Ritter chocolate. The museum is an extension of the factory's 'ChocoShop', which was opened in 2001.[8] The museum, on Alfred-Ritter-Straße 27, is a cubical building with limestone wall covering; a 12-metre-high central open passage is meant to draw in the landscape, and the large window allows a view through the building. It was designed by Max Dudler and Susanne Raupach.[20] On the whole, their products are neither certified organic nor certified fair trade. However, in April 2008 they launched an organic product line called \"Ritter Sport Bio\".[21] The firm celebrated its centenary in 2012 by touring 19 German cities between March and September on 'the Colourful ChocoTour'. A limited-edition anniversary bar was released: Edel-Nuss Mix – Plain milk chocolate with macadamias, cashews, and almonds.[6][21] Also in 2012 Ritter expanded its initiative in Nicaragua by setting up a new cocoa plantation. The first harvest was in 2017.[21] In 2013, Ritter opened another shop at Ravensburger Spieleland, a German theme park, and the next year Ritter's first pop-up shop appeared in Hamburg for four months.[21][22] In 2017, Ritter released its first certified vegan bars, Dunkle Voll-Nuss Amaranth (hazelnut cream chocolate with amaranth and nuts) and Dunkle Mandel Quinoa (hazelnut cream chocolate with quinoa and almonds).[23] As of February 2017 they were on sale only in Germany.[24] The new releases, costing €2 each, target the growing vegan population in Germany.[23] A third bar, Sesam (almond cream chocolate with sesame), was released in February 2020.[25] In July 2018, Ritter announced its intention to attempt to release the Schoko & Gras variety, a milk chocolate with roasted hemp seed filling, in the United States for World Cannabis Day 2019, retitled 'Choco & Weed'. As of January 2019 it had yet to be approved for sale.[26] In 2018, Ritter released a limited edition bar made from the first viable harvest of their Nicaraguan cocoa plantation. It was limited to 30,000 bars and was available in the SchokoShop in Waldenbuch, SchokoWelt Berlin and online.[27][28] Alongside Alfred and Marli, shareholders include their children Tobias and Tim Hoppe, as well as Moritz, Lukas and Dora Ritter.[29] Ritter und Hoppe KG was founded in 2016, which, after changing its name to R² Holding, was gradually converted into a holding company that holds all of the company's investments. Since 2021, it has been headed by Moritz Ritter,[30] who withdrew from the operational business of Ritter Energie in 2020.[31] Marli Hoppe-Ritter had left the advisory board in 2021 and was succeeded by her son Tim Hoppe.[32] In 2019, Ritter took over the production site in Breitenbrunn in Burgenland, Austria, from Mars Austria, establishing its first factory outside of Germany.[33] With the acquisition, Ritter also acquired the trademark rights to the Amicelli wafer rolls as well as the discontinued products Fanfare and Banjo.[33] In 2021, Ritter produced 2,000 tons of Amicelli.[34] For the first time since the 1960s, Ritter had another brand in its product portfolio. In 2019, Ritter founded the subsidiary Hang zur Sonne GmbH.[35] In the same year, Ritter founded two in-house start-ups within their subsidiary. The first was PURmacherei, which produces snacks from natural ingredients, with the two product lines CocoaWUMMS and HaferHAPS having been brought to the market.[36] The second start-up, CacaoVida, is making drinks from cocoa fruit as well as offering an iced tea, a lemonade and a Prosecco.[37] Corporate figures [edit]In 2020, Ritter was represented in more than 100 countries and around 70,000 tons of chocolate were produced.[33] Around 5,000 tons of this came from the Breitenbrunn production site.[38] Ritter increased the share of international business: while 35 percent of sales were realized outside Germany in 2011 and 40% in 2012,[39] the share was 58% in 2022.[40] In 2023, the company was represented through foreign companies in the United States, Italy, Netherlands, Austria, Russia, Singapore, United Kingdom and China, had a minority stake in Denmark, and subsidiaries in Nicaragua for cocoa cultivation and in France and Chile for hazelnut cultivation.[32][40] In the 100-gram bar segment, it had a market share of 22.4% on the German market in 2020, just behind Mondelez International and its Milka brand.[33] Varieties [edit]- Vollmilch – Plain milk chocolate (Royal Blue Wrapper, see image)[41] - Schoko-Duo – Plain milk chocolate and white chocolate (Royal Blue Wrapper with chocolate bar on outside) - Dunkle Vollmilch – Plain medium dark chocolate, 40% cacao (Azure Blue Wrapper) - Halbbitter – Plain dark chocolate, 50% cacao (Burgundy Wrapper) - Die Milde – Plain dark chocolate from Ghana, 55% cacao (Blue/pink Wrapper) - Die Feine – Plain dark chocolate from Nicaragua, 61% cacao (Yellow/blue Wrapper) - Edel-bitter – Plain dark chocolate from Ecuador, 71% cacao (Pink Wrapper) - Edel-bitter – Plain dark chocolate from Ecuador, 73% cacao (Black Wrapper) - Die Kräftige – Plain dark chocolate from Peru, 74% cacao (Orange/blue Wrapper) - Die Starke – Plain dark chocolate from Ghana, 81% cacao (Green/purple Wrapper) - Knusperkeks – Milk chocolate with a butter biscuit (Brown Wrapper) - Pfefferminz – Chocolate with peppermint filling (Caribbean Green Wrapper) - Joghurt – Yogurt (White Wrapper, see image) - Erdbeer Joghurt – Milk chocolate strawberry and yogurt filling (Light Pink Wrapper) - Voll-Nuss – Milk chocolate with whole hazelnuts (Brown Wrapper with Hazelnut-Pattern) - Dunkle Voll-Nuss – Dark chocolate with whole hazelnuts (Dark Brown Wrapper with Hazelnut-Pattern) - Weiße Voll-Nuss – White chocolate with whole hazelnuts (White/Cream Wrapper with Hazelnut-Pattern) - Knusperflakes – Milk chocolate with corn flakes (Golden Yellow Wrapper) - Voll Erdnuss – Milk chocolate with whole peanuts (Orange Wrapper) - Ganze Mandel – Milk chocolate with whole almonds (Dark Green Wrapper) - Marzipan – Dark chocolate with marzipan center (Red Wrapper, see image) - Cocos – Milk chocolate with flakes of coconut in the center (Silver Wrapper) - Trauben-Nuss – Milk chocolate with raisins and hazelnut pieces (Carmine Red Wrapper) - Rum Trauben Nuss – Milk chocolate with rum-soaked raisins and hazelnut pieces (Crimson Red Wrapper) - Cappuccino – Milk chocolate and cappuccino cream (Amber Wrapper) - Alpenmilch – Special milk chocolate with high alpine milk proportion (Sky Blue Wrapper) - Nugat – Milk chocolate with hazelnut-nougat center (Midnight Blue Wrapper) - Feinherb à la Mousse au Chocolat – dark chocolate filled with chocolate mousse (Bistre Wrapper) - Williams Birne Trüffel – dark chocolate filled with Poire Williams pear brandy mousse - Karamel Nuss – Milk Chocolate with butter caramel cream dropped hazelnuts and crispy rice (Golden yellow wrapper) - Haselnuss – Milk chocolate with chopped hazelnuts (Green wrapper, see image) - Neapolitan – Milk Chocolate with Neapolitan wafers, made with a hazelnut cream filled wafers and praline (Medium dark orange wrapper) - Noisette – Hazelnut-flavored milk chocolate (Light green wrapper) - Kakao-Mousse – Whipped Cream Cocoa in Alpine Milk Chocolate (Brown Wrapper) - Kakao-Keks – Dark chocolate with cookie center (Brown Wrapper with cookie background) - Karamell – Milk chocolate with caramel filling.(Orange wrapper) - Olympia – Milk Chocolate with yoghurt, honey, and glucose (Gold Wrapper) - Honig Salz Mandel – Milk chocolate with salted almonds and honey (Orange wrapper with chocolate-coated almonds in the background) - Macadamia – Milk chocolate with halved Macadamia nuts (Blue wrapper with chocolate-coated Macadamia nuts in the background) - Waffel – Milk chocolate with cocoa cream-filled waffle square (Orange wrapper)[42] - Mandel Orange – Dark chocolate with almond pieces and candied orange peel[43] - Cashew – Milk chocolate with roasted and salted cashew nuts[44] - Pistachio – Milk chocolate with roasted and salted pistachios (Light Green wrapper) (Limited Edition) Organic varieties [edit]- Mandelsplitter – Milk chocolate with chopped almonds. - Macadamia – Milk chocolate with chopped macadamia nuts. - Trauben-Cashew – Milk chocolate with chopped cashew nuts and raisins. - Vollmilch 35% – Milk chocolate with 35% cacao. - Feinherb 60% – Dark chocolate with 60% cacao. - Kakaosplitter Nuss – Milk chocolate with 35% cacao, chopped nuts and cocoa kernel chips. Slogans [edit]Motto 1 [edit]- German packaging: \"Quadratisch. Praktisch. Gut.\" (\"Square. Practical. Good.\") - French packaging: \"Carré. Pratique. Gourmand.\" - English packaging (North America & Australasia): \"Quality. Chocolate. Squared.\" - English packaging (UK-Ireland): \"Quality in a Square.\" - Italian packaging: \"Quadrato. Pratico. Buono.\" - Danish packaging: \"Kvadratisk. Praktisk. God.\" - Dutch packaging: \"Vierkant. Makkelijk. Lekker.\" - Russian packaging: \"Квадратный. Практичный. Хороший.\" (Translation of German) or \"Квадратиш. Практиш. Гут.\" (Transliteration of German) In 2022, this motto was mocked following Ritter's decision to continue sales to Russia. The Ukrainian ambassador to Germany used the Twitter platform to criticise Ritter, using the motto \"Square. Practical. Blood\".[45] Motto 2 [edit]\"Qualität im Quadrat.\" Literal translation used on English language packaging: \"Quality in a square.\" English packaging now features \"Quality. Chocolate. Squared.\" to provide a similar description. The company has defended a monopoly on square-packaged chocolate bars.[46] Motto 3 [edit]\"Knick Knack auf Zack.\" Literal translation in English language would be: \"fold and snap to be prepared.\" The first two terms are the clicking noises that one is supposed to hear when breaking the chocolate bar twice in the middle – knick is from the German verb knicken (to bend something), Knack means snap/click and \"auf Zack sein\" means on one's toes / ready and waiting / prepared / set / arranged. This motto aired on German TV in the early 1990s. Mascot [edit]Ritter Sport is sometimes represented by \"Quadrago\", a banner-carrying baby dragon. This may be partly attributed to the German word \"Ritter\" meaning \"Knight\". Sustainability [edit]At the instigation of Marli Hoppe-Ritter,[35] the company has been supporting organic cooperatives of cocoa-producing farmers in Nicaragua since 1990, but the majority of organic cultivation was stopped in 2013 because the varieties produced with it were unsuccessful.[35] The chocolate manufacturer has instead set up its own cocoa plantation in Nicaragua, which claims to be the \"largest contiguous cocoa plantation in the world\".[47] In 2018 it was planned that a third of the required cocoa would be obtained from this plantation in Nicaragua.[48] During his time as operational chairman from 2005 to the end of 2014, Alfred Theodore Ritter had nature-identical flavourings replaced by natural flavourings.[49] In 2017, Ritter received the German Sustainability Award as Germany's most sustainable medium-sized company.[50] In a 2022 research overview carried out by The Chocolate Collective, Ritter Sport scored 23rd out of 35 reviewed chocolate companies with respect to environmental sustainability for chocolate resourcing.[51] The survey's main concerns with Ritter were on deforestation to clear land for cocoa plantations and paying living wages to cocoa farmers.[51] The survey found that the company was not leading the industry in any of the six criteria used in the comparison, but was starting to implement good policies in four of the six categories.[51] In the 2023 report, Ritter Sport scored 2nd out of 38 reviewed chocolate companies with respect to environmental sustainability for chocolate resourcing.[52] The survey found that the company was an industry leader in the categories of 'Traceability & Transparency' and 'Deforestation & Climate'.[52] Controversies [edit]In 2008, on the initiative of Alfred T. Ritter, the company's employees working in the lowest wage groups were regrouped into slightly higher ones.[12] At the same time, however, the company outsourced the packaging to a subcontractor that paid lower wages than the collective agreement in the confectionery industry.[53] In January 2008, the Federal Cartel Office investigated eleven German confectionery manufacturers, triggered by a leniency application from Mars GmbH. By the beginning of 2013, fines of over 60 million euros had been imposed in four cases, including a total of 7.5 million euros against the Ritter KG.[54][55] The \"Voll-Nuss\"(Whole Nuts) variety was rated \"poor\" by Stiftung Warentest at the end of November 2013. The assessment was based on the assumption that the proven flavouring substance piperonal could not be obtained in the required quantities in a \"natural\" way.[56][57] Ritter Sport referred to an affidavit of guarantee from the flavour supplier Symrise, according to which it was a natural flavour that was \"exclusively of natural origin\" and \"fully marketable and edible.\"[58] In November 2013, Ritter Sport obtained an injunction prohibiting the foundation from claiming that Ritter Sport used chemically produced flavours in its nut chocolate.[59] In January 2014, the Landgericht München I (Regional Court of Munich I) confirmed the decision.[60] On 9 September 2014, the Oberlandesgericht München (Munich Higher Regional Court) also decided against Stiftung Warentest in an appeal before the court because the overall test verdict was based only on an indirect conclusion about the extraction of one of the ingredients and did not represent objectively justified criticism of the tested product.[61] At the end of September 2014, Stiftung Warentest announced that it would recognize the judgment and not wish to continue the legal dispute.[62] In February 2021, Ritter Sport released a new product: Cacao Y Nada (\"Cocoa and Nothing\"). Ritter Sport advertised that the product was 100% cocoa and claimed that they could not call this product chocolate because (as the German chocolate regulations state)[63] there is no added sugar. This claim was a marketing gimmick.[64] The then Federal Minister for Food and Agriculture, Julia Klöckner, made it clear that Ritter Sport could call their new creation chocolate: \"The cocoa regulation does not limit the use of sugary ingredients to certain types of sugar. Therefore, according to our ministry, a product that uses natural cocoa juice should also be allowed to be sold under the name chocolate.\"[65] After the Russian attack on Ukraine in 2022, the company came under criticism because it continued to hold on to business in Russia. Boss Andreas Ronken pointed out that continued sales are important for cocoa farmers in West Africa and Central and South America, who would otherwise lose their livelihoods.[66][67] However, investments and marketing activities in Russia have been stopped. In January 2023 it was announced that an amount of 1.51 million euros from the proceeds of the Russian business had been donated to various organizations.[68][69] According to press reports, Ritter Sport is donating profits from its Russian business to Ukraine.[70] Assortment [edit]Ritter Sports [edit]The company has been selling square chocolates under the Ritter Sport brand since 1932. It was responsible for over 90% of sales in 2020.[71] Ritter did not offer products outside the brand from 1964 until 2020.[9][33] Almost all of the brand's products are chocolate bars. The few exceptions include the chocolate rum bars introduced in 1967 as \"Ritter Bissen\", which were first renamed \"Ritter Drei\" and then \"Ritter Rum\" in 1974. At times there were also the varieties \"Ritter Fresh\" and \"Ritter Nuss\", and since 2021 \"Ritter Sport Gin\".[72][73][74] In 1988, Ritter brought the Ritter Sport Balloon bar onto the market in four different varieties, but stopped production in 1993 due to lack of success.[75][76] Brand presence [edit]The Ritter Sport package was originally transparent with white lettering. From 1947 it was packaged in brown cellophane until Ritter introduced coloured packaging in 1974, allowing each variety to be differentiated by colour.[77] In addition, in 1976, tubular bag packaging and the folded opening were introduced. The package allows the chocolate to be opened with a kink. The pack can be closed again using the resulting tab.[78] Recyclable polypropylene has been used for the outer packaging since 1991.[79] Overall, the company logo has only changed slightly. It consists of the Ritter lettering, which has remained unchanged since 1919,[80] including Sport, in large block letters since 1969. From 1987 it was surrounded by a square against a white background. Typically, the font colour is blue, the square background is white, and the square frame is gold.[77] A legal dispute between Ritter and Mondelēz International over the ability to trademark the square shape was going on for years. After Mondelēz initially succeeded before the Bundespatentgericht (Federal Patent Court), arguing that the Trademark Act prohibits the protection of shapes dictated by the nature of the goods, Mondelēz lost before the Bundesgerichtshof (Federal Court of Justice) in October 2017,[81] which ruled that Ritter Sport could provisionally retain trademark protection and referred the case back to the Bundespatentgericht.[82][83] After the lawsuit was dismissed, Mondelēz filed suit again, based on the previously unexamined ground that a shape trademark may not be granted if the shape confers significant value on the goods. When the Bundespatentgericht ruled in favour of Ritter, Mondelēz went to the Bundesgerichtshof, where it lost in 2020.[84] References [edit]- ^ \"Chefsache\". Ritter Sport Blog (in German). Archived from the original on 10 December 2019. Retrieved 10 December 2019. - ^ \"Ritter Sport\". Companies History. 18 December 2013. Retrieved 2 November 2018. - ^ \"European Capital of Culture\". Magazin Deutschland. Societäts-Verlag. 2010. p. 24. ..1912 Alfred Eugen Ritter and Clara Ritter, née Göttle, founded the Chocolate and Confectionary Factory on Innere Moltkestrasse in Bad Cannstatt, Stuttgart. In 1930 the expanding company.. - ^ López, María José González (2015). Pruebas de Acceso a la Universidad. Bachillerato LOE - Ciclos Formativos de Grado Superior, 2014-2015. Ed. Universidad de Cantabria. p. 58. - ^ a b c d Volland, Isabel (12 December 2005). \"Familie Ritter: Alfred und die Nüsse\". www.manager-magazin.de (in German). Retrieved 28 May 2024. - ^ a b c d e \"Ritter Sport\". I Like Germany. 18 May 2016. Retrieved 2 November 2018. - ^ \"Our chocolate history\". ritter-sport. - ^ a b \"The Meaning of \"Sport\" in Ritter Sport Chocolates\". Broken Secrets. 27 October 2010. Retrieved 2 November 2018. - ^ a b KG, Alfred Ritter GmbH & Co (29 June 2015). \"Ritter Sport - Quadratisch. Praktisch. Gut\". Lebensmittelpraxis.de (in German). Retrieved 28 May 2024. - ^ \"Ritter Sport Knick Pack\". Beach Packaging Design. Retrieved 2 November 2018. - ^ a b Koch, Hannes (22 February 2008). \"Portrait der Ritter Sport-Chefin: Quadratisch. Praktisch. Fair\". Die Tageszeitung: taz (in German). ISSN 0931-9085. Retrieved 28 May 2024. - ^ a b \"Schokoladenkonzern Ritter Sport: \"Wir haben die unteren Lohngruppen abgeschafft\"\". Der Spiegel (in German). 25 November 2008. ISSN 2195-1349. Retrieved 28 May 2024. - ^ \"Geschichte\". www.ritter-sport.com (in German). Retrieved 31 May 2024. - ^ \"UNTERNEHMER: Chef im Schokoladen-Land - FOCUS Online\". FOCUS Online. 20 November 2021. Archived from the original on 20 November 2021. Retrieved 31 May 2024. - ^ Lauer, Marco (29 October 2014). \"Eine Karriere auf Umwegen\". St. Galler Tagblatt (in German). Retrieved 31 May 2024. - ^ \"Ritter Sport: Erfolg zum Quadrat\". BÖRSE am Sonntag (in German). 11 December 2009. Retrieved 31 May 2024. - ^ \"Alfred Ritter gibt die Führung ab: Neuer Chef für Ritter Sport\". Der Tagesspiegel Online (in German). ISSN 1865-2263. Retrieved 31 May 2024. - ^ a b c \"Ritter Sport\". Euro-American Brands. Retrieved 2 November 2018. - ^ \"Certified Companies\". ZNU Standard. Archived from the original on 3 November 2018. Retrieved 2 November 2018. - ^ Schmolke, Birgit (2007). Architektur neues Baden-Württemberg. Braun. p. 93. ISBN 9783938780121. - ^ a b c d \"History\". Ritter Sport. Retrieved 2 November 2018. - ^ \"Come with us into the adventure ... er, Ravensburger Spieleland!\". Ritter Blog. Retrieved 3 November 2018. - ^ a b Nieburg, Oliver (17 February 2017). \"Ancient grain additions: Ritter Sport makes first foray into vegan chocolate\". Confectionery News. Retrieved 2 November 2018. - ^ Tashjian, Lena (20 February 2017). \"Ritter Sport Introduces Two New Vegan Bars\". Clearly Veg. Retrieved 2 November 2018. - ^ \"Voller Geschmack, ganz ohne Milch: Unsere vegane Sesam!\". Ritter Sport Blog (in German). 5 February 2020. Retrieved 27 September 2020. - ^ Yu, Douglas (25 July 2018). \"Chocolate and weed: Ritter Sport's hemp seed chocolate might come to US next year\". Confectionery News. Retrieved 2 January 2019. - ^ \"Harvest good, all good: The new RITTER SPORT Limited Edition!\". Ritter Sport Blog. Retrieved 2 January 2019. - ^ \"Ritter Sport: Kakao von der eigenen Plantage\". Deutsche Welle. 14 March 2018. Retrieved 24 March 2022. Der schwäbische Schokoladenhersteller Ritter Sport ist in Nicaragua in die Landwirtschaft eingestiegen. Auf einer Fläche von 3200 Fußballfeldern ist die wohl größte zusammenhängende Kakaoplantage der Welt entstanden. [The Swabian chocolate manufacturer Ritter Sport has entered agriculture in Nicaragua. What is probably the largest contiguous cocoa plantation in the world has grown on an area the size of 3,200 football pitches.] - ^ \"Unser Leitbild\" (PDF). Forum-CSR.net. Retrieved 31 May 2024. - ^ \"R² Holding GmbH & Co. KG (vormals: R² Holding G)Karlsbad Konzernabschluss zum Geschäftsjahr vom 01.01.2020 bis zum 31.12.2020\". www.bundesanzeiger.de (in German). Retrieved 3 June 2024. - ^ Sill, Johannes (12 September 2022). \"Moritz Ritter: Von Schokolade und Energiewende\". wir Magazin (in German). Retrieved 3 June 2024. - ^ a b \"Die Biodiversitätsstrategie der Alfred Ritter GmbH & Co. KG\" (PDF). food-diversity.de (in German). Retrieved 3 June 2024. - ^ a b c d e Mayr, Stefan (29 September 2020). \"Quadratisch, praktisch, mutig\". Süddeutsche.de (in German). Retrieved 4 June 2024. - ^ \"Ritter Sport: erste Fertigung in Breitenbrunn\". retailreport.at (in German). Retrieved 18 February 2025. - ^ a b c Zeitung, Stuttgarter. \"Start-up aus Waldenbuch: Wie aus Hipstern Hapster werden\". stuttgarter-zeitung.de (in German). Retrieved 4 June 2024. - ^ \"Ritter Sport Start-up: PURmacherei setzt mit handgemachten Snack-Alternativen auf Natürlichkeit - vegconomist: Das vegane Wirtschaftsmagazin\". vegconomist.de (in German). 29 July 2020. Retrieved 18 February 2025. - ^ \"Ritter-Sport-Startup CacaoVida: Das steckt hinter dem Eistee aus Kakaofrucht\". www.bw24.de (in German). 18 August 2022. Retrieved 18 February 2025. - ^ \"Ritter Sport: erste Fertigung in Breitenbrunn\". retailreport.at (in German). Retrieved 13 June 2024. - ^ \"Schokoladenhersteller: Ritter Sport mit Rekordumsatz - Mittelstand - Unternehmen - Handelsblatt\". 30 January 2013. Archived from the original on 30 January 2013. Retrieved 13 June 2024. - ^ a b \"Auf einen Blick\". www.ritter-sport.com (in German). 19 April 2023. Retrieved 13 June 2024. - ^ \"Vollmilchschokolade translation and meaning\". Collins Dictionary. Retrieved 31 January 2026. - ^ \"New in the colorful variety: RITTER SPORT waffle\". Ritter Sport Blog. Retrieved 2 January 2019. - ^ \"Orange in the new Black – unsere neue Mandel Orange\". Ritter Sport Blog (in German). Retrieved 10 December 2019. - ^ \"Neu in der Nuss-Klasse: Cashew – geröstet und gesalzen\". Ritter Sport Blog (in German). 13 March 2020. Retrieved 27 September 2020. - ^ \"After criticism, Ritter Sport announces donation of the proceeds - Global Happenings\". globalhappenings.com. Retrieved 3 April 2022. - ^ \"German chocolate war ends with Ritter Sport victory\". POLITICO. 23 July 2020. Retrieved 3 April 2022. - ^ Zeitung, Stuttgarter. \"Plantage in Nicaragua: Wo der Kakao für Ritter Sport herkommt\". stuttgarter-zeitung.de (in German). Retrieved 14 June 2024. - ^ \"Ritter Sport setzt auf eigene Kakao-Plantage in Nicaragua\". Handelsblatt (in German). Retrieved 14 June 2024. - ^ \"Alfred Ritter gibt Führung von Ritter Sport ab\". Der Spiegel (in German). 7 November 2014. ISSN 2195-1349. Retrieved 14 June 2024. - ^ Praxis, Lebensmittel (11 December 2017). \"Ritter Sport - Gewinnt Deutschen Nachhaltigkeitspreis 2018\". Lebensmittelpraxis.de (in German). Retrieved 17 June 2024. - ^ a b c \"2022 Chocolate Scorecard\" (PDF). Chocolate Scorecard. Archived from the original on 7 April 2022. Retrieved 24 December 2022. - ^ a b \"2023 Chocolate Scorecard\". Chocolate Scorecard. Retrieved 2 May 2024. - ^ \"Ritter Sport: Schokolade für eine bessere Welt\". Initiative Zivilengagement (in German). Archived from the original on 24 April 2009. Retrieved 17 June 2024. - ^ \"Bundeskartellamt verhängt Bußgelder gegen Süßwarenhersteller von über 60 Mio. Euro\". 26 August 2014. Archived from the original on 26 August 2014. Retrieved 19 June 2024. - ^ \"Bußgeld gegen Haribo wegen wettbewerbsbeschränkendem Informationsaustausch\". Bundeskartellamt. Retrieved 19 June 2024. - ^ \"Symrise: Ritter-Sport-Lieferant wehrt sich gegen Vorwürfe\". Der Spiegel (in German). 22 November 2013. ISSN 2195-1349. Retrieved 19 June 2024. - ^ \"Schokolade - Der Streit mit Ritter Sport - Meldung - Stiftung Warentest\". Stiftung Warentest. 9 April 2014. Archived from the original on 9 April 2014. Retrieved 19 June 2024. - ^ \"Stiftung Warentest straft Ritter Sport mit \"mangelhaft\" ab\". Der Spiegel (in German). 21 November 2013. ISSN 2195-1349. Retrieved 19 June 2024. - ^ \"Ritter Sport erwirkt einstweilige Verfügung gegen Warentest\". Der Spiegel (in German). 28 November 2013. ISSN 2195-1349. Retrieved 26 June 2024. - ^ \"Aromen-Streit: Ritter Sport gewinnt gegen Stiftung Warentest\". Der Spiegel (in German). 13 January 2014. ISSN 2195-1349. Retrieved 26 June 2024. - ^ \"Stiftung Warentest verliert gegen Ritter Sport\". FAZ.NET (in German). 9 September 2014. Retrieved 26 June 2024. - ^ Warentest, Stiftung (25 September 2014). \"Rechtsstreit um \"Ritter Sport Voll-Nuss\" beendet: Stiftung Warentest erkennt Urteil des OLG München an\". www.test.de (in German). Retrieved 26 June 2024. - ^ \"Verordnung über Kakao- und Schokoladenerzeugnisse (Kakaoverordnung)\" (PDF). Gesetze im Internet. 2003. Retrieved 26 June 2024. - ^ Husmann, Nele (17 February 2021). \"Ritter Sports \"Keine Schokolade\". www.wiwo.de (in German). Retrieved 26 June 2024. - ^ Husmann, Nele (3 February 2021). \"Julia Klöckner: \"Ritter-Sport-Kreation mit Kakaozucker ist Schokolade\"\". www.wiwo.de (in German). Retrieved 1 July 2024. - ^ \"Ritter-Sport-Chef verteidigt Russland-Geschäfte: »Entscheidung war richtig«\". Der Spiegel (in German). 30 May 2024. ISSN 2195-1349. Retrieved 1 July 2024. - ^ \"Von wegen Gutmenschenschokolade: Wenn aus Ritter Sport \"Ritter Mord\" wird\". stern-amp.de (in German). 5 April 2022. Retrieved 1 July 2024. - ^ \"Von wegen Gutmenschenschokolade: Wenn aus Ritter Sport \"Ritter Mord\" wird\". stern.de (in German). Archived from the original on 17 July 2024. Retrieved 20 February 2025. - ^ \"Ritter Sport: 1,5 Mio. Euro für Ukrainehilfe\". W&V (in German). 5 January 2023. Retrieved 20 February 2025. - ^ \"Ritter-Sport-Chef verteidigt Russland-Geschäfte: »Entscheidung war richtig«\". Der Spiegel (in German). 30 May 2024. ISSN 2195-1349. Retrieved 20 February 2025. - ^ Thieme, Thomas (13 September 2021). \"Was Ritter Sport mit der Marke Amicelli vorhat\". absatzwirtschaft (in German). Retrieved 20 February 2025. - ^ \"Unsere neuen GIN Knusperstücke: So gut hat Gin noch nie geschmeckt\". RITTER SPORT Blog (in German). 10 August 2021. Retrieved 25 February 2025. - ^ \"Schluss mit dem Rumgerede, hier wird Rum geknuspert!\". RITTER SPORT Blog (in German). 8 June 2017. Retrieved 25 February 2025. - ^ \"Limitierte Edition: Ritter Sport Gin Knusperstück kommt im August\". www.presse-report.de (in German). Retrieved 25 February 2025. - ^ \"Andere Zeiten, anderer Look – die Ritter Balloon Riegel\". RITTER SPORT Blog (in German). 21 April 2016. Retrieved 25 February 2025. - ^ \"Retro-Süßigkeiten: Diese Schokoriegel gibt es nicht mehr\". t-online (in German). 3 July 2022. Retrieved 25 February 2025. - ^ a b Samland, Bernd M. (25 March 2022). \"Die Geschichte hinter dem Markennamen Ritter Sport\". absatzwirtschaft (in German). Retrieved 25 February 2025. - ^ \"Ein Schoko-Quadrat geht um die Welt\". 14 September 2007. Retrieved 25 February 2025. - ^ \"Deutscher Gründerpreis für Lebenswerk\". www.zdf.de (in German). 2 July 2019. Retrieved 25 February 2025. - ^ \"Die Schokoladen-Seite Stuttgarts -2 - Ritter - Sport\". www.wirtemberg.de. Retrieved 7 March 2025. - ^ \"Markenrecht: Warum Milka so scharf auf Ritter Sports Quadrat ist - WELT\". DIE WELT (in German). Retrieved 7 March 2025. - ^ \"Schokoladen-Streit: Ritter Sport behält Markenschutz für das quadratische Format\". FAZ.NET (in German). 18 October 2017. Retrieved 7 March 2025. - ^ Zeitung, Stuttgarter. \"Ritter Sport und Dextro Energy: Teilerfolg im Streit um Markenrecht\". stuttgarter-zeitung.de (in German). Retrieved 7 March 2025. - ^ Zeitung, Stuttgarter. \"Rechtsstreit von Ritter Sport und Milka: Quadratisch sein darf nur einer\". stuttgarter-zeitung.de (in German). Retrieved 7 March 2025. External links [edit]- Media related to Ritter Sport at Wikimedia Commons - Official website - Ritter Museum (in German)"
}