{
  "url": "https://www.usatoday.com/story/entertainment/tv/2026/02/01/snl-cold-open-this-week-minneapolis-pete-davidson/88402377007/",
  "title": "'SNL' cold open tackles Minneapolis and ICE as Pete Davidson returns",
  "text": "'SNL' takes on Minneapolis as Pete Davidson plays border czar Pete Davidson returned to \"Saturday Night Live\" and addressed the ongoing political turmoil surrounding immigration in the show's cold open. The former cast member returned to play White House border czar Tom Homan in a sketch tackling the political unrest happening in Minneapolis. President Donald Trump recently sent Homan there to lead immigration enforcement operations. In the sketch, Davidson's Homan spoke to a room full of confused U.S. Immigration and Customs Enforcement agents and grew frustrated while trying to explain why they should not use force against protesters or destroy evidence. After Davidson's Homan said that ICE's mission in Minneapolis is to \"detain and deport illegal immigrants who have committed crimes,\" one of the agents said this is \"literally the first I'm hearing of that.\" When he asked the agents what they're looking for in Minneapolis, an ICE agent responded, \"Epstein files?\" \"No, we actually just released those to distract from this,\" Davidson as Homan said. \"Which is ironic, because we did this to distract from those.\" The Justice Department on Jan. 30 released another 3 million pages of Jeffrey Epstein files, including 2,000 videos and 180,000 images. 'SNL' cold open with Pete Davidson tackles ongoing ICE raids, Don Lemon's arrest Homan then stressed that ICE agents should not use force, asking, \"The job, ultimately, is about keeping America safe from what?\" \"This could be wrong, but Don Lemon?\" an ICE agent responded, referring to the arrest of the former CNN anchor. Lemon, who now works as an independent journalist, was arrested on Jan. 29 over his coverage of immigration enforcement operations in Minnesota. Another journalist, Georgia Fort, and political activists Trahern Jeen Crews and Jamael Lydell Lundy were also arrested. Lemon was one of several journalists in attendance at the Jan. 18 protest of Cities Church in St. Paul, Minnesota. In a nearly seven-hour livestream on his YouTube channel at the time, he spoke with congregation members, protestors and one of the church's pastors. In light of his arrest, Lemon said his \"constitutionally protected work in Minneapolis was no different than what he has always done.\" He was released later on Friday. 'SNL' cold open comes as more Americans protest against ICE Davidson's Homan also addressed agents who say that protesters shouldn't be able to have guns, asking, \"How many of you went to a 'stop the steal' protest with a loaded automatic weapon?\" James Austin Johnson's ICE agent character eventually concluded, \"You hired a bunch of angry, aggressive guys, gave us guns and didn't train us, so this is maybe what you wanted to happen?\" The sketch ended with Davidson giving an inspirational speech to the agents, asking if they can do their jobs \"without violating anyone's rights as Americans,\" to which an agent played by Kenan Thompson simply replied, \"No.\" \"Well, I had to ask,\" Davidson's Homan said. \"Maybe just try not to get filmed?\" Tonight's \"SNL\" cold open comes amid continued anti-ICE demonstrations in the U.S. after federal agents fatally shot Alex Pretti and Renee Good. The previous episode of \"SNL\" on Jan. 24 opened with a sketch in which Johnson's President Donald Trump hosted an awards show reminiscent of the Oscars. The episode received backlash from some fans over the way it largely sidestepped the killing of Pretti, who was fatally shot by Border Patrol agents in Minneapolis earlier that same day. The Jan. 24 opening sketch only alluded to the events in Minneapolis when Johnson, as Trump, said he was trying to distract from \"what all my little freaks and psychos in ICE have been doing.\" Later in the Jan. 24 show, Minneapolis was briefly referenced on \"Weekend Update\" and in a sketch depicting a PBS news program. \"To have basically no mention of the absolute horror of today and the past month is a slap in the face,\" one fan wrote on the \"SNL\" subreddit after the episode aired, drawing thousands of upvotes. \"SNL\" further discussed Minneapolis during tonight's \"Weekend Update,\" with anchor Colin Jost saying he doesn't see Homan \"calming things down.\" \"This feels like trying to quit cocaine by taking up crack,\" Jost quipped. Who else was on 'SNL'? Alexander Skarsg책rd made his \"SNL\" hosting debut on the Jan. 31 episode, joined by Cardi B as the musical guest. Skarsg책rd is starring in the new Charli XCX mockumentary \"The Moment\" and the dark comedy \"Pillion,\" while Cardi B is coming off the release of her album \"Am I the Drama?\" in September. Skarsg책rd's father, Stellan Skarsg책rd, joined him during the episode, and \"30 Rock\" star Jack McBrayer also joined him for a cameo. Who's hosting 'SNL' next? \"SNL\" will return on Feb. 28 with host Connor Storrie and musical guest Mumford & Sons. Contributing: Melina Khan and Joey Garrison, USA TODAY"
}