{
  "url": "https://www.thefreedictionary.com/D",
  "title": "D - definition of D by The Free Dictionary",
  "text": "D Also found in: Thesaurus, Medical, Legal, Financial, Acronyms, Idioms, Encyclopedia, Wikipedia. D 1 1. The symbol for the isotope deuterium. 2. also d The symbol for the Roman numeral 500. D 2 abbr. 1. dative 2. day 3. Sports a. defender b. defense c. defensive 4. Democrat 5. divorced 6. down d 1 or D (dē)n. pl. d's or D's also ds or Ds 1. The fourth letter of the modern English alphabet. 2. Any of the speech sounds represented by the letter d. 3. The fourth in a series. 4. Something shaped like the letter D. 5. D The lowest passing grade given to a student in a school or college. 6. Music a. The second tone in the scale of C major or the fourth tone in the relative minor scale. b. A key or scale in which D is the tonic. c. A written or printed note representing this tone. d. A string, key, or pipe tuned to the pitch of this tone. d 2 abbr. 1. deuteron 2. diameter 3. differential 4. down quark American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. d (diː) orD n, pl d's, D's or Ds 1. (Linguistics) the fourth letter and third consonant of the modern English alphabet 2. (Phonetics & Phonology) a speech sound represented by this letter, usually a voiced alveolar stop, as in dagger 3. (Billiards & Snooker) the semicircle on a billiards table having a radius of 11 inches and its straight edge in the middle of the baulk line d symbol for 1. (General Physics) physics density or relative density 2. (Mathematics) maths a small increment in a given variable or function: used to indicate a derivative of one variable with respect to another, as in dy/dx 3. (Chess & Draughts) chess See algebraic notation D symbol for 1. (Music, other) music a. a note having a frequency of 293.66 hertz (D above middle C) or this value multiplied or divided by any power of 2; the second note of the scale of C major b. a key, string, or pipe producing this note c. the major or minor key having this note as its tonic 2. (Elements & Compounds) chem deuterium 3. (Mathematics) maths the first derivative of a function, as in D(x3 + x2) = 3x2 + 2x 4. (General Physics) physics a. dispersion b. electric displacement 5. (Aeronautics) aeronautics drag 6. (Industrial Relations & HR Terms) a. a semiskilled or unskilled manual worker, or a trainee or apprentice to a skilled worker b. (as modifier): D worker. See also occupation groupings 7. (Mathematics) (Roman numeral)500. See Roman numerals abbreviation for 8. Germany (international car registration) 9. (General Sporting Terms) informal a. defence: I'm playing D in the match this afternoon. b. Austral informal defensive play 10. (General Sporting Terms) informal Austral defensive play [(for sense 8) from German Deutschland] D orD. abbreviation for (Classical Music) Deutsch: indicating the serial number in the catalogue (1951) of the musical compositions of Schubert made by Otto Deutsch (1883–1967) Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 D, d (di)n., pl. Ds D's, ds d's. 1. the fourth letter of the English alphabet, a consonant. 2. any spoken sound represented by this letter. 3. something shaped like a D. 4. a written or printed representation of the letter D or d. dd- Biochem. Symbol. (of a molecule) having a configuration resembling the dextrorotatory isomer of glyceraldehyde: printed as a small capital, roman character (disting. from l-). d- Symbol. dextrorotatory; dextro- (disting. from l-). d' ,Pron. Spelling. do (esp. before you): How d'you like them? 'd 1. contraction of had: They'd already left. 2. contraction of would: I'd like to see it. 3. contraction of did: Where'd you go? 4. contraction of - ed: She OK'd the plan. D 1. deep. 2. depth. 3. diopter. 4. divorced. 5. Dutch. D Symbol. 1. the fourth in order or in a series. 2. (sometimes l.c.) (in some grading systems) a grade or mark indicating poor or barely acceptable quality. 3. a. the second note of the ascending C major scale. b. a tonality having D as the tonic. 4. (sometimes l.c.) the Roman numeral for 500. Compare Roman numerals. 5. deuterium. D. 1. day. 2. December. 3. Democrat. 4. Democratic. 5. Physics. density. 6. Deus. 7. Deuteronomy. 8. Doctor. 9. dose. 10. Dutch. d. 1. date. 2. daughter. 3. day. 4. deceased. 5. deep. 6. degree. 7. delete. 8. Brit. pence. [< Latin denāriī] 9. Chiefly Brit. penny. [< Latin denārius] 10. Physics. density. 11. depth. 12. deputy. 13. dialect. 14. diameter. 15. died. 16. dime. 17. dividend. 18. dollar. 19. dose. 20. drachma. Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. d Abbreviation of diameter The American Heritage® Student Science Dictionary, Second Edition. Copyright © 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. D 1. A member of the occupation grouping typically consisting of semiskilled or unskilled workers. 2. A semicircle centered on the balk line from within which the cue ball is struck at the start of a game. 3. Semicircle, centered on the balk line, from within which the cue ball is struck at the start of a frame. Dictionary of Unfamiliar Words by Diagram Group Copyright © 2008 by Diagram Visual Information Limited ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. Translations D 1 d1 [diː] ND 2A. N (Scol) (= mark around 50%) → aprobado m, suficiente m B. ABBR (US) (Pol) =Democrat(ic) d 2 ABBR1. =date → fha. 2. =daughter → hija f 3. =died → m. 4. (Rail etc) =depart(s) 5. (Brit) (o.f.) =penny Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 D d [ˈdiː] n (= grade) note attribuée à un travail insuffisant et qui équivaut à une note comprise entre 4/20 (pour un D-) et 8/20 (pour un D+) I got a D+ → J'ai eu 8. I got a D- → J'ai eu 4. I got a D+ → J'ai eu 8. I got a D- → J'ai eu 4. (MUSIC) D → ré m abbr (US) = democrat, democratic (British) (formerly) → penny m Collins English/French Electronic Resource. © HarperCollins Publishers 2005 D , dn → D nt, → d nt; (Sch, as a mark) → ausreichend; D sharp → Dis nt, → dis nt; D flat → Des nt, → des nt ? also major, minor, natural D (US Pol) abbr of Democratic → dem.d (Brit old) abbr of pence Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 D d [diː]1. n a. (letter) → D, d f or m inv D for David (Am) D for Dog → D come Domodossola D for David (Am) D for Dog → D come Domodossola b. (Mus) → re m inv Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995"
}