{
  "url": "https://www.usatoday.com/story/money/food/2025/10/14/lays-potato-chips-rebranding/86689826007/",
  "title": "Lay's unveils chip bag redesign, ingredient overhaul in rebrand",
  "text": "Lay's reveals its biggest rebrand in nearly a century. See what's new. Your favorite potato chip may look a little different the next time you reach for it at the grocery store. Lay's announced on Oct. 9 it has redesigned its chip bags and its recipes in what the PepsiCo-owned brand is calling the \"largest brand redesign in Lay's nearly 100-year history.\" As part of this redesign, the chip brand said it is removing artificial flavors and colors from all core Lay's products in the U.S. by the end of 2025. Lay's Baked and Lay's Kettle Cooked chips are also getting an ingredient update, according to the news release, as Lay's Baked will be made with olive oil and have 50% less fat than regular potato chips, while a new version of Lay's Kettle Cooked Reduced Fat Original Sea Salt will be made with avocado oil and offer 40% less fat than regular potato chips. \"At Lay’s, delighting our consumers goes beyond bold flavors — it’s about delivering trusted quality from farm to bag,\" says Denise Truelove, SVP of Marketing, PepsiCo Foods US, in the news release. \"These updates were shaped directly with our consumers, offering more choice, more transparency, and more joy with every bite. Lay’s continues to set the gold standard in snacking and we’re proud to carry that legacy forward.\" Lay's reimagines iconic yellow bag PepsiCo said the new Lay's bag \"now tells a story that speaks to its legacy of authenticity\" while honoring the \"potatoes' journey from farm to bag\" and the brand's commitment to using only quality ingredients. The new Lay's logo features a warmer and more distinct sun with some sun rays, or \"Lay's Rays,\" beaming from the logo. \"A refined color palette was inspired by the ingredients of Lay's recipes: pickle green, hickory brown, savory red and more,\" according to the news release, while enhanced photography showcases the \"quality and flavor\" of every chip with close-up visuals that highlight the \"golden color, crisp texture and seasoning\" of each chip, according to PepsiCo. The phrase \"made with real potatoes\" is also inscribed on the bag, as Lay's pointed out in its news release that 42% of people who eat Lay's potato chips don't realize they are made with real, farm-grown potatoes. Here's a look at what Lay's potato chip bags have looked like in the past. \"This redesign, the brand’s biggest in nearly a century, is a love letter to our origins,\" says Carl Gerhards, PepsiCo’s Senior Director of Design, Global Lay’s, in the news release. \"With the new Lay’s visual identity, our team created a flexible design system that celebrates the brand’s famous flavors in countries around the world.\" Gabe Hauari is a national trending news reporter at USA TODAY. You can follow him on X @GabeHauari or email him at Gdhauari@gannett.com."
}