{
  "url": "https://www.falk.de/routenplaner",
  "title": "Falk Routenplaner - Ihr kostenloser Routenplaner",
  "text": "Routenplaner von Falk Mit dem Falk Routenplaner können Sie völlig kostenfrei alle Strecken von A nach B planen. Von kleinen Strecken bis hin zur langen Autoreise ins Ausland – dieser Routenplaner ist Ihr zuverlässiger Begleiter. Geben Sie als Startpunkt Ihrer Fahrt einfach die exakte Adresse, Ihre Stadt oder einen beliebten Ort an und wiederholen Sie diesen Schritt für Ihre Zielangabe. Es wird die Route berechnet, welche Sie am schnellsten zur gewünschten Adresse bringt. Wenn Sie genügend Zeit für Ihre Reise mitbringen, gibt Ihnen der Routenplaner mit einem einzigen Klick die kürzeste und damit kostengünstigste Alternative an. Da diese Routen meist über Landstraßen, eventuell mit Ampelbetrieb, führen, kann es etwas länger dauern. Für die Verwendung dieses Routenplaners ist weder ein Login, noch eine Mitgliedschaft erforderlich. Jeder kann unseren Wegplaner frei und kostenlos in Anspruch nehmen. Ob Geschäftsreisende oder Familien auf dem Weg in den Urlaub – unser Angebot richtet sich an alle Menschen, die unkompliziert mit dem Auto, der Bahn, dem Fahrrad oder zu Fuß unterwegs sein möchten. Zuverlässige Routenplanung Die im Falk Routenplaner verwendeten Daten beruhen auf aktuellen Straßenverläufen und Verkehrsdaten. So können Sie sichergehen, dass unsere Routenbeschreibung zeitgemäß sowie exakt sind und die beste Ausgangslage für Ihre Reiseplanung darstellen. Mit Extras wie der aktuellen Verkehrssituation auf Ihrer Strecke oder Blitzerstandorten gibt Ihnen der Routenplaner zusätzliche Sicherheit für einen reibungslosen Ablauf Ihrer Fahrt. Routenplaner für unterwegs mit der Falk Maps App Um auch unterwegs immer von unserer zuverlässigen Routenplanung profitieren zu können, finden Sie in den Stores von Android und iOS unsere kostenlose Falk Maps App. Hier profitieren Sie von der gewohnten großen Kartenauswahl und unkomplizierten Routenberechnungen. Zudem Zudem haben registrierte User die Möglichkeit eine Route mit dem PC auf falk.de zu planen, zu speichern und anschließend mit dem Smartphone ganz bequem abzurufen. Denn die gespeicherte Tour wird automatisch im Userprofil hinterlegt und kann nach entsprechender Anmeldung in der Falk Maps App auch dort abgerufen werden. Angabe von Halteplätzen Wenn Ihre Route eine längere Strecke umfasst, sollten Sie sich zwischendurch eine Pause gönnen. Um sich auch hier eine stressige Suche während der Fahrt zu ersparen, zeigt Ihnen dieser Routenplaner schon vorab Raststätten, Parkplätze oder Tankstellen auf Ihrer Strecke. Wählen Sie Ihren gewünschten Halteplatz schon während der Routenplanung und fahren Sie entspannt und stressfrei los. Alternative Fortbewegungsmittel Wenn Ihnen die vom Routenplaner veranschlagten Kosten einer Fahrt mit dem Auto zu hoch sind, gibt es natürlich noch viele weitere Alternativen: Wir bieten Ihnen auch die Möglichkeit, Ihre Route mit öffentlichen Verkehrsmitteln wie Bus und Bahn zu planen. Für die Sportlichen unter Ihnen, die zum Beispiel eine Wander- oder Fahrradtour im Sommer planen, bietet der Falk Routenplaner die Möglichkeit, auch diese Strecken angepasst an Ihre Anforderungen zu planen. Zusätzlich zum Wegplaner Nach der Routenberechnung mit unserem Wegplaner stehen Ihnen unsere vielfältigen Zusatzinformationen zur Verfügung. Klicken Sie etwa auf den grünen Button in der unteren rechten Ecke und lassen Sie sich von unserem Reiseführer inspirieren. Restaurants, Sehenswürdigkeiten, Wetter uvm. zur aktuellen Stadt warten darauf, entdeckt zu werden. Oder nutzen Sie unseren Stadtplandienst und drucken den richtigen Kartenausschnitt für Ihre Reise aus. Auch aktuelle Verkehrsinfos oder Parkplätze entlang der Strecke lassen sich mit einem Mausklick einblenden. Denn für eine Reiseplanung benötigt man mehr als nur eine gute Wegbeschreibung mit Fahrdauer und Richtungsangaben. Beliebte Stadt-Routenplaner: Routenplaner Berlin I Routenplaner München I Routenplaner Hamburg I Routenplaner Frankfurt am Main Wir freuen uns, wenn Nutzer von Map24, Viamichelin bzw. Michelin Routenplaner, ADAC Routenplaner den Falk Routenplaner ausprobieren! Maps Haben Sie eine eigene Website? Dann nutzen Sie unser kostenloses Routenplaner-Widget für die eigene Website! Falk.de für Smartphones und Tablets: Falk Mobile Suchen Sie eine Karte der Welt oder von Europa? Hier geht es zur Weltkarte, hier zur Europakarte."
}