{
  "url": "https://tarisio.com/cozio-archive/browse-the-archive/makers/maker/?Maker_ID=240",
  "title": "Bartolomeo Giuseppe Guarneri 'del Gesù' | Tarisio",
  "text": "Bartolomeo Giuseppe Guarneri 'del Gesù' Violin maker (1698 – 1744) Giuseppe Guarneri's two sons Pietro of Venice and Giuseppe 'del Gesù' both trained with and assisted him in the 1710s, but in keeping with the individuality of the Guarneri tradition their conceptions of violin making developed along strikingly dissimilar lines. While Pietro earns respect for his deft combination of Cremonese and Venetian styles, the rich and complex tonal quality of 'del Gesù''s instruments distinguish him as one of the greatest violin makers in history. His earliest known independently-produced instruments date from the 1720s, but his trademark IHS (Iesus Hominem Salvator) label did not appear until 1731. In general, 'del Gesù''s work seems influenced by the Brescian school, particularly the elongated c-bouts and f-holes. The 1730s represent the peak of his craftsmanship, especially the It seems Giuseppe's startling creativity and daring in design and construction more than compensated for his corresponding lack of interest in the details of workmanship, and his violins are equally as exalted as Stradivari's, though by players of divergent tastes. The two have markedly different, almost incomparable, tonal qualities: the violins of 'del Gesù' conserve sweetness but possess unsurpassed depth and darkness of sound that some players prefer. Indeed much of his posthumous fame is owed to Paganini, who counted the 1743 Price History - The auction record for this maker is $9,440,000 in Mar 2023, for a violin. - 41 auction price results. View all auction prices for Bartolomeo Giuseppe Guarneri 'del Gesù' Guarneri family tree Instruments Violin - c. 1715-22 Cremona the 'Folinari' Violin - c. 1715-22 Cremona the 'Billotet-Guilet' Violin - c. 1715-22 Cremona the 'Frank, Sin' Violin - c. 1715-22 Cremona the 'Marteau Habisreuthinger' Violin - c. 1715-22 Cremona the 'Rappoldi, Campbell'"
}