{
  "url": "https://en.wikipedia.org/wiki/Alfred_Dunhill_Limited",
  "title": "Alfred Dunhill Limited - Wikipedia",
  "text": "Alfred Dunhill Limited Alfred Dunhill Limited (known and stylised as dunhill) is a British luxury goods brand, specialising in ready-to-wear, custom and bespoke menswear, leather goods, and accessories.[2] The company is headquartered in Westminster, London. It also owns and operates a leather and smoking pipe workshop in Walthamstow. Dunhill is currently owned by Richemont and managed by CEO ad interim Andrew Holmes.[1] The brand is sold in the UK, US, China, Japan, and Taiwan.[3] History [edit]Early history [edit]Alfred Dunhill Limited was developed by Alfred Dunhill (1872–1959) after he inherited his father's saddlery business on London's Euston Road at the age of 21 in 1893. Alfred Dunhill developed a line of automobile accessories called \"Dunhill's Motorities\". This first collection included car horns and lamps, leather overcoats, goggles, picnic sets and timepieces, which provided the company with the strap line of \"Everything But The Motor\". Within a few years, the business moved towards the luxury market with the opening of two Dunhill Motorities stores in Mayfair. In 1904 Dunhill had patented a \"Windshield Pipe\" to help a driver smoke while driving. Dunhill's first tobacconist and pipe shop opened in 1907 on Duke Street. Dunhill retired from the business in the 1920s, leaving the position of managing director and president to his brother Alfred-Henry, then daughter Mary, and finally his grandson Richard. Later history [edit]In the mid-1950s, Dunhill produced one of the first butane gas lighters. This design has remained relatively unchanged since and was regularly used by James Bond in both print and on the screen. In 1967, Rothmans International, which was controlled by Anton Rupert's Rembrandt Group, acquired 50.6% of the company.[4][5] By 1975, Dunhill had sales of £35 million, 75% of which came from lighters.[6] In 1977, the company acquired 59.6% of the West German manufacturer and distributor of high quality writing instruments, Montblanc, for Deutschemark 6.4 million and the brand was used on a wide range of luxury goods other than pens.[7][8] By the late 1970s, Alfred Dunhill was offering a range of 3,500 luxury products in more than 20 stores round the world. In 1979 and 1980, Dunhill acquired 36.8% of jewellers, Asprey and tried to gain control but failed, although made £1 million profit from the venture.[4][5] By 1985, the group's revenues had increased over ten times in ten years to £450 million, with only 10% now being from the traditional business.[6] In March 1985, the company expanded further, acquiring French fashion house, Chloé, for £6.5 million and took its ownership in Montblanc up to 100% from 91%.[9][6] Alfred Dunhill began sponsoring golf tournaments in 1985, with the first annual Dunhill Cup golf tournament, following up in 2001 with its successor, the Alfred Dunhill Links Championship. By 1993, Rothmans owned 57% of Dunhill and it was decided to separate the groups, with one for tobacco (a new Rothmans International) and one for luxury goods (Vendôme Luxury Group), with Dunhill becoming wholly owned by Vendôme, together with Cartier. Vendôme was controlled by Richemont, founded by Anton Rupert's son Johann.[10][11] Dunhill also released fragrances, with a ten-year licensing agreement with Inter Parfums, Inc. made in 2013, replacing a prior agreement with Procter & Gamble. The brand's first perfume (Dunhill for Men) was launched in 1934.[12] See also [edit]References [edit]- ^ a b \"Persons with significant control\". Companies House. Retrieved 17 November 2018. - ^ \"ALFRED DUNHILL LIMITED\". Companies House. Retrieved 15 February 2018. - ^ Store locations - ^ a b Wainwright, Peter (3 April 1980). \"Could this be the fall of the House of Asprey?\". The Times. p. 21. - ^ a b Wainwright, Peter (15 May 1980). \"How 'old pals' came to the aid of Asprey's\". The Times. p. 19. - ^ a b c Dunhill Holdings plc Report and Accounts Year ended 31st March 1985. 31 March 1985 – via Companies House. - ^ \"Penspotters :: Montblanc pens\". rickconner.net. Archived from the original on 11 January 2018. Retrieved 18 August 2024. - ^ dunhill Report and Accounts Year ended 31st March 1977. 31 March 1977 – via Companies House. - ^ dunhill Report and Accounts for the year ended 31st March 1985. 31 March 1985 – via Companies House. - ^ Campbell, Colin (23 June 1993). \"Rothman's to separate tobacco and luxury goods operations\". The Times. p. 28. - ^ Vendôme Luxury Group plc. 31 March 1994 – via Companies House. - ^ \"Alfred Dunhill\". alfredltd.ru. Retrieved 20 June 2025. Further reading [edit]- Barker, Christian. \"High Gear\". August Man magazine (December 2006) - Dunhill, Mary (2001). Our Family Business. London: Bodley Head. ISBN 978-0-370-30229-4. - Foulkes, Nick (2006). Dunhill By Design: A Very English Story ISBN 2-08-030495-X. External links [edit]"
}