{
  "url": "https://support.microsoft.com/pt-br/windows/explorador-de-arquivos-no-windows-ef370130-1cca-9dc5-e0df-2f7416fe1cb1",
  "title": "Explorador de Arquivos no Windows - Suporte da Microsoft",
  "text": "Explorador de Arquivos no Windows Aplica-se a Explorador de Arquivos no Windows 11 ajuda-o a obter os ficheiros de que precisa de forma rápida e fácil. Para marcar no Windows 11, selecione-o na barra de tarefas ou no menu Iniciar ou prima a tecla do logótipo do Windows + E no teclado. Como utilizar Explorador de Arquivos: - Para afixar uma pasta ao Acesso rápido, clique com o botão direito do rato (ou prima sem soltar) na pasta e selecione Afixar ao Acesso rápido. - Para partilhar um ficheiro, selecione-o e, em seguida, selecione Partilhar no friso. - Para mover a localização de um ficheiro ou pasta, selecione-a e, em seguida, selecione Cortar no friso. Navegue para a nova localização e, em seguida, selecione Colar . Observação: Para ficheiros e pastas no Acesso rápido, terá de clicar com o botão direito do rato (ou premir sem soltar) e selecionar Abrir antes de poder cortar e colar. - Para alterar a forma como os seus itens aparecem no Explorador de Arquivos, selecione Ver no friso e escolha entre mostrar ícones, listas, detalhes e muito mais. - Para reduzir o espaço entre ficheiros, selecione Ver > Vista Compacta. - Para localizar ficheiros relevantes do seu PC e da nuvem, pesquise a partir do Explorador de Arquivos Home Page. Observação: Inicie sessão nas suas contas na cloud a partir de Iniciar > Definições > Contas para ativar a pesquisa na cloud. Comandos de acesso A partir do Windows 11, versão 22H2, as pastas conhecidas do Windows ( Ambiente de Trabalho, Documentos, Transferências, Imagens, Música e Vídeos) estão disponíveis por predefinição como pastas afixadas no Acesso rápido no painel de navegação Explorador de Arquivos Base e à esquerda. Estas pastas predefinidas já não são apresentadas em Este PC para manter a vista focada nas unidades do PC e nas localizações de rede. Pode definir qualquer pasta para aparecer no Acesso rápido para que seja fácil encontrá-la. Basta clicar com o botão direito do rato (ou premir sem soltar) e selecionar Afixar ao Acesso rápido. Remova-o quando já não precisar dele, clicando com o botão direito do rato (ou premindo-o durante muito tempo) e selecionando Remover do Acesso rápido. Se remover estas pastas conhecidas do Windows e decidir restaurá-las mais tarde, eis uma forma fácil de restaurá-las no Acesso rápido em Base e no painel de navegação: - Selecione Iniciar > Explorador de Arquivos ou selecione o ícone de Explorador de Arquivos na barra de tarefas. - Selecione Base no painel de navegação esquerdo. - Selecione a Seta para cima nos botões de navegação disponíveis à esquerda da barra de endereço. Esta vista apresenta todas as seis pastas conhecidas do Windows: Ambiente de Trabalho, Documentos, Transferências, Imagens, Música e Vídeos. - Selecione sem soltar (ou clique com o botão direito do rato) na pasta que pretende restaurar e selecione Afixar ao Acesso rápido no menu de contexto. A pasta estará agora disponível no painel de navegação e no Explorador de Arquivos Home Page. Se tiver ocultado o painel de navegação esquerdo e quiser torná-lo visível na janela Explorador de Arquivos, pode mostrá-lo novamente com estes passos: - Selecione Iniciar > Explorador de Arquivos ou selecione o ícone de Explorador de Arquivos na barra de tarefas. - Selecione Ver na Barra de Comandos. - Selecione Mostrar e, em seguida, selecione Painel de Navegação. O painel de navegação deverá estar agora visível na janela Explorador de Arquivos. Menu de contexto Explorador de Arquivos tem um menu de contexto novo e simplificado, o que facilita a obtenção de comandos populares. Clique com o botão direito do rato num ficheiro para aceder ao novo menu de contexto. Pode encontrar Cortar , Copiar , Colar , Mudar o Nome , Partilhar e Eliminar na parte superior do menu de contexto. Paire o cursor sobre qualquer ícone para ver o respetivo nome. - Clique com o botão direito do rato (ou selecione sem soltar) num ficheiro ou pasta para abrir o menu de contexto. - Selecione Mostrar mais opções. Observação: Nem todas as extensões de Windows 10 estarão disponíveis no menu de contexto Windows 11 simplificado, mas estarão sempre disponíveis ao selecionar Mostrar mais opções. Algumas aplicações serão atualizadas ao longo do tempo para aderir ao novo menu de contexto. Contacte o programador da aplicação sobre a disponibilidade e a temporização de aplicações específicas. Opções de Explorador de Arquivos comuns Por predefinição, Explorador de Arquivos abre para Acesso rápido, com o nome mudado para Explorador de Arquivos Home Page em Windows 11, Versão 22H2. Recomendamos a Home Page como página de destino no Explorador de Arquivos, onde pode: - Aceda rapidamente aos seus ficheiros de Office.com favoritos e mais recentes. - Pesquise e encontre os seus ficheiros relevantes a partir do PC e da nuvem muito mais rapidamente do que com Este PC. Se preferir ter Explorador de Arquivos aberto a Este PC, no friso, selecione Ver mais opções de >> Abrir Explorador de Arquivos e, em seguida, selecione Este PC > Aplicar. Abra o Explorador de Arquivos na barra de tarefas. Selecione Ver > Mostrar e, em seguida, selecione Extensões de nome de ficheiro para ver extensões de nome de ficheiro. Abra o Explorador de Arquivos na barra de tarefas. Selecione Ver > Mostrar e, em seguida, selecione Itens ocultos para ver ficheiros e pastas ocultos. Abra o Explorador de Arquivos na barra de tarefas. Selecione Ver > Mostrar e, em seguida, selecione Caixas de marcar de itens para ver uma caixa de marcar junto a ficheiros e pastas para as selecionar. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. Como muitas das coisas mais refinadas da vida, o Explorador de Arquivos ficou melhor com a idade. Para marcar no Windows 10, selecione o ícone na barra de tarefas ou no menu Iniciar ou prima a tecla do logótipo do Windows + E no teclado. Veja a seguir algumas alterações importantes para o Windows 10: - O OneDrive faz parte do Explorador de Arquivos. Para obter um guia rápido sobre como funciona, marcar o OneDrive no seu PC. - Quando o Explorador de Arquivos for aberto, você entrará no Acesso rápido. As pastas usadas com frequência e os arquivos usados recentemente ficam listados ali, assim você não precisa procurar por eles uma série de pastas para encontrá-los. Fixe suas pastas favoritas ao Acesso rápido para mantê-las à mão. - Agora, você pode usar aplicativos para compartilhar arquivos e fotos diretamente de Explorador de Arquivos. Selecione os ficheiros que pretende partilhar, aceda ao separador Partilhar , selecione o botão Partilhar e, em seguida, selecione uma aplicação. - As bibliotecas não são apresentadas no Explorador de Arquivos, a menos que queira. Para adicioná-los ao painel esquerdo, selecione o separador Ver > Painel de navegação > Mostrar bibliotecas. Comandos de acesso Por predefinição, Explorador de Arquivos abre para Acesso Rápido. Pode definir uma pasta para aparecer no Acesso rápido para que seja fácil encontrá-la. Basta clicar com o botão direito do rato (ou premir sem soltar) e selecionar Afixar ao Acesso rápido. Remova-o quando já não precisar dele, clicando com o botão direito do rato (ou premindo-o durante muito tempo) e selecionando Remover do Acesso rápido. Se quiser ver apenas as pastas afixadas, pode desativar ficheiros recentes ou pastas frequentes. Aceda ao separador Ver e, em seguida, selecione Opções. Na secção Privacidade, desmarque as caixas de marcar e selecione Aplicar. Agora o Acesso rápido só mostrará suas pastas fixas. (Se voltar a ativá-los, os ficheiros que removeu anteriormente do Acesso rápido poderão aparecer novamente.) Também pode remover ficheiros do Acesso rápido. Se aparecer algo que não pretenda ver novamente, clique com o botão direito do rato (ou prima sem soltar) e selecione Remover do Acesso rápido. O item não aparecerá mais lá, mesmo se você usá-lo todos os dias. Observação: As bibliotecas não são apresentadas no Explorador de Arquivos, a menos que queira. Para adicioná-los ao painel esquerdo, selecione o separador Ver > Painel de navegação > Mostrar bibliotecas. Opções de Explorador de Arquivos comuns Por predefinição, Explorador de Arquivos abre para Acesso rápido. Se preferir ter Explorador de Arquivos aberto a Este PC, aceda ao separador Ver e, em seguida, selecione Opções. Na lista Abrir Explorador de Arquivos a: selecione Este PC e, em seguida, selecione Aplicar. - Abra o Explorador na barra de tarefas. - Selecione Exibir > Opções > Alterar pasta e opções de pesquisa. - Selecione o separador Ver e, em Definições avançadas, desmarque Ocultar extensões para tipos de ficheiro conhecidos e OK. - Abra o Explorador na barra de tarefas. - Selecione Exibir > Opções > Alterar pasta e opções de pesquisa. - Selecione a guia Exibir e, em Configurações avançadas, selecione Mostrar arquivos, pastas e unidades ocultas e OK. - Abra o Explorador na barra de tarefas. - Selecione Exibir > Opções > Alterar pasta e opções de pesquisa. - Selecione o separador Ver e, em Definições avançadas, selecione Utilizar marcar caixas para selecionar itens e OK."
}