{
  "url": "https://blogs.timesofisrael.com/after-the-missiles-israels-next-existential-battle/",
  "title": "The Blogs: After the Missiles: Israel's Next Existential Battle | Jennifer Laszlo Mizrahi | The Times of Israel",
  "text": "After the Missiles: Israel’s Next Existential Battle For now, Israel’s war with Iran appears to be over. For the most part, sirens have stopped wailing, Iron Dome batteries are on standby, and families have emerged from their bomb shelters. But as the smoke clears, another war rages on—a quieter, slower, yet far deadlier battle. It doesn’t come with warning sirens or interceptions, but it threatens every Israeli, every Jew, and every person on Earth. It’s the climate crisis. Just as Israel mobilized its full power to defend against missiles from Iran, we must now summon that same level of urgency to fight the threats we cannot shoot down: deadly heatwaves, water shortages, rising food prices, and climate-driven instability in the Middle East and beyond. As Yoni Sappir, the CEO of the climate innovation company Future and Chair of Israel Earth Guardians, recently wrote, “The climate crisis does not wait for human consensus or for economic transitions—it strikes us with increasing force: wildfires, floods, heatwaves, droughts, and more.” Indeed, climate disasters claim more lives globally each year than terrorism and war combined. The Climate Frontline Is Here Israel already feels the effects. The last decade was the hottest in our history. We’ve seen unprecedented droughts, marine heat waves devastating our fish stocks, and record-breaking summer temperatures that threaten our elderly, people with disabilities, and low-income families most. Our military leaders know this too—climate chaos fuels regional instability, migration crises, and resource-driven conflicts. Yoni Sappir warns, “Climate change is not only an environmental threat—it’s a major economic risk. The pace of the energy transition will determine humanity’s future.” His words could not be more relevant as Israel faces both a national security and economic crossroads. From Fossil Dependence to Energy Independence Incredibly, while rockets were falling, another battle was happening quietly in the global economy: the race to end fossil fuel dependence. Sappir notes that as of 2024, “global investment in clean energy is nearly double that of fossil fuels,” and that renewable electricity is now cheaper than gas or coal almost everywhere. Israel, a nation founded on resilience and innovation, has a chance to lead. But Sappir points out a sobering reality: “In 2022, about 79% of total energy consumption across all sectors—electricity, industry, transport, buildings, agriculture—still came from fossil fuels.” Despite progress in solar energy, much of Israel’s economy is still shackled to imported fossil fuels, making us vulnerable both economically and geopolitically. Climate Change Is an Economic Threat—and Opportunity The numbers are staggering. According to Sappir, climate-related damages globally are already in the trillions: “Since 2000, the frequency of [climate] events has risen by 83%, and economic losses have more than doubled.” This isn’t a distant threat—it’s a present and growing drain on every country’s economy, including Israel’s. But just as the threat is enormous, so is the opportunity. Sappir writes, “Transitioning rapidly to a low-carbon economy is not only a climate imperative—it’s a massive economic opportunity. It will boost global GDP and, just as importantly, prevent its collapse.” Israel’s innovation sector—known for turning adversity into breakthrough—can lead the way in clean energy, water solutions, climate-resilient agriculture, and more. We have the brains. We have the entrepreneurial spirit. What’s needed now is the political will. Fighting for Our Future This isn’t theoretical. The World Bank projects that by 2050, tens of millions of climate refugees could destabilize regions globally, including the Middle East. Food and water shortages, coupled with extreme heat, could amplify conflicts far worse than what we’ve seen from Iran. As Sappir bluntly puts it, “We are in a race between escalating climate disasters—which also disrupt economies—and global progress toward a low-carbon economy that can mitigate the damage.” It’s time for the Israeli government, philanthropists, businesses, and civil society to treat the climate crisis with the same seriousness we devote to national defense. Just as we invest in Iron Dome, we must invest in solar roofs, clean transportation, energy storage, and climate-smart agriculture. The existential threat is real. But so is the opportunity to build a safer, stronger, and more prosperous Israel. A Call to Action The battle with Iran may be paused, but the climate battle accelerates daily. Let this be the moment when Israel rises—not just as a Start-Up Nation—but as a Sustainability Nation, leading the world in climate resilience and innovation. Our survival depends on it."
}