{
  "url": "https://en.wikipedia.org/wiki/Crystal_Bowersox",
  "title": "Crystal Bowersox - Wikipedia",
  "text": "Crystal Bowersox Crystal Lynn Bowersox (born August 4, 1985) is an American singer, songwriter and actress who was the runner-up on the ninth season of American Idol. She was the first female finalist in three years. Bowersox's debut album, Farmer's Daughter, was released on December 14, 2010 by Jive Records. Bowersox released her second album, All That for This, on March 26, 2013. Early life [edit]Bowersox and her twin brother, Karl, were born in Elliston, Ohio[1] to Kelly Lynn Bowersox (née Bowlander) and William Lester Bowersox.[2] Her parents divorced when she was two years old.[3] At age six, Bowersox was diagnosed with type 1 diabetes. She attended Oak Harbor High School in Oak Harbor, Ohio and later attended the Toledo School for the Arts in Toledo, Ohio.[1] She was in choir and played flute in the school marching band. Bowersox performed her first professional gig at the age of 10. She appeared at local bars in Toledo, most popularly Papa's Tavern, and The Village Idiot in Maumee, Ohio. At the age of seventeen, she moved to Chicago, where she played music as a busker at train stations, including the Washington and Lake Redline stops. She frequented open mics, such as the In One Ear show at the Heartland Cafe, and Uncommon Ground Clark and Grace, and Devon locations. She also played extensively in Chicago's Lakeview neighborhood. In 2006, the Chicago Department of Cultural Affairs chose Bowersox to represent Chicago folk musicians in the Sister Cities program \"Experience Chicago\", held in Birmingham. In 2007, Bowersox traveled internationally on an independent small cafe tour, including Memphis, Oaxaca City, Ankara and Istanbul. She gave birth to a son, Anthony Levi Mason, in 2009;[3] according to Bowersox, his father left her six weeks into her pregnancy.[citation needed] American Idol [edit]Bowersox auditioned for American Idol in Chicago, Illinois. She sang \"Piece of My Heart\". Guest judge Shania Twain commented that she had a \"raw, natural talent.\"[4] On March 2, 2010, Bowersox was hospitalized due to Diabetic ketoacidosis (DKA) from type 1 diabetes, forcing a last minute switch in scheduling to give her extra time to recuperate. Bowersox confirmed the illness on the May 19, 2010 results show during an interview with host Ryan Seacrest.[5][6] The men competed that day instead of the women. She sang the next day and impressed all of the judges.[7] The following week, her strong performance prompted Simon Cowell to state, \"Right now, you are the one everyone has to beat.\"[8] After Siobhan Magnus's elimination from the top 6 of American Idol, Bowersox became the last remaining female contestant in the competition. Bowersox was the first female contestant to make it to the finale since Jordin Sparks won the title in 2007. She is also the first contestant in American Idol history to have one of their original songs played on the show, or at least during their hometown package.[9] Crystal's original song \"Holy Toledo\" was played on the May 19 Top 3 Results show as the background music for her homecoming package - when she returned to Toledo, Ohio and Elliston, Ohio the previous weekend - and segued into her live performance of the same song at \"Bowerstock\". During her time on Idol, Bowersox dated Tony Kusian, but the couple broke up just hours before the Idol finale.[10] On the final performance day, in Simon Cowell's final critique on American Idol, he called her performance of \"Up to the Mountain\" \"outstanding\" and \"by far, the best performance and song of the night\". On May 26, 2010, Bowersox was named runner-up to winner Lee DeWyze. She announced that after her Idol career, she wants to bring more awareness to type 1 diabetes.[11] Bowersox is the third Idol Runner-Up (preceded by Clay Aiken and David Archuleta) to never be in the Bottom 3 or Bottom 2. Performances [edit]- ^Note 1 Due to the judges using their one 'save' for Michael Lynche, the Top 9 remained intact for another week. - ^Note 2 Though Crystal Bowersox was the last contestant announced to be 'safe' and moving on to the Top 3, Ryan Seacrest stressed on the Top 4 Results Night that 'safe' contestants would be announced \"in no particular order.\"[12] Thus, the audience has no way of knowing which of the Top 3 was the second-lowest vote-getter that night after Michael Lynche, who was eliminated. - ^Note 3 Song selected by Ellen DeGeneres. Post-Idol career [edit]On May 27, 2010, one day after Bowersox's second place Idol finish, it was announced that she had signed with 19 Entertainment/Jive Records.[13] Her single \"Up to the Mountain\" has since been released to radio stations and iTunes. 2010–12: Farmer's Daughter [edit]Bowersox's debut album, Farmer's Daughter, was released to stores and iTunes on December 14, 2010. Bowersox performed her single \"Farmer's Daughter\" on The Ellen DeGeneres Show on December 16, 2010. On October 7, 2011, RCA Music Group announced it was disbanding Jive Records along with Arista Records and J Records. With the shutdown, all other artists previously signed to these three labels would see their future material released under the RCA Records brand.[14][15] However, Bowersox was not one of the artists who made the move, and was instead left without a record label. She made her acting debut on a second-season episode of Body of Proof.[16][17] An EP of pre-Idol recordings was called Once Upon a Time... was self-released in June 2012. She was a guest on the Blues Traveler album, Suzie Cracks the Whip, performing vocals with John Popper on the song \"I Don't Wanna Go\", and appeared with them in concert at their concert of July 4, 2012 at Red Rocks Amphitheatre in Colorado. 2012–present: All That for This [edit]In October 2012, Bowersox signed a recording deal with Shanachie Records.[18] On January 7, 2013, it was confirmed that Bowersox's second studio album, All That for This, would be released March 26, 2013.[19] The album was produced by Steve Berlin of Los Lobos and features Jakob Dylan.[20] Bowersox debuted the first single from the album, \"Dead Weight\", on On Air with Ryan Seacrest on February 5, 2013. Bowersox told Seacrest, \"This song means more to me than even I can completely comprehend.\"[19] Bowersox began a headlining tour in support of the album on March 1, 2013. The band Montë Mar was her concert opener, as well as her backing band on dates through March 31, 2013.[21][22] On March 25, 2013, Bowersox appeared on The Tonight Show with Jay Leno and performed her song \"Movin' On\" to promote the album. It was announced here that Bowersox will play Patsy Cline in the Broadway production of Always, Patsy Cline.[23] It was announced on June 11, 2013 that Bowersox would be headlining the Lancaster Festival in Lancaster, Ohio on June 27, 2013[24] Personal life [edit]Bowersox and musician Brian Walker were married on October 10, 2010, at Uncommon Ground Café in Chicago, the restaurant where the couple had met six years earlier while both were performing at Open Mic Night.[25] It was announced on May 6, 2013, that they were ending their marriage.[26] While appearing on Good Day L.A. to promote her Christmas album on November 26, 2013, Bowersox came out as bisexual. \"I have been bisexual as long as I can remember,\" she said. Bowersox then performed her song \"Coming Out For Christmas\" which explores the subject matter.[27] Discography [edit]Studio albums [edit]Digital albums [edit]Extended plays [edit]Singles [edit]Digital singles [edit]Music videos [edit]Filmography [edit]Awards and nominations [edit]References [edit]- ^ a b \"Where Crystal Bowersox comes from - tribunedigital-chicagotribune\". Articles.chicagotribune.com. April 28, 2010. Retrieved November 4, 2015. - ^ \"Birth Record of Crystal Lynn Bowersox\". MooseRoots. Retrieved November 1, 2016.[permanent dead link] - ^ a b \"Crystal Bowersox: Songwriter, Singer, Television Personality\". Biography Channel. Archived from the original on February 2, 2017. Retrieved January 19, 2017. - ^ Alex Strachan (May 21, 2010). \"Bowersox an Idol to idolize\". The Vancouver Sun. Retrieved July 30, 2010. - ^ Bella Horton (March 3, 2010). \"Crystal Bowersox Hospital: 2010 American Idol Contestant Hospitalized for Diabetes?\". CNN. Archived from the original on March 6, 2010. Retrieved March 25, 2010. - ^ \"Crystal Bowersox's 'American Idol' Future Uncertain\". Associated Press. March 3, 2010. Retrieved March 25, 2010. - ^ \"Crystal Bowersox Wows \"Idol\" Judges\". CBS News. Associated Press. March 4, 2010. Retrieved March 25, 2010. - ^ James Montgomery (March 9, 2010). \"Crystal Bowersox's 'Give Me One Reason' Dominates 'American Idol'\". MTV. Archived from the original on March 12, 2010. Retrieved March 25, 2010. - ^ Slezak, Michael (May 22, 2010). \"'Idolatry': Breaking down the Crystal-Lee finale (and bidding adieu to Casey) on 'American Idol'\". Entertainment Weekly. Retrieved November 4, 2015. - ^ \"Crystal Bowersox and Boyfriend Split Before Idol Finale\". People. May 27, 2010. Archived from the original on September 28, 2010. Retrieved September 25, 2010. - ^ \"Crystal Bowersox and Lee DeWyze dish on judges' picks, why viewers should vote for them\". USA Today. May 20, 2010. Retrieved May 30, 2010. - ^ [1] Archived May 15, 2010, at the Wayback Machine - ^ Itzkoff, Compiled by Dave (May 28, 2010). \"American Idol Finalists Sign Record Deals\". The New York Times. Retrieved May 28, 2010. - ^ Christman, Ed (August 23, 2011). \"RCA's New Executive Team Named Under CEO Peter Edge Amid Layoffs (Update)\". Billboard.biz. Archived from the original on August 29, 2011. Retrieved November 1, 2012. - ^ \"Radio Industry News, Music Industry Updates, Arbitron Ratings, Music News and more!\". FMQB. Archived from the original on November 8, 2011. Retrieved November 1, 2012. - ^ Slezak, Michael (October 25, 2011). \"Crystal Bowersox on Body of Proof Season 2, Episode 6, Second Chances\". TVLine. Retrieved November 4, 2015. - ^ Stanhope, Kate (October 24, 2011). \"Crystal Bowersox Makes Her Acting Debut on Body of Proof: \"I Was Pretty Insecure\" - Today's News: Our Take\". TVGuide.com. Retrieved November 4, 2015. - ^ \"American Idol's Crystal Bowersox Signs Label Deal With Shanachie\". Hollywood Reporter. October 3, 2012. Retrieved November 1, 2012. - ^ a b c Mansfield, Bryan (February 5, 2013). \"Crystal Bowersox unveils new single\". USA Today. Retrieved February 6, 2013. - ^ \"New Crystal Bowersox Album Set for March (PHOTO)\". Mjsbigblog.com. January 7, 2013. Retrieved July 12, 2014. - ^ \"Monte Mar February 28, 2013 status\". Facebook. Retrieved June 15, 2013. - ^ \"Tour Dates\". Monte Mar. Archived from the original on March 16, 2013. Retrieved June 14, 2013. - ^ \"Crystal Bowersox on The Tonight Show with Jay Leno Video: 'Movin' On' Performance March 25, 2013\". Shallow Nation. Archived from the original on March 30, 2013. Retrieved June 14, 2013. - ^ \"Bowersox to perform at Lancaster Festival\". The Columbus Dispatch. Retrieved June 15, 2013. - ^ Laudadio, Marisa (October 10, 2010). \"Crystal Bowersox Gets Married!\". People. Retrieved October 16, 2010. - ^ Coughlan, Maggie; Laudadio, Marisa (May 6, 2013). \"Crystal Bowersox Splits From Husband\". People. Retrieved May 7, 2013. - ^ \"Crystal Bowersox: I Have Been Bisexual For As Long As I Can Remember VIDEO\". November 28, 2013. Retrieved December 1, 2013. - ^ a b \"Twitter / crystalbowersox: @Ronda73 \" farmers daughter\"\". Twitter.com. Retrieved November 1, 2012. - ^ \"'American Idol': With Scotty McCreery's Successful Debut, Did Universal Learn From Sony's Mistakes?\". The Hollywood Reporter. October 21, 2011. Retrieved November 4, 2015. - ^ Mansfield, Brian (April 3, 2013). \"Colton Dixon sales soar after 'Idol' performance\". USA Today. - ^ \"Alive album\". Spotify. 2017. Retrieved December 2, 2023. - ^ \"Hitchhiker album\". Spotify. 2022. Retrieved December 2, 2023. - ^ a b c Trust, Gary (June 3, 2010). \"Chart Beat Thursday: Lee & Crystal Rock On\". Billboard. Nielsen Business Media. Retrieved June 4, 2010. - ^ Caulfield, Keith (June 2, 2010). \"'Idols' Lee DeWyze, Crystal Bowersox Impact Billboard Charts\". Billboard. Nielsen Business Media. Retrieved June 3, 2010. - ^ \"Crystal Bowersox - Promises - Amazon.com Music\". Amazon. Retrieved November 4, 2015. External links [edit]- Official website - Crystal Bowersox at IMDb - Crystal Bowersox Archived March 23, 2010, at the Wayback Machine at American Idol - 1985 births - Living people - 21st-century American multi-instrumentalists - American acoustic guitarists - American blues singers - American country guitarists - American women country singers - American country singer-songwriters - American women pop singers - American women singer-songwriters - American folk guitarists - American folk singers - American harmonica players - American pop guitarists - Bisexual singers - Bisexual songwriters - LGBTQ people from Ohio - American LGBTQ singers - American LGBTQ songwriters - American street performers - American Idol participants - Jive Records artists - RCA Records artists - 19 Recordings artists - People with type 1 diabetes - People from Ottawa County, Ohio - Actresses from Ohio - Guitarists from Ohio - Singer-songwriters from Ohio - 21st-century American actresses - 21st-century American women guitarists - 21st-century American guitarists - 21st-century American women singers - 21st-century American singer-songwriters - Country musicians from Ohio - 20th-century American LGBTQ people - 21st-century American LGBTQ people - American bisexual musicians - American bisexual writers - American bisexual actresses - LGBTQ women singers"
}