{
  "url": "https://www.vistaprint.com/business-cards",
  "title": "Create & Design Custom Business Cards Online | VistaPrint",
  "text": "Explore all your business card options Compare papers & finishes - Subtle & sophisticated - Minimizes glare & reflections - Best for displaying text & finer details in your design - Thickness: 14pt standard, 16pt premium, 18pt premium plus - Shapes: Standard, square - Corners: Standard, rounded - Special finishes: Metallic foil, raised finishes Popular templates Shop by shape Shop by business use Shop card holders Why VistaPrint? Cut through the noise with a one-of-a-kind VistaPrint business card. Wherever you are (and whatever you do) as a business, VistaPrint has the options you need to create a custom business card you love. Browse designs, styles, papers and finishes that fit your brandâs vibe to a tee. Add personal touches and custom content with our user-friendly design tools. And stock up on high-quality cards at low, budget-saving prices. Custom business card printing doesnât need to be difficult or expensive. And creating a one-of-a-kind card that gets customersâ attention? Weâve helped millions of businesses around the world do just that. So whether you want a simple, striking design, a fun and flamboyant look or a linkable QR code, youâre in exactly the right place. Itâs time to get creative and take your marketing to the next level. See what other customers are making. Frequently asked questions That depends on the shape you choose. Hereâs a rundown of our business card sizes by shape: - Standard: 3.5\" x 2\" - Rounded Corners: 3.5\" x 2\" - Square: 2.5\" x 2.5\" - Circle: 2.5\" diameter - Oval: 3.5\" x 2\" - Leaf: 3.5\" x 2\" Note: Square and circle business cards exceed the height of a standard wallet. Consider one of our other options if youâre looking for wallet-sized business cards. Also, when youâre designing or choosing a template, remember that business card dimensions may include a âbleed area,â which is extra space for images, patterns or design elements that extend beyond the cut edges â this helps prevent having white edges around your finished card. See our business card size guide for detailed info on business card sizes in pixels, bleed area and more. Business card thickness is usually measured in âpoints,â abbreviated as âpt.â The higher the number, the thicker the card. Standard business card thickness is 14pt, but weights can vary by paper type. For instance, our ultra thick business cards are actually 32pt, and our premium plus cards come in at 18pt. It can be hard to know where to start when youâre creating a new card online. But with VistaPrint, you can quickly browse ready-to-use templates in a range of styles. When you find something that fits your needs (and personality), you can add your own custom text, logo and even images. Then, you can fine tune the font, layout and even colors until youâre satisfied. And you can always check out your card in a 3D preview to make sure everythingâs just right. Looking for business card inspiration? Take a peek at some of our favorite design examples. Every business is different, but there are a few things anyone should have on their card. Youâll want to include your name, the name of your business, your contact info and your logo. Then, you can also add optional elements like photos, artwork, customer testimonials, a brand motto and more â whatever you think will connect with potential customers and business partners. You donât need to, but you certainly can. Some people put their logo or slogan on the backside of their card. Others will list their company website or hours of operation for quick reference at a glance. And there are lots of other options, too â coupons, photos, artwork and more. In fact, here are some of our customersâ favorite ideas for how you can use the back of your business card. We have a variety of delivery options, including economy, standard and express. Check out our shipping guide for more details. Yes. Our free business card sample kit includes examples of unique paper stocks, finishes shapes and more. You want to find something that matches up well with both your industry and your personality. Thicker, heavier stocks can work well for businesses trying to project strength and reliability. More textured, unique finishes are a great choice for craftspeople and artists. And if you go for a standard or rounded corner business card, finishes like embossed gloss and foil accents can help almost any design be extra eye-catching. Looking for something a little extra durable, eyecatching or, wellâ¦just plain extra? We also offer alternative options like plastic business cards, painted edge business cards and even NFC-enabled smart cards. If the information is still mostly correct, you can keep them as backups by crossing out the out-of-date info and writing in new text. If the cards are mostly inaccurate, weâd recommend recycling them. Weâd recommend using one of our business card holders, available in an assortment of different materials and styles. Traditionally, business card designs have a horizontal layout, but if youâre going for a different, modern feel, we have a lot of templates for vertical business cards, too. As far as specific design layouts, we have thousands you can quickly sort and browse by industry, shape, style and more. If youâre looking for more specific pointers, check out our guides on how to design a business card and tried-and-true business card layouts. The front of your card will have whatever texture or finish you selected. The back will be a smooth, matte surface â great for adding notes, appointments or other information. Special finishes are available with standard and rounded corner business cards. Yes. You can choose from a variety of styles, materials and customization options."
}