{
  "url": "https://www.poetryintranslation.com/PITBR/Italian/Leopardi.php",
  "title": "Leopardi (1798–1837) - The Canti",
  "text": "Giacomo Leopardi The Canti © Copyright 2003 A. S. Kline, All Rights Reserved This work may be freely reproduced, stored and transmitted, electronically or otherwise, for any non-commercial purpose. Conditions and Exceptions apply. Translator’s Note The poems of the Canti below are complete but not in their originally published order. I have taken the liberty of re-arranging them into four groups, Personal (Poems 1-11), Philosophical (12-24), ‘Romantic’ (25-34), and Political (35-41). These categories are not exact, as Leopardi frequently blends elements together in the one poem, but they may help the reader, as they helped me, to adjust to his variations in style. The original published position of each poem is given in Roman numerals in the brackets following the poem’s title. Contents - 1. To Silvia (XXI) - 2. The Infinite (XII) - 3. The Evening Of The Holiday (XIII) - 4. To the Moon (XIV) - 5. Saturday Night In The Village (XXV) - 6. To Himself (XXVIII) - 7. Night-Song Of A Wandering Shepherd of Asia (XXIII) - 8. First Love (X) - 9. The Solitary Bird (XI) - 10. Imitation (XXXV) - 11. Scherzo (XXXVI) - 12. Moon-Set (XXXII) - 13. Wild Broom (XXXIV) - 14. The Calm After The Storm (XXIV) - 15. Masterful Thought (XXVI) - 16. Love And Death (XXVII) - 17. Bas-Relief On An Ancient Tomb (XXX) - 18. On A Lovely Lady’s Image (XXX1) - 19. To Spring (or Of The Ancient Myths) (VII) - 20. Hymn To The Patriarchs (VIII) - 21. Sappho’s Last Song (IX) - 22. To Count Carlo Pepoli (XIX) - 23. Fragment (From Simonides I: XL) - 24. Fragment (From Simonides II:XLI) - 25. The Dream (XV) - 26. The Solitary Life (XVI) - 27. To His Lady (XVIII) - 28. Memories (XXII) - 29. The Re-awakening (Il Risorgimento: XX) - 30. Consalvo (XVII) - 31. Aspasia (XXIX) - 32. Fragment (Alcetas and Melissus: XXXVII) - 33. Fragment (Separation: XXXVIII) - 34. Fragment (Turned to Stone: XXXIX) - 35. To Italy (I) - 36. On the Proposed Dante Monument in Florence (II) - 37. To Angelo Mai (III) - 38. For The Marriage of His Sister Paolina (IV) - 39. To A Winner In The Games (V) - 40. Marcus Junius Brutus (VI) - 41. Palinode To Marchese Gino Capponi (XXXII) - Index of First Lines 1. To Silvia (XXI) Silvia, do you remember those moments, in your mortal life, when beauty still shone in your sidelong, laughing eyes, and you, light and thoughtful, leapt beyond girlhood’s limits? The quiet rooms and the streets around you, sounded to your endless singing, when you sat, happily content, intent on that woman’s work, the vague future, arriving alive in your mind. It was the scented May, and that’s how you spent your day. I would leave my intoxicating studies, and the turned-down pages, where my young life, the best of me, was left, and from the balcony of my father’s house strain to catch the sound of your voice, and your hand, quick, running over the loom. I’d look at the serene sky, the gold lit gardens and paths: this side the mountains, that side the far-off sea. And human tongue cannot say what I felt then. What sweet thoughts, what hope, what hearts, O my Silvia! How all human life and fate appeared to us then! When I recall that hope such feelings pain me, harsh, disconsolate, I brood on my own destiny. Oh Nature, Nature why do you not give now what you promised then? Why do you so deceive your children? Attacked, and conquered, by secret disease, you died, my tenderest one, and did not see your years flower, or feel your heart moved, by sweet praise of your black hair your shy, loving looks. No friends talked with you, on holidays, about love. My sweet hopes died also little by little: to me too Fate has denied those years. Oh, how you’ve passed me by, dear friend of my new life, my saddened hope! Is this the world, the dreams, the loves, events, delights, we spoke about so much together? Is this our human life? At the advance of Truth you fell, unhappy one, and from the distance, with your hand you pointed towards death’s coldness and the silent grave. 2. The Infinite (XII) It was always dear to me, this solitary hill, and this hedgerow here, that closes off my view, from so much of the ultimate horizon. But sitting here, and watching here, in thought, I create interminable spaces, greater than human silences, and deepest quiet, where the heart barely fails to terrify. When I hear the wind, blowing among these leaves, I go on to compare that infinite silence with this voice, and I remember the eternal and the dead seasons, and the living present, and its sound, so that in this immensity my thoughts are drowned, and shipwreck seems sweet to me in this sea. 3. The Evening Of The Holiday (XIII) The night is sweet and clear, without a breeze, and the moon rests in the gardens, calm on the roofs, and reveals, clear, far off, every mountain. O my lady, the paths are still, and the night lights shine here and there from the balconies: you sleep, and sleep gently welcomed you to your quiet room: nothing troubles you: you still don’t know, or guess with how deep a wound you’ve hurt my heart. You sleep: I gaze at the sky that seems so kind to my eyes: gaze on ancient all-powerful Nature, who created me for pain. She said: ‘I refuse you hope, even hope, and may your eyes not shine, except with tears.’ Today was holy: now rest from pleasure, remember in dream, perhaps, how many you liked today, how many liked you: not I, it’s not I that hope to fill your thoughts. Instead I ask what life has left me, throw myself to earth, cry out, and tremble: oh, terrible days of green youth! Ah, on the road nearby, I hear the solitary song of the worker returning to his poor lodging, late, after the revels: and it grips my heart fiercely to think the whole world passes, and scarcely leaves a trace. See: the holiday’s over: some nondescript day follows: time carries off all mortal things. Where now’s the sound of all those ancient peoples? Where are the cries of our famous ancestors, Rome’s vast empire, its weapons, the clash of arms, crossing land and sea? All’s peace and silence: the world rests entirely, and we speak of them no more. Now I remember, in my young days, when the longed-for holiday was awaited, how, once it had passed, I lay, in sadness, pressed tight to my sheets: and, deep in the night, a song I heard in the streets, died, little by little, far off, crushing my heart, as now. 4. To the Moon (XIV) O lovely moon, now I’m reminded how almost a year since, full of anguish, I climbed this hill to gaze at you again, and you hung there, over that wood, as now, clarifying all things. Filled with mistiness, trembling, that’s how your face seemed to me, with all those tears that welled in my eyes, so troubled was my life, and is, and does not change, O moon, my delight. And yet it does help me, to record my sadness and tell it, year by year. Oh how sweetly it hurts, when we are young, when hope has such a long journey to run, and memory is so short, this remembrance of things past, even if it is sad, and the pain lasts! 5. Saturday Night In The Village (XXV) The girl comes from the fields, at sunset, carrying her sheaf of grass: in her fingers a bunch of violets and roses: she’s ready, as before, to wreathe her hair and bodice, for tomorrow’s holiday. The old woman sits spinning, facing the dying sunlight, on the stairway, with her neighbours, telling the tale of her own young days, when she dressed for the festival, and still slim and lovely, danced all evening, with those young boys, companions of her fairer season. Already the whole sky darkens, the air turns deep blue: already shadows of hills and roofs return, on the young moon’s pale rising. Now the bells are witness to the coming holiday: you would say the heart might take comfort from the sound. A gang of little boys shout in the tiny square, leaping here and there, making a happy din: and the farmhand, whistling, returns for his simple meal, dreams of his day of rest. When the other lights are quenched, all round, and everything else is silent, I hear the hammer ringing, I hear the carpenter sawing: he’s still awake in the lamplight, in his shut workshop, hurrying and straining, to finish his task before dawn. This is the best of the seven days, full of hope and joy: tomorrow the hours will bring anxiety and sadness, and make each turn, in thought, to their accustomed toil. Lively boy, your life’s sweet flowering is like this day of gladness, a clear day, unclouded, that heralds life’s festival. Enjoy the sweet hour, my child, this pleasant, delightful season. I’ll say nothing, more: let it not grieve you if your holiday, like mine, is slow to arrive. 6. To Himself (XXVIII) Now you’ll rest forever my weary heart. The last illusion has died I thought eternal. Died. I feel, in truth, not only hope, but desire for dear illusion has vanished. Rest forever. You’ve laboured enough. Not a single thing is worth your beating: the earth’s not worthy of your sighs. Bitter and tedious, life is, nothing more: and the world is mud. Be silent now. Despair for the last time. To our race Fate gave only death. Now scorn Nature, that brute force that secretly governs the common hurt, and the infinite emptiness of all. 7. Night-Song Of A Wandering Shepherd of Asia (XXIII) Why are you there, Moon, in the sky? Tell me why you are there, silent Moon. You rise at night, and go contemplating deserts: then you set. Are you not sated yet with riding eternal roads? Are you not weary, still wishing to gaze at these valleys? It mirrors your life, the life of a shepherd. He rises at dawn: he drives his flock over the fields, sees the flocks, the streams, the grass: tired at evening he rests: expecting nothing more. Tell me, O Moon, what life is worth to a shepherd, or your life to you? Tell me: where does my brief wandering lead, or your immortal course? Like an old man, white-haired, infirm, barefoot and half-naked, with a heavy load on his shoulders, running onwards, panting, over mountains, through the valleys, on sharp stones, in sand and thickets, wind and storm, when the days burn and when they freeze, through torrents and marshes, falling, rising, running faster, faster, without rest or pause, torn, bleeding: till he halts where all his efforts, all the roads, have led: a dreadful, vast abyss into which he falls, headlong, forgetting all. Virgin Moon, such is the life of man. Man is born in labour: and there’s a risk of death in being born. The very first things he learns are pain and anguish: from the first his mother and father console him for being born. Then as he grows they both support him, go on trying, with words and actions, to give him heart, console him merely for being human: there’s nothing kinder a parent can do for a child. Yet why bring one who needs such comforting to life, and then keep him alive? If life is a misfortune, why grant us such strength? Such is the human condition, inviolate Moon. But you who are not mortal, care little, maybe, for my words. Yet you, lovely, eternal wanderer, so pensive, perhaps you understand this earthly life, this suffering, the sighs that exist: what this dying is, this last fading of our features, the vanishing from earth, the losing all familiar, loving company. And you must understand the ‘why’ of things, and view the fruits of morning, evening, silence, endless passing time. You know (you must) at what sweet love of hers the springtime smiles, the use of heat, and whom the winter benefits with frost. You know a thousand things, reveal a thousand things still hidden from a simple shepherd. Often as I gaze at you hanging so silently, above the empty plain that the sky confines with its far circuit: or see you steadily follow me and my flock: or when I look at the stars blazing in the sky, musing I say to myself: ‘What are these sparks, this infinite air, this deep infinite clarity? What does this vast solitude mean? And what am I?’ So I question. About these magnificent, immeasurable mansions, and their innumerable family: and the steady urge, the endless motion of all celestial and earthly things, circling without rest, always returning to their starting place: I can’t imagine their use or fruit. But you, deathless maiden, I’m sure, know everything. This I know, and feel, that others, perhaps, may gain benefit and comfort from the eternal spheres, from my fragile being: but to me life is evil. O flock at peace, O happy creatures, I think you have no knowledge of your misery! How I envy you! Not only because you’re almost free of worries: quickly forgetting all hardship, every hurt, each deep fear: but because you never know tedium. When you lie in the shade, on the grass, you’re peaceful and content: and you spend most of the year untroubled, in that state. If I sit on the grass, in the shade, weariness clouds my mind, and, as if a thorn pricked me, sitting there I’m still further from finding peace and rest. Yet there’s nothing I need, and I’ve known no reason for tears. I can’t say what you enjoy or why: but you’re fortunate. O my flock: there’s little still I enjoy, and that’s not all I regret. If you could speak, I’d ask you: ‘Tell me, why are all creatures at peace, idle, lying in sweet ease: why, if I lie down to rest, does boredom seize me?’ If I had wings, perhaps, to fly above the clouds, and count the stars, one by one, or roam like thunder from crest to crest, I’d be happier, my sweet flock, I’d be happier, bright moon. Or perhaps my thought strays from truth, gazing at others’ fate: perhaps whatever form, whatever state it’s in, its cradle or its fold, the day of birth is dark to one that’s born. 8. First Love (X) My thoughts turn to the day when I felt love war in me, for the first time, and I said: ‘Ah, if this is love, how it torments me!’ When, with eyes fixed wholly on the ground, I marvelled at her, she who was first to open, all innocent, the passage to my heart. Ah, Love, how badly you’ve treated me! Why does such sweet affection bring so much desire, and so much grief? And why did such delight enter my heart not serenely, not entire and pure, but filled with agony and trouble? Tell me, gentle heart, what fear what anguish entered with that thought, compared with which all pleasures were annoyance? Fulfilling thought that offered up yourself, in the day and night, when all things seem to be at peace in this hemisphere, you troubled me, unquiet, happy, wretched, lying beneath the covers, throbbing strongly at every moment. And whenever, sad, afflicted, weary, I closed my eyes in sleep: sleep vanished consumed by fever and delirium. Oh how the sweet vision rose, living, among the shadows, my closed eyes gazing at it beneath my eyelids! Oh, how that sweetest of motions spread through my bones, oh, how a thousand confused thoughts rolled through my trembling soul! As a breeze, flows through the heights of an ancient forest, and creates a long, uncertain murmuring. And oh, my heart, while I was silent, while I failed to struggle, what did you say, as she departed, she the source of pain and throbbing? I’d no sooner felt the burning of that blaze of love, than the little breeze that fanned the flame, flew on its way. I lay there sleepless in the dawn, and heard those horses, that would leave me lost, stamping their hooves outside my ancestral home. And I, secret, timid, and unsure, turned my eager hearing, eyes open in vain, towards the balcony in the darkness, to hear the last words, that might fall from her lips: to hear that voice: alas, since heaven took all else away. The servants’ voices often struck my doubting ear, and a chill took me, and my heart beat more fiercely! And when that dear voice finally sank into my heart, mixed with the sounds of carriage wheels and horses: I was left deserted, huddled trembling on my bed, and, eyes closed, pressed my hand to my heart and sighed. Later, stupefied, dragging my shaking limbs round the silent room, I said: ‘What else could ever move my heart?’ Then the bitterest memory rooted in my mind, and closed my heart to all other voices, every other form. And a deep grief searched my breast, as when the heavens rain widely, washing the fields with melancholy. Nor did I, a boy of eighteen summers recognise you, Love, when you first tried your power on one born to weep. When I scorned every joy, and the stars’ smiles did not please, not dawn’s calm silence, not green fields. Even the love of glory was silent in my heart that it used to warm, where once love of beauty lived. My eyes would not return to my studies, and that which I thought had made all other desires vain, seemed vain itself. Ah how could I have altered so, in myself, how had one love taken all others from me? Ah, in truth, how changeable we are! Only my heart pleased, and that perpetual dialogue buried in my heart, keeping a guard on grief. And my eyes that searched the earth or myself, and allowed no fugitive or wandering glance to light on any face, vile or lovely: fearing to disturb the bright, virgin image that I held in my heart, as waves in a lake may be stirred by the breeze. And that regret, for not having fully delighted in fleeting days, that weighs on the spirit, changing to poison past delight, stung my heart wholly: while shame with its harsh bite still had no power. I swear to heaven, to you, great spirits, that there was no low desire in my heart: it burned with pure, unblemished fire. That fire still lives, affection lives, the lovely image breathes in my thought, from which I draw no delight that is not heavenly, and that, alone, satisfies me. 9. The Solitary Bird (XI) Solitary bird, you sing from the crest of the ancient tower to the landscape, while day dies: while music wanders the valley. Spring brightens the air around, exults in the fields, so the heart is moved to see it. Flocks are bleating, herds are lowing: more birds happily make a thousand circles in the clear sky, all around, celebrating these happy times: you gaze pensively, apart, at it all: no companions, and no flight, no pleasures call you, no play: you sing, and so see out the year, the sweet flowering of your life. Ah, how like your ways to mine! Pleasure and Joy youth’s sweet companions, and, Love, its dear friend, a bitter sigh at passing days, I no longer care for them, I don’t know why: indeed I seem to fly far from them: seem to wander, a stranger in my native place, in the springtime of my life. This day, yielding to evening now, is a holiday in our town. You can hear a bell ring in the clear sky, you can hear the cannon’s iron thunder, echoing away, from farm to farm. Dressed for the festival young people here leave the houses, fill the streets, to see and be seen, with happy hearts. I go out, alone, into the distant country, postpone all delight and joy to some other day: and meanwhile my gaze takes in the clear air, brings me the sun that sinks and vanishes among the distant mountains, after the cloudless day, and seems to say, that the beauty of youth diminishes. You, lonely bird, reaching the evening of this life the stars grant you, truly, cannot regret your existence: since your every action is born of nature. But I, if I can’t evade through prayer, the detested threshold of old age, when these eyes will be dumb to others, and the world empty, and the future darker and more irksome than the present, what will I think of such desires? Of these years of mine? Of what happened? Ah I’ll repent, and often, un-consoled, I’ll gaze behind me. 10. Imitation (XXXV) Poor frail leaf far from your own branch, where are you flying? – The wind tore me from the beech that bore me. Whirling, in flight, it takes me from the forest to the plain, from the valley to the mountain. I myself journey forever: ignoring all the rest. I go where all things go, where, of nature, goes the flower of the rose, and the flower of the laurel. Note: The original French poem is by Antoine-Vincent Arnault (1766-1834). 11. Scherzo (XXXVI) When as a boy I set myself to learn from the Muses, one of them grasped me by the hand and all that day led me around, to contemplate her workshop. Little by little she showed me the instruments of her art, and all their diverse uses the effect of each of them when they’re employed in prose or they’re employed in verses. I marvelled, and I said: ‘And Muse, your file?’ The Goddess said: ‘Worn out: we do without it.’ ‘Shouldn’t it be repaired,’ I added, ‘if it’s done for?’ She replied: ‘It should, but it’s something we’ve no time for.’ 12. Moon-Set (XXXII) As on a lonely night the moon descends, over the silvery waters and fields, where the breeze sighs, and distant shadows make a thousand vague aspects, and deceptive objects, among the tranquil waves, the branches, hedges, hills, and villages: and, lost at the sky’s end, behind Alps or Apennines, or in endless Tyrrhenian deeps, sets, and dims the world, so that shadows scatter, and a single gloom darkens valley and mountain, so night remains alone, and the carter on the road salutes, with mournful song, the last gleam of vanishing light that led him on: so youth melts away, and leaves our mortal state. The shadows and the forms of delighted illusion flee: and all the distant hopes our mortal nature trusts in, grow less. Life remains, dark, abandoned. The uncertain traveller strains his eyes, blindly, in vain, to find some goal or reason in the long road ahead: and sees how human habitation becomes truly foreign to him, and he to it. Our wretched life would have seemed too happy and joyful, up there, if youth, whose every good brings a thousand ills, had been allowed to last a lifetime. The law that sentences all creatures to death, would be too mild, if half of life had not first been made harsher than the vilest death. The eternals made a worthy discovery of immortal intellect: old age, worst of all evils, where desire clings, but hope is quenched, the founts of pleasure run dry, pain often grows, and good will not return. You, hills and shores, the glory in the west, that silvered the veil of night, has died, yet you will not be widowed long: from the east you’ll see the sky whiten anew, and dawn will rise: then the sun will quickly follow and, shine out with powerful flames, flooding you, and the eternal realms, with torrents of light. But mortal life, will not brighten with new light, or new dawn, once lovely youth is gone. It will be lonely to the end: the gods have set no limit to the gloom that darkens old age, except the tomb. 13. Wild Broom (XXXIV) (or The Flower of the Desert) ‘And men loved darkness rather than the light’ John, III:19 Fragrant broom, content with deserts: here on the arid slope of Vesuvius, that formidable mountain, the destroyer, that no other tree or flower adorns, you scatter your lonely bushes all around. I’ve seen before how you beautify empty places with your stems, circling the City once the mistress of the world, and it seems that with their grave, silent, aspect they bear witness, reminding the passer-by of that lost empire. Now I see you again on this soil, a lover of sad places abandoned by the world, a faithful friend of hostile fortune. These fields scattered with barren ash, covered with solid lava, that resounds under the traveller’s feet: where snakes twist, and couple in the sun, and the rabbits return to their familiar cavernous burrows: were once happy, prosperous farms. They were golden with corn, echoed to lowing cattle: there were gardens and palaces, the welcome leisure retreats for powerful, famous cities, which the proud mountain crushed with all their people, beneath the torrents from its fiery mouth. Now all around is one ruin, where you root, gentle flower, and as though commiserating with others’ loss, send a perfume of sweetest fragrance to heaven, that consoles the desert. Let those who praise our existence visit these slopes, to see how carefully our race is nurtured by loving Nature. And here they can justly estimate and measure the power of humankind, that the harsh nurse, can with a slight movement, obliterate one part of, in a moment, when we least fear it, and with a little less gentle a motion, suddenly, annihilate altogether. The ‘magnificent and progressive fate’ of the human race is depicted in this place. Proud, foolish century, look, and see yourself reflected, you who’ve abandoned the path, marked by advancing thought till now, and reversed your steps, boasting of this regression you call progress. All the intellectuals, whose evil fate gave them you for a father, praise your babbling, though they often make a mockery of you, among themselves. But I’ll not vanish into the grave in shame: As far as I can, I’ll demonstrate, the scorn for you, openly, that’s in my heart, though I know oblivion crushes those hated by their own time. I’ve already mocked enough at that fate I’ll share with you. You pursue Freedom, yet want thought to be slave of a single age again: by thought we’ve risen a little higher than barbarism, by thought alone civilisation grows, only thought guides public affairs towards the good. The truth of your harsh fate and the lowly place Nature gave you displease you so. Because of it you turn your backs on the light that illuminated you: and in flight, you call him who pursues it vile, and only him great of heart who foolishly or cunningly mocks himself or others, praising our human state above the stars. A man generous and noble of soul, of meagre powers and weak limbs, doesn’t boast and call himself strong and rich in possessions, doesn’t make a foolish pretence of splendid living or cutting a fine figure among the crowd: but allows himself to appear as lacking wealth and power, and says so, openly, and gives a true value to his worth. I don’t consider a man a great-hearted creature, but stupid, who, born to die, nurtured in pain, says he is made for joy, and fills pages with the stench of pride, promising an exalted destiny on earth, and a new happiness, unknown to heaven much less this world, to people whom a surging wave, a breath of malignant air, a subterranean tremor, destroys so utterly that they scarcely leave a memory behind. He has a noble nature who dares to raise his voice against our common fate, and with an honest tongue, not compromising truth, admits the evil fate allotted us, our low and feeble state: a nature that shows itself strong and great in suffering, that does not add to its miseries with fraternal hatred and anger, things worse than other evils, blaming mankind for its sorrows, but places blame on Her who is truly guilty, who is the mother of men in bearing them, their stepmother in malice. They call her enemy: and consider the human race to be united, and ranked against her, from of old, as is true, judge all men allies, embrace all with true love, offering sincere prompt support, and expecting it in the various dangers and anguish of the mutual war on her. And think it as foolish to take up arms against men and set up nets and obstacles against their neighbours as it would be in war, surrounded by the opposing army, in the most intense heat of battle, to start fierce struggles with friends, forgetting the enemy, to incite desertion, and wave their swords among their own forces. If such thoughts were revealed to the crowd, as they used to be, along with the horror that first brought men together in social contract against impious Nature, then by true wisdom the honest, lawful intercourse of citizens would be partly renewed, and justice and piety, would own to another root than foolish pride, on which the morals of the crowd are as well founded as anything else that’s based on error. Often I sit here, at night, on these desolate slopes, that a hardened lava-flow has clothed with brown, and which seem to undulate still, and over the gloomy waste, I see the stars flame, high in the purest blue, mirrored far off by the sea: the universe glittering with sparks that wheel through the tranquil void. And then I fix my eyes on those lights that seem pin-pricks, yet are so vast in form that earth and sea are really a pin-prick to them: to whom man, and this globe where man is nothing, are completely unknown: and gazing at those still more infinitely remote, knots, almost, of stars, that seem like mist to us, to which not only man and earth but all our stars, infinite in number and mass, with the golden sun, are unknown, or seem like points of misted light, as they appear from earth: what do you seem like, then, in my thoughts, O children of mankind? And mindful of your state here below, of which the ground I stand on bears witness, and that, on the other hand, you believe that you’ve been appointed the master and end of all things: and how often you like to talk about the creators of all things universal, who descended to this obscure grain of sand called earth, for you, and happily spoke to you, often: and that, renewing these ridiculous dreams, you still insult the wise, in an age that appears to surpass the rest in knowledge and social customs: what feeling is it, then, wretched human race, what thought of you finally pierces my heart? I don’t know if laughter or pity prevails. As a little apple that falls from a tree: late autumn ripeness, and nothing else, bringing it to earth: crushes, wastes, and covers in a moment, the sweet nests of a tribe of ants, carved out of soft soil, with vast labour, and the works, the wealth, that industrious race had vied to achieve, with such effort, and created in the summer: so the cities of the farthest shores that the sea bathed, were shattered, confounded, covered in a few moments, by a night of ruin, by ashes, lava and stones, hurled to the heights of heaven from the womb of thunder, falling again from above, mingled in molten streams, or by the vast overflow of liquefied masses, metals and burning sand, descending the mountainside racing over the grass: so that now the goats graze above them, and new cities rise beside them, whose base is their buried, demolished walls that the cruel mountain seems to crush underfoot. Nature has no more love or care for the seed of man than for the ants: and if the destruction of one is rarer than that of the other, it’s for no other reason than that mankind is less rich in offspring. Fully eighteen hundred years have passed, since those once-populated cities vanished, crushed by fiery force, yet the farmer intent on his vines, this dead and ashen soil barely nourishes, still lifts his gaze with suspicion, to the fatal peak that sits there brooding, no gentler than ever, still threatening to destroy him, his children, and his meagre possessions. And often the wretch, lying awake on the roof of his house, where the wandering breezes blow at night, jumps up now and again, and checks the course of the dreadful boiling, that pours from that inexhaustible lap onto its sandy slopes, and illuminates the bay of Capri, the ports of Naples and Mergellina. And if he sees it nearing, or hears the water bubbling, feverishly, deep in the well, he wakes his children, quickly wakes his wife, and fleeing, with whatever of their possessions they can grasp, watches from the distance, as his familiar home, and the little field his only defence against hunger, fall prey to the burning tide, crackling as it arrives, inexorably spreading over all this, and hardening. Lifeless Pompeii returns to the light of heaven after ancient oblivion, like a buried skeleton, that piety or the greed for land gives back to the open air: and, from its empty forum, through the ranks of broken columns, the traveller contemplates the forked peak and the smoking summit, that still threatens the scattered ruins. And, like night’s secret horror, through the empty theatres, the twisted temples, the shattered houses, where the bat hides its brood, like a sinister brand that circles darkly through silent palaces, the glow of the deathly lava runs, reddening the shadows from far away, staining the region round. So, indifferent to man, and the ages he calls ancient, and the way descendants follow on from their ancestors, Nature, always green, proceeds instead by so long a route she seems to remain at rest. Meanwhile empires fall, peoples and tongues pass: She does not see: and man lays claim to eternity’s merit. And you, slow-growing broom, who adorn this bare landscape with fragrant thickets, you too will soon succumb to the cruel power of subterranean fire, that, revisiting places it knows, will stretch its greedy margin over your soft forest. And you’ll bend your innocent head, without a struggle, beneath that mortal burden: yet a head that’s not been bent in vain in cowardly supplication before a future oppressor: nor lifted in insane pride towards the stars, or beyond the desert, where your were born and lived, not through intent, but chance: and you’ll have been so much wiser so much less unsound than man, since you have never believed your frail species, can be made immortal by yourself, or fate. 14. The Calm After The Storm (XXIV) The storm has gone: I hear the joyful birds, the hen, returning to the path, renews her cackling. See the clear sky opening from the west, over the mountain: the landscape clarifies, the river gleams bright in the valley. Now every heart is happy, on every side there’s the noise of work as they return to business. The craftsman comes to the door, his work in hand, singing, to gaze at the humid sky: a girl runs out to draw water that’s charged with fresh rain: and, from street to street, the vegetable seller raises his cry again See the sun return, see how it’s smiling from hills and farms. The servants open balconies, terraces, lodges: hear the harness clinking, far off along the highway: as the traveller’s carriage moves, once more, down the road. Every heart is happy. When was life as sweet, as pleasant as it is now? When did men turn to their work, or bend to their studies with such love? Or begin some new venture? Or were so forgetful of old wrongs? Joy is born of pain: vain joy, the fruit of fear past, in one shaken, and fearful of death, who abhorred life before: fear that made men sweat and tremble in enduring anguish, shivering, silent, pale: seeing lightning, cloud, and wind, moving to attack them. O kindly Nature, these are your gifts, these are the delights you give to mortals. To be free of pain is our delight. You scatter ills with generous hands: grief appears of itself, and pleasure, that’s so often born of trouble, through the monstrous, and the miraculous, is our only gain. The human race, dear to the gods! Happy enough to gain a breathing space from sorrow: blessed when death heals you of every grief. 15. Masterful Thought (XXVI) Sweetest, powerful lord of my deepest mind: terrible, but dear gift of the heavens: companion of my darkest days, Thought, that often stirs inside me. Who does not talk of your secret nature? Who does not know its power among us? Yet often, since human language gains its own impetus from your action, it often seems strange to those who listen to what you create. How lonely my mind has become, since you took it as your home! All my other thoughts vanish, swift as flashes of lightning all around: Like a tower on an empty plain, you stand alone, gigantic, among them. What are earthly affairs, what is all life to me, compared with you! What intolerable tedium, our leisure, familiar trades, the vain hopes of vain pleasure, beside that joy, the heavenly joy that comes from you! Just as a traveller is happy to turn his eyes from bare rock in the rugged Apennines, towards some far green sunlit field, so I turn willingly from harsh, dry mundane conversations, as if towards a happy garden, and your space restores my senses again. It seems well nigh incredible I’ve endured this wretched life, and this foolish world, for so long without you: almost impossible to comprehend how others can sigh with desire for anything except what resembles you. Fear of death has never entered my heart, since I first learned from experience what life was. That final necessity this strange world sometimes praises, yet abhors and trembles at, seems like a jest to me today: and if danger threatens, I pause and smile, to contemplate its menace. I’ve always despised cowards, and ungenerous spirits. Now any shameful act stings me at once: examples of human baseness stir my soul, at once, to scorn. I feel myself greater than this insolent age that nourishes itself on empty hope, in love with gossip, hostile to virtue: foolish, it asks for sense, without seeing how life becomes more and more senseless. I scorn human judgement: and tread down that fickle crowd, hostile to true thought, who despise your worth. What allegiance does not yield to that from which you rise? Indeed what other allegiance but this has power among mortals? Avarice, pride, hatred, disdain, love of honour, power, what are they but whims compared to this? Only one allegiance is alive to us: eternal law has only decreed one over-ruling lord of the human heart. Life has no worth or meaning except in this, which is all to us: which alone absolves fate for placing mortals here to suffer, with no other purpose: in this one allegiance, life is more noble than death, if not to fools, to hearts that are not base, Sweet thought, because of your joys, to have endured our human troubles, and suffered this mortal life for many years, has not been in vain: and expert though I am in pain, I’d still be prepared to take to the road for such a purpose: since I’ve never journeyed, weary, through the sands, among the venomous snakes, and reached you, without my pain being eased by your great blessing. What a world, what a new immensity, what a paradise it is to which your marvellous enchantment seemed to lift me! Where I used to wander in that strange light, forgetting my earthly state, and everything of our reality, among the dreams, I think, that immortals know. Alas, you are, in the end, a dream, sweet thought, one that adorns truth for the most part: yet a dream, a clear illusion. But you, among nature’s happy illusions, are divine: because you are so strong, and vital, that you can endure tenaciously against truth, and even adapt to truth, and not dissolve, till you meet with death. O my thought, it’s true, that you, the only vital part of my days, delightful cause of infinite pain, will sometime be quenched with me in death: you whose signs I feel alive in my soul, such that you’ll be my lord for ever. Other noble illusions often fail in the face of truth. The more I turn to gaze at her, of whom I love to speak with you, the greater grows the delight, the greater the delirium, I breathe. Angelic beauty! Wherever I look, among the lovely faces, they are only painted images of your face. It seems to me, you are the sole fount of every other loveliness, of every true beauty. When, since I first saw you, were you not the ultimate goal of my deepest cares? What part of the day passed when I did not think of you? How often did my dreams lack your sovereign image? Lovely as a dream, angelic form, in earthly place, in the high realms of the universe, what do I ask for, or hope to see that is more beautiful than your eyes, or own that is sweeter than thought of you? 16. Love And Death (XXVII) ‘Those whom the gods love die young’ Menander Fate gave birth, at the same moment, to the brothers, Love and Death. The world owns to none so fine, nor do the stars. From the former, the Good is born, and the greatest pleasure, to be found in the ocean of being: the latter annuls our greatest pain, and all our greatest evil. Often the boy, Love, joys in keeping company, with a beautiful girl, sweet to see, not as cowardly people paint her: and flying together through human life they are the wise heart’s greatest solace. No heart was ever wiser than when pierced by love, nor firmer in scorning wretched life, nor so ready to face danger for any lord but this one: Love, where you give your help, courage is born, is roused: then the hu"
}