{
  "url": "https://www.ashevillebikecompany.com/articles/about-pg181.htm",
  "title": "About - Asheville Bicycle Company",
  "text": "About Us Your Local Bike Shop Asheville Bicycle Company is not just another “bike shop.” We strive to make your purchase not only the right purchase but to give you peace of mind that Asheville Bicycle Company is behind you all the way – from the day you make a purchase to the coming years that you enjoy that purchase. Asheville Bicycle Company is a part of the Ski Country Sports family. Ski Country Sports began in 1990, specializing in ski equipment, clothing and inline skates. However, the shop quickly grew to also become one of the leading bike shops in the area with a full line of bicycles, including road, mountain, BMX and youth bikes. The shop also boasts one of the largest service centers in Asheville and the surrounding area. In 2015, the bike portion of the shop broke off into Asheville Bicycle Company, which remains the leading area dealer of Giant and Kona products. The Asheville Bicycle Company Advantage Overarching all of the Asheville Bicycle Company Advantages is the very best customer service. Just ask any of our customers and they’ll tell you - we go the extra mile. We understand the needs of all our customers, from the novice rider to the elite racer. We have all the essential tools an established retailer needs to excel in today’s retail environment. Asheville Bicycle Company has the most advanced customer service programs available. DEMO/RENTAL PROGRAM Not sure about the ride? Try it before you buy it! We have a fleet of road and mountain bikes available for you to rent or demo. KIDS' BIKE TRADE-IN PROGRAM They grow fast! Let us help you keep your children in a proper fitting bicycle. 50% towards a replacement bike within one year, 30% within two years. FREE MAINTENANCE We offer FREE tune-ups for the first year on all new bikes. Your bike will settle in during the first few rides so bring it back for free adjustments. Browse Our Bike Selection Find your dream bike today and visit us for a test ride. We'll ensure that you're on the right bike to meet your needs and the right frame size for a comfortable, safe cycling experience."
}