{
  "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-nasdaq-sp-500-sink-as-tech-falters-amid-flood-of-earnings-192429486.html",
  "title": "Stock market today: Dow, Nasdaq, S&P 500 sink as tech falters amid flood of earnings",
  "text": "US stocks sank on Tuesday as investors digested a wave of tech-focused earnings, while precious metals jumped to continue their wild ride and a partial government shutdown neared an end. The tech-heavy Nasdaq Composite (^IXIC) sank 1.4%, with its sell-off gaining steam throughout the day. The S&P 500 (^GSPC) lost 0.8%. The Dow Jones Industrial Average (^DJI) fell around 0.3% after the blue-chip benchmark led gains on Monday. Palantir's (PLTR) surprisingly strong quarterly results signaled the AI trade may have room to run. But the rosy outlook flipped early in the session, with many of tech's biggest names continuing a recent slide. Nvidia (NVDA) fell nearly 3% amid signs of cooling relations with OpenAI (OPAI.PVT). The startup's dissatisfaction with Nvidia's latest AI chips has bogged down talks with the chipmaker for an investment of up to $100 billion. Amazon (AMZN) and Microsoft (MSFT) also lost ground amid a continued sell-off in software stocks. Tuesday's software plunge came as AI startup Anthropic (ANTH.PVT) unveiled a productivity tool for in-house lawyers. The dour mood around tech has turned a spotlight on chipmaker AMD's (AMD) after-hours earnings report, which could provide the best look yet at the AI trade amid those fears of Big Tech overspending and an AI bubble. Its results prepare the ground for quarterly updates from Amazon and Alphabet (GOOG), which will be highlighted later this week. Also on Tuesday, PayPal (PYPL) earnings and forecast missed estimates, as the payments services firm named HP (HPQ) boss Enrique Lores as its new CEO. Its stock tumbled over 20%, against a background of an exodus from software stocks. Reports from Pepsi (PEP), Pfizer (PFE), and Chipotle (CMG) are also on the docket. Elsewhere in the corporate world, The Walt Disney Company (DIS) named parks chief Josh D'Amaro as the entertainment giant's next CEO, set to replace longtime leader Bob Iger on March 18. Shares fell. Meanwhile, volatility continued to grip precious metals, as gold (GC=F) jumped over 6%, marking its biggest daily gain since 2008, having notched its deepest daily drop in 43 years on Friday. An influx of dip-buyers was credited as silver (SI=F) also rebounded dramatically from Monday's losses, surging over 9%. LIVE COVERAGE IS OVER 24 updates- Laura Bratton Tech leads US stocks lower at the close The tech-heavy Nasdaq Composite (^IXIC) led major indexes lower Tuesday, ending the trading session down 1.4% after its sell-off gained steam throughout the day. The S&P 500 (^GSPC) lost 0.8%, while the Dow Jones Industrial Average (^DJI) shed 0.3% after leading gains on Monday. Of the \"Magnificent Seven\" Big Tech stocks, Nvidia (NVDA) and Microsoft (MSFT) led declines. Nvidia's nearly 3% drop comes after a report that OpenAI was displeased with its latest chips, while Microsoft's similar drop mirrored a continued slide in software stocks. - Laura Bratton Chipotle expected to report another quarter of sales declines as it navigates tricky consumer backdrop Chipotle (CMG) shares fell slightly on Tuesday to mirror a broader market drawdown as the fast casual food chain prepared to report quarterly results after the bell. My colleague Brooke DiPalma reports: - Laura Bratton Analyst sees PayPal stock's plunge as buying opportunity Yahoo Finance's Francisco Velasquez writes: - Laura Bratton Oil rises after US jet shoots Iranian drone Oil prices rose on Tuesday after a US fighter jet shot an Iranian drone, the latest sign of escalating tensions between the countries. Bloomberg reports: - Grace O'Donnell House clears key procedural hurdle, paving the way for the government to reopen The House cleared a key procedural hurdle this afternoon that brings the end of the partial government shutdown closer, Yahoo Finance's Ben Werschkul reports. After a couple of hours of back-and-forth, House lawmakers narrowly passed a procedural vote almost entirely along party lines — with a final tally of 217-215 — that sets up a final vote later today. Only one Republican, Thomas Massie of Kentucky, voted no with every Democrat. Should the funding deal, which passed the Senate last week 71-29, clear a final vote soon, it will likely be sent to the White House. The bill contains five spending measures but delays a final decision on funding the Department of Homeland Security. Stocks continued to be under pressure in afternoon trading, however, as tech dragged the indexes lower. Gold (GC=F) jumped by 6% to $4,932 per ounce as a recent sell-off unwound. - Jake Conley Software stocks slide as investors dump stocks Sentiment toward software stocks on Wall Street has plunged as investors have dumped shares throughout the sector on fears that the software-as-a-services business faces a severe threat of competition from or replacement by AI, Bloomberg reports. Companies such as SAP (SAP), Salesforce (CRM), and ServiceNow (NOW) have all seen deep sell-offs over the past week as the market sours on the sector. Bloomberg reports: - Jake Conley Novo Nordisk says sales will drop in 2026 as popular drugs face competition, stock dives Novo Nordisk's (NVO) 2026 sales will likely decline by 5% to 13% as the company's headline Ozempic and Wegovy medications face stiffer competition and a White House push to cut drug pricing, the company said in an outlook report on Tuesday. Shares plunged by more than 14% in the minutes after the release. Analysts had only expected a sales decline of 1.4%, according to Bloomberg. Novo Nordisk sales grew by 10% in 2025 as the popularity of its weight management drugs Ozempic and Wegovy exploded; however, the Danish drugmaker has faced greater competition from rivals such as Eli Lilly (LLY). Novo has also faced come-and-go threats from compounded semaglutide makers such as Hims (HIMS), which distributed a generic GLP-1 before the FDA banned the practice in 2025. In its release, Novo attributed the drop in sales to \"continued volume penetration from GLP-1 treatments and market expansion, mainly within obesity, as well as intensifying competition and negative impacts from the compound patent expiry of the semaglutide molecule in certain markets\" internationally. Its US sales impact is due to \"current prescription trends for the injectable GLP-1 portfolio, intensifying competition as well as negative impact from reduced obesity medication coverage in Medicaid.\" The company also said in the Tuesday release that its adjusted operating profit growth would also fall by an equal 5% to 13%. - Jake Conley Partial government shutdown looks close to ending, House vote scheduled for spending bills approval The partial government shutdown looks likely to soon come to a close as the House of Representatives prepares for a final vote to approve five spending bills while pushing off a decision on funding for the Department of Homeland Security. Our Ben Werschkul reports: - Jake Conley Bloomberg: White House set to issue oil drilling license for Venezuela The Trump administration is preparing to issue a general license allowing US oil companies to begin drilling for fossil fuels in Venezuela, roughly a month after the extraction of Venezuelan leader Nicolás Maduro, according to Bloomberg. The move comes as the White House is looking to unlock Venezuela's vast hydrocarbon stores, with roughly 300 billion barrels of crude oil underfoot. The prospective license could be issued by the Treasury Department as early as this week, Bloomberg reported. Such a decision by the Treasury Department would be the second such step as the US looks to license a rebuilding of the South American country's oil economy. In late January, the US issued a general license allowing companies to buy and sell Venezuelan oil, which commodity trading houses such as Trafigura and Vitol have jumped on. As the US Navy blockade stopped oil from leaving the country, exported hydrocarbons have built up in storage tanks and on oil tankers, meaning that a large amount of oil is ready to be sold without any extraction activity. This newer license the Treasury Department is planning to issue would allow upstream operators to begin drilling operations, taking new oil out of the ground. Reactions have been mixed as the Trump administration — and President Trump himself — has pressured US oil and gas operators to consider investments in Venezuela. Chevron (CVX), the only US oil company to continue operating under Hugo Chavez and Maduro, has not yet announced any plans to meaningfully boost its current production rates, and Exxon Mobil (XOM) CEO Darren Woods called the country \"uninvestable\" in its current state during a meeting at the White House in January. - Grace O'Donnell Partial government shutdown delays JOLTS report The December Job Openings and Labor Turnover Survey, which was scheduled to be released on Tuesday morning at 10:00 a.m. ET, was delayed due to the government shutdown and will be rescheduled when the government reopens. The January jobs report, which was supposed to be released on Friday, has also been postponed. The partial government shutdown is now in its fourth day, but may be nearing its end. \"Due to the partial federal government shutdown, the Bureau of Labor Statistics (BLS) will suspend data collection, processing, and dissemination,\" Emily Liddel, BLS associate commissioner for publications and special studies, said in a statement. \"The Job Openings and Labor Turnover Survey release for December 2025, Metropolitan Area Employment and Unemployment release for December 2025, and the Employment Situation release for January 2026 will be rescheduled upon the resumption of government funding.\" - Jake Conley Walmart crosses $1 trillion market cap Walmart (WMT) passed the $1 trillion market capitalization mark Tuesday morning as shares ticked up by over 1%, buoyed by positive investor sentiment as John Furner replaced Doug McMillon as CEO at the start of February. In crossing the $1 trillion mark, Walmart made its way onto a short list of the world's largest companies that is overwhelmingly dominated by the biggest tech players. The investment advisory firm Piper Sandler raised its Walmart price target to $130 Tuesday morning on the company's apparel strength, and Bank of America said in a recent client note that Walmart could benefit from tax refund provisions in the One Big Beautiful Bill Act. The company's shares have picked up more than 12% since the start of the year. Walmart is expected to report fourth-quarter earnings on Feb. 19. - Jake Conley Galaxy Digital loses nearly $500 million in Q4 after crypto crash Shares in Galaxy Digital (GLXY) fell by more than 4% after the company disclosed Tuesday morning that it lost nearly $500 million and posted negative adjusted earnings for the fourth quarter, driven by \"depreciation of digital asset prices in the quarter.\" Michael Novogratz's digital assets-focused financial services firm reported a fourth quarter adjusted loss per share of $1.08, falling below analyst estimates for a loss per share of $0.92. Galaxy Digital also missed on revenue for the quarter, reporting $10.2 billion in revenue against analyst estimates of $12.15 billion. The company said in a press release announcing the earnings that its loss in crypto-driven revenue reflects \"a softer macro environment and lower industry trading volumes and onchain activity.\" Galaxy Digital also noted that its digital assets trading volumes declined by approximately 40% quarter-on-quarter, \"reflecting softer client activity following a record Q3.\" In Galaxy Digital's data center division, the company said it \"remains on track to deliver 133MW of critical IT load to CoreWeave in the first half of 2026\" and that it \"received ERCOT approval for an additional 830 MW of power capacity,\" bringing the total approved capacity for its Helios campus to 1.6 gigawatts. bringing Helios’ total approved capacity to more than 1.6 gigawatts - Jake Conley US stocks tick higher after strong Palantir results, more Big Tech earnings ahead The US stock market mostly ticked higher at Tuesday's open as earnings rolled in, with Palantir's (PLTR) outlook fueling faith in AI demand and precious metals jumping to continue their wild ride. The tech-heavy Nasdaq Composite (^IXIC), S&P 500 (^GSPC), and Dow Jones Industrial Average (^DJI) all rose after the blue-chip benchmark led gains on Monday with a 500-point advance. The S&P 500 is eyeing a fresh record after Palantir's surprisingly strong quarterly results signaled continued strength in the AI trade. Elsewhere in the sector, investors are watching posturing Nvidia (NVDA) and OpenAI (OPAI.PVT) amid headlines hinting at a cooling relations between the high-profile AI players. Market attention now turns to chipmaker AMD's (AMD) after-hours earnings report, which could provide the best look yet at the AI trade amid those fears of Big Tech overspending and an AI bubble, and updates from Amazon (AMZN) and Alphabet (GOOG) later this week. Gold (GC=F), silver (SI=F), copper (HG=F), and crude oil (CL=F, BZ=F) all picked up through Tuesday morning in a reversal to the major commodities sell-off on Monday. - Jake Conley Disney names parks chief Josh D'Amaro as CEO, replaces Bob Iger Walt Disney (DIS) named parks division chief Josh D'Amaro as the company's next CEO, succeeding long-time leader Bob Iger. Shares ticked up by more than 1% in premarket trading on the news. D'Amaro has led Disney's parks and cruise businesses — which operate under the company's Experiences unit — since 2020. He joined Disney in 1998. D'Amaro will replace Iger on March 18, according to Disney's statement on Tuesday morning. Iger, who has effectively been at the helm of Disney since 2005, will remain on Disney's board through the end of the year. Iger stepped down from the CEO role in February 2020 to be replaced by Bob Chapek, but he was reappointed as CEO in November 2022 after Chapek was ousted from the company. As part of the executive move, Dana Walden, co-chair of Disney Entertainment alongside D'Amaro, has been named Disney's president and chief creative officer, the company said. The decision by Disney to appoint D'Amaro to the chief executive role caps off years-long speculation over which of Iger's top deputies would be tapped to lead one of the largest entertainment companies in the world. - Karen Friar AMD to report Q4 earnings amid AI spending concerns Yahoo Finance's Daniel Howley previews what to watch when chipmaker AMD (AMD) posts its fourth quarter results after the market close. He writes: - Jenny McCall PayPal stock sinks after forecasting 2026 profit below estimates PayPal (PYPL) stock fell 15% before the bell on Tuesday after issuing a disappointing profit forecast for 2026 and reporting fourth quarter earnings below Wall Street estimates. The online payment company said it had been pressured by weaker US retail spending and slow growth within its branded checkout segment. The group also named HP's (HP) Enrique Lores as president and CEO, effective March 1. Reuters reports: - Jenny McCall AES rises as BlackRock's Global Infrastructure Partners team up with EQT in bid to acquire power firm - Karen Friar Silver’s runaway rally becomes ‘death trap’ for Reddit’s retail crowd Silver (SI=F) is surging almost 13% in premarket hours, bouncing back again as precious metals whipsaw after hitting the brakes on a historic run higher. But the transformation from record rally to brutal three-day rout has left traders stunned, battering the retail investors who powered its spectacular rise, per the Financial Times. The FT reports: - Karen Friar Samsung’s best day since 2008 powers S. Korean stock rally Bloomberg reports: A global rush to secure memory chips for artificial intelligence is powering a renewed surge in South Korean equities, with chipmakers leading a rebound that pushed the Kospi (^KS11) to a fresh record on Tuesday. Samsung Electronics Co (005930.KS) shares jumped 11% on Korea Exchange, the most since 2008, while SK Hynix Inc. (000660.KS, HXSCL) added more than 9%. Both stocks recouped losses from the previous session. The benchmark Kospi climbed nearly 7%, extending its gain for the year to 25% and solidifying its status as the world’s best-performing equity index. Up more than 39% each this year, the chip duo have continued to set new records as investors embrace AI’s voracious demand for memory chips. Despite the torrid gains, few analysts see them as expensive thanks to strong earnings momentum and still-reasonable valuations. “The structural shortage in memory chips makes the continued growth of Samsung and SK Hynix inevitable,” said Kim Namho, a fund manager at Timefolio Investment Management in Seoul. - Grace O'Donnell NXP stock falls despite earnings beat as Automotive growth stabilizes NXP Semiconductors (NXPI) stock skidded over 5% lower in premarket hours after the semiconductor company's Automotive revenue failed to impress investors. In the fourth quarter, NXP reported adjusted profits of $3.35 per share, surpassing Wall Street estimates for adjusted earnings of $3.31 per share. The company posted revenue of $3.34 billion, slightly above expectations for $3.3 billion. \"Throughout 2025, we executed effectively despite a challenging first half, maintaining operational discipline while advancing our strategic priorities in software defined vehicles and physical AI,\" NXP's CEO Rafael Sotomayor said. Revenue growth for NXP's Automotive segment, which contributes over half of NXP's total revenue, moderated to a 5% annual rate from the third quarter's 6% growth. The segment brought in $1.8 billion in Q4, which came in a bit lighter than expectations for $1.9 billion. The Industrial and Internet of Things unit reported 24% annual revenue growth ($640 million), the Mobile unit reported 22% revenue growth ($485 million), and Communication Infrastructure declined by 18% year over year ($334 million). For the first quarter, NXP forecast revenue of $3.15 billion at the midpoint and diluted earnings per share of $4.21, which were ahead of the Street's estimates for $3.09 billion in revenue and $2.95 per share, according to S&P Global Market Intelligence."
}