{
  "url": "https://forum.lowyat.net/topic/5545933/all",
  "title": "\"Tak balas, akaun Whatsapp banhammer\"- J&T rider",
  "text": "A video by a TikTok user claiming to be a J&T Express rider has caught people's attention, with the rider suggesting that couriers' WhatsApp accounts could be banned if customers ignore their messages after deliveries In the TikTok video posted late last month, which has since gone viral with over 2 million views, @hznrzli asks recipients, particularly those paying via online transfer (non-cash on delivery), to at least reply to delivery notifications with a \"thank you\", a sticker, or even a single dot. He says that leaving the riders' messages on 'read' or 'seen' could lead WhatsApp to flag the riders' interactions as spam, potentially restricting or banning their account and making it harder for them to communicate about parcel deliveries. Here is the English translation of his request: QUOTE \"Assalamualaikum. I am representing all couriers, especially J&T. \"I really want to ask for a favour, please, from the customers who are non-COD, the ones who pay via online transfer. \"You know how when a rider has delivered your item, they will WhatsApp you, right? \"Can I please, please ask for a favour? At least reply with something. 'Thank you,' or if you don't reply, 'thank you,' just send a sticker. Even replying with just a 'period' (full stop) is enough. This is because we want to avoid… getting hit with this.\" He then shows his phone screen, which displays a WhatsApp alert stating: \"Your account is restricted right now… Recent activity on your account may be a sign of spam, automated or bulk messaging.\" The J&T Express rider showing his phone screen, where a WhatsApp alert says his account has been restricted. QUOTE \"See, when we get this, we can't WhatsApp you all. We can't tell you where we've placed your parcel. So then you won't know. And if you're worried the parcel is lost or something, it becomes difficult for both of us. \"So that's all. Just reply with anything. Reply 'K' or 'Q,'… as long as you reply. Because once you've replied, we have established communication. \"Then WhatsApp won't flag us for 'spam'. We get this because customers don't reply 'thank you' or anything at all. So then we get banned for 'WhatsApp spam,' something like that. \"Okay, thank you. Please spread this message to everyone. Muah.\" So, what's actually going on? While it's true that WhatsApp can restrict or even ban accounts it thinks are sending spam, the situation isn't as simple as \"don't reply = ban\". From what's publicly known, the platform considers factors like whether messages get reported, blocked, or ignored on a large scale, especially if the sender is messaging lots of people they shouldn't. For a courier sending normal delivery updates, the risk is probably low, especially if the messages are expected and customers haven't reported them as unwanted. Replying to a message might help the delivery rider's account stay in good standing, but ignoring it won't automatically trigger a ban. In short, the TikTok video isn't entirely wrong; the rider's account could theoretically be restricted if WhatsApp flags it, but the idea that customers must reply to avoid this is a bit of an exaggeration. A simple \"thank you\" might make things smoother, but the platform is looking at the bigger picture, not just whether a single message gets a response. That said, replying is courteous, and you should ideally do it as it may help the sender avoid spam flags, but it is not a guarantee."
}