{
  "url": "https://en.wikipedia.org/wiki/Czar_(political_term)",
  "title": "Czar (political term) - Wikipedia",
  "text": "Czar (political term) Czar, sometimes spelled tsar, is an informal title used for certain high-level officials in the United States and United Kingdom, typically granted broad power to address a particular issue. In the United States, czars are generally executive branch officials appointed by the head of the executive branch (such as the president for the federal government, or the governor of a state). Czars may require confirmation with Senate approval while others do not. Some appointees outside the executive branch are called czars as well. Specific instances of the term are often a media creation.[1] In the United Kingdom, the term is more loosely used to refer to high-profile appointments who devote their skills to one particular area. Etymology [edit]The word czar is of Slavic origin, etymologically originating from the name Caesar, as with the word tsar, a title of sovereignty, created and first used by the First Bulgarian Empire.[2] The title was later adopted and used by the Serbian Empire and Tsardom of Russia. The feminine of the historic title is czarina, but when used in the modern political context the term czar is gender-neutral.[3] United States [edit]History [edit]Early uses [edit]Speaker of the House Joseph Gurney Cannon, was sometimes referred to as Czar Cannon (a play on the giant cannon of the same name) as a result of his power during this time. However, there was a \"revolt\" in the House which saw Cannon give up power, as well as an overall decentralization of power within the House.[4] During the latter stages of World War I, President Woodrow Wilson appointed financier Bernard Baruch to run the War Industries Board. This position was sometimes dubbed the \"industry czar\".[1] One of the earliest known metaphorical usages of the term in the U.S. was in reference to Judge Kenesaw Mountain Landis, who was named commissioner of baseball, with broad powers to clean up the sport after it had been dirtied by the Black Sox scandal of 1919.[5] In 1926, a New York City chamber of commerce named what The New York Times termed a \"czar\" to clean up the milk delivery industry.[6] Modern usage [edit]In the United States, the term czar has been used by the media to refer to appointed executive branch officials since at least the 1930s and then the 1940s under President Franklin D. Roosevelt.[7][8][9] In 1942, The Washington Post reported on the \"executive orders creating new czars to control various aspects of our wartime economy.\"[10] Positions were created for a transportation czar, a manpower czar, a production czar, a shipping czar, and a synthetic rubber czar, all to solve difficult problems in coordinating the resources necessary to fight World War II.[1][11] Not only did the administration of President Roosevelt advocate their creation; in December 1944, Republicans in Congress advocated that a \"food czar\" position be created that would have almost unlimited control over food pricing and distribution.[12] Certain of Roosevelt's Cabinet secretaries were called \"czars\", despite having been duly confirmed by the Senate, at the point that their powers were increased by statute.[8] Since then, a number of ad hoc temporary as well as permanent United States Executive Branch positions have been established that have been referred to in this manner. The trend began again in earnest[1] when President Richard Nixon created two offices whose heads became known as \"czars\" in the popular press: drug czar in 1971,[13] and especially energy czar in December 1973[14] referring to William E. Simon's appointment as the head of the Federal Energy Administration.[15] Nixon told his cabinet that Simon would have \"absolute authority\" in his designated areas, and compared the intended result to Albert Speer's role as the person in unquestioned charge of armaments for the Third Reich.[16] Simon found both the informal title \"czar\" and the Speer comparison unsettling.[16] However, at the height of the Arab oil embargo, Simon gave the position a good name by successfully putting into place a mandatory fuel allocation program and calming public fears about shortages without resorting to explicit gasoline rationing.[1][17] Other examples of this usage include \"drug czar\" for the head of the Office of National Drug Control Policy – probably the best-known of all the \"czars\",[1] \"terrorism czar\" for a Presidential advisor on terrorism policy, \"cybersecurity czar\" for the highest-ranking Department of Homeland Security official on computer security and information security policy, and \"war czar\" to oversee the wars in Iraq and Afghanistan. In 2005, the U.S. Government Accountability Office issued an opinion regarding the use of the term \"drug czar\" in prepackaged news stories that had been released by the Office of National Drug Control Policy during fiscal years 2002, 2003, and 2004. The GAO found that while \"the law does not bestow that title on the ONDCP Director\", \"ONDCP's use of the term \"Drug Czar\" to describe the Director of ONDCP does not constitute unlawful self-aggrandizement\".[18] The term \"czar\" has also been applied to officials who are not members of the Executive Branch, such as Elizabeth Warren, named to a Congressional commission to oversee the Troubled Asset Relief Program in 2009 and described as an \"oversight czar\",[19] and Senate-confirmed positions, such as the Director of National Intelligence, described as the \"intelligence czar\" in 2004.[20] Rationale [edit]Advantages cited for the creation of czar type posts include the ability to go outside of formal channels and find creative solutions for ad hoc problems, and an ability to involve a lot of government players in big issue decision-making, ultimately enabling a huge bureaucracy to move in a new direction. Problems can occur with getting all the parties to work together and with managing competing power centers.[21] One explanation for use of the term states that while the American public revolts at terms like \"king\" and \"dictator\", associating them with King George III or fascist figures of World War II, the term \"czar\" is foreign, distant, and exotic enough to be acceptable.[11] Czar positions are often created in times of perceived public crisis which results in the public being eager to see a strong figure making hard decisions that the existing political structure is unable to do.[11] Americans of the era generally adopted exotic Asian words to denote those with great, and perhaps unchecked, power, with the examples \"mogul\" and \"tycoon\" being used in business contexts.[citation needed] Causes [edit]The increase in czar positions over time may be because as the size and role of the executive branch governments has grown, so too has the difficulty of coordinating policy across multiple jurisdictions.[22] Indeed, czar positions sometimes become important enough that they become permanent executive offices, such as the Office of National Drug Control Policy or the United States Trade Representative.[22] Two legal scholars have also questioned whether Congress has contributed to the proliferation of czars.[23] From 1939 to 1984, Congress had authorized the president to consolidate functions and agencies within the Executive branch, pursuant to the Reorganization Act, which minimized the president's administrative burden \"of trying to coordinate disparate functions operating under equally disparate authorities.\" But Congress allowed this authority to expire at the end of President Reagan's first term, leading these scholars to conclude: Absent reorganization authority, what was a president to do? The president cannot personally coordinate all disparate functions and agencies in the massive federal government. Yet, if a policy fails because of poor coordination, the president is held to account. So it is no coincidence that as the complexity of government machinery has grown, presidents have responded by increasing the number of assistants or \"czars\" to help with the management and coordination of the executive branch.[23] Criticism [edit]The appointment of \"czars\" serving the executive branch has been a source of controversy through the years. As early as 1942, an editorial cartoon depicted \"czar of prices\" Leon Henderson, \"czar of production\" Donald Nelson, and \"czar of ships\" Emory S. Land sharing a throne.[9] In 2009, the non-profit government watchdog organization Taxpayers for Common Sense reported \"by our count there are at least 31 active Czars, giving the current administration more Czars than Imperial Russia had in its history.\"[24] Critics who charge that czars are unconstitutional often ground their complaints in Article II, Section 2 of the U.S. Constitution, which states the president may nominate \"other public Ministers ... by and with the Advice and Consent of the Senate.\"[25] In this stance, a czar appointee is only legal if confirmed by the Senate; otherwise, they can not exist until they receive such consent. Based on their interpretation of the constitutional language, these critics argue that czars should be subject to Senate confirmation. The issue is mostly touted by conservatives and Republicans, and during 2009 grew into a staple of anti-Obama activism.[26] Democratic Senator and Constitutional scholar Robert Byrd had expressed concern as well,[26] with Byrd writing to Obama that: \"The rapid and easy accumulation of power by White House staff can threaten the Constitutional system of checks and balances. At the worst, White House staff have taken direction and control of programmatic areas that are the statutory responsibility of Senate-confirmed officials.\"[27] Democratic Senators Russ Feingold and Dianne Feinstein both questioned whether there was adequate Senate oversight of czar-driven activities.[28][29] Congressional Republicans alleged that \"climate czar\" Carol Browner's access to the president had usurped power from other agencies.[30][31] By September 2009, Representative Jack Kingston found 100 cosponsors for a proposed Czar Accountability and Reform Act of 2009, which sought to prohibit taxpayer-paid salaries to \"any task force, council, or similar office which is established by or at the direction of the President and headed by an individual who has been inappropriately appointed to such position (on other than an interim basis), without the advice and consent of the Senate.\"[32] The Obama administration largely downplayed the concerns, saying that he was doing just what many previous presidents had done.[1] A White House spokesperson said, \"The term 'czar' is largely a media creation to make jobs that have existed under multiple administrations sound more exciting. Every president since Nixon has hired smart and qualified people to coordinate between agencies and the White House.\"[29] At October 2009 hearings before the United States Senate Judiciary Subcommittee on the Constitution, constitutional experts asserted that there was nothing wrong with presidents appointing independent advisors, as long as their authority was exerted in practical, not legal, terms.[33] These experts said that the precedent for \"czar\"-like positions had been established with the Franklin D. Roosevelt administration.[33] Meanwhile, following the September 2009 resignation of \"green jobs czar\" Van Jones, for statements made prior to assuming his position, radio and television commentator Glenn Beck targeted several additional \"czars\" for increased scrutiny by his audience.[34] The Jones case illustrated that czars for non-confirmation positions may not get as much vetting before being named as one whom an administration knows will have to face the Senate.[35] However, the position itself may not have been that important; Brookings Institution fellow Stephen Hess described Jones as a third-tier adviser reporting to a powerless committee.[22] The historical term itself has come under criticism; in 2009, U.S. Representative Paul Broun said, \"We do not need and should not have czars. The last time I checked, only pre-Communist Russia had czars, and we are certainly not Russia.\"[34] Prior to resigning, Van Jones himself rejected use of the term, preferring instead \"green-jobs handyman\".[34] Indeed, the Obama administration as a whole tended to prefer not to use the \"czar\" term.[36] One Office of Management and Budget veteran said, \"I'm not fond of the term czar. It's a name with pejorative connotations hung on these people who are coordinators, facilitators, catalysts ... [the Obama czars controversy is] much ado about very little. Appointing individuals to serve as the focal point on some issues of presidential interest is a tested and [sometimes] very effective way of dealing with such challenges.\"[22] Resistance to the term has itself a long history; the Interstate Commerce Commissioner during the Franklin D. Roosevelt administration, Joseph B. Eastman, declared he was not a \"Federal railroad czar\" upon being appointed transportation coordinator.[7] The need for czars itself brings a critique: Steve Forbes has said, \"It underscores the inefficiency of government that you keep ... having people, hoping that maybe they will get something done that the massive government bureaucracy cannot.\"[36] With many czars, the challenge of managing them grows, such as was lampooned by The Washington Post's 1942 remark after enumerating recent appointments that, \"So far as we can determine, the galaxy of czars is now complete, unless the President should decide to appoint a czar over the czars.\"[10] The position continued to be a subject of criticism, and in April 2011, as part of the 2011 federal spending agreement that averted a government shutdown, four czar positions were indeed eliminated.[37] Effectiveness [edit]Scholars have said that it is not possible to make a universal judgment on the effectiveness of czars.[35] The great strength of czars, their loyalty to the president and lack of other bureaucratic constituencies,[35] can also be a cause of their weakness. While they have direct access to the president, they lack operational authority over governmental agencies and often have little or no budget line.[1][27] As head of the Office of Homeland Security during the George W. Bush administration, Tom Ridge found that these reasons significantly limited his ability to influence policy.[27] As \"drug czar\", William Bennett also noticed that the lack of direct authority, inability to dispense grants, and relative small staff was a \"potentially debilitating institutional weakness\" that he needed to overcome.[38] It is important for czars to have staff they have confidence in. When originally naming an \"energy czar\", President Nixon suggested that William E. Simon get staff assigned to him from all of the agencies involved in energy policy.[16] Simon rejected this approach, knowing that those agencies would unload their civil service deadwood onto him; instead, Simon insisted that he also retain his existing position of Deputy Secretary of the Treasury and the staff there that he had trust in.[16] The symbolism associated with a czar position be created in a perceived emergency can sometimes be effective in and of itself.[1] During the Y2K run-up, John Koskinen of the President's Council on Year 2000 Conversion could force agencies behind in preparation to defend themselves before the White House and cabinet agencies.[1] Bennett found in the drug czar position that President George H. W. Bush made extraordinary efforts to demonstrate that Bennett had his support, so much so that Bennett fared better bureaucratically than if he had held a regular Cabinet position.[38] Bennett also found that the czar slot lent itself towards taking a \"bully pulpit\" approach.[38] In general, the kind of strong authority that the czar position conveys is usually difficult to actually assemble in American political life; instead, the number of bureaucratic organizations engaged in factional disputes and battling for limited resources is just increased by adding the czar position.[11] If a czar actually is strong and effective, then opposition to him or her rises from the governmental bodies which are losing power, and civil libertarians will often publicly object as well.[1][11] United Kingdom [edit]In the United Kingdom, the term is more loosely used to refer to high-profile appointments who devote their skills to one particular area. The term was widely used in the British media to refer to Gordon Brown’s 2009 appointment of Alan Sugar to the newly created post of Enterprise Champion, which was dubbed \"Enterprise Tsar\" by many news agencies.[39][40] When David Cameron appointed Sugar - who had been ennobled as a Lord in 2009 - in 2016, the term \"Enterprise Tsar\" was officially used by the government.[41] The nature of the 2009 appointment, and the usage of the term \"tsar\" did receive criticism however, with columnist Tracy Corrigan in The Daily Telegraph suggesting it set a precedent for the English model Jordan to be made the \"women’s issues tsarina\",[42] with Conservative life peer Lord Hunt suggesting he could already be a \"fallen tsar\".[43] In 2013, the number and nature of some appointments was criticised, as both the Guardian and Independent cited nearly 300 \"tsar\" appointments made between 1997 and 2013.[44][45] See also [edit]- List of U.S. executive branch czars - List of positions filled by presidential appointment with Senate confirmation - Politics of the United States during World War II - Presidency of Barack Obama: Notable non-Cabinet positions References [edit]- ^ a b c d e f g h i j k James, Randy (September 23, 2009). \"A Brief History of White House Czars\". Time. Archived from the original on September 26, 2009. - ^ Britannica, The Editors of Encyclopaedia. \"Simeon I\". Encyclopedia Britannica, 23 May. 2022, https://www.britannica.com/biography/Simeon-I . Accessed 30 October 2022. - ^ \"TSAR definition and meaning\". www.collinsdictionary.com. October 27, 2025. Retrieved October 31, 2025. - ^ Hershey, Marjorie R. (2017). Party Politics in America (17th ed.). Boston: Taylor & Francis. ISBN 9781138683686. - ^ James K. Glassman (December 18, 2000). \"Close, But No Big Czar\". Reason. Archived from the original on September 2, 2009. Retrieved September 17, 2009. - ^ \"City Milk Dealers to Appoint a 'Czar'\" (fee required). The New York Times. September 1, 1926. p. 25. - ^ a b \"Eastman Declares He Is Not A 'Czar'; As Coordinator, He Says, His Job Will Be to Help Railroads to Avoid Waste\". The New York Times. June 17, 1933. Any idea that the administration's emergency railroad program makes him 'a Federal railroad czar' was repudiated by Joseph B. Eastman, Interstate Commerce Commissioner, in a statement following his appointment today by President Roosevelt as transportation coordinator. - ^ a b \"Plan Laws to Crown Wallace U.S. Farm Czar; AAA Amendments to Add Still More Power\". Chicago Tribune. August 26, 1934. Amendments to the Agricultural Adjustment act which would make Secretary Wallace czar of American agriculture - ^ a b Zimmer, Ben (December 29, 2008). \"Czar Wars: How did a term for Russian royalty work its way into American government?\". Slate.com. - ^ a b \"Food Czar\". The Washington Post. December 8, 1942. p. 12. - ^ a b c d e Sapolsky, Harvey M.; Gholz, Eugène; Talmadge, Caitlin (2008). US Defense Politics: The Origins of Security Policy. Taylor & Francis. pp. 150–151. ISBN 978-0-415-77265-5. - ^ \"Food 'Czar' Drive Is Renewed By a Republican House Group\" (fee required). The New York Times. Associated Press. December 26, 1944. - ^ Arthur, Allen (August 30, 2000). \"Portrait of a Drug Czar\". Salon.com. Archived from the original on September 5, 2009. - ^ Lovley, Erika (October 21, 2008). \"Czar (n): An insult; a problem-solver\". Politico. Archived from the original on September 7, 2009. - ^ \"Nixon's Decisive New Energy Czar\". Time. December 10, 1973. Archived from the original on December 1, 2008. - ^ a b c d Simon, William E.; Caher, John M. (2004). A Time for Reflection: An Autobiography. Regnery Publishing. pp. 84–85. ISBN 0-89526-170-7. - ^ \"William Simon; Energy Czar in Oil Crisis\". Los Angeles Times. June 4, 2000. - ^ \"B-303495, Office of National Drug Control Policy--Video News Release, January 4, 2005\". U.S. Government Accountability Office. January 4, 2005. Archived from the original on September 13, 2023. Retrieved September 26, 2009. - ^ Thrush, Glenn (March 31, 2009). \"Bailout Watchdog: Treasury's stonewalling\" (blog). Politico. Retrieved September 15, 2009. - ^ Gates, Robert (June 6, 2004). \"Racing to Ruin the CIA\". The New York Times. - ^ Holland, Steve (May 29, 2009). \"Obama fashions a government of many czars\". Reuters. Archived from the original on August 19, 2009. - ^ a b c d Katherine McIntire Peters (September 25, 2009). \"Controversy over policy czars is misplaced, scholars say\". GovExec.com. Archived from the original on June 6, 2011. Retrieved September 30, 2009. - ^ a b Brown, Cody M.; Ratner, Jeffrey D. (October 19, 2009). \"White House Czars: Is Congress to Blame?\". Christian Science Monitor. - ^ \"Dancing with the Czars\". Taxpayers for Common Sense. Wastebasket. July 2, 2009. Archived from the original on November 5, 2012. Retrieved July 17, 2009. - ^ Wikisource. – via - ^ a b Fletcher, Michael A.; Dennis, Bradley (September 15, 2009). \"Critics Question Autonomy of White House 'Czars'\". The Washington Post. Retrieved September 15, 2009. - ^ a b c Straub, Noelle (February 25, 2009). \"Sen. Byrd questions Obama's use of policy 'czars'\". The New York Times. GreenWire. - ^ Raju, Manu (September 17, 2009). \"Democrats join GOP czar wars\". Politico. - ^ a b Markman, Joe (September 17, 2009). \"Taking count of Obama's 'czars,' lawmakers rise up\". Los Angeles Times. Archived from the original on September 23, 2009. - ^ King Jr., Neil (September 11, 2009). \"Role of White House Czars Sparks Battle\". The Wall Street Journal. - ^ Tankersley, Jim (May 20, 2009). \"Auto emissions deal: behind the scenes\". Los Angeles Times. - ^ Weigel, David (September 16, 2009). \"House Anti-'Czar' Bill Reaches 100 Co-Sponsors\". The Washington Independent. Archived from the original on September 23, 2009. and Weigel, David (September 8, 2009). \"House Anti-'Czar' Bill Gets 35 GOP Sponsors, May Get 35 More Today\". The Washington Independent. Archived from the original on September 12, 2009. - ^ a b Markham, Joe (October 7, 2009). \"Panel finds no fault with Obama system of policy 'czars'\". Los Angeles Times. - ^ a b c Burnham, Michael (September 9, 2009). \"Embattled Van Jones Quits, but 'Czar' Debates Rage On\". The New York Times. Greenwire. - ^ a b c Michael A. Fletcher; Brady Dennis (September 16, 2009). \"Obama's Many Policy 'Czars' Draw Ire From Conservatives\". The Washington Post. - ^ a b \"Questions Raised Over Influence of Obama 'Czars'\". Fox News. July 13, 2009. - ^ Weigel, Dave (April 12, 2011). \"The Budget Compromise: Eliminating Four Czars, and More\". Slate. - ^ a b c Bennett, William John (1992). The De-valuing of America: The Fight For Our Culture and Our Children. Simon & Schuster. pp. 97–99. ISBN 0-671-68305-5. - ^ Adams, Stephen (June 5, 2009). \"Sir Alan Sugar to become 'Enterprise Tsar'\". The Daily Telegraph. Retrieved September 16, 2009. - ^ Finch, Julia (June 5, 2009). \"Sir Alan Sugar profile: from Hackney to the House of Lords\". The Guardian. ISSN 0261-3077. Retrieved October 29, 2019. - ^ \"Lord Sugar appointed government's enterprise tsar\". GOV.UK. Retrieved October 29, 2019. - ^ Corrigan, Tracy (June 5, 2009). \"Alan Sugar, enterprise tsar - I want Jordan for women's issues tsarina\". The Daily Telegraph. Archived from the original on December 2, 2011. Retrieved September 16, 2009. - ^ Nicholas, Watt (June 9, 2009). \"Sir Alan Sugar's role as tsar queried by BBC, mocked in House of Lords\". The Guardian. Retrieved September 16, 2009. - ^ Levitt, Ruth (October 15, 2013). \"Why are tsars so popular with this government?\". The Guardian. ISSN 0261-3077. Retrieved October 29, 2019. - ^ \"Inside Whitehall: Government tsars - what are they good for?\". The Independent. October 14, 2013. Retrieved October 29, 2019."
}