{
  "url": "https://www.bitburger-international.com/en/our-brands/bitburger/bitburger-brewery/",
  "title": "Bitburger Brewery",
  "text": "The Bitburger Brewery – Success from Tradition Founded in 1817 in the southern region of the Eifel mountains, our family brewery has now been in business for seven generations, stretching over a period of 200 years. Following this long history of tradition, our brewery is now also one of Germany’s most modern and important breweries in private ownership. The most famous phrase in Germany’s beer world, “Bitte ein Bit” (“One Bit, please”), is recognisable all over the world amongst fans of Bitburger Premium Pils. Alongside our perfect pilsner, our customers also enjoy our other beer varieties and speciality beverages as well. Even though our range of products and brewing processes have continued to evolve, our core values have always remained the same: care, love and passion for brewing. These values support our consistently high quality standards. Timeline From a small rural brewery to one of the most important private breweries in Germany: take a journey back in time to find out more about the key events in our 200 years of brewery history. 2017 200 Years of Bitburger Bitburger celebrates its 200th birthday. Founded back in 1817, the Bitburger Brewery is now one of the most important breweries still in private ownership in Germany. Our core values have always remained the same though: care, love and passion for brewing. These values support our consistently high quality standards. 2007 100% Flavour, 0.0% Alcohol Bitburger 0.0% Alcohol-free is introduced. One of the only beers in Germany that is actually 0.0% alcohol whilst still boasting a great pilsner taste. 2005 A Growing Family of Products Bitburger Radler is introduced: a beer-based mixed drink made with Bitburger Premium Pils and sparkling lemonade. Produced without any artificial additives, our Radler is an incomparable, sparkling-fresh beverage that’s not too sweet. 1992 No.1 Draft Beer Brand The Bitburger brewery distributes around 1.225 million hectolitres of beer in kegs. Still to this day, there is no other draft beer that is poured in German bars more often, making Bitburger the country’s no.1 draft beer brand. 1990 Researching the Future of Brewing Bitburger launches a small-scale brewing facility to develop new styles of beer, test malt from new varieties of barley, and breed new strains of hops – as well as constantly striving to improve brewing methods and processes. It serves as an important part of our comprehensive quality management efforts. 1990 Bitburger Available in 30+ Countries The brewery distributes its products to more than 30 countries, including Finland and Australia. 1987 Taking the Lead Bitburger produces more than 2.38 million hectolitres of beer in a single year, making it one of the most important beer brands in Germany. 1970 Expanding Exports in the '70s The global reach of the brand expands: exports to Italy (South Tyrol) and the Netherlands start in 1976, the first export of Bitburger Pils to the USA in 1978, and then to Mallorca the following year. 1964 A Fitting Glass for a Truly Special Beer The Bitburger Goblet is created, which was the first speciality glassware of the brewing industry. The glass features a well-proportioned goblet shape with a hexagonal stem, complementing the unique character of Bitburger Pils. 1955 Bitburger on TV Bitburger creates its first adverts for TV and the cinema. 1951 “Bitte ein Bit” At the most important trade fair of the food industry (ANUGA in Cologne), Bitburger reveals its new advertising slogan \"Bitte ein Bit” (“One Bit, please”). The sound of the German phrase catches on quickly, and Dr Theobald Simon used his own handwriting for the slogan logo to give the lettering a distinctive character. 1950 New Markets The first post-war exports are shipped to Luxembourg and the French-administered Saar region in 1950, then the following year to Brussels and Haiti as well! 1949 Finally “Real” Bitburger Again For the first time after the second world war, the brewery is able to brew beer properly again. Production increases to 55,000 hectolitres. 1944 War and Destruction Around the end of the second world war, bombing from Allied forces leaves the town of Bitburg and the Bitburger brewery in ruins. The brewing facilities are all destroyed, leaving nearly all wooden barrels completely unusable. 1929 The Connoisseur Logo Bitburger uses a new, symbolic figure in its advertising for its popular pilsner: called the \"connoisseur\", the image was created by the graphic artist G. H. Heimig. The image started to be used in all advertising, being featured on postcards, signage, displays and bottle labels. It is an integral part of Bitburger branding, and is still a symbol of our high quality beer to this day. 1913 Pilsner Pioneers in Germany The courts for the German empire in Leipzig allow Bitburger Brewery to use the name ‘Simonbräu-Deutsch-Pilsener’ (Simonbräu German Pilsner). This put an end to two years of legal battles with breweries in Pilsen (then part of the Austro-Hungarian Empire) over the use of the designation of origin, Bitburger could finally sell their beer using the terms ‘Pilsner’ and ‘Pils’. 1910 Railways Come to Bitburg After Bitburg was connected to the rail network, the brewery bought insulated rail carriages for transporting beer to ensure beer kept its quality even over long distances. 1909 First Big Advertising Campaign On 8th February Bitburger produces its ‘Simonbräu German Pilsner’ for the first time. With this new product, the brewery launches its first large-scale advertising campaign. In addition to adverts in national newspapers, beer mats are a big medium for advertising the brand and product. 1909 Brewing Water from Deep Underground The first deep-water well is put into service, extracting water from 100 meters below the ground. 1893 Bitburg at the World's Columbian Exposition A world fair takes place in Chicago in 1893 – a technical and artistic exhibition with international appeal. This is the first time that beer from Bitburg is represented at a world fair. 1886 First Beer Export The first beer export going by horse-drawn cart to Echternach in Luxembourg. 1883 First Pilsner-style Beer The Bitburger brewery brews its first pilsner-style beer. The bottom-fermentation brewing process was developed in Pilsen (in the Czech Republic). It features cold conditioning and ageing at low temperatures over a longer period. 1817 Brewery Founded Johann Peter Wallenborn opens a small rural brewery in the town of Bitburg in 1817. * In distribution partnership for Benediktiner Weissbräu GmbH and CREW Republic Brewery GmbH"
}