{
  "url": "https://help.id.me/hc/en-us/articles/4416182310039-Log-in-to-your-Social-Security-Administration-SSA-account-using-ID-me",
  "title": "Log in to your Social Security Administration (SSA) account using ID.me – ID.me Help Center",
  "text": "Use ID.me to sign in or verify your identity with the SSA to securely view your benefits and manage your information. This article explains how to log in with ID.me, troubleshoot issues, and get help when you need it.. SSA recently changed its login options: If you came here after trying to access your SSA account, you’re in the right place. Your ID.me Wallet can offer seamless, secure access to the SSA. Follow the steps below to sign in or add a verified identity card. Sign in to SSA applications If you have an ID.me Wallet, sign in to your ID.me Walle to access SSA online services: - Go to the login page for the SSA application you need to access: - Select Sign in with ID.me. - Enter your email address and password, then complete multi-factor authentication (MFA). - Follow the prompts to access the SSA or verify your identity. I can’t sign in to my ID.me Wallet - Changed your phone number? Visit I changed my phone number. - Have trouble with MFA? Visit Resetting your multi-factor authentication (MFA) method. - Unsure of your sign-in issue? Visit I can’t sign in to my ID.me Wallet. I need to access the SSA for work or business To use your ID.me Wallet with the SSA for work purposes, visit Add a work or business email to your ID.me Wallet. Verify your identity for SSA with ID.me If you’ve never had an ID.me wallet, create a wallet. To verify your identity, choose a verification method: - Self–Service: Upload your identity documents and a video selfie. This self-directed process usually takes 5-10 minutes and guides you through each step on your screen. For step-by-step instructions, visit Verifying your identity with Self-Service. - Video Call: Upload your identity documents, enter your personal information, then join an ID.me Video Chat Agent on a video call. The agent will compare you to the document you uploaded. For step-by-step instructions, visit Verifying with a short video call. Note: If you live outside the United States but have a Social Security number, you can still verify your identity. Visit Verifying if you live outside the United States and have an SSN. Who to contact for help with SSA ID.me Support ID.me can assist with: - Having multiple ID.me Wallets - Issues verifying your identity - Managing your wallet settings - Closing your ID.me Wallet - Other questions related to ID.me To contact ID.me Support, visit Contact Support and sign in to your wallet. SSA Support The SSA handles all questions related to Social security: To contact the SSA directly, visit the SSA Contact page."
}