{
  "url": "https://www.thefreedictionary.com/mother",
  "title": "Mother - definition of mother by The Free Dictionary",
  "text": "mother Also found in: Thesaurus, Medical, Legal, Financial, Idioms, Encyclopedia, Wikipedia. moth·er 1 (mŭth′ər)n. 1. a. A woman who gives birth to a child. b. A woman whose egg unites with a sperm, producing an embryo. c. A woman who adopts a child. d. A woman who raises a child. 2. A female parent of an animal. 3. A female ancestor. 4. A woman who holds a position of authority or responsibility similar to that of a mother: a den mother. 5. Roman Catholic Church a. A mother superior. b. Used as a form of address for such a woman. 6. A woman who creates, originates, or founds something: \"the discovery of radium, which made Marie Curie mother to the Atomic Age\" (Alden Whitman). 7. A creative source; an origin: Philosophy is the mother of the sciences. 8. Used as a title for a woman respected for her wisdom and age. 9. Maternal love and tenderness: brought out the mother in her. 10. The biggest or most significant example of its kind: the mother of all battles. 11. Vulgar Slang Something considered extraordinary, as in disagreeableness, size, or intensity. adj. 1. Relating to or being a mother. 2. Characteristic of a mother: mother love. 3. Being the source or origin: the mother church. 4. Derived from or as if from one's mother; native: one's mother language. v. moth·ered, moth·er·ing, moth·ers v.tr. 1. a. To give birth to: mothered three children. b. To be the source of; create or produce: \"Necessity mothered the invention of printing\" (Irving Wallace). 2. To act as mother to, as in nourishing and protecting. v.intr. To act or serve as a mother. [Middle English moder, mother, from Old English mōdor; see māter- in Indo-European roots. N., sense 10, translation of Iraqi Arabic 'umm. N., sense 11, short for motherfucker.] moth·er 2 (mŭth′ər)n. A stringy slime composed of yeast cells and bacteria that forms on the surface of fermenting liquids and is added to wine or cider to start the production of vinegar. [Probably alteration (influenced by mother) of obsolete Dutch moeder, from Middle Dutch, probably from moeder, mother of children; see māter- in Indo-European roots.] American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. mother (ˈmʌðə)n 1. (Biology) a. a female who has given birth to offspring b. (as modifier): a mother bird. 2. (often capital, esp as a term of address) a person's own mother 3. a female substituting in the function of a mother 4. (often capital) chiefly archaic a term of address for an old woman 5. a. motherly qualities, such as maternal affection: it appealed to the mother in her. b. (as modifier): mother love. c. (in combination): mothercraft. 6. a. a female or thing that creates, nurtures, protects, etc, something b. (as modifier): mother church; mother earth. 7. (Ecclesiastical Terms) a title given to certain members of female religious orders: mother superior. 8. (Ecclesiastical Terms) Christian Science God as the eternal Principle 9. (modifier) native or innate: mother wit. 10. taboo slang chiefly US short for motherfucker 11. be mother to pour the tea: I'll be mother. 12. the mother of all … informal the greatest example of its kind: the mother of all parties. vb (tr) 13. (Biology) to give birth to or produce 14. to nurture, protect, etc as a mother [Old English mōdor; compare Old Saxon mōdar, Old High German muotar, Latin māter, Greek mētēr] ˈmothering n mother (ˈmʌðə)n (Brewing) a stringy slime containing various bacteria that forms on the surface of liquids undergoing acetous fermentation. It can be added to wine, cider, etc to promote vinegar formation. Also called: mother of vinegar [C16: perhaps from mother1, but compare Spanish madre scum, Dutch modder dregs, Middle Low German modder decaying object, mudde sludge] ˈmothery adj Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 moth•er1 (ˈmʌð ər)n. 1. a female who has borne offspring; female parent. 2. (often cap.) one's own mother. 3. a mother-in-law, stepmother, adoptive mother, or foster mother. 4. a woman looked upon as a mother, or exercising authority like that of a mother. 5. a term of familiar address for an elderly woman. 6. the qualities characteristic of a mother, as maternal affection. 7. something that gives rise to or exercises protective care over something else. adj. 9. being a mother: a mother bird. 10. pertaining to or characteristic of a mother: mother love. 11. derived from or as if from one's mother; native: his mother culture. 12. bearing a relation like that of a mother, as in being the origin, source, or protector: a mother church. v.t. 13. to be the mother of. 14. to give origin or rise to. 15. to care for or protect like a mother. [before 900; Middle English mother, moder, Old English mōdor; c. Old Frisian, Old Saxon mōdar, Old High German muotar, Latin māter, Greek mḗtēr, Skt mātar-] moth′er•less, adj. moth•er2 (ˈmʌð ər)n. a stringy, viscid film of yeast cells and various bacteria that forms on a fermenting liquid and is used to ferment other liquids, as in changing cider to vinegar. [1530–40; perhaps identical with mother1, but compare Dutch modder dregs, Middle Low German moder swampy land] moth•er3 (ˈmʌð ər)n. Slang: Sometimes Vulgar. 2. a person or thing that is very large, powerful, or impressive. [1930–35] Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. Mother a system of social order wherein final authority is vested in the mother or eldest female and in which descent is reckoned in the female line. — matriarchal, adj. tending to move toward or centering upon the mother. 1. the killing of one’s mother. 2. one who has killed his mother. — matricidal, adj. 2. one who has killed his mother. — matricidal, adj. tracing of descent through the mother’s side of a family. — matrilinear, adj. an excessive attachment and devotion of children to their mothers, resulting in a child’s dependence and failure to achieve emotional emancipation. -Ologies & -Isms. Copyright 2008 The Gale Group, Inc. All rights reserved. mother Past participle: mothered Gerund: mothering Collins English Verb Tables © HarperCollins Publishers 2011 ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. mother noun 1. female parent, mum (Brit. informal), ma (informal), mater, dam, old woman (informal), mom (U.S. informal), mummy (Brit. informal), old lady (informal), foster mother, birth mother, biological mother Mother and child form a close attachment. 2. wellspring, source, origin, inspiration, stimulus, fountain, genesis, fount Necessity is the mother of invention. verb 1. give birth to, produce, bear, bring forth, drop She had dreamed of mothering a large family. 2. nurture, raise, protect, tend, nurse, rear, care for, cherish She felt a great need to mother him. 3. pamper, baby, spoil, indulge, fuss over, cosset, mollycoddle, overprotect Don't mother me! Related words adjective maternal adjective maternal Quotations \"So for the mother's sake the child was dear\" \"And dearer was the mother for the child\" [Samuel Taylor Coleridge `Sonnet to a Friend Who Asked How I Felt When the Nurse First Presented My Infant Child to Me'] \"Honour thy mother and thy father\" Bible:Exodus \"As is the mother, so is her daughter\" Bible: Ezekiel \"All women become like their mothers. That is their tragedy. No man does. That is his\" [Oscar Wilde The Importance of Being Earnest] \"So for the mother's sake the child was dear\" \"And dearer was the mother for the child\" [Samuel Taylor Coleridge `Sonnet to a Friend Who Asked How I Felt When the Nurse First Presented My Infant Child to Me'] \"Honour thy mother and thy father\" Bible:Exodus \"As is the mother, so is her daughter\" Bible: Ezekiel \"All women become like their mothers. That is their tragedy. No man does. That is his\" [Oscar Wilde The Importance of Being Earnest] Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 mother noun1. A person from whom one is descended: Archaic: predecessor. 2. A point of origination: beginning, derivation, fount, fountain, fountainhead, origin, parent, provenance, provenience, root, rootstock, source, spring, well. The American Heritage® Roget's Thesaurus. Copyright © 2013, 2014 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. Translations mamoeder أمأُماُمٌّتَعْتَني عِنايَة الأمرَئيسة دَيْر، الأم الرِّئيسَه майка mare matkamatka představenámateřskýmateřsky pečovat mor=-morabbedissemoder patrino ema مادر äiti אֵם majkamati anyaanyáskodikfejedelemasszony bundaibu abbadís, forstöîukonaannast sem móîirmammamóðirmóîir 母お母さんママ 어머니엄마 matermaximus motinamotiniškai prižiūrėtimotiniškumasnašlaitisperlamutras māterūpēties kā mātei അമ്മ mamă matkamatka predstavenámatersky sa starať mati majkamatmatermatirođenica mormoder mamamzazi แม่มารดา мати mẹnuôinuôi nấngchăm sóc mother [ˈmʌðəʳ]B. VT (= care for) → cuidar como una madre; (= spoil) → mimar, consentir; (= give birth to) → parir, dar a luz C. CPD mother country N → patria f; (more sentimentally) → madre patria f Mother Earth N → la madre tierra mother figure N → figura f materna, figura f de la madre Mother Goose N → la Oca mother hen N → gallina f madre mother love N → amor m maternal Mother Nature N → la madre f Naturaleza Mother's Day N → Día m de la Madre mother's help N → niñera f mother ship N → buque m nodriza Mother Superior N → madre f superiora mother tongue N → lengua f materna Mother Earth N → la madre tierra mother figure N → figura f materna, figura f de la madre Mother Goose N → la Oca mother hen N → gallina f madre mother love N → amor m maternal Mother Nature N → la madre f Naturaleza Mother's Day N → Día m de la Madre mother's help N → niñera f mother ship N → buque m nodriza Mother Superior N → madre f superiora mother tongue N → lengua f materna Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 mother [ˈmʌðər] n vt (= look after) → s'occuper de to be mothered (= looked after by a mother) → être pris(e) en charge par sa mère to be mothered (= looked after by a mother) → être pris(e) en charge par sa mère Collins English/French Electronic Resource. © HarperCollins Publishers 2005 mother n → Mutter f; (= animal) → Muttertier nt, → Mutter f; (= address to elderly lady) → Mütterchen; Mother of God → Muttergottes f, → Mutter f → Gottes; a mother’s love → Mutterliebe f; she’s a mother of three → sie hat drei Kinder; she’s her mother’s daughter → sie ist wie ihre Mutter; I had the mother and father of a headache (inf) → ich hatte vielleicht Kopfschmerzen!; the mother of all battles/confrontations/traffic jams → die Mutter aller Kriege/Auseinandersetzungen/Staus; shall I be mother? (inf) (= pour tea) → soll ich eingießen?; (= serve food) → soll ich austeilen? vt (= care for) young → auf- or großziehen; (= give birth to) → zur Welt bringen; (= cosset) → bemuttern mother :motherboard n (Comput) → Mutterplatine f, → Hauptplatine f mother country mothercraft n → Kinderpflege f mother figure n → Mutterfigur f motherfucker n (US vulg) → Arschloch nt (vulg), → Arschficker m (vulg) motherfucking adj (US vulg) → Scheiß- (sl) motherhood n → Mutterschaft f mother :mother-in-law n pl <mothers-in-law> → Schwiegermutter f motherland motherless mother lode n (Min) → Hauptader f mother love n → Mutterliebe f mother :mother ship n → Mutterschiff nt mother tie n (Psych) → Mutterbindung f mother tongue n → Muttersprache f mother wit n → Mutterwitz m Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 mother [ˈmʌðəʳ]1. n → madre f 2. vt (care for) → fare da madre a; (spoil) → essere troppo chioccia con Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995 mother (ˈmaðə) noun1. a female parent, especially human. John's mother lives in Manchester; (also adjective) The mother bird feeds her young. 2. (often with capital. also Mother Superior) the female leader of a group of nuns. verb to care for as a mother does; to protect (sometimes too much). His wife tries to mother him. ˈmotherhood noun the state of being a mother. ˈmotherless adjective having no mother. The children were left motherless by the accident. ˈmotherly adjective like a mother; of, or suitable to, a mother. a motherly woman; motherly love. ˈmotherliness nounˈmother-country, ˈmotherland (-land) nouns the country where one was born. ˈmother-in-law – plural ˈmothers-in-law – noun the mother of one's husband or wife. ˌmother-of-ˈpearl noun, adjective (of) the shining, hard, smooth substance on the inside of certain shells. ˈmother-tongue noun a person's native language. My mother-tongue is Hindi. Kernerman English Multilingual Dictionary © 2006-2013 K Dictionaries Ltd. mother → اُمٌّ matka mor Mutter μητέρα madre äiti mère majka madre 母 어머니 moeder mor matka mãe мать mor แม่ anne mẹ 母亲Multilingual Translator © HarperCollins Publishers 2009 moth·er n. madre, mamá. English-Spanish Medical Dictionary © Farlex 2012 mother n madre f; surrogate — madre sustituta or portadoraEnglish-Spanish/Spanish-English Medical Dictionary Copyright © 2006 by The McGraw-Hill Companies, Inc. All rights reserved."
}