{
  "url": "https://www.elitetallahassee.com/providers",
  "title": "Providers",
  "text": "Welcome to Elite Women’s Health! I’m Dr. Stephanie Lee, a gynecologist and women’s health expert. I received my medical degree from the Florida State University College of Medicine in 2006. I completed my residency in Obstetrics and Gynecology at the University of Florida College of Medicine, Jacksonville in 2010. During medical school and residency, I received awards for accomplishments in academics, teaching, and research. I am board certified in Obstetrics and Gynecology and I am an assistant clinical professor at the Florida State University College of Medicine. I have been caring for women in the Tallahassee area since 2012. I have a passion for providing quality healthcare. I am able to provide this service in English and Spanish as I am fluent in both languages. I keep up to date on the current medical trends and surgical techniques. When I am not working, I enjoy spending time with my husband and four children. I also love traveling, exercising, cooking, and going to the beach. Dr. Ashley M Easterwood completed her residency in Obstetrics and Gynecology at University of South Alabama in Mobile, Alabama in 2022 and became board certified in 2023. She was drawn to OB/GYN because of the vast opportunities to support a woman’s life. She enjoys helping guide a woman through the many changes in a woman’s body and discussing options and treatment for infertility, birth control, menopause, abnormal uterine bleeding, prolapse, and pelvic pain. She is a skilled minimally invasive surgeon in laparoscopy and robotic surgery. She is also trained to perform vaginally and abdominal surgeries, including vaginal prolapse. She enjoys teaching along the way. Not only teaching patients about their body but also students. In residency she was awarded many recognitions including, Excellence in Minimally Invasive Gynecology and in Female Pelvic Medicine and Reconstructive Surgery and two-time Outstanding Performance and Valuable Contribution to the Education of Medical Students. During private practice she was awarded Clinical Preceptor of the Year in 2024. Her education prior to residency includes a Doctor of Medicine and a Master of Science Degree in Molecular Pathology from Texas Tech University Health Science Center. Her undergraduate Bachelor of Science degree is in Biology with a minor emphasis on Chemistry and Spanish from Texas Tech University in Lubbock, Texas. Part of her family comes from Argentina, and she enjoys speaking Spanish when she can. She grew up in Texas and will always love Texas but was drawn to stay close to the beautiful beaches and weather of the Gulf coast. She recently moved to Tallahassee and is very excited to join Dr. Lee’s practice at Elite Women’s Health. She hopes to build a wonderful career and future caring for the women of Tallahassee. She looks forward to raising her young daughter and son in Tallahassee and enjoying all the Florida panhandle has to offer. The care and support I received from my nurse practitioner as a young woman and through the course of my first pregnancy and birth was the spark that interested me in women's health and the motivating factor that set me down the path to becoming a certified nurse midwife and women's health nurse practitioner. In my practice, I have found that educating women and becoming familiar with each patient in order to know when something is deviating from the norm is a key art to the service of women's health. I truly believe that helping women become their own best advocates as they make health care decisions allows them to realize their own inner strength, culminating in experiences that are not overshadowed by fear or anxiety. I graduated from Florida State University in 2002 with my Bachelors of Science in Nursing. Spending the first seven years of my nursing career at TMH, I gained invaluable experience that was fundamental in taking the next step in my own career path - attending midwifery school at the University of Cincinnati. I was awarded a Master's of Science in Nurse-Midwifery with a post-masters certificate in Women's Health in 2009. I lived in Tallahassee, FL for most of my life and worked as a nurse-midwife at TMH for 3 years before moving to San Antonio, TX. There I practiced for 8 years as a nurse-midwife before moving back home to Tallahassee to join Dr. Stephanie Lee's growing practice with an amazing team. I graduated from the University of Louisville with a Bachelor of Science in Nursing in May 2000. I was awarded a Master of Science degree with my focus as a Women’s Health Nurse Practitioner from the University of Cincinnati in 2011. I am originally from Kentucky but have lived in Tallahassee since 2012. Since 2014, I have worked at FSU’s University Health Services providing women’s health services to collegiate students. I have always had a passion for women’s health, and even before becoming a nurse practitioner, I gained valuable experience as a nurse working in labor and delivery and OB/GYN office settings for over 10 years. I take pride in providing my patients with a compassionate and quality healthcare experience. I enjoy spending time with my husband and three children in my free time. I also enjoy exercising, going to the beach, cheering on the Noles, and playing with our 3 Goldendoodles. I am excited to join Dr. Stephanie Lee’s extraordinary healthcare team. Carrying excess weight significantly raises the risk of some cancers which is why I became certified in weight loss. My mission now is to prevent cancer before it happens by simplifying wellness for those who are overwhelmed by it. I help women attain their goals by creating individualized programs geared toward long-term weight loss and improved quality of life. Everyone deserves to lead healthier, more fulfilled lives. When I hear my patients are finding more joy, whether it's keeping up with the kids or waking up each day with more energy, I know I have made a difference. In my personal time, I love taking healthy ingredients from my garden and creating flavorful, nutritious meals for my family. Travel, my three dogs, and family time are also dear to me. They are reminders of life's true value and the importance of a well-rounded well-being. I found myself drawn to women’s health for a couple of reasons. One was my time in nuclear medicine, where I only had brief interactions with patients. I realized I was much more fulfilled by long-term care, building real connections and getting to know people’s stories. The other is my own experience as a patient—dealing with symptoms that didn’t show up clearly on paper and feeling dismissed. When I was a student in this practice, something clicked. I saw myself in so many of the patients walking through the door, just hoping someone would understand me and help. That connection is what drives me every day. When I’m not in the office, you’ll find me out on a run to clear my head, curled up with a good book, or trying (emphasis on trying!) a new sewing project. My husband and I are proud FSU alumni and love cheering on the Seminoles at every chance we get."
}