{
  "url": "https://support.google.com/admanager/answer/6022732?hl=en",
  "title": "Sign in to Google Ad Manager - Google Ad Manager Help",
  "text": "To sign in, visit admanager.google.com. Enter your Google Account username and password. If you're unsure of the correct email address or password, try Google's account recovery process. If you don't yet have an Ad Manager account, you can: Troubleshoot sign-in and access issues If you're having trouble signing in to Ad Manager, or if you've received an invitation but can't access the account, try the following solutions: Confirm you're using the correct Google Account If you have multiple Google Accounts, such as a personal Gmail account or another business account, it's possible you're signed in to the wrong account. Try signing out and signing in with the email address you use for Google Ad Manager. If your Google account is associated with more than one Google Ad Manager account, you'll be prompted to select the account you'd like to access when you sign in. Check your user permissions If you encounter an \"Unauthorized access\" message while using Google Ad Manager, it's likely that a missing user role permission or incorrect teams association has restricted your access. Contact your network administrator to ensure you're a member of the correct user role with all necessary permissions, or that your user profile is associated with the correct Team. Clear your browser's cache and cookies To eliminate outdated authentication data that might be causing login problems, clear your browser cache and cookies. Alternatively, try accessing Ad Manager in an incognito or private browsing window. You may need to clear your cache more than once if the issue persists. Have an administrator check your status in Ad Manager Your network administrator can confirm that you're listed as an \"Active\" user in the Google Ad Manager network as follows: - Sign in to Google Ad Manager. - Click Admin, and then Access & authorization. - Under \"Users,\" your admin can search for you by name or email, and then review your status: - Active: Indicates you're an active user in the network. - Inactive: Indicates your user account has been deactivated on the network. Inactive users can't access the network until an administrator sets their status to \"Active.\" - Pending invitation: Indicates an invitation to join the network has been sent. Check your inbox and spam folders for the invitation email, then click the link within that email to activate your user profile. If the invitation link results in an error, ask your administrator to verify the invitation is still valid and was sent to the correct email address. Your network administrator, or any user with the \"Edit users, roles, and teams\" permission, can resend the invitation. If needed, they can add a new user. Confirm Ad Manager is enabled in the Google Admin console If your organization uses Google Workspace, they may activate Ad Manager users through the Google Admin console. An administrator for your network's Google Admin console can activate Ad Manager as follows: - Sign in with an administrator account to the Google Admin console. If you aren’t using an administrator account, you can’t access the Admin console. - From the Admin console Home page, go to Apps, then Additional Google services. Services that are turned on are listed first, but you can use Filters to list Featured services or Organization services. - Switch Google Ad Manager to On."
}