{
  "url": "https://forum.lowyat.net/topic/5519898/all",
  "title": "Whatsapps hacked",
  "text": "How scammers gain access and hack your WhatsApp account 1. Social Engineering - WhatsApp number hack 2. WhatsApp Forward Call 3. WhatsApp Web hacking 4. WhatsApp Spyware 5. WhatsApp Dark Web attacks Real story: ‘I was a victim of the WhatsApp hack’ Faustin received a mysterious call over WhatsApp from a number he did not recognize. He searched for the number online and found the dialing code was from Sweden. When the unknown number called again, Faustin answered, and they hung up. Whenever he called back, no one answered. He realized something was wrong when he discovered that some of his phone files were missing. How to know if your WhatsApp has been hacked Several signs indicate someone has hacked your WhatsApp. Be cautious if you notice: 1. Unfamiliar devices logged in to your account. Here's how to see all the devices remotely accessing your account: open WhatsApp on your phone, click on the three dots on the top right, and select Linked Devices. You can then log out of any suspicious devices by tapping on them. 2. Strange and suspicious activity. Be wary of strange and suspicious activity, such as receiving unsolicited verification codes, strange messages from unknown contacts, or being told by one of your contacts that they received messages you didn't send. Other signs of suspicious activity include strange noises when making calls, calls from unknown numbers, and so on. 3. Poor phone performance. If you notice your phone is slower, crashes, freezes or your battery drains much faster than usual, this could mean that hidden applications are running in the background. You can check which apps are running through Background App Refresh by going to Settings, selecting General, and clicking on Background App Refresh. From there, you can switch off any suspicious apps. How to make your WhatsApp more secure: 1. Enable 2FA. Two-factor authentication (2FA) is a must for WhatsApp. To enable it, open the WhatsApp app on your iPhone or Android device. Navigate to Settings > Account > Two-Step Verification, and tap Enable. 2. Watch out for scams and phishing attempts. Be cautious about voice calls, messages, links, or files received on WhatsApp, especially if they come from unknown sources. Only interact with them after making sure they are ok. 3. Add Bitdefender Scamio to your WhatsApp list. This tool can help you detect potential scams by analyzing requests, situations, links, texts, or images you receive in your chat. Scamio uses advanced AI technology to determine whether the content is safe. To add Scamio as a contact in your WhatsApp list, scan the QR code below: https://www.bitdefender.com/en-us/blog/hotf...rotect-yourself"
}