{
  "url": "https://www.covers.com/boxing/naoya-inoue-vs-david-picasso-predictions-picks-odds-december-27-2025",
  "title": "Naoya Inoue vs David Picasso Predictions, Picks & Odds for December 27",
  "text": "Naoya Inoue remains the last undisputed champion in boxing, and he has a huge fight waiting for him unless David Picasso can score an upset for the ages in our final featured boxing attraction for 2025. Inoue is a -4000 favorite while Picasso is a +1,400 underdog. Here are my free Naoya Inoue vs. Alan Picasso predictions and betting picks for this December 27 bout in Riyadh. Inoue vs Picasso prediction and pick - My fight prediction: Inoue moneyline (-4000 at DraftKings) - My best bet: Over 6.5 rounds (-115 at DraftKings) Fight analysis One of the more concerning developments ahead of this fight is Naoya Inoue’s long-awaited clash with Junto Nakatani has been confirmed for May 2026. Still, Inoue doesn’t have an easy assignment against defensive specialist Picasso. Coupled with the fact Inoue has been tested over his most recent fights, as well as Picasso’s frustrating style, means he could be in for another test ahead of what could be the biggest fight of his career. This isn’t a slight to Inoue at all, but fighters who compete below lightweight tend to age faster, and it correlates with some of the struggles we’ve seen from Inoue, now 32, in the heaviest weight class of his career. Inoue’s strength isn’t in his punching power or finishing skills, but rather his advanced ring IQ and punch selection, making him a complete package that has dominated the pound-for-pound scene for some time. He needs more time to wear his opponents down and has taken his fair share of punishment in recent fights, but he’s still “The Monster” unless proven otherwise. Picasso isn’t widely known to global fight fans, but he's a sharp counter-puncher with strong defensive awareness. In his last fight, Picasso won a majority decision over Kyonosuke Kameda that should have been unanimous, dominating him with a sharp jab and constant movement. He’s a disruptive fighter, but he can get drawn into a real fight and absorb punishment, which won’t do him any favors when it comes to Inoue’s precision shots. If Picasso can keep his distance and use the advantages he possesses in height, reach, and physical size, he can extend the fight into the later rounds. However, he is woefully unequipped to handle Inoue’s range of offensive options, and doesn’t have the kind of firepower Luis Nery and Ramon Cardenas did to prevent Inoue from walking him down. Expect Inoue to preserve the Nakatani clash coming out of this slightly more tactical fight with a win. Best best analysis Since moving up to super bantamweight, all but one of Inoue’s fights have gone less than six rounds, and he’s coming off the decision win over Murodjon Akhmadaliev that snapped his long knockout streak. Picasso should be good enough and defensively able to frustrate Inoue early, though he won’t pose a risk of an upset. My best bet is the fight goes Over 6.5 rounds. Enjoying Covers content? Add us as a preferred source on your Google accountNaoya Inoue vs David Picasso odds Odds courtesy of DraftKings as of December 26. Naoya Inoue vs David Picasso tale of the tape Odds are correct at the time of publishing and are subject to change. Not intended for use in MA. Affiliate Disclosure: Our team of experts has thoroughly researched and handpicked each product that appears on our website. We may receive compensation if you sign up through our links."
}