{
  "url": "https://sra.maryland.gov/retiree-forms",
  "title": "Retiree Forms - Maryland State Retirement and Pension System",
  "text": "Retiree Forms Forms Our secure website, mySRPS offers the most efficient method of accessing and completing forms. No need for paper, nothing to fill out, and no postage. Use the mySRPS wizards to update your tax withholdings and direct deposit instructions. Your contact information can also be updated directly in mySRPS. It’s easy to do and keeps your information secure. Click here for more information about mySRPS. Printable Forms We offer some Downloads as Adobe Acrobat (PDF) or Microsoft Word (doc) files. If you need a PDF reader, you can download Adobe Reader. If you don’t have Word, you can download Microsoft’s Word Viewer. You can also order forms by clicking here. Please note, it make take up to 3 business days for forms to be mailed. Forms are not effective until they are received in our administrative offices in Baltimore. If you choose not to use our secure portal to change your contact information or Direct Deposit information, Form 77: Contact Information Change Request and Form 85: Direct Deposit Authorization can only be submitted via mail. We do not accept these requests sent in via email. Form 77: Contact Information Change Request Please note, you can update your address easily through mySRPS Form 85: Direct Deposit Authorization Please note, you can update your direct deposit easily through mySRPS You must enclose a voided check, deposit slip, page 1 of your bank statement or a letter signed by a bank representative as proof of your account. All documents must include your full name and full account number. We cannot accept handwritten information as proof of your account (ex: starter checks) IRS Form W-4P for Federal Tax Withholding Please note, you can update your federal tax withholding easily through mySRPS Form 766.11: Maryland State Tax Withholding Request Please note, you can update your state tax withholding easily through mySRPS"
}