{
  "url": "https://support.google.com/youtube/answer/12356784?hl=en-GB",
  "title": "YouTube Premiere tips - YouTube Help",
  "text": "Building community is about shared experiences. Premieres allow your community to experience your videos together with you in real time through live chat. Premiering your video allows you to schedule a video upload and create buzz around the video with a shareable watch page. Use Premieres to build anticipation Leroy Sanchez promoted his premiere of 'Preacher' on all his social accounts in the days leading up to release. He then went live across all platforms just before the premiere to encourage his viewers to jump over to YouTube and tune in. Be present at the premiere - A great way to interact with your community is to turn on live chat on your premiere. Turning on chat replay helps late-comers feel just as hyped about your premiere. - Moderate the chat and be a part of the watching experience by adding talking points. Share fun facts, behind-the-scenes moments and encourage fans to guess what happens next in the video. This interaction helps build excitement and encourages your fans to stay until the end. - Encourage fans to ask questions; it's a great way to keep the momentum of the conversation going. - Pay special attention to viewers who sent Super Chat, Super Stickers or became a member of your channel. Make sure that you give a shoutout and thank them in the chat! - Creators can use the watch page to live chat with viewers. The creator can chat for a short time following the end of a premiere video. This post-show time is an excellent opportunity to answer questions, get feedback on the premiere and direct viewers to a post-show video or live stream. Managing your chat will help you and your community get more out of the experience: - Chat moderation – Add users to help moderate your live streams - Keyword blocklisting – Block chats using keywords that you select - Slow mode – Limit how often viewers can post - Chat bot support – Use third-party interactivity tools (for example, Nightbot) ItsFunneh uses her most dedicated channel members as live chat moderators during her premieres. These Super fans keep the conversation flowing and help maximise engagement for individual commenters. We recommend - Make it special: premiere viewers will typically be your most interested and loyal fans. Think about starting traditions for each premiere! - Add value: premieres' live chat is a great way for creators to give to their audience with real time commentary. The creator can also give trivia and insights on their content in a non-intrusive manner. - Unlock a new revenue stream: by bringing Super Chat and Super Stickers into pre-recorded content, premieres give a new revenue source for non-live focused channels. Check your eligibility for Super Chat and Super Stickers. Next: Take a look at channel banner and profile picture tips."
}