{
  "url": "https://www.inspiredtaste.net/46128/no-yeast-flatbread/",
  "title": "Easy Flatbread Recipe (No Yeast)",
  "text": "This quick and easy flatbread recipe comes together without any yeast and almost no kneading. Get ready for perfectly soft and fluffy flatbreads, great for wraps, and ready in just 30 minutes! We’re obsessed with this easy flatbread recipe! It’s genuinely one of my favorite recipes on the blog, and my family makes it all the time. The dough comes together in minutes with almost no kneading, resulting in soft, pillowy flatbreads similar to naan or pita bread. This makes them incredibly versatile! Use them for wraps, serve them on the side with curries, or dip them into your favorite homemade dips, such as Hummus, Baba Ganoush, and Tzatziki. You can even use them as a quick pizza crust for Flatbread Pizza! Key Ingredients - Flour: I use all-purpose flour, but I have successfully made this flatbread recipe with a 50/50 blend of all-purpose and whole wheat flour. You can also use a gluten-free flour blend. - Baking Powder: The reason this recipe is so QUICK! We use baking powder instead of yeast. The baking powder cuts the time it takes to make flatbread by at least half! To use yeast, see our Garlic Flatbread Recipe and Homemade Pita Bread. - Olive Oil, Maple Syrup, and Salt: This trio adds incredible flavor to our flatbread. I love maple syrup because it adds more flavor, but you can substitute it with sugar. We only use a little bit. - Water: The water in our dough makes it really easy to work with and roll nicely. Find the full recipe with measurements below. My Tips for Making Flatbread Without Yeast With this easy flatbread recipe, you’ll have soft, fluffy flatbread ready in just about 30 minutes. So many of our readers have fallen in love with this recipe. Here are my tips for making it: Tip 1: Let the dough rest for 10 minutes. You’ll mix the flatbread ingredients with cold water until a soft dough forms, then cover the dough and allow it to rest for 10 minutes. This brief rest allows the flour to fully absorb the moisture and gives the baking powder a head start, which is key for a light, soft texture. Tip 2: Get your dough consistency just right. If you’ve ever had dough that was too sticky or too dry, it’s very likely caused by mismeasuring the flour. When using cups, take care not to over-pack the flour (I like to spoon it in). Then use something flat to level the top. If your dough still feels dry, add a touch more water. If it’s too sticky, add a sprinkle of flour. The same tip applies when making Homemade Flour Tortillas. Tip 3: Use a rolling pin for the perfect puff. This recipe makes 6 flatbreads. For those beautiful bubbles you see in our photos, use a rolling pin to roll the dough into flat, thin disks. This simple step prevents them from turning into thick pancakes and helps them puff up beautifully in the hot skillet. Ways to Use Homemade Flatbread These turn out so soft and foldable, making them ideal for wraps like gyros. I often fill them with Grilled Chicken, Homemade Falafel, Pickles, and a flavorful sauce (I love this Tahini Sauce). And they are perfect for dipping into Red Pepper Hummus, Homemade Labneh, Feta Tzatziki, and this Smoked Salmon Dip. I’ve also used them for breakfast. Fill with Creamy Scrambled Eggs, Crispy Baked Bacon, and Sautéed Zucchini for a delicious breakfast wrap. And my son wouldn’t forgive me if I didn’t share his favorite way to use them. Pizza! We often make Flatbread Pizza with our Favorite Pizza Sauce and pizza toppings. Easy Flatbread (No Yeast) - PREP - COOK - TOTAL You will use baking powder instead of yeast to make this quick flatbread recipe. This flatbread turns out perfectly soft and fluffy! The dough takes only a few minutes to make and 10 minutes to rest before being quickly cooked in a hot skillet on the stovetop. For more traditional, yeasted dough, see this Pita Bread Recipe. Watch Us Make the Recipe You Will Need 2 cups all-purpose flour (260g) 1 ½ teaspoons baking powder 1 teaspoon fine sea salt 2 tablespoons olive oil 1 teaspoon pure maple syrup or sugar 3/4 cup cold water (175ml) Avocado oil for cooking Directions 1Mix the dry ingredients: In a large bowl, whisk the flour, baking powder, and salt together until well blended. 2Make the dough: Create a well in the center of the flour mixture, and then add olive oil, maple syrup, and most of the water (reserving a few tablespoons to add later as needed). Switch to a rubber spatula or wooden spoon and stir the wet ingredients into the flour mixture. If the dough seems dry, add the remaining water. 3Quickly knead and rest: When the dough comes together, transfer it to a floured work surface and knead 5 to 10 times until smooth. Cover with a clean dishcloth and let it sit for 10 minutes. 4Roll them out: Divide the dough into six equal pieces. Dust each piece in flour and roll into a disc that’s between ⅛-inch and ¼-inch thick. Rolling thinner will make thinner bread that’s less soft in the middle. Rolling thicker will make thicker, fluffier bread. 5Cook the flatbreads: Add 1 to 2 tablespoons of oil to a heavy skillet (like a cast iron skillet) over medium heat. When the oil looks shimmery, add a flatbread (or more if they fit) and cook until golden brown on one side. Flip and cook until golden brown on the second side, 1 to 2 minutes per side. 6Keep warm: Transfer the cooked flatbread to a plate, cover it with a clean dish towel to keep it warm, and then continue with the remaining flatbreads. If the skillet looks dry, add a little more oil before continuing. Adam and Joanne's Tips - Storing: Wrap the cooked flatbreads in foil and then store at room temperature for 2 to 3 days. You can also wrap them well and freeze for a month or two, and then reheat in a warm oven or in a skillet. - Bake in the oven: Cooking the flatbread in a skillet allows you to add some oil, which makes them a little softer. That said, you can bake these in the oven. We recommend a 400°F (204°C) oven. Bake them until puffed and starting to brown about 10 minutes. - The nutrition facts provided below are estimates."
}