{
  "url": "https://www.imdb.com/name/nm2898703/",
  "title": "Yes - IMDb",
  "text": "Yes - Actor - Music Department - Soundtrack Yes are an English progressive rock band formed in London in 1968 by singer Jon Anderson and bassist Chris Squire. The band has undergone numerous personnel changes throughout its history; twenty musicians have been full-time members. Yes have explored several musical styles over the years, and are most notably regarded as progressive rock pioneers. With the exception of a brief period, between January 1981 and summer 1983, when the band were disbanded, they have not split up. Chris Squire was the only founding member never to leave the group, until his death in June 2015. The beginnings of Yes can be traced back to Soho, London in April 1968. It was there that singer Jon Anderson was introduced to bassist Chris Squire by Jack Barrie at La Chasse Club on Wardour Street, a few doors down from the legendary Marquee Club. The pair wrote a song together soon after meeting: \"Sweetness\". On 18 May 1968, Jon Anderson joined Mabel Greer's Toyshop on stage during the encore of a London gig, performing \"Midnight Hour\" alongside Chris Squire, singer/guitarist Clive Bayley, guitarist Peter Banks and drummer Robert Hagger. The group had been formed by Clive Bayley and Robert Hagger in summer 1967, Chris Squire and Peter Banks having joined in the winter following the break up of The Syn. Following the 18 May gig, Peter Banks left the group to join Neat Change. Clive Bayley then switched from rhythm to lead guitarist and Jon Anderson became the group's lead singer. At the very start of June, Robert Hagger also left. Anderson, Bayley and Squire put an advertisement in the Melody Maker music magazine, which led to the recruitment of drummer Bill Bruford. He rehearsed with the group in the basement of the Lucky Horseshoe Café on Shaftesbury Avenue on 7 June and then played his first gig with them that evening. Eight weeks of rehearsals at the Lucky Horseshoe followed. During this time, they recruited Tony Kaye as organist, making Mabel Greer's Toyshop a quintet. They played a single gig in July 1968, in Kingston, Surrey on the 20th, followed by an after-party at Bayley's parents' house nearby. Very soon after the gig, Clive Bayley left Mabel Greer's Toyshop, the group he had formed. Peter Banks re-joined as guitarist in late July. After a few more rehearsals in the basement of the Lucky Horseshoe, the group emerged on 3 August with a new name, Yes (suggested by Banks), and played their first gig, that evening, in Essex. Well rehearsed and different, Yes began growing support around London. Before really getting off the ground, Buford left in September 1968, to go to Leeds University. He was replaced by drummer Tony O'Reilly (formerly of the Koobas), but proved unreliable due to his drinking habits. He ended up in hospital and was replaced by drummer Ian Wallace for a November gig. Wallace had previously played alongside Anderson in The Warriors. The group played a gig at Leeds University, with O'Reilly back on drums, which Buford attended with friends to show them the group he used to play in. With O'Reilly a beat behind the rest of the band, Bruford felt embarrassed and was persuaded to rejoin. He did so just in time for a big show supporting Cream at their farewell concert at London's Royal Albert Hall. The group made their television debut in December 1968 (Episode dated 31 December 1968 (1968)) and their radio debut on the BBC in January 1969. By the spring, they had secured a record deal with Atlantic Records and began recording their debut album, \"Yes\", which opened with the Mabel Greer's Toyshop track \"Beyond and Before\". This was followed by their second album, \"Time and a Word\" in 1970, which featured an orchestra. Prior to the album's release, guitarist Peter Banks was fired after a gig at Luton in April. In early May 1970, with new guitarist Steve Howe, the group moved to Devon to write their third album. In September, the group filmed the television special Rock of the 70s: Yes (1970) with Howe miming to Banks' parts. \"The Yes Album\" was recorded in London in late 1970 and released in January 1971. With new manager Brian Lane, Yes finally began finding success. \"The Yes Album\" made it into the UK charts and they made their USA debut tour in summer 1971. The group performed \"Yours Is No Disgrace\" on Episode #8.13 (1971) and Episode #1.66 (1971). After an outdoor London show in late July 1971, Tony Kaye left the group. With new keyboard-player Rick Wakeman, the group began rehearsing their fourth album, \"Fragile\", in August 1971. Released in autumn, it became their first big hit record in the UK and \"Roundabout\" became their first big hit single in the USA. An October show was filmed for the television program Yes (1972). 1972 saw the group produce their fifth album: \"Close to the Edge\", which was followed by Bruford's second departure from the band, leaving this time to join King Crimson. His replacement, drummer Alan White, joined just a few days before a big American tour. Shows from the autumn 1972 \"Close to the Edge\" tour were recorded and released on the successful \"Yessongs\" album the following year. A December London show was recorded for the concert film Yessongs (1975). 1973 also saw the group release their sixth studio album: \"Tales from Topographic Oceans\". Following the album's tour, Wakeman quit in spring 1974. He was replaced by Swiss Patrick Moraz for the \"Relayer\" album, recorded in 1974 and followed by extensive touring into 1975. The group then took a short break, with each of its members producing solo albums between summer 1975 and spring 1976. They then embarked on a hugely successfully North American tour supported by Peter Frampton. In autumn, the group headed to Montreux, Switzerland to work on their eighth studio album. After a short time, Moraz parted ways and Rick Wakeman was brought back. \"Going for the One\" was completed in 1977 and featured the hit single \"Wonderous Stories\". The group made their first music video for \"Wonderous Stories\", which was aired on Episode #14.40 (1977). In 1978, the group made their ninth studio album, \"Tomato\", followed by extensive touring into 1979. After aborted sessions in Paris at the end of the year, Wakeman left the group for a second time and Anderson also left. Rehearsing as a trio, Squire, Howe and White recruited singer Trevor Horn and keyboard-player Geoff Downes, who had just had a big hit as The Buggles with \"Video Killed the Radio Star\". The tenth studio album, \"Drama\" was recorded in spring 1980 and followed by American and European tours. The immense strain on Horn, in filling Anderson's shoes on stage, led to him leaving the band after touring was completed. A private meeting in January 1981 led to the decision to disband. Horn and Downes made the second Buggles album, while Howe began working with John Wetton. Wetton brought in Carl Palmer and Howe brought in Downes, resulting in the super-group Asia. Meanwhile, Squire and White began working with Jimmy Page on the short-lived XYZ (Ex- Yes Zeppelin) project. After that fell through, the duo made the Christmas single \"Run with the Fox\". In January 1982, they formed a new group, Cinema, with guitar/singer Trevor Rabin. Original Yes keyboard-player Tony Kaye was brought in and work began on an album, with Trevor Horn back this time as producer rather than a band member. In summer 1983, Squire called Jon Anderson and played him some of their demos. With Anderson joining the group, making them from a quartet to a quintet, plans to name themselves Bunch of Daffs were aborted when they realized they were Yes again, with three original members. The result was the hugely successful 1983 album \"90125\". The album featured the hit single \"Owner of a Lonely Heart\", which made it to number one in the USA chart. The Yes: Owner of a Lonely Heart (1983) music video features Eddie Jobson on keyboards. After the album's completion, Yes parted ways from the group. However, Kaye returned for the \"90125\" tour and Jobson was largely edited out of the video as a consequence. Kaye appears in the Yes: Leave It (1984) music video. Touring throughout 1984 saw the group enjoying a second wave of success. The Yes: 9012 Live (1985) concert film was shot at Edmonton, Canada in September 1984. The next album, \"Big Generator\" wasn't finished until 1987. Touring in 1988 was followed by Anderson's second departure from the band. He went on to team up with fellow ex-Yes members to form Anderson Bruford Wakeman Howe (ABWH). Meanwhile, Squire, White, Kaye and Rabin began recording with Billy Sherwood. However, Sherwood declined the role as lead singer. By spring 1991, Squire, Rabin, White and Kaye had joined forced with ABWH to form an eight-man Yes line-up. They released the studio album \"Union\" and embarked on a world tour, finishing in spring 1992. During the spring 1991 rehearsals for the tour, the group were filmed for the YesYears (1991) documentary. One by one, Bruford, Howe and Wakeman left the group, reverting back to the \"90125\" line-up. Early 1994 saw the release of the next studio album: \"Talk\". Billy Sherwood joined the group on the world tour, after which Rabin and Kaye left the group. Wakeman and Howe returned and the part-live/part-studio albums \"Keys to Ascension\" and \"Keys to Ascension 2\" were released in 1996 and 1997 respectively. By the time volume 2 was released, Wakeman had left the group for a fourth time and Billy Sherwood became an official member of the band, recording the \"Open Your Eyes\" album with the band. Russian keyboard-player Igor Khoroshev was recruited for the autumn 1997 tour. In 1999, the six-man line-up made \"The Ladder\", touring into the twenty-first century. An October 1999 show was filmed for the House of Yes: Live from House of Blues (2000) concert film. In the course of the year 2000, the group went from six to four members, with Sherwood and Khoroshev parting ways one by one. Rather than recruiting another keyboard player, Anderson, Squire, Howe and White made the \"Magnification\" album with an orchestra and White handling piano parts. On tour, Tom Brislin was brought in as keyboard player. The concert film Yes: Symphonic Live (2002) was filmed in Amsterdam in November 2001. Wakeman joined the group for a fifth time in spring 2002 touring the world with the group until autumn 2004 when both he and Anderson left again. During those two years, numerous DVDs were made: Yesspeak (2003), Yes Acoustic (2004), Songs from Tsongas: Yes 35th Anniversary Concert (2005) and Yes: Live at Montreux 2003 (2007). After a November 2004 London gig with the line-up of Squire, Howe, White, Downes and Rabin, the group went on hiatus for three years, during which time Howe rejoined Asia alongside Downes and Squire re-formed The Syn with White. Plans for a 2008 fortieth anniversary tour with Anderson were canceled due to Anderson's health. Wakeman had suggested his eldest son Oliver Wakeman as keyboard-player. Tired of waiting for Anderson, the trio of Howe, Squire and White, along with Oliver Wakeman and new singer Benoît David began touring America in autumn 2008. The \"In the Present\" touring cycle continued to spring 2011, recording a live album in France in December 2009, which was released two years later along with an accompanying DVD documentary: Yes: In the Present - Live from Lyon (2011). This line-up had entered the studio with Trevor Horn in autumn 2010 and worked on a \"Drama\"-era song called \"Fly from Here\". In January 2011, Downes was brought in to play keyboards on the track, re-forming the \"Drama\" line-up. Subsequently, Downes played on the whole album and Oliver Wakeman was asked to leave following his touring commitments with the group. Partway through the \"Fly From Here\" tour, Benoît David left the group having experienced health issues from singing live. He was replaced by Jon Davison. The Davison, Squire, Howe, White, Downes line-up entered the studio in 2014 to make the \"Heaven and Earth\" album. Throughout 2014 and 2015, the group played four 1970s albums in their entirety live on tour, releasing two live concert album-video sets: Like It Is: Yes at the Bristol Hippodrome (2014) (featuring \"Going for the One\" and \"The Yes Album\") and Like It Is: Yes at Mesa Arts Centre (2015) (featuring \"Close to the Edge\" and \"Fragile\"). Sadly, Squire died from leukemia in June 2015. Whilst ill, Squire had suggested multi-instrumentalist and former Yes member Billy Sherwood as his replacement. This line-up continuing playing original albums in their entirety with \"Drama\" and \"Tales from Topographic Oceans\". In 2016, White had to temporarily leave the group for health reasons and was temporarily replaced by Jay Schellen. Both Schellen and White appear on 2017's \"Topographic Drama\" live album. A six-man line-up toured America in summer 2017, with Howe's eldest son Dylan Howe drumming alongside White to create a richer drum sound whilst White continued to recover from back surgery. In April 2017, the \"Union\" line-up of Anderson, Squire, Bruford, Kaye, Howe, Wakeman, White and Rabin were inducted into the Rock and Roll Hall of Fame: The 2017 Rock and Roll Hall of Fame Induction Ceremony (2017). Squire was represented by widow Scotland Squire and their daughter Xilan. Kaye was not represented. The other six members attended, all except for Bruford performed live together. The line-up of Davison, Sherwood, Howe, White and Downes celebrated the group's fiftieth anniversary in 2018 with original keyboard-player Tony Kaye as special guest and Jay Schellen sharing drumming duties to White not being fully recovered. During the world tour, former members Bill Bruford, Patrick Moraz, Trevor Horn and Tom Brislin all reunited with the group on stage, all performed except Bruford; having retired as a musician some years before, he introduced the group at their London Palladium concert. Concert footage and interviews were filmed during the fiftieth anniversary tour for the documentary Yes 50: Yesterday, Today, Tomorrow (2018). The beginnings of Yes can be traced back to Soho, London in April 1968. It was there that singer Jon Anderson was introduced to bassist Chris Squire by Jack Barrie at La Chasse Club on Wardour Street, a few doors down from the legendary Marquee Club. The pair wrote a song together soon after meeting: \"Sweetness\". On 18 May 1968, Jon Anderson joined Mabel Greer's Toyshop on stage during the encore of a London gig, performing \"Midnight Hour\" alongside Chris Squire, singer/guitarist Clive Bayley, guitarist Peter Banks and drummer Robert Hagger. The group had been formed by Clive Bayley and Robert Hagger in summer 1967, Chris Squire and Peter Banks having joined in the winter following the break up of The Syn. Following the 18 May gig, Peter Banks left the group to join Neat Change. Clive Bayley then switched from rhythm to lead guitarist and Jon Anderson became the group's lead singer. At the very start of June, Robert Hagger also left. Anderson, Bayley and Squire put an advertisement in the Melody Maker music magazine, which led to the recruitment of drummer Bill Bruford. He rehearsed with the group in the basement of the Lucky Horseshoe Café on Shaftesbury Avenue on 7 June and then played his first gig with them that evening. Eight weeks of rehearsals at the Lucky Horseshoe followed. During this time, they recruited Tony Kaye as organist, making Mabel Greer's Toyshop a quintet. They played a single gig in July 1968, in Kingston, Surrey on the 20th, followed by an after-party at Bayley's parents' house nearby. Very soon after the gig, Clive Bayley left Mabel Greer's Toyshop, the group he had formed. Peter Banks re-joined as guitarist in late July. After a few more rehearsals in the basement of the Lucky Horseshoe, the group emerged on 3 August with a new name, Yes (suggested by Banks), and played their first gig, that evening, in Essex. Well rehearsed and different, Yes began growing support around London. Before really getting off the ground, Buford left in September 1968, to go to Leeds University. He was replaced by drummer Tony O'Reilly (formerly of the Koobas), but proved unreliable due to his drinking habits. He ended up in hospital and was replaced by drummer Ian Wallace for a November gig. Wallace had previously played alongside Anderson in The Warriors. The group played a gig at Leeds University, with O'Reilly back on drums, which Buford attended with friends to show them the group he used to play in. With O'Reilly a beat behind the rest of the band, Bruford felt embarrassed and was persuaded to rejoin. He did so just in time for a big show supporting Cream at their farewell concert at London's Royal Albert Hall. The group made their television debut in December 1968 (Episode dated 31 December 1968 (1968)) and their radio debut on the BBC in January 1969. By the spring, they had secured a record deal with Atlantic Records and began recording their debut album, \"Yes\", which opened with the Mabel Greer's Toyshop track \"Beyond and Before\". This was followed by their second album, \"Time and a Word\" in 1970, which featured an orchestra. Prior to the album's release, guitarist Peter Banks was fired after a gig at Luton in April. In early May 1970, with new guitarist Steve Howe, the group moved to Devon to write their third album. In September, the group filmed the television special Rock of the 70s: Yes (1970) with Howe miming to Banks' parts. \"The Yes Album\" was recorded in London in late 1970 and released in January 1971. With new manager Brian Lane, Yes finally began finding success. \"The Yes Album\" made it into the UK charts and they made their USA debut tour in summer 1971. The group performed \"Yours Is No Disgrace\" on Episode #8.13 (1971) and Episode #1.66 (1971). After an outdoor London show in late July 1971, Tony Kaye left the group. With new keyboard-player Rick Wakeman, the group began rehearsing their fourth album, \"Fragile\", in August 1971. Released in autumn, it became their first big hit record in the UK and \"Roundabout\" became their first big hit single in the USA. An October show was filmed for the television program Yes (1972). 1972 saw the group produce their fifth album: \"Close to the Edge\", which was followed by Bruford's second departure from the band, leaving this time to join King Crimson. His replacement, drummer Alan White, joined just a few days before a big American tour. Shows from the autumn 1972 \"Close to the Edge\" tour were recorded and released on the successful \"Yessongs\" album the following year. A December London show was recorded for the concert film Yessongs (1975). 1973 also saw the group release their sixth studio album: \"Tales from Topographic Oceans\". Following the album's tour, Wakeman quit in spring 1974. He was replaced by Swiss Patrick Moraz for the \"Relayer\" album, recorded in 1974 and followed by extensive touring into 1975. The group then took a short break, with each of its members producing solo albums between summer 1975 and spring 1976. They then embarked on a hugely successfully North American tour supported by Peter Frampton. In autumn, the group headed to Montreux, Switzerland to work on their eighth studio album. After a short time, Moraz parted ways and Rick Wakeman was brought back. \"Going for the One\" was completed in 1977 and featured the hit single \"Wonderous Stories\". The group made their first music video for \"Wonderous Stories\", which was aired on Episode #14.40 (1977). In 1978, the group made their ninth studio album, \"Tomato\", followed by extensive touring into 1979. After aborted sessions in Paris at the end of the year, Wakeman left the group for a second time and Anderson also left. Rehearsing as a trio, Squire, Howe and White recruited singer Trevor Horn and keyboard-player Geoff Downes, who had just had a big hit as The Buggles with \"Video Killed the Radio Star\". The tenth studio album, \"Drama\" was recorded in spring 1980 and followed by American and European tours. The immense strain on Horn, in filling Anderson's shoes on stage, led to him leaving the band after touring was completed. A private meeting in January 1981 led to the decision to disband. Horn and Downes made the second Buggles album, while Howe began working with John Wetton. Wetton brought in Carl Palmer and Howe brought in Downes, resulting in the super-group Asia. Meanwhile, Squire and White began working with Jimmy Page on the short-lived XYZ (Ex- Yes Zeppelin) project. After that fell through, the duo made the Christmas single \"Run with the Fox\". In January 1982, they formed a new group, Cinema, with guitar/singer Trevor Rabin. Original Yes keyboard-player Tony Kaye was brought in and work began on an album, with Trevor Horn back this time as producer rather than a band member. In summer 1983, Squire called Jon Anderson and played him some of their demos. With Anderson joining the group, making them from a quartet to a quintet, plans to name themselves Bunch of Daffs were aborted when they realized they were Yes again, with three original members. The result was the hugely successful 1983 album \"90125\". The album featured the hit single \"Owner of a Lonely Heart\", which made it to number one in the USA chart. The Yes: Owner of a Lonely Heart (1983) music video features Eddie Jobson on keyboards. After the album's completion, Yes parted ways from the group. However, Kaye returned for the \"90125\" tour and Jobson was largely edited out of the video as a consequence. Kaye appears in the Yes: Leave It (1984) music video. Touring throughout 1984 saw the group enjoying a second wave of success. The Yes: 9012 Live (1985) concert film was shot at Edmonton, Canada in September 1984. The next album, \"Big Generator\" wasn't finished until 1987. Touring in 1988 was followed by Anderson's second departure from the band. He went on to team up with fellow ex-Yes members to form Anderson Bruford Wakeman Howe (ABWH). Meanwhile, Squire, White, Kaye and Rabin began recording with Billy Sherwood. However, Sherwood declined the role as lead singer. By spring 1991, Squire, Rabin, White and Kaye had joined forced with ABWH to form an eight-man Yes line-up. They released the studio album \"Union\" and embarked on a world tour, finishing in spring 1992. During the spring 1991 rehearsals for the tour, the group were filmed for the YesYears (1991) documentary. One by one, Bruford, Howe and Wakeman left the group, reverting back to the \"90125\" line-up. Early 1994 saw the release of the next studio album: \"Talk\". Billy Sherwood joined the group on the world tour, after which Rabin and Kaye left the group. Wakeman and Howe returned and the part-live/part-studio albums \"Keys to Ascension\" and \"Keys to Ascension 2\" were released in 1996 and 1997 respectively. By the time volume 2 was released, Wakeman had left the group for a fourth time and Billy Sherwood became an official member of the band, recording the \"Open Your Eyes\" album with the band. Russian keyboard-player Igor Khoroshev was recruited for the autumn 1997 tour. In 1999, the six-man line-up made \"The Ladder\", touring into the twenty-first century. An October 1999 show was filmed for the House of Yes: Live from House of Blues (2000) concert film. In the course of the year 2000, the group went from six to four members, with Sherwood and Khoroshev parting ways one by one. Rather than recruiting another keyboard player, Anderson, Squire, Howe and White made the \"Magnification\" album with an orchestra and White handling piano parts. On tour, Tom Brislin was brought in as keyboard player. The concert film Yes: Symphonic Live (2002) was filmed in Amsterdam in November 2001. Wakeman joined the group for a fifth time in spring 2002 touring the world with the group until autumn 2004 when both he and Anderson left again. During those two years, numerous DVDs were made: Yesspeak (2003), Yes Acoustic (2004), Songs from Tsongas: Yes 35th Anniversary Concert (2005) and Yes: Live at Montreux 2003 (2007). After a November 2004 London gig with the line-up of Squire, Howe, White, Downes and Rabin, the group went on hiatus for three years, during which time Howe rejoined Asia alongside Downes and Squire re-formed The Syn with White. Plans for a 2008 fortieth anniversary tour with Anderson were canceled due to Anderson's health. Wakeman had suggested his eldest son Oliver Wakeman as keyboard-player. Tired of waiting for Anderson, the trio of Howe, Squire and White, along with Oliver Wakeman and new singer Benoît David began touring America in autumn 2008. The \"In the Present\" touring cycle continued to spring 2011, recording a live album in France in December 2009, which was released two years later along with an accompanying DVD documentary: Yes: In the Present - Live from Lyon (2011). This line-up had entered the studio with Trevor Horn in autumn 2010 and worked on a \"Drama\"-era song called \"Fly from Here\". In January 2011, Downes was brought in to play keyboards on the track, re-forming the \"Drama\" line-up. Subsequently, Downes played on the whole album and Oliver Wakeman was asked to leave following his touring commitments with the group. Partway through the \"Fly From Here\" tour, Benoît David left the group having experienced health issues from singing live. He was replaced by Jon Davison. The Davison, Squire, Howe, White, Downes line-up entered the studio in 2014 to make the \"Heaven and Earth\" album. Throughout 2014 and 2015, the group played four 1970s albums in their entirety live on tour, releasing two live concert album-video sets: Like It Is: Yes at the Bristol Hippodrome (2014) (featuring \"Going for the One\" and \"The Yes Album\") and Like It Is: Yes at Mesa Arts Centre (2015) (featuring \"Close to the Edge\" and \"Fragile\"). Sadly, Squire died from leukemia in June 2015. Whilst ill, Squire had suggested multi-instrumentalist and former Yes member Billy Sherwood as his replacement. This line-up continuing playing original albums in their entirety with \"Drama\" and \"Tales from Topographic Oceans\". In 2016, White had to temporarily leave the group for health reasons and was temporarily replaced by Jay Schellen. Both Schellen and White appear on 2017's \"Topographic Drama\" live album. A six-man line-up toured America in summer 2017, with Howe's eldest son Dylan Howe drumming alongside White to create a richer drum sound whilst White continued to recover from back surgery. In April 2017, the \"Union\" line-up of Anderson, Squire, Bruford, Kaye, Howe, Wakeman, White and Rabin were inducted into the Rock and Roll Hall of Fame: The 2017 Rock and Roll Hall of Fame Induction Ceremony (2017). Squire was represented by widow Scotland Squire and their daughter Xilan. Kaye was not represented. The other six members attended, all except for Bruford performed live together. The line-up of Davison, Sherwood, Howe, White and Downes celebrated the group's fiftieth anniversary in 2018 with original keyboard-player Tony Kaye as special guest and Jay Schellen sharing drumming duties to White not being fully recovered. During the world tour, former members Bill Bruford, Patrick Moraz, Trevor Horn and Tom Brislin all reunited with the group on stage, all performed except Bruford; having retired as a musician some years before, he introduced the group at their London Palladium concert. Concert footage and interviews were filmed during the fiftieth anniversary tour for the documentary Yes 50: Yesterday, Today, Tomorrow (2018)."
}