{
  "url": "https://www.google.com/intl/pt-BR/chrome/",
  "title": "Navegador da Web Google Chrome",
  "text": "- Foco no desempenho O Chrome foi criado para ter o melhor desempenho possível. Otimize sua experiência com recursos como a Economia de energia e a Economia de memória. - Organize suas guias O Chrome tem ferramentas para você gerenciar as guias que ainda não quer fechar. Você pode agrupar, rotular e definir cores diferentes para suas guias para organizar e agilizar seu trabalho. - Otimizado para seu dispositivo O Chrome foi criado para funcionar em várias plataformas. Assim, você sempre terá uma experiência tranquila, em qualquer dispositivo. - Atualizações automáticas Hay una nueva actualización de Chrome cada cuatro semanas, lo que facilita el acceso a las funciones más recientes y a un navegador más rápido y seguro. - Foco no desempenho O Chrome foi criado para ter o melhor desempenho possível. Otimize sua experiência com recursos como a Economia de energia e a Economia de memória. - Organize suas guias O Chrome tem ferramentas para você gerenciar as guias que ainda não quer fechar. Você pode agrupar, rotular e definir cores diferentes para suas guias para organizar e agilizar seu trabalho. - Otimizado para seu dispositivo O Chrome foi criado para funcionar em várias plataformas. Assim, você sempre terá uma experiência tranquila, em qualquer dispositivo. - Atualizações automáticas Hay una nueva actualización de Chrome cada cuatro semanas, lo que facilita el acceso a las funciones más recientes y a un navegador más rápido y seguro. - GERENCIADOR DE SENHAS Use senhas fortes em todos os sites O Gerenciador de senhas do Google faz parte do Chrome, então é simples salvar, gerenciar e proteger suas senhas. Esse recurso também ajuda a criar senhas mais fortes para todas as suas contas. - NAVEGAÇÃO SEGURA COM MAIOR PROTEÇÃO Acesse a Internet com segurança. A Navegação segura do Chrome mostra alertas de ataques de phishing e malware. Ative a Navegação segura com maior proteção e aproveite ainda mais recursos de segurança. - CONFIRMAÇÃO DE SEGURANÇA Confira seu nível de segurança em tempo real, com apenas um clique. A Confirmação de segurança do Chrome monitora a privacidade e a segurança da sua experiência de navegação de maneira geral, incluindo suas senhas, extensões e configurações. Se um problema requer atenção, o Chrome ajuda você a resolvê-lo. - GUIA DE PRIVACIDADE Controle sua privacidade com configurações fáceis de usar Com o Chrome, é fácil entender exatamente o que você compartilha na Internet e com quem você compartilha essas informações. Basta usar o Guia de privacidade, uma apresentação detalhada das suas configurações de privacidade. Personalize seu Google Chrome Personalize seu navegador usando temas, modo escuro e outras opções criadas para você. Navegue em vários dispositivos Faça login no Chrome em qualquer aparelho para acessar seus favoritos, suas senhas salvas e muito mais. Economize tempo com o preenchimento automático Use o Chrome para salvar endereços, suas senhas e muito mais e preencher seus dados automaticamente. Personalize seu Google Chrome Personalize seu navegador usando temas, modo escuro e outras opções criadas para você. Navegue em vários dispositivos Faça login no Chrome em qualquer aparelho para acessar seus favoritos, suas senhas salvas e muito mais. Economize tempo com o preenchimento automático Use o Chrome para salvar endereços, suas senhas e muito mais e preencher seus dados automaticamente. Melhore sua experiência Seja para compras, entretenimento ou produtividade: encontre a extensão certa para melhorar sua experiência na Chrome Web Store. - IA do Google Tenha acesso aos superpoderes da IA enquanto navega. O Google está integrando a inteligência artificial para deixar nossos produtos mais úteis. Usamos a IA para recursos como Pesquisa, Google Tradutor e muito mais, e estamos inovando com novas tecnologias de forma responsável. - Pesquisa Google Sua barra de pesquisa perfeita, totalmente integrada Um mundo de conhecimento na ponta dos seus dedos. Confira a previsão do tempo, resolva problemas de matemática e encontre resultados de pesquisa na hora. Tudo na barra de endereço do seu navegador. - GOOGLE WORKSPACE Faça o que você precisa, com ou sem Wi-Fi Faça o que você precisa no Gmail, Documentos Google, Apresentações Google, Planilhas Google, Google Tradutor e Google Drive, mesmo se estiver sem conexão de Internet."
}