{
  "url": "https://www.polygon.com/who-is-egg-explained-knight-of-the-seven-kingdoms-king-aegon-v/",
  "title": "Who is Egg from A Knight of The Seven Kingdoms? Aegon Targaryen V and his Game of Thrones role, explained",
  "text": "A Knight of the Seven Kingdoms is fairly low-key, especially compared to the epic stakes of Game of Thrones and House of the Dragon. There are no dragons or White Walkers or violent power struggles in HBO’s latest GoT spinoff, but the show’s new episode still introduces a Westeros-shaking twist when the lowly but earnest hedge knight, Dunk (Peter Claffey), learns an incredible truth about his squire, Egg (Dexter Sol Ansell). Despite the obvious earnestness in his duties as Dunk’s squire, Egg’s intelligence and vast knowledge of the knights at Ashford Meadow’s tourney made it obvious there was more to this bald squire than meets the eye. So who is he really, and what makes him so important? Let’s dive in. [Ed. note: Spoilers ahead for A Knight of the Seven Kingdoms episode 3.] Who is Aegon Targaryen V? Egg isn’t just some orphan from Flea Bottom. He’s actually the son of Prince Maekar Targaryen I (Sam Spruell) and brother to the sadistic Aerion (Finn Bennett) and drunk Daeron Targaryen (Henry Ashton). His uncle Baelor Targaryen (Bertie Carvell) is next in line for the Iron Throne. Egg also has another brother, Aemon, best known to Game of Thrones fans as the wise Maester who serves Castle Black, as well as two sisters, Rhae and Daella. Egg’s full name is Aegon V Targaryen (Egg is a childhood nickname coined by Aemon). Not pleased with being Daeron’s squire due to his drunken escapades, Egg followed Dunk to the Ashford Meadows tourney and signed on to be his squire instead. However, this has major repercussions. We saw Maekar’s concern over his missing sons in previous episodes, and it turns out one son was underneath his nose the entire time. Unfortunately, Daeron lies to his father, claiming that Egg was kidnapped. Combined with Dunk’s decision to attack Aerion in defense of the puppeteer Tanselle (Tanzyn Crawford), this leaves our hedge knight in heaps of trouble. To put it into perspective for fans of Game of Thrones and House of the Dragon: Egg’s great-great-great-great-grandfather is Viserys I Targaryen (Paddy Considine in House of the Dragon), his great-great-great-grandmother is Rhaenyra Targaryen (Emma D’Arcy in House of the Dragon), and Daenerys Targaryen (Emilia Clarke in Game of Thrones) is Egg’s great-great-granddaughter. How does Egg become the King of the Iron Throne? [Ed. note: Spoilers ahead from the books that go beyond A Knight of the Seven Kingdoms episode 3] Despite his small beginnings as Dunk’s squire (and again, spoilers ahead for Egg’s fate in the world of A Song of Ice and Fire), Egg has a large and epic destiny awaiting him. During the festivities at Ashford Meadows, Dunk and Egg are approached by a soothsayer who wishes to tell their fortunes. She tells Dunk he’ll achieve great success and “be richer than a Lannister.” Egg, however, receives a far more unfortunate prophecy. “You shall be king and die in a hot fire, and worms shall feed on your ashes,” the fortune-teller says. “And all who know you shall rejoice in your dying.” Dunk laughs it off, but Egg is shaken. And considering the tragic events of Summerhall, years into his reign, maybe he should be. Due to being so low in the succession of the Targaryen lineage, Egg is able to continue his journey as Dunk’s squire for a long time. However, that changes when his father, Maekar, becomes King of the Iron Throne. Two years later, Maekar gets crushed by a giant rock and dies during the Peake Uprising. At this point, Egg’s older brothers, Daeron and Aerion, are also already dead from disease and drinking wildfire, respectively. Aemon is offered the throne but refuses, content to live his life as a maester. With Egg seemingly being the only choice left, he sheds his nickname and becomes King Aegon V Targaryen. Not only did he become king, but his mentor and friend, Dunk, joined his Kingsguard and eventually became its Commander. Aegon’s reign was popular with the smallfolk, no doubt because his living among them had made him wise on how best to handle their concerns. He and his wife, Betha Blackwood, had two children: Duncan and Jaehaerys Targaryen. A Knight of the Seven Kingdoms only shows the beginning of Egg’s journey, and we highly doubt we’ll see anything regarding Aegon’s eventual rise to the Iron Throne. Instead, it’s looking more likely that the series will focus on the three novellas following Dunk and Egg in the immediate aftermath of the Ashford Meadows tourney. Then again, considering George R.R. Martin has been teasing new Dunk and Egg stories for years now, we won’t completely disregard the idea that the HBO series could eventually show us Egg’s transformation into ruler of the Seven Kingdoms. The first three episodes of A Knight of the Seven Kingdoms are now streaming on HBO with new episodes on Sundays through Feb. 22."
}