{
  "url": "https://www.eonline.com/news/1427671/love-is-blind-season-10-trailer-revealed",
  "title": "Love Is Blind Season 10 Trailer Revealed",
  "text": "Raise a gold cup for the return of Love Is Blind. Weeks after Netflix announced the reality dating series’ 10th season will premiere on Feb. 11, the streamer shared a first look at the new contestants looking for their soulmates in the pods. In the trailer released Feb. 2, the incoming Ohio-based singles mix and mingle without ever seeing their prospective partners, yielding a wide range of results. “I never expected myself to be in a love triangle,” 32-year-old Kevan admits in a confessional, “but here we are.” While some hopefuls navigate unexpected entanglements, others get candid about their hesitations when it comes to looking for love. “I do not know my birth family, or if they are going to pass down any medical problems,” Emma, 28, shares in the teaser. “That scares me about having a child.” Another unseen contestant also admits to facing a different kind of internal struggle, telling one of the women, “I was thinking about what it would be like if I was with the No. 2 person I had.” As for who will ultimately make it down the aisle, that remains to be seen. But in the meantime, viewers are still reeling over the love stories from season nine’s time in Denver. In the finale, three couples—Kalybriah Haskin and Edmond Harvey, Ali Lima and Anton Yarosh, and Megan Walerius and Jordan Keltner—made it to their wedding day, but none of them tied the knot. Despite calling off her engagement, that wasn’t the end of Megan’s road to romance. During the season nine reunion in October, the yoga instructor confirmed she welcomed her son Brooks with her new boyfriend Paul, whom she met months after she finished filming the series. “We got pregnant three months into dating,” she explained to hosts Vanessa Lachey and Nick Lachey as well as her fellow contestants. “We definitely had our ups and downs. I’m not gonna say it was perfect, but Paul’s been amazing and we’re very happy.” Megan wasn’t the only one who found love outside of the show. Indeed, season two contestant Iyanna McNeely—who divorced costar Jarrette Jones in November 2022—exchanged her vows with attorney Alexander Lewis in an intimate Chicago wedding earlier this month. “I’m especially excited to experience the depths of our relationship,” Iyanna told People of their special day at the time. “With each milestone and each twist and turn of life, I’m sure we’ll be changing so much, and our bond will develop over time.” Meanwhile, there’s been several couples who embraced their connection in front of the LIB cameras, including OG’s Cameron Hamilton and Lauren Speed-Hamilton. In fact, the duo—who became a fan favorite during the dating show’s first season in 2020—announced they welcomed a baby boy named Ezra last October. And as they continue to grow together, Lauren is pleased that fans believed in their connection from the beginning. “It feels great to have set that bar,” she told E! News in 2023. “I think it feels even better because it’s not something that we were trying to do, it just naturally happened through us organically falling in love and being ourselves on this huge platform. And I think because of that reason, so many people love us, and they love our story.” As viewers wait to see the season 10 group walk into the pods, keep reading for a status update on Love Is Blind couples from seasons past…"
}