{
  "url": "https://www.tastingtable.com/1698918/varieties-tuna-explained/",
  "title": "15 Varieties Of Tuna, Explained",
  "text": "15 Varieties Of Tuna, Explained Tuna is a truly global fish. Different varieties of tuna can be found in nearly every ocean, after all, and each type carries its own distinct qualities. Given the different textures, taste profiles, and culinary uses for various tuna species, this versatile fish can be found on countless plates across the world — including high-end sushi restaurants, classic Mediterranean dishes, or as a humble addition to a salad or sandwich. During my many years cooking professionally in kitchens (in both New Orleans and New York), I came to know plenty of species of fish, including tuna. In fact, as one of my favorites to work with, I can say the world of tuna is as diverse as it is fascinating. With that in mind, whether you're a seafood connoisseur or just curious about the fish in your canned seafood, this guide will introduce and discuss 15 types of tuna, including lesser-known varieties such as bullet tuna (a staple in Mediterranean cuisine). If you're looking to gain a deeper appreciation for the different tuna varieties out there, keep reading, as I dive into the vast and flavorful world of tuna. Bluefin tuna Known for its buttery texture and unparalleled marbling, bluefin tuna is the crown jewel of the tuna world. Found in both the Atlantic and Pacific oceans, bluefin is often considered the most luxurious variety of the fish, especially when it comes to sushi and sashimi. Its deep red flesh is prized for its melt-in-your-mouth texture, making it a favorite among sushi aficionados and high-end chefs. In Japanese cuisine, bluefin tuna is known as maguro, with specific cuts like otoro tuna (the fattiest part of the belly) and chutoro (a medium-fatty cut) commanding the highest prices at seafood markets. Its scarcity and high demand have driven prices to astronomical levels, especially in Japan, where a single bluefin tuna was auctioned for millions of dollars in 2019. However, this fish isn't just for sushi. Bluefin is also excellent when grilled or seared, as its high oil content lends itself to beautifully caramelized, crispy exteriors. Due to overfishing, bluefin tuna populations have been on the decline, making sustainable fishing practices crucial for preserving the species. But whether you're indulging in a sushi platter or enjoying it lightly seared, bluefin offers a level of depth that's hard to match. Yellowfin tuna (ahi) Yellowfin tuna, often referred to as ahi, is a favorite among seafood lovers for its firm texture, and mild, slightly sweet taste. In its raw form, yellowfin tuna shines in dishes like sashimi, tuna tartare, and poke, where its freshness and clean taste are highlighted. Its firm flesh makes it easy to slice into neat, delicate pieces, and the flavor profile does well with citrus, soy-based marinades, or spicy accents such as wasabi or chili. When cooked, yellowfin takes on a whole new character. Whether it's simply seared ahi tuna steaks, grilled with a smoky char, or tossed in a salad, its texture remains tender, but with a satisfying bite. Furthermore, because of its versatility and availability, yellowfin is more accessible than bluefin, and often a more sustainable choice. You'll find it in both high-end restaurants and casual seafood spots, and used in everything from ahi poke bowls (bursting with fresh appeal) to tuna steaks cooked rare and topped with a sesame crust. Albacore tuna Albacore tuna is perhaps best known as the star of the often misunderstood and mythologized canned tuna, but there's much more to this species than its convenient packaging. Recognizable by its light-colored flesh, albacore has a less intense profile than richer counterparts like bluefin or yellowfin. Found in temperate waters, albacore is also sometimes referred to as white tuna due to its paler meat, making it a popular choice for those seeking a lighter, more delicate option. While most people are familiar with albacore from the canned variety, fresh albacore is a different experience altogether. Its lean texture and mild taste make it excellent for grilling or searing. When cooked, it becomes tender and juicy, with a subtle sweetness that pairs well with bold marinades like soy, ginger, or garlic. Albacore steaks are a great option for a lighter take on tuna, perfect for summer barbecues or as a healthier alternative to heavier proteins. Bigeye tuna Bigeye tuna is a favorite among sushi enthusiasts because of its deep red color, higher fat content, and full-body taste. Found in tropical and subtropical waters, bigeye is often compared to bluefin tuna, as it shares many of the same qualities (particularly its marbling and velvety texture). However, this type of tuna strikes a balance between the leaner yellowfin and fattier bluefin, making it an appealing option for those who want the richness of high-quality tuna without the intensity of bluefin. In sushi and sashimi, bigeye tuna shines. Its thick, meaty texture is smooth and succulent, while the deep red hue of this fish's flesh makes it visually stunning. Bigeye offers a satisfying bite with a pronounced character, making it a popular choice for nigiri or sashimi. The fat content enhances the mouthfeel, creating a melt-in-your-mouth sensation similar to bluefin, but with a slightly milder profile that still feels indulgent. Skipjack tuna Skipjack tuna is one of the most widely consumed tunas in the world, commonly found in canned tuna labeled as \"light tuna.\" Known for its strong, pronounced taste and darker flesh (compared to albacore), skipjack has a savory, meaty character that stands up well to loud seasonings and sauces. It's abundant in tropical and subtropical waters, making it a popular choice for canning due to its availability and affordability. Skipjack is the workhorse of the tuna world — especially in canned form, where its stronger profile makes it an ideal candidate for dishes that need an extra punch of umami. Whether mixed into tuna salads, sandwiches, or casseroles, skipjack's flavor holds up well even when combined with mayonnaise, pickles, or mustard. More than that, skipjack works by itself, with a little oil, salt and pepper. It's a staple in kitchens worldwide for good reason, as its versatility makes it an easy go-to for simple meals that still pack a punch. Bonito tuna Bonito tuna is a smaller, leaner species with a prominent role in Japanese cuisine, especially for making katsuobushi (or dried bonito flakes). These flakes are essential for creating dashi broth, the base for many Japanese soups, like miso. Bonito has a stronger, slightly gamey taste compared to larger, fattier tuna, making it more suited for cooked preparations. The fish's firm flesh holds up well to high-heat cooking, so fresh bonito is often grilled, seared, or pan-fried. It works well when seasoned with soy, ginger, or garlic, while in Mediterranean cuisine, it's often grilled with olive oil and lemon (similar to sardines). Of course, bonito's most famous use is in katsuobushi, which adds a deep umami note to soups and sauces. These thin flakes can also be sprinkled on dishes like okonomiyaki, where they curl from the heat. Though less common outside Japan, bonito's savory character and versatility make it a key player in various cuisines. Blackfin tuna Blackfin tuna may be smaller in size compared to its more famous relatives, but what it lacks in size, it makes up for in complexity. Found primarily in the warm waters of the Atlantic and Gulf of Mexico, blackfin tuna is known for its sweet, savory notes and tender texture. Its flesh is slightly darker than yellowfin but still has a firm, meaty quality that makes it excellent for grilling, searing, or even smoking. While sport fishermen prize blackfin, it's also highly regarded for its culinary potential. The profile of blackfin is often described as more delicate than bluefin but more pronounced than albacore, giving it a unique place in the tuna spectrum. This makes it ideal for simple preparations where its natural sweetness can be highlighted, such as grilling with just a light seasoning of salt, pepper, and olive oil. The firm texture allows it to hold up well on the grill without falling apart, while the slight caramelization from the high heat enhances its appeal. Blackfin is also popular when smoked, where its natural oils provide a rich quality that works well in dips, spreads, or served simply with crackers and cheese. This staple among fishermen in the Atlantic is a good choice for tuna steaks or even raw preparations, like poke, where its complex characteristics add depth to fresh, vibrant ingredients. Longtail tuna Longtail tuna, found primarily in the Indo-Pacific region, is known for its delicate nature and tender texture. While not as widely recognized as some other tuna species, longtail has earned its place in local cuisines, particularly in Southeast Asia and Australia, where it's often grilled or used in curries. This type of tuna has a lighter, leaner flesh compared to richer varieties, making it an excellent choice for preparations that don't require a strong, oily fish. In many coastal regions, longtail tuna is commonly barbecued, allowing its mild, slightly sweet character to shine. Its tender texture holds up well to high heat, and it's often marinated with citrus, garlic, or spicy seasonings to enhance its appeal. The leaner flesh also makes it ideal for those who prefer a less fatty tuna that still offers a satisfying bite. Longtail tuna is frequently used in Southeast Asian dishes, where the combination of rich coconut milk and aromatic spices like turmeric and lemongrass highlight the subtle nature of the fish. Additionally, longtail tuna is a favorite among recreational fisherman in Australia. Frigate tuna Frigate tuna is a smaller, leaner variety found in tropical waters, known for its gamey taste and firm texture. While it may not have the same global popularity as larger species like yellowfin or bluefin, frigate tuna is popular in local cuisines across Asia and the Pacific. Its lean flesh, coupled with its distinctive, slightly mild and sweet character, makes it a great choice for grilling, frying, or even smoking, where it can hold up to strong spices and marinades such as chili, garlic, and soy. Frigate tuna is solid in curries and stews, where its pronounced character is enhanced by aromatic spices such as turmeric, cumin, and coriander. More than that, the fish's slightly firmer texture allows it to absorb these sauces while retaining its own distinct taste. Grilled frigate tuna (served with a squeeze of fresh lime or lemon) is another good preparation, allowing the natural flavors to shine with minimal fuss. Though not as widely known as some of its larger cousins, frigate tuna plays a critical role in regional tropical cuisine, bringing both versatility and a distinctive flavor to the table. Bullet tuna Bullet tuna is a small species with a mild tang and lean texture, making it a favorite in various dishes. Though less known outside its native region, bullet tuna has a hearty appeal and versatility. Known for its clean and slightly sweet taste, bullet tuna is often served with olive oil, lemon, and herbs — ingredients that complement its natural essence. Its size makes it an excellent candidate for quick grilling, but it's also used in recipes that call for marinating in citrus or vinegar-based sauces, which enhance its complexity. This variety of tuna is a staple in traditional Mediterranean cuisine, where it's often enjoyed as a simple yet flavorful part of meals along the coast. In countries like Italy, Greece, and Spain, bullet tuna is commonly served grilled or preserved in olive oil, providing a rich and satisfying option for tapas or light meals. The tuna's profile pairs beautifully with other regional staples like capers, tomatoes, and fresh herbs, creating dishes that are both rustic and elegant. Dogtooth tuna Dogtooth tuna, found in tropical waters, is a large and distinctive species known for its bold taste and firm, slightly oily flesh. Named for its prominent teeth, this tuna is popular among sport fishermen and seafood lovers alike for its hearty, steak-like texture, and ability to stand up to potent marinades and cooking methods. Dogtooth tuna is often grilled or smoked, where its flesh takes on a deeper flavor, and it works well with strong seasonings like soy, garlic, and chili. In coastal areas where dogtooth tuna is commonly caught, it's celebrated for its versatility. The fish's firm meat absorbs marinades beautifully, making it an excellent choice for grilling, where it can develop a caramelized crust that nicely contrasts its moist, flavorful interior. It's also popular when smoked, as the natural oils enhance the fish's richness, making it ideal for spreads or as a centerpiece in savory platters. Southern bluefin tuna Southern bluefin tuna is a prized species, especially in Japan, where its buttery flesh is highly valued for sashimi. Found primarily in the colder waters of the southern hemisphere, southern bluefin is closely related to its northern counterpart, but tends to be slightly smaller. Known for its high oil content, particularly in the belly cuts, southern bluefin offers a mild to medium flavor and melt-in-your-mouth texture, making it a favorite for sushi and sashimi aficionados. The deep red to pink flesh of southern bluefin — particularly in the expensive toro tuna and chutoro cuts — has a luxurious marbling that gives the fish its signature smoothness. In addition to its raw form, southern bluefin is also excellent when lightly seared or grilled, as this cooking method creates a crust that surrounds a tender, oily interior. Its richness also goes well with citrus-based marinades or soy-based sauces, as these balance the depth of the fish's natural flavors. Slender tuna Slender tuna is a lesser-known species often found in colder southern oceans. True to its name, this tuna is smaller and more streamlined than its better-known cousins like yellowfin or bluefin. With a milder profile and leaner texture, slender tuna is generally consumed locally where it's caught, and isn't as widely exported as other varieties. Despite its relative obscurity, this tuna plays an important role in regional fisheries, where it's appreciated for its simplicity and versatility. The flesh of slender tuna is quite oily, meaning it's generally better-suited for canning than eating fresh. Still, its white meat is sweet and mild, meaning it can be eaten raw, as well. Additionally, since this species of tuna is usually caught as a byproduct of fishermen looking for other game, you'd be hard pressed to find it in many markets (outside of some rural parts of Australia). In fact, if you do happen to get a hold of one, it'll probably be unintentionally — perhaps on a chartered fishing trip. Kawakawa tuna Also known as mackerel tuna, kawakawa tuna is a smaller species with a strong, distinctive taste. Found primarily in the Indian and Pacific oceans, this tuna is known for its deep, savory character and is often served fresh in regional dishes. Unlike the milder albacore or yellowfin, kawakawa has a more pronounced taste, and can actually be quite bloody if not cleaned properly immediately after catching. That being said, the fish's flavor profile makes it a popular choice for dishes that benefit from loud, savory notes. Its robust flavor is particularly prominent in cuisines where bold, spicy, and tangy flavors are the norm. Kawakawa tuna is also quite versatile, and can be grilled or fried to bring out the smoky flavor of its rich, oily flesh. Furthermore, kawakawa is great when served raw in salads or as a sushi component, and can be found in a variety of southeast Asian and Pacific dishes. Little tunny (false albacore) Little tunny (also known as false albacore) is a smaller species of tuna often found in the Atlantic and Mediterranean. It's recognizable by its torpedo-like shape and distinctive dark markings along its back. Though not as widely consumed as other tuna varieties, little tunny has a strong, meaty, almost gamey profile – one that's appreciated in local dishes, but can be a bit intense for those who prefer milder fish. Its firm, oily flesh makes it ideal for hearty preparations, and it's often used in stews, curries, or cooked with bold seasonings. Because of its strong taste, little tunny is frequently enjoyed in coastal regions, where fresh catches are common. In some Mediterranean countries, it's grilled and served with olive oil, lemon, and herbs, which helps to balance out the fish's natural richness. This type of tuna is occasionally used in canning or as bait in sport-fishing, as well, where its speed and power make it a challenging catch."
}