{
  "url": "https://support.google.com/chrome/answer/95346?hl=es-mx&co=GENIE.Platform=Desktop",
  "title": "Cómo descargar e instalar Google Chrome - Computadora - Ayuda de Google Chrome",
  "text": "Puedes descargar e instalar el navegador web Chrome sin cargo y usarlo para navegar por la Web. Cómo instalar Chrome Importante: Antes de descargarlo, comprueba si Chrome es compatible con tu sistema operativo y si cumples con todos los demás requisitos del sistema. Windows- En tu computadora, descarga el archivo de instalación. - Para instalar el archivo, sigue las instrucciones en pantalla. - Si recibes el mensaje \"¿Quieres ejecutar este archivo?\", selecciona Ejecutar. - Si recibes el mensaje \"¿Quieres permitir que esta app haga cambios en tu dispositivo?\", selecciona Sí. - Abre Chrome. - En Windows 10 y versiones posteriores, cuando se complete la instalación, se abrirá una ventana de Chrome. Luego, podrás establecer Chrome como el navegador predeterminado. Nota: Si usabas otro navegador, como Firefox, puedes importar tus parámetros de configuración a Chrome. Cómo instalar Chrome sin conexión Si tienes problemas para descargar Chrome en una computadora con Windows, usa el vínculo alternativo para descargarlo en otra computadora. - En tu computadora, descarga un instalador de Chrome para otra computadora. - En la parte inferior de la página, en \"Familia Chrome\", selecciona Otras plataformas. - Selecciona el SO del dispositivo en el que deseas instalar Chrome. - Descarga el archivo. - Mueve el archivo a la computadora donde quieras instalar Chrome. - Para instalarlo, sigue las instrucciones en pantalla. - En tu computadora, descarga el archivo de instalación. - Abre el archivo \"googlechrome.dmg\". - En la ventana que se abre, puedes encontrar Chrome. - Arrastra Chrome a la carpeta Aplicaciones. - Es posible que debas ingresar la contraseña del administrador. - Si no puedes ingresar la contraseña de administrador, arrastra Chrome a una ubicación en la que tengas permisos completos, como tu escritorio. Nota: Para liberar espacio después de la instalación, en la barra lateral del Finder, junto a “Chrome”, selecciona Expulsar . Para instalar Chrome, usa el mismo software con el que instalas programas en tu computadora. Debes ingresar la contraseña de la cuenta de administrador. - En tu computadora, descarga el archivo de instalación. - Para abrir el paquete, selecciona Aceptar Instalar paquete. Para asegurarte de que Chrome se mantenga actualizado, se agrega a tu administrador de software. Consulta los requisitos del sistema para usar Chrome WindowsPara usar Chrome en Windows con un procesador Intel o ARM, necesitas lo siguiente: - Procesador Intel: - Windows 10 y versiones posteriores - Un procesador Intel Pentium 4 o versiones posteriores compatibles con SSE3 - Procesador ARM: Windows 11 y versiones posteriores Para usar Chrome en Mac, necesitas macOS 12 Monterey o versiones posteriores. Para usar Chrome en Linux, necesitas lo siguiente: - Ubuntu 18.04 de 64 bits o versiones posteriores, Debian 10 o versiones posteriores, openSUSE 15.5 o versiones posteriores, o Fedora Linux 39 o versiones posteriores - Un procesador Intel Pentium 4 o versiones posteriores compatibles con SSE3"
}