{
  "url": "https://www.woodwardenglish.com/lesson/irregular-past-participles/",
  "title": "101 Irregular Past Participles in English | Woodward English",
  "text": "The following is a list of 101 irregular past participles in English with example sentences: Present tense – Past Participle: Example Sentence be – been: I have been busy all day. become – become: They have just become angry with each other. begin – begun: We have begun a new project. bend – bent: He has bent over so many times today that his back now hurts. bet – bet: He has just bet all of his money at once. bite – bitten: The dog has just bitten the postman. bleed – bled: HIs finger has bled all over the table. blow – blown: He has blown out all of the candles. break – broken: She has just broken her pencil. bring – brought: The waiter has finally brought our order to the table. build – built: The boy has built a sandcastle. buy – bought: She has already bought many things today, but she hasn’t finished yet. catch – caught: We have caught many fish today. choose – chosen: He still hasn’t chosen a main course from the menu. come – come: I don’t know why she has come to my party in a costume. cost – cost: It has cost me a lot of money to start my new business. cut – cut: She has just cut the paper with a pair of scissors. deal – dealt: She has just dealt new cards to the other players. dig – dug: The dog has dug another hole in the backyard. do – done: She has already done her homework so now she can relax. draw – drawn: He has drawn another cartoon for the lesson. drink – drunk: He has drunk three glasses of water this morning. drive – driven: The clown has driven his small car in circles all afternoon. eat – eaten: She has eaten all of the cake. fall – fallen: The bowling ball has fallen on his foot again. feed – fed: She has fed the pigeons every day this month. feel – felt: She has felt cold all day. fight – fought: He has fought many battles in his lifetime. find – found: She has just found a coin on the ground. fly – flown: The pilot has flown to our city many times. forget – forgotten: I have forgotten what I have to do right now. forgive – forgiven: She has forgiven him. freeze – frozen: The cold weather has frozen the lake. get – got/gotten: He has just got the new high score. (Got: British English – Gotten: American English) give – given: My children have just given me a birthday present. go – gone: The kids have gone to the local park to play. grow – grown: Flowers have grown under the hammock. hang – hung: Someone has hung him on the clothesline. have – had: I have had pancakes for breakfast all week. hear – heard: She has just heard a sound coming from the box. hide – hidden: He has hidden his face. hit – hit: A ball has just hit her in the head. hold – held: She has held the egg in her hand for ten minutes now. hurt – hurt: You have hurt my feelings. keep – kept: He has always kept his tools in a toolbox. know – known: I have known Jason for over ten years. lead – led: He has led his pet along the street many times. leave – left: They have already left the office. lend – lent: He has lent me some money until next week. let – let: My boss has let me leave work early today. light – lit: He has just lit a match. lose – lost: He has lost two matches in a row. make – made: She has just made a chocolate cake for us. mean – meant: Your help has meant a lot to me. meet – met: This year I have met many interesting people. pay – paid: She has just paid her taxes. put – put: I have already put my suggestion in the box. quit – quit: He has just quit his job. read – read: I have read many books this year. ride – ridden: She has ridden her horse many times in competitions. ring – rung: He has rung the doorbell three times, but nobody has answered yet. rise – risen: Profits have risen considerably this year. run – run: He has run in many marathons. say – said: He has said before that he liked flowers. see – seen: The pirate has just seen another ship in the distance. sell – sold: He has sold a lot of lemonade today. send – sent: He has sent a postcard to us, but it hasn’t arrived yet. set – set: He has just set the table so now we can have dinner. shake – shaken: We have just shaken hands to close the deal. shine – shone: He has always shone a flashlight to light his way in the dark. shoot – shot: He has just shot at the target. shut – shut: The boy has shut his eyes so that he won’t see the surprise. sing – sung: We have sung this song many times at karaoke. sink – sunk: Many ships have sunk off the coast due to the hidden reef. sit – sat: They have sat on the park bench most of the afternoon. sleep – slept: This is not the first time he has slept in that armchair. slide – slid: She has slid to second base. speak – spoken: He has spoken to a large audience many times. speed – sped: He has just sped past a police officer. spend – spent: He has just spent all of his savings on a new gaming console. spin – spun: The dancer has spun around very quickly without becoming dizzy. spread – spread: You can see that I have spread a lot of jam on the bread. stand – stood: A guard has stood outside the entrance all day. steal – stolen: A thief has stolen an expensive painting from the museum. stick – stuck: Some chewing gum has stuck to the bottom of his shoe. sting – stung: A bee has just stung my arm and it hurts. strike – struck: He has just struck the ball very well. sweep – swept: The man has swept the footpath with his old broom. swim – swum: The boy has swum to the edge of the pool because he is tired. swing – swung: He has just swung on a vine for the first time. take – taken: She has just taken her medication because she wasn’t feeling well. teach – taught: He has taught geography for over twenty years. tear – torn: She has just torn the contract in half. tell – told: I have told you many times to be more careful. think – thought: He has thought about the problem but still doesn’t have a solution. throw – thrown: She has thrown the can into the bin. understand – understood: He has understood the entire lesson. wake – woken: My alarm clock has just woken me up. wear – worn: She has worn that blue hat and blue dress to class before. win – won: He has already won three medals in the competition today. write – written: The teacher has written a message on the board for his students. Grammar Chart English Language Resource 101 Irregular Past Participles in English – Flash Cards / Charts"
}