{
  "url": "https://finance.yahoo.com/quote/NOV/",
  "title": "NOV Inc. (NOV) Stock Price, News, Quote & History - Yahoo Finance",
  "text": "NOV Inc. (NOV) - Previous Close 18.40 - Open 18.33 - Bid 18.29 x 120000 - Ask 18.75 x 140000 - Day's Range 18.26 - 18.55 - 52 Week Range 10.84 - 18.55 - Volume 3,034,964 - Avg. Volume 4,363,433 - Market Cap (intraday) 6.863B - Beta (5Y Monthly) 0.95 - PE Ratio (TTM) 18.67 - EPS (TTM) 0.99 - Earnings Date Feb 4, 2026 - Forward Dividend & Yield 0.30 (1.63%) - Ex-Dividend Date Dec 5, 2025 - 1y Target Est 17.55 NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates in two segments, Energy Equipment, and Energy Products and Services. The company provides solids control and waste management equipment and services; managed pressure drilling, wired drill pipe, and tubular inspection and coating services; precision-engineered drill pipe and drill-stem equipment; integral thread solutions; and integral and weld-on connectors, drilling fluids, completion and downhole tools, and drill bits, as well as data and digital solutions. It also offers equipment and technologies for hydraulic fracture stimulation, including pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, coiled tubing, and wireline units and tools; onshore production that consists of fluid processing, surface transfer, and progressive cavity pumps; artificial lift systems; offshore production, such as integrated production systems and subsea production technologies; and industrial pumps and mixers. In addition, the company provides equipment for wind turbine installation and cable lay vessels; heavy lift cranes and jacking systems; equipment and technologies for drilling, including land rigs, offshore drilling equipment packages, drilling rig components, and software control systems; marine and industrial equipment; cementing products for pumping, mixing, transport, and storage; integrated processing solutions for the separation and treatment of oil, gas, solids, seawater, and produced water production; and aftermarket support, rental, service, and repair solutions, as well as spare parts. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas. www.nov.com34,010 Full Time Employees December 31 Fiscal Year Ends Sector Oil & Gas Equipment & Services Industry Recent News: NOV View MorePerformance Overview: NOV Trailing total returns as of 1/22/2026, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) . YTD Return 1-Year Return 3-Year Return 5-Year Return Earnings Trends: NOV View MoreAnalyst Insights: NOV View MoreStatistics: NOV View MoreValuation Measures Market Cap 6.71B Enterprise Value 7.86B Trailing P/E 18.59 Forward P/E 16.00 PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.80 Price/Book (mrq) 1.04 Enterprise Value/Revenue 0.90 Enterprise Value/EBITDA 8.26 Financial Highlights Profitability and Income Statement Profit Margin 4.36% Return on Assets (ttm) 3.95% Return on Equity (ttm) 6.03% Revenue (ttm) 8.78B Net Income Avi to Common (ttm) 383M Diluted EPS (ttm) 0.99 Balance Sheet and Cash Flow Total Cash (mrq) 1.21B Total Debt/Equity (mrq) 36.16% Levered Free Cash Flow (ttm) 785.75M Compare To: NOV Select to analyze similar companies using key performance metrics; select up to 4 stocks. Company Insights: NOV Fair Value Dividend Score Hiring Score Insider Sentiment Score Research Reports: NOV View MoreDaily – Vickers Top Buyers & Sellers for 11/25/2025 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Waiting for a more attractive entry point NOV Inc. designs, manufactures, and sells major mechanical components and integrated systems for both land-based and offshore drilling rigs. It manufactures complete land drilling and well-servicing rigs, the largest line of lifting and handling equipment in the industry, a broad offering of downhole drilling motors, and specialized drilling tools. The company was founded in 1862 and is based in Houston. The shares are not currently a component of the S&P 500. The firm employs approximately 34,000 people. RatingPrice TargetStocks are lower at midday on Tuesday. Earnings season is humming Stocks are lower at midday on Tuesday. Earnings season is humming along and providing much information on the state of corporate America and demand from both the consumer and business sides. Earnings, in general, are coming in strong, but there is an undertone of concern about whether consumers can and will continue spending. The yield on the 10-year Treasury note is at 4.08%. Crude oil is at $61 per barrel. The VIX is 18. NOV Earnings: Strong Order Growth, Favorable Backlog, and Cost Reductions Position NOV Well NOV (formerly National Oilwell Varco) is a leading supplier of oil and gas drilling rig equipment and products, such as downhole tools, drill pipe, and well casing. The company operates on a global scale, with international markets contributing nearly two thirds of its annual revenue. RatingPrice Target"
}