{
  "url": "https://en.wikipedia.org/wiki/Tillamook,_Oregon",
  "title": "Tillamook, Oregon - Wikipedia",
  "text": "Tillamook, Oregon Tillamook (/ˈtɪləmʊk/ TILL-ə-muuk) is a city in and the county seat of Tillamook County, Oregon, United States. The city is located on the southeast end of Tillamook Bay on the Pacific Ocean. The population was 5,231 at the 2020 census. History [edit]The city is named for the Tillamook people, a Native American tribe speaking a Salishan language who lived in this area until the early 19th century. Anthropologist Franz Boas identifies the Tillamook Native Americans as the southernmost branch of the Coast Salish peoples of the Pacific Northwest. This group was separated geographically from the northern branch by tribes of Chinookan peoples who occupied territory between them. The name Tillamook, he says, is of Chinook origin, and refers to the people of a locality known as Elim or Kelim. They spoke Tillamook, a combination of two dialects. Tillamook culture differed from that of the northern Coast Salish, Boas says, and might have been influenced by tribal cultures to the south, in what is now Northern California.[5] Captain Robert Gray first anchored in Tillamook Bay in 1788, marking the first recorded European landing on the Oregon coast. Settlers began arriving in the early 1850s, and Tillamook County was created by the Territorial legislature in 1853. In 1862, the town itself was laid out, and the first post office was opened in 1866. The town was voted to be the county seat in 1873. Tillamook was officially incorporated as a city in 1891.[6] Its first mayor was George Cohn, a merchant and community leader who served in 1891. Cohn's was president Cohn and Company, a local mercantile[7] The first church in Tillamook was the Methodist Episcopal Church, established in 1861 by early settlers. Services were initially held in homes and schoolhouses, with the first dedicated building constructed in the 1870s. The Sacred Heart Catholic Church followed in 1896.[8] A series of devastating forest fires, Tillamook Burn starting with the 1933 fire that burned 240,000 acres in 6 days, destroying $442 million in timber (equivalent to $12 billion today). Subsequent fires in 1939, 1945, and 1951 totaled 355,000 acres, the largest in Oregon history. During World War II, the United States Navy operated a blimp patrol station near the town at Naval Air Station Tillamook. The station was decommissioned in 1948, and the remaining facility now houses Tillamook Air Museum. Geography [edit]According to the United States Census Bureau, the city has a total area of 1.7 square miles (4.40 km2), all of it land.[9] The Tillamook area is also home to five rivers, the Tillamook, Trask, Wilson, Kilchis, and the Miami just north of the city. Climate [edit]Tillamook has a climate that lies between the cool-summer Mediterranean climate (Csb) and the oceanic climate (Cfb). The city has a mild and wet climate with very little seasonal temperature variation due to its proximity to the Pacific Ocean. From November through April, daytime high temperatures range from the high 40s to the high 50s with abundant rainfall - including more than 13 inches (330 mm) per month in November, December, and January. Snowfall is very rare, but winter floods are a common occurrence. Between April and October, the precipitation in Tillamook is comparatively lighter than other coastal cities, but still remains much wetter than the population centers in the Willamette Valley. Tillamook's annual precipitation averages about 88 inches (2,200 mm) compared to only 36 inches (910 mm) in Portland. Summers in Tillamook are brief and mild with average daytime temperatures in the upper 60s, although daytime temperatures can occasionally soar into the 80s and 90s for days at a time. Summer is by far the driest season in Tillamook with only 1.35 inches and 1.33 inches of rain (34 mm in either case) falling in July and August, respectively. Demographics [edit]2020 census [edit]As of the 2020 census, Tillamook had a population of 5,204. The median age was 36.0 years. 25.7% of residents were under the age of 18 and 16.4% of residents were 65 years of age or older. For every 100 females there were 92.7 males, and for every 100 females age 18 and over there were 88.8 males age 18 and over.[13][14] 99.4% of residents lived in urban areas, while 0.6% lived in rural areas.[15] There were 2,137 households in Tillamook, of which 31.5% had children under the age of 18 living in them. Of all households, 33.7% were married-couple households, 21.5% were households with a male householder and no spouse or partner present, and 34.6% were households with a female householder and no spouse or partner present. About 36.1% of all households were made up of individuals and 17.1% had someone living alone who was 65 years of age or older.[13] There were 2,295 housing units, of which 6.9% were vacant. Among occupied housing units, 43.2% were owner-occupied and 56.8% were renter-occupied. The homeowner vacancy rate was 2.4% and the rental vacancy rate was 5.9%.[13] 2010 census [edit]As of the census of 2010, there were 4,935 people, 2,037 households, and 1,192 families living in the city. The population density was 2,902.9 inhabitants per square mile (1,120.8/km2). There were 2,248 housing units at an average density of 1,322.4 per square mile (510.6/km2). The racial makeup of the city was 86.5% White, 0.2% African American, 1.5% Native American, 1.1% Asian, 0.8% Pacific Islander, 6.9% from other races, and 3.0% from two or more races. Hispanic or Latino of any race were 17.2% of the population.[4] There were 2,037 households, of which 33.5% had children under the age of 18 living with them, 39.9% were married couples living together, 13.5% had a female householder with no husband present, 5.1% had a male householder with no wife present, and 41.5% were non-families. 34.5% of all households were made up of individuals, and 15.4% had someone living alone who was 65 years of age or older. The average household size was 2.41 and the average family size was 3.11.[4] The median age in the city was 33.7 years. 27% of residents were under the age of 18; 9.8% were between the ages of 18 and 24; 26.2% were from 25 to 44; 23% were from 45 to 64; and 14% were 65 years of age or older. The gender makeup of the city was 48.3% male and 51.7% female.[4] 2000 census [edit]As of the census of 2000, there were 4,352 people, 1,758 households, and 1,105 families living in the city. The population density was 2,818.8 inhabitants per square mile (1,088.3/km2). There were 1,898 housing units at an average density of 1,229.3 per square mile (474.6/km2). The racial makeup of the city was 92.56% White, 0.16% African American, 1.22% Native American, 0.71% Asian, 0.16% Pacific Islander, 3.42% from other races, and 1.77% from two or more races. Hispanic or Latino of any race were 11.12% of the population.[4] There were 1,758 households, out of which 33.3% had children under the age of 18 living with them, 44.7% were married couples living together, 12.5% had a female householder with no husband present, and 37.1% were non-families. 32.1% of all households were made up of individuals, and 13.1% had someone living alone who was 65 years of age or older. The average household size was 2.46 and the average family size was 3.08.[4] In the city, the population dispersal was 29.2% under the age of 18, 9.4% from 18 to 24, 28.1% from 25 to 44, 19.6% from 45 to 64, and 13.6% who were 65 years of age or older. The median age was 33 years. For every 100 females, there were 96.0 males. For every 100 females age 18 and over, there were 92.1 males.[4] The median income for a household in the city was $29,875, and the median income for a family was $36,351. Males had a median income of $28,458 versus $20,801 for females. The per capita income for the city was $15,160. About 11.8% of families and 15.4% of the population were below the poverty line, including 18.2% of those under age 18 and 14.8% of those age 65 or over.[4] Economy [edit]Historically, the Tillamook economy has been based primarily on dairy farms. The farmland surrounding the city is used for grazing the milk cattle that supply the Tillamook County Creamery Association's production of cheese, particularly cheddar, gourmet ice cream and yogurt, and other dairy products. Approximately one million people visit the cheese factory (located north of Tillamook on Highway 101) each year.[16] The lumber industry also is experiencing a comeback from the replanting that followed the Tillamook Burn forest fires of the mid-20th century. The burned remains of some of the trees can still be found in the forests surrounding Tillamook. Tillamook also serves tourists on their way to the ocean beaches and as a location for second homes. Arts and culture [edit]Museums and other points of interest [edit]The Tillamook Air Museum, which features over 15 aircraft, an Exhibit Hall with rare wartime and aviation-themed artifacts, is located just south of the city. It is housed in a wooden WWII blimp hangar that was once a part of Naval Air Station Tillamook. In 1991, illusionist David Copperfield filmed a train car disappearance illusion for a TV special in Hangar B.[17] Its sister hangar (Hangar A) was destroyed by a fire in 1992. The hangars were built with old-growth trees and one can see the huge seamless beams inside the buildings. The Tillamook Cheese Factory is the Tillamook County Creamery Association's original cheese production facility. The Tillamook Cheese Factory also serves as a Visitor Center and hosts over 1 million tourists each year. Visitors can learn about the cheese-making process, cheese-packaging process, and the ice cream-making process from a viewing gallery over the main production floor. Tours are self-guided and self-paced, and are augmented by video presentations and interactive kiosks.[18] Tours inside the actual cheese-processing area of the plant were discontinued in 1967 due to health and safety regulations.[19] The Tillamook County Fair is world-famous for the annual Pig-N-Ford race where contestants have to catch a pig and race stripped Model T Fords around an oval track with the pig under one arm. Education [edit]Tillamook is served by the Tillamook School District. The city is home to seven schools and one college. Tillamook High School, Tillamook Junior High School, Wilson River School (Alternate Education), Trask River High School, East Elementary School, South Prairie Elementary School, Liberty Elementary School, and it contains the Tillamook Bay Community College. Tillamook High School (home of the Cheesemakers) won the OSAA 4A State Football Championship in 1993, the OSAA 4A State Men's Championship in 1980, and the OSAA 4A State Women's Championship in 1980. Media [edit]Tillamook's weekly newspaper is the Headlight-Herald. The city has three radio stations. KTIL-FM is a local radio station playing country. With a unique morning show and an interview section from 9:30–10:00 titled \"Tillamook Today\", which interviews local officials, business owners, and other individuals discussing what is currently going on within the county.[20] KTIL (AM) broadcasts oldies. Originally, it operated as a talk radio station. In addition to the oldies, sporting events are broadcast.[21] KDEP-FM used to broadcast classic rock, but has since transitioned to modern music.[22] Several media personalities got their starts on KTIL. The most notable was nationally syndicated conservative talk host Lars Larson, who received his first job at the age of 16 on the station.[23] Trivia [edit]American technology company Intel named one of their notebook processor modules after Tillamook. Transportation [edit]Notable people [edit]- Peggy Caserta (1940–2024), businesswoman and memoirist[24] - Jerry Kilgore (born 1964), country singer[25] - Lars Larson (born 1959), conservative talk radio show host[26] - Elaine Hopson (born 1939), State representative[27] - Bridget Marquardt (born 1973), actress and model[28] - Jacob Young (born 1979), soap opera actor[29] References [edit]- ^ \"ArcGIS REST Services Directory\". United States Census Bureau. Retrieved October 12, 2022. - ^ a b U.S. Geological Survey Geographic Names Information System: Tillamook, Oregon - ^ a b \"Census Population API\". United States Census Bureau. Retrieved October 12, 2022. - ^ a b c d e f g h \"U.S. Census website\". United States Census Bureau. Retrieved December 21, 2012. - ^ Boas, Franz (1898). \"Traditions of the Tillamook Indians\". The Journal of American Folklore. 11 (40): 23–38. doi:10.2307/533608. JSTOR 533608. - ^ \"Tillamook History\". City of Tillamook. Retrieved June 19, 2021. - ^ \"Tillamook ads page\" (PDF). oregonnews.uoregon.edu. - ^ \"Welcome - OHS Digital Collections\". Archived from the original on June 10, 2017. Retrieved December 7, 2025. - ^ \"US Gazetteer files 2010\". United States Census Bureau. Archived from the original on January 25, 2012. Retrieved December 21, 2012. - ^ \"NowData – NOAA Online Weather Data\". National Oceanic and Atmospheric Administration. Retrieved July 20, 2012. - ^ \"U.S. Climate Normals Quick Access – Station: Tillamook, OR\". National Oceanic and Atmospheric Administration. Retrieved December 30, 2022. - ^ \"Tillamook city, Oregon Files\". United States Census Bureau. Retrieved August 27, 2021. - ^ a b c \"2020 Decennial Census Demographic Profile (DP1)\". United States Census Bureau. 2021. Retrieved January 30, 2026. - ^ a b \"2020 Decennial Census Redistricting Data (Public Law 94-171)\". United States Census Bureau. 2021. Retrieved January 30, 2026. - ^ \"2020 Decennial Census Demographic and Housing Characteristics (DHC)\". United States Census Bureau. 2023. Retrieved January 30, 2026. - ^ \"Oregon Travel News\" (PDF). Oregon Tourism Commission. March 2003. p. 7. Archived from the original (PDF) on March 14, 2006. Retrieved September 9, 2010. - ^ Rice, Phyllis. \"Hangar B History\". Tillamook County Pioneer. - ^ Catherine Crawford (October 20, 2020). \"Savoring Tillamook's Cheese and Coastal Beauty\". 52perfectdays.com. - ^ Tillamook. \"Error Page\". Archived from the original on January 18, 2011. - ^ \"KTIL 95.9FM | Tillamook Radio\". www.tillamookradio.com. - ^ \"Home\". www.tillamookradio.com. - ^ \"KDEP 105.5FM | Tillamook Radio\". www.tillamookradio.com. - ^ \"About Lars\". - ^ Evans, Greg (November 25, 2024). \"Peggy Caserta Dies: Janis Joplin's Lover Whose Groundbreaking 1973 Tell-All Memoir Presented Rock Icon Through Queer Gaze Was 84\". Deadline. Retrieved December 1, 2024. - ^ Moser, Sayde (September 13, 2013). \"Country music singer/songwriter Jerry Kilgore returns to his hometown Sept. 21\". Tillamook Headlight-Herald. Retrieved June 19, 2021. - ^ \"About Lars\". LarsLarson.com. Archived from the original on July 21, 2013. Retrieved July 4, 2013. - ^ \"LegislatorsChronological - NA\". www.oregonlegislature.gov. Retrieved March 10, 2025. - ^ \"Biography\". Bridget Marquardt Blog. BridgetMarquardt .com. Retrieved December 3, 2010. - ^ Ho, Sally (July 13, 2008). \"Babies stole the show at county fair\". Statesman Journal. Salem, Oregon. p. C1. Actor Jacob Young served as the sole male judge, among five female judges. After the contest, Young spoke to a crowd of 100 about growing up in the Northwest in Tillamook, and playing J.R. Chandler on the soap opera All My Children."
}