{
  "url": "https://mb.srb2.org/addons/x-sonic.7372/",
  "title": "X Sonic | SRB2 Message Board",
  "text": "- What permissions do you give others to modify and/or maintain your submission? - Modify: ASK ME - Maintain: NO - Others must ask me for permission before modifying my submission or use it in their own work, and I reserve the right to say no for any reason. No, others may not maintain my submission, even in my absence. X Sonic, the fastest thing alive! Sonic the Hedgehog from the 2000s anime, Sonic X. Sonic zigs and zags, soars across skies, and spins to win! His full potential unlocks with mastery, and once mastered, he's a powerhouse! Use X Sonic's abilities to zip through tight corners, run up walls, and spin your enemies into scrap! Speaking of abilities... Sonic the Hedgehog from the 2000s anime, Sonic X. Sonic zigs and zags, soars across skies, and spins to win! His full potential unlocks with mastery, and once mastered, he's a powerhouse! Use X Sonic's abilities to zip through tight corners, run up walls, and spin your enemies into scrap! Speaking of abilities... - X Sonic can enter a Taunt Stance by pressing Tossflag. During the Taunt Stance, you can press directions and several buttons to do taunts! Pressing Jump or Custom 1 exits the Taunt Stance. - X Sonic Menu: Hold down custom 3 to open the \"Context Menu\" there you can find out how to open the custom X Sonic menu and transform into Super Sonic! - Pressing Custom 3 detonates Armageddon Shields and Whirlwind Shields. - You can press the directional keys for various taunts. - You can hold SPIN to make the directional keys do \"angry\" taunts instead. - You can hold SPIN and mash JUMP to charge up a (weak) Spindash. - You can press CUSTOM1 or JUMP to exit Taunt Stance. - All other buttons are unique taunts! Try messing around! - Custom Hud: Toggles X Sonic's custom HUD, on or off. - SP Color: Your singleplayer color! You can select your singleplayer color by pressing left or right to switch. - Sonic Voice: Toggles X Sonic's voice lines, on or off. - Tutorials (ALL/AIMLINE-ONLY/NONE): Toggles X Sonic's on-screen tutorials. - Ring Burst SFX (ORIGINAL/4KIDS): Toggles the Ring Burst sound effects used between the original Japanese verison, and the 4Kids sounds. - CoOp PVP: Admin command that enables/disables players getting kicked. - Accessibility (NORMAL/NOQUAKES/NOFLASHES/BOTH): Halts bothersome visuals. - Memory Leak Fix: Temporary command that turns off most rollangle actions. LIST OF COMMANDS ADMIN COMMANDS SUPER SONIC TENKAICHI STT: If nothing is typed in besides SST, shows all values pertaining to Super Sonic Tenkaichi. The current possible values are: - XSONICHUD: Swaps X Sonic's custom HUD without invoking the menu. - RESETXSONICSAVE: Deletes your X Sonic save file. - RESETXSONICSAVE EXCEPTEMERALDS: Deletes your X Sonic save...except for the Fake Emeralds progress. - RESETXSONICSAVE ONLYEMERALDS: Deletes only Fake Emeralds progress. ADMIN COMMANDS - FIXROLLANGLELEAK: Turns Stupid Memory Leak Fix on. Exists mostly for Dedicated Servers. - DELETEXEMERALDS: Deletes all Chaos Emeralds, doesn't alter save file. - EGGFESTIVAL: Spawns Planet Eggs everywhere and deletes Fake Emeralds when turned on. SUPER SONIC TENKAICHI STT: If nothing is typed in besides SST, shows all values pertaining to Super Sonic Tenkaichi. The current possible values are: - ON - OFF - HEALTHREGEN - HIGHTENSION - FREEFORALL - BlueBlur - Spriter - GoldenShine - Gameplay designer/scripter - Metalwario64 - Spriter X Sonic Release Trailer"
}