{
  "url": "https://forums.qrz.com/index.php?threads/call-sign-not-recognized.894834/",
  "title": "Call Sign Not Recognized | QRZ Forums",
  "text": "Hello Everyone, I am brand new to amatuer radio, and just received my call sign this morning from the FCC. When I registered for my QRZ account this morning, it says that I am not a registered ham and that my call sign was not in the QRZ database. Do I just need to wait another day for the database to update because my call sign is so new? My call sign is KK7QFL, and I have verified that my call sign is appearing in the ULS. Congrats on the new license! Just give it a day or two for your info to auto-populate into QRZ from the FCC ULS feed. Sometimes it takes a few days Dave W7UUU You're good to go now. Let us know via PM (we call it Conversation) if you need anything. Moderators are here to help. Welcome and thank you for electing the Premium Subscription. Enjoy! Congratulations and welcome to the ranks, OB! Couldn't help but notice you dodged a big one with your call sign. There was a recent thread regarding \"QLF\". I wish you a lot of enjoyment with Amateur Radio. I'm having the same issue. I got my call sign from the FCC this morning. I'm not sure how quick the process QRZ takes to approve my call sign. My call sign is KJ5EBC. Any help would be appreciative. 73, Larry That's correct. QRZ is a ham radio site. I'm sure there are GMRS and probably FRS sites out there that have a database for those services but not here Dave W7UUU I'm hesitant to even try to make any more contacts until my call sign shows up on QRZ, it seems to be the go-to search on initial contact to verify a call sign. I've already been questioned on the couple I did make on why me call sign is not showing in QRZ. Will people even confirm the contact a few days later when I can access my logbook and enter the information? I really appreciate the site and the work that goes into maintaining it. David KJ5FKC There is a database conflict caused by manually entering a USA callsign. To resolve this, please log out of QRZ on all your devices and then log back in on your computer using the same password. This will give you full access to your account and Logbook. Thanks, tried just now. Seems blocked until my call sign is recognized? It could be just operator error also... ME! Are you in Kerrville, TX? If so, your information has not yet been forwarded to QRZ by the FCC ULS. We expect to receive that later today or by Monday. You can check by entering your callsign in the Callsign Lookup Search box at the top of this and most other QRZ pages. Do the log out/log back in routine once it appears there."
}