{
  "url": "https://english.stackexchange.com/questions/299167/should-ya-have-an-apostrophe-doin-etc",
  "title": "punctuation - Should \"ya\" have an apostrophe? \"Doin\"? Etc - English Language & Usage Stack Exchange",
  "text": "\"How ya doin?\" v. \"How ya' doin'?\" and so on. There's... a debate. \"How ya doin?\" v. \"How ya' doin'?\" and so on. There's... a debate. I use an apostrophe to indicate the place where letters have been omitted. What'll I do (' = wi/sha) I'd say (' = woul/shoul/coul) How ya doin' (' = g) Ya is an alternative form of 'you' (- regional or colloq. = you pron.(OED)) Since there are no letters missing in 'ya' there is no apostrophe. It doesn't make sense to put an apostrophe after \"ya\", because no letters have been omitted. And that's what apostrophe indicates — it isn't a general clue that a word is shortened in some way. In \"ya\", the \"ou\" vowel has been replaced with \"a\". We don't have punctuation to indicate that, so we just write it. This is also generally the case where a replacement slang/informal word is missing letters, but others have changed. When this happens, we usually just transcribe the sounds rather than using an apostrophe. For example, we write \"gimme\" for the hurried expression which means \"give me\". We don't write \"gi'me\", even though that might make logical sense. And, we write \"gonna\" for \"going to\", rather than.... \"go'na\", I guess. (Yeah, not that.) Nowhere, you're informal and/or in a hurry so adding apostrophes on proper places defeats the purpose in my opinion (unless there's some other purpose like writing a book or something). disclaimer: now I'm not native speaker and this is not an advice about grammatical correctness I would suggest that at least in some dialects, the phrase \"are you\" is (informally) spoken as something between \"ee-ah\" and \"eh-ya\", which is distinct from \"ya\" meaning \"you\"; I would suggest 'ya (with the apostrophe) as an orthography for shortened form of \"are you\", since any other notation for that initial vowel sound would be apt to cause confusion. In many cases, context would distinguish between the usages even without a difference in spelling, but I would regard the following as different questions, with somewhat different pronunciations: The former question would be asking whether someone is confused about their location; the latter would ask whether they had been vanquished. I would thus notate the question How 'ya doin' with the apostrophe as shown, pronounced as \"Howie adieuing\"; if ya were used to simply mean \"you\", as in \"I don't know how ya do it\", I would omit the apostrophe. ya \" can replace a variety of linking verbs including \"do\", and in many questions the word \"do\" is grammatically optional but affects meaning slightly, so Ya know? or 'Ya know? would both work [though they are pronounced differently]. Note that the \"ee-ah\" pronunciation doesn't work in places where no linking verb would fit, e.g. with past-tense verb forms which can't be used as participles like Ya broke it ."
}