{
  "url": "https://culturalindia.net/indian-history/akbar.html",
  "title": "Akbar the Great Biography - Facts, Life History of The Mughal Emperor",
  "text": "Full Name: Abu'l-Fath Jalal ud-din Muhammad Akbar Dynasty: Timurid; Mughal Predecessor: Humayun Successor: Jahangir Coronation: February 14, 1556 Reign: February 14, 1556 – October 27, 1605 Date of Birth: October 15, 1542 Parents: Humayun (Father) and Hamida Banu Begum (Mother) Religion: Islam (Sunni); Din-i-Ilahi Spouse: 36 chief wives and 3 chief consorts - Ruqaiya Sultan Begum, Heera Kunwari and Salima Sultan Begum Children: Hassan, Hussain, Jahangir, Murad, Daniyal, Aram Banu Begum, Shakr-un-Nissa Begum, Khanum Sultan Begum. Biography: Akbarnama; Ain-i-Akbari Mausoleum: Sikandra, Agra Jalaluddin Muhammad Akbar, more famously known as Akbar the Great, was the third emperor of the Mughal Empire, after Babur and Humayun. He was the son of Nasiruddin Humayun and succeeded him as the emperor in the year 1556, at the tender age of just 13. Succeeding his father Humayun at a critical stage, he slowly enlarged the extent of the Mughal Empire to include almost all of the Indian sub-continent. He extended his power and influence over the entire country due to his military, political, cultural, and economic dominance. He established a centralised system of administration and adopted a policy of marriage alliance and diplomacy. With his religious policies, he won the support of his non-Muslim subjects as well. He was one of the greatest emperors of the Mughal dynasty and extended his patronage to art and culture. Being fond of literature, he extended support to literature in several languages. Akbar, thus, laid the foundations for a multicultural empire during his reign. Early Life & Childhood Akbar was born as Abu'l-Fath Jalal ud-din Muhammad at the Umerkot fort in Sind on October 15, 1542. His father Humayun, the second emperor of the Mughal dynasty was in flight after his defeat in the battle of Kanauj (in May 1540) at the hands of Sher Shah Suri. He and his wife Hamida Banu Begum, who was pregnant at that time, was granted refuge by the Hindu ruler Rana Prasad. As Humayun was in exile and had to move constantly, Akbar was brought up at the household of his paternal uncles, Kamran Mirza and Aksari Mirza. Growing up he learnt how to hunt and fight using various weapons, shaping up to be the great warrior who would be the greatest emperor of India. He never learned to read and write during his childhood, but that did not diminish his thirst for knowledge. He would often ask to be read about art and religion. In 1555, Humayun recaptured Delhi with the military support of the Persian ruler Shah Tahmasp I. Humayun met his untimely demise soon after he reclaimed his throne after an accident. Akbar was 13 years old at that time and Humayun’s trusted general Bairam Khan took up the post of Regent for the young Emperor. Akbar succeeded Humayun on February 14, 1556 in Kalanaur (Punjab) and was proclaimed ‘Shahanshah’. Bairam Khan ruled on behalf of the young Emperor till he came of age. Akbar married his cousin Ruqaiya Sultan Begum, daughter of his paternal uncle Hindal Mirza, in November 1551. Ruqaiya became his chief consort after he ascended the throne. Image Credit: historydiscussion.net Quest for Power: Second Battle of Panipat At the time of his ascent to the Mughal throne, Akbar’s empire encompassed Kabul, Kandahar, Delhi and parts of Punjab. But the Afghan Sultan Mohammad Adil Shah of Chunar had designs on the throne of India and planned to wage war against the Mughals. His Hindu general Samrat Hem Chandra Vikramaditya or Hemu in short, led the Afghan army to capture Agra and Delhi soon after Humayun’s death in 1556. The Mughal Army faced a humiliating defeat and they soon receded with their leader, Commander Tardi Baig absconding. Hemu ascended the throne on October 7, 1556 and established Hindu rule in North India after 350 years of Muslim Imperialism. On the direction of his regent Bairam Khan, Akbar declared his intentions to reclaim his rights to the throne at Delhi. The Mughal forces moved to Panipat through Thaneshwar and faced Hemu’s army on November 5, 1556. Hemu’s army was much larger in size than of that of Akbar’s with 30,000 horsemen and 1500 war elephants and he had the support of native Hindu and Afghan rulers who considered the Mughals as outsiders. Bairam Khan led the Mughal army from the back and placed skilled generals on the front, left and right flanks. Young Akbar was kept at a safe distance by his regent. Initially Hemu’s army was in a better position, but a sudden change in tactics by Bairam Khan and another general Ali Quli Khan, managed to overpower the enemy army. Hemu was on an elephant when he was struck by an arrow to his eye and his elephant driver took his injured master away from the battlefield. Mughal soldiers pursued Hemu, captured him and brought him before Akbar. When asked to behead the enemy leader, Akbar could not do this and Bairam Khan executed Hemu on his behalf, thus establishing victory of the Mughals conclusively. Crushing the Opposition The Second battle of Panipat marked the beginning of the Glory days for the Mughal reign in India. Akbar sought out to end Afghan sovereignties that might be claimant for the throne in Delhi. Hemu’s relatives were captured and imprisoned by Bairam Khan. Sher Shah’s successor, Sikander Shah Sur was driven out from North India to Bihar and was subsequently compelled to surrender in 1557. Another Afghan contender to the throne, Muhammed Adil was killed in a battle the same year. Others were compelled to flee Delhi and neighbouring regions to seek refuge in other states. Image Credit: YouTube Military Expansions Akbar dedicated the first decade of his rule towards expanding his empire. Under the regency of Bairam Khan, Ajmer, Malwa and Garhkatanga were annexed into the Mughal territories. He also captured Lahore and Multan, major centers of Punjab. Ajmer brought him the doorway to Rajputana. He also claimed the Gwalior fort from the Sur Rulers. He conquered Gondwana in 1564 from the minor ruler Raja Vir Narayan. Akbar’s forces met a formidable opponent in the young King’s mother, Rani Durgavati, a Rajput warrior queen. On being defeated Durgavati committed suicide while Vir Narayan was slain during the capture of Chauragarh fortress. Having consolidated his supremacy over most of north and central India, Akbar turned his attention towards Rajputana, which presented a formidable threat to his supremacy. He had already established his rule over Ajmer and Nagor. Beginning in 1561, Akbar started his quest to conquer Rajputana. He employed force as well as diplomatic tactics to make the Rajput rulers submit to his Rule. Most accepted his sovereignty except the Sisodia ruler of Mewar, Udai Singh. This presented a problem for Akbar on his designs to establish unquestioned supremacy over the region. In 1567, Akbar attacked the Chittorgarh fort in Mewar that represented a key strategic importance towards establishing rule in Rajputana. Udai Singh’s chiefs Jaimal and Patta held off the Mughal forces for four months in 1568. Udai Singh was banished to the Hills of Mewar. Other Rajput states like Ranthambore fell in the face of Mughal forces, but Rana Prapat, Udai Singh’s son, put up a formidable resistance to Akbar’s expansion of power. He was the last of the Rajput defenders and fought till his heroic end in the Battle of Haldighati in 1576. Following his victory over the Rajputana, Akbar brought in Gujarat (1584), Kabul (1585), Kashmir (1586-87), Sindh (1591), Bengal (1592) and Kandahar (1595) within the Mughal territory. The Mughal army led by General Mir Mausam also conquered parts of Baluchistan around Quetta and Makran by 1595. In 1593, Akbar set out to conquer Deccan territories. He faced opposition to his authority in Ahmadnagar and attacked the Deccan state in 1595. Chand Bibi, the regent queen offered formidable opposition, but was forced to concede defeat ultimately having to give up Berar. By 1600, Akbar had captured Burhanpur, Asirgarh Fort and Khandesh. Image Credit: nation.com.pk Administration After consolidating the empire, Akbar concentrated on establishing a stable and subject-friendly administration at the center to govern his vast empire. The principles of Akbar’s administration were based on moral as well as material welfare of his subjects. He brought about several changes in existing policies to establish an environment of uniform opportunities to people irrespective of religion. The Emperor himself was the supreme governor of the empire. He retained ultimate judicial, legislative and administrative power above anyone else. He was assisted in efficient governance by several ministers – Vakil, chief adviser to the King over all matters; Diwan, minister in charge of finance; Sadar-i-sadur, religious advisor to the King; Mir Bakshi, the one who maintained all records; Daroga-i-Dak Chowki and Muhtasib were appointed to oversee proper enforcement of law as well as the postal department. The entire empire was divided into 15 Subas, each province being governed by a Subadar along with other regional post mirroring that in the center. The Subas were divided into Sarkars which were further divided into Parganas. The head of the Sarkar was a Faujdar and that of a Pargana was a Shikdar. Echa Pargana consisted of several villages which were governed by a Muqaddam, a Patwari and a Chowkidar, along with a panchayat. He introduced the Mansabdari system to effectively organize the Military. The Mansabdars were responsible for maintaining discipline and impart training to the soldiers. There were 33 ranks of Mansabdars with 10,000 to 10 soldiers under their command according to rank. Akbar also introduced the custom of taking roll of the soldiers and branding of horses. Akbar’s military consisted of several division viz. cavalry, infantry, elephants, artillery and navy. The emperor maintained ultimate control over the military and excelled in the ability to enforce discipline among his troops. Land revenue was the chief source of income for the Mughal Government and Akbar introduced several reforms in the revenue department. The land was divided into four classes according to their productivity - Polaj, Parauti, Chachar and Banjar. Bigha was the unit of land measurement and land revenue was paid either in cash or in kind. Akbar on the advice of his Finance Minister Todar Mall, introduced loans against small interest to the farmers and he also granted remission of revenues in case of natural calamities like draughts or floods. He also issued special instruction to the revenue collectors to be friendly with the farmers. All these reforms greatly increased productivity and revenue of the Mughal Empire, leading to prosperous subjects with abundance of food. Akbar introduced reforms in judicial system as well and for the first time, Hindu customs and laws were referred to in case of Hindu subjects. The Emperor was the highest authority in Law and the power to give capital punishment rested solely with him. The major social reform introduced by Akbar was the abolition of the Pilgrimage Tax for Hindus in 1563 as well as the Jazia tax imposed on the Hindu subjects. He discouraged child marriage and encouraged widow remarriage. Diplomacy Akbar was probably the first Islamic ruler in India who sought stable political alliances through matrimony. He married several Hindu Princess including Jodha Bai, from the house of Jaipur, Heer Kunwari from the house of Amber, and princess from the houses of Jaisalmer and Bikaner. He strengthened the alliances by welcoming male relatives of his wives as part of his court and bestowing them with important roles in his administration. Political significance of these alliances was far-reaching for the Mughal Empire in securing strong loyalty of these dynasties. This practice brought the Hindu and Muslim nobilities in close contact securing a better secular environment for the empire. The Rajput alliances became strongest allies of Akbar’s army which proved crucial in many of his subsequent conquests like that in Gujarat in 1572. Akbar and the Uzbeks of Central Asia entered into a treaty of mutual respect under which the Mughals were not to interfere in Badakshan and Balkh regions and the Uzbeks would stay away from Kandahar and Kabul. His attempt to make alliance with the newly arrived Portuguese tradesman proved futile with the Portuguese refuting his friendly advances. Another contributing factor was Emperor Akbar’s relations with the Ottoman Empire. He was in regular correspondence with Ottoman Sultan Suleiman the Magnificent. His contingent of pilgrims to Mecca and Medina were warmly welcomed by the Ottoman Sultan and the Mughal Ottoman trade flourished during his rule. Akbar also continued to maintain excellent diplomatic relationship with the Safavid rulers of Persia, which dated back to his father’s days with Shah Tahmasp I lending his military support to Humayun for recapturing Delhi. Akbar’s Religious Policy Akbar’s rule was marked by wide religious tolerance and liberal outlook. Akber was profoundly religious himself, yet he never sought to enforce his own religious views on anyone; be it prisoners of war, or Hindu wives or the common people in his kingdom. He gave great importance to choice and abolished discriminatory taxes based on religion. He encouraged building of temples and even churches his empire. Out of reverence for the Hindu members of the Royal Family he banned the cooking of beef in the kitchens. Akbar became a follower of the great Sufi mystic Sheikh Moinuddin Chishti and made several pilgrimages to his shrine at Ajmer. He craved religious unity of his people and with that vision founded the sect Din-i-Ilahi (Faith of the Divine). Din-i-Ilahi was in essence an ethical system that dictated the preferred way of life discarding qualities like lust, slander and pride. It borrowed heavily from existing religions extracting the best philosophies and forming an amalgamation of virtues to live by. Architecture and Culture Akbar commissioned the building of several forts and mausoleums during his reign and established a distinct architectural style that has been dubbed as Mughal architecture by connoisseurs. Among the architectural marvels commissioned during his rule are the Agra Fort (1565–1574), the town of Fatehpur Sikri (1569–1574) with its beautiful Jami Masjid and Buland Darwaza, Humayun’s Tomb (1565-1572), Ajmer Fort (1563-1573), Lahore Fort (1586-1618) and Allahabad Fort (1583-1584). Akbar was a great patron of art and culture. Although he himself could not read and write, he would appoint people who read to him various topics of art, history, philosophy and religion. He appreciated intellectual discourse and offered his patronage to several extraordinarily talented people whom he invited to his court. Together these individuals were referred to as the Nava Ratnas or the Nine Gems. They were Abul Fazel, Faizi, Mian Tansen, Birbal, Raja Todar Mal, Raja Man Singh, Abdul Rahim Khan-I-Khana , Fakir Aziao-Din and Mullah Do Piaza. They came from various backgrounds and were revered by the emperor for their special talents. Death of Akbar In 1605, at the age of 63, Akbar fell ill with a serious case of dysentery. He never recovered from it and after three weeks of suffering, he passed away on October 27, 1605 at Fatehpur Sikri. He was buried at Sikandra, Agra."
}