{
  "url": "https://www.gradyhealth.org/ground-breaking-emergency-care-coming-to-south-fulton/",
  "title": "Ground Breaking Emergency Care Coming to South Fulton | Grady Health",
  "text": "South Fulton Emergency care Opening in Fall 2026, Grady’s new Emergency Center is more than a building – it’s our promise to be a trusted partner and to serve and support the South Fulton community with expert care. Grady’s New Emergency Center in South Fulton Grady is building a 20,000-square-foot Emergency Center in South Fulton – one of the biggest in the country. Here, we’ll treat adults and children with the same expert, compassionate care Grady is known for. Emergency Care When You Need It Most From serious emergencies to minor injuries, our team is ready. With advanced technology, experienced providers, and a patient-first approach, you’ll receive fast, personalized care when and where you need it most. Facility Highlights Our new Emergency Center in South Fulton will feature: - 16 exam rooms, including two resuscitation rooms for critical care - 4 observation rooms for extended monitoring - Advanced imaging (CT, X-ray, and ultrasound) - Spaces designed to help care teams work quickly - Comfortable, modern waiting area for loved ones - A community room for free health events and classes The new facility is an emergency room. It is not an urgent care or a primary care center. It is built to treat serious medical emergencies that need fast care. Need Non-Emergency Care? If you need non-emergency care, Grady has other options nearby. You can visit our urgent care center or primary care centers at Camp Creek, Cascade, or East Point. These locations offer care for everyday health needs, so you can get the right help when and where you need it. Building a Healthier Future for South Fulton Grady’s new Emergency Center is more than a building – it’s our promise to be a trusted partner and to serve and support the South Fulton community with expert care. Opening in Fall 2026, this 24/7 center will offer full emergency services for critical, urgent, and time-sensitive conditions – all in a convenient, community-based setting. Staffed by Grady’s emergency-trained physicians, nurses, and support teams, it brings world-class care closer to home. Why South Fulton South Fulton is growing fast, so is the need for nearby emergency care. Too often, residents face long wait times and long drives. Grady is closing that gap by making care faster and easier to reach. Our new facility will deliver: - Faster help when it matters most - Shorter wait times, better results - A team that understands your community Why Grady Grady has been a trusted name in emergency care for over 130 years. We treat more than 700,000 patients each year and are Atlanta’s only Level I trauma center. Now we’re bringing that same expert care to South Fulton – because you deserve the best care, close to home. Stay tuned for updates as we get ready to open our doors! Share Your Comments Here! We would love to hear from you! We greatly appreciate your feedback as we build this new facility. Please complete the form below to provide your comments and suggestions. Check back for our responses to your questions and comments!"
}