{
  "url": "https://thetravelfolk.com/things-to-do-in-provence-france/",
  "title": "25 Best Things to do in Provence, France (2025) - Travel Folk",
  "text": "Are you planning a trip and looking for the best things to do in Provence, France? We’re sharing all you need to know in this guide, including transportation tips, a map, and our favorite places to visit. Charming hilltop villages, vast Mediterranean landscapes, and a rugged coastline define this beautiful region in Southern France. Stretching from Avignon to Nice, Provence is renowned for its vibrant outdoor markets, aromatic lavender fields, lush vineyards, and rustic lifestyle. Provence has captured our hearts. We have spent months exploring this picturesque region in France, and we find ourselves going back every other year to uncover more hidden gems and revisiting some of our favorite spots. In this guide, we’ll introduce you to the top 25 must-visit places in Provence. Since it is unlikely to cover all these spots in one trip, we’ve also curated a list of the top 10 highlights at the end of this article. Best Things to do in Provence 1. Explore the Lavender Fields of Valensole From late June to early August, Valensole transforms into a breathtaking sea of purple. The valley and hills are blanketed in lavender fields, creating a stunning backdrop for photographers and filling the air with a sweet aroma. Visitors from around the world come to Valensole to witness this spectacular annual bloom, with July being the peak season. Expect crowds during this time. One of the prime spots for views is Lavandes Angelvin. Here, you can tour their distillery and learn more about the process of growing and harvesting lavender. We also went to this spot near Lavandes Angelvin to see both sunflower and lavender fields in bloom. The most iconic view can be found at the Abbaye de Sénanque, a beautiful 12th-century stone monastery, framed by rows of lavender. For photography, the best time for photos is during sunrise or sunset when the light is softer. We found that visiting mid-day was too bright, and it was difficult to capture the rich colors of the fields. For a look at different driving routes and other lavender fields to visit, the Les Routes de la Lavande website provides a detailed list of locations. 2. Enjoy the Markets of Aix-en-Provence Aix-en-Provence is one of the prettiest cities in southern France. With its lively market, quaint streets, stone fountains, and beautiful squares, Aix epitomizes Provencal charm. We have been to Aix many times, and we always to try to visit on a market day. Every Tuesday, Thursday, and Saturday mornings, the streets transform into a bustling marketplace. Here, you can find everything from fresh produce to soaps, woven bags, hats, and even take-away meals. It’s truly an experience not to be missed. In addition to its market, Aix also has some fantastic museums. A highlight is Cezanne’s Atelier, where you can step into the world of the famed French artist Paul Cezanne at his home and studio. Other museums worth visiting include Musée Granet, Fondation Vasarely, and the Hotel de Caumont. 3. Explore the Historic Village of Gordes Gordes is one of the most picturesque and iconic villages in Provence, France. Its stone buildings perched atop a rocky hill make the village look like it’s straight out of a fairytale. Take in the stunning panoramic views from this viewpoint, especially at sunset when the village lights up! While Gordes is indeed scenic, it is quite small, and you can explore the entire village in under an hour. We recommend making reservations at one of the restaurants in the Bastide de Gordes. Not only is the food incredible but the views of the Luberon Valley are equally as amazing from their dining terrace. 4. Experience the Ocher Cliffs of Roussillon Roussillon, located in the Luberon Valley, is one of the “Most Beautiful Villages in France.” The town is instantly recognizable by its striking red and orange-hued buildings, which reflect the colors of the famous ochre cliffs on which it is built. Historically, between the 18th to the early 20th century, Roussillon was an industrial town where large deposits of ochre were mined. Today, these mines are no longer active, but you can still explore this beautiful landscape. Walk along the “Sentiers des Ocres” and explore the stunning ochre cliffs for yourself. The trails are relatively easy and can be completed in 30-60 minutes. 5. Spend the day exploring the Luberon villages The Luberon Valley is a beautiful region famed for its lavender fields, vineyards, and stone villages. You need at least 2 days to explore it all, and if possible, we recommend spending a night here. In addition to Gordes, Rousillon, and L’Isle-sur-la-Sorge, which we have independently highlighted, some of our favorite villages include Bonnieux, Lacoste, Apt, Ansouis, Cucuron, Menerbes, and Oppede-Le-Vieux. Most of the villages are quite small, and you can explore each one in about 30 minutes to an hour. If you only have one day, we suggest selecting your top five villages and planning a day-long road trip throughout the valley. TOUR OPTION: Book this half-day tour of the Luberon Villages from Aix-en-Provence. 6. Visit the Historical City of Avignon Avignon is a beautiful medieval city that has been nicknamed the “Gateway to Provence.” It’s central location makes it perfect for day trips around the region. The city is most famous for the Palais des Papes, the world’s largest Gothic palace, which served as the papal residency for a century. Additionally, you can visit the remnants of the Pont d’Avignon, the famous “broken” bridge. During the month of July, Avignon hosts one of the best theater festivals in France called the Festival d’Avignon. The energy during in the city during the festival is incredible. Visitors can watch live performances, listen to discussion panels, and a variety of other productions. READ ALSO: 17 EASY DAY TRIPS FROM AVIGNON 7. Hike at Calanques National Park Stretching 20km along the Mediterranean coast, from the port of Marseille to the fishing village of Cassis, is Calanques National Park. This spectacular coastline is made up of steep limestone cliffs, fjord-like inlets, and white pebbled beaches. The best way to experience the national park is by hiking from Cassis, starting at the Calanque de Port Miou and ending at Calanque d’en Vau. This 8km round-trip hike typically takes around 3.5-4 hours to complete. Along the way, stop for a swim at the Calanque de Port Pin and take in the breathtaking views overlooking the Calanque d’en Vau, your final destination. The crystal clear, azure waters are absolutely stunning. Alternatively, boat tours are available from either Cassis or Marseille. Whichever option you choose, Calanques National Park should be at the top of your Provence bucket list. 8. Discover the Roman Ruins in Arles Set along the banks of the Rhone river, Arles is a wonderful city steeped in ancient history. Explore the city’s rich Roman heritage, featuring ancient ruins like the Roman amphitheater, Roman Theater, the Alyscamps, and the Baths of Constantine. In total, there are 6 Roman monuments in Arles that you can visit. For art enthusiasts, you can follow in the footsteps of Vincent Van Gogh, who spent 14 months in Arles, and visit some of the sights he painted during his time here. To see these sights, pick up a map from the tourist office and follow along the self-guided Van Gogh walking tour. 9. Stroll Through the Antique Shops of L’Isle-sur-la-Sorgue L’Isle-sur-la-Sorgue is known for its antique shops and market. Every Sunday morning, vendors set up their stalls along the canals and throughout the small streets, selling a variety of antiques, produce, and local goods. Additionally, there are many permanent antique shops throughout the town where you can shop for furniture, pottery, lamps, and so much more any time of the week. Tip: Grab a drink at the historic Café de France, a beautiful cafe in the heart of town. 10. Experience the morning market in Saint-Rémy-de-Provence Saint-Rémy-de-Provence is famous for two things: its lively weekly market and its association with Vincent Van Gogh. Van Gogh, the esteemed impressionist artist, spent a year in Saint-Rémy at the Saint-Paul de Mausole psychiatric hospital. During his time here, he was inspired by the rustic landscapes and painted some of his most recognizable masterpieces, such as The Starry Night. You can visit Saint-Paul de Mausole to see the room where Van Gogh stayed and also visit some of the places he painted. The Wednesday morning market in Saint-Rémy-de-Provence is one of the most visited and well-known markets in Provence. We love coming to this market to shop for local goods, such as woven basket bags, French soap, torchons (tea towls), and of course, fresh produce. 11. Visit the ancient city Les Baux-de-Provence Step into ancient history at Les Baux-de-Provence, located on a plateau in the Alpilles Mountains. This historic village dates back to around 6,000 BC and is fascinating to explore. At the very top of the village, you can visit the Chateau des Baux, a fortress dating back to the Middle Ages with sweeping views of the lush valley below. Furthermore, take some time to wander through the cobblestone streets and explore some of the other sights and shops. Just a short walk from the village, you’ll find the Carrières de Lumières. Housed inside of a former stone quarry, this unique venue hosts themed 40-minute light shows. The exhibition calendar changes throughout the year, so make sure to check the schedule in advance. 12. Canoe or Kayak in the Gorges du Verdon The Gorges du Verdon, or Verdon Gorge in English, is one of the most beautiful canyons in all of Europe. The gorge’s bright blue river set against the backdrop of dramatic cliffs is a spectacular scene. The best way to experience this natural wonder is to rent a kayak or canoe for a few hours and paddle through the stunning turquoise waters. The best time to visit is during the summer, between June and August, when the temperatures are warm enough to swim in the river. However, April, May, and September are also good months to go if you don’t mind cooler temperatures and want to avoid the crowds. TOUR OPTION: Book this full-day tour to the Gorges du Verdon from Nice. 13. Tour the Vineyards of Châteauneuf-du-Pape Châteauneuf-du-Pape is one of France’s most renowned wine regions. With over 8,000 acres of vineyards, this wine appellation is known for its robust red wines and Grenache varietals. For the most immersive experience, book a guided tour with an expert-led guide who will take you to some of the finest vineyards in the region for a variety of tastings. - Châteauneuf-du-Pape Wine Tour | This full-day wine tour takes you to several wineries in the region for tastings and to learn about the wine-making process. - Full-Day Châteauneuf-du-Pape Wine Tour | This tour includes a 2-course lunch and several wine tastings at local wineries. - Provence Cru Wine Tour | This half-day tour takes you to a few wineries to enjoy 3 separate wine tastings. 14. Explore Camargue National Park Camargue National Park is a remarkable area known for its vast and wild landscapes. Located between the Mediterranean sea and the Rhône river delta, this diverse region is home to salt flats, marshlands, and endless rugged terrain. A visit to the Ornithological Park of Pont de Gau is essential if you want to see the famous wild pink flamingoes. The park has several boardwalks that allow you to walk around and get up close to these stunning birds. Beyond the flamingoes, the Camargue is renowned for its iconic white horses, known as Camargue horses. These majestic animals have roamed the lands here for thousands of years and are a sight to behold. Tip: Book a Camargue horseback riding experience to explore the natural beauty of this national park up close. 15. Visit the Pont du Gard The Pont du Gard is not only one of the most visited ancient monuments in France but also a marvel of Roman engineering. Constructed in the 1st century AD, this grand aqueduct spans the Gardon River, making it one of the most unique sights in Provence. We have been here many times and usually make a half-day trip out of it, bringing a picnic and our swimsuits to swim in the river beneath the bridge. For a more adventurous experience, you can book a half or full-day kayaking tour that takes you down the river. If your time is limited, a 1-2 hour visit to the Pont du Gard is plenty of time to see it all. 16. Visit the beautiful Port Town in Marseille Marseille is the second largest city in France and is also the capital of Provence. Explore the city’s vibrant port, filled with boats and lined with bustling cafes, for a taste of Mediterranean life. For the best views of the city and the sea, make your way up to the Basilica Notre-Dame de la Garde. This beautiful church stands watch over Marseille and provides breathtaking panoramic views. While in the city, we also recommend visiting one of Marseille’s museums, such as the Museum of Fine Arts or the MUCEM. 17. See the spring at Fontaine de Vaucluse Discover the source of the Sorgue River at Fontaine de Vaucluse, where the river emerges from a deep spring. Cafes line the banks of the spring, making it a lovely spot to grab a drink or lunch. Wander around the small village, visit the historical paper mill, and enjoy the natural beauty that surround it. This is an easy day trip from Avignon and can only be accessed by car. 18. Visit the Artistic Town of Saint-Paul de Vence Saint-Paul de Vence, located in between Nice and Antibes, is a charming hilltop village perched high above the Mediterranean sea. Known as a sanctuary for both artists and art lovers, this village has been a retreat for many renowned artists, including Marc Chagall. It is also famed for attracting legends like Pablo Picasso and Henri Matisse, who were frequent visitors to the historic hotel, La Colombe d’Or. Wander through the small cobblestone streets filled with boutiques, galleries, and on a clear days, amazing views of the French Riviera. Art lovers should take the time to visit a couple of the local museums. Fondation Maeght is a modern art museum and Fondation CAB, a contemporary art museum. We highly recommend reserving a table for lunch or dinner, or even booking a night at the hotel, La Colombe d’Or. The hotel’s walls are adorned with modern paintings by some of the 20th century’s most famous artists, including Miro, Braque, and Calder, making it feel like you are dining in an art gallery. 19. Wander Through the Moustiers-Sainte-Marie Located against a towering rocky cliff, Moustiers-Sainte-Marie is known for its exquisite Faïence pottery. Visit the Musée de la Faïence to view some of the most treasured collections of this type of pottery and to learn more about the village’s rich tradition of pottery making. The best way to experience Moustiers is to simply wander through the streets. Stop at some of the local ceramics shops and admire the wonderful views from up high. 20. Discover the Art of Perfume in Grasse Grasse is a lovely town on the French Riviera that is globally known as the perfume capital. It has been the heart of the fragrance industry since 17th century, attracting perfumers and perfume enthusiasts from around the world. After a stroll through Grasse, make your way to one of the perfume museums or local shops where you can learn more about the art of perfume making. You can even sign up for a workshop to build your own perfume scent. 21. Explore the Luxurious Town of Saint-Tropez Saint-Tropez is the definition of luxury. This beautiful seaside town is known for its celebrity sightings, expensive yachts, and vibrant nightlife. During our visit, we spent an afternoon indulging in some of the finest people and car watching. Yes, it’s quite the spectacle with Ferraris, Porsches, and Lamborghinis gracing the outdoor parking lots. While in Saint-Tropez, be sure to try a Tarte Tropézienne. This delightful pastry, almost constructed like a giant sandwich, is layered with brioche topped with pearl sugar and filled with cream and berries. An absolute must try! Don’t miss the lovely beaches just outside Saint-Tropez. We spent a relaxed afternoon at Pampelonne Beach, one of the rare sandy stretches along the Mediterranean coast. Whether you visit for the shopping or beaches, Saint-Tropez offers a taste of the high life on the French Riviera. 22. Enjoy a visit to Nice Nice, the iconic Riviera city along the Mediterranean, is known for its hip beaches and charming old town. Stroll along the famous Promenade des Anglais, buy some flowers from the Marche aux Fleurs, and climb up to the Belvedare du Chateau for incredible view. While there is much to do in Nice itself, it’s also a great central base as you explore some of the smaller towns nearby, such as Èze, Grasse, Saint-Tropez, Saint-Paul de Vence, and Menton. It’s also a short train ride away from Monaco. For those who love art and architecture, then a visit to both the Matisse museum and Villa Ephrussi de Rothschild is a must. 23. Discover the hilltop town of Èze High above the Mediterranean sea, perched atop a rocky outcrop, is the small village of Èze. The views from this village are spectacular – easily some of the best in the French Riviera. Wander through the medieval streets, shop at some of the local artisanal boutiques, and if you’re visiting on Sunday, you can check out the weekly market. The highlight of Èze is the Jardin Exotique, a small botanical garden with cacti from America and other exotic plants. It costs €5 per person to visit. Getting to Èze can be a bit tricky if you don’t have a car. You can take the bus from Nice to Èze (not Èze-sur-Mer), but there are limited hours on Sundays and holidays. 24. Relax at the Beaches along the French Riviera From Saint-Tropez to Menton, there’s no better way to experience the French Riviera than by spending a day in the sun at one of its beautiful beaches. Here are a few of our favorites: - Pampelonne Beach, Saint Tropez - Plage Paloma, Saint-Jean-Cap-Ferrat - Plage des Marinières, Villefranche-Sur-Mer - Plage du Bestouan, Cassis - Calanque d’en Vau, Cassis - Plage Mala, Cap d’Ail From remote beaches to beach clubs, each of these locations offers something a bit different depending on what you like! 25. Hike near Montagne Sainte-Victoire Montagne Saint-Victoire is the famous limestone mountain backdrop in many of Paul Cezanne’s paintings. You can explore this stunning landscape up close on one of many hiking trails in the area. The most popular hike is the Réserve de Saint-Victoire via Barrage de Bimont. This trail is around 4.2 miles round trip and typically takes around 2-2.5 hours to complete. If hiking isn’t your thing, you can still appreciate magnificent views of Montagne Saint-Victorie from various points around Provence. One of the best spots is from Cezanne’s Atelier in Aix-en-Provence. Map of the Best things to do in Provence This map includes the best places to visit in Provence, including small towns, major cities, and some of the prettiest beaches. To save the map to Google Maps on your phone or computer, click on the star next to the title. Once you do this, you’ll be able to find the map in your “saved maps” list on your phone. To see a list of all the items on the map, click the box with arrow on the left. To enlarge the map, click the box on the right. Top 10 best things to see in Provence Since you most likely can’t cover 25 places in a single trip, we have narrowed down our list to the top 10 places to visit in Provence below. - Explore the Luberon Valley – Gordes and Rouissillon should be at the top your list. - See the Lavender Fields of Valensole (only in the summer) - Experience the outdoor markets in Aix-en-Provence or Saint-Rémy - Hike at Calanques National Park - Visit the Historical City of Avignon - Canoe in the Gorges du Verdon - See the Pont du Gard - Spend a few days in Nice - Visit the Artistic Town of Saint-Paul de Vence - Discover the Roman Ruins in Arles When is the best time to visit Provence? Summer is the best time to go to Provence. Many festivals happen during the summer, the lavender and sunflower fields are in bloom, and the Mediterranean water is warm enough for swimming. The main downsides to visiting Provence between June and August is that prices are usually higher, and it’s very busy. Plan ahead to get your preferred accommodations because things book up quickly. If you want to avoid the crowds but still have nice weather, we recommend visiting in May and September. Spring in Provence is absolutely stunning, with the wildflowers and poppies in bloom. September is a bit slower. Many locals go on holiday in mid-September after peak season is over, so plan for some restaurant closures, particularly in the smaller villages. Winter in Provence is quiet. Some restaurants close for the off-season but most stay open. You won’t find nearly as many tourists, instead it’s a wonderful time to visit and enjoy the authentic side of Provence. How to get to Provence? If you are going to Provence from outside of France, then the best airport to fly into is Marseille. The second best is the Nice airport. From the airport you can either catch a local train to your destination or pick up a rental car. If you are already in France, then you can take one of the high-speed TGV trains from Paris to one of the major cities in the Provence region, such as Avignon, Marseille, Nice, or Aix-en-Provence. We always rent a car in Provence because it’s the easiest way to get around and it provides you with more flexibility. Plus, many of the top destinations are only accessible by car. By Train The bigger cities in Provence are all connected by train. Marseille, Aix-en-Provence, Arles, Avignon, Orange, L’Isle-Sur-La-Sorgue, and Nice all have train stations. If you only plan to see the main cities, then you can easily get around by regional and high-speed trains. However, if you want to visit the smaller villages in the Luberon Valley, or the national parks, such as the Calanques or the Verdon Gorge, you need a car to get around. You can book your train tickets either at the train station or online in advance at SNCF. We recommend downloading the SNCF app for the easiest user experience. By Car To experience the best of the Provencal countryside, we highly recommend renting a car for your trip. The roads are never too busy and as long as you have Google Maps, driving is pretty straight forward. Is there parking in most places? Yes, parking is available in all of the towns and cities. In the smaller towns and villages, there is usually a dedicated parking lot for visitors. If this is full, then you can find parking on the street most of the time. In the bigger cities, like Avignon or Aix, you’ll find free or paid parking lots available outside of the city center. On Google Maps, search for your city and then type in “parking” to the search bar. Several parking lots will show up. Choose the one closest to your hotel or to the city center. Where to rent a car? You can pick up a rental car from both the Marseille airport and Nice airport. Otherwise, you can pick one up in Avignon or Aix-en-Provence. We have rented cars from both the Marseille airport and from Avignon’s TGV train station. We always reserve our rental cars through Discover Cars, or go-to rental website for Europe. Where to stay in Provence? Provence is a vast region, and depending on your itinerary, it might be the most convenient to stay in a few different locations. If you’re looking to explore the western side of Provence, we recommend staying in our near Avignon. Aix-en-Provence is another ideal base, particularly if you’re interested in visiting the Luberon villages and some of the popular spots along the Mediterranean, such as Saint Tropez and Cassis. Its central location allows for easy day trips to these charming areas. If your focus is the French Riviera, Nice is a great central location for exploring this area. It’s within an hour’s drive or train ride to many towns, such as Grasse, Saint-Paul de Vence, and Èze. Of course, if you prefer the countryside, then there are plenty of boutique hotels and villas available to book in outside of the cities. More Information for your trip to Provence Moustiers-Sainte-Marie Quick List Stay: Le Bastide Moustiers (luxury); Do: Rent a boat at the Verdon Gorge; climb to Notre Dame in Moustiers Eat: Le Bastide Moustiers Restaurant Shop: For Faïence pottery"
}