{
  "url": "https://en.wikipedia.org/wiki/Capri",
  "title": "Capri - Wikipedia",
  "text": "Capri Capri (/ˈkæpri/ KAP-ree, US also /kəˈpriː, ˈkɑːpri/ kə-PREE, KAH-pree; Italian: [ˈkaːpri]) is an island located in the Tyrrhenian Sea off the Sorrento Peninsula, on the south side of the Gulf of Naples in the Campania region of Italy. A popular resort destination since the time of the Roman Republic, its natural beauty, historic sites, and upscale tourism have made it famous worldwide. The island is characterized by its rugged limestone landscape, sea stacks (Faraglioni), coastal grottoes including the renowned Blue Grotto, and high cliffs overlooking the sea. Notable features include the harbours of Marina Grande and Marina Piccola, the panoramic Belvedere of Tragara, the ruins of Roman imperial villas such as Villa Jovis, and the towns of Capri and Anacapri, the latter situated higher up the slopes of Monte Solaro, the island's highest point. Administratively, Capri is part of the Metropolitan City of Naples within the Campania region. The island is divided into two municipalities (comuni): Capri and Anacapri. Etymology [edit]The origin of the name Capri is uncertain. It may derive from the Ancient Greek κάπρος (kápros), meaning 'wild boar'.[2] Ancient Greek colonists from Magna Graecia were the first recorded inhabitants, calling the island Kapreai (Καπρέαι).[3] Alternatively, the name could come from the Latin capreae, meaning 'goats'.[2] Fossils of wild boars have been found on the island, supporting the Greek etymology.[citation needed] A less likely theory suggests an Etruscan origin meaning 'rocky', referencing the island's limestone terrain.[4] History [edit]Antiquity [edit]Archaeological evidence indicates human presence on Capri dating back to the Neolithic and Bronze Age. The Roman historian Suetonius recounts that when workers excavated the foundations for Emperor Augustus's villa, they discovered giant bones and stone weapons, which Augustus displayed in his residence, the Palazzo a Mare.[5] (Modern analysis suggests these may have been fossils of large extinct mammals).[6] The Roman poet Virgil, in the Aeneid, referred to the island being inhabited by Greek settlers from the Ionian Islands (the Teleboi). The geographer Strabo noted that Capri anciently had two towns, later reduced to one.[7] Emperor Augustus developed Capri as a private resort, building villas, temples, and aqueducts, and planting gardens.[8] His successor, Tiberius, constructed twelve villas on the island according to Tacitus. The most famous, Villa Jovis, is one of the best-preserved Roman villas in Italy. In AD 27, Tiberius moved permanently to Capri, governing the Roman Empire from the island until his death in AD 37.[citation needed] Later, in AD 182, Emperor Commodus exiled his sister Lucilla to Capri, where she was subsequently executed.[citation needed] Middle Ages and Modern Era [edit]After the fall of the Western Roman Empire, Capri came under the control of the Duchy of Naples. The island suffered raids by pirates and Saracens. In 866, Emperor Louis II granted the island to the Duchy of Amalfi. In 987, Pope John XV established the Diocese of Capri, initially as a suffragan to the Archdiocese of Amalfi.[9] Capri remained a diocese until 1818, when it was absorbed into the Archdiocese of Sorrento.[10] It is now listed as a titular see.[11] In 1496, King Frederick IV of Naples established administrative parity between the settlements of Capri and Anacapri. Pirate raids intensified during the 16th century; admirals Barbarossa Hayreddin Pasha and Turgut Reis captured the island for the Ottoman Empire in 1535 and 1553, respectively.[citation needed] The French antiquarian Jean-Jacques Bouchard visited in the 17th century and is considered one of the first modern tourists; his diary provides valuable insights.[citation needed] 19th Century to Present [edit]During the Napoleonic Wars, French troops occupied Capri in January 1806 but were ousted by the British in May. Britain established a naval base (a \"Second Gibraltar\") but caused damage to archaeological sites during construction. The French recaptured the island in 1808 and held it until 1815, when it was returned to the Bourbon Kingdom of Naples.[citation needed] In the 19th century, naturalist Ignazio Cerio catalogued the island's flora and fauna. His work was continued by his son, Edwin Cerio, an author and engineer known for his writings on Capri life.[citation needed] From the later 19th century, Capri became an increasingly popular resort for European artists, writers, and expatriates. It gained a reputation as a tolerant haven, attracting wealthy gay men and lesbians seeking a more open life than elsewhere in Europe.[12] Notable figures who lived or spent significant time on the island include John Ellingham Brooks, Somerset Maugham,[13] Norman Douglas,[14] Jacques d'Adelswärd-Fersen, Christian Wilhelm Allers, Emil von Behring, Axel Munthe, Louis Coatalen, Maxim Gorky, Oscar Wilde (briefly),[15] Compton Mackenzie, Romaine Brooks, Dame Gracie Fields, and Lenin (hosted by Gorky in 1908, establishing a Party School[citation needed]).[16] Queen Victoria of Baden was a frequent visitor. German industrialist Friedrich Alfred Krupp funded archaeological work but left after a scandal involving accusations of homosexual orgies.[17] Today, Capri remains a major tourist destination, particularly popular during the summer months, attracting visitors from Italy and abroad.[18] Geography [edit]Capri is located in the Tyrrhenian Sea at the western entrance to the Gulf of Naples, approximately 5 km from the mainland tip of the Sorrento Peninsula. The island has an area of 10.4 km2 (4.0 sq mi). The terrain is mountainous, consisting primarily of limestone and sandstone; steep cliffs dominate much of the coastline.[4] The highest point is Monte Solaro at 589 m (1,932 ft). The island's western part, culminating in Monte Solaro, is known as Anacapri, distinct from the eastern part centered around the town of Capri. The two main harbours are Marina Grande on the north coast (the primary port) and Marina Piccola on the south coast. Notable natural features include the famous sea stacks known as the Faraglioni off the southeast coast, the Blue Grotto sea cave on the northwest coast, and the Arco Naturale, a large natural arch on the east coast. Climate [edit]Capri experiences a Mediterranean climate (Köppen: Csa). Summers are warm to hot and generally dry, while winters are mild and wet. Sub-zero temperatures are rare. Administration [edit]The island is divided into two municipalities (comuni): These are administratively part of the Metropolitan City of Naples, which is part of the Campania region. Main sights [edit]Notable sights include: - Arco Naturale - Blue Grotto (Grotta Azzurra) - Capri Philosophical Park - Certosa di San Giacomo (Charterhouse, contains museum dedicated to painter Karl Wilhelm Diefenbach) - Faraglioni (sea stacks) - Gardens of Augustus - Marina Grande (main port) - Marina Piccola (small harbour) - Monte Solaro (highest point, accessible by chairlift) - Piazza Umberto I (The Piazzetta) - Punta Carena Lighthouse - Torre Materita - Via Krupp (historic switchback path, often closed due to landslide risk) - Villa Jovis (ruins of Tiberius's main villa) - Villa Lysis (built by Jacques d'Adelswärd-Fersen) - Villa Malaparte (modern architectural landmark) - Villa San Michele (built by Axel Munthe in Anacapri) Economy [edit]Capri's economy is mostly based on tourism. The island has been a major resort destination since the 19th century, attracting visitors from Italy and internationally. During summer, particularly July and August, the island experiences a large influx of tourists, including many day-trippers arriving by ferry from Naples and the Sorrento Peninsula.[20] The central Piazza Umberto I, commonly known as the Piazzetta, is the hub of social life and tourism in Capri town.[4] The island is known for upscale hotels, shopping (including luxury brands and local products like Limoncello and handmade leather sandals, and restaurants. Agriculture is very limited, though some wine and olive oil are produced locally. Handicrafts also contribute to the economy. The popularity of the island has led to concerns about overtourism, particularly during peak season, with discussions about measures to limit day-tripper numbers.[21] The international luxury linen brand 100% Capri originated on the island.[22] Culture [edit]In arts and literature [edit]During the latter half of the 19th century and early 20th century, Capri became a popular destination and residence for European artists, writers, and other prominent figures. August Kopisch's account of his 1826 rediscovery of the Blue Grotto significantly boosted the island's profile.[23] Painters John Singer Sargent, Frank Hyde, and Charles Caryl Coleman worked on the island. Writers who set works on Capri or lived there include Norman Douglas (South Wind), Compton Mackenzie (Vestal Fire, Extraordinary Women), Jacques d'Adelswärd-Fersen (Et le feu s'éteignit sur la mer), Somerset Maugham (\"The Lotus Eater\"), and Maxim Gorky. Notable memoirs set on the island include Axel Munthe's The Story of San Michele, Edwin Cerio's Aria di Capri, and Shirley Hazzard's Greene on Capri: A Memoir about Graham Greene.[24] Claude Debussy titled one of his préludes Les collines d'Anacapri (1910). Annual events [edit]Capri hosts numerous annual events, including religious festivals, cultural happenings, and traditional celebrations. Key events include: - Festival of San Costanzo (patron saint of Capri town) – May 14[25] - Festival of Sant'Antonio (patron saint of Anacapri) – June 13[25] - International Folklore Festival (Anacapri) – August[26] - Settembrata Anacaprese (Anacapri harvest festival) – September[26] - Capri Hollywood International Film Festival – Late December/early January[27] Food [edit]Capri is known in Campania for its marjoram, which has a dominant presence in the famous local dish of caciotta-filled ravioli.[30] Locally, it is held that pasta e piselli (lit. 'pasta with peas') is a specialty, and numerous versions are cooked, including with prosciutto or pancetta, and fats including prosciutto fat, oil or butter. It is almost always made with short tube pasta.[31] Transport [edit]Capri is accessible via ferry and hydrofoil services operating from Naples (ports of Molo Beverello and Calata di Massa), Sorrento, Positano, and Amalfi. Services also run from Ischia and other locations during the summer months.[32] Boats arrive at Marina Grande. From there, the Capri Funicular ascends to Capri town centre (the Piazzetta). A public bus network connects Marina Grande, Capri town, Marina Piccola, Anacapri, the Blue Grotto, and other points.[33] Taxis, often open-top limousine-style cars, are also available. Vehicle access for non-residents is heavily restricted for much of the year (typically April to November), due to the island's narrow roads. Visitors generally rely on public transport, taxis, or walking. Airports [edit]The island does not have an airport. The nearest airports are: Twin towns – sister cities [edit]Capri municipality is twinned with: - Crosby, Merseyside, United Kingdom - Bethlehem, Israeli-administered regions (Palestinian Authority) See also [edit]- Amalfi Coast – Coastal area in the Campania region, Italy - Ischia – Volcanic island in the Tyrrhenian Sea - List of islands of Italy - Procida References [edit]- ^ \"Bilancio demografico mensile\". ISTAT. 1 January 2022. Retrieved 29 April 2025. - ^ a b \"capri | Etymology, origin and meaning of the name capri by etymonline\". www.etymonline.com. Archived from the original on 2022-05-05. Retrieved 2023-09-21. - ^ Strabo, Geographica, 5.4.9 - ^ a b c Gellhorn, Martha. \"Everybody's Happy on Capri\". Saturday Evening Post. - ^ Suetonius. \"72\". The Lives of the Twelve Caesars. Augustus. Retrieved 19 February 2021. - ^ See discussion in, e.g., A. Mayor, *The First Fossil Hunters* (2000). - ^ Strabo, Geography, 5.4.9 - ^ Fiori, Pamela. \"Italy's Pleasure Island Capri\". Town & Country. - ^ Konrad Eubel, Hierarchia Catholica Medii Aevi, vol. 1 Archived 2019-07-09 at the Wayback Machine, p. 164 & subsequent volumes. - ^ Bolla De utiliori, in Bullarii romani continuatio, Tomo XV, Romae 1853, pp. 56–61 - ^ Annuario Pontificio 2013 (Libreria Editrice Vaticana 2013 ISBN 978-88-209-9070-1), p. 858 - ^ See, e.g., Gregory Woods, *Homintern* (2016) - ^ Selina Shirley Hastings: The Secret Lives of Somerset Maugham: A Biography，Random House Pub ，2009 - ^ Douglas, Norman (2025). Capri. Annotazioni antiquarie. Milan: La nave di Teseo. p. 10. ISBN 978-8834621240. - ^ Frankel, Nicholas (2017). Oscar Wilde: the unrepentant years. Cambridge, Massachusetts: Harvard University Press. p. 166. ISBN 978-0674737945. - ^ A monument to Lenin by Giacomo Manzù was erected in 1970. - ^ \"Storia gay – Friedrich Alfred Krupp (1854–1902), l'omosessualità e lo scandalo di Capri\". www.giovannidallorto.com. - ^ Swallow, Nicky (2012). Amalfi Coast with Naples, Capri & Pompeii. Hoboken: John Wiley & Sons Inc. p. 265. - ^ \"World Meteorological Organization Climate Normals for 1991-2020: Capri-16294\" (CSV) (Excel). National Oceanic and Atmospheric Administration / National Centers for Environmental Information. Retrieved 27 February 2024. - ^ Swallow, Nicky (2012). Amalfi Coast with Naples, Capri & Pompeii. Hoboken: John Wiley & Sons Inc. - ^ Sendlhofer, Thomas (13 May 2018). \"Zu viele Touristen: Hallstatt zieht Notbremse\". Kurier (in German). Retrieved 2020-01-13. - ^ Gafurova, Olga (25 November 2018). \"100% Capri opens its flagship boutique in Middle East at Dubai Mall Fashion Avenue\". AviaMost. Archived from the original on 27 July 2020. Retrieved 11 March 2020. - ^ See A. Kopisch, Entdeckung der blauen Grotte auf der Insel Capri (1838).His book Entdeckung der blauen Grotte auf der Insel Capri spawned the 19th-century fascination with Capri in France, Germany, and England.[citation needed] - ^ Hazzard, Shirley (2000). Greene on Capri. New York: Farrar, Straus and Giroux. p. 4. - ^ a b c \"Events\". Capri Tourism. Retrieved 2 June 2011. - ^ a b \"Events\". Travelplan. Retrieved 2 June 2011. - ^ \"Going Through Italy (website), accessed 9 January 2012\". Archived from the original on 27 May 2011. Retrieved 9 January 2012. - ^ \"Capri Art 2011 – Festival della diversità\". Capriartfilmfestival.com. 29 April 2011. Archived from the original on 19 November 2015. Retrieved 2 June 2011. - ^ a b c d e f Capritourism, Azienda Autonoma Cura Suggiorno e Tourismo Isola di Capri - ^ Schwartz, Arthur (1998). Naples at Table: Cooking in Campania. New York: HarperCollins. pp. 4. ISBN 0-06-018261-X. - ^ Schwartz, Arthur (1998). Naples at Table: Cooking in Campania. New York: HarperCollins. pp. 104. ISBN 0-06-018261-X. - ^ Ferry schedules vary seasonally. Reliable operators include Caremar, SNAV, NLG. See, e.g., \"Capri Ferry Schedule & Timetables\". Capri.net. Retrieved 29 April 2025. - ^ See, e.g., \"Getting Around Capri | Island Transport\". Capri.com. Retrieved 29 April 2025. External links [edit]Media related to Capri at Wikimedia Commons - Official website (Municipality of Capri) - Official website (Municipality of Anacapri) - Capri Tourism official website"
}