{
  "url": "https://communaute.sosh.fr/t5/Contenus-anciens-en-consultation/communications-Wap-Web-vers-orange-fr-wifi/td-p/1736297",
  "title": "Résolu : communications Wap Web vers orange.fr / wifi - Communauté Sosh",
  "text": "le 06-11-2014 20:20 Bonjour, Je viens de changer de téléphone et je découvre comme tant d'autres la fumeuse facturation pour des communications Wap Web vers orange.fr. Donc si j'ai bien compris, c'est normal de payer pour des communications et des Mo non sollicitées, c'est le portable qui se connecte tout seul à orange.fr… gonflé quand même…. En outre, multiplié par le nombre d'abonnés, cela fait un profit drôlement juteux pour Orange. C'est limite ce truc… D'autant plus qu'on ne le sait pas quand on souscrit le forfait, et puis même dans le principe c'est totalement insensé. Alors, j'ai parcouru les réponses faites en rapport avec ce problème et on apprend que pour être \"tranquille\" on peut : - souscrire à une option internet 50Mo pour 1 euro (qui peut, si j'ai bien compris, n'être utilisée que pour ces communications incontrôlables Wap Web vers orange.fr car 50Mo ça va vite à atteindre) ou - activer le blocage internet, pour fermer la porte à ce type d'abus… et si j'ai envie d'aller sur internet quand même ? ça sert à quoi d'avoir un Smartphone sinon ? Voici mes questions : 1) comment faire en sorte qu'il n'y ait plus ces communications Wap Web vers orange.fr SANS souscrire l'option blocage ? (je viens quand même de la souscrire pour ne pas voir mon compte dépouillé… Mais je peux revenir en arrière, enfin j'espère…). 2) Si je me connecte au wifi (chez moi j'ai la box SFR, au travail c'est FREE et ailleurs je ne sais pas forcément…) Est-ce que je vais payer des communications internet parce que je n'utilise pas la box orange ?? Ce n'est pas très clair, quand j'ai souscrit le forfait 4,90 euros c'était wifi illimité et à présent je n'en suis pas si sûre avec tout ce que j'ai évoqué précédemment. Merci d'avance si quelqu'un pouvait m'éclairer… le 06-11-2014 21:17 le 06-11-2014 21:17 le 07-11-2014 10:05 Bonjour, merci pour votre réponse, un peu sèche pour moi… Mais vous avez pris la peine. 1) Et bien non, je ne savais pas qu'un Smartphone, si intelligent soit-il, allait tout seul sur internet, et à voir les sujets ouverts sur le forum je ne suis pas la seule. Quant au forfait que j'ai pris, je ne vois pas le rapport. Je peux tout à fait accepter de payer en plus pour des communications internet – que je fais en toute connaissance de cause – sans avoir à payer pour celles à orange.fr, hors de tout contrôle. 2) Pour le wifi ça m'étonnait aussi que les connections soit facturées pour d'autres bornes que celles d'orange… Mais dans le doute je préférais avoir une confirmation. Encore désolée de poser des questions si bêtes. Cordialement le 07-11-2014 10:11 le 17-12-2016 15:18 Bonjour, Deouis 4 jours, j'ai un hors forfait de 0.05€ par jour pour une communication WAP/WEB !! J'ai pourtant désactivé mes données à l'étranger (pas les données cellulaires). Je travaille en Suisse depuis deux mois et je n'avais aucun problème auparavant. Sur place, je me connecte à la WIFI du site, et au réseau SWISSCOM. D'où peuvent venir ces communications et par quel moyen puis-je éviter ces hors forfaits ?!! Merci pour vos retours! le 17-12-2016 16:32 le 02-07-2017 10:49 Bonjour à tous. Toute nouvelle sur le forum.. Sur un forfait Shos Mobile + livebox à 34.99 je me retrouve à avoir dépensé mes 50 mo alors que ma wi-fii est fermée...et que, à part téléphoner ou envoyer des textos. C'est à plus rien y comprendre. Quelqu'un à-t-il une idée.. Merci de me lire et surtout si vous pouvez mz conseiller.. Mimi du 84 le 02-07-2017 10:56 le 02-07-2017 13:39 Merci Roland K... J'ai trouvé et fais comme vous m'avez dit. Bonne journée. le 02-07-2017 16:23"
}