{
  "url": "https://en.wikipedia.org/wiki/Fromage_blanc",
  "title": "Fromage blanc - Wikipedia",
  "text": "Fromage blanc Fromage blanc (UK: /ˌfrɒmɑːʒ ˈblɒ̃/;[1] French pronunciation: [fʁɔmaʒ blɑ̃] ⓘ; also known as maquée) and fromage frais are acid-coagulated fresh cheeses[2] originating from the north of France and southern Belgium. The name \"fromage blanc\" means \"white cheese\" in French. Fromage blanc is closely related to fromage frais (\"fresh cheese\") with the only difference being that, according to French legislation, fromage frais must contain live cultures when sold, whereas with fromage blanc, fermentation has been halted.[3] Fromage blanc and fromage frais are similar in appearance to yogurt, with a mild taste and a smooth, homogenous mouthfeel[4] similar to that of other fresh cheeses such as quark and cottage cheese. It can be served either as a dessert, spread on bread,[5][6] usually over or under jam, or used in savoury dishes. In many Western countries, fromage blanc and/or fromage frais are frequently sold in supermarkets alongside yogurts. In countries such as the United Kingdom, fromage frais in particular (which was introduced to the UK market during the 1980s[7]) is often combined with sugar and a fruit flavouring and marketed towards children.[4] See also [edit]References [edit]- ^ fromage blanc in the Oxford British & World English Dictionary - ^ Fox, Patrick F.; Guinee, Timothy P.; Cogan, Timothy M.; McSweeney, Paul L. H. (2016-08-22). Fundamentals of Cheese Science. Springer. ISBN 978-1-4899-7681-9. - ^ Note d'information accompagnant le décret n°2007-628 relatif aux fromages et spécialités fromagères Ministère de l'économie - ^ a b Hui, Y. H.; Meunier-Goddik, Lisbeth; Josephsen, Jytte; Nip, Wai-Kit; Stanfield, Peggy S. (2004-03-19). Handbook of Food and Beverage Fermentation Technology. CRC Press. ISBN 978-0-8247-5122-7. - ^ New York Magazine. New York Media. October 1990. p. 75. Retrieved June 23, 2017. - ^ Hastings, C.; De Leo, J.; Wright, C.A. (2014). The Cheesemonger's Seasons: Recipes for Enjoying Cheeses with Ripe Fruits and Vegetables. Chronicle Books LLC. p. 80. ISBN 978-1-4521-3554-0. Retrieved June 23, 2017. - ^ Gardner, Carl; Sheppard, Julie (2012-08-09). Consuming Passion: The Rise of Retail Culture. Routledge. ISBN 978-0-415-54029-2."
}