{
  "url": "https://www.ibroxnews.com/2026/02/03/danilo-exit-latest-emerges-from-overseas-after-midnight-rangers-transfer-announcement/",
  "title": "Danilo exit latest emerges from overseas after midnight Rangers transfer announcement",
  "text": "Danilo exit latest emerges from overseas after midnight Rangers transfer announcement Rangers outcast Danilo is still expected to leave Ibrox despite Monday’s 11 pm deadline being passed. It was a hectic and dramatic deadline day as far as Rangers are concerned, with twists and turns taking place by the hour. Danny Rohl had been desperate to sign a striker throughout the winter window, keen to ensure his cutting edge in attack was sharp enough to maintain their Scottish Premiership title challenge. Cameron Archer appeared set to sign for Rangers to finally quench Rohl’s centre-forward signing thirst, whilst Danilo was expected to leave Glasgow before the deadline. Danilo to seal Rangers exit on Tuesday However, Rangers’ move for Archer fell through due to Southampton being unable to sign a striker of their own, after Adam Armstrong left for Wolves following the sale of Jorgen Strand Larsen to Crystal Palace. Luckily, Rohl had a contingency plan involving Archer and Ryan Naderi, with it being revealed on deadline day that should Gers’ loan move for the Saints striker collapse, they would look to accelerate Naderi’s transfer. Rangers and Hansa Rostock had originally come to a verbal agreement that would’ve seen Naderi move to Ibrox in the summer, but Rohl wasn’t leaving the winter window without a new striker. As such, Gers stumped up an improved bid – that broke Germany’s 3.Liga transfer record – to sign the 22-year-old now, and it’s this decision that is going to ensure Danilo still gets his Rangers exit. According to a report from Voetbal International, Rangers wanted to wait to see if they signed a striker before allowing Danilo to leave permanently. Now that they’ve done so, it’s understood that the Brazilian will depart for Eredivisie side NEC Nijmegen, as their transfer window doesn’t shut until Tuesday night. Danilo has been hugely disappointing signing for Rangers Having joined Rangers in a £6million deal from Feyenoord in the summer of 2023, much was expected of Danilo in Glasgow. The 26-year-old was joining off the back of a 14-goal season with the Dutch giants, but in just shy of 80 appearances over the following two-and-a-half years, he’s scored just 16 goals in all competitions. With two back-to-back six-goal campaigns in all competitions, Danilo just hasn’t delivered the goalscoring goods that he had done in the Netherlands. As such, he’ll no doubt go down as one of Rangers’ most expensive transfer flops in recent times. Stay up to date this winter with our Rangers transfer tracker. Click to see every done deal at Ibrox, plus expert reaction from our team of writers."
}