{
  "url": "https://jermukarmenia.com/en/jermuk",
  "title": "Jermuk",
  "text": "Jermuk Jermuk is a leading Armenian spa city, which annually hosts not only a huge number of tourists but also a myriad of people from all over the world who go there for health and treatment purposes. The city is divided into two parts by the splendid gorge of Arpa River. The mineral waters of Jermuk have been used by both ordinary people and Armenian princes to treat various diseases. This statement is supported by the remains of the medieval pools uncovered there and reconstructed in the 19th century. Some of the diseases that are presently treated in the spa town are – diseases of gastro-enteric tract (such as gastritis, gastric ulcer and duodenum, hepatitis, pancreatitis and colitis), diseases of urogenital system (such as inflammation of urinary bladder and chronic inflammation of sexual organs), diseases of respiratory and nervous systems, infringement of metabolism (such as diabetes mellitus and adiposity) and so on. A legend has it that long ago when hunting was the only form of living, the forests of Jermuk were full of different animals, among them deer. One day a professional hunter shot an arrow and injured a deer, which didn’t give up but kept on running despite it. The exhausted deer eventually came to the mineral waters of Jermuk and simply jumped into it. What happened after was a miracle – the deer came out of the water absolutely cured. It is said that since then the fame of Jermuk mineral waters spread in the whole world, and the deer became the symbol of Jermuk. The deer is pictured on all the bottles of Jermuk mineral water, which is today sold in every Armenian store. Jermuk: Location Jermuk is located in Vayots Dzor Province of Armenia. It takes around 2 hours and a half to get there from capital Yerevan. The buses leave from bus station and the ticket price costs more or less $4. Jermuk: Climate Jermuk has unique climate, and it is explained by the 2500-3000 meter high mountain chains that surround the city as well as the gorge of Arpa River, which serves as a gate for the air flows coming from Araks Calley. The city stands out with warm and mild summers and sunny and colorful falls. Especially splendid is the winter, when everything is covered with sparkling snow. Considering the city’s climate conditions, the beautifully expressed seasons as well its significance and location not in vain prominent Armenian writer William Saroyan was so impressed by it that he said Armenia is a real paradise and its high, skyscraping crown is Jermuk city. Jermuk: Things to See Jermuk Waterfall Jermuk waterfall that falls from a height of 70 meters into the gorge of Arpa River is a true miracle of Armenian Highlands. It reminds of hair flowing freely and therefore locals call it “Mermaid’s hair.” The legend regarding the waterfall has it that there was a princess whose beauty was so capturing that many princes wanted to marry her. But the princess’s heart belonged to the son of a shepherd, so she was refusing everyone. To meet her beloved the princess was throwing a long rope into the gorge of Arpa River for him to climb it and finally meet. When the girl’s father learned about it he cursed her saying that if they meet again then let she turn into a mermaid and never come out of the water. The desire to meet each other was stronger than the fear from the curse and the girl threw her long hair into the gorge and at that moment they turned into a waterfall. And that’s why people call it “Mermaid’s hair.” Gallery of Waters Once in Jermuk, this is a place not to miss. There are pipes in walls and the water flows from there into stone urns. What happens then is that the water temperature is shown next to the pipe. The waters are different and each of them is believed to have different properties and accordingly, cure of a different disease. There are waters that treat liver problems and cancer too. Jermuk Lake The Lake is not a big one but it’s worth going there as with the overall view it looks great. Those who want, can ride a boat there and one thing that’s good about this is that it’s free of charge. Gndevank Monastery One of the closest and most beautiful places near the town of Jermuk is the medieval monastic complex of Gndevank, located to the west of Gndevaz village, on the left bank of the Arpa River. It was built between 931 and 938 A.D. with the support of Princess Sopi (Sophia), the wife of Prince Smbat of Syunik. She was also the daughter of King Grigor-Derenik Artsruni of Vaspurakan and the sister of King Gagik. With the aim of preserving the Armenian nation's Christian faith, Armenian noblewomen—especially princesses and queens—often built monasteries and churches. Gndevank, founded originally as a hermitage for monks in the gorge, appointed Father Sargis as its spiritual leader, and Priest Yegishe oversaw the construction work. There are two stories behind the name “Gndevank”: - According to the first version, the monastery was named after the hermit Suphan Gnduni. - The second story is more intriguing: Princess Sophia sold her earrings (gind – jewels) to finance the completion of the construction. The monastery was then named Gndevank (\"Monastery of the Jewel\") in honor of her sacrifice. This act is memorialized on the western wall of the monastery. The inscription reads: \"The ring was the gem of Vayots Dzor; I built this and placed the gem upon it.\" The surrounding nature of the Arpa River gorge fully embraces Gndevank, once again proving the perfect harmony between Armenian natural beauty and unmatched medieval architecture. A few legends: One tale tells of a young prince who sought the hand of the beautiful Princess Sophia, daughter of Prince Smbat of Syunik. She agreed to marry him only if he could win a competition she proposed. The challenge: the prince had to build an aqueduct from the Vorotan River to Vayots Dzor in 40 days, while Sophia would build a monastery in the same period. On the 39th day, the prince learned that Sophia’s monastery was nearing completion. Following his father's advice, he hung a white cloth from a cliff so the wind would flutter it and create the illusion of flowing water, making it appear that the aqueduct was finished. Though the monastery was nearly done, Sophia had run out of resources and had to sell her earrings to finish the dome’s construction. At that moment, she received news that the aqueduct was supposedly complete. Seeing the cloth waving like a waterfall from afar, she lost hope and threw herself into the abyss. From then on, the monastery came to be known as Gndevank. Another legend tells that Queen Sophia, wife of King Smbat, wanted to build a monastery here. Once it was complete, she invited monks living in nearby caves to settle there. Among them was an elderly monk named Hovhannes, who was too old to stand and always prayed on his knees. Because of this, he was known as Gunt Hovhannes. He became the first abbot, and the monastery was initially called Gunt Hovhannes Monastery, later evolving to Gndevank. Kechut Water Reservoir Another thing to definitely see in Jermuk is Kechut Water Reservoir on Arpa River, also known as margaritka (pearl) to the locals. It’s something to see to fully admire and appreciate. Jermuk Art Gallery Jermuk Art Gallery, which is the branch of the National Gallery of Armenia has been receiving visitors since 1972. It's a one must-see place for people who love art and who would love to get acquainted with the Armenian art. The time period introduced in the gallery dates to 1930s until the present day. Works of such painters as Martiros Saryan and Ara Sargsyan can be found there. Jermuk: Things to Do Since Jermuk is primarily a spa town and sanatorium, the first thing people usually do is getting treated and taking mineral water baths. But that's not all, as Jermuk offers activities for people loving active rest as well. One of them is taking a ride on the ropeway. The ropeway meets international standards. It takes you up one of the mountains where visitors are invited not only to enjoy the wonderful view but also ride a horse or have some drink in the cafe up the mountain. Another thing to do is to ski or ride on a snowmobile! Those who love sledges can take advantage of the special playground built on the mountain."
}