{
  "url": "https://www.bbc.com/news/articles/cdre825p110o",
  "title": "Fifteen migrants dead after collision with Greek coastguard boat",
  "text": "Collision with Greek coastguard boat leaves 15 migrants dead At least 15 migrants have died after a speedboat carrying them collided with a Greek coastguard vessel off the coast of the island of Chios late on Tuesday. Greek authorities said the speedboat was making dangerous manoeuvres and that a pursuit was under way at the time of the collision in the Chios Strait, near the village of Vrontados. Twenty-four people were rescued, some of whom were seriously injured, and others are reportedly still missing. Greek TV reports that the survivors say they are mostly Afghans, with one person saying they are Moroccan. Confirming the collision, the coastguard said the speedboat had capsized and sunk. Searches in the area continued on Wednesday. The incident comes amid continued scrutiny of Greece's handling of migrant crossings following the Pylos shipwreck in June 2023, when hundreds of migrants died after an overcrowded fishing boat sank off the country's southern coast. That disaster prompted investigations by Greek and international authorities into the role of the coastguard and wider search-and-rescue practices in the region. A search and rescue operation continued on Wednesday in the waters off Myrsinidi beach, which involved four coastguard vessels, a privately owned boat carrying civilian divers and a helicopter. Greek state broadcaster ERT said the injured included seven children, a pregnant woman and two coastguard officers. The coastguard confirmed an inflatable patrol boat had seen an inflatable speedboat with foreign passengers and had been moving without navigation lights towards the eastern coast of Chios. Authorities say light and sound signals were made to the speedboat but it did not stop, reversing course instead and colliding with the patrol boat on the starboard side. The speedboat then capsized and sank, with all passengers falling into the sea. The 25 injured people included seven men, seven women and 11 minors who were all taken to the Skylitseio Hospital. Later, one of the women died. Post-mortem examinations are due to be carried out, with additional forensic staff travelling to Chios to assist with the process. Three of the injured people had surgery after the accident caused serious trauma to their vital organs. Hospital authorities said two pregnant women among the injured were going to have surgery after doctors said the foetuses had no cardiac activity. Many of the injured were also being treated for hypothermia, head injuries and fractures. Some remain in intensive care, while others continue to receive treatment, including in the paediatric ward. Greek Migration Minister Thanos Plevris said the deaths were a \"tragic incident\" while speaking during a debate in parliament about toughening criminal penalties against traffickers, AFP news agency reported. \"The criminals are the traffickers... who tried to drop off the migrants at Chios,\" he added. Officials said that some of those being treated may be discharged later and transferred to the Vial reception and detention centre on the island. Two members of the coastguard were also taken to hospital, with one man discharged and a woman held for further examinations after suffering what officials described as a mild concussion. The coastguard confirmed two patrol boats had picked up a total of 14 bodies - those of 11 men and three women. The bodies were taken to hospital for autopsies and the Central Port Authority of Chios has begun an investigation. Greece's navy also issued a navigational warning, placing the search area under Greek co-ordination. Naval vessels in the area were put on alert to assist if requested by the search and rescue coordination centre. Authorities have not yet said how many people were on board the migrant boat, and the precise sequence of events leading up to the collision is still being examined."
}