{
  "url": "https://en.wikipedia.org/wiki/Bitburger_Brewery",
  "title": "Bitburger Brewery - Wikipedia",
  "text": "Bitburger Brewery Bitburger Brewery (Bitburger Brauerei Th. Simon GmbH) is a large German brewery in Bitburg, Rhineland-Palatinate. Founded in 1817 by Johann Wallenborn, its Pilsner is the third best-selling in Germany, and the nation's top-selling draught beer.[2] History [edit]Johann Peter Wallenborn (1784–1839) founded the brewery in Bitburg in 1817 at the age of 33. His father owned a brewery in Kyllburg. Three years after Wallenborn's death in 1839, Ludwig Bertrand Simon (1813–1869) married Wallenborn's daughter Elisabeth (1819–1891) and became owner of the brewery, naming it Simonbräu. Their son, Theobald Simon (1847–1924), took over the brewery in 1876 at the age of 29.[3] Product range [edit]Bitburger is a 4.8% abv Pilsner with annual sales of 1.2 million hectolitres (1.0 million US beer barrels).[citation needed] It is a popular beer throughout western Germany, and is favored in many areas of North Rhine Westphalia even over Alt beer or Kölsch, which are popular in Düsseldorf and Cologne. In Germany, there are also variations of the original beer, mostly beermixes, available. \"Bit Sun\" (a light beer), \"Cola Libre\" (beer and cola and rum-lemon-flavour), \"Bit Copa\" (beer and lime and cachaça) and \"Bit Passion\" (beer and pomegranate). There is also a malzbier called \"Kandimalz\" and \"Bitburger Alkoholfrei\" (sold as Bitburger 'Drive' in English-speaking countries), a non-alcoholic version of the normal \"Bitburger.\"[4] It is exported throughout the world. It is also available in mini kegs in some countries, such as Australia. In the US, it's available in 500 mL (16.9 US fl oz) cans, 330 mL (11.2 US fl oz) bottles, the 5 L (170 US fl oz) mini keg, and on tap in select locations. Advertising [edit]The company slogan is, \"Bitte ein Bit.\" This is literally, \"Please, a Bit,\" or \"A Bit, please.\" In the 1970s, a second slogan was introduced, \"Abends Bit, morgens fit\" (\"Bit in the evening, fit in the morning\") implying that the consumption would not lead to a hangover. During that time either of the slogans could be found on Bitburger glasses. The brand sponsored the German Football Association from 1992 until 2018. It also sponsored Benetton Formula One in 1994 and 1995, where German driver Michael Schumacher won the Formula One championship both seasons. See also [edit]References [edit]- ^ \"Biermarken in Deutschland\". Aktion Gutes Bier (in German). n.d. Retrieved 2016-10-12. - ^ \"Germany: The most successful German beer brands in 2020\", Inside Beer - ^ Glaser, Gregg (26 January 2004). \"Bitte, ein bit: Bitburger sells more draft than any other German brewer\". Modern Brewery Age – via The Free Library. - ^ \"Product data: Bitburger Drive 0,0% alkoholfreies Pils\". Bitburger Braugruppe. n.d. Retrieved 15 August 2019. External links [edit]- Official site (English)"
}