{
  "url": "https://www.britannica.com/topic/charcuterie",
  "title": "Charcuterie | Definition, Ingredients, Types, & Uses | Britannica",
  "text": "charcuterie charcuterie, French term that refers to prepared meats, such as sausage, ham, bacon, and pâté. So-called charcuterie boards have become popular as appetizers or party snacks in the United States in recent years. Strictly speaking, these should contain only French meat products, but the term has broadened to include, in addition to assorted meats, a variety of cheeses, nuts, fruits, vegetables, breads, crackers, and even sauces. Charcuterie derives from the French phrase chair cuit, meaning “cooked meat.” It was originally confined to pork, for medieval guild regulations required charcuteries to sell only pork and pork fat. The term referred originally not to the meat itself but to the shops where it was sold, the venue of the charcutier, who prepared, cooked, and preserved cuts of pork and, on occasion, other foods, as during Lent when the observant ate cured fish rather than meat. Even today, most charcuterie is made of pork. Cured meats are generally prepared by processes of salting, smoking, air-drying, and curing. Not all these processes are used for each kind of meat. Some are required by environmental conditions; whereas in Italy the drier air allows for air-curing, French hams are often wet-cured. The better-known jambon de Paris is often wrapped in pork skin and cooked in its own juices. - Related Topics: - hors d’oeuvre - French cuisine - meat - appetizer The regions of France best known for charcuterie are Auvergne, near the central city of Lyon, and Alsace, in the northeast of the country, along the German border. Both regions are known for the production of pork and heirloom species of swine, with numerous specialties among the processed meats on offer. Some charcutiers, for instance, prepare boudins noirs, or blood pudding (blood sausage), as well as numerous preparations of tripe. Duck confit, galantines, and goose-liver pâté have entered the domain of charcuterie, as have terrines—tiered assemblages of meat, spices, and fruits or vegetables cooked in a mold. There are many regional variations on general charcuterie types—for example, saucisson sec, or dry-cured sausage, is similar to salami in the south of France, while in Alsace it incorporates nutmeg and cinnamon, and the saucisson aux noisettes of eastern France makes use of locally grown hazelnuts."
}