{
  "url": "https://www.planetnatural.com/cedar-tree/",
  "title": "12 Different Types of Cedar Trees with Pictures",
  "text": "Cedar trees, belonging to the Cedrus genus and family Pinaceae, are a type of evergreen conifers native to the Mediterranean and Western Himalayas. Prominent species of true cedars include the Atlas Cedar (Cedrus atlantica), Cedar of Lebanon (Cedrus libani), and Deodar Cedar Tree (Cedrus deodara), with each offering a distinct landscape beauty. These magnificent trees are recognized for their sturdy trunks, peeling bark, needle-like leaves, and cones that contribute to an engaging foliage display. Cedar trees thrive well in full sun to partial shade, and adapt to a variety of climates, though their native environs are the Mediterranean and mountainous climate of the Himalayas. Different types of cedar trees prefer a range in climate zones, with species like the northern white cedar and the western red cedar appreciating cooler, moist environments, and varieties like the eastern red cedar and the Deodar cedar tree being more tolerant of drought. The Lebanese cedar relishes the Mediterranean climate, enjoying hot, dry summers and cool, moist winters. Plus, cedar wood, thanks to its insect-repelling quality and resilience, is extensively utilized in making decks, fencing, and mulch. A cedar tree’s susceptibility to root rot signifies the necessity of a well-drained site and careful watering. Mulch can aid in maintaining necessary soil moisture without causing excess water retention. Regardless of species, true cedars grace any landscape with dazzling shades of green throughout the year, and stand as an impressive testament to the diversity and beauty of our world’s flora. In this article, as a master gardener, I’ll go over the 12 most common types of cedar trees, along with what makes them unique, and why you should consider growing them. 1. Deodar Cedar Height: 40-50 feet Width: 20-30 feet Hardiness Zones: 7 – 9 (USDA) Deodar Cedars (Cedrus deodara), native to the western Himalayas, are a majestic species of true cedars that are often used to enhance the beauty of any landscape. Famous for their drooping foliage and stunning cones, they belong to the family Pinaceae and are a part of the Cedrus genus. Drawing from its Himalayan roots, the Deodar Cedar is notable for its resilience in the face of climate changes, displaying tough bark and needles that can withstand different types of climate. It’s an evergreen, meaning it retains a vibrant coat of leaves throughout the year. Its name even translates to ‘Tree of the Gods’ in its native region, highlighting its divine beauty. Each Deodar Cedar’s tall silhouette is crowned by an array of bluish-green needles, creating a display that can truly light up a garden. Its elegant cones, in addition to its aesthetically pleasing bark and robust trunk, also make it an excellent choice for those in USDA hardiness zones that match its needs. For a home gardener, the Deodar Cedar represents an opportunity to bring a touch of the Himalayas into your own backyard. Able to thrive in full sun or partial shade, and relatively resistant to drought, it’s a specimen that can create an enduring, majestic presence. Gardening enthusiasts would be wise to consider this magnificent tree as an addition to their gardens. 2. Northern White Cedar Height: 40-60 Feet Width: 10-15 Feet Hardiness Zones: 2 – 7 (USDA) The Northern White Cedar is an impressive species of true cedars and a hallmark of the conifers. Known scientifically as Thuja occidentalis, it is native to the North American region and lionized for its remarkable foliage and stately form. What makes the Northern White Cedar truly special are its leaves–soft, feather-like needles ranging from deep to pale green, that stand out, particularly in full sun or even partial shade. These cedars bring a year-round dash of elegance with their evergreen foliage that holds fast even through the harshest winter snows. The bark of this cedar, peeling away in narrow strips from the trunk, exposes a fascinating array of colors, adding interest even in the core winter months. Any gardener seeking to enhance their landscape should consider growing this hardy cedar tree. It tolerates a variety of climates and even stands up to drought with resilience. The Northern White Cedar also provides exceptional fencing and decks due to its resistance to rot, and with appropriate mulch and moisture balance, there is minimal risk of root rot. This cedar tree enriches the garden visually, but also contributes to the garden’s overall health and vitality. 3. Eastern White Cedar Height: 40-50 feet Width: 10-20 feet Hardiness Zones: 2 – 7 (USDA) The Eastern White Cedar belongs to the family Pinaceae, a part of the species of true cedars in the Cedrus genus. As a staple of the North American landscape, it is most native to moist, swampy woodlands. With an elegant, slender trunk and rifted bark that take on a picturesque form, it broadens the visual profile of every garden where it dwells. What sets the Eastern White Cedar apart is its evergreen foliage. The leaves – fine, delicate needles – present a soft green palette that transitions to a distinctive gray-green in winter. Adding to its beauty are small cones that turn a charming brown when mature. Its incredible resistance to the cold makes it a true champion cedar tree. For gardeners, this cedar offers an excellent choice for hedging and fencing. It thrives under full sun to partial shade, requires consistent moisture, but is resilient in face of occasional drought. It’s also an ideal choice for constructing decks due to its durable nature. Last but not least, it’s incredibly resistant to root rot, a typical problem amongst many cedars. The Eastern White Cedar brings not only an aesthetic upgrade to your garden, but also functionality. With its unique characteristics, it truly holds the potential to become a gardener’s trusted companion. 4. Western Red Cedar Height: Varies between 70 to 200 feet or higher Width: 15 to 25 feet Hardiness Zones: 5 – 7 (USDA) The Western Red Cedar, known scientifically as Thuja plicata, is a native tree to the Pacific Northwest region, belonging to the Family Pinaceae. Characterized by its pyramidal shape, the rich foliage of this evergreen provides a vibrant green color to your landscape year-round. This cedar tree’s signature reddish-brown bark is fibrous and sheds in long strips. Its needles, an embodiment of beautifully delicate shades of green, yield small, aromatic cones that add to its allure. What sets apart the Western Red Cedar is its impressive resilience. This species of true cedars is notable for braving different climatic vicissitudes – be it full sun or partial shade – and is even known to withstand prolonged periods of drought. It exhibits an amicable temperament towards both moist and well-drained soil conditions, a trait that helps ward off root rot. Considering its aesthetic charm and formidable adaptability, the Western Red Cedar constitutes an excellent addition for gardeners seeking a robust and striking addition to their outdoor space. This denizen of greenery, with the right care and mulch, can inch close to immortality, thus gifting your garden with a perennial presence of its unique character. So, whether it’s fencing for your yard or adding character to decks or your landscape, Western Red Cedar makes a sterling choice. 5. Spanish Cedar Height: 65 – 100 feet Width: Broad Hardiness Zones: 10 – 12 (USDA) Spanish Cedar, scientifically known as Cedrela Odorata, is a valued member of the Meliaceae family, lending exotic touch to any landscape. This majestic, fast-growing tree is very popular in tropical and subtropical regions of the Americas and the Mediterranean region. Noted for its reddish-brown bark and luscious, shiny compound leaves, this cedar variant is an eye-catcher. What makes Spanish Cedar special is its resilience and versatility. It boasts a high resistance to rot and termites, which makes it an excellent choice for fencing, deck building or even crafting fine furniture. The leaves of the Spanish Cedar are evergreen, making it a year-round beauty. It also produces small clusters of white flowers which add more charm to its appearance. Any gardener should consider growing Spanish Cedar for its many perks. It is drought-resistant and can thrive in full sun to partial shade. This species also has a wonderful aromatic scent that can provide a natural fresh smell to your garden. Lastly, with adequate moisture and a good layer of mulch, growing Spanish Cedar can be quite an effortless pursuit even though root rot could be a potential concern. Its majestic presence and practical benefits truly make this tree a worthy addition to any gardener’s landscape. 6. Cyprian Cedar Height: Up to 80 feet Width: Expansive Hardiness Zones: 6 – 9 (USDA) Cyprian Cedar, botanically known as Cedrus Brevifolia, is a type of cedar tree native to the high-altitude landscapes of the Mediterranean basin. It is also commonly referred to as the Cyprus cedar. Cyprian Cedar is a member of the Pinaceae family, an esteemed family within the world of conifers. What makes this cedar special is its unique adaptation to both full sun and partial shade, which allows it to thrive in diverse climate zones. Cyprian Cedar produces beautiful, dark green needles and smallish cones. The foliage remains evergreen throughout the year, giving your garden a consistent, vibrant hue. Any master gardener should consider growing the Cyprian Cedar due to its drought resistance. It can withstand tough climates, whilst still achieving a rich look with its dense foliage, hence great for fencing or decks. The bark possesses noteworthy shades and the cedar’s expansive width also adds character to any landscape. Its resilience against common plant diseases like root rot, when paired with regulated moisture and mulch, is another appealing factor. Simply put, it is a symbol of beauty and strength, nicely suited for the landscapes of gardening enthusiasts. 7. Alaska Cedar Height: 60 – 90 feet Width: Broad Hardiness Zones: 4 – 7 (USDA) The Alaska Cedar, a member of the cedrus genus, is a remarkable species of true cedars, native to the cool climatic regions of North America. Belonging to the family pinaceae, this false cedar towers over most landscape with a medium height reaching up to 40 feet and boasts a broad width that forms a grand silhouette. Enveloped with glossy, dark green needles, the tree is an evergreen spectacle, providing visual interest throughout the year. What makes it special is its unique pendulous branches with weeping foliage that convey a sense of elegance and drama to any setting. Its adorable bluish-green leaves and small, brown cones only add to its distinction. Moreover, the bark of Alaska Cedar peels in strips, revealing a reddish-brown trunk which is a sight to behold in itself. Every gardener should consider growing an Alaska Cedar due to its hardy nature and versatility. With excellent tolerance for full sun and partial shade, it thrives in a variety of conditions. It can withstand drought, yet also enjoys a good amount of moisture, provided the soil is well-drained to prevent root rot. The tree is not picky about the type of soil; it grows well in clay, loam, or sandy soils given you add a layer of mulch around its base. Furthermore, its sturdiness affords it many uses, including windbreaks, screening, or even as a specimen tree. Consider an Alaska Cedar – a gem of the cedar world – as a must-have addition to any gardener’s collection. 8. Atlas Cedar Height: 40 to 60 feet Width: Broad Hardiness Zones: 6 – 9 (USDA) The Atlas Cedar (Cedrus atlantica) is a true cedar from the Cedrus genus, native to the Atlas Mountains in the Mediterranean climate. Characterized by its majestic height and exhaustive breadth, it is a breathtaking centerpiece in any landscape. Atlas Cedars are a paragon of resilience, named after the Atlas mountains where they endure harsh conditions. This evergreen stands proudly throughout the year, its foliage a tapestry of silver-blue needles that captivate the eye. Their cones are symmetrical and upright, adding to the aesthetic beauty of the tree. The bark is grey and fissured, adding a rugged textural contrast against the delicate needles. Hardy in zones 6-9, Atlas Cedar thrives in full sun but can also tolerate partial shade. The tree is fairly drought-tolerant and requires well-drained soil to avoid root rot. Mulching can help retain moisture around its base, reinforcing its ability to withstand dry periods. Its extensive root system and weather-hardy nature make it excellent for erosion control and as windbreaks in landscaping. Any gardener should consider growing Atlas Cedar for its stately beauty, resilience, and low maintenance. Whether it’s providing shades for relaxation, serving as a living fence for privacy, or simply adding an impressive element to your outdoors, the majestic Atlas Cedar is always a wise choice. Furthermore, the variety of the genus Cedrus, including Lebanon Cedar (Cedrus libani) and Deodar Cedar (Cedrus deodara), is a testament to the versatility of True Cedars, making them the coniferous queens of the garden. 9. Lebanon Cedar Height: Up to 130 feet Width: Up to 50 feet Hardiness Zones: 5 – 7 (USDA) The Lebanon Cedar or Cedrus Libani is a magnificent specimen from the cedar trees varieties. Boasting a rich history, this species is native to the Mediterranean and has been venerated in various ancient civilizations for its imposing appearance and sturdy wood. Its stature and broad width make it an impressive addition to any landscape. The impressive evergreen maintains its dense, dark green foliage year-round, making it an all-season beauty. Moreover, its bark and large trunk are features that add to the tree’s grandeur as it matures. One of the true cedars from the Cedrus genus and the family Pinaceae, the Lebanon Cedar is lauded for its resilience. It can thrive in full sun and partial shade, while its drought tolerance and ability to adapt according to the climate make it a preferable choice for gardeners across zones 5 to 7. Adaptable to different types of soils, it has an effective resistance against diseases like root rot, if appropriate mulch and moisture care are provided. In a nutshell, the grandeur of Lebanon Cedar makes it a dazzling focal point for large gardens and parks, while its durability and modest care requirements make it a gardener’s delight. With the correct placement, this tree is sure to add an undeniable charm to your green space. 10. Incense Cedar Height: Up to 75 feet Width: Expansive Hardiness Zones: 5 – 8 (USDA) The Incense Cedar, scientifically recognized as Calocedrus decurrens, is a grandeur expression of nature’s sublime handiwork. Towering high and spreading wide, this impressive tree hailing from the Family Pinaceae, injects character and grace into any landscape. Once matured, these evergreens are capable of reaching formidable heights, adding an eye-catching vertical element to your garden. Setting the Incense Cedar apart from other types of cedar trees is its unique foliage. It presents an array of dense, dark green leaves, almost resembling scales and hence, adding a dash of mystique to its charm. The bark of the tree, as well, is a spectacle in itself, rugged and brown, perpetually carrying the aroma of its namesake. As a master gardener, why do I recommend cultivating this magnificent specimen? There are just so many reasons! For starters, being native to Mediterranean climates, the Incense Cedar is well-adapted to full sun exposure and remarkably resistant to drought, simplifying its maintenance. Plus, it is a prime pick for creating living fencing, especially in wide-open spaces. Its tall stature paired with its width forms a natural barrier, bestowing an elegant privacy to your property. Beyond that, its robust cones serve as an attractive food source for local wildlife, as they peak interest and diversify your habitat. 11. Oriental Arborvitae Height: 20 – 40 feet Width: 10 – 15 feet Hardiness Zones: 3 – 7 (USDA) The Oriental Arborvitae, or more technically speaking, Thuja orientalis, is an impressive addition to any landscape. It originates from the Mediterranean, yet has an inherent ability to adapt and flourish in diverse climates. What sets this type of cedar tree apart is how it remains evergreen throughout the year. This implies that regardless of the season, it’ll continue to provide a lush, green aspect to any setting it adorns. Its thin, needle-like leaves are soft and emit a pleasant aroma when crushed. Any gardening enthusiast should consider adding the Oriental Arborvitae to their collection for several reasons. Firstly, it offers visual appeal year-round and is a trusted choice for fencing owing to its thick, dense foliage. Secondly, it does exceptionally well in full sun and partial shade and is fairly resilient to drought. Despite its preference for moist, well-drained soil, it’s able to tolerate a variety of soil conditions, including clay or sandy soil. Just ensure to add some mulch to aid in moisture retention and prevention against root rot. Finally, it also serves practical purposes beyond beauty – its sturdy and rot-resistant trunk makes it an ideal material for decks. Over time with proper care, one can turn a little sapling into an eye-catching monumental tree, a living testimonial to the effortless beauty of nature. 12. Port Orford Cedar Height: Up to 200 feet Width: 15 to 30 feet Hardiness Zones: 6 – 9 (USDA) The Port Orford Cedar is a conifer tree native to the Mediterranean and known for its extremely aromatic, evergreen foliage. Part of the Cedrus genus, the tree falls within the family Pinaceae. It is one of the different types of cedar trees that naturally adapt to variations in climate, making it highly versatile for various landscapes. What sets the Port Orford cedar apart is its resistance to drought and root rot, a common problem among true cedars. Its scale-like leaves resemble needles and yield small cones that add to its visual appeal. This type of cedar tree is a perfect addition to your garden if you’re in search of a tree that can thrive in full sun and partial shade, provide excellent fencing, and bring an exotic touch to your environment. Moreover, the Port Orford cedar isn’t a false cedar, but a true one, aligning it more closely with species like the Cedar of Lebanon, Cedrus Libani, and the Atlas Cedar, Cedrus Atlantica. Gardeners should consider growing it for its resilience, aesthetic appeal, and the unique, fresh scent that can transform any garden into a Mediterranean haven. Other Tree Guides from Planet Natural:"
}