{
  "url": "https://www.forhorizon.com/",
  "title": "Horizon Adult Health Care - Compassionate Elderly Care in Kentucky",
  "text": "Horizon Adult Health Care For almost 30 years, Kentuckians have trusted Horizon Health with a sacred duty – caring for their elderly family member. We are dedicated to providing compassionate care that enriches the lives of all who count on us and keeps them safe. There is no greater piece of mind than knowing your loved one is safe and protected – with all their individual needs being met by dedicated professionals who support their independence and dignity. Horizon Health can help ensure your loved one remains safely at home as long as possible. We are building on three decades of trusted service by continuing to lead the way in offering a range of comprehensive elder care to meet the needs of seniors in the community. Home Health For those who are recovering from an illness or injury, have a weakness or difficulty walking, or are managing a newly diagnosed condition, our professional, caring team is here to serve them and all their health-care needs. Adult Day Health This day supervision ensures safety while enhancing the quality of our clients’ time through excellent nutrition, socialization and transportation. Attendant Care In-home personal care provides relief for family caregivers while addressing basic needs from bathing and grooming to light housekeeping and laundry to errands to meal preparation. PACE PACE is a nationally recognized alternative to nursing homes that provides comprehensive healthcare for seniors, especially those on Medicare and Medicaid. Horizon PACE delivers personalized care so seniors can keep living at home and in their communities. Case Management Services Excellent care starts with outstanding case management. That’s why Horizon Adult Health Care provides comprehensive Case Management services across Kentucky. Because we have worked with more than 3,000 families, we know the best resources available and can help navigate the complex health-care and social service needs of Kentucky’s aging and most vulnerable population."
}