{
  "url": "https://ecat.crfsp.org.br/",
  "title": "e-CAT - Central de Atendimento Eletrônico",
  "text": "O respectivo Termo de Uso do Atendimento Eletrônico do CRF-SP estabelece os termos e condições aplicáveis à utilização dos Serviços online, sítio eletrônico https://ecat.crfsp.org.br/, de titularidade do Conselho Regional de Farmácia do Estado de São Paulo – CRF-SP. Ao acessar o Atendimento Eletrônico do CRF-SP, de qualquer forma, todos os Usuários, sejam pessoas físicas ou jurídicas, deverão estar de acordo com estes Termos de Uso do Atendimento Eletrônico do CRF-SP. O CRF-SP poderá, a qualquer tempo e a seu exclusivo critério, modificar ou revisar estes Termos de Uso, visando principalmente a segurança. As informações pertencentes ao CRF-SP e as contidas neste Portal de Serviços, constituem material protegido por direitos autorais. Portanto sua utilização indevida sujeita o Usuário às penalidades previstas em lei, assim como acarretará o imediato cancelamento do uso. I. Acesso e Utilização 1. O acesso e a utilização dos serviços do Atendimento Eletrônico do CRF-SP poderão se dar por meio de computadores e dispositivos móveis, incluindo smartphones e tablets. 2. Para que se possa acessar o Atendimento Eletrônico do CRF-SP é necessário o cadastro do Usuário por meio do endereço eletrônico https://ecat.crfsp.org.br/. 2.1. A Pessoa Física deverá fornecer o número de inscrição no CRF-SP e a inscrição no Cadastro Nacional de Pessoa Física do Ministério da Fazenda – CPF/MF. Em seguida, deverá criar uma senha pessoal e intransferível. 2.2. A Pessoa Jurídica deverá fornecer o número de inscrição no CRF-SP, a inscrição no Cadastro Nacional de Pessoas Jurídicas - CNPJ, a data do último termo lavrado no estabelecimento e o número do termo lavrado. Em seguida, deverá criar uma senha. 3. Todas as informações prestadas devem ser verdadeiras, exatas, atuais e completas e serão mantidas em tais condições durante sua permanência como Usuário. 4. Após a realização do cadastro de primeiro acesso e aceite das condições previstas neste Termo de Uso do Atendimento Eletrônico do CRF-SP, o Usuário receberá no endereço eletrônico (e-mail) constante no cadastro do CRF-SP, um link de ativação. Somente após a confirmação neste link de ativação é que poderá utilizar os serviços contidos no Serviços online. 5. A guarda e sigilo da senha é de responsabilidade do Usuário, não devendo ser disponibilizada a terceiros, sendo o Usuário inteiramente responsável pela confidencialidade, bem como por qualquer atividade que ocorra no âmbito de seu cadastro. O Usuário deverá informar seu próprio endereço eletrônico a ser utilizado para seu cadastro no Atendimento eletrônico, por meio do formulário de atualização cadastral ou outros formulários de requisição de serviços do CRF-SP. O número do CPF ou CNPJ e a senha criada pelo Usuário, serão utilizados para sua identificação e permissão de acesso ao Portal. 6. Os documentos digitais ou digitalizados encaminhados ao CRF-SP deverão estar de acordo com as disposições legais aplicáveis ao caso. 7. A utilização do Atendimento Eletrônico do CRF-SP pelo Usuário será por prazo indeterminado, podendo ser cancelada, total ou parcialmente, a qualquer momento, sem aviso prévio ao Usuário. II. Aceitação do Termo de Uso Ao acessar, navegar ou utilizar o Atendimento eletrônico por meio do sítio eletrônico https://ecat.crfsp.org.br/, o Usuário declara aceitar os termos e condições. Caso não concorde com os termos e condições, não deverá utilizá-lo. O CRF-SP se reserva o direito exclusivo de atualizar os termos unilateralmente e a qualquer tempo, cabendo ao Usuário o acompanhamento destas informações para eventuais atualizações e modificações. O Usuário declara ter lido, estar ciente e de pleno acordo com o conteúdo e condições do Termo de Uso do Atendimento eletrônico do CRF-SP. A marcação do Check-box ao lado do texto “CONCORDO COM OS TERMOS” seguida pelo clique do botão “ACEITAR” e pelo uso dos serviços do portal é considerada, para todos os fins de direito, como aceitação pelo Usuário, via web, de todos os Termos de Uso do Atendimento eletrônico do CRF-SP. III. Responsabilidades 1. Como medida de segurança, o CRF-SP disponibilizará na página de Serviços online acessada pelo Usuário, a data do seu último acesso. 2. Os dados do Usuário serão protegidos por senha para sua segurança e privacidade. O Usuário pode alterar sua senha a qualquer momento. 3. Como medida de segurança, o CRF-SP armazenará o registro de IP (Internet Protocol) da máquina utilizada para acesso ao Atendimento Eletrônico do CRF-SP. 4. O Usuário concorda em notificar imediatamente o CRF-SP sobre qualquer uso que não tenha autorizado ou qualquer quebra de segurança de seu conhecimento. Concorda também, que ao final do acesso, irá assegurar que seu cadastro não seja acessado por terceiros e que trocará sua senha periodicamente. 4.1. O CRF-SP se exime de toda e qualquer responsabilidade pelos danos e prejuízos de qualquer natureza que possam decorrer do acesso, interceptação, eliminação, alteração, modificação, utilização ou manipulação, por terceiros não autorizados, dos arquivos e comunicações transmitidos através do Portal. 5. É vedado ao Usuário, no uso do Atendimento eletrônico utilizar de qualquer conteúdo disponibilizado para fins ilícitos ou que contrariem qualquer lei ou norma da Administração Pública, direta ou indireta. 6. O Usuário, desde já confirma, caso venha a ser chamado a responsável judicial ou extrajudicialmente, pela prática de um ato ilícito e/ou ilegal decorrente da utilização indevida dos serviços desta autarquia, que o CRF-SP não possui qualquer responsabilidade. 7. O CRF-SP poderá efetuar o cancelamento a qualquer momento de qualquer serviço disponibilizado no Atendimento eletrônico, comprometendo-se a realizar seus melhores esforços para avisar os Usuários sobre os prazos previstos de cancelamento. IV. Violação das Condições de Uso 1. O CRF-SP se reserva o direito de bloquear ou cancelar o acesso do Usuário a qualquer momento e sem prévio aviso, caso seja constatada a prática, ainda que potencial, que viole a legislação, seja federal, estadual ou municipal ou que contrarie o Termo de Uso do Atendimento Eletrônico do CRF-SP. 2. O CRF-SP enviará às autoridades competentes, os documentos recebidos dos Usuários que desrespeitem: 2.1. A legislação brasileira de um modo geral e, em especial, as leis de direito autoral e/ou propriedade intelectual. (Lei nº 9.610/98 – direitos autorais) 2.2. Que contenham imagens, mensagens ou qualquer conteúdo de cunho pornográfico, pedófilo, racista, violento, ou ainda ofensivo à honra, à vida privada, à imagem, à intimidade pessoal e familiar, ou de qualquer maneira ofensivo ou contrário às leis. 2.3. Tenha sido produzido com o intuito de cometer fraude ou estimular a prática de condutas ilícitas. 3. Em caso de descumprimento pelo Usuário deste acordo e das condições nele estipuladas, ele será considerado automaticamente rescindido, mantendo-se em vigor somente as cláusulas e condições que por sua natureza devam sobreviver à sua extinção. 4. Na hipótese de qualquer usuário ou terceiro considerar que existem fatos ou circunstâncias que constituam ilícito envolvendo profissionais e/ou estabelecimentos farmacêuticos, cuja apuração seja de competência do CRF-SP, deverá realizar manifestação junto à Ouvidoria do CRF-SP. V. Política de Privacidade 1. O CRF-SP se comprometa a cumprir o disposto na Lei 13.709/2018 e demais normativas que venham a complementá-la ou substituí-la. VI Disposições Diversas 1. O presente Termo de Uso é regido única e exclusivamente pelas leis da República Federativa do Brasil e qualquer discussão judicial que surja tendo por base sua interpretação ou aplicação deverá ser julgada pela Justiça Federal, considerando a natureza autárquica do CRF-SP. 2. Se qualquer cláusula deste Termo for considerada inválida pela autoridade competente, não serão afetadas as cláusulas restantes, que permanecerão em vigor. Por intermédio deste documento, o(a) TITULAR declara ter conhecimento e autorizar de maneira livre, informada e inequívoca o tratamento de seus dados pessoais, em conformidade com a Lei nº 13.709/2018, Lei Geral de Proteção de Dados Pessoais (LGPD), consentindo que o Conselho Regional de Farmácia do Estado de São Paulo, -SP, autarquia federal criada pela Lei nº 3.820/60, inscrito no CNPJ sob o nº 60.975.075-0001/10, com sede na Rua Capote Valente, 487, CEP 05409-001, Jardim América, São Paulo - SP, doravante denominado CONTROLADOR, realize o tratamento de seus dados pessoais, envolvendo operações, tais como coleta, produção, recepção, classificação, utilização, acesso, reprodução, transmissão, distribuição, processamento, arquivamento, armazenamento, eliminação, avaliação ou controle da informação, modificação, comunicação, transferência, difusão ou extração, nos moldes abaixo descritos: DADOS PESSOAIS O CONTROLADOR fica autorizado a tomar decisões referentes ao tratamento e a realizar o tratamento dos seguintes dados pessoais do(a) Titular: DOS DIREITOS DO(A) TITULAR O(A) TITULAR tem direito a obter do CONTROLADOR (CRF-SP), em relação aos dados por ele tratados, a qualquer momento e mediante requisição: I - Confirmação da existência de tratamento; II - Acesso aos dados; III - Correção de dados incompletos, inexatos ou desatualizados; IV - Anonimização, bloqueio ou eliminação de dados desnecessários, excessivos ou tratados em desconformidade com o disposto na Lei nº 13.709; V - Portabilidade dos dados a outro fornecedor de serviço ou produto, mediante requisição expressa e observados os segredos comercial e industrial, de acordo com a regulamentação do órgão controlador; VI - Portabilidade dos dados a outro fornecedor de serviço ou produto, mediante requisição expressa, de acordo com a regulamentação da autoridade nacional, observados os segredos comercial e industrial; VII - Eliminação dos dados pessoais tratados com o consentimento do titular, exceto nas hipóteses previstas no artigo 16 da Lei nº 13.709/2018; VIII - Informação das entidades públicas e privadas com as quais o CONTROLADOR realizou uso compartilhado de dados; IX - Informação sobre a possibilidade de não fornecer consentimento e sobre as consequências da negativa; X - Revogação do consentimento exclusivamente no tocante às hipóteses previstas no artigo 7º, inciso I, c/c o § 5º do artigo 8º, ambos da Lei nº 13.709/2018, mediante solicitação via e-mail ao CONTROLADOR. Os direitos aqui previstos serão exercidos por intermédio das orientações previstas no sítio eletrônico do CONTROLADOR. POLÍTICA DE PRIVACIDADE E DADOS DO USUÁRIO Sua privacidade é importante para o Conselho Regional de Farmácia do Estado de São Paulo, CRF-SP. O preenchimento de formulários ou acesso aos serviços do website pode exigir o processamento de dados pessoais incluindo, mas não limitado a nome do contato, número de inscrição ou registro na autarquia, endereço pessoal, telefone, ou e-mail. Esses dados serão utilizados pelo CRF-SP para os fins indicados neste documento, principalmente para a comunicação com o TITULAR acerca dos serviços físicos e eletrônicos. Com o objetivo de direcionar o desenvolvimento e melhoria da ferramenta ou sítio eletrônico, poderão ser coletados dados de navegação, incluindo, mas não limitados ao sistema operacional/browser, geolocalização, número de acessos, ações na ferramenta, árvore de navegação, tempo na ferramenta, origem da conexão. O CRF-SP utilizará esses Dados Pessoais apenas para fornecer os Serviços ao usuário e para melhorar seus algoritmos, em conformidade com a Lei Geral de Proteção de Dados Pessoais (Lei nº 13.709/2018). Para fins deste Termo de Uso, dados pessoais significa quaisquer informações fornecidas e/ou coletadas pelo CONTROLADOR e/ou o Conselho Federal de Farmácia, por qualquer meio, ainda que públicos, que: (I) identifiquem, ou que, quando usadas em combinação com outras informações tratadas pelo CRF-SP identifiquem um profissional inscrito ou empresa registrada; ou (II) por meio das quais a identificação ou informações de contato de uma pessoa física ou jurídica possam ser derivadas. Os dados pessoais podem estar em qualquer mídia ou formato, inclusive registros eletrônicos ou computadorizados, bem como em arquivos baseados em papel. Os dados pessoais, no entanto, não incluem telefone comercial, número de celular comercial, endereço comercial, e-mail comercial ou outros que sejam identificáveis publicamente em outras plataformas. O usuário concorda com as práticas do CRF-SP relativas a dados, inclusive com a coleta, o uso e o processamento de suas informações, inclusive dados pessoais sensíveis fornecidos pelo usuário quando do cadastro e uso dos serviços do CRF-SP. DA SEGURANÇA DOS DADOS O CONTROLADOR (CRF-SP) responsabiliza-se pela manutenção de medidas de segurança, técnicas e administrativas aptas a proteger os dados pessoais de acessos não autorizados e de situações acidentais ou ilícitas de destruição, perda, alteração, comunicação ou qualquer forma de tratamento inadequado ou ilícito. Em conformidade ao artigo 48 da Lei nº 13.709/2018, o CONTROLADOR comunicará ao(à) TITULAR e à Autoridade Nacional de Proteção de Dados (ANPD) a ocorrência de incidente de segurança que possa acarretar risco ou dano relevantes respectivos dados do(da) TITULAR, bem como a descrição da natureza dos dados pessoais afetados; II - as informações sobre os titulares envolvidos; III - a indicação das medidas técnicas e de segurança utilizadas para a proteção dos dados; IV - os riscos relacionados ao incidente; V - os motivos da demora, no caso de a comunicação não ter sido imediata; e VI - as medidas que foram ou que serão adotadas para reverter ou mitigar os efeitos do prejuízo. O CRF-SP possui várias camadas de segurança, incluindo firewalls, sistemas de proteção contra intrusão e segregação de rede. Desta forma, seus serviços são configurados, monitorados e mantidos de acordo com as melhores práticas, de forma a melhor proteger os dados pessoais fornecidos por intermédio dos serviços contra perda, uso indevido e acesso não autorizado, divulgação, alteração ou destruição. No entanto, prestação de serviços é totalmente imune aos avanços da tecnologia, assim como a eventuais falhas no sistema. DO TÉRMINO DO TRATAMENTO DOS DADOS O CONTROLADOR poderá manter e tratar os dados pessoais do(a) TITULAR durante todo o período de inscrição ou registro profissional, assim como após, sempre para o alcance das finalidades listadas neste termo. Dados pessoais anonimizados, sem possibilidade de associação ao indivíduo, serão mantidos por período indefinido. O(A) TITULAR poderá solicitar via e-mail ou correspondência ao CONTROLADOR, a qualquer momento, que os dados não sejam utilizados nas seguintes hipóteses: Nas demais hipóteses, os dados serão obrigatoriamente mantidos no banco do Conselho Regional de Farmácia, nos termos do artigo 7º da Lei nº 13.709/2018. DA AUSÊNCIA DE COMPARTILHAMENTO DE DADOS COM FINALIDADES DIVERSAS DA CONTIDA NO PRESENTE DOCUMENTO O CONTROLADOR (CRF-SP), informa que não compartilhará os dados pessoais do(a) TITULAR, salvo nas hipóteses previstas neste documento. DAS FINALIDADES DO TRATAMENTO DOS DADOS O tratamento dos dados pessoais listados abaixo, independem de anuência do(a) TITULAR, nos termos do artigo 7º da Lei nº 13.709/2018: I - Para o cumprimento de obrigação legal ou regulatória, tais como, consulta aos profissionais inscritos no sítio eletrônico da autarquia, citação, instauração intimações e demais atos processuais no âmbito de processos éticos, inclusive recursos ao CRF-SP e penalidades, convocações profissionais para fins éticos, de orientação ou em prol da saúde pública, envio de notificação que implique em providências para o regular exercício profissional ou da empresa conforme determina a legislação vigente, envio de comunicações eleitorais, envio de notificação de constituição de créditos tributários (anuidades), envio de boletos relacionados ao pagamento e à cobrança de anuidades; II - Pela administração pública, para o tratamento e uso compartilhado de dados necessários à execução de políticas públicas previstas em leis e regulamentos ou respaldadas em contratos, convênios ou instrumentos congêneres do Conselho Federal de Farmácia; III - Para a realização de estudos por pessoa física pesquisadora ou órgão de pesquisa, garantida, sempre que possível, a anonimização dos dados pessoais; IV - Quando necessário para a execução de contrato ou de procedimentos preliminares relacionados a contrato do qual seja parte o titular, a pedido do titular dos dados; V - Para o exercício regular de direitos em processo judicial, administrativo ou arbitral, esse último nos termos da Lei nº 9.307/96, ou outra que lhe sobrevenha; VI - Para a proteção da vida ou da incolumidade física do titular ou de terceiro; VII - Para a tutela da saúde, exclusivamente, em procedimento realizado por profissionais de saúde, serviços de saúde ou autoridade sanitária; VIII - Quando necessário para atender aos interesses legítimos do controlador ou de terceiro, exceto no caso de prevalecerem direitos e liberdades fundamentais do titular que exijam a proteção dos dados pessoais; IX - Para a proteção do crédito do CONTROLADOR, inclusive quanto ao disposto na legislação pertinente; X - Possibilitar que o CONTROLADOR identifique e entre em contato com o(a) TITULAR para fins de relacionamento acerca da prestação dos serviços públicos. ACEITE O tratamento dos dados pessoais listados abaixo tem as seguintes finalidades, que dependem de anuência do(a) TITULAR, nos termos do artigo 7º da Lei nº 13.709/2018: Por intermédio deste documento, o(a) TITULAR declara ter conhecimento e autorizar de maneira livre, informada e inequívoca o tratamento de seus dados pessoais, em conformidade com a Lei nº 13.709/2018, Lei Geral de Proteção de Dados Pessoais (LGPD), consentindo que o Conselho Regional de Farmácia do Estado de São Paulo, -SP, autarquia federal criada pela Lei nº 3.820/60, inscrito no CNPJ sob o nº 60.975.075-0001/10, com sede na Rua Capote Valente, 487, CEP 05409-001, Jardim América, São Paulo - SP, doravante denominado CONTROLADOR, realize o tratamento de seus dados pessoais, envolvendo operações, tais como coleta, produção, recepção, classificação, utilização, acesso, reprodução, transmissão, distribuição, processamento, arquivamento, armazenamento, eliminação, avaliação ou controle da informação, modificação, comunicação, transferência, difusão ou extração, nos moldes abaixo descritos: DADOS PESSOAIS O CONTROLADOR fica autorizado a tomar decisões referentes ao tratamento e a realizar o tratamento dos seguintes dados pessoais do(a) Titular: DOS DIREITOS DO(A) TITULAR O(A) TITULAR tem direito a obter do CONTROLADOR (CRF-SP), em relação aos dados por ele tratados, a qualquer momento e mediante requisição: I - Confirmação da existência de tratamento; II - Acesso aos dados; III - Correção de dados incompletos, inexatos ou desatualizados; IV - Anonimização, bloqueio ou eliminação de dados desnecessários, excessivos ou tratados em desconformidade com o disposto na Lei nº 13.709; V - Portabilidade dos dados a outro fornecedor de serviço ou produto, mediante requisição expressa e observados os segredos comercial e industrial, de acordo com a regulamentação do órgão controlador; VI - Portabilidade dos dados a outro fornecedor de serviço ou produto, mediante requisição expressa, de acordo com a regulamentação da autoridade nacional, observados os segredos comercial e industrial; VII - Eliminação dos dados pessoais tratados com o consentimento do titular, exceto nas hipóteses previstas no artigo 16 da Lei nº 13.709/2018; VIII - Informação das entidades públicas e privadas com as quais o CONTROLADOR realizou uso compartilhado de dados; IX - Informação sobre a possibilidade de não fornecer consentimento e sobre as consequências da negativa; X - Revogação do consentimento exclusivamente no tocante às hipóteses previstas no artigo 7º, inciso I, c/c o § 5º do artigo 8º, ambos da Lei nº 13.709/2018, mediante solicitação via e-mail ao CONTROLADOR. Os direitos aqui previstos serão exercidos por intermédio das orientações previstas no sítio eletrônico do CONTROLADOR. POLÍTICA DE PRIVACIDADE E DADOS DO USUÁRIO Sua privacidade é importante para o Conselho Regional de Farmácia do Estado de São Paulo, CRF-SP. O preenchimento de formulários ou acesso aos serviços do website pode exigir o processamento de dados pessoais incluindo, mas não limitado a nome do contato, número de inscrição ou registro na autarquia, endereço pessoal, telefone, ou e-mail. Esses dados serão utilizados pelo CRF-SP para os fins indicados neste documento, principalmente para a comunicação com o TITULAR acerca dos serviços físicos e eletrônicos. Com o objetivo de direcionar o desenvolvimento e melhoria da ferramenta ou sítio eletrônico, poderão ser coletados dados de navegação, incluindo, mas não limitados ao sistema operacional/browser, geolocalização, número de acessos, ações na ferramenta, árvore de navegação, tempo na ferramenta, origem da conexão. O CRF-SP utilizará esses Dados Pessoais apenas para fornecer os Serviços ao usuário e para melhorar seus algoritmos, em conformidade com a Lei Geral de Proteção de Dados Pessoais (Lei nº 13.709/2018). Para fins deste Termo de Uso, dados pessoais significa quaisquer informações fornecidas e/ou coletadas pelo CONTROLADOR e/ou o Conselho Federal de Farmácia, por qualquer meio, ainda que públicos, que: (I) identifiquem, ou que, quando usadas em combinação com outras informações tratadas pelo CRF-SP identifiquem um profissional inscrito ou empresa registrada; ou (II) por meio das quais a identificação ou informações de contato de uma pessoa física ou jurídica possam ser derivadas. Os dados pessoais podem estar em qualquer mídia ou formato, inclusive registros eletrônicos ou computadorizados, bem como em arquivos baseados em papel. Os dados pessoais, no entanto, não incluem telefone comercial, número de celular comercial, endereço comercial, e-mail comercial ou outros que sejam identificáveis publicamente em outras plataformas. O usuário concorda com as práticas do CRF-SP relativas a dados, inclusive com a coleta, o uso e o processamento de suas informações, inclusive dados pessoais sensíveis fornecidos pelo usuário quando do cadastro e uso dos serviços do CRF-SP. DA SEGURANÇA DOS DADOS O CONTROLADOR (CRF-SP) responsabiliza-se pela manutenção de medidas de segurança, técnicas e administrativas aptas a proteger os dados pessoais de acessos não autorizados e de situações acidentais ou ilícitas de destruição, perda, alteração, comunicação ou qualquer forma de tratamento inadequado ou ilícito. Em conformidade ao artigo 48 da Lei nº 13.709/2018, o CONTROLADOR comunicará ao(à) TITULAR e à Autoridade Nacional de Proteção de Dados (ANPD) a ocorrência de incidente de segurança que possa acarretar risco ou dano relevantes respectivos dados do(da) TITULAR, bem como a descrição da natureza dos dados pessoais afetados; II - as informações sobre os titulares envolvidos; III - a indicação das medidas técnicas e de segurança utilizadas para a proteção dos dados; IV - os riscos relacionados ao incidente; V - os motivos da demora, no caso de a comunicação não ter sido imediata; e VI - as medidas que foram ou que serão adotadas para reverter ou mitigar os efeitos do prejuízo. O CRF-SP possui várias camadas de segurança, incluindo firewalls, sistemas de proteção contra intrusão e segregação de rede. Desta forma, seus serviços são configurados, monitorados e mantidos de acordo com as melhores práticas, de forma a melhor proteger os dados pessoais fornecidos por intermédio dos serviços contra perda, uso indevido e acesso não autorizado, divulgação, alteração ou destruição. No entanto, prestação de serviços é totalmente imune aos avanços da tecnologia, assim como a eventuais falhas no sistema. DO TÉRMINO DO TRATAMENTO DOS DADOS O CONTROLADOR poderá manter e tratar os dados pessoais do(a) TITULAR durante todo o período de inscrição ou registro profissional, assim como após, sempre para o alcance das finalidades listadas neste termo. Dados pessoais anonimizados, sem possibilidade de associação ao indivíduo, serão mantidos por período indefinido. O(A) TITULAR poderá solicitar via e-mail ou correspondência ao CONTROLADOR, a qualquer momento, que os dados não sejam utilizados nas seguintes hipóteses: Nas demais hipóteses, os dados serão obrigatoriamente mantidos no banco do Conselho Regional de Farmácia, nos termos do artigo 7º da Lei nº 13.709/2018. DA AUSÊNCIA DE COMPARTILHAMENTO DE DADOS COM FINALIDADES DIVERSAS DA CONTIDA NO PRESENTE DOCUMENTO O CONTROLADOR (CRF-SP), informa que não compartilhará os dados pessoais do(a) TITULAR, salvo nas hipóteses previstas neste documento. DAS FINALIDADES DO TRATAMENTO DOS DADOS O tratamento dos dados pessoais listados abaixo, independem de anuência do(a) TITULAR, nos termos do artigo 7º da Lei nº 13.709/2018: I - Para o cumprimento de obrigação legal ou regulatória, tais como, consulta aos profissionais inscritos no sítio eletrônico da autarquia, citação, instauração intimações e demais atos processuais no âmbito de processos éticos, inclusive recursos ao CRF-SP e penalidades, convocações profissionais para fins éticos, de orientação ou em prol da saúde pública, envio de notificação que implique em providências para o regular exercício profissional ou da empresa conforme determina a legislação vigente, envio de comunicações eleitorais, envio de notificação de constituição de créditos tributários (anuidades), envio de boletos relacionados ao pagamento e à cobrança de anuidades; II - Pela administração pública, para o tratamento e uso compartilhado de dados necessários à execução de políticas públicas previstas em leis e regulamentos ou respaldadas em contratos, convênios ou instrumentos congêneres do Conselho Federal de Farmácia; III - Para a realização de estudos por pessoa física pesquisadora ou órgão de pesquisa, garantida, sempre que possível, a anonimização dos dados pessoais; IV - Quando necessário para a execução de contrato ou de procedimentos preliminares relacionados a contrato do qual seja parte o titular, a pedido do titular dos dados; V - Para o exercício regular de direitos em processo judicial, administrativo ou arbitral, esse último nos termos da Lei nº 9.307/96, ou outra que lhe sobrevenha; VI - Para a proteção da vida ou da incolumidade física do titular ou de terceiro; VII - Para a tutela da saúde, exclusivamente, em procedimento realizado por profissionais de saúde, serviços de saúde ou autoridade sanitária; VIII - Quando necessário para atender aos interesses legítimos do controlador ou de terceiro, exceto no caso de prevalecerem direitos e liberdades fundamentais do titular que exijam a proteção dos dados pessoais; IX - Para a proteção do crédito do CONTROLADOR, inclusive quanto ao disposto na legislação pertinente; X - Possibilitar que o CONTROLADOR identifique e entre em contato com o(a) TITULAR para fins de relacionamento acerca da prestação dos serviços públicos. ACEITE O tratamento dos dados pessoais listados tem as seguintes finalidades, que dependem de anuência do(a) TITULAR, nos termos do artigo 7º da Lei nº 13.709/2018 Existe mais de uma conta para esse CPF/CNPJ. Informe o CRF que deseja acessar: Atenção: Informe o seu CRF de 5 ou 6 dígitos. Exemplo: X12345-X ou X123456-X"
}