{
  "url": "https://www.sprintz.com/search/keyword/leather+chair?kwd=leather+chair&page=2",
  "title": "Showing results for: leather+chair in Nashville, Franklin, and Greater Tennessee | Sprintz Furniture | Result Page 2",
  "text": "Results For search Showing results for: leather+chair Filter sort This is just a sample of the huge selection we offer at Sprintz. Come visit one of our convenient locations! Come visit one of our convenient locations! close clear all Compare Compare SIX PIECE SECTIONAL Leather In Motion Collection Retail Price: $11,820 Presidents Day Sale Price: $6,175 In Stock On Display Compare THREE PIECES LOWESEAT WITH AUDIO Leather In Motion Collection Retail Price: $4,000 Presidents Day Sale Price: $2,090 In Stock On Display Compare POWER RECLINER ZERO GRAVITY Leather In Motion Collection Retail Price: $1,850 Presidents Day Sale Price: $950 In Stock On Display Compare Three Piece Power Loveseat Leather In Motion Collection Retail Price: $3,640 Presidents Day Sale Price: $1,900 In Stock On Display Compare Reclining Sofa Leather In Motion Collection Retail Price: $4,750 Sale Price: $1,699 In Stock Limited Quantities Available On DisplayClearance Compare THREE PIECES POWER SOFA Leather In Motion Collection Retail Price: $4,200 Presidents Day Sale Price: $2,185 In Stock On Display Compare Three Piece Power Sofa Leather In Motion Collection Retail Price: $4,000 Presidents Day Sale Price: $2,090 In Stock On Display Compare POWER SOFA Leather In Motion Collection Retail Price: $3,450 Presidents Day Sale Price: $1,615 In Stock On Display Compare Three Piece LOVESEAT Leather In Motion Collection Retail Price: $3,090 Presidents Day Sale Price: $1,520 In Stock On Display Compare Five Piece Sectional Leather In Motion Collection Retail Price: $7,400 Sale Price: $2,699 As-is Clearance Floor Model On Display Compare Zero Gravity Recliner Leather In Motion Collection Retail Price: $4,199 Sale Price: $2,099 As-is Clearance Floor Model On Display Compare Swivel Chair Accent Chair Collection Retail Price: $1,870 Presidents Day Sale Price: $997 In Stock Limited Quantities Available On Display Compare KARINA SWIVEL CHAIR Accent Chair Collection Retail Price: $2,480 Presidents Day Sale Price: $1,425 In Stock Limited Quantities Available On Display Compare"
}