{
  "url": "https://en.wikipedia.org/wiki/Snickers",
  "title": "Snickers - Wikipedia",
  "text": "Snickers Snickers (stylized in all caps) is a chocolate bar consisting of nougat topped with caramel and peanuts, all encased in milk chocolate.[2] The bars are made by the American company Mars Inc. The annual global sales of Snickers is over $380 million,[3][4][5] and it is widely considered the bestselling candy bar in the world.[6][7] Snickers was introduced by Mars in 1930 and named after the Mars family's favorite horse. Snickers has expanded its product line to include variations such as mini, dark chocolate, white chocolate, ice cream bars, and several nut, flavor, and protein-enhanced versions. Ingredients have evolved from its original formulation to adapt to changing consumer preferences and nutritional guidelines. Despite fluctuations in bar size and controversies around health and advertising, Snickers remains a prominent snack worldwide, sponsoring significant sporting events and introducing notable marketing campaigns. History [edit]In 1930,[1] the Mars Candy Factory in Chicago introduced Snickers, named after the favorite horse of the Mars family.[8] The Snickers chocolate bar consists of nougat, peanuts, and caramel with a chocolate coating. After Forrest Mars Sr. took control of his late father's company in the 1960s,[9] Snickers availability was expanded internationally. It launched in Great Britain and West Germany in 1968[10][11] followed by a number of other markets. In both Britain and Ireland, the product was marketed under the name \"Marathon\" instead. This was allegedly done because of the \"Snickers\" name similarity to the local term knickers.[12] In 1990, the name in both countries changed to Snickers[13] to align with the global brand. A Marathon retro edition was sold exclusively at the Morrisons supermarket for three months in 2019.[14] (\"Marathon\" was also the name of an unrelated bar marketed in the 1970s in the United States.) Snickers launched in France in 1989.[15] There are other Snickers products such as Snickers mini (invented by Carlos Calle), dark chocolate, white chocolate, ice cream bars, Snickers with almonds, Snickers with hazelnuts, Snickers with pecans, Snickers peanut butter bars, Snickers protein and Snickers with Extra Caramel, as well as espresso, fiery, and sweet & salty versions.[16][17][18][19][20][21][22] In 2024, Mars and Jel Sert collaborated to market Snickers-flavored pudding and pie mix.[23] Contents [edit]Ingredients [edit]A circa 1939 ingredient list for the original bar included white sugar, sweet milk chocolate, corn syrup, peanuts, milk condensed with sugar, coconut oil, malted milk, egg whites and salt.[24][irrelevant citation] By 2019, the ingredients for the original bar had been changed to: milk chocolate (sugar, cocoa butter, chocolate, skim milk, lactose, milkfat, soy lecithin), peanuts, corn syrup, sugar, palm oil, skim milk, lactose, salt, egg whites, artificial flavor.[25] Caloric value [edit]The USDA lists the caloric value of a 2-ounce (57 gram) Snickers bar as 280 kilocalories (1,200 kJ).[27] As of 2018 a British markted bar has a weight of 48 g (1.7 oz), with 245 kcal,[28] and the Canadian bar 52 g (1.8 oz) with 250 kcal.[citation needed] Bar weight [edit]Over the years, the bar weight has decreased: Before 2009, in the UK a single Snickers bar had a weight of 62.5 g (2.20 oz). This weight was subsequently reduced to 58 g (2.0 oz) in 2009,[29] and to 48 g (1.7 oz) in 2013.[30] In the United States the listed weight in 2018 was 52.7 g. In Australia, Snickers bars were originally made locally and weighed 53 g (1.9 oz), however in the late 2010s production moved to China and the bars were shrunk to 50 g (1.8 oz). In 2022, production returned to Australia and bars further reduced in weight to 44 g (1.6 oz).[citation needed] Products containing Snickers [edit]Deep fried chocolate bars (including Snickers and Mars bars) became a specialty in fish and chips shops in Scotland in 1995,[31] it also became popular at American state fairs in the early 2000s.[32] The cooked product contains approximately 450 calories (1,900 kJ) per bar.[33] In 2006, the British Food Commission highlighted celebrity chef Antony Worrall Thompson's \"Snickers pie\",[34] which contained five Snickers bars among other ingredients, suggesting it was one of the unhealthiest desserts ever; one slice providing \"over 1,250 calories (5,200 kJ) from sugar and fat alone\", more than half a day's requirement for an average adult. The pie had featured on his BBC Saturday programme some two years earlier and the chef described it as an occasional treat only.[35] Advertising [edit]\"It's so satisfying\" [edit]In 1980, Snickers (and Marathon) ran ads which featured a variety of everyday people discussing why they like Snickers. The ads featured a jingle that said \"It's so satisfying\" and depicted a hand that would open and close showing a handful of peanuts converting to a Snickers bar. \"Packed with peanuts, Snickers really satisfies\" was shown in the commercials.[36] 1984 Olympics [edit]Mars paid $5 million to have Snickers and M&M's named the \"official snack\" of the 1984 Summer Olympics, outraging nutritionists.[37] Sports promotions in international games continued to be a prominent marketing tool for Mars, keeping Snickers as an international brand while also selling local bars in some markets.[38] Not Going Anywhere For a While? [edit]Beginning in 1995, Snickers ran ads which featured someone making a self-inflicted mistake, with the voice-over saying \"Not going anywhere for a while? Grab a Snickers!\" The tag line at the end of each ad proclaimed, \"Hungry? Why Wait?\" Later ads have used the tagline “Rookie mistake? Maybe you just need a Snickers.” Some of the ads were done in conjunction with the National Football League, with whom Snickers had a sponsorship deal at the time. One ad featured a member of the grounds crew at Arrowhead Stadium painting the field for an upcoming Kansas City Chiefs game in hot, late-summer weather. After finishing one of the end zones, and visibly exhausted, one of the Chiefs players walks up to him and says the field looks great, \"but who are the Chefs?\", showing that despite all the hard work the painter accidentally omitted the \"i\" in Chiefs.[39] Another had Marv Levy in the Buffalo Bills locker room lecturing his team that \"no one's going anywhere\" until the Bills figure out how to actually win a Super Bowl.[40] Snickers Feast [edit]In 2007, Snickers launched a campaign which featured Henry VIII and a Viking among others who attend the \"Snickers Feast\".[41][42] It consisted of various commercials of the gang and their adventures on the feast.[43][44] Super Bowl XLI commercial [edit]On February 4, 2007, during Super Bowl XLI, Snickers commercials aired. This resulted in complaints by gay and lesbian groups against the maker of the candy bar, Masterfoods USA of Hackettstown, New Jersey, a division of Mars, Incorporated. The commercial showed a pair of auto mechanics accidentally kissing while sharing a Snickers bar. After quickly pulling away, one mechanic sheepishly says, \"I think we just accidentally kissed.\", and another mechanic frantically exclaims, \"Quick! Do something manly!\" and in three of the four versions, they do so mostly in the form of injury, including tearing out chest hair, striking each other with a very large pipe wrench, and drinking motor oil and windshield washer fluid. In the fourth version, however, a third mechanic shows up and asks \"Is there room for three in this Love Boat?\" Complaints were lodged against Masterfoods that the ads were homophobic. Human Rights Campaign president Joe Solmonese is quoted as saying, \"This type of jeering from professional sports figures at the sight of two men kissing fuels the kind of anti-gay bullying that haunts countless gay and lesbian school children on playgrounds all across the country.\"[45] Gay and Lesbian Alliance Against Defamation (GLAAD) president Neil Giuliano said \"That Snickers, Mars and the NFL would promote and endorse this kind of prejudice is simply inexcusable.\" Masterfoods has since pulled the ads and the website.[45][46][47] Mr. T [edit]In 2006, Mr. T starred in a Snickers advertisement in the UK where he rides up in an army tank and shouts abuse at a football player who appears to be faking an injury, threatening to introduce him to his friend Pain. Another advertisement featured Mr. T launching bars at a swimmer who appeared to refuse to get in a swimming pool because of the cold temperature of the water. In 2008, a European Snickers commercial in which Mr. T uses a Jeep-mounted Minigun to fire Snickers bars at a speedwalker for being a \"disgrace to the man race\" was pulled after complaints from a US pressure group that the advertisement was homophobic.[48] These advertisements usually ended with Mr. T saying \"Snickers: Get Some Nuts!\" NASCAR [edit]In NASCAR racing, Snickers (and the rest of the Mars affiliated brands) sponsored Kyle Busch's No. 18 Toyota for Joe Gibbs Racing. Prior to that the brand served as a primary sponsor for Ricky Rudd's No. 88 Robert Yates Racing Ford as well as an associate sponsor for the team's No. 38 car driven first by Elliott Sadler and then by David Gilliland, and an associate sponsor for the MB2 Motorsports No. 36 Pontiac driven by Derrike Cope, Ernie Irvan, Ken Schrader, and others. In 1990, Bobby Hillin drove for Stavola Brothers Racing in the No. 8 Snickers Buick, marking the candy's first appearance as a sponsor; it had since been driven by Rick Wilson and Dick Trickle. Mars announced that at the conclusion of the 2022 NASCAR Cup Series season, they would pull their sponsorship from not only Joe Gibbs Racing, but NASCAR entirely and it was replaced by Monster Energy.[citation needed] FIFA World Cup and UEFA Euro sponsorship [edit]Snickers was the Official Sponsor of the FIFA World Cup from 1994 until 1998 editions and the 1996 UEFA European Championship. Snickers was also the main sponsor of the Champions League in 1992–93 and 1993–94, Asian Cup 2011 and African Cup of Nations 2019.[citation needed] You're Not You When You're Hungry [edit]In 2010, a new advertising campaign was launched, usually based around people turning into different people (usually celebrities) as a result of hunger (taking the new campaign's name \"You're Not You When You're Hungry\" quite literally). The tagline varied depending on the commercial's location or what variety the commercial is showing. The American adverts initially ended with the tagline \"Snickers Satisfies\". Steve Burns, best known as the first host of the children's show Blue's Clues has done the voice of the announcer.[49] BBDO New York said this campaign made Snickers the number one candy bar, up from seventh. In 2020, USA Today's Ad Meter named it the best Super Bowl campaign of the past 25 years.[50] In 2010, Betty White and Abe Vigoda appeared in the first Snickers commercial in this campaign, playing American football. The commercial was ranked by ADBOWL as the best advertisement of the year. This commercial was also briefly spoofed in an episode of SportsNation on ESPN2 with Michelle Beadle playing the role instead of Betty White in 2011.[51] Later that year, Snickers commercials featured singers Aretha Franklin and Liza Minnelli, and comedians Richard Lewis and Roseanne Barr. A 2011 commercial featured actors Joe Pesci and Don Rickles.[citation needed] In Latin America, the slogan was the same as in the UK version, except that men doing extreme sports turning into the Mexican singer Anahí as a result of hunger.[52] Brazilian versions of the ad featured actresses Betty Faria and Cláudia Raia. In 2013, Robin Williams and Bobcat Goldthwait appeared in a Snickers football commercial. Russian duo t.A.T.u. appeared in a Japanese Snickers commercial as themselves throwing a tantrum in a baseball game before eating the chocolate reverts them into normal baseball players.[53] In March 2014, a commercial featuring Godzilla was released to promote the 2014 Godzilla film. In the commercial, Godzilla is shown hanging out with humans on the beach, riding dirt bikes, and water skiing; he only begins rampaging once he is hungry. After being fed a Snickers bar, he resumes having fun with the humans.[54] In February 2015, Snickers' Super Bowl XLIX commercial featured a parody of a scene from an episode of The Brady Bunch entitled \"The Subject Was Noses.\" In the commercial, Carol and Mike try to calm down a very angry Machete (played by Danny Trejo). When the parents give Machete a Snickers bar, he reverts into Marcia before an irate Jan (played by Steve Buscemi) rants upstairs and walks away. In a second commercial set earlier, Marcia (as Machete) angrily brushes her hair while yelling through her door.[55][56][57] In 2016, for Super Bowl 50, another Snickers commercial was made, featuring Willem Dafoe (as Marilyn Monroe) and Eugene Levy, where Willem Dafoe complains about filming the iconic \"subway grate\" scene in The Seven Year Itch. After being given a Snickers, he turns into Marilyn and goes ahead with the scene, with Levy operating the fan below, commenting that the scene will not make the movie's final cut, that nobody would want to see it. That same year, the Middle East produced their own Snickers commercial featuring DC Comics' The Joker as the recipient of the Snickers bar, before turning back into a casual poker playing buddy.[58] In 2018, Brazil World Cup winner Ronaldo is seen celebrating a goal for Argentina. When he notices the confused faces around him, he eats a Snickers and returns to normal.[59] The UK version of the campaign usually used British celebrities and, up until 2018, retained the slogan from the Mr. T. era. In the initial advertisement, Joan Collins and Stephanie Beacham featured as locker room footballers who had turned into them due to being hungry. In 2014, Rowan Atkinson as Mr. Bean returned on television by appearing on several UK Snickers commercials and cinema spots, in place of a martial arts master who had turned into him as a result of hunger.[60] Later, in 2018, Elton John appeared in an advertisement where he turned into African American rapper Boogie after he eats a Snickers; the latter had turned into the former due to hunger (the slogan appeared on a turntable in this advertisement).[citation needed] Nitro sponsorship [edit]In 2013, Snickers began to sponsor Nitro at Six Flags Great Adventure.[61] Maybe You Just Need A Snickers [edit]In 2020,[62] a new campaign was trialed, focusing on the theme of people doing things that contradicted what they think they are doing, such as a man crawling along rocky ground when he thought he was climbing a rock face, the new slogan for this commercial, \"Confused? Maybe you just need a Snickers\", indicating hunger-induced confusion. Nitro at Six Flags Great Adventure also features this advertisement style (see above). This campaign was revived in the UK in 2024 to promote the 2024 UEFA European Football Championships, featuring footballers Bukayo Saka and Luka Modrić.[63] In 2025, Snickers announced an ambassador for their brand- Mingyu from popular boy group Seventeen. WrestleMania [edit]Snickers has been an official sponsor of WWE's WrestleMania events, including WrestleMania 2000, 22, 32, 33, 34, 35, 36, 37, 38, 39, XL and now 41. while its Cruncher variant sponsored WrestleMania X-Seven, XIX, XX and 21.[64][65] Since then, Snickers has sponsored superstars such as Enzo Amore and Big Cass with their signature term, SAWFT, which is labelled at the back of the chocolate bar.[66] Six Flags Fright Fest [edit]Since 2011, Snickers has been the official sponsor of Six Flags' annual Fright Fest event at its theme parks.[67][68] Controversy [edit]King-Size phaseout [edit]A replacement for the king size Snickers bar was launched in the UK in 2004, and designed to conform to the September 2004 Food and Drink Federation (FDF) \"Manifesto for Food and Health\". Part of the FDF manifesto was seven pledges of action to encourage the food and drink industry to be more health conscious.[69] Reducing portion size, clearer food labels, and reduction of the levels of fat, sugar, and salt were among the FDF pledges. Mars Incorporated pledged to phase out their king-size bars in 2005 and replace them with shareable bars. A Mars spokesman said: \"Our king-size bars that come in one portion will be changed so they are shareable or can be consumed on more than one occasion. The name king-size will be phased out.\"[69] These were eventually replaced by the 'Duo' – a double bar pack. Though this change to Duos reduced the weight from 3.5 to 3.29 ounces (99 to 93 g), the price remained the same. The packaging has step-by-step picture instructions of how to open a Duo into two bars, in four simple actions.[70] As Mars stated fulfillment of their promise, the Duo format was met with criticism by the National Obesity Forum and National Consumer Council.[71] Australian recall [edit]In December 2000, tens of thousands of Snickers and Mars Bars were removed from New South Wales store shelves due to a series of threatening letters which resulted in fears that the chocolate bars had been poisoned.[72] Mars received letters from an unidentified individual indicating that they planned to plant poisoned chocolate bars on store shelves.[72] The last letter sent included a Snickers bar contaminated with a substance which was later identified as rat poison.[72] The letters claimed that there were seven additional chocolate bars which had been tampered with and which were for sale to the public.[72] As a precautionary measure, Mars issued a massive recall.[72] Mars said that there had been no demand for money and complaints directed to an unidentified third party.[72] Accusations of homophobia [edit]Snickers aired a commercial in Spain in August 2021. The 20-second video featured Spanish influencer Aless Gibaja at a restaurant, ordering \"a sexy orange juice with Vitamins A, B, and C.\" A nearby friend, seeming confused, offers a Snickers bar—as part of the candy bar's ongoing marketing slogan of \"You're not you when you're hungry\"—and Gibaja is seemingly transformed into a bearded man with a low voice.[73] The video began circulating online after airing, and received criticism as it was perceived to be homophobic. Irene Montero, Spain's Minister for Equality, condemned the commercial, questioning \"to whom it might have seemed like a good idea to use homophobia as a business strategy\". She also added that it was \"shameful and unfortunate\" for Snickers to \"continue to perpetuate stereotypes and promote homophobia\".[74] Snickers later ceased airing the commercial and issued an apology for \"any misunderstanding\".[75] Snickers products [edit]The following variants are available in the United States.[76] - Snickers Original - Snickers Milk Chocolate - Snickers Almond - Snickers Peanut Butter - Snickers Pecan - Snickers White Chocolate - Snickers Peanut Brownie - Snickers Almond Brownie Dark Chocolate - Snickers Ice Cream[77] - Snickers Ice Cream Bars[77][78] - Snickers 100 Calories Chocolate - Snickers Creamy Peanut Butter - Snickers Crunchy Peanut Butter - Snickers Easter Egg - Snickers Squares - Snickers Candy Cane See also [edit]References [edit]- ^ a b \"Global Brands > Snickers\". Mars. Archived from the original on July 28, 2011. - ^ \"Snickers Candy Bar\". Zeer.com. Archived from the original on February 26, 2010. Retrieved January 15, 2010. - ^ Schultz, E.J. (September 20, 2012). \"Snickers Surging to Top of Global Candy Race\". Ad Age. Retrieved November 1, 2022. - ^ Bhasin, Hitesh (December 4, 2017). \"SWOT Analysis of Snickers\". Marketing91. Retrieved November 21, 2023. - ^ \"Top 10 Largest Candy Brands in the United States\". Zippia. April 24, 2023. Retrieved November 21, 2023. - ^ Mychelle, Blake. \"Best Selling Candy Bars Around the World\". LoveToKnow. Retrieved November 21, 2023. - ^ Hanson, Dana (April 6, 2023). \"The 10 Best Selling Candy Bars of All-Time\". Money Inc. Retrieved November 21, 2023. - ^ Voorhees, Don (2004). Why Do Donuts Have Holes?: Fascinating Facts About What We Eat And Drink. Citadel. p. 141. ISBN 978-0806525518. - ^ Week, Marketing (March 3, 1995). \"Life in Mars: Some facts\". Marketing Week. Retrieved October 4, 2025. - ^ \"Snickers: Zutaten, Produkte, Werbung\". www.24rhein.de (in German). January 22, 2021. Retrieved October 4, 2025. - ^ \"Our Story\". SNICKERS®. Archived from the original on April 3, 2025. Retrieved October 4, 2025. - ^ \"Sorry boomers – changing Snickers to Marathon bars won't bring your hairline back\". The Independent. September 21, 2024. Retrieved October 4, 2025. - ^ \"The Marathon candy bar\". The Christian Science Monitor. March 18, 1999. Archived from the original on July 6, 2006. Retrieved July 19, 2018. - ^ \"Snickers bars to be called Marathon again after nearly 30 years\". The Independent. London. September 15, 2019. Retrieved April 19, 2022. - ^ \"À propos de SNICKERS\" (in French). - ^ \"[UPDATED] Snickers' Three New Flavors Are Now in Stores\". Delish. June 14, 2018. Retrieved July 1, 2018. - ^ \"Food Facts & Trivia: Snickers Candy Bar\". foodreference.com. - ^ \"10 Things You Didn't Know About Snickers\". The Daily Meal. November 4, 2014. - ^ \"The Story of How the Snickers Was Invented | Synonym\". classroom.synonym.com. - ^ \"History of Snickers Candy Bar | History of Things\". October 14, 2009. Archived from the original on October 22, 2019. Retrieved September 3, 2020. - ^ \"Snickers candy bar\". OldTimeCandy.com. - ^ \"Snickers the Candy (Not the Horse) | History of Candy\". sites.psu.edu. - ^ Cory Alden (May 10, 2024). \"Mars Launched Two New Flavors with Their Jel Sert Collab\". fastfoodclub.com. - ^ \"Mars Inc. History\". Made-in-Chicago Museum. Retrieved February 18, 2019. - ^ \"SNICKERS Singles Size Chocolate Candy Bars, 1.86 oz\". Snickers.com. Mars Wrigley. Retrieved May 28, 2024. - ^ United States Food and Drug Administration (2024). \"Daily Value on the Nutrition and Supplement Facts Labels\". FDA. Archived from the original on March 27, 2024. Retrieved March 28, 2024. - ^ \"Candies, MARS SNACKFOOD US, SNICKERS Bar (NDB No. 19155)\". USDA Nutrient Database. USDA. Archived from the original on March 3, 2015. Retrieved November 14, 2011. - ^ Snickers 48g – Nutrition, marsnutrition.co.uk - ^ Wilkerson, Becky (June 3, 2009). \"Mars and Snickers reduce bar sizes but not prices\". Marketing Magazine. Retrieved March 31, 2016. - ^ \"Mars and Snickers shrink but prices stay the same\". The Daily Telegraph. London. December 16, 2013. Retrieved March 31, 2016. - ^ \"Deep-fried Mars myth is dispelled\". BBC News. December 17, 2004. Retrieved June 16, 2009. - ^ \"Deep-Fried Sugary Treats Rule Fairgrounds\". ABC News. United States. Retrieved January 25, 2022. - ^ \"Fat Festival? Calories in Food at the Fair\". Retrieved August 13, 2009. - ^ \"Food – Recipes – Snickers pie\". BBC. Archived from the original on March 9, 2006. Retrieved June 16, 2009. - ^ \"Celebrity recipe 'most unhealthy'\". BBC News. February 5, 2006. Retrieved June 16, 2009. - ^ Snickers Commercial from 1980 (featuring KD) \"It's So Satisfying\", October 19, 2008, retrieved November 22, 2023 - ^ \"Nutritionists soured by Olympic candy endorsement\". UPI. December 6, 1983. - ^ Richard Varey (September 11, 2002). Marketing Communication: A Critical Introduction. Routledge. pp. 141–. ISBN 978-1-134-58159-7. - ^ \"Snickers Adverts And Commercials Archive CHEFS\". AdvertoLog.com. March 15, 2015. Archived from the original on April 2, 2015. Retrieved March 15, 2015. - ^ Pollack, Jordan (June 30, 1997). \"THE MARKETING 100: SNICKERS: SANTA CRUZ HUGHES\". Advertising Age. Retrieved November 23, 2015. - ^ Elliott, Stuart (March 3, 2009). \"The vocabulary of snacking, lightly sweetened\". The New York Times. ISSN 0362-4331. Retrieved May 16, 2023. - ^ Blogs, Adweek (August 29, 2007). \"Historical figures hit the road with Snickers\". adweek.com. Retrieved May 16, 2023. - ^ Dilworth, Dianna (March 3, 2008). \"Snickers satisfies with a feast on its Web site\". DMNews. Retrieved May 16, 2023. - ^ SNICKERS Feast, December 31, 2007, retrieved May 16, 2023 - ^ a b Snickers Ad of Men Accidentally Kissing Pulled After Complaints From Gay Groups, FOX Business. Article retrieved October 17, 2007. - ^ Super Bowl Controversy Archived February 8, 2007, at the Wayback Machine, FOX sports. Article retrieved February 6, 2007. - ^ Thulasi Srikanthan (February 7, 2007). \"entertainment | Snickers bicker feeds ad flap\". TheStar.com. Toronto. Retrieved June 16, 2009. - ^ Sweney, Mark (August 4, 2008). \"Don't give us none of that jibba jabba\". The Guardian. London. Retrieved June 16, 2009. - ^ \"At FanX, 'Blue's Clues' star Steve Burns gets nostalgic\". - ^ Wingate, Keira (January 10, 2022). \"Behind Betty White's 2010 Super Bowl spot for Snickers: The commercial kicked off a campaign that catapulted the brand from seventh place into category leadership\". Ad Age. Vol. 93, no. 1. p. 17. - ^ \"Super Bowl Ad FAIL by ESPN2 SportsNation's Michelle Beadle\". February 2, 2011. Retrieved February 2, 2011. - ^ \"Anahí se transforma en \"Carlos\" para comercial de chocolate\". People en Español (in Spanish). Retrieved March 20, 2018. - ^ Green, Scott (October 18, 2013). \"VIDEO: Pop Duo t.A.T.u Featured in Japanese Snickers Promo\". Crunchyroll. Retrieved October 10, 2022. - ^ \"Snickers TV Spot, 'Godzilla'\". ISpot.tv. March 13, 2015. Retrieved March 13, 2015. - ^ Chitwood, Adam (February 2, 2015). \"Watch This Year's Best Super Bowl Commercials\". Collider.com. Retrieved February 5, 2015. - ^ \"Super Bowl Ad 2015: SNICKERS \"The Brady Bunch\" Danny Trejo\". January 31, 2015. Archived from the original on December 12, 2021. Retrieved March 24, 2020 – via YouTube. - ^ \"Machete Kills the Brady Bunch for Snickers\". February 2, 2015. - ^ \"Joker ratchets up the craziness in this freaky Snickers spot\". Comic Book Resources. June 2, 2016. - ^ \"Brazilian Ronaldo Featured in Snickers Campaign\". Sports Business Daily. Retrieved September 7, 2018. - ^ \"Snickers TV Spot, 'Godzilla'\". ISpot.tv. October 6, 2014. - ^ Great Adventure, Six Flags. \"Nitro- Six Flags Great Adventure\". Six Flags Great Adventure. Retrieved January 23, 2024. - ^ \"Snickers (History, FAQ, Marketing & Commercials) – Snack History\". September 22, 2021. Retrieved March 25, 2024. - ^ Bamford, Abbey (March 27, 2024). \"Snickers kicks off 'Own Goal' campaign with Modrić and Saka\". Retrieved August 18, 2024. - ^ \"Snickers, WWE 2K23 return as presenting partners for WrestleMania\". sportsbusinessjournal.com. February 22, 2023. Retrieved January 10, 2024. - ^ \"Snicker's Cruncher, Subway and Stacker 2's YJ Stinger Are Official ...\" corporate.wwe.com. October 16, 2003. Retrieved January 10, 2024. - ^ \"How you doin'? Enzo, Big Cass and WWE fans' favorite catchphrase\". For The Win. April 1, 2017. Retrieved January 10, 2024. - ^ \"Mars expands marketing partnership with Six Flags | Snack Food & Wholesale Bakery\". snackandbakery.com. Retrieved January 10, 2024. - ^ \"The Scare Returns – Six Flags Fright Fest Presented by SNICKERS – The Biggest, Most Terrifying Halloween Celebration on the Planet is Baaack\". investors.sixflags.com. Retrieved January 10, 2024. - ^ a b Fleming, Nic, Chocolate bars cut down to size[dead link], telegraph.co.uk. September 27, 2004, retrieved December 8, 2006. Quote is from Michael Jenkins (external affairs director at Masterfoods, as parent company was then known). - ^ The Rise and Fall of 'King-Size' Chocolate Bars (UK), h2g2 at bbc.co.uk. Article retrieved December 8, 2006. - ^ Hickman, Martin, \"Chocolate makers eat their words on king-size snacks\", The Independent (London). Article written January 6, 2006. Retrieved December 8, 2006. - ^ a b c d e f \"Mars, Snickers Recalled Due to Poison Threat\", health.dailynewscentral.com. July 1, 2004. Archived October 6, 2014, at the Wayback Machine - ^ Woodyatt, Duarte Mendonca, Amy (August 7, 2021). \"Snickers pulls Spanish advert after homophobia accusations\". CNN. {{cite news}} : CS1 maint: multiple names: authors list (link) - ^ Kassam, Ashifa (August 6, 2021). \"Snickers Spain pulls advert after accusations of homophobia\". The Guardian. - ^ \"Snickers Spain pulls TV advert after homophobia accusations\". BBC. August 6, 2021. - ^ \"All Snickers Products\". snickers.com. Retrieved April 18, 2022. - ^ a b \"SNICKERS Ice Cream: Ice Cream Bars, Ice Cream Pints\". - ^ \"Snickers JUST Dropped NEW Peanut Brownie Ice Cream Bars, and We've Already Got a Craving\". Taste of Home. December 15, 2020. Archived from the original on January 18, 2022. Retrieved April 19, 2023."
}