{
  "url": "https://en.m.wiktionary.org/wiki/uncle",
  "title": "uncle - Wiktionary, the free dictionary",
  "text": "uncle English [edit]Etymology [edit]From Middle English uncle, borrowed from Anglo-Norman uncle and Old French oncle, from Vulgar Latin *aunclum, from Latin avunculus (“maternal uncle”, literally “little grandfather”), from Proto-Indo-European *h₂euh₂-n-tlo- (“little grandfather”), a dialectal diminutive of *h₂éwh₂ō (“grandfather, adult male relative other than one’s father”) (whence also Latin avus (“grandfather”)). Displaced native Middle English em (“uncle”) from Old English ēam (“maternal uncle”), containing the same Proto-Indo-European root, and Old English fædera (“paternal uncle”). Compare Saterland Frisian Unkel (“uncle”), Dutch nonkel (“uncle”), German Low German Unkel (“uncle”), German Onkel (“uncle”), Danish onkel (“uncle”). More at eam and eame. Pronunciation [edit]Noun [edit]uncle (plural uncles) - The brother or brother-in-law of one’s parent. - 1907 August, Robert W[illiam] Chambers, chapter I, in The Younger Set, New York, N.Y.: D. Appleton & Company, →OCLC, page 14: - And it was while all were passionately intent upon the pleasing and snake-like progress of their uncle that a young girl in furs, ascending the stairs two at a time, peeped perfunctorily into the nursery as she passed the hallway—and halted amazed. - The male cousin of one’s parent. - (endearing) Used as a fictive kinship title for a close male friend of one's parent or parents. - (euphemistic) Used as a title for the male companion to one's (usually unmarried) parent. - (figuratively) A source of advice, encouragement, or help. - (British, informal, dated) A pawnbroker. - December 1843, William Makepeace Thackeray, \"Grant in Paris\" (review), in Fraser's Magazine - A chain hangs out of the pocket of his velvet waistcoat , by which we may conclude that he has a watch , though we have known many gents whose watches were at their uncle's (as the fashionable term for the pawnbroker goes) - December 1843, William Makepeace Thackeray, \"Grant in Paris\" (review), in Fraser's Magazine - (especially in the Southern US, parts of UK and South Asia) An affectionate term for a man of an older generation than oneself, especially a friend of one's parents, by means of fictive kin. - (Southern US, slang, archaic) An older African-American male. - 1850, Ralph Waldo Emerson, Representative Men: - Plain old uncle as he [Socrates] was, with his great ears, — an immense talker. - (Malaysia, Myanmar, Singapore, Brunei, informal) Any middle-aged or elderly man older than the speaker and/or listener. Usage notes [edit]Uncle is capitalized when it is used as a title with a name: Have you written to Uncle Fred? Synonyms [edit]- (dialectal, Scotland) eam, eme - (archaic or dialectal) nuncle - (India, as a respectful term of address) uncleji - (familiar or endearing) uncley, unclie, uncly Antonyms [edit]- (antonym(s) of “with regard to gender”): aunt - (antonym(s) of “with regard to ancestry”): niece, nephew - (antonym(s) of “African-American”): boy - (antonym(s) of “India”): aunty Hypernyms [edit]- (sibling of someone's parent) auncle, pibling (both nonstandard) Hyponyms [edit]- (brother of someone’s father): paternal uncle - (brother of someone’s mother): maternal uncle - bruncle - co-uncle - cousin-uncle - double uncle - granduncle, great-granduncle, great-uncle - guncle - half-uncle, maternal half-uncle, paternal half-uncle - step-uncle - (uncle gained by marriage): uncle-in-law Derived terms [edit]- agony uncle - auncle - Bob is your uncle - Bob's your uncle - Bob's your uncle and Fanny's your aunt - bruncle - co-uncle - cousin-uncle - cry ~, holler ~, say ~ - double uncle - Dutch uncle - everybody and his uncle - everybody and their uncle - everyone and his uncle - everyone and their uncle - funcle - granduncle - great-granduncle - great-uncle - guncle - half-uncle - if my aunt had balls, she'd be my uncle, if my uncle had tits, he'd be my aunt - I'll be a monkey's uncle - maternal half-uncle - maternal uncle - my sainted uncle - nuncle - paternal half-uncle - paternal uncle - Robert is your uncle - Robert's your uncle - second uncle - step-uncle - taxi uncle - unc - unclecide - uncledom - unclefucker - unclehood - uncle-in-law - Uncle Joe - uncleless - unclely - Uncle Ned - uncle or aunt - Uncle Sam - Uncle Scrooge - uncleship - Uncle Shmuel - Uncle Sugar - Uncle Tom - Uncle Tomahawk - Uncle Whiskers - uncley, unclie, uncly - unclish Related terms [edit]Descendants [edit]Translations [edit]See also: related paternal uncle and maternal uncle for more translations. - The translations below need to be checked and inserted above into the appropriate translation tables. See instructions at Wiktionary:Entry layout § Translations. Interjection [edit]uncle - (US, colloquial) A cry used to indicate surrender. Derived terms [edit]Verb [edit]uncle (third-person singular simple present uncles, present participle uncling, simple past and past participle uncled) - (transitive, colloquial) To address somebody by the term uncle. - (intransitive, colloquial) To act like, or as, an uncle. - 1979, Douglas Adams, The Hitchhiker's Guide to the Galaxy: - Betelgeuse Five, where he both fathered and uncled Ford References [edit]- Douglas Harper (2001–2026), “uncle”, in Online Etymology Dictionary. - “uncle”, in Merriam-Webster Online Dictionary, Springfield, Mass.: Merriam-Webster, 1996–present. Anagrams [edit]Middle English [edit]Alternative forms [edit]Etymology [edit]Borrowed from Anglo-Norman uncle, from Vulgar Latin *aunclum, from Latin avunculus. Pronunciation [edit]Noun [edit]uncle (plural uncles or (rare, West Midlands) unclen) Descendants [edit]References [edit]- “uncle, n.”, in MED Online, Ann Arbor, Mich.: University of Michigan, 2007. Old French [edit]Etymology [edit]From Vulgar Latin *aunclum, from Latin avunculus (“maternal uncle”, literally “little grandfather”). Noun [edit]uncle oblique singular, m (oblique plural uncles, nominative singular uncles, nominative plural uncle) - (Anglo-Norman) alternative form of oncle - c. 1170, Wace, Le Roman de Rou: - D'ambes parz out filz e peres, uncles, nevos, cosins e freres- On both sides there were sons and fathers, Uncles, nephews, cousins and brothers - On both sides there were sons and fathers, - c. 1250, Marie de France, Chevrefeuille: - Tristram en Wales se rala, tant que sis uncles le manda - Tristan returned to Wales, while he waited for his uncle to call on him Scots [edit]Alternative forms [edit]- unkl, uncill, uncul, unkle, unckle, unkill, unckill, unkel, unkell, unckell, unkyll, unkll, unqil, unqill, wncle, wnkill, wnckill, wnkyll, wnkle, wnckle, wnckell, wankall Etymology [edit]From Middle English uncle, borrowed from Anglo-Norman uncle and Old French oncle, from Vulgar Latin *aunclum, from Latin avunculus (“maternal uncle”, literally “little grandfather”), from Proto-Indo-European *h₂ewh₂-n-tlo- (“little grandfather”), a dialectal diminutive of *h₂éwh₂ō (“grandfather, adult male relative other than one’s father”) (whence also Latin avus (“grandfather”)). Noun [edit]uncle (plural uncles) References [edit]- “uncle”, in The Dictionary of the Scots Language, Edinburgh: Scottish Language Dictionaries, 2004–present, →OCLC. - English terms inherited from Middle English - English terms derived from Old French - English terms derived from Middle English - English terms derived from Latin - English terms derived from Proto-Indo-European - English terms derived from Anglo-Norman - English terms derived from Vulgar Latin - English 2-syllable words - English terms with IPA pronunciation - English terms with audio pronunciation - Rhymes:English/ʌŋkəl - Rhymes:English/ʌŋkəl/2 syllables - English lemmas - English nouns - English countable nouns - English terms with quotations - English endearing terms - English euphemisms - British English - English informal terms - English dated terms - Southern US English - South Asian English - English slang - English terms with archaic senses - Malaysian English - Myanmar English - Singapore English - Bruneian English - English interjections - American English - English colloquialisms - English verbs - English transitive verbs - English intransitive verbs - en:Male family members - Middle English terms derived from Old French - Middle English terms derived from Proto-Indo-European - Middle English terms borrowed from Old French - Middle English terms derived from Latin - Middle English terms borrowed from Anglo-Norman - Middle English terms derived from Anglo-Norman - Middle English terms derived from Vulgar Latin - Middle English terms with IPA pronunciation - Middle English lemmas - Middle English nouns - enm:Male family members - Middle English weak nouns - Old French terms inherited from Latin - Old French terms derived from Proto-Indo-European - Old French terms inherited from Proto-Indo-European - Old French terms derived from Latin - Old French terms derived from Vulgar Latin - Old French lemmas - Old French nouns - Old French masculine nouns - Anglo-Norman - Old French terms with quotations - fro:Family - Scots terms derived from Proto-Indo-European - Scots terms derived from Latin - Scots terms derived from Old French - Scots terms inherited from Middle English - Scots terms derived from Middle English - Scots terms derived from Anglo-Norman - Scots terms derived from Vulgar Latin - Scots lemmas - Scots nouns - sco:Male family members"
}