{
  "url": "https://www.reddit.com/r/redgifs/comments/kt2uho/redgifs_official_subreddits_are_here/",
  "title": "Reddit - The heart of the internet",
  "text": "RedGIFs Official Subreddits are here 🎉 Hey Guys, Today we’ve opened up a number RedGIFs official Subreddits for you guys to enjoy and post in. We’ve tried to be pretty inclusive and create Subreddits that reflect a wide array of users/niches/interests and are open to adding more. If you think we’ve missed something out then let us know and if there’s multiple requests then we’ll go ahead and create those subreddits too. We’re happy for anyone to post in the Subreddits, the subs have rules obviously but they’re not restrictive in anyway. We would love new users to Reddit to use these Subs as we’ll help and advise on good redditquette as you do and we’ll be happy to answer questions. I know for new users Reddit can be a little daunting and before you know it you can find yourself banned from Subs without much knowledge of why. Feel free to use these subs to experiment and get used to how everything works and how people like and interact with your posts. The Subreddits are: https://www.reddit.com/r/RedGIFs3some/ https://www.reddit.com/r/RedGIFsAmateur/ https://www.reddit.com/r/RedGIFsEbony/ https://www.reddit.com/r/RedGIFsCosplay/ https://www.reddit.com/r/RedGIFsGay/ https://www.reddit.com/r/RedGIFsLesbian/ https://www.reddit.com/r/RedGIFsSolo/ https://www.reddit.com/r/RedGIFsTrans/ https://www.reddit.com/r/RedGIFsVertical/ https://www.reddit.com/r/RedGIFsOral/ As you can see we thought we’d keep the names pretty self-explanatory in terms of the content those subs are designed for. There is also https://www.reddit.com/r/RedGIFsVerified/ which is a Private Sub for Verified RedGIFs creators which we created so we can announce things that specifically effect verified users. And finally once we get our view counters fixed we will launch https://www.reddit.com/r/RedGIFsBestOf/ which will automatically post trending GIFs and will act as real time trending page for RedGIFs. That won’t be opened up but will have a bot pulling and posting from site."
}