{
  "url": "https://www.tsp.gov/access-your-account/",
  "title": "Access Your Account | The Thrift Savings Plan (TSP)",
  "text": "Access your account Set up your new login for My Account We launched a new version of My Account on June 1, 2022, and all TSP participants must set up login credentials to this new system, even if they had access to My Account prior to June 1, 2022. (Login credentials you set up prior to June 1 will not work.) Follow the prompts to complete this simple, secure setup. Setting up My Account security features and keeping your contact information up to date is essential to protecting your account from fraud and making sure you receive TSP correspondence. With My Account access, youâll be able to use convenient navigation to view and manage your investments, save time by submitting transaction requests online with your electronic signature, and more with simple and secure processes. You can also access My Account by downloading the official TSP Mobile App to your personal device. If you have any trouble setting up access to your TSP account or logging in to My Account, check our troubleshooting tips. Set up account access You can manage your TSP account online in My Account and by phone through the ThriftLine. Access your TSP account online in My Account To manage your TSP savings online, you need to set up a login to My Account. During the setup process, youâll create a username, password, and ThriftLine PIN to access your account. Youâll follow step-by-step prompts to verify your identity, update your contact information, and set up your account security. My Account setup should take 5 to 10 minutes for most TSP participants. You need to receive a one-time passcode to your phone by text message or voice call to verify your identity during the setup process. (Uniformed services members have the option to use a .mil email address to receive the passcode.) Some participants may need to complete additional steps to verify their identity, which could make the process take longer. Change your My Account login information You can change your My Account login information, such as your username, password, and multifactor authentication methods, at any time by logging in to the online account management portal. Youâll use your My Account username and password to log in to the online account management portal, but itâs a system thatâs separate from My Account. You cannot change your login credentials by logging in to My Account directly. Find your My Account username If you forget your username for logging in to My Account, you can request your username online. Reset your My Account password If you forget your password to log in to My Account, you can request to reset your password online. Access your TSP account by phone on the ThriftLine Youâll create a ThriftLine PIN when you set up online access to My Account. Your ThriftLine PIN allows you to authenticate your access by phone to manage your TSP account when you call the ThriftLine. Change your ThriftLine PIN You can change your 6-digit ThriftLine PIN at any time by calling the ThriftLine."
}