{
  "url": "https://dictionary.cambridge.org/dictionary/french-english/maitre",
  "title": "MAÎTRE | translate French to English - Cambridge Dictionary",
  "text": "Translation of maître – French–English dictionary maître [ masculine ]noun /mɛtʀ/ (also maîtresse /mɛtʀɛs/ [ feminine ]) maître nageur maître noun [ masculine ](baignade) maître nageur ● personne qui apprend à nager à qqn swimming instructor Le maître nageur assure la surveillance du bain. The lifeguard is in charge of pool safety. ● personne qu’on prend comme modèle mentor Ce philosophe est son maître à penser. This philosopher is his mentor. Synonym (Translation of maître from the GLOBAL French-English Dictionary © 2018 K Dictionaries Ltd) Translation of maître | PASSWORD French-English Dictionary (Translation of maître from the PASSWORD French-English Dictionary © 2014 K Dictionaries Ltd) Examples of maître maître Nous sommes un parlement maître de son propre calendrier, contrairement à certains parlements nationaux. We are a parliament that is master of its own timetable, unlike some national parliaments. Si nos partenaires reconnaissent notre ordre juridique et nos valeurs, alors, nous avons un partenariat; sinon, il s'agit d'une relation de maître à esclave. If our partners recognise our legal order and values, then a partnership is what we have; if they do not, then the relationship is one of master and servant. Les forces du marché sont un bon serviteur, mais un mauvais maître. Market forces are a good servant, but a bad master. La proposition apporte également des améliorations importantes au plan technique s'agissant, par exemple, des notifications, des fusions transfrontalières ou encore le regroupement de fonds via les structures maître-nourricier. The proposal also makes major technical improvements, for example, notifications, cross-border mergers and the grouping of funds via master-feeder-structures. These examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors."
}