{
  "url": "https://www.britannica.com/place/Haifa",
  "title": "Haifa | Israel, Map, History, & Facts | Britannica",
  "text": "Haifa News • Haifa, city, northwestern Israel. The principal port of the country, it lies along the Bay of Haifa overlooking the Mediterranean Sea. Haifa is first mentioned in the Talmud (c. 1st–4th century ce). Eusebius, the early Christian theologian and biblical topographer, referred to it as Sykaminos. The town was conquered in 1100 by the Crusaders, who called it Caiphas. In later times, it was taken by Napoleon in 1799. Ibrāhīm Pasha, the Egyptian general and viceroy, captured Haifa in 1839 but was compelled to surrender it to Turkey in 1840 under the pressure of the fleets of the European powers, led by Britain. In 1918 British forces occupied the town, and it subsequently (1922) became part of mandated Palestine. Haifa, with its key port and industries, was of great concern to the combatants in the Palestine war of 1948–49. The Arabs and the Haganah, the Jewish defense forces, fought for control of the city, and on April 22, 1948, the Arabs surrendered. Of more than 50,000 Arabs living in Haifa before the war, only about 3,000 subsequently chose to remain under Israeli rule. Despite this, Haifa is still cosmopolitan, with admixtures of Muslim and Christian Arabs (the latter mainly Maronites) and Bahāʾīs. The city is situated on the northern slopes of Mount Carmel, except for the port section on the bay; residential and business districts are on the slopes, and finer residences and many resort hotels on the mountaintop, commanding scenic views of the entire bay area. The lower and upper cities are linked by an underground railway. The deepwater port, developed under the British mandate, was opened in 1933 and expanded extensively after Israel achieved statehood. Principal industries in the area include steel foundries, food processing, shipbuilding (small naval craft, fishing boats), and the production of chemicals, textiles, and cement. Haifa’s petroleum refineries date from 1939 and its steam-driven power plant (the first of its kind in Israel) from 1934. Haifa also has the only subway in Israel, the Carmelit, dating from 1959. - Hebrew: - H̱efa On the slopes of Mount Carmel are the new campuses of the Israel Institute of Technology (Technion; founded 1912 and opened 1924) and the University of Haifa (1964). The city has a large maritime museum (1954) and has many fine parks and gardens; outstanding are the Persian Gardens, containing the tomb of ʿAbd al-Bahāʾ, son of the founder of the Bahāʾī faith. Haifa is the world headquarters of the Bahāʾī movement. In 2008 several of the city’s Bahāʾī monuments and buildings were collectively designated a UNESCO World Heritage site. Pop. (2014 est.) 277,100."
}