{
  "url": "https://www.belmontparkvillage.com/belmont-park/",
  "title": "Belmont Park - Belmont Park Village",
  "text": "Village Hours M-Th 10:00 A.M. - 6:00 P.M. Village Hours Friday & Saturday 10:00 A.M. - 7:00 P.M. Village Hours Sunday 10:00 A.M. - 6:00 P.M. By train from New York City and Long Island Complimentary parking is available in the Belmont Park garage. Here to enhance every moment of your visit, from your arrival to your next discovery. Contact the Concierge at +1 (516) 421-4907 before, during, or after your visit. All the joy of shopping in-person. None of the heavy lifting. Shopping should feel effortless. From your first purchase to your last, we’ll handle your shopping bags so you can enjoy the Village, hands-free. Need somewhere to keep your large bags while you’re in the Village? With our complimentary luggage storage service, we’ll take care of your all-important belongings while you browse the boutiques. Need a place to store your larger bags while you browse? Enjoy complimentary luggage hold at the Concierge, and we’ll take care of your all-important belongings while you browse the boutiques. Park with ease in our Belmont Park Garage, right at the North Entrance, which offers complimentary parking for guests arriving by car. Our complimentary shuttle runs continuously between the Village’s South Entrance and the Elmont-UBS Arena train station for a smooth arrival and departure. Check the “Visit” page for details. Membership is the key to Village life, offering exclusive access to unmissable experiences, special savings, and personalized services. THE HISTORIC RACING LANDMARK Since 1905, Belmont Park Racetrack has been one of the most prestigious venues in American horse racing. Best known as the home of the Belmont Stakes, traditionally the final leg of the Triple Crown, the site has welcomed legendary figures such as The Wright Brothers, Jackie Kennedy, Thomas Edison and Secretariat throughout its history. Currently undergoing a major redevelopment, Belmont Park is set to debut a new state-of-the-art grandstand complete with modern amenities and hospitality—bringing a storied American tradition into the 21st century. THE PREMIER ENTERTAINMENT VENUE Next to the racecourse sits UBS Arena, New York’s newest premier live entertainment and sports venue. Home of the New York Islanders ice hockey team and a cutting-edge venue for concerts and events, the arena was designed to deliver a world-class experience for fans, artists, and athletes alike. Built with fan-first amenities, inspired by the timeless elegance of New York and powered by state-of-the-art technology, the venue is made for music and built for hockey with clear sightlines and premier acoustics. THE HOCKEY TEAM A cornerstone of New York sports heritage, the Islanders have been thrilling fans with electrifying hockey since 1972. With four consecutive Stanley Cup championships and a legacy defined by passion and perseverance, the team remains one of the NHL’s most storied franchises. Now playing at UBS Arena, the Islanders continue to bring world-class hockey to the heart of Long Island. THE NEW STYLE DESTINATION A new chapter in Belmont Park’s evolution, Belmont Park Village brings together designer shopping, delicious dining, and signature guest services in one open-air setting. Discover over 150 boutiques featuring previous seasons’ collections at up to 65% off, alongside an ever-expanding lineup of culinary and hospitality experiences. With its location next to UBS Arena and the Belmont Park Racetrack, Belmont Park Village forms the heart of a one-of-a-kind destination for fashion, sports, and entertainment in metro New York."
}