{
  "url": "https://help.hbomax.com/us-en/Answer/Detail/000002555",
  "title": "HBO Max | Find out what to do if you can't sign in with your internet, mobile, or TV provider.",
  "text": "Can't connect HBO Max provider If you get HBO Max through an internet, mobile, or TV provider, you need to connect your provider account (with your HBO Max subscription) before signing in to HBO Max. If you can't connect your internet, mobile, or TV provider account, find your issue below: If you get this message, make sure HBO Max is included with your internet, mobile, or TV package. To do this, sign in to your internet, mobile, or TV provider account and make sure HBO Max is included. For more info, go to Fix a subscription issue. If you get this message on an Apple device, try removing your TV provider from your iOS or tvOS settings. Here's how: - iPhone or iPad: Go to Settings > General > TV Provider. Under Allow TV provider to access, turn off HBO Max. - Apple TV: Go to Settings > Users and Accounts > TV Provider. Under Allow TV provider to access, turn off HBO Max. Now, reopen HBO Max and try the Connect provider steps again. If your provider isn't on the Connect Your Provider screen, it may be because: - You need to type your provider's name in the search box, or scroll down through the list of providers (below the company logos). - Disney+, Hulu, HBO Max Bundle or Philo: You need to activate HBO Max (instead of connecting your provider). - You need to sign in with your HBO Max account (instead of connecting your provider). - Your provider may not support HBO Max at this time. For more help, go to My provider isn't listed. If you get this message when connecting your provider, it means your provider account is already linked to an HBO Max account. Instead of connecting your provider, try signing in with your HBO Max account email and password. If you're not sure which email is associated with your HBO Max account, go to Find your account email. Make sure you can sign in to your account on your provider's website. Here's how: - Go to your internet, mobile, or TV provider's website. - Sign in with your account username and password. Note If you can't sign in, look for an option to reset your password. If you can't sign in to your provider account, contact them directly for help. HBO Max support doesn't have access to your provider sign-in information. - After you successfully sign in to your provider's website, go back to HBO Max and try the Connect provider steps again. If the connect your provider screen is blank, try the following: - On your iPhone or iPad, go to Settings > General > TV Provider. - Under Allow TV provider to access, turn off HBO Max. - Reopen HBO Max and try the Connect provider steps again. Additional troubleshooting If the solutions above didn't help, choose the device you're using: You may need to try more than one of these solutions: - Delete the HBO Max app from your Apple device. To find out how, go to Apple's Delete an app article. - Open the App Store and install the HBO Max app. - Open HBO Max and try the Connect provider steps again. Try the Connect provider steps on your computer (instead of your iPhone or iPad). Use another browser or try clearing your browsing data. Here's how: - Safari: On your iOS device, go to Settings > Safari, then scroll down and choose Clear History and Website Data. For more info, go to Clear Safari. - Chrome: Try clearing your Chrome browsing data. To find out how to do this, go to Clear cache & cookies. Then, open HBO Max and try the Connect provider steps again. You may need to try more than one of these solutions: - On your Android device, go to Settings and search for HBO Max. - Choose HBO Max from the search results. - Choose Storage & cache or Storage. - Go back and choose Uninstall. - Open the Play Store, search for HBO Max, and choose Install. - Open HBO Max and try the Connect provider steps again. Try the Connect provider steps on your computer (instead of your Android phone or tablet). Use another browser or try clearing your Chrome browsing data on your Android device. To find out how to do this, go to Clear cache & cookies. Then, try the Connect provider steps again. You may need to try more than one of these solutions: - On your Amazon Fire tablet, go to Settings > Apps & Games > Manage All Applications. - Choose HBO Max from the list of apps. - Choose Clear Cache. - Choose Clear Data. - Choose Uninstall and then OK. - Download the HBO Max app from the Amazon Store. - Open HBO Max and try the Connect provider steps again. Try the Connect provider steps on your computer (instead of your Amazon Fire tablet). Try using a different browser or try clearing the browsing data for the browser you're using. Then, open HBO Max and try the Connect provider steps again. You may need to try more than one of these solutions: - Make sure you're using a supported browser. - Check for an updated browser version. To find out how to do this, search the internet for update + the name of your browser (i.e. update Chrome). Try using a different supported browser (Chrome, Firefox, Microsoft Edge, or Safari). This will help determine if the issue is limited to a particular browser. Try the Connect provider steps on your phone or tablet. The connect your provider steps are easier on a phone, tablet, or computer. Try the Connect provider steps on your phone or tablet or on your computer. Once you connect your provider and create an HBO Max account with a password, you can sign in to your HBO Max account on your TV."
}