{
  "url": "https://pt.m.wikipedia.org/wiki/Arquitetura_colonial_do_Brasil",
  "title": "Arquitetura colonial do Brasil – Wikipédia, a enciclopédia livre",
  "text": "Arquitetura colonial do Brasil No Brasil, a arquitetura colonial é definida como a arquitetura realizada no atual território brasileiro desde 1500, ano do descobrimento pelos portugueses, até a Independência, em 1822. Durante o período colonial, os colonizadores importaram as correntes estilísticas da Europa à colônia, adaptando-as às condições materiais e socioeconômicas locais. Encontram-se no Brasil edifícios coloniais com traços arquitetônicos renascentistas, maneiristas, barrocos, rococós e neoclássicos, porém a transição entre os estilos se realizou de maneira progressiva ao longo dos séculos e a classificação dos períodos e estilos artísticos do Brasil colonial é motivo de debate entre os especialistas. A importância do legado arquitetônico e artístico colonial no Brasil é atestada pelos conjuntos e monumentos desta origem que foram declarados Patrimônio Mundial pela UNESCO. Estes são os centros históricos de Ouro Preto, Olinda, Salvador, São Luís do Maranhão, Diamantina, Goiás Velho, Paraty, as ruínas das Missões Jesuíticas Guarani em São Miguel das Missões, o Santuário do Bom Jesus de Matosinhos em Congonhas e a Praça São Francisco em São Cristóvão. Há ainda os centros históricos que, embora não tenham sido reconhecidos como Patrimônio da Humanidade, guardam importantes monumentos daquele período, como os do Recife, do Rio de Janeiro, de São Paulo, de Santana de Parnaíba e de Mariana. Especialmente nos casos do Recife e São Paulo, a demolição e descaracterização da maior parte das construções históricas e do traçado urbano colonial foram decisivas para o não reconhecimento. Povoamentos coloniais e urbanismo [editar | editar código]A atividade arquitetônica no Brasil colonial inicia-se a partir da década de 1530, quando a colonização ganha impulso com a criação das Capitanias Hereditárias (1534) e a fundação das primeiras vilas, como São Vicente, a primeira cidade do país, fundada por Martim Afonso de Sousa em 1532, e Igarassu e Olinda, fundadas por Duarte Coelho cerca de 1535. Mais tarde, em 1549, é fundada a cidade de Salvador por Tomé de Sousa como sede do Governo-Geral. O arquiteto trazido por Tomé de Sousa, Luís Dias, desenha então a capital da colônia, incluindo o palácio do governador, igrejas e as primeiras ruas, largos e casas, além da indispensável fortificação ao redor do povoamento.[1][2][3] A parte mais nobre da cidade de Salvador, que incluía construções em taipa como o palácio do governador, residências e a maioria das igrejas e conventos, foi edificada sobre um terreno elevado, a 70 metros sobre o nível da praia, enquanto junto à baía foram construídas as infraestruturas dedicadas às atividades comerciais. Outras cidades fundadas no século XVI, como Olinda (1535) e o Rio de Janeiro (1565), caracterizam-se por terem sido fundadas perto do mar mas sobre elevações do terreno, dividindo-se o povoamento em uma cidade alta e uma cidade baixa. De maneira geral a cidade alta abrigava a parte habitacional e administrativa e a parte baixa as áreas comercial e portuária, lembrando a organização das principais cidades portuguesas, como Lisboa, Porto e Coimbra, de origem na Antiguidade e época medieval. Essa disposição obedeceu a considerações de defesa, uma vez que nos primeiros tempos os assentamentos coloniais corriam constante risco de ataques de indígenas e europeus de outras nações. De fato, quase todas as primeiros povoados fundados pelos portugueses contavam com muros, paliçadas, baluartes e portas que controlavam o acesso ao interior.[4] O urbanismo colonial no Brasil se caracterizou frequentemente pela adaptação do traçado das ruas, largos e muralhas ao relevo do terreno e posição de edifícios importantes, como conventos e igrejas. Apesar de não seguirem o rígido padrão de tabuleiro de xadrez das fundações espanholas no Novo Mundo, atualmente se considera que muitas cidades coloniais, começando por Olinda e Salvador, tiveram suas ruas traçadas com relativa regularidade.[7][8] Durante o período da União Ibérica (1580-1640), as cidades fundadas no Brasil tiveram maior regularidade, como é o caso de Felipeia da Paraíba (atual João Pessoa), fundada em 1585, e São Luís do Maranhão, traçada em 1615 por Francisco Frias de Mesquita, sendo que a tendência à regularidade dos traçados de centros urbanos aumentou ao longo do século XVII.[4] Destacam-se também as grandes obras urbanísticas realizadas no Recife durante o governo do Conde João Maurício de Nassau (1637-1643), que com o aterramento e construção de pontes, canais e fortes transformou o antigo porto de Olinda em cidade. Um aspecto determinante no urbanismo colonial era a implantação de igrejas e conventos. Frequentemente a construção de edifícios religiosos era acompanhada pela criação de um adro ou uma praça junto ao edifício, assim como uma malha de ruas de acesso, organizando o espaço urbano. Em Salvador, por exemplo, a construção do Colégio dos Jesuítas no século XVI, fora dos muros da cidade, deu origem a uma praça - o Terreiro de Jesus - e fez da área um pólo de expansão da cidade. Outro exemplo notável de espaço urbano colonial é o Pátio de São Pedro, surgido a partir da construção da Concatedral de São Pedro dos Clérigos do Recife (depois de 1728). No Rio de Janeiro, a principal rua colonial, a Rua Direita (atual Rua Primeiro de Março), surgiu como ligação entre o Morro do Castelo, onde havia sido fundada a cidade, e o Mosteiro de São bento, localizado sobre o morro de mesmo nome. Outro aspecto importante era a implantação de monumentos religiosos em lugares altos, às vezes precedidos por escadarias, o que criava paisagens cenográficas de forte caráter barroco. No Rio, por exemplo, muitos mosteiros e igrejas foram construídos sobre morros, com suas fachadas voltadas para o mar, oferecendo um magnífico cenário para os viajantes que adentravam a Baía da Guanabara. A relação privilegiada entre topografia e igrejas também é marcante nas cidades mineiras, especialmente Ouro Preto e no Santuário de Congonhas. Nesta última a igreja de peregrinação se encontra no alto de um morro, precedido por um conjunto de capelas com a via sacra e uma escadaria decorada com estátuas de profetas. No século XVIII, reformas realizadas pelo governo do Marquês de Pombal, ligadas em parte à necessidade de ocupar os limites com a América espanhola, levaram a uma maior presença de engenheiros militares na colônia e à fundação de várias vilas planejadas, nas quais estavam previstos os lugares para os edifícios administrativos, igrejas e símbolos do poder público. Assim, ao longo do século XVIII, muitas vilas foram criadas com urbanismo planificado nos atuais estados do Rio Grande do Sul, Mato Grosso, Goiás, Roraima, Amazonas e outros. Além disso, em alguns lugares se adotaram padrões comuns de fachadas para edifícios com o objetivo de criar um conjunto urbano harmônico, como se observa na cidade baixa de Salvador em meados do século XVIII.[4] Em Minas Gerais, onde o ciclo do ouro favoreceu o rápido crescimento de vilas em terrenos acidentados sem nenhum planejamento, também houve algumas importantes intervenções urbanísticas. O traçado da cidade de Mariana, localizada em um terreno relativamente plano, foi reformada com regularidade em 1745 por José Fernandes Pinto Alpoim. Na mesma época, várias casas foram demolidas no centro de Ouro Preto para a criação de uma monumental praça, a atual Praça Tiradentes, onde foram implantados a Casa da Câmara e o Palácio dos Governadores. Melhoramentos urbanísticos foram mais frequentes à medida que avançou a colonização. Em Salvador, grandes aterros no século XVIII permitiram o desenvolvimento da cidade baixa, antes restrita a uma estreita faixa de terra. No Rio de Janeiro, lagoas e pântanos foram aterrados para permitir a expansão e melhorar a salubridade da cidade. Também no Rio foi construída talvez a maior obra de infraestrutura realizada no Brasil colonial: o Aqueduto da Carioca, inaugurado definitivamente em 1750. O aqueduto trazia água do rio de mesmo nome ao centro da cidade, alimentando vários chafarizes, alguns dos quais ainda existem. Um deles se localizava no Largo do Paço (atual Praça XV), urbanizado no início dos anos 1740 por José Fernandes Pinto Alpoim à imagem da Praça da Ribeira de Lisboa. O cais do largo ganharia mais tarde um monumental chafariz, projetado por Mestre Valentim e terminado em 1789. O Rio de Janeiro, capital da colônia desde 1767, foi o principal foco de intervenções urbanísticas entre os séculos XVIII e XIX. A mais importante foi a criação do Passeio Público entre 1789 e 1793. O desenho do parque, realizado segundo um projeto de Mestre Valentim, incluiu alamedas geométricas arborizadas, fontes e estátuas. Para construir o parque foi necessário uma grande intervenção urbanística, com a destruição de um morro e o aterro de uma lagoa. Mais tarde, com a chegada da Família Real Portuguesa em 1808, o Rio ganhou ainda o Jardim Botânico, o primeiro no Brasil Colônia. Arquitetos [editar | editar código]Os responsáveis pelos projetos arquitetônicos (\"riscos\") da colônia ficaram, em grande parte, no anonimato, até mesmo no caso de alguns grandes conventos e igrejas. Entre os autores conhecidos há religiosos e muitos engenheiros-militares, estes últimos com sólidos conhecimentos teóricos de arquitetura. Outros tinham um conhecimento mais prático, como os mestres-de-obras, mestres-pedreiros e carpinteiros. As ordens religiosas como a dos Jesuítas, Beneditinos, Franciscanos e Carmelitas, das primeiras a se fixarem no Brasil, possuíam em seus quadros arquitetos e construtores notáveis, e com eles se iniciou uma grande tradição de construções religiosas cada vez mais ricas e imponentes. Por exemplo, o arquiteto jesuíta Francisco Dias, que havia trabalhado na construção da igreja jesuíta lisboeta, chegou ao Brasil em 1577. Trabalhou na Igreja da Graça de Olinda (o único dos seus projetos ainda existente), e construiu os colégios jesuítas do Rio de Janeiro, Santos e outros. Outro importante arquiteto religioso foi frei Macário de São João, um beneditino a quem são atribuídos os projetos seiscentistas das igrejas do Mosteiro de São Bento e da Misericórdia de Salvador, entre outros.[9] Os engenheiros militares eram, em sua maioria, portugueses, sendo alguns de outras nacionalidades, especialmente italianos a serviço de Portugal. Estes engenheiros não ergueram apenas fortes, mas foram responsáveis também por delinear povoamentos e projetar edifícios administrativos e até construções religiosas. Um exemplo destacado no século XVII foi Francisco Frias de Mesquita, que esteve no Brasil entre 1603 e 1635 e construiu várias fortalezas, delineou a cidade de São Luís do Maranhão (após 1615) e projetou a igreja do Mosteiro de São Bento do Rio de Janeiro (1617).[10] Ao longo do século XVIII, os engenheiros militares portugueses projetaram algumas das obras mais importantes da arquitetura colonial. José Fernandes Pinto Alpoim, por exemplo, projetou no Rio de Janeiro o Paço Imperial, o Convento de Santa Teresa, urbanizou o Largo do Paço e terminou a obra do Aqueduto da Carioca. Em Minas Gerais, projetou o Palácio dos Governadores de Ouro Preto e delineou a cidade de Mariana. No Rio, a Igreja da Candelária foi projetada por Francisco João Roscio, outro engenheiro militar português. Em Ouro Preto, Pedro Gomes Chaves projetou a Igreja Matriz de Nossa Senhora do Pilar, enquanto que na Bahia, Manuel Cardoso de Saldanha projetou a notável Igreja de Nossa Senhora da Conceição da Praia, com planta e fachada inovadoras. Obviamente, os engenheiros militares portugueses também construíram fortalezas. No sul, por exemplo, José da Silva Pais construiu um elaborado sistema de fortes para defender a Ilha de Santa Catarina. A necessidade crescente de profissionais capacitados nas colônias levou o governo colonial a criar as chamadas Aulas de Fortificação e Arquitetura Militar, que representam as primeiras escolas dedicadas ao ensino de arquitetura no Brasil. A primeira foi criada em Salvador em 1699, junto com a do Recife na mesma época. Em 1735, criou-se uma Aula no Rio de Janeiro, na qual o já citado Pinto Alpoim foi o primeiro professor. A partir dessas aulas começaram a surgir os primeiros engenheiros militares formados no Brasil. Um exemplo destacado foi José António Caldas (1725-1767), nascido na Bahia e aluno de Manuel Cardoso de Saldanha na Aula de Salvador. Trabalhou em vários projetos de engenharia e arquitetura no nordeste, inclusive nas reformas da Catedral de Salvador (já demolida). Foi também enviado à costa ocidental da África para executar tarefas de engenharia. A partir de 1761, foi professor na Aula de Salvador, no qual se havia formado.[11][12] Outros grupos importantes foram os de mestres-pedreiros e mestres-de-obras, que em princípio eram os responsáveis pela execução dos trabalhos mas frequentemente também criaram projetos arquitetônicos. Estes profissionais não tinham formação teórica em arquitetura mas tinham muito conhecimento prático, adquirido nos canteiros de obras. Entre estes profissionais que elaboraram riscos arquitetônicos notáveis está Manuel Ferreira Jácome, mestre-pedreiro, autor da Igreja de São Pedro dos Clérigos no Recife. Em Minas Gerais a presença destes mestres foi muito marcante e incluíram nomes como José Pereira dos Santos, José Pereira Arouca e Francisco de Lima Cerqueira, este último responsável pela Igreja de São Francisco de Assis de São João del-Rei. Também houve criadores de projetos que não foram construtores. Um exemplo importante foi Antônio Pereira de Sousa Calheiros, que era doutor em leis mas que projetou as Igrejas do Rosário de Ouro Preto e Mariana. Luís da Cunha Meneses, governador colonial, projetou a monumental Casa da Câmara e Cadeia de Ouro Preto. Também é importante citar Antônio Francisco Lisboa, o Aleijadinho, que foi primariamente escultor mas também autor de importantes projetos arquitetônicos. Técnicas e materiais [editar | editar código]Paredes [editar | editar código]Inicialmente, a arquitetura colonial utilizou as técnicas da taipa de pilão e pau a pique, de rápida construção e que utilizava materiais abundantes na colônia: barro e madeira. Logo se adotaram também a alvenaria de pedra ou tijolos de adobe para levantar paredes, que permitiam a construção de estruturas maiores e a inclusão de madeiramento para pisos e tetos.[13] O pau a pique, também chamado de taipa de sebe, taipa de mão, taipa de sopapo ou barro armado, foi um dos sistemas construtivos mais utilizados no período colonial. Isso deu-se devido a seu baixo custo, já que todos seus materiais são naturais, além de possuir boa resistência e durabilidade. Era muito conhecido pelos indígenas e pelos negros africanos, e sua maior incidência era nas áreas que correspondem às atuais regiões Nordeste e Sudeste. Sua versão mais pura tem como estrutura mestra peças de madeira compostas por peças horizontais superiores (frechais), peças horizontais inferiores (baldrames) e peças verticais (esteios). As peças são unidas de modo a formar uma trama, amarrada por cordões de seda, linho, cânhamo ou buriti. Por fim, o barro é jogado por cima.[13] Um sistema, parecido com o pau a pique é o enxaimel, comum na região sul, o qual, no entanto, usa alvenaria para a vedação.[13] Outro sistema muito utilizado, principalmente para as divisórias internas é o tabique, que consiste numa estrutura de vigas de madeira revestida por tábuas. É um sistema de grande facilidade e simplicidade em sua execução. Para os sistemas, as madeiras mais utilizadas na época eram de aroeira, braúna, ipê, peroba, jatobá, entre outras.[13] No Brasil o uso da taipa de pilão também se popularizou, basicamente por responder positivamente aos desafios da época, pois quando bem utilizada apresenta um baixo consumo de energia no processo de fabricação. As matérias primas utilizadas na produção da taipa de pilão são de fácil acesso e na maior parte das vezes não é necessário transporte. Além dessa característica a taipa possui uma ótima inércia térmica, ideal para o clima do litoral brasileiro, e permite trocas de umidade com o meio externo.[14] A cantaria era utilizada nos edifícios mais nobres, em geral como reforço nos cunhais (cantos) de edifícios grandes e nas vergas de portais e janelas. Pouquíssimos edifícios foram construídos exclusivamente em cantaria, sendo um exemplo preservado a Casa-Forte de Garcia d'Ávila na Bahia, erguida em sua maior parte no início dos anos 1600. Mesmo nos séculos seguintes poucas igrejas foram construídas com fachadas integralmente de pedra. De início, a alvenaria de pedra foi usada principalmente na construção de fortificações assentadas em pedras secas, sem nivelamento, no sentido de fornecer maior solidez às edificações para resistir aos constantes ataques indígenas, a exemplo da antiga Fortaleza dos Reis Magos em Natal.[15] Com a chegada da companhia jesuíta ao Brasil, fomentou-se o uso da pedra e cal — alvenaria de pedra aparelhada com argamassa de cal e areia — como método construtivo, a maneira da arquitetura portuguesa. Na edificação dos novos monumentos jesuítas no litoral, era comum o uso da pedra do reino, o lioz, uma espécie de semimármore, importado de Portugal já talhado, que vinha trazido como lastro nos navios portugueses, sendo empregado integralmente no Convento Conceição da Lapa.[16] Como cidades litorâneas e de maior importância para a colônia, Rio de Janeiro, Salvador e Recife desfrutaram desse luxo, enquanto que em regiões mais interioranas foi necessária a exploração da matéria-prima de abundância local, de forma que o arenito é muito visto aplicado em alvenaria com argamassa de barro, não apenas em construções de cunho público ou religioso, mas também em moradias.[16] Coberturas [editar | editar código]Nos primeiros tempos, as coberturas das casas eram feitas simplesmente com palha (sapé), como as ocas indígenas ou certas moradias de influência africana, subsistindo ainda hoje em áreas rurais. A telha de barro (cerâmica) foi inicialmente utilizada nos edifícios mais abastados antes de popularizar-se. Dentre os tipos de telha utilizados no período, estão:[13] - telhas canal, também chamadas de telhas colonial, de capa e canal, capa e bica, \"feitas nas coxas\"; fora do Brasil, são conhecidas como telhas árabes ou mouriscas; - telhas francesas, ou marselha; - telhas romanas. Havia vários tipos de tesoura, feitas de madeira, às vezes complementadas por caibros. Um elemento importante dos telhados eram os beirais, que protegiam as paredes de barro das águas da chuva. Era comum que os caibros sob os beirais fossem esculpidos como ornamentação, sendo chamados cachorros. Havia ainda elementos que complementavam ou funcionavam como uma extensão aos telhados principais: as varandas e alpendres. Enfim, os forros em geral eram planos.[13] Esquadrias [editar | editar código]As folhas de portas e janelas eram de madeira, semelhantes às contemporâneas. Havia folhas de réguas (vergas retas), de almofadas, de treliças (urupemas), de rendas de madeira, com postigos, etc. Mais recentemente, surgiram as folhas de pinásios (com espaços para vidros), que substituíram as folhas cegas.[13] As folhas tinham vários modos de funcionamento:[13] - abertura horizontal, ou à francesa, hoje chamada de basculante; - abertura vertical, chamadas de gelosias ou rótulas; - abertura guilhotina, ou à inglesa. No caso de paredes grossas, era comum chanfrar (cortar) a parede ao redor da janela. O espaço maior do vão obtido aumentava a luminosidade do ambiente, e podia receber assentos (conversadeiras). Dentre elementos adicionais, estavam peitoris, sacadas, balcões, muxarabis, seteiras, aldrabas, etc.[13] Pavimentos [editar | editar código]Os pavimentos internos podiam ser pisos de terra batida, pisos de ladrilhos de barro, pisos de tábuas (assoalho, especialmente em pavimentos elevados), ou lajeados (de mármore, no caso de edifícios nobres).[13] Entre os externos, estavam:[13] - lajeados: lajes de pedra (arenitos, gneisses ou calcários), assentados com argamassa de barro; - pés-de-moleque: assentamento de seixos rolados (pedras de rio) sobre a terra batida; - capistranas: assentamento de uma faixa contínua de grandes lajes no meio de uma via pública, ladeada com seixos ou lajes pequenas. Outros [editar | editar código]As pinturas das paredes geralmente eram caiadas, feitas com cal obtida a partir de mariscos, de pedra ou tabatinga. Já as madeiras eram pintadas a cola, têmpera ou óleo. Dentre os corantes usados, estavam o anil ou índigo (azul), o sangue de drago e urucum (vermelho), a açafroa (amarelo), a braúna (preto), o ipê e a cochonilha (cor de rosa).[13] Os alicerces eram em geral fundações diretas (rasas), feitas de alvenaria de pedra. No entanto, nas construções de pau a pique e enxaimel, havia esteios de madeira, tratados com fogo, enterrados com 2 a 4 m de profundidade.[13] Arquitetura religiosa: maneirismo e estilo chão (séculos XVI-XVII) [editar | editar código]Os primeiros templos religiosos construídos no Brasil seguiam o estilo tardo-renascentista ou maneirista português, conhecido como estilo chão. Esta estética caracteriza-se pelas fachadas compostas por figuras geométricas básicas, frontões triangulares, janelas próximas ao quadrado e paredes marcadas pelo contraste entre a pedra e as superfícies brancas, de caráter bidimensional.[17] A decoração é escassa e circunscrita em geral aos portais, ainda que os interiores são ricos em altares, pinturas e azulejos. Assim, as primeiras igrejas brasileiras tem nave e capela-mor de planta retangular, com uma ou três naves, janelas simples e uma fachada retangular ou quadrada encimada por um frontão triangular, podendo ter uma ou duas torres laterais. Ao longo do século XVII aparecem frontões adornados com volutas de caráter maneirista. Nessa primeira fase, os principais modelos das igrejas coloniais foram as igrejas de São Roque e São Vicente de Fora de Lisboa. Hoje em dia restam poucos exemplos da arquitetura quinhentista no Brasil, uma vez que boa parte das edificações mais antigas foi ou destruída ou muito alterada. Exemplos raros de arquitetura religiosa quinhentista são a Igreja Matriz de São Cosme e São Damião de Igarassu (começada em 1535 e depois reformada) e a Igreja da Graça em Olinda, construída no último quartel do século XVI, com uma fachada maneirista inspirada na Igreja de São Roque de Lisboa. O arquiteto desta última, irmão Francisco Dias, havia trabalhado na construção da igreja lisboeta e projetou outras igrejas jesuítas no Brasil com arquitetura similar.[18][19] Desde o século XVI, os jesuítas construíram igrejas e colégios em regiões isoladas para promover a conversão dos indígenas ao Cristianismo. Alguns exemplos importantes de igrejas jesuítas dos primeiros tempos da colonização são as de São Pedro d'Aldeia (RJ), Nova Almeida (ES), Embu (SP) e a Capela de São Miguel em São Miguel Paulista (SP), todas datando do século XVII ou início do XVIII.[20][21] Na metrópole de São Paulo, que surgiu ao redor de um aldeamento jesuíta, a fachada seiscentista da antiga igreja e colégio jesuíta (conhecido como Pátio do Colégio) foi reconstruída fielmente com base em iconografia antiga. A fachada mostra os traços seiscentistas do estilo chão inicial, inclusive com um frontão triangular. Em contraste, no Rio de Janeiro, a importante igreja jesuítica do Morro do Castelo, fundada em 1567, foi demolida em 1922 na reurbanização da área onde se localizava.[22] Semelhantes às de São Paulo e Rio foram a igreja e colégio jesuítas de Santos,[19] demolidos no século XIX mas bem conhecidos por plantas e desenhos. Várias igrejas do século XVII, de caráter maneirista, ainda sobrevivem no Brasil. Um exemplo é a igreja do Mosteiro de São Bento do Rio de Janeiro, construído entre 1633 e 1677 com base a um projeto de 1617. A fachada é composta por formas geométricas, com um frontão triangular, ladeada por duas torres e com uma galilé com três portais, semelhante à Igreja de São Vicente de Fora de Lisboa. Um exemplo mais tardio é a antiga igreja jesuíta, atualmente Catedral de Salvador, datada de 1652-1672,[11] com uma fachada maneirista encimada por volutas e com duas torres, características semelhantes à igreja jesuíta de Coimbra (atual Sé Nova de Coimbra).[23] O interior, de nave única com capelas laterais e transepto e capela-mor pouco profundos, é baseado em São Roque de Lisboa. A igreja jesuíta de Salvador inspiraria outras na região, como a igreja do Convento de São Francisco de Salvador.[24] Por volta da metade do século XVII surgiram igrejas que, apesar de não terem plantas curvas barrocas, apresentam fachadas principais cenográficas, que fogem das rígidas formas anteriores. Um importante exemplo é a Igreja do Convento Franciscano de Cairu, na Bahia, construída a partir de 1654. A entrada da igreja é precedida por uma galilé formada por cinco arcos, com dois andares superiores escalonados flanqueados por volutas. O frontão da igreja, no terceiro andar, contém um nicho com a imagem de Santo Antônio, e a torre única da igreja encontra-se recuada em relação à fachada. Esse esquema de fachada, cujo protótipo maneirista pode ser a da igreja franciscana de Ipojuca, fez escola no Nordeste,[25] dando origem, entre outras, às igrejas dos conventos franciscanos de Paraguaçu (Bahia), Olinda, Igarassu (Pernambuco) e João Pessoa (Paraíba), este último construído já no século XVIII com uma fachada ricamente decorada. Os conventos franciscanos nordestinos estavam organizados ao redor de um nobre claustro de dois pisos (datando já do século XVIII), de ordem toscana, frequentemente decorados com azulejos portugueses. Em frente aos conventos, um amplo adro com um cruzeiro aumentava a imponência e importância urbanística do conjunto. As várias características em comum levaram alguns autores a considerar a os conventos franciscanos nordestinos a formar uma \"escola\" arquitetônica, a chamada \"escola franciscana do nordeste\".[26][27] Em Salvador, na segunda metade do século XVII, ergueram-se algumas igrejas conventuais majestosas, de traça atribuída a frei Macário de São João: a do Mosteiro de São Bento e a do Convento de Santa Tereza, este último muito similar ao Convento dos Remédios de Évora, em Portugal.[28] Essas igrejas possuem nave única com cúpula sobre o transepto, um modelo arquitetônico pouco utilizado no Brasil colonial. Arquitetura religiosa: barroco e rococó (século XVIII) [editar | editar código]Na arquitetura, o barroco utiliza os motivos derivados da arquitetura clássica mas os combina de maneira dinâmica, buscando criar efeitos ilusionistas e cenográficos em fachadas e interiores. Na Europa, especialmente na Itália e nos países germânicos, os edifícios barrocos se caracterizam pelas fachadas e plantas curvilíneos e ondulantes. No Brasil Colônia, o barroco arquitetônico chegou tarde, refletindo a tardia adoção do estilo na própria metrópole.[29] Curvas ou ondulações em fachadas e plantas foram raras. A importância da talha e pintura [editar | editar código]Os interiores das igrejas coloniais devem ser vistos não só em termos arquitetônicos mas também decorativos, pois os ambientes internos eram muitas vezes definidos pela harmoniosa interação entre talha dourada, pintura e azulejaria, típica da arte portuguesa.[30] Antes de influenciar a arquitetura, o estilo barroco chegou ao Brasil Colônia em meados do século XVII na forma de retábulos de talha dourada do chamado estilo nacional português. Esse estilo caracteriza-se pelos retábulos formados por arcos concêntricos de densa carga escultória, com motivos vegetalistas e anjos, muitas vezes sustentados por colunas salomônicas. A talha não se restringia aos retábulos, mas muitas vezes cobria todas as superfícies das igrejas e capelas, podendo ser enriquecida por pinturas e azulejos. Um exemplo importante é a igreja maneirista do Mosteiro de São Bento do Rio de Janeiro, cujo interior foi totalmente coberto de talha barroca a partir das últimas décadas do século XVII. Já na primeira metade do século XVIII foi concluída a Capela Dourada da Ordem Terceira de São Francisco, no Recife, e executada a maior parte da decoração da Igreja de São Francisco de Salvador. Ambas são integralmente cobertas de talha, pinturas e azulejos. Na década de 1720 a talha em estilo nacional português foi sucedida pelo estilo joanino, de forte influência do barroco romano, cujo exemplo pioneiro no Brasil (1726-1740) é a que cobre integralmente o interior da Igreja da Ordem Terceira de São Francisco da Penitência no Rio de Janeiro. Um exemplo antigo em Minas Gerais é a Igreja Matriz Nossa Senhora do Pilar em Ouro Preto, com magnífica talha joanina na nave e capela-mor datando das décadas de 1730-50. Em meados do século a talha evoluiu a formas rococós, em que os ornatos são mais delicados, não chegando a cobrir toda a superfície disponível dos interiores. Nessa fase brilharam escultores como Antônio Francisco Lisboa (Aleijadinho), Valentim da Fonseca e Silva (Mestre Valentim) e muitos outros. No final da fase colonial a talha já começa a adotar formas neoclássicas. A pintura, especialmente a em perspectiva de caráter ilusionista, também teve papel importante na decoração de interiores, particularmente nos forros de madeira dos tetos das naves. A mais antiga no Brasil foi a da já mencionada Igreja da Ordem Terceira de São Francisco da Penitência no Rio (Caetano da Costa Coelho, 1736-1743). Outros célebres exemplos mais tardios são as pinturas dos forros da Igreja de Nossa Senhora da Conceição da Praia, em Salvador (José Joaquim da Rocha, depois de 1772) e o da Igreja de São Francisco de Assis de Ouro Preto, de Mestre Ataíde (1801-1812). Os azulejos importados de Portugal também tiveram papel importante na decoração interior de igrejas no Nordeste e Rio de Janeiro. Não em Minas Gerais, devido à fragilidade e alto custo do frete. Barroco religioso litorâneo [editar | editar código]Ao longo do século XVIII, a esmagadora maioria dos edifícios religiosos no Brasil, assim como em Portugal, continuaram utilizando as rígidas plantas ligadas ao estilo maneirista chão, com naves e capelas de forma retangular ou quadrada, sem nenhum tipo de movimentação como plantas curvas ou poligonais. Em todo o Brasil Colônia, não chegam a vinte o número de igrejas com plantas barrocas que se afastam do esquema chão tradicional. Estas igrejas se localizam em umas poucas localidades: Recife e Salvador, com um exemplar cada uma, e Rio de Janeiro e algumas vilas em Minas Gerais, com os restantes. Nas demais igrejas do século XVIII, o estilo barroco ficou restrito aos motivos decorativos de fachadas e interiores, com muitos exemplares por todo o Brasil. Entre estas, um exemplo inusitado é o da Igreja da Ordem Terceira de São Francisco, em Salvador, construída a partir de 1703 com uma fachada totalmente esculpida ao estilo barroco Churrigueresco das igrejas hispano-americanas.[31] O estilo dessa fachada, porém, não teve continuidade em outros edifícios. Uma das primeiras igrejas com planta de influência barroca no Brasil Colônia é a Igreja da Glória no Rio de Janeiro, construída provavelmente na década de 1730 e atribuída ao engenheiro-militar José Cardoso Ramalho com base na tradição oral. A igreja tem a forma de dois prismas octogonais alongados e justapostos, com a torre única situada na frente. Na base da torre há um pequeno pórtico com arcadas onde se encontra a entrada principal. A planta é absolutamente original, tanto para o Brasil como para Portugal, sendo um verdadeiro marco na arquitetura luso-brasileira.[32] Outra igreja importante no Rio de Janeiro, infelizmente demolida no século XX, foi a Igreja de São Pedro dos Clérigos, datada de 1733-1738. Essa igreja tinha uma nave de planta elíptica ladeada de ábsides curvas. A fachada, curva, era flanqueada por duas torres circulares. São Pedro dos Clérigos do Rio foi a primeira com essas características construída no Brasil, e provavelmente influenciou as plantas elípticas de certas igrejas mineiras construídas mais tarde. No Rio de Janeiro, também as igrejas da Conceição e Boa Morte (finalizada em 1758), Nossa Senhora Mãe dos Homens (começada em 1752) e Lapa dos Mercadores (c. 1747), tem plantas que incorporam segmentos elípticos ou poligonais.[32] Outro notável monumento do período é a Igreja de São Pedro dos Clérigos no Recife, construída entre 1728 e 1782 e projetada por Manuel Ferreira Jácome. O espaço interno da nave da igreja tem forma octogonal, como a da Glória do Rio, mas o exterior é de planta retangular, escondendo a organização interior.[33] Em Salvador, em 1739, começou a construção da imponente Igreja de Nossa Senhora da Conceição da Praia, projetada pelo engenheiro-militar Manuel Cardoso de Saldanha em Portugal. Os cantos da nave são chanfrados, dando ao interior uma forma poligonal, semelhante a igrejas portuguesas como a Igreja do Menino Deus de Lisboa (1711). As duas torres na fachada estão dispostas em diagonal, acompanhando a forma da nave. As pedras da igreja foram cortadas em Portugal e despachadas a Salvador junto ao mestre encarregado de dirigir a construção.[34] Após o Terremoto de 1755, a reconstrução de Lisboa organizada pelo Marquês de Pombal foi orientada segundo um estilo tardo-barroco classicizante, denominado hoje estilo pombalino. Esse estilo foi fortemente influenciado pelo barroco romano, favorecido pela corte lisboeta desde o reinado de D. João V (1707-1750).[35] No Brasil, o estilo pombalino se refletiu especialmente em Belém do Pará e Rio de Janeiro, que eram cidades administrativas importantes em constante contato com a metrópole.[36] Em Belém, a influência pombalina se revela na obra do arquiteto italiano Antônio José Landi, por exemplo nas Igrejas de São João e de Santana, na capital paraense. No Rio de Janeiro, o exemplo mais antigo é a Igreja da Ordem Terceira do Carmo, construída entre 1755 e 1770. A fachada de cantaria, o frontão sinuoso e o recorte de janelas e portais, estes últimos importados de Lisboa, são indicativos do estilo. Outras igrejas cariocas influenciadas pelo pombalino são as de São Francisco de Paula e a Candelária.[32] Barroco religioso em Minas Gerais [editar | editar código]Nas Minas Gerais, o ciclo do ouro favoreceu a atividade construtora durante todo o século XVIII, dando origem a alguns dos mais interessantes monumentos arquitetônicos coloniais brasileiros. Como em outras regiões, quase todas as igrejas foram construídas seguindo plantas maneiristas chãs, como por exemplo a Catedral de Mariana, construída na primeira metade do século XVIII, que além da planta retangular tem uma fachada bidimensional com frontão triangular, lembrando os templos jesuítas do século anterior. Muito inovadora é a Igreja Matriz Nossa Senhora do Pilar em Ouro Preto, concluída por volta de 1733 segundo o projeto do engenheiro-militar Pedro Gomes Chaves. O interior da igreja apresenta forma decagonal dada pela exuberante talha dourada de Antônio Francisco Pombal, conferindo a essa igreja uma ousada organização interna. A forma decagonal está integralmente dada pela talha interior: exteriormente a Matriz do Pilar apresenta forma retangular.[37] Mais tarde apareceram igrejas ainda mais ousadas, como a Igreja de Nossa Senhora do Rosário dos Pretos de Ouro Preto (começada em 1757) e a Igreja e São Pedro dos Clérigos de Mariana, ambas de autoria de Antônio Pereira de Sousa Calheiros. As plantas dessas igrejas, sem paralelos exatos na arquitetura portuguesa da época, estão formadas por três elipses justapostas, flanqueadas, no caso da igreja ouro-pretana, por torres circulares. A entrada se faz por uma galilé curvilínea de três arcos. É provável que a planta da igreja tenha sido concebida sob a influência da Igreja de São Pedro dos Clérigos do Rio de Janeiro, começada duas décadas antes. Também é possível a influência de edifícios da Europa Central, através de gravuras de tratados de arquitetura que circulavam em Minas Gerais no século XVIII.[38] Rococó litorâneo [editar | editar código]O rococó, por muitos autores considerado como a fase final do barroco, é um estilo decorativo de origem francesa que se espalhou pela Europa a partir da primeira metade do século XVIII. Caracteriza-se pelo uso de motivos decorativos específicos, muitas vezes assimétricos, entre os quais se destacam as rocalhas, motivos abstratos em forma de concha. Na talha dourada, o rococó mostra mais elegância e leveza que as pesadas talhas barrocas: enquanto que no barroco havia a tendência ao \"horror ao vazio\", no rococó os motivos decorativos estão dispersos sobre as superfícies. Na arquitetura brasileira colonial, o rococó influencia a arte da última metade do século XVIII e início do seguinte. Em algumas igrejas de influência rococó no Brasil, particularmente em Minas Gerais, as fachadas tem efeitos tridimensionais criados pela posição recuada e giratória das torres e ondulações das superfícies. Na maioria dos casos, porém, o rococó ficou restrito aos motivos decorativos das fachadas, particularmente no desenho dos frontões, cornijas e cúpulas bulbosas de torres. Em Recife há um importante conjunto de fachadas de influência rococó, como por exemplo as da Igreja do Carmo, começada em 1767, a Igreja Matriz de Santo Antônio e outras, todas com cornijas curvadas e frontões exuberantes. Na Bahia também há várias fachadas com detalhes rococó, como o frontão da Igreja de Nosso Senhor do Bonfim, também datada do último quartel do século XVIII. Já no Rio de Janeiro, o estilo rococó se restringiu à decoração dos interiores, como na Igreja de Santa Rita e na Igreja de Nossa Senhora do Monte do Carmo.[32] Rococó mineiro [editar | editar código]Em Minas Gerais, a arquitetura religiosa seguiu caminhos diferentes nos tempos do barroco-rococó. Ao contrário das outras regiões do Brasil, as fachadas de algumas igrejas incorporaram variações tridimensionais, criando uma nova expressividade. Além disso, a disponibilidade de pedra-sabão (estearito), um material fácil de esculpir, permitiu o desenvolvimento de belas e originais portadas pelo maior escultor colonial, Antônio Francisco Lisboa, o Aleijadinho. Na Igreja de Santa Efigênia de Ouro Preto, começada em 1733 e possivelmente projetada por Manuel Francisco Lisboa, observa-se o posicionamento ligeiramente recuado das torres em relação à fachada, além de um leve arredondamento das torres, o que pode ser visto como precursora dos futuras fachadas mineiras.[40] A fachada da igreja do Santuário de Congonhas (começada em 1757) incorpora um belo portal esculpido em pedra-sabão datado de entre 1765 e 1769 e provavelmente de autoria de Jerônimo Félix Teixeira. A importância dessa portada radica no fato de ser a primeira de uma longa série de portadas esculpidas em estilo rococó na região mineira.[41] Já a Igreja Nossa Senhora do Carmo de Ouro Preto, começada em 1766, é um marco do rococó mineiro. A fachada é ondulada e possui uma cornija de forma semicircular, que engloba um lóbulo trilobado típico do rococó. As torres, recuadas em relação à fachada, tem forma semicircular. A igreja foi originalmente desenhada por Manuel Francisco Lisboa, mas a fachada foi reformulada cerca de 1770 por uma equipe da qual fez parte Francisco de Lima Cerqueira e o Aleijadinho. Este último criou a cartela da portada, em que o escudo da Ordem do Carmo é envolvido por rocalhas e segurado por dois anjinhos alados. O tema dos anjinhos e rocalhas, o qual havia sido estreado pelo Aleijadinho pouco antes na portada da Igreja do Carmo de Sabará, seria uma constante nas portadas desenhadas pelo artista.[42] Talvez a mais importante das igrejas mineiras desta fase seja a Igreja da Ordem Terceira de São Francisco de Ouro Preto, um marco da arquitetura luso-brasileira começada cerca de 1765. A excepcional fachada desta igreja incorpora torres circulares, muito recuadas, posicionadas em ângulo em relação à fachada e coroadas por cúpulas bulbosas. O corpo central da fachada e as torres recuadas são separadas por um segmento côncavo, criando um belo efeito tridimens"
}