{
  "url": "https://www.pereg-gourmet.com/collections/grains",
  "title": "Grains | Lentils | Basmati Rice | Beans – Pereg Natural Foods & Spices",
  "text": "- Autumn Lentil Blend Our blend of heirloom lentils, selected for their vibrant hues make this Autumn Blend perfect for #SoupSeason any time of the year. A colorful mix of yellow... $6.45Sale price $6.45Unit price per - Soup Mix Blend of split peas, beans, lentils, and barley - perfect for a hardy soup or stew. Boil this mixture in broth or water, with some chopped... $6.45Sale price $6.45Unit price per - Freekeh Freekeh is young green wheat that has been roasted & cracked. The roasting brings out a rich flavor, and the cracking process breaks up the large... $7.75Sale price $7.75Unit price per - Farro Taste the fresh, nutty flavor of Italian farro with its hearty texture. An heirloom grain, farro makes an excellent, non-GMO side dish that adds a healthy... $6.45Sale price $6.45Unit price per - French Lentils What are French lentils? Also called Le Puy style, these green lentils have beautiful marled coloring. They are the perfect base for a grain bowl or... $6.45Sale price $6.45Unit price per - Beans - Texas Chili This blend of heirloom beans is the perfect base for chili or stew. It can be used to make delicious cholent or 5-bean salad. The mix... $5.55Sale price $5.55Unit price per - Bulgur Quick & easy & healthy side dish - just add water & boil. $6.45Sale price $6.45Unit price per - Chickpea Jumbo sized whole dry chickpeas, in resealable package. $6.45Sale price $6.45Unit price per - Jasmine Rice Long grain jasmine rice is savored for fluffy texture and delightfully aromatic flavor. $6.45Sale price $6.45Unit price per - Black Lentils Black lentils are also called beluga lentils because they look like beluga caviar. These little lentils make a great alternative to rice as a side dish... $6.45Sale price $6.45Unit price per - Basmati Rice - White Basmati rice is savored for its rich aromatic flavor. This is premium aged basmati rice, the aging process increases these aromatic qualities, creating a better companion... $6.45Sale price $6.45Unit price per - Buckwheat What is kasha? It's roasted whole buckwheat.Enjoy this naturally gluten-free groat (its name is deceiving, buckwheat is not a wheat grain) as a side dish or... $6.45Sale price $6.45Unit price per - - Pearl Couscous Pearl couscous, quick & easy side-dish - just add water & boil. $6.45Sale price $6.45Unit price per - Orange Lentils Orange Lentils are also called Red Lentils. The vibrant color of dried red lentils appears more orange in hue. Once cooked this color becomes slightly less... $6.45Sale price $6.45Unit price per - Traditional Couscous Traditional couscous, quick & easy side-dish - just add water & boil. $6.45Sale price $6.45Unit price per - Basmati Rice - Brown Aged brown basmati rice has a rich & aromatic flavor that is a fantastic base for any meal. Enjoy with your favorite seasonings or sauces. The... $6.45Sale price $6.45Unit price per - Green Lentils Green Lentils can be used in a wide range of recipes. Many uses for green lentils, cook them into a soup and stew. Try adding dried... $6.45Sale price $6.45Unit price per - - Whole Kamut Large ancient wheat grain, perfect side-dish or grain bowls $6.65Sale price $6.65Unit price per - Beans - Black Beans The perfect accompaniment to tacos, tossed into salads, or transformed into burgers, black beans are a fantastic source of protein & fiber. These premium quality dry... $5.55Sale price $5.55Unit price per - - - Freekeh - Vegetables Pre-Seasoned blend of roasted & cracked freekeh wheat, dried vegetables, & spices. Quick & healthy side-dish, just add water & boil. $6.55Sale price $6.55Unit price per - Chia Seeds - for Passover Whole black chia seeds. 5g of Protein, 6.4g Omega-3, & 10g Fiber per serving. Sprinkle on salads for a crunchy, nutritious topping Add to shakes and... $7.75Sale price $7.75Unit price per - Freekeh - Ginger & Sesame Pre-Seasoned blend of roasted & cracked freekeh wheat, dried vegetables, & spices. Quick & healthy side-dish, just add water & boil. $6.55Sale price $6.55Unit price per"
}