{
  "url": "https://en.wikipedia.org/wiki/Frou_Frou",
  "title": "Frou Frou - Wikipedia",
  "text": "Frou Frou Frou Frou are an English electronic duo composed of musician and singer Imogen Heap and record producer Guy Sigsworth. They released their only studio album, Details, in 2002. It yielded their breakout single \"Breathe In\", which appeared on the UK Singles Chart, and also contained the song \"Let Go\", which rose to popularity in the United States due to its use in the Grammy Award–winning soundtrack for Zach Braff's 2004 film Garden State. Details was received warmly by critics but sold poorly and, with no plans to release a follow-up record, the duo amicably disbanded. They briefly reunited in 2004 to record the song \"Holding Out for a Hero\" for the 2004 film Shrek 2's soundtrack. In 2017, Frou Frou reunited for Heap's Mycelia Tour. \"A New Kind of Love\", an unreleased demo of theirs, went viral on TikTok in 2021. They officially released it the following year—with it later charting on Billboard's Hot Rock & Alternative Songs chart in 2025—as the lead single of their archival extended play (EP) Off Cuts (2022), which consisted of demos. History [edit]1997–2002: Introductions [edit]Heap and Sigsworth met in 1996 when Heap was 17 years old after Sigsworth was given a demo recorded by Heap and asked to meet with her. The two first collaborated when Heap contributed guest vocals to Sigsworth's band Acacia. Sigsworth later wrote two songs for Heap's 1998 debut studio album, I Megaphone, including her debut single, \"Getting Scared\".[1][2] As Heap went on tour throughout North America and Europe to promote the album, Sigsworth continued to write and produce for other artists, including Madonna and Björk.[3][4] As Heap's record label Almo Sounds lost funding, they asked Heap for a second album, and dropped her soon after being acquired by Universal, while Acacia was disbanded.[5][6][1] Sigsworth began work on an album in 2001, which he initially envisioned as a solo album consisting of songs written and produced by Sigsworth with features from various singers, poets, and rappers.[3] After working with Heap on a song, Sigsworth instead decided to form Frou Frou with her, and the two began working on an album together.[1][7] 2002–2003: Details [edit]On 15 July 2002, Frou Frou released their first and only album, Details, through Island Records and MCA Records.[8] Heap stated that the two had not planned on making a follow-up album at the time due to their both being \"kind of free spirits\".[9] The lead single of Details, \"Breathe In\", was released to modern rock and college rock stations soon after the album's release, with a music video starring Robin Tunney. It reached number two on the Italian radio airplay charts and debuted in the top-50 of the UK Singles Chart.[10] It was described as their breakout hit.[11] The 2003 music video for their song \"The Dumbing Down of Love\" was directed by Joel Peissig and won the award for best video at RESFest.[12][13] The album's song \"Let Go\", which was originally written for the 2002 film Phone Booth but did not end up being used, became one of the duo's most popular songs after being included on the soundtrack of Zach Braff's 2004 film Garden State, which was released through Epic Records in August of that year and won a Grammy Award.[14][15][16][9] Its appearance in the film led to an increase in record sales for Details and brought Frou Frou to a wider international audience.[17][18] By 2009, Details had sold 284 thousand copies.[19] For Drowned in Sound, Andy Thomas wrote in a review of Details that its songs were \"good, if not overly ambitious\" and \"pleasant enough to do the washing up to\".[20] In a four-and-a-half out of five star review, Alex Henderson of AllMusic praised Details for its \"attractive\" production, \"solid songwriting\", and \"expressive vocals\".[21] Heap later said that Island Records \"did an absolutely terrible job of marketing [Details]\" due to being more focused on promoting Sugababes at the time.[8] The album sold poorly and Island dropped Frou Frou from the label but offered Heap a solo deal, which she turned down.[22] The two soon disbanded the group, though they gained a cult following in the following few years.[23][24] In 2004, Chris Douridas, a DJ for KCRW and the music supervisor for the animated film Shrek 2, reached out to Sigsworth about recording a cover of Bonnie Tyler's 1984 song \"Holding Out for a Hero\" for the film. Sigsworth wanted Heap to sing on the cover and the two soon reunited as Frou Frou to record a rendition of the song, which appeared in the film's closing credits.[25] The duo also worked together in 2003 on a track for Britney Spears's fourth album In The Zone,[4] entitled \"Over To You Now\". The track was written by Sigsworth, Swedish pop star Robyn and her long-term songwriting companion, and Sigsworth asked Heap to come in and make the song more suitable for Spears, adding backing vocals and making the track more electronic music-infused. Despite not being used on In The Zone, the track was released in late 2005 on the Japan CD single of Spears' single, \"Someday (I Will Understand)\" and on the UK and Japan bonus CDs of the DVD release of her reality TV show, Britney and Kevin: Chaotic.[citation needed] 2017–present: Live reunion, Off Cuts [edit]In November 2017, it was announced that Heap and Sigsworth would be reuniting as Frou Frou during Imogen Heap's Mycelia Tour throughout 2018 and 2019.[26] In April 2019, Frou Frou released a live recording of \"Guitar Song\", their first single in 15 years and one of two singles not released at the time of the band's initial break-up, through We Are Hear.[27] Also in 2019, Australian musician Vierre Cloud released a drum and bass remix of \"A New Kind of Love\", then an unreleased demo by Frou Frou that had been cut from Details.[28] The remix went viral on TikTok in 2021 and, by 2024, had accrued more than 400 million streams on Spotify, also garnering attention for the original online. \"A New Kind of Love\" was officially released by the duo in 2022.[29] It peaked at number 30 on Billboard's Hot Rock & Alternative Songs chart in January 2025.[30] In late March 2022, Heap partnered with Symphonic Distribution to re-release previous material. Off Cuts, an extended play (EP) consisting of Frou Frou demos, was released digitally and on streaming platforms in June 2022, with \"A New Kind of Love\" as its lead single.[31] A vinyl of the EP was released for Record Store Day in April 2023.[32] A studio version of the \"Guitar Song\" demo released as the second single in May 2022.[33][better source needed] Frou Frou re-released the song Aeroplane as a single on Spotify, with two versions from previously recorded material.[34][better source needed] In March of the same year, Frou Frou gave their first live performance since 2019 at the Greek Theatre in Los Angeles for the 20th anniversary of the Garden State soundtrack, performing \"Let Go\".[35][36] Musical style and legacy [edit]Frou Frou's music has been described as electronic,[37] electropop,[38][39] synth-pop,[40] and alternative pop.[41] Amaya Lin of The Line of Best Fit wrote in 2023 that Frou Frou's music in the 2000s \"unearth[ed] something alien and ethereal in 2002\" to become \"a blueprint for the electronic pop renaissance of the 2020s\".[42] Esther Zuckerman of Thrillist called Frou Frou \"the undeniable champion of 2004 soundtracks\" for their contributions to Shrek 2 and Garden State.[43] Discography [edit]Studio albums [edit]EPs [edit]Singles [edit]See also [edit]References [edit]- ^ a b c \"Dusting Off... Frou Frou's 'Details'\". HMV. 22 November 2013. Retrieved 18 January 2022. - ^ Irish, Paul (19 October 2005). \"Aurgasm Interview: Imogen Heap\". Aurgasm. Retrieved 18 January 2022. - ^ a b \"Imogen Heap\". ABC. 16 June 2012. Retrieved 18 January 2022. - ^ a b Buchanan, John. \"Biography\". AllMusic. Retrieved 11 April 2019. - ^ Farrell, Margaret (9 November 2018). \"The 10 Best Imogen Heap Songs\". Stereogum. Retrieved 18 January 2022. - ^ West, Naomi (14 October 2010). \"Imogen Heap: fully connected\". Telegraph. Archived from the original on 17 October 2010. Retrieved 11 April 2019. - ^ Inglis, Sam (March 2001). \"GUY SIGSWORTH: Music After MIDI\". Sound on Sound. Retrieved 19 January 2022. - ^ a b Williams, Sophie (29 January 2025). \"Imogen Heap on Viral 'Headlock' Success, AI and Ariana Grande: 'There's a New Type of Energy This Time'\". Billboard. Retrieved 5 May 2025. - ^ a b Galvin, Peter (12 January 2006). \"Speaking for herself\". Between the Lines. Retrieved 5 May 2025. - ^ Roberts, David (2006). British Hit Singles & Albums (19th ed.). London: Guinness World Records Limited. p. 215. ISBN 1-904994-10-5. - ^ Hyman, Nick (11 May 2008). \"Imogen Heap: Speak for Yourself (RCA)\". Under the Radar. Retrieved 5 May 2025. - ^ Keim, Adam G. (20 July 2002). \"Passionate, Motivated MCA Duo Frou Frou Is Here to Make Changes\". Billboard. Retrieved 5 May 2025. - ^ Bold, Ben (30 June 2005). \"Chocolate ad ripped off my video, says director\". The Guardian. Retrieved 5 May 2025. - ^ Farrell, Margaret (9 November 2018). \"The 10 Best Imogen Heap Songs\". Stereogum. Retrieved 30 November 2020. - ^ Jacobs, Matthew (24 July 2024). \"'You Gotta Hear This One Song': The Oral History of the 'Garden State' Soundtrack\". The Ringer. Retrieved 5 May 2025. - ^ \"Shins, Iron & Wine Visit 'Garden State'\". Billboard. 22 July 2004. Retrieved 5 May 2025. - ^ Williams, Andrew (23 October 2006). \"60 SECONDS: Imogen Heap\". Metro. Retrieved 30 April 2008. - ^ Brodsky, Rachel (19 May 2021). \"How Shrek 2 Blew My Band Up\". Vulture. Retrieved 18 January 2022. - ^ Sutherland, Mark (20 June 2009). \"On the Fast Track\". Billboard. pp. 24–26. Retrieved 11 May 2025. - ^ Thomas, Andy (15 July 2002). \"Frou Frou: Details\". Drowned in Sound. Archived from the original on 26 July 2008. Retrieved 4 May 2025. - ^ Henderson, Alex. \"Details Review\". AllMusic. Retrieved 5 May 2025. - ^ Lynskey, Dorian (28 March 2006). \"Dorian Lynskey talks to singer Imogen Heap\". The Guardian. Retrieved 11 February 2021. - ^ Jones, Kevin (30 November 2005). \"Imogen Heap\". Exclaim!. Retrieved 12 June 2025. - ^ Percy, Shane (24 May 2006). \"Music: Imogen Heap\". Xtra. Retrieved 12 June 2025. - ^ Brodsky, Rachel (12 April 2024). \"How Shrek 2 Blew My Band Up\". Vulture. Retrieved 6 May 2025. - ^ Rettig, James (11 December 2018). \"Frou Frou Reuniting For 2019 North American Tour\". Stereogum. Retrieved 11 April 2019. - ^ Legaspi, Althea (19 April 2019). \"Hear Frou Frou's First New Song in 15 Years 'Guitar Song (Live)'\". Rolling Stone. Retrieved 6 July 2019. - ^ Hawthorne, Katie (16 October 2024). \"'I'm empowering my song to go and make love with different people': Imogen Heap on how her AI twin will rewrite pop\". The Guardian. Retrieved 12 June 2025. - ^ Zhang, Cat (8 August 2022). \"The Eternal Influence of Imogen Heap\". Pitchfork. Retrieved 12 June 2025. - ^ Zellner, Xander (21 January 2025). \"Hot 100 First-Timers: Imogen Heap Scores First Entry Ever, Thanks to 2005 Song 'Headlock'\". Billboard. Retrieved 12 June 2025. - ^ Frugé, Charese (30 March 2022). \"Symphonic Distribution Partners With Artist Imogen Heap For Global Distribution & Marketing\". All Access. Archived from the original on 1 April 2022. Retrieved 12 June 2025. - ^ Kim, Dave (21 April 2023). \"Record Store Day 2023: What you need to know\". WDET-FM. Retrieved 12 June 2025. - ^ Frou Frou Announcement & The Listening Chair Conversations No. 63 - April 7, 2022, 30 March 2022, retrieved 8 April 2022 - ^ \"Aeroplane is out everywhere\". YouTube. Retrieved 27 February 2025. - ^ Havens, Lyndsey (18 October 2024). \"The Shins, Iron & Wine and More Reunite For One-Night Only Performance of 'Garden State' Soundtrack\". Billboard. Retrieved 24 April 2025. - ^ Jenke, Tyler (31 March 2025). \"Frou Frou, Remy Zero Reunite For Los Angeles 'Garden State' Anniversary Concert\". Billboard. Retrieved 24 April 2025. - ^ Moen, Matt (8 May 2019). \"Imogen Heap: 'I've Never Been Burdened by Fame'\". Paper. Retrieved 18 January 2022. - ^ Byrne, Ciar (23 November 2005). \"How to get ahead in music: Make an ad!\". The Independent. Retrieved 19 January 2022. - ^ DeVille, Chris (19 April 2019). \"Frou Frou - \"Guitar Song (Live)\"\". Stereogum. Retrieved 30 November 2020. - ^ Solomon, Feliz (7 February 2017). \"Science Has Designed a Song to Make Your Baby Happy\". Time. Retrieved 18 January 2022. - ^ Sinagra, Laura (13 January 2006). \"With Her Synthesizer, She Mesmerizes\". The New York Times. Retrieved 25 November 2020. - ^ \"Found sounds: The old music we fell in love with this year\". The Line of Best Fit. 27 December 2023. Retrieved 12 June 2025. - ^ Zuckerman, Esther (3 May 2021). \"The 'Shrek 2' Soundtrack Is Absolutely Better Than the 'Shrek' Soundtrack\". Thrillist. Retrieved 13 June 2025. - ^ \"Official Album Downloads Chart Top 100 – 10 June 2022\". Official Charts Company. Retrieved 11 June 2022. - ^ \"Frou Frou Chart History (Current Album Sales)\". Billboard. Retrieved 2 May 2023. - ^ \"Frou Frou Chart History (Heatseekers Albums)\". Billboard. Retrieved 2 May 2023. - ^ \"Frou Frou Chart History\". Official Charts. Archived from the original on 11 September 2018. Retrieved 25 November 2020. - ^ \"Frou Frou Chart History - Hot Rock & Alternative Songs\". Billboard. Retrieved 14 January 2025. - ^ \"Frou Frou Chart History - Dance Club Songs\". Billboard. Retrieved 25 November 2020. - ^ \"Frou Frou Chart History - Dance Club Songs\". Billboard. Retrieved 5 December 2020. - Vincent Jeffries. Frou Frou. MTV.com. Accessed 29 August 2004."
}