{
  "url": "https://esportes.r7.com/futebol/campeonato-paulista/video/sao-paulo-2-x-0-santos-confira-os-gols-do-jogo-na-narracao-de-cleber-machado-01022026/",
  "title": "São Paulo 2 x 0 Santos: confira os gols do jogo na narração de Cléber Machado – R7 Esportes",
  "text": "São Paulo 2 x 0 Santos: confira os gols do jogo na narração de Cléber Machado Equipe tricolor aproveita vantagem numérica e 'despacha' rival em clássico pela sexta rodada do Paulistão Campeonato Paulista|Do R7 O clássico entre São Paulo e Santos pela sexta rodada do Paulistão de 2026 teve de tudo: polêmicas de arbitragem, disputas, golaços e mais. A equipe de Hernán Crespo derrotou os comandados de Vojvoda por 2 a 0, com gols de Tapia e Luciano. Com a vitória, o clube tricolor segue com esperança de se classificar ao mata-mata do estadual, enquanto o time alvinegro se complica cada vez mais na competição. Confira os gols pela transmissão da RECORD com narração de Cléber Machado. Paulistão 2026 AO VIVO e de GRAÇA? É aqui no R7, o portal da RECORD. Acesse e não perca nenhum lance! Últimas São Paulo enfrenta o Primavera neste sábado (7) pelo Paulistão Transmissão da RECORD começa às 20h; não perca Corinthians enfrenta o Palmeiras neste domingo (8) pelo Paulistão Transmissão da RECORD começa às 20h; não perca Assista à íntegra de Botafogo-SP 1 x 0 Palmeiras com R7 e Desimpedidos Equipe de Ribeirão Preto leva a melhor no Estádio Santa Cruz em jogo com golaço e polêmicas de arbitragem Palmeiras faz feio contra Botafogo-SP e torcedor cobra Leila Pereira Torcida alviverde que foi ao Estádio Santa Cruz presenciou um time sem entrosamento e inoperante Botafogo-SP 1 x 0 Palmeiras: confira os melhores momentos da 6ª rodada do Paulistão Jogo no Estádio Santa Cruz termina com vitória dos donos da casa com direito a golaço e polêmicas de arbitragem Botafogo-SP 1 x 0 Palmeiras: confira o gol do jogo na narração de Cléber Machado Clube tricolor se recupera no Paulistão e vence duelo com equipe alviverde pela sexta rodada do campeonato estadual Caminhão de patrocinador do Botafogo-SP atola no meio do jogo com o Palmeiras Ação de marketing resulta em momento engraçado enquanto a partida pelo Paulistão ainda rolava no Estádio Santa Cruz Foi pênalti? Palmeiras fica novamente na bronca com o VAR em jogo contra o Botafogo-SP Allan é derrubado na área em disputa com Jefferson Nem, mas arbitragem vê disputa como normal Gol, mas não valeu! Vitor Roque empata para o Palmeiras, e arbitragem anula Atacante estava em condição legal, mas passe para finalização veio de Giay, que aparecia em impedimento Ousado! Riquelme Fillipi bate escanteio com curva e quase faz gol olímpico Jovem promessa do Palmeiras assusta goleiro do Botafogo-SP, que precisa recuar para evitar empate no Paulistão Gol do Botafogo-SP! Leandro Maciel solta uma pancada de longe e vence Marcelo Lomba Palmeiras, dominado no Estádio Santa Cruz, sai atrás no placar no jogo pela sexta rodada do Paulistão Árbitra de Botafogo-SP x Palmeiras leva quase três minutos no VAR para revisar pênalti Demora na definição de possível penalidade máxima interrompe ritmo do jogo e irrita comissões técnicas Leandro Maciel bate de fora e Marcelo Lomba quase é traído por desvio de jogador do Botafogo-SP Goleiro do Palmeiras precisa defender com o pé para evitar equipe alviverde de levar o primeiro gol no Estádio Santa Cruz Marcelo Lomba defende chute perigoso do Botafogo-SP de longe e se irrita com falta Goleiro foi empurrado por Leandro Maciel ao disputarem espaço em cruzamento na sequência do lance e não gostou de chegada do volante Luighi faz fila na zaga do Botafogo-SP e quase marca 'gol de placa' para o Palmeiras Joia do Palmeiras para em grande defesa de Victor Souza, que salva os donos da casa no Paulistão"
}