{
  "url": "https://www.hpeautos.com.br/",
  "title": "Fábrica HPE – A HPE Automotores é a representante oficial das marcas Mitsubishi Motors e Suzuki Veículos no Brasil. Sua fábrica, instalada em Catalão, Goiás, conta com uma área construída de 247.000 m², gera mais de 2.500 empregos diretos e indiretos, e tem capacidade de produzir mais de 120 mil veículos ao ano.",
  "text": "A HPE Automotores é a representante oficial das marcas Mitsubishi Motors e Suzuki Veículos no Brasil. Sua fábrica, instalada em Catalão, Goiás, conta com uma área construída de 247.000 m², gera mais de 2.500 empregos diretos e indiretos, e tem capacidade de produzir mais de 120 mil veículos ao ano. Inaugurada em 1998, promove o desenvolvimento da região com pilares como excelência da qualidade e sustentabilidade, com a utilização responsável da água e a destinação adequada de seus resíduos sólidos. A planta possui uma infraestrutura completa para a produção – solda (chassi e carroceria), tratamento anticorrosivo, pintura tri-coat, fábrica de motores, linha de montagem, inspeção final e envio – e é capaz de montar até 30 diferentes versões de veículos simultaneamente. Início da operação m² de área construída e pavimentada unidades por ano m² de área total veículos produzidos ARMAÇÃO DE CARROCERIA É a área responsável pela operação de montagem e soldagem da carroceria. Aqui as chapas de aço são cortadas nas dimensões específicas das partes que formarão o veículo. Depois, as peças são soldadas em até 3.500 pontos de solda, e as portas, para-lamas e o capô são montados e testados. PINTURA O processo de pintura é vital para garantir a durabilidade e a boa aparência do automóvel. Na plataforma de Pintura, a carroceria e o chassi passam por diversos estágios: preparação da superfície, primeira demão de tinta e eletrogalvanização (e-coat), que oferece proteção anticorrosiva. No final dos processos de limpeza e tratamento, as carrocerias passam a receber a segunda demão de tinta – o primer (camada base) – e depois recebem outra base, que é a cor final e uma camada de verniz para o brilho. FÁBRICA DE MOTORES É onde acontece a montagem dos motores, transmissões e chassis de rolamento. Depois que os powertrains são montados, eles são enviados para a Oficina de Montagem Final, onde são instalados nas carrocerias e chassis dos veículos. MONTAGEM FINAL Quando as carrocerias e chassis chegam à montagem final, as peças começam a ser montadas nos veículos. Depois de montados, os veículos passam por testes elétricos, alinhamento das rodas, ajuste dos faróis e testes de freio ABS. Antes de serem liberados para entrega, os veículos passam por testes de pista e de água, em que itens específicos, como os freios ABS, também são testados. Somente após a aprovação o automóvel é liberado e enviado aos revendedores. Para conhecer os produtos montados em nossa planta, acesse nossos sites, Mitsubishi Motors do Brasil e Suzuki Veículos do Brasil clicando nos links abaixo. A POLÍTICA DE PRIVACIDADE da HPE Automotores do Brasil LTDA (“HPE”), tem como objetivo informar de forma transparente como os dados pessoais dos visitantes do sítio eletrônico www.hpeautos.com.br , Isto inclui atividades como coleta, classificação, utilização, acesso, transmissão, processamento, armazenamento, eliminação entre outras operações previstas na legislação de proteção de dados. Acesse agora mesmo a Política de Privacidade da HPE. Para exercer os seus direitos como titular de dados, também disponibilizamos no link abaixo o formulário eletrônico exclusivo para pedidos relacionados à Lei Geral de Proteção de Dados (LGPD). CANAL DE COMUNICAÇÃO | LGPD | HPE AUTOS Uma empresa, muito mais do que ativos, máquinas, capacidade produtiva e investimentos é formada por pessoas. É o corpo de colaboradores que atribui o verdadeiro valor a tudo o que uma companhia representa, oferece e significa. Por isso, zelar pela reputação da empresa, adotar práticas saudáveis e transparentes em todas as fases e setores do negócio tornam-se compromissos importantes, sólidos e fundamentais. Clareza nas ações, transparência na comunicação, compromisso com o meio ambiente, sociedade e mercado são fundamentais para o crescimento sustentável e promissor. Credibilidade, confiança, respeito e solidez devem ser mais do que palavras. Devem ser um norte a ser seguido. Um objetivo diário. Temos responsabilidades como cidadãos e profissionais. Assim, um relacionamento íntegro com colegas de trabalho, clientes, fornecedores, agentes públicos, acionistas e com as comunidades das praças que nos recebem deve ser uma preocupação constante e primária. O Código irá auxiliar na condução das práticas diárias e indicará o melhor caminho para se desvendar e superar os desafios éticos e legais das atividades corriqueiras da empresa. Nosso Código de Ética e Conduta, estabelecido de acordo com as boas práticas de Governança é um instrumento de trabalho essencial para conseguirmos, de forma coletiva (como empresa) e individual (como cidadãos), cumprir nossos objetivos, certos da escolha dos melhores caminhos. O mesmo pode ser acessado pelos nossos Colaboradores na Intranet Corporativa em Código de Ética e Conduta. Dúvidas e sugestões deverão ser encaminhadas para o nosso Canal da Transparência, através do site: www.canalconfidencial.com.br/grupohpe/ ."
}