{
  "url": "https://en.wikipedia.org/wiki/OpenSea",
  "title": "OpenSea - Wikipedia",
  "text": "OpenSea OpenSea is an American online marketplace for non-fungible tokens (NFTs), founded in 2017 by Devin Finzer and Alex Atallah. It facilitates the buying, selling, and minting of NFTs across a range of blockchains. Headquartered in Miami, OpenSea supports fixed-price sales and auctions for digital assets including artwork, music, gaming items, and domain names. The company has evolved from a peer-to-peer platform into one of the largest NFT marketplaces.[1] History [edit]Founding and initial growth (2017–2020) [edit]Devin Finzer and Alex Atallah founded OpenSea in December 2017.[2] They were inspired by CryptoKitties, a blockchain-based game featuring non-fungible tokens that had been released earlier that year.[2] Finzer and Atallah believed that OpenSea could be a marketplace for buying NFT tokens like those.[2] Y Combinator accepted OpenSea into its accelerator program in 2018,[2] and in an announcement described the startup as a \"peer-to-peer marketplace for crypto goods\".[3] After finishing the pre-seed round by Y Combinator, OpenSea raised $2.1 million in venture capital in November 2019.[4] In March 2020, the platform had 4,000 active users completing $1.1 million in transactions a month.[5] By July 2021, users were completing $350 million in transactions a month,[5] and the company was valued at $1.5 billion—meaning unicorn status—after a $100 million Series B venture round led by Andreessen Horowitz.[6] In August 2021, the value of monthly transactions spiked to $3.4 billion, and in November OpenSea had 1.8 million active users.[5] On September 14 of that same year, Nate Chastain, the then-head of product at OpenSea, was accused of insider trading after it was revealed that he bought NFTs shortly before they were showcased on OpenSea's front page, subsequently selling them at higher values.[7][8] The next day OpenSea acknowledged the accusations and launched an internal review.[7] On September 16, OpenSea announced that Chastain had resigned.[9] In May 2023, Chastain was convicted of wire fraud and money laundering in federal court and later sentenced to three months in prison.[10] Growth and acquisitions (2022–2024) [edit]In January 2022, the company was valued at $13.3 billion.[11] The daily trading volume on the OpenSea marketplace reached a peak of $2.7 billion on May 1, 2022, but had dropped by 99%, to just $9.34 million on August 28, with daily users down to 24,020.[12][13][14] In January 2022, OpenSea acquired Ethereum wallet-maker Dharma Labs.[15][16] Later that month, OpenSea reimbursed users about $1.8 million after a user interface bug allowed users to buy more than $1 million worth of NFTs at a discount.[17][18] On January 27, 2022, OpenSea announced it would limit how many NFTs a user could create using the free minting tool.[19] The following day, OpenSea reversed the decision.[20] The company stated that its initial decision was based on concern about theft, plagiarism, and spam,[19] as 80% of the NFTs removed from OpenSea for violations were minted using the tool.[21] On February 19, 2022, some users began to report that some of their NFTs disappeared. OpenSea later revealed a phishing attack had taken place on its platform via an exploit in the Wyvern Platform.[22] The next day, The Verge reported that hundreds of NFTs were stolen from OpenSea users causing a huge panic among the platform community. The estimated value of the stolen tokens was more than $1.7 million. According to OpenSea, only 32 users had been affected. OpenSea later revised its statement to note that 17 users were directly affected, while the other 15 users had interacted with the attacker but had not lost tokens as a result.[23] In March 2022, OpenSea confirmed that it was blocking accounts in countries that are subject to United States sanctions.[24] On April 25, 2022, OpenSea announced the acquisition of the NFT marketplace aggregator company Gem.xyz.[25] On June 30, 2022 OpenSea reported a major email data breach had occurred when a senior engineer at an email vendor, Customer.io, misused his employee access to download and share OpenSea user email addresses with an \"external bad actor.\" Over 1.8 million email addresses are said to have been leaked.[26] In July 2022, Customer.io revealed that five other companies were also impacted by the employee's data leak.[27] On July 14, 2022, chief executive Devin Finzer tweeted that the company was cutting one in five of its employees.[28][29] Recent developments (2025–) [edit]In 2025, OpenSea launched OS2, a platform overhaul supporting token and NFT trading across 19 blockchains. The interface improved search capabilities, aggregated marketplace listings, cross-chain purchasing, lower fees, and a gamified rewards system called Voyages.[30] It plans to launch the platform's SEA token in the first quarter of 2026.[31] Funding [edit]Features [edit]In December 2020, OpenSea announced that any user could mint NFTs on its platform for free. Later, in March 2021, OpenSea announced NFT collections would not need to be approved to be listed; this decision was later criticized for allowing rampant plagiarism on the platform.[37] On September 17, 2021, OpenSea released an app for Android and iOS. The app allows for browsing the marketplace, but as of March 2023, the app does not allow buying or selling NFTs.[38][39] References [edit]- ^ Ehrlich, Steven (6 July 2021). \"NFT Marketplace CEO Explains Why The Industry Is Moving Beyond Ideological Purists\". Forbes. Retrieved 29 November 2021. - ^ a b c d Brandom, Russell (February 2, 2022). \"How one company took over the NFT trade\". The Verge. Retrieved September 20, 2023. - ^ \"13 Companies From YC Winter 2018\". Y Combinator. March 16, 2018. Retrieved September 20, 2023. - ^ \"OpenSea Co-Founder Alex Atallah to Leave Company End of July\". Pandaily. July 4, 2022. Retrieved November 1, 2023. - ^ a b c Kauflin, Jeff (November 23, 2021). \"What Every Crypto Buyer Should Know About OpenSea, The King Of The NFT Market\". Forbes. Retrieved September 20, 2023. - ^ Matney, Lucas (2021-07-20). \"NFT market OpenSea hits $1.5 billion valuation\". TechCrunch. Retrieved 2023-03-22. - ^ a b Matney, Lucas (September 15, 2021). \"OpenSea admits incident as top exec is accused of trading NFTs on insider information\". Tech Crunch. Retrieved September 22, 2023. - ^ Matney, Lucas (June 1, 2022). \"Former OpenSea exec arrested and charged with insider trading of NFTs\". Tech Crunch. Retrieved September 22, 2023. - ^ Kharif, Olga (September 16, 2021). \"OpenSea says employee resigned over NFT insider trading scandal\". Fortune. Retrieved September 22, 2023. - ^ Godoy, Jody (August 22, 2022). \"Ex-OpenSea manager sentenced to 3 months in prison for NFT insider trading\". Reuters. Retrieved September 22, 2023. - ^ Isaac, Mike (2022-01-05). \"OpenSea valued at $13.3 billion in new round of venture funding\". The New York Times. ISSN 0362-4331. Retrieved 2022-04-30. - ^ Quiroz-Gutierrez, Marco (2022-08-29). \"Trading volume on top NFT marketplace OpenSea down 99% since May\". Fortune. Archived from the original on 2022-08-29. Retrieved 2022-09-10. - ^ \"Trading volume on top NFT marketplace OpenSea down 99% since May\". Fortune Crypto. Retrieved 2023-03-22. - ^ \"NFT marketplace OpenSea's trading volume nosedives 99%. Is the bubble bursting?\". Music Business Worldwide. 2022-09-05. Retrieved 2023-03-22. - ^ \"OpenSea acquires ethereum wallet Dharma Labs as the NFT marketplace's trading boom continues after landmark 2021\". uk.news.yahoo.com. 18 January 2022. Retrieved 2022-01-18. - ^ Matney, Lucas (2022-01-19). \"OpenSea buys DeFi wallet startup Dharma Labs, appoints new CTO\". TechCrunch. Retrieved 2025-10-29. - ^ Egkolfopoulou, Misyrlena (2022-01-28). \"OpenSea reimburses users $1.8 million after bug led them to sell NFTs at a discount\". Fortune. Archived from the original on 2022-10-27. Retrieved 2022-01-28. - ^ Faife, Corin (2022-01-24). \"An OpenSea bug let attackers boss Apes from owners at six-figure discounts\". The Verge. Retrieved 2022-01-28. - ^ a b Escalante-De Mattei, Shanti (January 28, 2022). \"After Announcing NFT Limit, OpenSea Reverses Course Amid User Uproar\". ARTnews. Retrieved September 22, 2023. - ^ \"Over 80 percent of NFTs minted for free on OpenSea are fake, plagiarized or spam\". Engadget. Retrieved 2022-02-02. - ^ Sato, Mia (May 11, 2022). \"OpenSea is adding NFT copy detection and verification features\". The Verge. Retrieved September 22, 2023. - ^ McCarthy, Adam Morgan. \"OpenSea confirms hackers made $1.7 million on NFTs stolen in a phishing attack at the weekend\". Markets Insider. Retrieved 2023-03-22. - ^ \"$1.7 million in NFTs stolen in apparent phishing attack on OpenSea users\". The Verge. 20 February 2022. Retrieved 2022-02-20. - ^ Gordon, Nicholas (March 4, 2022). \"NFT marketplace OpenSea confirms it will block accounts hit by U.S. sanctions, reviving debate over how decentralized blockchain really is\". Fortune. Retrieved December 17, 2023. - ^ Ramaswamy, Anita (25 April 2022). \"NFT aggregator Gem.xyz acquired by OpenSea shortly after ousting co-founder for sexual misconduct\". TechCrunch. Retrieved 2022-04-26. - ^ \"NFT giant OpenSea reports major email data breach\". TechCrunch. 30 June 2022. Retrieved 2022-06-30. - ^ Spencer, Malia. \"Customer.io finds more clients affected by data leak\". PORTLANDINNO - BizJournals. Retrieved 2024-01-05. - ^ \"FT Cryptofinance: Celsius's fall into bankruptcy and the future of crypto\". Financial Times. 2022-07-15. Retrieved 2023-04-06. - ^ Richard Lawler (July 14, 2022). \"Giant NFT marketplace OpenSea lays off about 20 percent of its staff\". The Verge. - ^ Wright, Liam 'Akiba' (2025-06-09). \"OpenSea's OS2 launch brings 44% increase in user activity amid 2 million NFT sales\". CryptoSlate. Retrieved 2025-06-17. - ^ \"OpenSea sets SEA token launch for Q1 2026, with 50% of revenue at launch earmarked for buybacks\". The Block. Retrieved 2025-10-29. - ^ a b Finzer, Devin (9 November 2019). \"Bringing on additional strategic investors to OpenSea\". OpenSea. Retrieved 29 November 2021. - ^ Matney, Lucas (18 March 2021). \"NFT marketplace OpenSea raises $23 million from a16z\". TechCrunch. Retrieved 29 November 2021. - ^ Matney, Lucas (20 July 2021). \"NFT market OpenSea hits $1.5 billion valuation\". TechCrunch. Retrieved 29 November 2021. - ^ Isaac, Mike (4 January 2022). \"OpenSea valued at $13.3 billion in new round of venture funding\". The New York Times. Archived from the original on 10 January 2022. Retrieved 15 January 2022. - ^ Matney, Lucas (2022-01-05). \"NFT kingpin OpenSea lands monster $13.3B valuation in new raise\". TechCrunch. Retrieved 2024-02-08. - ^ Volpicelli, Gian M. \"Why OpenSea's NFT Marketplace Can't Win\". Wired. ISSN 1059-1028. Retrieved 2022-02-11. - ^ Silberling, Amanda (17 September 2021). \"OpenSea released an app — but it's for browsing, not buying and selling\". TechCrunch. Retrieved 29 November 2021. - ^ Campbell, Ian (20 September 2021). \"OpenSea has an app, but you can't buy NFTs on it\". The Verge. Retrieved 29 November 2021."
}