{
  "url": "https://www.procedimento.com.br/?p=go&os=windows&windows=como-executar-a-limpeza-de-arquivos-temporrios-temps-no-windows-via-cmd",
  "title": "Como Executar a Limpeza de Arquivos Temporários (TEMPs) no Windows via CMD",
  "text": "Remember to maintain security and privacy. Do not share sensitive information. Procedimento.com.br may make mistakes. Verify important information. Termo de Responsabilidade A limpeza de arquivos temporários (TEMPs) é uma tarefa essencial para manter o desempenho e a eficiência do sistema operacional Windows. Arquivos temporários são criados por diversos programas e processos do sistema, e acumulá-los pode levar à diminuição do espaço em disco e à redução da velocidade do sistema. Neste artigo, explicaremos como executar a limpeza de arquivos temporários no Windows utilizando o Prompt de Comando (CMD). del Abrir o Prompt de Comando como Administrador: Win + X e selecione \"Prompt de Comando (Admin)\" ou \"Windows PowerShell (Admin)\".Navegar até o Diretório de Arquivos Temporários: cd %temp% cd C:\\Windows\\Temp Excluir Arquivos Temporários: del *.* /s /q rmdir /s /q . Criar um Arquivo de Script em Batch: @echo off echo Limpando arquivos temporários do usuário... cd %temp% del *.* /s /q echo Limpando arquivos temporários do sistema... cd C:\\Windows\\Temp del *.* /s /q echo Limpeza concluída! pause .bat , por exemplo, limpar_temp.bat .Executar o Script: .bat criado e selecione \"Executar como administrador\".Abrir o PowerShell como Administrador: Win + X e selecione \"Windows PowerShell (Admin)\".Executar Comandos para Limpeza: Remove-Item -Path $env:TEMP\\* -Recurse -Force Remove-Item -Path C:\\Windows\\Temp\\* -Recurse -Force A limpeza regular de arquivos temporários pode ajudar a manter o desempenho do seu sistema Windows. É importante lembrar que alguns arquivos temporários podem estar em uso pelo sistema ou por aplicativos, e não poderão ser excluídos enquanto estiverem em uso. Executar a limpeza com privilégios administrativos pode aumentar a eficácia do processo."
}