{
  "url": "https://forums.terraria.org/index.php?threads/the-transmutation-glitch-replacement-the-terra-engine-construction-node.139867/",
  "title": "Game Mechanics - The Transmutation Glitch Replacement - The Terra Engine & Construction Node | Terraria Community Forums",
  "text": "SpeeQz Skeletron Prime The Transmutation Glitch Hello, I would like to introduce myself as one of the creators responsible for \"The Transmutation Workshop\" Steam Workshop map. I am making this post as an answer to the claim that Transmutation is fixed in the next update that Terraria will receive (1.4.5). The purpose of this suggestion post is to introduce a replacement for the Transmutation glitch which has been extensively explored by the technical community of Terraria. If we understand why this glitch should be patched in regards to how it can affect vanilla playthroughs of the game and its game breaking nature, this would hurt vanilla map creation by closing off many possibilities as well as break some amazing existing maps, such as: * Five Nights at Freddy's Playable Map * Sonic the Hedgehog '91 Playable Map (DEMO) * Transmute Workshop v1449_r1-Survival Resources on Transmutation: * The Ultimate Community Wiring Guide (Beginner-Advanced) * Yri's Transmutation Handbook Of course the glitch could just remain in the game like Hoiks were left over inside the game as they provided a lot of functionality, but with the effects of this bug I doubt such a thing would be possible although that would be a very kind thing from Re-Logic. Bellow will be given several examples of transmutation being used in conjugation with other game mechanics for very creative and interesting results with many uses. Rotating functional blocks without needing to hammer them: Making furniture and blocks appear out of nowhere without echo paint and manipulating their collision: Changing the states of Gem Locks by modifying the type of gem inside of them and other properties: Shifting a teleporter's area of effect to essentially displace any player or sprite anywhere without needing a teleporter nearby: Creating moving ghost tiles by modifying the textures of tiles like trees with a texture pack and changing their frame data: FULL 16-Bit RGB Displays which are very complicated to make but possible: The Transmutation Workshop speaks for itself, we were able to discover methods of spawning any item in the game. The possibilities of this is tremendous as it allows you to restock a player's inventory without relying on chests which could eventually run out of items. This is only a fraction of what this glitch allows, but I believe this is enough to understand the creative freedom it can give to map makers. Therefore, I propose a replacement for it by directly integrating some of these functions in the game itself in the form of furniture. That furniture being of course... Terra Engine & Construction Node Terra Engine The first suggestion is the Terra Engine which is obvious which other game feature is based off from (Minecraft Command Blocks). Bellow are several 2x2 blocks texture concepts I have made: Similar to its counterpart the \"Terra Engine\" would be a text based command executing block which has some sort of syntax to execute commands which can be chained and do certain functions. Terraria already has chat commands which are implemented and could be integrated into a block. Of course, the textbox limit must be made much higher for the Terra Engine as Signs and Announcement Boxes have a limited text field which would limit the potential of the engine greatly. Some example commands which could be implemented are what's already present in journey mode but in chat commands form: Rich (BB code): /item <Player> <ID> <Amount> <Arguments...> # Give a specific player an item, multiple conditions can be set for which player has the command activated on them like Minecraft's syntax with @p (nearest player), @r (random player), @a (all players), @e (all entities) /tp <Player> <Coordinates/Entity/Location(spawn)> # Teleport a player to specific coordinates or entity like another player /summon <NPC ID> <Coordinates> # Summons a regular mob, boss, or town NPCs at specific coordinates, coordinates can also be not specified for random spawning around player /launch <Projectile ID> <Direction> <Coordinates> # Summons a projectile from the player or at specific location with a specific direction /buff <Buff ID> <Duration> <Entity> # Gives a buff/debuff to a player/entity for specific duration, can also be used to unset the buff/debuff of the player/entity /time <Time> # Sets the time /event <Event ID> <On/Off> <Arguments...> # Sets an event to the world like rain or eclipse /zoom <Zoom Level> <Player> # Sets the zoom level of the player's screen useful for a concept explained later /clearinventory <Player> # Useful for maps where the creator needs to make sure the player has very specific items in their inventory # Add rest of player available commands that are already present for regular multiplayer chat ... More commands ... A lot of these commands would add a lot of variety to Terraria maps and can be used for all sorts of creations be it minigames, adventure maps, or some other genre. It would also be useful as a debugging tool of sorts for players, for finding glitches more easily. Construction Node The Construction Node is a bit of an odd concept to understand, but its functionality will have a massive impact on what is possible in vanilla, especially for imaginative builders. The concept is again borrowed from Minecraft's Structure Block. A 2x2 texture which I made again: This block's utilization would be more complex as it would be more reliant on wiring to fully be used unless a more advanced GUI is implemented for it. The concept works by having a schematic storage inside the block (or somehow shared globally across the world). You can either add or delete schematics of ingame builds, cycle through them, switch direction. One thing to consider is the pasting of schematics with empty tiles, being able to somehow decide whether it should replace an entire area or just the tiles which aren't air is important, it would probably be easier to have either 2 options for pasting or just not replace any tiles which overlap with empty tiles from the schematic, of course a new 1x1 block could be introduced which would be used specifically for those schematics to denote empty spaces. This simple concept by being a fully player controlled block with wiring implodes the possibilities for dynamic builds. I can only give examples but there are probably many others who could come up with even more concepts: * Dynamic Bossfights where each frame of the attacks are manually built. * Ambient animations for builds such as smoke from chimneys, swaying flora such as trees or grass or leaves, animated mechanical builds. * Dynamic map layout reorganization on massive scale. * A massive expansion on the capabilities of Terraria wiring by being able to store individual wiring components as schematics and just switch between them allowing for stuff like bigger ROM. * Actual cutscenes in Terraria where you could give for example stoned debuff to a player and make an animated cutscene of the environment around him changing, being able to edit the zoom level of their screen would be useful here. Implementation Adding this Construction Node to Terraria would be more difficult as it would need to be implemented so that the .wld file would be able to store these additional schematics somehow and also include the GUI needed for making it more easier and pleasant for the players to use other than relying purely on 4 wiring inputs. These blocks are planned to be strictly locked behind post Moon Lord and perhaps also some 100% achievement bound to each world similar to the Universal Pylon such as getting all blocks in the game from Journey Mode. Including these restrictions to ensure an enjoyable Multiplayer experience with the blocks their functionality would be a toggle per world which the host of every world can turn ON or OFF to decide whether they would do anything or just act like regular decorative tiles. I genuinely hope that my proposition for these ingame features is taken into consideration by Re-Logic as this would be an amazing addition to the game for everyone who wants to further explore the creative limits of this game we all enjoy. Attachments Last edited:"
}