{
  "url": "https://play.google.com/store/apps/details?id=com.microsoft.office.word&hl=pt",
  "title": "Microsoft Word: Edit Documents – Apps no Google Play",
  "text": "Use o Word para criar, editar, exibir e compartilhar arquivos de forma fácil e rápida, além de exibir e editar documentos anexados a emails. O trabalho fica mais fácil, seja você um blogueiro, escritor, jornalista, colunista, estudante ou gerente de projeto trabalhando em uma documentação. O Word inclui um leitor de PDF para facilitar a leitura de PDFs e livros eletrônicos durante as viagens, antes de dormir ou sempre que você quiser. Crie documentos de texto, roteiros, blogs, anotações ou currículos impactantes. Personalize documentos, cartas, currículos ou anotações do jeito que quiser, usando ferramentas robustas para redigir com as opções de formato ideais. Crie com confiança Agilize projetos, tarefas, cartas, blogs, roteiros, anotações, textos ou currículos com modelos elegantes, modernos e bem elaborados. Use opções avançadas de formatação e layout para anotar e expressar ideias por escrito. A formatação e o layout do documento ficam perfeitos e com excelente aparência, seja qual for o dispositivo que você usar. Leia, escreva e edite confortavelmente O Modo de Leitura permite ler com facilidade longos documentos, PDFs, cartas, roteiros e muito mais no dispositivo. Para editar um PDF, basta convertê-lo em um documento do Word e fazer alterações facilmente. Depois de editar o documento, converta-o em PDF e compartilhe o arquivo com alguns toques. Colabore com qualquer pessoa, em praticamente qualquer lugar Para compartilhar ideias, faça comentários no documento ao lado do texto em que você está trabalhando. Todos podem contribuir para a discussão e manter o controle das alterações no texto, no layout e na formatação. À medida que você e a equipe fazem alterações, é possível exibir os rascunhos anteriores com o histórico de versão aprimorado do Word. Compartilhamento simplificado Compartilhe arquivos de documentos e PDFs com alguns toques e convide rapidamente outras pessoas para editar ou exibir os documentos. Gerencie permissões e veja facilmente quem está trabalhando em um documento. Copie o conteúdo de arquivos do Word diretamente para o corpo de uma mensagem de email, mantendo o formato intacto, ou anexe PDFs e documentos a um email e facilite o compartilhamento. REQUISITOS • Versão do sistema operacional: deve executar qualquer uma das versões compatíveis do Android e ter um processador Intel x86 ou baseado em ARM. O suporte a dispositivos Kitkat e Lollipop será mantido até junho de 2019. • 1 GB ou mais de memória RAM Para criar ou editar documentos, entre com uma conta gratuita da Microsoft em dispositivos com tela de 10,1” ou inferior. Aproveite a experiência completa do Microsoft 365 com uma assinatura qualificada do Microsoft 365 no telefone, tablet, PC e Mac. As assinaturas do Microsoft 365 compradas no aplicativo serão cobradas na conta da Play Store e renovadas automaticamente em até 24 horas antes do final do período da assinatura atual, a menos que a renovação automática seja desabilitada. Para gerenciar as assinaturas, acesse as configurações da conta na Play Store. Não é possível cancelar a assinatura durante o período da assinatura ativa. Este aplicativo é fornecido pela Microsoft ou por um publicador de aplicativos terceirizado e está sujeito a uma política de privacidade e termos e condições distintos. Os dados fornecidos pelo uso dessa loja e deste aplicativo podem ser acessados pela Microsoft ou pelo publicador de aplicativos terceirizado, conforme aplicável, e transferidos, armazenados e processados nos EUA ou em qualquer outro país onde a Microsoft ou o publicador de aplicativos e os afiliados ou prestadores de serviços deles tenham instalações. Confira os Termos de Serviço no EULA da Microsoft. Ao instalar o aplicativo, você concorda com estes termos e condições: http://aka.ms/eula Atualizado em 23 de jan. de 2026 Produtividade Segurança dos dados arrow_forward Sua segurança começa quando você entende como os desenvolvedores coletam e compartilham seus dados. As práticas de segurança e privacidade de dados podem variar de acordo com o uso, a região e a idade. O desenvolvedor forneceu as informações a seguir, que podem ser atualizadas ao longo do tempo. Este app pode compartilhar estes tipos de dados com terceiros Local e Identificadores do dispositivo e outros IDs Este app pode coletar estes tipos de dados Local, Informações pessoais e mais 7 Os dados não são criptografados Você pode solicitar a exclusão dos dados Mais detalhes Classificações e resenhas phone_androidTelefone laptopChromebook tablet_androidTablet 4,8 14,4 mi avaliações 5 4 3 2 1 Antônio Sinalizar como inapropriado 23 de janeiro de 2026 Que aplicativo péssimo, temho que apertar a mesma opção três vezes na seleção de fontes para ele compreender com qual letra quero escrever, o login expira, te impedindo de exportar qualquer documento que você tenha escrito e o processo de entrar novamente com sua conta é como o próprio serviço, lento e irresponsivo, se afastem dessa coisa. Andreia Pereira Sinalizar como inapropriado 6 de janeiro de 2026 Ele é um editor de textos excelente, não tem como negar, mas ele entra numa configuração ou sincronização infinita com o Onedrive e não deixa você editar ou abrir arquivos off-line. O pior é não permitir você pular ou adiar essa configuração quando você realmente está sem acesso imediato a um bom sinal de Internet. Essa avaliação foi marcada como útil por 10 pessoas Gileno Mascarenhas Sinalizar como inapropriado 7 de janeiro de 2026 De estável e fluído, agora é um aplicativo cheio de bugs, cujas atualizações não trazem nenhuma nova funcionalidade, apenas \"piorias\", pelo visto. No momento, está impossível usar. Por isso uma estrela. Se voltar a ficar pelo menos utilizável, mudo a classificação. Essa avaliação foi marcada como útil por 6 pessoas O que há de novo Agradecemos por usar o Word. Lançamos atualizações regularmente para o aplicativo, incluindo excelentes novos recursos, bem como melhorias de velocidade e confiabilidade. Sabia que com uma assinatura do Microsoft 365 você pode aproveitar todo o potencial do Office em todos os seus dispositivos? Encontre ofertas especiais no aplicativo."
}