{
  "url": "https://www.wisetekmarket.com/products/dell-optiplex-3080-8gb-256gb-ssd-i5-10500t-2-3ghz-win11p-black-refurbished-very-good",
  "title": "Dell Optiplex 3080 (8GB, 256GB SSD, i5-10500T 2.3GHz) Win11P, Black (R",
  "text": "Dell Optiplex 3080 (8GB, 256GB SSD, i5-10500T 2.3GHz) Win11P, Black (Refurbished - Very Good) Dell Optiplex 3080 (8GB, 256GB SSD, i5-10500T 2.3GHz) Win11P, Black (Refurbished - Very Good) is backordered and will ship as soon as it is back in stock. Dell Optiplex 3080 (8GB, 256GB SSD, i5-10500T 2.3GHz) Win11P, Black (Refurbished - Very Good) Upgrade your business computing setup with the Dell Optiplex 3080 Micro Tower Desktop. Equipped with an Intel Core i5-10500T processor, 8GB DDR4 RAM, and 256GB SSD, this desktop provides reliable performance. It features integrated Intel UHD Graphics 630, VGA output, and multiple USB 3.0 ports for convenient connectivity. The Micro Tower form factor is space-saving and efficient, making it suitable for various work environments. No operating system included. Features: - Intel Core i5-10500T Processor (Hexa-Core, 2.3GHz, 12MB Cache) - 8GB DDR4 System Memory - 256GB PCIe Solid State Drive (SSD) - Integrated Intel UHD Graphics 630 Whats in the Box? - Optiplex 3080 Desktop - Power Adapter Specifications: General Information - Energy Star Compliant: YES - Liquid Cooling: NO - Model Number: 3080 - Item Dimensions - H x W x D (IN): 1.4 x 7.17 x 6.93 - Product Special Notes - 0 if None: 0 - Color - Exact: Black - Release Year: 2020 - Bundled Software - 0 if None: 0 - Form Factor: Micro Tower - Lifestyle: Business - Product Line (Desktop): Dell Optiplex 3080 - Total DisplayPort Outputs: 1 - Item Weight (LBS): 2.82 - Optane Memory (GB): 0 - Color - Generic: Black - EPEAT Level: Not Applicable - Wireless Network Compatibility: Not Applicable Storage - Hard Drive Speed (RPM): 0 - Hard Drive Type: Solid State Drive (SSD) - Hard Drive Interface: PCIe - Hard Drive Size (GB): 256 Expandability - Total PCI Express X8 Slots: 0 - Total Open Expansion Bays: 0 - Total PCI Express X16 Slots: 0 - Total PCI Express X1 Slots: 0 - Available PCI Express X16 Slots: 0 - Total 3.5\" External Bays: 0 - Total 3.5\" Internal Bays: 0 - Built-in Media Card Reader: Not Applicable - Available PCI Express X8 Slots: 0 - Available PCI Express X1 Slots: 0 - Total Hot-Swap Bays: 0 - Total 5.25\" External Bays: 0 Inputs/Outputs - Total USB-C Ports: 0 - Optical Drive Type: Not Applicable - Total DVI Outputs: 0 - Total USB 2.0 Ports: 4 - Mouse Included: NO - DVD Speed (R/W/RW): 0/0/0 - Total Headphone Outputs: 1 - Keyboard Included: NO - Total HDMI Outputs: 0 - Blu-ray Speed (R/W/RW): 0/0/0 - Mouse Connection Type: Not Applicable - Total Microphone Outputs: 1 - Total USB 3.0 Ports: 4 - Keyboard Connection Type: Not Applicable - Front USB 2.0 Ports: 0 - Total VGA Outputs: 1 Processor - # of Processor Cores: 6 - Processor Speed (GHz): 2.3 - Processor Series: Intel Core i5 10th Gen - Processor Model Number: Intel Core i5-10500T - Processor L3 Cache (MB): 12 RAM - Memory Type: DDR4 - Total RAM (GB): 8 - Maximum Memory Supported (GB): 32 Graphics - Video Memory Available (MB): 0 - Graphics Type: Integrated - Graphics Card Model Number: Intel UHD Graphics 630 Display - Maximum Displays Supported: 2 Networking - Bluetooth Compatibility: No Bluetooth - LAN Compatibility: 10/100/1000 Gigabit Operating System - Operating System Version: Professional - Operating System: Microsoft Windows 11 FREE shipping and handling - Free shipping within the USA only. Your order will ship within 3 business days of payment and tracking will be provided. Please allow 3 to 5 business days for delivery time via UPS Ground or similar service. *Shipping to Canada available upon request *Delivery times are subject to change due to weather or unforeseen circumstances FAIR: May be missing cosmetic parts or showing significant signs of use, but are fully tested and functioning VERY GOOD: Minor imperfections not affecting functionality EXCELLENT: Refurbished equipment in like-new condition NEW, UNUSED: New, not in original packaging NEW IN OPEN BOX: New in original unsealed packaging NEW IN SEALED BOX: New in original sealed packaging click here for full guide Payment & Security Payment methods Your payment information is processed securely. We do not store credit card details nor have access to your credit card information."
}