{
  "url": "https://megadexter.com/articulos/estrategias/943/cuales-movimientos-son-fisicos-y-cuales-especiales-en-la-tercera-generacion",
  "title": "¿Cuáles movimientos son físicos y cuáles especiales en la tercera generación? :: Megadexter",
  "text": "Existe una confusión de los entrenadores que están jugando algún juego Pokémon de la Tercera generación como son Rojo Fuego/Verde Hoja o Rubí/Zafiro/Esmeralda, y esto es debido a que en la mayoría de Pokédex como la de Megadexter, algunos movimientos ofensivos están clasificados como Físicos o Especiales, pero claramente en estos juegos están utilizando la estadística contraria (At. Especial o Ataque). Tal es el caso de Cascada, que está clasificado como Físico, pero aunque subamos al máximo el Stat de Ataque Físico, parece no tener ninguna mejora. Esto es debido a que la Pokédex está actualizada a los datos más recientes, y es que, a partir de la cuarta generación cada movimiento pertenece a una categoría (físico, especial, otro) independientemente de su tipo (agua, fuego, etc) Mientras que en las primeras generaciones, la categoría del movimiento dependía del tipo directamente. De acuerdo a esto, ¿cuáles movimientos corresponden a la categoría físico y cuáles a la categoría especial, de acuerdo a su tipo? Para que te los aprendas, te dejo una excelente mnemotecnia: Todos los tipos de las Eevelutions + Dragón = Especial, el resto eran físicos. Aquí te dejo una imagen bien cute de las Eevelutions para que las recuerdes : Movimientos categoría Especial tercera generación: - Fuego - Agua - Eléctrico - Psíquico - Siniestro - Planta - Hielo - Dragon (Podríamos pensar en el tipo débil a Hada [dragón] para considerar a Sylveon) Por otro lado, los movimientos de categoría físico son todos los demás. Movimientos categoría Físico tercera generación: - Normal - Fantasma - Roca - Tierra - Bicho - Lucha - Volador - Acero - Veneno En cuanto a los movimientos de categoría Otros o Estado, esos pueden ser de cualquier tipo. Espero esta información ayude, entrenadores!"
}