{
  "url": "https://www.raiseright.com/",
  "title": "Gift Card Fundraising (Scrip) for Organizations | RaiseRight",
  "text": "The most convenient way to fundraise Earn up to 5x more with gift card fundraising, online shopping, local dining, and travel bookings. Raise money every time you grab a latte, fill up on gas, buy groceries, or dine out. RaiseRight is the easiest, most practical fundraising program—no selling goods, planning events, or knocking on doors. Earn up to 5x more with gift card fundraising, online shopping, local dining, and travel bookings. Raise money every time you grab a latté, fill up on gas, buy groceries, or dine out. RaiseRight is the easiest, most practical fundraising program—no selling goods, planning events, or knocking on doors. Hundreds of brands, hundreds of ways to earn There’s no limit to how much you or your organization can earn. Shop for your cause Imagine earning up to 20% back for your organization—just by shopping and dining at your favorite places. Your organization earns a percentage with every purchase, with the flexibility to allocate funds freely. Reduce tuition, cover uniforms or equipment, fund travel opportunities, or support your favorite organization—you name it, you fund it. “I’ve been using RaiseRight ever since our kids were in elementary school. After seeing how much I could earn using gift cards for businesses I already shop at, I was hooked! One year, we covered the tuition for one of our children. Now, I continue to buy gift cards to help with our grandkids’ tuition. With rising tuition costs, this is a simple way to defray some of the expense.” – Jan H. 3 steps to easy earnings Shop or dine as usual Purchase gift cards at face value (you get the full amount), shop online with your favorite brands, enjoy a meal at a local restaurant, or book travel. Earn money Your organization earns up to 20% per purchase (6% average, 5% for local dining). The earnings come directly from the brand—it's their way of supporting community groups like yours. Distribute earnings Earnings are deposited into your organization’s account. Track and allocate earnings per participant, or channel funds to initiatives that your group cares about. “I have two daughters that dance competitively and travel to national competitions. Within the first six months of using RaiseRight, I’ve earned over $1,000 to cover some of our costs. This is huge—I feel more comfortable letting them chase their dreams, and this wonderful program has allowed our families to help our children shoot for the stars! It has made a difference in our lives.” – Jennifer M. Why RaiseRight? 30 YEARS helping organizations $900+ MILLION funds raised 100+ MILLION gift cards purchased 50,000+ organizations served A+ RATING accredited business We’re the leader in gift card fundraising, setting the industry standard for digital, convenient, and hassle-free fundraising solutions. Earn up to 5x more You can pair RaiseRight with other profitable fundraising ideas to reach your goals faster. “As a single parent of two girls in band, I work multiple jobs to keep things going. RaiseRight helped me cover their marching band dues, and now we’re using it to raise money so my oldest daughter can attend her first band trip to Disney this spring. Thank you RaiseRight for lightening the load so my girls can participate. ” – Danielle G. More information The Fundraising Playbook Get Your Free Guide12-Month Fundraising Workbook Get Your Free ResourceFundraising 101 Webinar Watch it NowDownload the Guide See how you can start earning 5x more for your fundraising program!"
}