{
  "url": "https://www.allrecipes.com/recipe/238504/classic-bellini-cocktail/",
  "title": "Classic Bellini Cocktail Recipe",
  "text": "Recipes Global Cuisines European Italian Classic Bellini Cocktail Be the first to rate & review! 2 Photos The Bellini was created in the late 1930s to early 1940s by Guiseppe Cipriani at the legendary Harry's Bar in Venice, a favorite hangout for expats including Ernest Hemingway, Sinclair Lewis, and Orson Welles. The fruity cocktail owes its name and color to Cipriani's fascination with Giovanni Bellini, a 15th-century Venetian artist. Originally prepared with Prosecco and white peach puree, it's perfectly acceptable to use yellow peach puree or prepared peach nectar and/or peach schnapps. Sip and feel sophisticated! Submitted by ScandoGirl Updated on September 6, 2023 Save Rate Print Share Close Add Photo Prep Time: 5 mins Total Time: 5 mins Servings: 1 Yield: 1 serving Jump to Nutrition Facts Keep Screen Awake Ingredients 1/2x 1x 2x Oops! Something went wrong. Our team is working on it. This recipe was developed at its original yield. Ingredient amounts are automatically adjusted, but cooking times and steps remain unchanged. Note that not all recipes scale perfectly. Original recipe (1X) yields 1 servings 2 fluid ounces peach juice 4 fluid ounces chilled sparkling wine 1 tablespoon raspberry juice Directions Pour peach juice into a champagne flute. Slowly pour sparkling wine over peach juice; let sit until liquids have blended, about 1 minute. Pour raspberry juice over champagne mixture. Recipe Tips Purists do not use Champagne to make this cocktail because it can be too flavorful and hide the subtle peach flavor.You can use sparkling water instead of sparkling wine for a non-alcoholic cocktail. Save Rate Print Did you make this recipe? I Made It Something went wrong. Please reload and try again. Nutrition Facts (per serving) 136 Calories 13g Carbs 0g Protein Show Full Nutrition Label Hide Full Nutrition Label Nutrition Facts Servings Per Recipe 1 Calories 136 % Daily Value * Sodium 11mg 0% Total Carbohydrate 13g 5% Dietary Fiber 0g 1% Total Sugars 2g Protein 0g 1% Vitamin C 21mg 23% Calcium 15mg 1% Iron 1mg 5% Potassium 165mg 4% * Percent Daily Values are based on a 2,000 calorie diet. Your daily values may be higher or lower depending on your calorie needs. ** Nutrient information is not available for all ingredients. Amount is based on available nutrient data. (-) Information is not currently available for this nutrient. If you are following a medically restrictive diet, please consult your doctor or registered dietitian before preparing this recipe for personal consumption."
}