{
  "url": "https://oregonessential.com/visiting-tillamook-things-to-do/",
  "title": "12 MEMORABLE Things to Do Tillamook, Oregon (Helpful Guide)",
  "text": "Visiting Tillamook while exploring the Oregon coast is a no-brainer . Renowned for producing world-class cheese, the Tillamook Creamery draws over a million visitors annually, filling the town with visitors most months of the year. But there’s more to this charming town than ice cream and cheese. The area is home to 250 miles of trails, a historic lighthouse and ample beach activities, like whale watching and crabbing. Let’s cover the best things to do in Tillamook, Oregon. Best Things To Do in Tillamook (Click here for the table of contents) Visit the (Famous) Tillamook Creamery Let’s kick off this list of the best things to do in Tillamook with a crowd favorite, the Tillamook Creamery. Touristy? Absolutely. Dare I say, cheesy? You bet! But 100% worthwhile. As cliche as it may be, visiting the famous cheese factory really is one of the best activities in Tillamook. I mean, even if learning about cheese isn’t your thing, eating it probably is. The tour gives you a glimpse into how this top-notch cheese and other dairy products are made, and offers plenty of free cheese samples to enjoy. As if indulging in the incredibly creamy cheese isn’t enough, the factory also serves freshly made ice cream. Order a scoop or an entire banana split, no wrong choices here. Admission is free, so really there’s no good reason to skip this interesting Oregon coast staple if you have time to spare. Cheese samples and delicious ice cream, is it any wonder why visiting this creamery is one of the best things to do in Tillamook? Visit the Jacobsen Salt Co. Jacobsen Salt Co. probably needs no introduction. Anyone who’s ever spent $120 recreating their favorite $20 restaurant meal has probably purchased some “bespoke” salt from these folks. Offering a plethora of flavored salts (like lemon), Jacobsen Salt can be found in high-end grocery stores across the country. Well, why not go directly to the source while visiting Tillamook? Hand-harvested from Netarts Bay, a tiny (tiny!) shack by the sea welcomes 1-2 visitors at a time to gander over a handful of salts. I typically buy the small tin containers ($4-5) and give them out as souvenirs for friends. Enjoy a Brew at de Garde Brewing If you’re an avid sour ales fan, make a beeline to de Garde Brewing. Established in 2014, it didn’t take long for locals to acknowledge it as one of the best breweries on the Oregon coast. Specializing in sour ales, creativity is the name of the game at de Garde Brewing. What makes the brewery unique is the unusual brewing method. De Garde is one of a few breweries in the world that uses a coolship method to make beer. A coolship is a flat, open top vessel used for cooling wort (liquid extracted from mashing). As such, the beers are made with natural-forming wild yeasts from the coastal air. The owners, a husband and wife duo, were blindsided by the instant success. Avid beer enthusiasts travel thousands of miles to try these beers, which is why no list of the best things to do in Tillamook is complete without mentioning this gem. If you’re more of a traditionalist, fret not. De Garde has a rotating menu of six guest taps catering to well-loved styles like lagers, ciders, ales and IPAs. But between you and me, it’d be a shame to miss an opportunity to try the best sour ales at the coast. Go Horseback Riding While Visiting Tillamook When we were kids, my younger sister was obsessed with horses. Full-on “I would leave my family to go live with horses” type of obsessed. I encouraged my parents to call her bluff, but they couldn’t take the risk. Instead, they surprised us with horse riding lesson at the coast and it was (easily) one of the best memories we share to this day. If you’re visiting the coast with kids in tow, signing up for horseback rides is one of the best things to do in Tillamook for families. While horseback riding is certainly something that takes a few tries before you start to feel fully comfortable, you don’t need to be a pro by any stretch of the imagination. The feeling of sitting atop a horse as it slowly treks (okay, randomly gallops…) through the waves is the experience of a lifetime. Rest assured that the horseback riding companies are extremely professional and highly equipped to keep you and your family safe during the ride. They even offer miniature horses for small children, and youngsters can also ride with an adult as needed. Local’s Recommendation: Check out Green Acres Beach and Trail Rides and Oregon Beach Rides for more information. Hike to the Octopus Tree Right near Cape Meares is an aptly named Sitka spruce known as the Octopus Tree. The massive branches of this tree have grown into a shape vaguely resembling an octopus. Though there are definitely more than 8 “legs” on this octopus-like tree, the name is a fitting way to describe the twisting, intertwined branches of this unique spruce. No one really knows why this tree grew in such an interesting formation, but it could have something to do with the strong gusts of wind on the coast, or perhaps a genetic mutation that affected the way its limbs grew. You can get a 360 view of this leggy giant by walking around the tree on a designated concrete footpath that is accessible to folks of all ages and abilities. Then, walk just a little further to check out Cape Meares, a majestic headland with gorgeous views out over the ocean. Explore Cape Meares Lighthouse Part of the Three Capes Scenic Loop, Cape Meares is home to a lot more than an octopus-shaped spruce tree. The area is known for having some of the best views on the entire coastline. On top of being incredibly beautiful, the Cape is teeming with wildlife, native plant life, and a special little lighthouse. The Cape Meares lighthouse is the shortest one on the coast, but don’t let its stature fool you! The structure houses one of the biggest kerosene-powered Fresnel lenses to ever have been made. Mariners could see the light from 21 miles away at sea. This tiny but mighty lighthouse guided seafaring folks safely around the jagged headlands of the Oregon coast and stands as a testament to the area’s rich maritime history. Open to visitors from April through October, admission to the lighthouse is entirely free. Afterward, scope the ocean horizon for signs of spouting Gray whales who are easier to spot from this elevated vantage point. Further Reading: The 11 Iconic Lighthouses at the Oregon Coast (+Interesting History) Take in the Views at Cape Lookout Another stop on the Three Capes Scenic Route, Cape Lookout is the perfect place to spend a night while visiting Tillamook. Located on a spit on Tillamook Bay, the list of activities seems endless. Which is why exploring Cape Lookout is one of the most adventurous things to do in Tillamook for hikers, beachcombers, campers, and everyone in between. Hike over 5 miles of intersecting trails that weave between beach and forest. Or comb the beach for interesting shells and agates. Ride ORV’s on the sand (with a permit) and kayak and fish along the water. Sunbathe or swim in the glistening waves, scan the clear blue skies for shorebirds in flight, or take a guided tour to discover some of the local wildlife living around the Cape. Drive to the Harker’s Island Visitor’s Center and explore exhibits full of information about the local history and ecology. You can even take your own boat out to some of the small undeveloped islands just off the coast here–a rare experience for sure. Camping at Cape Lookout If you’re thinking about camping at the coast, Cape Lookout is by far the best place in the area to hunker down. Why? Because it’s one of the few places on the coast where you can tent camp right near the beach. There’s multiple campgrounds in the park, some of which are further inland. If you really want to spoil yourself, consider reserving one of the “deluxe cabins,” especially if you’re traveling with folks who need extra accommodations (or just don’t want to set up a tent). Further Reading: 12 EPIC Campgrounds at the Oregon Coast Hop Aboard the Oregon Coast Scenic Railroad Make the day even more special by hopping out of the car and onto the rails for a whole new way to experience the area. Riding the scenic railroad is one of the best things to do in Tillamook with kids. The Oregon Coast Scenic Railroad operates a historic steam locomotive, taking visitors on a peaceful ride through coastal forest and farm country. Operating every day during the summer months, the train is a one-of-a-kind experience at the coast. There’s something charming about squeezing into a rail car, sipping some tea over a good book, and glancing up occasionally to look out over the ocean from the window of a train. The train rolls along 46 miles of track between Tillamook Bay and the coast range, providing ample travel time for maximum views. This is definitely one of the most unique things to do in Tillamook. Learn Something New at the Tillamook Forest Center Small enough to wander through in under an hour if you’re short on time, the Tillamook Forestry Center offers a fascinating overview of the history of the Tillamook forest and the rest of the coast range. The center offers informational exhibits with a focus on how extensive logging activity has wiped out much of the old growth forest in the region and how logging has evolved to be a more sustainable over the years. The Tillamook Forestry Center does an excellent job of supporting the inevitable need for tree harvesting while providing an overview of how we can do this responsibly and learn more about the forest. Their exhibits on wildlife, plants, rivers, and geology are wonderful, and I especially enjoy the interactive displays. If you have time, definitely check out the fire lookout right next to the parking lot (you can climb to the top). The tower is a replica of real-life fire towers set up around the country. Eat Your Weight in Seafood Okay, narrowing down the best food in Tillamook is a tall order. But hey, it might be helpful to share my personal favorites in the area. The Fish Peddler is at the top of my list whenever I’m craving fresh-caught fish (and shellfish). The clam chowder is the most comforting meal after a long day of adventuring along the coast. Another great spot to check out is Blue Heron French Cheese Company. You’re probably tired of cheese by now (ha, who are we kidding?) but rest assured that Blue Heron has far more than dairy products. The restaurant offers a robust menu of home-cooked meals that are ridiculously satisfying. Take home gift boxes of chocolates and — you guessed it, more cheese. Blue Heron also has a petting zoo. Yep, an actual petting zoo. I’m not sure why in the world a cheese maker would decided to throw in a petting zoo experience, but I’m not here to complain about it. Suitable for kids and adults of all ages, the petting zoo has tons of friendly and happy animals, including chickens, donkeys, and even ostriches. Effectively making this one of the best things to do in Tillamook for kids. Hike Munson Falls Munson Falls is the largest waterfall at the Oregon coast, tumbling a whopping 319 feet down to meet the creek below. What makes this waterfall even better is that it’s super easy to access: the trail is just a quarter mile. The hike takes you through a dreamy old growth forest so green and vibrant it feels Photoshopped. Ancient Western redcedars, Sitka spruces (including one of the country’s tallest!), and Doug firs frame the towering waterfall, making for an epic experience. The river below the waterfall is prime habitat for spanning salmon, and the forest itself provides the perfect home for countless bird species, deer, squirrels, and amphibians that you’ll likely see scurrying between ferns and shrubs. This short hike is a great way to immerse yourself in nature. Bonus: Explore the Evergreen Air & Space Museum While Driving to Tillamook While many of us have probably experienced flying in an airplane, the fast-growing history of engineered flight vessels stretches far beyond commercial airliners. On the highway out toward Tillamook, the Evergreen Air & Space Museum beckons travelers with shiny planes parked right in front of the massive museum. I don’t use the term massive lightly here, the state-of-the-art glass building fits dozens of planes inside! In fact, this museum is home to the world-famous Spruce Goose, the largest wooden airplane ever constructed. You can walk inside of the cockpit and peer down the entire dizzying length of it. Beyond this engineering marvel lie dozens of other planes, rockets, space vessels, and aviation-related artifacts and memorabilia.You could literally spend hours learning about the history of flight, admiring the retired aircraft, and even put yourself right in the control center of a rocket launch in a control center simulator. You don’t need to be a history buff to see that this is one of the best things to do near Tillamook. Visiting Tillamook, Oregon Best Things To Do In (Post Summary) In sum, here’s a quick list of the best things to do in Tillamook, Oregon. Hope you enjoyed! - Visit the (Famous) Tillamook Creamery - Hike Munson Falls - Enjoy a Brew at de Garde Brewing - Visit the Jacobsen Sea Salt Factory - Go Horseback Riding While Visiting Tillamook - Check out the Octopus Tree - Explore Cape Meares Lighthouse - Take in the views at Cape Lookout - Hop Aboard the Oregon Coast Scenic Railroad - Visit the Evergreen Air & Space Museum - Visiting Tillamook? Eat Your Weight in Seafood - Learn something new at the Tillamook Forest Center"
}