{
  "url": "https://en.wikipedia.org/wiki/Cowbell_(instrument)",
  "title": "Cowbell (instrument) - Wikipedia",
  "text": "Cowbell (instrument) The cowbell is an idiophone hand percussion instrument used in various styles of music, such as Latin and rock. It is named after the similar bell used by herdsmen to keep track of the whereabouts of cows. The instrument initially and traditionally has been metallic; however, contemporarily, some variants are made of synthetic materials. Origins [edit]While the cowbell is commonly found in musical contexts, its origin can be traced to freely roaming animals. In order to help identify the herd to which these animals belonged, herdsmen placed these bells around the animal's neck. As the animals moved about the bell would ring, thus making it easier to know of the animal's whereabouts. Though the bells were used on various types of animals, they are typically referred to as \"cowbells\" due to their extensive use with cattle.[1] Tuned cowbells [edit]Tuned cowbells or Almglocken (their German name, ‘Alm’ meaning a mountain meadow, and ‘Glocken’ bells), sometimes known by the English translation alpine bells (also Alpenglocken in German), typically refer to bulbous brass bells that are used to play music, sometimes as a novelty act or tourist attraction in the northern Alps, and sometimes in classical music, as in Richard Strauss's Alpine Symphony. Since they are tuned differently, in order to distinguish individual animals, they can be collected \"from the pasture\" in random tunings, but commercial sets in equal temperament are also available. The metal clapper is retained, and they sound much noisier than handbells, which are otherwise used similarly in ensembles.[citation needed] Composers who included Almglocken among their musical palette include Tōru Takemitsu, Jo Kondo, Gustav Mahler, Richard Strauss, Roy Harter, John Adams, Thomas Ades, Joseph Schwantner, and Karlheinz Stockhausen. Olivier Messiaen used multiple chromatic sets of clapperless cowbells in several of his compositions, notably Et expecto resurrectionem mortuorum and Couleurs de la cité celeste.[citation needed] Clapperless cowbells [edit]Clapperless cowbells made of metal are an important element in Latin-American and go-go music. These cowbells are struck with a stick – the tone being modulated by striking different parts of the bell and by damping with the hand holding the bell.[citation needed] In several parts of the world (notably in West Africa) pairs or trios of clapperless bells are joined in such a way that they can be struck separately or clashed together. The Brazilian name for these is \"agogo\" bells. Cylindrical wood blocks played in the same way are also called \"Agogô\". In Cuban music the cowbell is called cencerro and often played by the same player as the bongos. In Caribbean music two or three are often mounted together with a pair of timbales.[citation needed] This type of cowbell can also be played with the foot using a modified bass drum pedal or bowed with a double bass bow.[citation needed] Sports use [edit]Cowbells are sometimes popular noisemakers at sporting events, despite attempts to suppress them. While different sports teams seem to have their own story explaining the use of cowbells at their games, it is unlikely that so many teams across varying levels of sports and geographical regions would not have a common cultural reason for the practice. Although the origin of cowbell noisemakers is unclear, the most plausible explanation has to do with early baseball. Baseball games in the 19th century were often played in cow pastures, as American society was agrarian-based at the time. Cowbells were easily found or taken from around the necks of cows in the pasture and were utilized as noisemakers. The tradition naturally grew to be common practice at various sporting events, not just baseball.[2] In the United States, they are most closely identified with Mississippi State University, whose football fans once smuggled in cowbells by the thousands despite a ban on artificial noisemakers by its conference, the Southeastern Conference.[3] SEC guidelines were changed in 2010 to permit limited cowbell use at Mississippi State football games, and again in 2014 to permit cowbells to be freely rung at any time except between the time that the offensive center is over the football until the play is whistled dead.[4] Elsewhere in college football, the cowbell can be found at Penn State and Michigan football games, where it is played with a particular rhythm and accompanying chant.[5] Worldwide, in cross-country skiing, cowbells are often rung vigorously at the start and finishes of races, to cheer on the racers. They are used by cyclocross fans in much the same way. Cornell ice hockey fans who are also known for their zealous support of their team have cheers that feature use of a cowbell while in Lynah Rink. The San Jose SaberCats of the Arena Football League are also infamous for their fans' use of cowbells. In New Zealand, supporters of the Waikato Rugby Union invariably use cowbells at home matches; this has been carried over to home matches of the Chiefs, the Super Rugby franchise centered on the Waikato region. During University of New Hampshire ice hockey games, a small group of fans at the base of the student section show their support for the UNH Wildcats with a cowbell. This group also leads the chants and shows their support with posters and other props. Finally the 2006–2007 American Basketball Association (ABA) champion Vermont Frost Heaves have a large cowbell following at their home games. A small number of Toronto Blue Jays fans at Rogers Centre frequently bring cowbells to Blue Jays home games. They are common enough at Tampa Bay Rays home games that the stadium scoreboard graphics crew have a pre-built graphic that says \"More Cowbell!!\". The Everett Silvertips fans also use cowbells, after the team watched the Saturday Night Live skit while on their tour bus in their inaugural season, and said they wanted the fans to have cowbells. They have a \"more cowbell\" that sometimes shows on the jumbotron. The Belleville Bulls in the Ontario Hockey League used the skit on their video scoreboard and \"More Cowbell\" as a catchphrase during the 2007 playoffs. Their goalie Edward Pasquale has several Will Ferrell characters painted on his goalie mask, including the one from the Saturday Night Live skit with the cowbell and others. Fans of the National Basketball Association's Sacramento Kings began bringing cowbells to the team's games at ARCO Arena after Los Angeles Lakers head coach Phil Jackson referred to Sacramento as a \"cow town\" with \"semi-civilized\" fans during the 2002 Western Conference Finals. The cowbell has become a tradition for the Melbourne Storm fans in the NRL and is rung by a group of 3 people in the active supporter bay behind the goals at AAMI Park, as well as a few other people around the ground. The supporters of Huddersfield Giants also have a small, enthusiastic group of fans known as \"the cowbell army\" who try and create a fun and friendly atmosphere at home and away games in the Super League. In popular culture [edit]\"More cowbell\" is an American catchphrase spoken as a humorous recommendation for improving a music performance. The phrase originated from Christopher Walken saying it in a comedy sketch[6] that aired on Saturday Night Live on April 8, 2000.[7] See also [edit]- Agogô – Type of bell originating with the Yoruba and Edo peoples - Artificial noise – Sounds and signals generated by humans - Gonguê – Brazilian percussion instrument - Safri Duo – Danish electronic percussion duo - Skrabalai - a Lithuanian wooden folk instrument originating from cowbells. References [edit]- ^ \"The Oxford Pocket Dictionary of Current English 2007\". Oxford University Press. Retrieved 2007-11-04. - ^ \"Baseball: The People's Game:, Seymour, Harold; Oxford University Press, 1991 - ^ \"SEC votes for football yardage penalties for cowbell use\". Mississippi State University. 2002-06-10. Retrieved 2006-12-14. {{cite web}} :|archive-url= is malformed: timestamp (help)CS1 maint: url-status (link) - ^ Stevens, Matthew (31 May 2014). \"SEC clarifies cowbell compromise\". Columbus Dispatch. Retrieved 10 December 2014. - ^ \"Former mascot keeps his bell ringing\". The Daily Collegian. 1996-10-02. Archived from the original on 1997-01-05. Retrieved 2008-10-01. - ^ Lifton, Dave. \"Jimmy Fallon Recalls Famous Blue Oyster Cult / 'More Cowbell' Saturday Night Live Skit\". Ultimate Classic Rock. Retrieved 2023-05-09. - ^ \"50 Greatest 'SNL' Sketches of All Time\". Rolling Stone. 2014-02-03. Retrieved 2023-05-09. External links [edit]- Media related to Cowbells at Wikimedia Commons"
}