{
  "url": "https://www.islandrolfing.com/",
  "title": "Home - Island Rolfing",
  "text": "Energy, Balance & Strength Release chronic pain, stiffness, and stress with Rolfing WHAT IS ROLFING? Rolfing Structural Integration (Rolfing SI) is a system of bodywork which utilizes connective tissue (fascial) manipulation and movement education to integrate the human structure resulting in better balance, increased flexibility, improved physical abilities, and greater health. It is the product of fifty years of practice and study by Dr. Ida P. Rolf. Rolfing’s basic premise is that by changing the structure of the body, the functioning of the entire human being is enhanced. By gently rebalancing, realigning, and reshaping the body, unresolved chronic pain can be relieved or eliminated, posture is improved, flexibility is increased and there is an overall sense of well-being. Your body can be impaired through both physical and emotional injury. When this happens the rest of your body must compensate to maintain balance. The job of a Rolfer is to disengage restrictions between fascial layers, allow the muscles to return to a more balanced relationship, and help your body to release compensations. This is accomplished by systematically organizing the body’s connective tissue network. This connective tissue network of ligaments, tendons and coverings of the bones, muscles, and organs is called the fascia system. Fascia is the “organ of structure” in your body. It supports the skeleton and soft tissues, stabilizes the position of the bones, determines how you move, and gives the body its shape. Often considered a deep-tissue approach, Rolfing SI actually works with all the layers of the body to ease strain patterns in the entire system. Research has demonstrated that Rolfing creates more efficient muscle use, allows the body to conserve energy, and creates more economical and refined patterns of movement. Rolfing has also been shown to significantly reduce chronic stress, reduce spinal curvature in subjects with lordosis (sway back), and enhance neurological functioning. Rolfing SI is commonly done in a series of bodywork sessions, called the Ten-Series. This work is focussed on creating long lasting and profound change. The effects are seen in improved posture and felt in overall well-being. Who Uses Rolfing? People seek Rolfing SI as a way to reduce pain and chronic muscle tension from physical and emotional traumas. Rolfing SI is used by many professional athletes to break up scar tissue, rehabilitate injuries, and increase range of motion to improve performance and avoid future injuries. Dancers and musicians often use Rolfing SI to increase comfort in their bodies while performing, as well as to avoid repetitive stress injuries. Additionally, Rolfing SI has also helped some manufacturing companies lower their workers’ compensation costs due to reduction in repetitive stress injuries. And, based on the mind/body connection, many counsellors and therapists incorporate Rolfing SI in their therapeutic solutions, because greater physical support and flexibility ultimately influences emotions and energy levels. Benefits of Rolfing Professional athletes, dancers, children, business professionals, and people from all walks of life have benefited from Rolfing Structural Integration. Some of the benefits include: - Relief from chronic pain and injuries - Reduced stress and tension - Repair of scar tissue - Improved postural alignment - Greater body awareness and integration - Increased flexibility and coordination - Increased overall energy and stamina - Enhanced athletic performance - Increased resilience and vitality Meet Brett Brett Holland is a Certified Advanced Rolfer™. He received his basic training at the Rolf Institute in Boulder, Colorado in 2010 and completed his Advanced training with Jan Sultan in 2018. His aim is to unwind the trauma, strain or injury that is held in a person’s body. When the trauma, strain or injury is released from the tissue, what remains is a basic sense of ease and comfort. While Rolfing SI is a very direct hands-on practice, it can also be very subtle at times as not all traumas respond to the same approach. Book Your Session Now HOURS Cobble Hill Tuesday 9am – 2pm Friday 9am – 2pm Victoria Monday 10.00am – 6:15pm Thursday 10.00am – 6.15pm Book Your Session Now HOURS Cobble Hill Tuesday 9am – 2pm Friday 9am –2pm Victoria Monday 10.00am – 6.15pm Thursday 10.00am – 6.15pm"
}