{
  "url": "https://support.microsoft.com/pt-br/windows/ativar-ou-desativar-o-bluetooth-no-windows-9e92fddd-4e12-e32b-9132-5e36bdb2f75a",
  "title": "Ativar ou desativar o Bluetooth no Windows - Suporte da Microsoft",
  "text": "Ativar ou desativar o Bluetooth no Windows Aplica-se a Para dispositivos Windows com Bluetooth, o Bluetooth pode ser ativado e desativado. Desligar o Bluetooth e ativar redefine o Bluetooth e pode ajudar com problemas de conexão Bluetooth. Há diferentes maneiras de ativar e desativar o Bluetooth no Windows. Selecione o método desejado na seguinte lista: Para ativar e desativar o Bluetooth no aplicativo Configurações: - No dispositivo Windows, selecione Iniciar e selecione Configurações > dispositivos Bluetooth & .Abrir dispositivos bluetooth & dispositivos Ou Selecione os seguintes dispositivos Bluetooth & atalho: - Na janela dispositivos Bluetooth & , ao lado do Bluetooth, alterne Bluetooth ativado oudesativado. Observação: Se a configuração bluetooth estiver ausente, o dispositivo Windows poderá não ter um adaptador Bluetooth. Se o dispositivo Windows tiver um adaptador Bluetooth, os drivers do adaptador Bluetooth poderão não ser instalados. Para ativar e desativar o Bluetooth em configurações rápidas: - Selecione o ícone Rede , Som ou Bateria ao lado da hora e da data. - Selecione o bloco Bluetooth para ativar e desativar o Bluetooth. - Se o Bluetooth estiver desativado, o bloco não será realçado e poderá dizer Desativado. - Se o Bluetooth estiver ativado, o bloco será realçado e diz Conectado, Não conectado ou mostra o dispositivo ao qual está conectado via Bluetooth. - Importante: - A ação Bluetooth pode precisar ser adicionada se não estiver visível em configurações rápidas. Para obter mais informações, consulte Alterar notificações e configurações rápidas no Windows 11. - Se a ação Bluetooth não estiver disponível nas configurações de notificação no aplicativo Configurações, o dispositivo Windows poderá não ter um adaptador Bluetooth. Se o dispositivo Windows tiver um adaptador Bluetooth, os drivers do adaptador Bluetooth poderão não ser instalados. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. Para ativar e desativar o Bluetooth no aplicativo Configurações: - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos .Abrir Bluetooth & outros dispositivos Ou Selecione o seguinte Bluetooth & outros dispositivos atalho: - Na janela Bluetooth & outros dispositivos , em Bluetooth, alterne Bluetooth ativado ou desativado. Observação: Se a configuração bluetooth estiver ausente, o dispositivo Windows poderá não ter um adaptador Bluetooth. Se o dispositivo Windows tiver um adaptador Bluetooth, os drivers do adaptador Bluetooth poderão não ser instalados. A central de ações ( ou ) pode ser encontrada ao lado da hora e da data na barra de tarefas. Para ativar e desativar o Bluetooth no centro de ação: - Na barra de tarefas, selecione o ícone da central de ações ( ou ). - No centro de ações, selecione o bloco Bluetooth para ativar e desativar o Bluetooth. Se o bloco Bluetooth não estiver visível, selecione Expandir acima dos blocos. - Se o Bluetooth estiver desativado, o bloco não será realçado e poderá dizer Desativado. - Se o Bluetooth estiver ativado, o bloco será realçado e diz Conectado, Não conectado ou mostra o dispositivo ao qual está conectado via Bluetooth. - Se o bloco Bluetooth não estiver no centro de ações mesmo depois de selecionar Expandir, siga estas etapas para adicioná-lo: - No dispositivo Windows, selecione Iniciar e selecione Configurações > Notificações do Sistema > & ações .Abrir Notificações & ações Ou Selecione as seguintes notificações & ações atalho: - Na janela Notificações & ações, em Ações rápidas, selecione Editar suas ações rápidas. - No painel lateral que é aberto, selecione Adicionar e, em seguida, selecione Bluetooth . Importante: Se o Bluetooth não estiver disponível para adicionar, o dispositivo Windows poderá não ter um adaptador Bluetooth. Se o dispositivo Windows tiver um adaptador Bluetooth, os drivers do adaptador Bluetooth poderão não ser instalados. - Se desejar, organize o bloco Bluetooth recém-adicionado ao local desejado. Para obter mais informações sobre como alterar os aplicativos e as configurações que aparecem no centro de ações, confira Alterar notificação e configurações rápidas no Windows."
}