{
  "url": "https://www.kellogg.northwestern.edu/",
  "title": "Kellogg School of Management: Build Your Legacy",
  "text": "Start of Main Content Become a Kellogg leader. We bring the future of business into focus. Powered by globally celebrated faculty and trailblazing research, Kellogg is a business school and a community of ambitious and collaborative thought leaders. We prepare our graduates to think creatively, lead authentically and embrace change with confidence. From classroom to career Now more than ever, the world needs strong, empathetic leaders whose journey to success starts with a commitment to personal growth. Hear from our alumni about how Kellogg prepared them to have a successful career with lasting impact. Your journey at Kellogg will see you learn more, dream more and do more. And as a result, you'll become more — a Kellogg Leader. First visit? Start here Your business school, your MBA program Set yourself up for success by finding the right MBA program for you. Explore what our Full-Time, Evening & Weekend or Executive MBA Programs have to offer. Kellogg MBA programs Full-Time MBA Choose from six distinct MBA programs, each ranging from one to three years. Evening & Weekend MBA Benefit from a flexible schedule in a convenient downtown location. Executive MBA For mid- to senior-level executives looking to enhance career growth. Non-degree program Executive Education Help your organization tackle some of the most pressing challenges in today’s market by registering for one of our Executive Education programs. PhD degree Doctoral Program Become an expert in your field and apply that mastery to global, real-world problems. Master in Management Master in Management For recent grads or those who have less than two years work experience to learn business fundamentals. Certificate Program Certificate Program for Undergraduates Available to current undergrads for early career preparation in data-driven industries. Applying to Kellogg Get to know more about us and our community, as well as opportunities to visit and connect. APPLICATION DEADLINES Full-Time MBA Program Round 1: Sept. 10, 2025 Round 2: Jan. 7, 2026 Round 3: April 1, 2026 Evening & Weekend MBA Program Winter: Sept. 24, 2025 Spring: Jan. 7, 2026 Summer: Mar. 25, 2026 Fall: June 3, 2026 Executive MBA Program Feb. 4, 2026 April 1, 2026 June 3, 2026* Aug. 12, 2026 Oct. 7, 2026** *Last deadline for Fall 2026 start **Last deadline for Winter 2027 start Our commitment to you Advancing belonging and inclusion at Kellogg is a commitment and responsibility we share with our entire community. Together, we will ensure this is an environment where everyone can bring their full identities to Kellogg. Tech AI’s Past, Present, and Future Artificial intelligence is transforming business, science, marketing, and labor. Kellogg faculty tell us how we got here and what could be next. 10 minute read"
}