{
  "url": "https://apnews.com/article/immigration-enforcement-drawdown-minnesota-homan-963adf341325d7f6eb5673e1c00d3c2a",
  "title": "Homan says 700 immigration officers to leave Minnesota immediately | AP News",
  "text": "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately MINNEAPOLIS (AP) — The Trump administration is reducing the number of immigration officers in Minnesota but will continue its enforcement operation that has sparked weeks of tensions and deadly confrontations, border czar Tom Homan said Wednesday. About 700 federal officers — roughly a quarter of the total deployed to Minnesota — will be withdrawn immediately after state and local officials agreed over the past week to cooperate by turning over arrested immigrants, Homan said. But he did not provide a timeline for when the administration might end the operation that has become a flashpoint in the debate over President Donald Trump’s mass deportation efforts since the fatal shootings of U.S. citizens Renee Good and Alex Pretti in Minneapolis. About 2,000 officers will remain in the state after this week’s drawdown, Homan said. That’s roughly the same number sent to Minnesota in early January when the surge ramped up, kicking off what the Department of Homeland Security called its “ largest immigration enforcement operation ever.” The Trump administration is reducing the number of federal law enforcement officers in Minnesota. AP correspondent Donna Warder reports. Since then, masked, heavily armed officers have been met by resistance from residents who are upset with their aggressive tactics. A widespread pullout, Homan said, will occur only after there’s more cooperation and protesters stop interfering with federal agents carrying out arrests. Trump told NBC News that he ordered the reduction and added that one lesson coming out of the turmoil in Minnesota is “maybe we can use a little bit of a softer touch. But you still have to be tough.” Gov. Tim Walz and Minneapolis Mayor Jacob Frey, both Democrats who have heavily criticized the surge, said pulling back 700 officers was a good first step but that the entire operation should end quickly. “We need a faster and larger drawdown of forces, state-led investigations into the killings of Alex Pretti and Renee Good, and an end to this campaign of retribution,” Walz posted on social media. Vice President JD Vance said the officers being sent home were mainly in Minneapolis to protect those carrying out arrests. “We’re not drawing down the immigration enforcement,” Vance said in an interview on “The Megyn Kelly Show.” Trump administration has pushed for cooperation in Minnesota Trump’s border czar took over the Minnesota operation in late January after the second fatal shooting by federal officers and amid growing political backlash and questions about how the operation was being run. Homan said right away that federal officials could reduce the number of agents in Minnesota, but only with the cooperation of state and local officials. He pushed for jails to alert Immigration and Customs Enforcement about inmates who could be deported, saying transferring those inmates to ICE is safer because it means fewer officers have to be out looking for people in the country illegally. Homan said during a news conference Wednesday that there has been an “increase in unprecedented collaboration” resulting in the need for fewer public safety officers in Minnesota and a safer environment, allowing for the withdrawal of the 700 officers. He didn’t say which jurisdictions have been cooperating with DHS. White House press secretary Karoline Leavitt said in a statement that the administration will monitor local officials to make sure they keep their commitments. The Trump administration has long complained that places known as sanctuary jurisdictions — a term applied to local governments that limit law enforcement cooperation with the department — hinder the arrest of criminal immigrants. Minnesota officials say its state prisons and nearly all of the county sheriffs already cooperate with immigration authorities. But the two county jails that serve Minneapolis and St. Paul and take in the most inmates had not previously met ICE’s standard of full cooperation, although they both hand over inmates to federal authorities when an arrest warrant is signed by a judge. The Hennepin County Sheriff’s Office, which serves Minneapolis and several suburbs, said its policies have not changed. County Attorney Mary Moriarty said the jail gives ICE legally required information, adding that handing over someone before they’re convicted “strips our community of the accountability it deserves and harms victims by robbing them of a court process.” The Ramsey County Sheriff’s Office in neighboring St. Paul did not immediately respond to a request for comment. Border czar calls Minnesota operation a success Homan said he thinks the ICE operation in Minnesota has been a success, checking off a list of people wanted for violent crimes who were taken off the streets. “I think it’s very effective as far as public safety goes,” he said Wednesday. “Was it a perfect operation? No.” He also made clear that pulling some federal officers out of Minnesota isn’t a sign that the administration is backing down. “We are not surrendering the president’s mission on a mass deportation operation,” Homan said. “You’re not going to stop ICE. You’re not going to stop Border Patrol,” Homan said of the ongoing protests. “The only thing you’re doing is irritating your community.” Schools ask court to block immigration operations Two Minnesota school districts and a teachers union filed a lawsuit Wednesday to block federal authorities from conducting immigration enforcement at or around schools, saying their actions have disrupted classes, endangered students and caused attendance drops. The lawsuit also argues that Operation Metro Surge has marked a shift in policy that removed long-standing limits on enforcement in “sensitive locations,” including schools. Homeland Security spokesperson Tricia McLaughlin said “ICE is not going to schools to arrest children — we are protecting children.” ___ Associated Press reporters Corey Williams in Detroit; John Seewer in Toledo, Ohio; and Moriah Balingit in Washington contributed."
}