{
  "url": "https://oeco.org.br/externo/tubaroes-sao-famosos-por-seus-dentes-ameacadores-mas-a-acidificacao-dos-oceanos-pode-torna-los-mais-fracos/",
  "title": "Tubarões são famosos por seus dentes ameaçadores, mas a acidificação dos oceanos pode torná-los mais fracos - ((o))eco",
  "text": "- Publicado originalmente por Associated Press PORTLAND, Maine (AP) – Os tubarões são os predadores mais temidos do mar, e sua sobrevivência depende de dentes imponentes, que se regeneram ao longo de toda a vida. Mas mudanças no PH dos oceanos podem colocar sua importante ferramenta de caça em risco. Esse é o principal achado de um estudo realizado por um grupo de cientistas alemães, que testou os efeitos de um oceano mais ácido sobre os dentes dos tubarões. Pesquisadores têm associado atividades humanas – incluindo a queima de carvão, petróleo e gás – à acidificação contínua dos oceanos. A pesquisa pode identificar que à medida que os oceanos se tornam cada vez mais ácidos, os dentes dos tubarões podem ficar estruturalmente mais fracos e, portanto, propensos a se quebrar. Os cientistas que participaram do estudo alertam que isso poderia ter impactos diretos na posição desses grandes peixes enquanto predadores de topo da cadeia alimentar marinha. O oceano não passará a ser povoado por tubarões desdentados da noite para o dia, enfatizou o principal autor do estudo, Maximilian Baum, biólogo marinho da Universidade Heinrich Heine de Düsseldorf. No entanto, Baum reforça que a possibilidade de dentes enfraquecidos representa um novo risco para os tubarões, que já enfrentam desafios como a poluição, sobrepesca, mudanças climáticas, entre outras ameaças. “Descobrimos que há um efeito de corrosão nos dentes dos tubarões”, disse Baum. “Todo o sucesso ecológico deles no oceano,como dominantes sobre outras populações, pode estar em perigo.” As mudanças podem ocorrer de forma gradual Os pesquisadores publicaram seu trabalho na revista Frontiers in Marine Science. O estudo foi conduzido em um momento onde a acidificação dos oceanos tem se tornado foco cada vez maior para investigações de cientistas que atuam com a conservação. A Administração Nacional Oceânica e Atmosférica dos Estados Unidos (NOAA) explica que a acidificação ocorre quando os oceanos absorvem mais dióxido de carbono do ar. Os cientistas alemães responsáveis pelo estudo alertam que os oceanos devem se tornar quase 10 vezes mais ácidos até o ano de 2300. Os cientistas realizaram o estudo coletando mais de 600 dentes descartados de um aquário que abriga tubarões-de-pontas-negras-de-recife (Carcharhinus melanopterus) – uma espécie que vive nos oceanos Pacífico e Índico e que atinge cerca de 1,7 metro de comprimento. Em seguida, os pesquisadores expuseram os dentes à água com o nível de acidez atual e com a acidez projetada para o ano de 2300. Os dentes expostos à água mais ácida apresentaram danos muito mais severos, como rachaduras e perfurações, corrosão da raiz e degradação da própria estrutura do dente, escreveram os cientistas. Os resultados “mostram que a acidificação dos oceanos terá efeitos significativos sobre as propriedades morfológicas dos dentes”, afirmaram os pesquisadores. Um tubarão de dentes frágeis ainda sim é um tubarão Os dentes dos tubarões são “armas altamente desenvolvidas, feitas para cortar carne, e não para resistir à acidificação dos oceanos”, explicou Baum. Ao longo da vida, os tubarões passam por milhares de dentes, e eles são fundamentais para que esses animais consigam regular as populações de peixes e mamíferos marinhos nos oceanos. Muitos tubarões também enfrentam risco de extinção: mais de um terço das espécies de tubarões estão atualmente ameaçadas, segundo a União Internacional para a Conservação da Natureza (IUCN). Ainda assim, os tubarões contam com uma série de fatores que podem ajudá-los a evitar os efeitos negativos da acidificação dos oceanos, disse Nick Whitney, cientista sênior do Anderson Cabot Center for Ocean Life, no New England Aquarium. Whitney, que não participou do estudo, afirmou que o trabalho dos cientistas sobre os dentes dos tubarões é consistente. No entanto, ele explica que, como os dentes se desenvolvem dentro do tecido bucal dos tubarões, eles ficam protegidos das mudanças na química dos oceanos por algum tempo. Whitney lembra que a história nos mostra que os tubarões são sobreviventes. “Eles existem há 400 milhões de anos e evoluíram e se adaptaram a todo tipo de condição ambiental”, afirmou. A acidificação dos oceanos pode ser motivo de preocupação, mas a sobrepesca continua representando a maior ameaça aos tubarões, disse Gavin Naylor, diretor do Programa de Pesquisa sobre Tubarões da Flórida, no Museu de História Natural da Flórida. A acidificação trará muitas mudanças Naylor e outros especialistas alertam que a acidificação dos oceanos deve representar diversas ameaças ao ambiente marinho, para além dos tubarões. A acidificação é considerada especialmente prejudicial para organismos com conchas, como ostras e mariscos, pois dificulta a formação dessas estruturas, segundo a Administração Nacional Oceânica e Atmosférica dos Estados Unidos (NOAA). Ela também pode tornar as escamas dos peixes mais fracas e quebradiças. Naylor ressalta, no entanto, que ainda é difícil dizer se isso poderia, em última instância, beneficiar os tubarões que se alimentam desses peixes. Por ora, Baum afirma que a acidificação dos oceanos não pode ser descartada como uma ameaça enfrentada pelos tubarões. Algumas espécies podem caminhar para sua extinção nos próximos anos, e a acidificação dos oceanos pode ser um dos fatores que levem a esse cenário. “O sucesso evolutivo dos tubarões depende de seus dentes perfeitamente desenvolvidos”, afirmou Baum. *Esta história foi originalmente publicada em Inglês. A tradução foi feita com o auxílio de Inteligência Artificial, com revisão final do jornalista Vinícius Nunes. Leia também Tubarão-das-galápagos é considerado extinto no Brasil Registros históricos mostram que essa espécie de tubarão, antes abundante, desapareceu há 13 anos do Arquipélago de São Pedro e São Paulo. → Um novo tubarão nas águas afetadas pela Samarco Nova espécie de cação-anjo foi descrita no litoral brasileiro. Ela vive escondida no fundo do mar, entre o Espírito Santo e Alagoas → Tubarão-baleia: só tem tamanho O homenageado do ((o))eco esta semana não é apenas o maior tubarão, como também o maior peixe do mundo. E é totalmente inofensivo. →"
}