{
  "url": "https://blogs.bing.com/search/July-2024/generativesearch",
  "title": "Introducing Bing generative search | Bing Search Blog",
  "text": "After introducing LLM-powered chat answers on Bing in February of last year, we’ve been hard at work on the ongoing revolution of search. Bing continues to be trusted by hundreds of millions of users to find information, get answers to questions, and explore their curiosity. Today, we’re excited to share an early view of our new generative search experience which is currently shipping to a small percentage of user queries. By combining the power of generative AI and large language models (LLMs) with the search results page, Bing’s generative search creates a bespoke and dynamic response to a user’s query. For example, if a user searches \"What is a spaghetti western?\" Bing shows an AI-generated experience that dives into the film subgenre, including its history and origins, top examples and more. The information is easy to read and understand, with links and sources that show where it came from or let the user dive deeper. The regular search results continue to be prominently displayed on the page like always. This new experience combines the foundation of Bing’s search results with the power of large and small language models (LLMs and SLMs). It understands the search query, reviews millions of sources of information, dynamically matches content, and generates search results in a new AI-generated layout to fulfill the intent of the user’s query more effectively. We've refined our methods to optimize accuracy in Bing, applying those insights as we continue to evolve our use of LLMs in search. We are continuing to look closely at how generative search impacts traffic to publishers. Early data indicates that this experience maintains the number of clicks to websites and supports a healthy web ecosystem. The generative search experience is designed with this in mind, including retaining traditional search results and increasing the number of clickable links, like the references in the results. This is another important step in evolving the search experience on Bing and we’re eager to get feedback throughout this journey. We are slowly rolling this out and will take our time, garner feedback, test and learn, and work to create a great experience before making this more broadly available. Please let us know what you think by utilizing the thumbs up and thumbs down icons at the top of the generative search results or click the Feedback icon at the bottom of the search results page to provide further comments. We look forward to sharing more updates in the coming months."
}