{
  "url": "https://www.resetera.com/threads/borderlands-4-ot-zanzibart…forgive-me.1291206/",
  "title": "Borderlands 4 |OT| Zanzibart…forgive me OT | ResetEra",
  "text": "User warned: Impersonating staff About This Game Developer: Gearbox SoftwarePublisher: 2K Genre: First-Person Shlooter / RPG Platforms: PC (Steam, Epic Games Store), PS5, Xbox Series S|X, Switch 2 Price: $69.99, £69.99, 69,99€ (Standard) / $99.99, £89.99, 99,99€ (Deluxe) / $129.99, £119.99, 129,99€ (Super Deluxe) [Pricing varies by region and platform.] Release Date: September 11th, 2025 [PC], September 12th 2025 [Consoles] Global Release Times Game Editions Game Editions Collector's Edition Description Borderlands 4 brings intense action, badass Vault Hunters, and billions of wild and deadly weapons to an all-new planet ruled by a ruthless tyrant.Crash into Kairos as one of four new Vault Hunters seeking wealth and glory. Wield powerful Action Skills, customize your build with deep skill trees, and dominate enemies with dynamic movement abilities. Break free from the oppressive Timekeeper, a ruthless dictator who dominates the masses from on high. Now a world-altering catastrophe threatens his perfect Order, unleashing Mayhem across the planet. Features BE A BADASS Become an unstoppable force of battle, blasting through enemies with an all-new arsenal of outrageous weaponry. Move across the Borderlands like never before—double jumping, gliding, dodging, grappling, and more—dealing death from every direction. Explode each encounter with devastating Action Skills that unleash your Vault Hunter's unique abilities. Craft your perfect build with branching skill trees and a deep, rewarding loot chase full of explosive weapons and powerful gear. FIGHT SOLO OR CO-OP Wreaking havoc across Kairos is awesome alone and even better with friends in 4-player online co-op. Borderlands 4 is designed for co-op from the ground up, supporting however you want to play. Whether you're hunting for loot, tackling missions, or wandering freely, level scaling and individual difficulty keeps the party together and having fun. LESS BORDERS, MORE LANDS Freely explore a vast and dangerous world rife with warring factions. Hop on your hover bike and ride through lush fields, towering peaks, and deadly deserts full of fearsome enemies, dynamic events, and engaging quests with unforgettable characters. Unite the people of Kairos and ignite a revolution, tackling this adventure however you see fit in a seamless Borderlands experience. RIDE ON YOUR DIGIRUNNER Cruising around Kairos is a breeze on your personalized Digirunner vehicle, which you can summon almost anywhere. When you're not jet-boosting across huge expanses or using the Digirunner's front-mounted turret to mow down enemies, you can customize its components and handling via unlockable Hover Drives, and give it a new aesthetic with collectible cosmetics. EXPLORE WITH ECHO-4 This loyal drone buddy is always ready to provide guidance with the press of a button, showing you the best path across Kairos to your next objective. Your ECHO-4 also lets you upgrade your ammo-carrying capacity or change your Vault Hunter's cosmetic appearance no matter where you are. TAKE KAIROS BACK As you traverse Kairos, keep an eye out for Points of Interest that you can claim for your Crimson Resistance, weakening the Timekeeper's grip on the planet. Once you've wiped out any nearby enemies, you can reclaim places like safe houses to expand your Fast Travel options, or silos with decommissioned Order communications balloons that let you take to the sky, scope out your next target, and aid your search for elusive Vault Key Fragments. Vex the Siren Vault Hunters (Click on their images to view their individual info pages, with abilities, skill trees and their character shorts.)Vex the Siren Vex had a rough upbringing that was made more complicated by receiving her Siren powers. Her cynical and sarcastic demeanor comes from having to fend for herself and scrape for everything she's got. But underneath her salty exterior, Vex is an empath who knows better than anyone how much life can suck. Ever the pessimist, Vex still believes in helping others. And if helping others means dealing damage to oppressive jerks, Vex will always be first in line. She wields supernatural phase energy to devastating effect. Vex can use that energy to empower herself, or channel it to conjure deadly minions that fight alongside her. Rafa was born and raised in microgravity, which severely altered his bone density and musculature, making it impossible for him to survive elsewhere. Desperate to explore, he signed up to Tediore's military force. In exchange for a tour of duty, his body was altered for a new kind of exo-suit. But when it became clear Tediore never intended to end his service, Rafa went AWOL. Now he's on the run and plans to enjoy whatever time he has left before his Tediore Deadframe ends him for good. Using the high-tech weaponry built into his Deadframe exo-suit, Rafa can blast enemies from afar using his APOPHIS Lance arm cannon, perforate the opposition at midrange using his shoulder-mounted Peacebreaker Cannons, or unleash eviscerating melee attacks up close with his twin Arc-Knives energy blades. Amon the Forgeknight Amon was raised in a Vault monster-worshipping cult—until the Vault was opened and the creature turned on everyone he loved. As the only survivor, he dedicates his life to finding and killing as many of these beasts as he can. Amon, a warrior-poet, is introspective and unflinching to his duty, but despite his hardened appearance, he has a warm attitude, often regaling comrades in arms with stories and advice earned throughout his travels. As a highly customizable tank, Amon can use his weaponized drones to adapt to any situation, including a wide range of Forgeskills that add an extra layer of utility to every Action skill. His Forge arsenal lets him attack or defend as needed, ready to pulverize enemies with a Forgehammer, slice them in twain with Forgeaxes, soak up damage with a Forgeshield, and much, much more. Harlowe the Gravitar Harlowe is a former Maliwan combat scientist, driven by the need to understand how things work. While this initially made her an outcast amongst her Traunt relatives, Harlowe has used her intellect to bring new tech and gadgetry to the battlefield as a Vault Hunter. Harlowe's brilliance is apparent in everything she does, but so is her enthusiasm and love for life. Harlowe brings everything to the fight, including her sunny disposition. Always ready to give a beat down, her spirit can't be beat. Using her collection of clever contraptions, Harlowe has a huge impact whether she's crowd-controlling enemies with Cryo and Radiation damage or enhancing her allies' survivability. Her CHROMA Accelerator unleashes an Unstable Energy Pocket of Cryo damage that chills anything in its wake, she can isolate priority targets by suspending them in a Stasis bubble created by her HALO Accelerator, and she can buff allies and freeze enemies using her area-of-effect Flux Generator. Reviews: TBD (Should be dropping this Wednesday.) Media Screenshots 📸:Trailers 🎥:"
}