{
  "url": "https://support.google.com/maps/answer/144349?hl=en&co=GENIE.Platform=Android",
  "title": "Get started with Google Maps - Android - Google Maps Help",
  "text": "This article will help you set up, learn the basics and explain various features of Google Maps. You can use the Google Maps app on your mobile device or Google Maps on your computer. Set your home or work addresses In your Google Account, you can find directions from your home or work quicker when you set your home and work addresses. You can also find the fastest route to shorten your commute. Learn how to set your work and home addresses. Tip: This info may be shared with other Google products and services. Get info about a place After you find a place on the map, you can: - Get directions to it. - Get info like business hours and menus. - Find Street View imagery. Get directions & start navigation Get travel times and directions to places you might go next, like your home, work, or calendar appointments. Understand Google Maps app features To help you access features faster, Google Maps app has been updated. When you open the Google Maps app, you can find these tabs at the bottom of the Home Screen: - Explore : Choose where to go. - You : Create lists, recall places, and find your saved trips, notifications, and messages. - Contribute : Share experiences, add info and reviews, and fix problems. Features like Location sharing, Timeline, and Offline maps are available in the top right, in the profile picture or initial . Access Google Maps features You can find detailed reviews and descriptions of the most popular establishments and hotspots in your selected area. You can search for popular locations, local events, trendy restaurants, or things to do in Google Maps. Saved trips In the “You” tab, you can find all of your frequent trips on the saved trips screen. You can get information about your estimated time of arrival (ETA) and the traffic reports and the accidents along the way. Learn how to pin & manage your saved trips. Saved places & lists In the “You” tab, you can find the following personalized content: - Recently saved places - Your lists - Saved trips - Timeline - My maps - Reservations Learn more about how to find your saved places & lists. Notifications & messages In the “You” tab, you can: - Find your Google Maps notifications. Learn how to turn notifications on or off. - Check your messages in Google Maps. Learn how to send messages directly to businesses. To add places, write reviews, upload photos, or suggest an edit, at the bottom, tap Contribute . You can also: - Submit corrections to roads and places. - Manage your Maps profile. - Find your contribution views and impact. To find any of these features, tap your profile picture or initial : - Sign in and out of your account. - Your data in Maps - Privacy Policy & Terms of Service - Turn on Incognito mode. - Your Business Profile - Timeline - Location Sharing: Choose who can find your location and whose location you can find on Google Maps. - Offline maps: Find and manage your offline maps. - Settings: Manage your Wi-Fi, distance units, notifications, and commute settings on Google Maps. - Help & feedback: Access Help and submit feedback like requesting corrections to roads and places from the same screen. Manage your privacy settings To access and manage the following privacy settings, tap your profile picture or initial : - Timeline: View and manage your Google Maps Timeline. - Location Sharing: Choose who can see your location and whose location you can see on Google Maps. - Your data in Maps: Manage your privacy controls."
}