{
  "url": "https://support.google.com/android/answer/9417604?hl=pt-BR",
  "title": "Encontrar e configurar dispositivos Bluetooth próximos ao seu aparelho Android - Ajuda do Android",
  "text": "Para conectar alguns dispositivos ao smartphone sem um cabo, use o Bluetooth. Depois que o pareamento é feito pela primeira vez, a conexão passa a ser automática. Quando o smartphone estiver conectado a algum dispositivo por Bluetooth, o ícone será mostrado na parte de cima da tela. Aprenda a conectar um dispositivo Bluetooth. Importante: - Algumas dessas etapas funcionam apenas no Android 15 e em versões mais recentes. Aprenda a conferir a versão do Android. - Algumas dessas etapas funcionam apenas em dispositivos com hardware compatível. Para mais informações, entre em contato com o fabricante. Ativar ou desativar o Bluetooth no app Configurações - Deslize de cima para baixo na tela. - Toque em Bluetooth . Dica: para economizar bateria, desative o Bluetooth quando ele não estiver em uso. O Bluetooth fica desativado no modo avião. Parear um acessório Bluetooth Importante: seus dispositivos ficam pareados até que você os despareie. Opção 1: usar o app Configurações (todos os acessórios Bluetooth) - Deslize de cima para baixo na tela. - Toque em Bluetooth e mantenha essa opção pressionada. - Toque em Parear novo dispositivo. - Se a opção Parear novo dispositivo não estiver disponível, confira em \"Dispositivos disponíveis\" ou toque em Mais Atualizar. - Toque no nome do dispositivo Bluetooth que você quer parear com o seu. - Siga as instruções exibidas na tela. Dica: se você não tiver uma senha, tente usar \"0000\" ou \"1234\" (as senhas mais comuns). - Verifique se: - Seu acessório Bluetooth funciona com o Pareamento rápido. Essa informação pode ser encontrada na caixa de cada acessório. Muitos também apresentam a mensagem \"Made by Google\" ou \"Made For Google\". Encontre acessórios na Google Store. - Seu dispositivo Android tem o Android 6.0 ou versões mais recentes. - O Bluetooth e a Localização do dispositivo Android estão ativados. - Ligue e coloque o acessório de Pareamento Rápido no modo de pareamento. - Ele precisa estar perto do dispositivo Android. - Quando você receber uma notificação, toque em Conectar. - Vai aparecer uma notificação \"Dispositivo conectado\" ou \"Pareamento concluído\". - Se for necessário configurar o acessório, toque em Configurar. Dicas: - Caso uma notificação não apareça, faça o seguinte: - No dispositivo Android, abra o app Configurações. - Toque em Dispositivos conectados Parear novo dispositivo. - Em \"Dispositivos disponíveis\", toque naquele que você quer parear. - Se o acessório de pareamento rápido não aparecer nas notificações, pareie o dispositivo Bluetooth manualmente. - Para saber mais, consulte Encontrar acessórios de pareamento rápido. Conectar um acessório que já está pareado - Confira se o Bluetooth está ativado. - Toque e segure na opção Bluetooth . - Em \"Dispositivos salvos\", selecione um dispositivo pareado desconectado. - Quando o celular e o dispositivo Bluetooth estiverem conectados, o acessório vai aparecer como \"Conectado\". Renomear, desconectar ou gerenciar um dispositivo Bluetooth - Deslize de cima para baixo na tela. - Toque e segure na opção Bluetooth . - Se o acessório estiver listado em \"Dispositivos portáteis de mídia\": ao lado do nome do aparelho, toque em Configurações . - Se não houver acessórios listados em \"Dispositivos salvos\": toque em Ver todos. Ao lado do nome do acessório, toque em Configurações . - Faça a mudança: - Para mudar o nome do acessório: na parte de cima, toque em Editar . - Para desconectar: toque em Desconectar . - Para remover completamente o dispositivo do celular: toque em Esquecer . - Em alguns dispositivos, é possível ativar ou desativar outras configurações. Dica: em um tablet compartilhado, cada pessoa pode mudar as configurações gerais do Bluetooth. Selecionar o tipo de dispositivo Bluetooth Seu aparelho Android categoriza automaticamente os dispositivos com Pareamento Rápido e os kits veiculares que são compatíveis com a projeção do Android Auto. Se o dispositivo Bluetooth não for categorizado de forma automática, selecione o tipo manualmente: - No dispositivo, abra o app Configurações. - Toque em Dispositivos conectados. - Em \"Dispositivos portáteis de mídia\", selecione as configurações de um dispositivo. - Selecione \"Tipo de dispositivo de áudio\": - Não definido - Alto-falante - Fones de ouvido - Carro - Aparelho auditivo - Outro Dica: definir o tipo de dispositivo correto ajuda a melhorar: - A experiência de áudio espacial em certos tipos de dispositivos de áudio. - Os recursos de medição de volume e saúde auditiva. Alterar o nome Bluetooth do smartphone ou tablet - Abra o app \"Configurações\" do dispositivo. - Toque em Dispositivos conectados Preferências de conexão Bluetooth. - Confira se o Bluetooth está ativado. - Toque em Nome do dispositivo. - Digite um novo nome. - Toque em Renomear. Sobre o Pareamento Rápido Importante: quando você se conecta com o Pareamento rápido, os acessórios Bluetooth são associados à sua Conta do Google. Seus outros dispositivos conectados podem reconhecer os acessórios recém-adicionados e solicitar que eles sejam pareados automaticamente. - Abra o app Configurações do dispositivo. - Toque no seu perfil Todos os serviços. - Em \"Dispositivos conectados e compartilhamento\", toque em Dispositivos. - Ative a opção Procurar dispositivos por perto. Dica: para salvar os dispositivos automaticamente, ative a opção Salvar dispositivos automaticamente. Ativar ou desativar as notificações Por padrão, você vai receber notificações de dispositivos próximos que podem ser configurados. Se elas forem desativadas, você ainda poderá encontrar esses dispositivos no app Configurações do smartphone. - No dispositivo, abra o app Configurações. - Toque no seu perfil Todos os serviços. - Em \"Dispositivos conectados e compartilhamento\", toque em Dispositivos. - Ative ou desative a opção Procurar dispositivos nas proximidades. - Se você não encontrar uma notificação, procure o dispositivo no app Configurações. - No dispositivo, abra o app Configurações. - Toque no seu perfil Todos os serviços. - Em \"Dispositivos conectados e compartilhamento\", toque em Dispositivos. - Fique perto do dispositivo. O smartphone precisa estar a menos de 0,5 m de distância de acessórios que funcionam com o Pareamento Rápido. - Confira se a localização e o Bluetooth do smartphone estão ativados. - Confira se o smartphone está conectado a uma rede Wi-Fi ou móvel. Dica: seu smartphone não consegue encontrar e configurar todos os dispositivos automaticamente. Se não houver um dispositivo no app Configurações, tente se conectar de outra forma, por exemplo, com o Bluetooth. Aprenda a ativar o Bluetooth. Os dados que o Pareamento Rápido coleta são criptografados em trânsito. Para encontrar e excluir tags e acessórios do Pareamento Rápido salvos na sua conta, siga estas etapas: - Para acessórios com Pareamento Rápido, como fones de ouvido: - No dispositivo, abra o app Configurações. - Toque no seu perfil Todos os serviços. - Em \"Dispositivos conectados e compartilhamento\", toque em Dispositivos. - Toque em Dispositivos salvos. - Rastreadores compatíveis com o Localizador: aprenda a remover um dispositivo do Localizador. Se você não quiser receber notificações do Pareamento Rápido, desative a verificação do recurso nas configurações. - No dispositivo, abra o app Configurações. - Toque no seu perfil Todos os serviços. - Em \"Dispositivos conectados e compartilhamento\", toque em Dispositivos. - Desative a opção Procurar dispositivos por perto. Dica: depois de parear os dispositivos na página de configurações do Bluetooth, você ainda vai receber uma notificação sobre a associação da sua conta. Se não quiser fazer a associação, ignore a notificação. Para parear dispositivos Bluetooth rapidamente, o Google coleta algumas informações dos equipamentos conectados à sua Conta do Google. Algumas dessas funcionalidades usam o Google Play Services. Por exemplo, o Pareamento Rápido coleta: - informações pessoais para fins funcionais, como o nome que você deu para um dispositivo Bluetooth durante a configuração; - dados de desempenho e informações de uso para fins de análise."
}