{
  "url": "https://www.ashevillebikecompany.com/product-list/bikes-1000/mountain-1006/",
  "title": "Mountain - Asheville Bicycle Company",
  "text": "Filter By: - Hardtail (118) - Full-Suspension (129) - 29-Inch Wheel (29ers) (156) - 650B Wheel (102) - Fat Bikes (9) - Rigid (11) - Dirt Jump (5) - Mountain Frames (25) - Show More Categories - 29-Inch Plus Wheel (5) - 27.5-Inch Plus Wheel (19) - 26-Inch Wheel (21) - Show Fewer Categories - Show More Brands - Show Fewer Brands - Show More Sizes - Show Fewer Sizes - Show More Model Years - Show Fewer Model Years Mountain $1,900.00 Nothing is off-limits to the Embolden, a trail bike designed to conquer tricky climbs, rowdy descents, and chunky rock gardens with confidence. Key Performance Factors Wheel Options Available in 27.5- and 29-inch wheel size options, select the Embolden that best fits you and where you want to ride. Trail Ready ALUXX-grade aluminum frame, tubeless wheelset, dropper seatpost, Liv Sylvia trail saddle and a 1x drivetrain allow you to tackle new technical terrain with confidence. Custom Tuned Suspension The 120mm of FlexPoint Suspension have been custom-tuned by women, for women to provide optimal performance for the rider and the bike’s intended use, resulting in improved traction and control. $2,300.00 Nothing is off-limits to the Embolden, a trail bike designed to conquer tricky climbs, rowdy descents, and chunky rock gardens with confidence. $3,800.00 - $4,300.00 BUILT TO COVER GROUND, MOW OVER TECHY SINGLETRACK, AND CHARGE DOWN AGGRESSIVE TERRAIN, THE INTRIGUE ADVANCED PRO 29 PREFERS THE ROWDY SIDE OF LIFE. KEY PERFORMANCE FACTORS Top Performance Trail Advanced-Grade Composite frame, carbon wheelset, Maestro Suspension and flip chip adjustable frame geometry equip you with a lightweight, versatile trail bike. Balanced Agility Obstacle-eating 29-inch wheels offer smooth handling and roll easily over small roots and rocks. Custom Tuned Suspension The 125 mm of Maestro Suspension has been custom tuned by women, for women to provide optimal performance for the rider and the bike's intended use, resulting in improved traction and control. $1,650.00 FEEL MORE CONNECTED TO THE TRAIL WITH THE ALL-NEW LURRA. BUILT FOR CHARGING UP SINGLETRACK CLIMBS AND DIVING INTO FAST, FLOWY DESCENTS, THIS HARDTAIL TRAIL BIKE IS SIMPLICITY AT ITS BEST. KEY PERFORMANCE FACTORS Optimal Trail Design Lightweight ALUXX SL-Grade Aluminum hardtail frame with a steep seat tube angle optimizes your input when powering up climbs and hammering on the flats, resulting in greater efficiency and speed. And a 66-degree head tube angle offers confidence on steep descents, while the 438mm chainstays keep it feeling stable and playful. Frame sizes are paired up with wheel sizes, providing the ideal fit for you and where you want to ride. Boosted Confidence Take on technical terrain with the 130mm of plush front suspension, high-volume tubeless tires offering extreme traction on roots, rocks and ruts, and a dropper seatpost allowing you to get low and ride with control. Adventure-Ready The Lurra comes equipped with mounts for two water bottle cages and additional mounts on the underside of the top tube allow riders to add a small gear bag for stowing tools. Internal cable routing keeps the important stuff tidy and protected, so you can stay focused on the ride ahead. TECHS & FEATURES: ALUXX ALUMINUM TECHNOLOGY - This Performance level frame material features 6061 alloy with single-butted tubes to produce strong, lightweight framesets for a variety of different bikes and riding styles. FLEXPOINT SUSPENSION TECHNOLOGY - A proven \"single-pivot\" design that uses the flexing action of the chainstay/seatstay junction to produce a lightweight and durable suspension system with 4.7 inches/120mm of rear travel. OVERDRIVE - Designed to provide precise front-end steering performance, this fork steerer tube technology uses oversized headset bearings (1 1/4\" lower and 1 1/8\" upper for road, 1 1/2\" lower and 1 1/8\" upper for mountain) and tapered steerer tube work in conjunction to provide optimal steering stiffness. POWERCORE - A massively oversized bottom-bracket/chainstay area features a fully integrated, 86-millimeter wide bottom-bracket design (92-millimeter wide for off-road bikes). Asymmetric chainstays provide additional stiffness on the driveside and stability on the non-driveside. TUBELESS SYSTEM - Fewer flat tires. Greater traction. Less rolling resistance and a smoother, faster ride. Giant's Tubeless System makes it easier than ever to experience all these benefits. Wheel size: - Sizes X-Small – Small: 27.5-inch - Sizes Small – Large: 29-inch $650.00 Get on the dirt and ride your way to your first singletrack. Tempt is that friend that opens a whole new world to you. Key Performance Factors Confidence Inspiring Perfect as your first mountain bike, the ALUXX-Grade Aluminum frame is lightweight, capable and durable. Versatile Tempt’s performance-minded yet comfortable geometry gives it the versatility for both commutes around campus and off-road rides. XC Control A suspension fork offers control, comfort and stability over bumpy terrain. Depending on frame size, the fork comes with 80mm or 100mm of travel. Wheel Sizing: Sizes X-Small – Small: 27.5-inch Sizes Small – X-Large: 29-inch $1,299.00 Often imitated, but never duplicated, the Honzo is a part of Kona’s foundation. The Honzo is the solution for the rider wanting something a bit more aggressive than a traditional cross-country hardtail. A 130mm fork provides just enough suspension to make quick work of technical sections of trail. Whether you’re a seasoned rider looking for timeless hardtail or a newer rider looking to go a bit deeper into the mountain bike world, the Honzo is an excellent choice. $2,299.00 If Mad Max rode a bike, it would be the Honzo ESD. It’s part Honzo, part monster, and with geometry that inspired the Process X, it’s made for those who want to punish the trails. A steel frame holds a Marzocchi Bomber Z1 fork with 150mm of travel. It’s got strong 4-piston brakes, grippy Maxxis rubber, and a headtube badge that will scare your children at night. This is the Warrior of the Wasteland. $950.00 With its flat handlebar, comfortable upright positioning and smooth, powerful disc brakes, Roam combines the best qualities of a road bike and a mountain bike. Now you can follow your own route wherever it goes. Key Performance Factors: Agility and control - Updated flat-bar frame geometry puts the rider in a position that balances efficiency with stability, and disc brakes give you added control on rugged roads or dirt. Smooth-riding comfort - The D-Fuse seatpost and suspension fork absorb road shocks and vibrations, and EasyRide Tubeless tires let you run lower pressure for a smoother ride quality and a reduced risk of flats. Integrated rack mounts - Compatible with rear racks, allowing easy cargo capacity for daily trips or longer treks. Techs & Features ALUXX Aluminum Technology This Performance level frame material features 6061 alloy with single-butted tubes to produce strong, lightweight framesets for a variety of different bikes and riding styles. D-Fuse Seatpost The proprietary “D” shaped composite seatpost damps vibration, resulting in a smooth, compliant ride. $950.00 - $1,000.00 Push the pace on climbs, let loose on descents. This aluminum hardtail with a plush suspension fork delivers balanced, confident handling on the trail. Key Performance Factors: Proven alloy performance ALUXX aluminum frameset is hand-built in-house by the world leader in aluminum engineering. Balance and stability Frame geometry is designed to optimize the balance and roll-over capabilities of 29-inch wheels or the liveliness of 27.5-inch wheels (depending on frame size). XC control Suspension fork offers either 80mm or 100mm of smooth travel for added XC control. Highlights: Built on a lightweight ALUXX aluminum frame that features classic hardtail design and the balanced riding characteristics of either larger diameter 29-inch or 27.5-inch wheels, Talon is a great choice for XC and trail riding. The frame geometry is specifically designed to adapt to its respective wheel size and either an 80mm or 100mm suspension fork (depending on frame size). It’s a confident ride that’s perfect for ambitious riders who want to take their off-road skills to the next level. Wheel Sizing: Sizes X-Small – Small: 27.5-inch Sizes Small – X-Large: 29-inch $585.00 - $650.00 Push the pace on climbs, let loose on descents. This aluminum hardtail with a plush suspension fork delivers balanced, confident handling on the trail. Key Performance Factors: Proven alloy performance ALUXX aluminum frameset is hand-built in-house by the world leader in aluminum engineering. Balance and stability Frame geometry is designed to optimize the balance and roll-over capabilities of 29-inch wheels or the liveliness of 27.5-inch wheels (depending on frame size). XC control Suspension fork offers either 80mm or 100mm of smooth travel for added XC control. Highlights: Built on a lightweight ALUXX aluminum frame that features classic hardtail design and the balanced riding characteristics of either larger diameter 29-inch or 27.5-inch wheels, Talon is a great choice for XC and trail riding. The frame geometry is specifically designed to adapt to its respective wheel size and either an 80mm or 100mm suspension fork (depending on frame size). It’s a confident ride that’s perfect for ambitious riders who want to take their off-road skills to the next level. Wheel Sizing: Sizes X-Small – Small: 27.5-inch Sizes Small – X-Large: 29-inch $630.00 PUSH THE PACE ON CLIMBS, LET LOOSE ON THE DESCENTS. THIS ALUMINUM HARDTAIL GIVES YOU A FEEL FOR THE TRAIL WITH BALANCED, CONFIDENT HANDLING AND A PLUSH SUSPENSION FORK. KEY PERFORMANCE FACTORS: Proven alloy performance ALUXX aluminum frameset is hand-built in-house by the world leader in aluminum engineering. Balance and stability Frame geometry is designed to optimize the balance and roll-over capabilities of 29-inch wheels or the liveliness of 27.5-inch wheels (depending on frame size). XC control Suspension fork offers either 80mm or 100mm of smooth travel for added XC control. - Small and Medium Frames: 27.5-inch -OR- 29-inch wheels - Large and X-Large Frames: 29-inch wheels $5,000.00 - $7,000.00 Shred hard and shred fast with this lively 29er. It's built on an all-new full-composite frame with adjustable geometry, giving you smooth control to blitz technical trails at speed. This versatile trail bike features a full composite frame that's fitted with a new Maestro suspension system that has 5mm more travel than the previous generation. The Advanced Forged Composite rocker arm has a flip chip that allows you to adjust frame geometry. Choose steeper or slacker headtube/seattube angles and either a 35mm or 45mm bottom bracket drop to adjust the handling for your riding style and terrain. $3,040.00 - $3,700.00 Float through rock gardens, hit the jumps, and find the faster line. With quick-handling 27.5 wheels and adjustable frame geometry, this lively trail bike is a party on wheels. Built for those who favor the responsive, agile handling of 27.5 wheels, this trail ripper features flip chip that lets you adjust the frame geometry for riding style and terrain. You can choose a steeper or slacker headtube angle and either a 20mm or 30mm bottom bracket drop. The ALUXX SL aluminum frame is fitted with updated Maestro rear suspension featuring 145mm of smooth, active rear travel. A trunnion-mount shock and Advanced Forged Composite rocker arm help soak up bumps, giving you traction and control to float through rocks, roots and ruts. Confidence is further bolstered by a 160mm travel suspension fork up front. $1,900.00 - $2,000.00 Float through rock gardens, hit the jumps, and find the faster line. With quick-handling 27.5 wheels and adjustable frame geometry, this lively trail bike is a party on wheels. Built for those who favor the responsive, agile handling of 27.5 wheels, this trail ripper features flip chip that lets you adjust the frame geometry for riding style and terrain. You can choose a steeper or slacker headtube angle and either a 20mm or 30mm bottom bracket drop. The ALUXX SL aluminum frame is fitted with updated Maestro rear suspension featuring 145mm of smooth, active rear travel. A trunnion-mount shock and Advanced Forged Composite rocker arm help soak up bumps, giving you traction and control to float through rocks, roots and ruts. Confidence is further bolstered by a 160mm travel suspension fork up front. $7,000.00 Float up technical climbs and sail down chunky descents. This all-new, full-composite trail bike gives you 140mm of smooth Maestro rear suspension and all sorts of adjustability. You can dial in frame geometry and switch the rear wheel size for the terrain. More Travel New Maestro rear suspension adds 5mm of travel over previous generation, going from 135mm to 140mm. A trunnion mount shock and Advanced Forged Composite rocker arm combine for a longer stroke with a smooth, active feel. Rear suspension is paired with a 150mm travel fork for superior confidence and control on technical singletrack terrain. Adjustable trail geometry A three-position Maestro flip chip lets you dial in frame geometry for your riding style and terrain. The high setting adds more ground clearance, a good option for tight, technical terrain. The low setting creates a slacker head angle and lower bottom bracket for confident handling at higher speeds. The middle position is neutral. In addition, a new headset flip chip provides 10mm of reach adjustment. Rear wheel options All models come with 29-inch front and rear wheels, but the flip chip lets you opt for a mixed wheel setup including a 27.5 rear. The stock setup optimizes stability and roll-over speed, while a 27.5 rear wheel delivers a snappier feel and more saddle-to-tire clearance. Some riders favor this “mullet” setup for riding steep, technical terrain. $5,700.00 Rock rolls, sketchy drops, and step-ups. This new full-composite trail machine handles it all with confidence and control. New longer travel Maestro rear suspension (145mm), adjustable geometry, and a mixed wheel setup make it a singletrack sensation. Updated suspension This “SX” series features an all-new Maestro rear suspension system with added travel (145mm) for technical singletrack. The trunnion mount shock and Advanced Forged Composite rocker arm combine for a longer stroke that has a smooth, active feel, plus greater stiffness in the chassis for improved tracking over rough terrain. The rear suspension is paired with a longer travel 160mm suspension fork, giving aggressive trail riders added confidence and control. Adjustable trail geometry A three-position Maestro flip chip lets you dial in frame geometry to suit your riding style and terrain. The high setting adds more ground clearance, a good option for tight, technical singletrack. The low setting creates a slacker head angle and lower bottom bracket for confident handling at higher speeds. The middle position is neutral. In addition, a new headset flip chip provides 10mm of total reach adjustment. Mixed wheel setup This model comes with a 27.5-inch rear wheel. The smaller wheel diameter delivers an agile, snappy feel on the trail and more saddle-to-tire clearance in the rear. Riders typically favor this “mullet” setup for riding steep, technical terrain. $1,599.00 As a highly versatile touring bike, the Bridge Club hits the sweet spot that separates on- and off-road excursions. The simplistic design makes it fully adept to handle a full rack and pannier setup, frame bags, or any combination of the two. It doesn’t feel sluggish on paved shortcuts, but can also hold its own on dirt detours. If you’re feeling a little zesty on your next road tour, you won’t be ill-prepared for reroutes through the woods. The Bridge Club is designed to handle it all. - 100% Surly Chromoly frame, main triangle is double-butted; 1-1/8\" threadless Chromoly fork - Rack, fender, and four sets of three-pack mounts - Disc brake-specific, single-position vertical rear dropout makes it less intimidating than other bikes in the category - Clearance for 700 x 47mm (with or without fenders) or 27.5 x 2.8\" tires (27.5 x 2.6\" with fenders) $1,899.00 The Grappler is Surly's dedicated drop-bar trail bike. With mountain geo designed around a comfortable, confident drop-bar hand position, it's lively and responsive on single-track, double-track, and other degraded surfaces. Ready to haul essential gear for all-day dirt rides and quick bikepacking excursions, captured thru-axles front and rear provide ideal stiffness and handling. Built around 27.5\" wheels and compatible with internally geared hubs and single-speed setups, Surly's tried-and-true Gnot-Boost spacing allows riders to run 142mm or 148mm rear hubs. - 100% Surly Chromoly steel frame and fork, featuring Surly's proprietary 'Natch tubing, double-butted main triangle, 1-1/8\" headtube, non-suspension corrected. - Horizontal-slotted dropout, Surly Gnot-Boost spacing. - Seat stay-mounted bottle bosses on all sizes except XS, plus three-pack mounts at the top and bottom of the down tube and stealth dropper post routing. - E.D. coated frame for increased life expectancy. - 27.5 x 2.8\" tire clearance (with or without fenders). $2,349.00 The Largest Tire Clearance on a Fat Bike Frame From log and root covered ribbons of twisty singletrack to miles of powdery snow or sandy beaches, Ice Cream Truck can handle it all. You could probably even hop over a grizzly if the situation arises. Probably. While we could certainly throw out terms like “confidence-inspiring” and “traction-laden” to describe Ice Cream Truck, those phrases are mostly bull, so we’re not going to do that. We’re not here to inspire you, and we didn’t laden it with anything. What we did do was design a monolith of a trail bike that doesn’t give two shits about what’s in front of it. Ice Cream Truck solves the problem of having to choose between a fat bike and a trail bike. It boasts a symmetric 190mm-spaced Chromoly frame, suspension-corrected 150mm-spaced fork, and sporty trail-oriented geometry. Supported by massive 4.8\" tires, itis ready to deftly tackle nearly any terrain. - Long toptube, short seatstays, and a 68-degree headtube angle makes it tight and maneuverable on fast, technical terrain - Modern trail bike standards like stealth dropper post routing, 44mm headtube, and thru-axles - Clearance for a full 26” x 5” tire on 100mm rims - 100% Surly Chromoly steel with 44mm headtube and internal dropper post cable routing - Frame is E.D. Coated for increased life expectancy - 1-1/8\" straight steerer fork, Chromoly steel - 100mm threaded bottom bracket shell - Front and rear thru-axles, non-off-set - Universal cast dropouts accommodate thru-axle or quick-release standards $2,249.00 Ice Cream Truck solves the problem of having to choose between a fat bike and a trail bike. It boasts a symmetric 190mm-spaced Chromoly frame, suspension-corrected 150mm-spaced fork, and sporty trail-oriented geometry. Supported by massive 4.8\"\" tires, it’s ready to deftly tackle nearly any terrain. - 100% Surly Chromoly steel with 44mm headtube and internal dropper post cable routing - Frame is E.D. Coated for increased life expectancy - 1-1/8\" straight steerer fork, Chromoly steel - 100mm threaded bottom bracket shell - Front and rear thru-axles, non-off-set - Universal cast dropouts accommodate thru-axle or quick-release standards $899.00 Ice Cream Truck solves the problem of having to choose between a fat bike and a trail bike. It boasts a symmetric 190mm-spaced Chromoly frame, suspension-corrected 150mm-spaced fork, and sporty trail-oriented geometry. Supported by massive 4.8\" tires, itis ready to deftly tackle nearly any terrain. - 100% Surly Chromoly steel with 44mm headtube and internal dropper post cable routing - Frame is E.D. Coated for increased life expectancy - 1-1/8\" straight steerer fork, Chromoly steel - 100mm threaded bottom bracket shell - Front and rear thru-axles, non-off-set - Universal cast dropouts accommodate thru-axle or quick-release standards $1,849.00 The Karate Monkey features updated, progressive trail geometry, our custom trumpet tubeset, and Surly's Gnot-Boost rear dropout system. Available in a variety of colors, with multiple drivetrain and wheel size configurations. - 100% Surly Chromoly steel frame and fork; double-butted main triangle and 44mm headtube - The tubeset uses the same trumpet tubes found on Instigator 2.0 frame - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142, 148 12mm thru, as well as 135mm w/ 10/12 washer - Internal dropper seatpost routing with 30.9mm seat tube ID - Clearance for 29 x 2.55\" or 27.5 x 3\" tires $1,849.00 The Karate Monkey features updated, progressive trail geometry, our custom trumpet tubeset, and Surly's Gnot-Boost rear dropout system. Available in a variety of colors, with multiple drivetrain and wheel size configurations. - 100% Surly Chromoly steel frame and fork; double-butted main triangle and 44mm headtube - The tubeset uses the same trumpet tubes found on Instigator 2.0 frame - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142, 148 12mm thru, as well as 135mm w/ 10/12 washer - Internal dropper seatpost routing with 30.9mm seat tube ID - Clearance for 29 x 2.55\" or 27.5 x 3\" tires $999.00 The Karate Monkey frame features updated, progressive trail geometry, a new tubeset, and Surly’s Gnot-Boost rear dropout system to support multiple drivetrain and wheel size configurations. - 100% Surly 4130 chromoly steel frame and fork; double-butted main triangle and 44mm headtube - Tubeset uses the same trumpet tubes found on Instigator 2.0 frame - Adjustable rear dropouts with 145mm Gnot-Boost spacing works with 142 x 12, 148 x 12mm, and 135mm w/ 10/12 washer - Internal dropper seatpost routing - 30.9mm seat tube ID - Clearance for 29 x 2.55 or 27.5 x 3 tires $1,099.00 The Karate Monkey features updated, progressive trail geometry, our custom trumpet tubeset, and Surly's Gnot-Boost rear dropout system. Available in a variety of colors, with multiple drivetrain and wheel size configurations. $999.00 The Karate Monkey features updated, progressive trail geometry, our custom trumpet tubeset and Surly’s Gnot-Boost rear dropout system. Available in a variety of colors, with multiple drivetrain and wheel size configurations. - 100% Surly Chromoly steel frame and fork; double-butted main triangle and 44mm headtube - The tubeset uses the same trumpet tubes found on Instigator 2.0 frame - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142, 148 12mm thru, as well as 135mm w/ 10/12 washer - Internal dropper seatpost routing with 30.9mm seat tube ID - Clearance for 29 x 2.55 or 27.5 x 3 tires $999.00 Karate Monkey is a highly versatile trail bike that plays the part of 29er and 27.5+ equally well. Karate Monkey delivers a resilient, lively ride on all sorts of gnarly terrain. Its frame is a highly-versatile canvas for whatever dirty masterpiece your brain cooks up. According to our computing machine (Thor) it can be set up in approximately 487 different configurations. Originally designed as a 29er (and the frame that helped spark the 29\" wheel movement), the latest Karate Monkey is designed to perform just as admirably as a 27.5+ rig as well. This allows you to pick your poison — provided your poison is having a really great time while permanently donning a huge grin, of course. - Modern trail standards: dropper post compatibility, 44mm headtube, Gnot-Boost rear spacing, thru-axles, suspension corrected fork - Compatibility with most mountain bike standards makes it the perfect parts bin bike (no rim brakes allowed though) - Clearance for 29\" x 2.5\" or 27.5\" x 3\" tires $2,599.00 The Karate Monkey Front Suspension bike features a Rock Shox 35 Gold RL A2 suspension fork with 140mm travel, and it’s paired with a dropper post out the box. Progressive trail geometry and Surly’s Gnot-Boost rear dropout system deliver a versatile bike with the ability to swap hubs and wheel sizes. If you want to round-house kick some trail right in the face, the Karate Monkey is your sled. - 100% Surly Chromoly steel frame, double-butted main triangle and 44mm headtube - The tubeset uses Surly custom trumpet tubes for greater stiffness and durability - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142 and 148 x 12mm thru, as well as 135mm w/ 10/12 washer - RockShox 35 Gold RL A2 suspension fork with 140mm travel - TranzX YSP15 dropper post with stealth routing; 100mm travel on XS, 120mm travel on SM–XL $1,849.00 The Karate Monkey features updated, progressive trail geometry, our custom trumpet tubeset and Surly’s Gnot-Boost rear dropout system. Available in a variety of colors, with multiple drivetrain and wheel size configurations. - 100% Surly Chromoly steel frame and fork; double-butted main triangle and 44mm headtube - The tubeset uses the same trumpet tubes found on Instigator 2.0 frame - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142, 148 12mm thru, as well as 135mm w/ 10/12 washer - Internal dropper seatpost routing with 30.9mm seat tube ID - Clearance for 29 x 2.55 or 27.5 x 3 tires $2,599.00 The Karate Monkey Front Suspension bike features a Rock Shox 35 Gold RL A2 suspension fork with 140mm travel, and it's paired with a dropper post out of the box. Progressive trail geometry and Surly's Gnot-Boost rear dropout system deliver a versatile bike with the ability to swap hubs and wheel sizes. If you want to round-house kick some trail right in the face, the Karate Monkey is your sled. - 100% Surly Chromoly steel frame, double-butted main triangle and 44mm headtube - The tubeset uses Surly custom trumpet tubes for greater stiffness and durability - Adjustable rear dropouts with 145mm Gnot-Boost spacing. Works with 142 and 148 x 12mm thru, as well as 135mm w/ 10/12 washer - Rock Shox 35 Gold RL A2 suspension fork with 140mm travel - TranzX SP15 dropper post with stealth routing: 100mm travel on XS/SM; 120mm travel on MD/LG/XL - Clearance for 27.5 x 3\" or 29 x 2.55\" tires Page 1 of 10 Next page"
}