{
  "url": "https://www.cocktailwave.com/recipes/bellini",
  "title": "Bellini Cocktail Recipe | How to Make the perfect Bellini",
  "text": "Bellini Cocktail Recipe CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App StoreBellini Nutrition Facts Calories:163 Fat:0g Protein:0.5g Carbohydrates:12g Alcohol:7% Created by Nic Polotnianko I fell in love with the art of mixology 6 years ago. Since then, I've honed my skills, crafting a myriad of cocktail recipes, and sharing my passion with other enthusiasts. Last Updated: August 23, 2024 Contents History The Bellini cocktail was created in the 1940s by Giuseppe Cipriani, the founder of the famous Harry's Bar in Venice, Italy. It was named after the Italian Renaissance painter Giovanni Bellini, as the drink's pink hue reminded Cipriani of the colors in Bellini's paintings. The cocktail quickly gained popularity and became a favorite among celebrities and tourists visiting Venice. - Harry's Bar opened in 1931 and is still in operation today - The Bellini is traditionally served in a champagne flute - The cocktail is especially popular during brunch and summer events CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App StoreHow Bellini Tastes? The Bellini is a light, refreshing, and slightly sweet cocktail with a hint of tartness from the peach puree. The bubbles from the Prosecco add a pleasant effervescence, making it a perfect drink for warm weather and celebrations. Interesting facts about Bellini - The original Bellini recipe used white peaches, which are sweeter and more delicate than yellow peaches - The Bellini is often considered a 'breakfast cocktail' due to its light and fruity nature - In 2011, a world record was set for the largest Bellini ever made, containing 1,000 liters of Prosecco and 333 liters of peach puree Ingredients - Peach puree: 2 oz(60ml) - Prosecco: 4 oz(120ml) - Optional garnish: Peach slice Peach Puree Made from the sweet, juicy flesh of peaches, the puree is a star in this cocktail. It gives the Bellini its signature fruity flavor and delightful color. Without it, you’d miss the heart of the drink - it's like having a car without an engine. If you use too little, the Prosecco overpowers the delicate peach; too much and it’s a peaches-only show. Mary Mitkina Prosecco This Italian sparkling wine brings the party to your glass with its effervescence and dryness, creating a refreshing counterbalance to the sweet peach puree. Skimp on the Prosecco and you'll have a syrupy drink; too much and you'll drown the fruit in a sea of bubbles. The 2:1 ratio remains the gold standard for harmony in flavor. Alex Green Optional Garnish: Peach Slice A fresh peach slice is the crowning jewel, adding an aesthetic touch while hinting at the drink's main flavor. It's like the cherry on top - nice but not necessary. Yet, it invites the eye and the palate to anticipate the lush peachiness awaiting in the flute. Emma Rose Recipe. How to make Bellini Drink - Chill the ingredients: Ensure both the peach puree and Prosecco are well-chilled before making the cocktail - Prepare the peach puree: If using fresh peaches, peel and pit them, then blend until smooth. Alternatively, use store-bought peach puree - Assemble the cocktail: In a champagne flute, pour 2 oz of peach puree - Top with Prosecco: Slowly pour 4 oz of Prosecco into the flute, allowing the ingredients to mix gently - Garnish: Optionally, garnish the cocktail with a fresh peach slice CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App StorePro Tips - Use Fresh Peaches: For the best flavor, use fresh, ripe peaches when they are in season - Chill Your Glass: A chilled glass will keep your cocktail cooler for longer - Slow Pour: Pour the Prosecco slowly to avoid it mixing too quickly with the peach puree and losing its bubbles CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App StorePerfect Pairings Appetizers - Bruschettas: The fresh, crisp notes of the Bellini complement the tomato, basil, and garlic flavors. - Prosciutto Wraps: A salty contrast to the sweet peach, pairs delightfully with the bubbly texture. - Fruit Platters: Enhances the fruitiness in the cocktail with a mix of berries and melon. Meals - Seafood Pasta: Light sauces and fresh seafood harmonize without overpowering the Bellini. - Grilled Chicken Salad: The brightness of the vinaigrette and the fresh greens echo the lightness of the drink. Desserts - Cheesecake: A creamy dessert to counter the fizz and the fruit in the cocktail. - Panna Cotta: Again, creamy textures work well, especially with a berry coulis that plays on the fruit theme. CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App Store🍹 Get the Full CocktailWave Experience! 🍹 Scan any cocktail with AI, get instant recipes, build your personal collection, and discover new drinks! AI Camera Scan Recipe Collection Instant Recognition What you could change in Bellini - Peach Schnapps: If you can't find peach puree, peach schnapps can be used as a substitute - Champagne: If Prosecco is not available, a dry champagne can be used instead Explore all drinks starting with B here And of course - twists🍹 Raspberry Bellini - Ingredients: Replace peach puree with raspberry puree - Recipe: Follow the standard Bellini recipe, substituting with raspberry puree - Flavor Change: Expect a tarter, more robust berry profile, a vivid pink hue, and a playful twist on the classic Bellini Royale - Ingredients: Add a splash of Chambord or raspberry liqueur on top - Recipe: Construct the Bellini as usual and add Chambord - Flavor Change: Enhances sweetness and adds depth with the raspberry undertones of the liqueur Tropical Bellini - Ingredients: Mix mango puree with a hint of coconut cream - Recipe: Use the mango-coconut mix instead of peach puree - Flavor Change: You'll sail away to a tropical island with this exotic and irresistible flavor combo, turning the traditional into a vacation in a glass CocktailWave Mobile App Scan cocktails with AI, get instant recipes, and build your collection! Download on App StoreIn case you forgot basics how to make Bellini Garnishing a bar drink depends on the type of garnish and the cocktail. Generally, it involves preparing the garnish (like cutting a citrus wheel or picking a sprig of mint), and then adding it to the drink in a visually appealing way (like perching it on the rim or floating it on top). Learn everything on garnishingFind the cocktail you'd love! If you want to drink something else - you can use our AI-augmented search to find the best cocktail for you! Completely free! Frequently Asked Questions on Bellini Can I use any kind of peach for the Bellini? Yes, but the flavor might differ. The original Bellini recipe uses white peaches for their sweet and delicate flavor. However, yellow peaches can be used if white ones are not available. Is there a non-alcoholic version of the Bellini cocktail? Yes, you can substitute the Prosecco with soda water or ginger ale for a non-alcoholic version. Why is it called a Bellini? The cocktail was named after the 15th-century Italian painter Giovanni Bellini because its pink color reminded its creator of the colors in Bellini's paintings. Can I serve the Bellini over ice? It's not traditional to serve a Bellini over ice as it can dilute the flavors. It's typically served in a chilled champagne flute to keep it cool. What other cocktails can I make with Prosecco? Prosecco can be used in many cocktails including Mimosas, Spritz Veneziano, Negroni Sbagliato, and Rossini. It's a versatile sparkling wine that pairs well with a lot of flavors. More similar recipes to Bellini! Explore new cocktails you'd love! Bellini The Bellini is a light, refreshing, and slightly sweet cocktail with a hint of tartness from the peach puree. The bubbles from the Prosecco add a pleasant effervescence, making it a perfect drink for warm weather and celebrations. Makgeolli Mimosa The Makgeolli Mimosa has a slightly sweet, tangy, and fruity taste with a hint of creaminess from the Makgeolli. The orange juice adds a bright citrus flavor, while the Makgeolli provides a subtle earthiness and unique depth. Cranberry Mimosa A Cranberry Mimosa is a delightful balance of sweet and tart. The effervescence of the sparkling wine adds a light and airy quality, while the cranberry juice provides a sharp contrast that is both refreshing and slightly tangy. Cucumber Martini The Cucumber Martini is crisp, clean, and refreshing with a subtle hint of botanicals. It has a light, slightly sweet taste with a smooth, velvety texture. The cucumber adds a cool, fresh flavor that balances the sharpness of the gin and the tanginess of the lemon. Swimming Pool The Swimming Pool cocktail has a sweet, fruity, and slightly creamy taste. It is not too strong, making it a perfect choice for those who prefer lighter cocktails. The combination of pineapple, coconut, and citrus flavors creates a refreshing and tropical experience. Blushing Bride The Blushing Bride cocktail is a delightful balance of sweet and sour. The raspberry mix adds a fruity sweetness, which is perfectly balanced by the tartness of the sweet & sour mix. The vodka gives it a bit of a kick, while the champagne or prosecco adds a bubbly, festive touch. Margarita The Margarita is a well-balanced cocktail with a bright, citrusy flavor. It is both sweet and sour, with the tanginess of lime juice complementing the sweetness of the orange liqueur. The tequila adds a strong, earthy backbone, while the salt rim enhances the overall taste and adds a savory touch. Daiquiri The Daiquiri is a refreshing, tangy, and slightly sweet cocktail with a hint of citrus. It has a light and crisp taste, making it perfect for warm weather or as an aperitif. Pina Colada The Piña Colada is a sweet, creamy, and fruity cocktail with a smooth texture. The flavors of pineapple and coconut blend harmoniously, creating a tropical taste sensation. The rum adds a subtle warmth and depth to the drink. Peach Bellini The Peach Bellini has a refreshing, fruity, and slightly sweet taste. The combination of peach puree and Prosecco creates a light, bubbly, and smooth texture. Barracuda The Barracuda cocktail is a delightful mix of sweet, sour, and slightly bitter flavors. The sweetness of the pineapple juice and the tanginess of the lime juice create a refreshing, fruity base, while the rum adds a warm, rich depth. The Galliano liqueur provides a subtle hint of herbal bitterness, balancing out the overall taste and making it a well-rounded, satisfying drink. Spritz Veneziano Spritz Veneziano has a unique bittersweet taste, with a hint of citrus and herbal notes. It is light, refreshing, and effervescent. Bramble The Bramble cocktail is a delightful mix of sweet, sour, and fruity flavors. The gin provides a strong, herbal base, while the lemon juice adds a refreshing tartness. The blackberry liqueur and simple syrup bring a sweet, fruity balance to the drink. Harvey Wallbanger The Harvey Wallbanger has a sweet and fruity taste, with a hint of herbal bitterness from the Galliano. The orange juice adds a refreshing citrus flavor, while the vodka provides a smooth and subtle kick. Painkiller The Painkiller cocktail is a delightful mix of sweet, tangy, and slightly spicy flavors. The combination of pineapple and orange juices creates a fruity base, while the coconut cream adds a rich, creamy sweetness. The dark rum provides a strong, warming backbone, and the freshly grated nutmeg on top adds a subtle hint of spice. Mojito The Mojito is a refreshing, sweet, and slightly sour cocktail with a hint of mint and a subtle rum kick. It is a well-balanced drink that is both invigorating and easy to sip. Mint Julep The Mint Julep has a refreshing, sweet, and slightly minty taste. It is a well-balanced cocktail with a strong bourbon backbone and a cooling, herbal finish. Moscow Mule The Moscow Mule is a refreshing, slightly spicy, and tangy cocktail with a hint of sweetness. The combination of vodka, ginger beer, and lime juice creates a well-balanced and invigorating flavor profile. Bloody Mary The Bloody Mary is a savory, spicy, and tangy cocktail with a strong tomato flavor. The vodka adds a subtle kick, while the Worcestershire and hot sauce provide a complex depth of flavor. The lemon juice adds a touch of acidity, and the celery salt and black pepper give it a slight earthiness. Ramos Gin Fizz The Ramos Gin Fizz has a creamy, frothy texture with a balanced taste of sweet, sour, and floral notes. The gin provides a subtle juniper flavor, while the citrus and egg white create a smooth, velvety mouthfeel. Milk Punch Milk Punch has a creamy, sweet, and slightly spicy taste. The combination of milk, sugar, and spices creates a smooth and velvety texture, while the addition of alcohol gives it a warming sensation."
}