{
  "url": "https://measuremeter.com.co/producto/balanza-trumax-fenix-pro-precision-certificada",
  "title": "Balanza Trumax Fenix Pro Precisión Certificada para tu Negocio - Measure Meter",
  "text": "Balanza Fenix Pro Balanza de solo peso Trumax. Fabricada en ABS de alta resistencia con plato de acero inoxidable de 29x23cm. Incluye display LCD y batería recargable. Capacidades: 3/6kg x 1/2g, 6/15kg x 2/5g, 15/30kg x 5/10g. Con certificación OIML y homologada para metrología legal en Colombia (resolución 77506 de la Superintendencia de Industria y Comercio). Descubre la balanza de solo peso Trumax Fenix Pro, diseñada para ofrecer precisión y durabilidad en tus pesajes. Ideal para comercios, laboratorios y aplicaciones industriales, esta balanza está equipada con características avanzadas que garantizan un rendimiento excepcional. Características Principales: - Construcción Robusta: Fabricada en ABS de alta resistencia, la Trumax Fenix Pro está diseñada para soportar el uso intensivo diario, ofreciendo una larga vida útil. - Plato de Acero Inoxidable: Su plato de 29x23cm en acero inoxidable no solo es fácil de limpiar, sino que también resiste la corrosión y proporciona una superficie de pesaje higiénica. - Display LCD: La pantalla LCD de fácil lectura permite visualizar los resultados de manera clara y precisa, incluso en entornos con poca luz. - Batería Recargable: Con una batería recargable de larga duración, esta balanza asegura un funcionamiento continuo sin interrupciones, ideal para lugares con acceso limitado a enchufes eléctricos. Capacidades Disponibles: - 3/6kg x 1/2g - 6/15kg x 2/5g - 15/30kg x 5/10g Certificaciones y Homologaciones: - Certificación OIML: Garantiza la precisión y fiabilidad del producto, cumpliendo con los estándares internacionales. - Homologada para Metrología Legal en Colombia: Cumple con la resolución 77506 de la Superintendencia de Industria y Comercio, asegurando que tu balanza está legalmente aprobada para su uso comercial. Beneficios Adicionales: - Fácil de Usar: Su interfaz intuitiva y controles simples hacen que la Trumax Fenix Pro sea accesible para todos los usuarios, sin necesidad de entrenamiento especializado. - Portabilidad: Ligera y fácil de transportar, esta balanza es perfecta para negocios que requieren movilidad. - Servicio y Soporte: Contamos con un equipo de soporte dedicado para ayudarte con cualquier duda o necesidad de mantenimiento. ¿Por Qué Elegir Trumax Fenix Pro? La Trumax Fenix Pro es más que una simple balanza; es una inversión en precisión, durabilidad y eficiencia para tu negocio. Su tecnología avanzada y construcción robusta aseguran que puedas contar con ella para obtener resultados precisos cada vez. No pierdas la oportunidad de mejorar la operatividad de tu negocio con una herramienta de pesaje confiable y certificada."
}