{
  "url": "https://communaute.orange.fr/t5/l-iPhone-et-ses-applications/Nombreuses-communications-WAP-WEB-intempestives-sur-iPhone/td-p/53767",
  "title": "Nombreuses communications WAP/WEB intempestives su... - Communauté Orange",
  "text": "- Communauté Orange - ➔ - mobile Orange - ➔ - l'iPhone et ses applications - ➔ - Nombreuses communications WAP/WEB intempestives su... Vous avez une question ? Interrogez la communautéNombreuses communications WAP/WEB intempestives sur iPhone - S'abonner au fil RSS - Marquer le sujet comme nouveau - Marquer le sujet comme lu - Placer ce Sujet en tête de liste pour l'utilisateur actuel - Marquer - S'abonner - Page imprimable - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Nombreuses communications WAP/WEB intempestives sur iPhone Bonjour, Depuis quelque temps, la facture Orange pour mon mobile (iPhone 4S, iOS 7) est anormalement élévée. Ayant eu des soucis avec une connexion Wi-Fi j'ai supposé que je dépassais mon forfait Data en basculant en 3G sans le voir. En fait, sur la dernière facture, j'ai une dizaine de pages intitulées \"communications WAP/WEB...\" affichant de courtes connexions au site Orange.fr, d'un très faible cout unitaire (0,024 € TTC) mais qui, commulées atteignent plus de 15 euros ! On constate une connexion toutes les 30 mn environ, même la nuit, alors que mon tél est en charge. Le trafic réel de chaque connexion est faible (1, 3, 12 Ko...) mais est arrondi à 100 Ko minimum pour le trafic facturé ! Je suspecte l'application \"Orange et moi\" d'être à l'origine de ces connexions intempestives et je l'ai aussitôt supprimée. Je verrai le mois prochain si c'est bien l'origine du problème. Quelqu'un a-t-il rencontré ce cas ? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Bonjour, A mon avis Orange et moi ne \"consomme\" que quand un l'ouvre... Voir d'autres sources de comsommation et les remèdes: http://assistance.orange.fr/comprendre-les-connexions-internet-depuis-votre-mobile-4809.php - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Je veux bien que l'application \"Orange et moi\" ne consommerait que lorsqu'elle est sollicitée... mais alors, quelle application irait toutes les demi-heures sur le site Orange.fr exclusivement, échanger quelques kilo-octets ? De plus, pendant ces connexions au site d'Orange, le Wi-Fi de mon domicile est actif (les anciens problèmes ont été réglés) et ce mode de connexion est utilisé prioritairement, sauf semble-t-il, par ce \"Orange et moi\". A noter : je n'utilise le site d'Orange que pour mon tél mobile et surtout pas la nuit quand je dors ! Pour le reste (Adsl, messagerie...), je suis abonné à SFR. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone (suite) Je viens de lire le paragraphe suivant sur le site d'Orange : << Un téléphone en veille se connecte prioritairement au réseau mobile et non au réseau Wi-Fi. Comprenez que même si vous avez connecté votre mobile à votre box pour utiliser le réseau Wi-Fi, celui-ci se désactivera lorsque le mobile ne sera plus utilisé. Les applications se connecteront donc au réseau mobile en générant des connexions et donc des consommations Internet. >> Cela est-il vrai de toutes les applications ? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Bonjour, Ce que vous citez est juste ce que je voulais vous écrire..... Oui c'est vrai pour toutes les usages/applications. Une autre aplicationà surveiller si vous l'avez, c'est sauvegarde mobile dont vous pouvez régler la fréquence des sauvegarde. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Salut à vous Moins tu auras des applications, mieux ton forfait se portera. Autre solution, désactiver les données , seul problème, l'envoi d'mms ne sera plus possible. Sinon, tu fais comme moi, quand tu as pas besoin du mobile, tu l'éteins . - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Si tu as iOS7, active le mode avion la nuit. Ca permet de limiter les données internet. Tu peux également interdire les applications de fonctionner en \"tâche de fond\". - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone [Tu peux également interdire les applications de fonctionner en \"tâche de fond\".] Comment fait-on cela ? Par ailleurs, j'essaie de trouver l'application iPhone qui est en cause. Sur la facture, le site indiqué (toujours Orange.fr) n'est pas très utile si toutes les communications \"Data\" doivent nécessairement y passer ! Existe-t-il un programme qui permette de tracer ces connexions Data et surtout, qui indique quelle application en est à l'origine ? Merci de votre aide. - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone j'ai également ce mois ci le même problème avec la difference que je n'ai que 3 communications de 9035ko et que ça me coute 120€. Que dois je faire? - Marquer comme nouveau - Marquer - S'abonner - S'abonner au fil RSS - Imprimer - Signaler Re : Nombreuses communications WAP/WEB intempestives sur iPhone Bonjour, J'ai le meme probleme depuis des mois sans avertissement de mon operateur(orange) Comment resoudre ce probleme?"
}