{
  "url": "https://social.msdn.microsoft.com/Forums/ie/en-US/8524988d-39dd-4009-aa63-a41c24f23d70/commicrosoftsqlserverjdbcsqlserverexception-transaction-process-id-422-was-deadlocked-on-lock?forum=sqldatabaseengine",
  "title": "com.microsoft.sqlserver.jdbc.SQLServerException: Transaction (Process ID 422) was deadlocked on lock resources with another process | Microsoft Learn",
  "text": "Note Access to this page requires authorization. You can try signing in or changing directories. Access to this page requires authorization. You can try changing directories. Question Monday, April 2, 2018 5:31 PM One of our customer is getting this error frequently. This is causing application not functioning properly. Please help to identify the root cause of this issue and also to narrow down at least to know whether this is something to fix from application side or database side. Below is the error stack trace. Transaction (Process ID 422) was deadlocked on lock resources with another process and has been chosen as the deadlock victim. Rerun the transaction. com.microsoft.sqlserver.jdbc.SQLServerException: Transaction (Process ID 422) was deadlocked on lock resources with another process and has been chosen as the deadlock victim. Rerun the transaction. at com.microsoft.sqlserver.jdbc.SQLServerException.makeFromDatabaseError(SQLServerException.java:197) at com.microsoft.sqlserver.jdbc.TDSTokenHandler.onEOF(tdsparser.java:246) at com.microsoft.sqlserver.jdbc.TDSParser.parse(tdsparser.java:83) at com.microsoft.sqlserver.jdbc.SQLServerResultSet.<init>(SQLServerResultSet.java:284) at com.microsoft.sqlserver.jdbc.SQLServerStatement.getNextResult(SQLServerStatement.java:1504) at com.microsoft.sqlserver.jdbc.SQLServerPreparedStatement.doExecutePreparedStatement(SQLServerPreparedStatement.java:390) at com.microsoft.sqlserver.jdbc.SQLServerPreparedStatement$PrepStmtExecCmd.doExecute(SQ Details of Customer's database: Thanks. All replies (6) Monday, April 2, 2018 6:15 PM One of our customer is getting this error frequently. This is causing application not functioning properly. Please help to identify the root cause of this issue and also to narrow down at least to know whether this is something to fix from application side or database side. That's an excellent question, although of course the answer is, \"it depends\", and can easily require changes on *both* the application and the database. To learn more you need to get the full deadlock report from the SQL log or other tool. Josh Monday, April 2, 2018 7:32 PM Deadlocks are captured by the system health session. You can use any of the queries below to extract the deadlocks from that session. If you need help to interpret the deadlock graphs, feel welcome to ask here. Make sure that you identify that the queries involved are from your application. SELECT xed.value('@timestamp', 'datetime2(3)') as CreationDate, xed.query('.') AS XEvent FROM ( SELECT CAST([target_data] AS XML) AS TargetData FROM sys.dm_xe_session_targets AS st INNER JOIN sys.dm_xe_sessions AS s ON s.address = st.event_session_address WHERE s.name = N'system_health' AND st.target_name = N'ring_buffer' ) AS Data CROSS APPLY TargetData.nodes('RingBufferTarget/event[@name=\"xml_deadlock_report\"]') AS XEventData (xed) ORDER BY CreationDate DESC SELECT xed.value('@timestamp', 'datetime2(3)') as CreationDate, xed.query('.') AS XEvent FROM ( SELECT CAST([event_data] AS XML) AS TargetData FROM sys.fn_xe_file_target_read_file ('system_health*.xel', NULL, DEFAULT, DEFAULT) ) AS Data CROSS APPLY TargetData.nodes('/event[@name=\"xml_deadlock_report\"]') AS XEventData (xed) ORDER BY CreationDate DESC Monday, April 2, 2018 7:43 PM Thanks Josh for your quick response. Do you mean to get full report from TRACE log in SQL Server? If so, i can ask my customer's DBA to get that. Monday, April 2, 2018 8:17 PM Thanks much Erland for your response and additional information. Yes, the query involved in deadlock is from my application, that is a simple select query. I tried to run above queries from my sql server. First query ran fine, but 0 records. Second query failed with below error, even though i use 'sa' user to connect. \"The metadata file name \"(null)\" is invalid. Verify that the file exists and that the SQL Server service account has access to it.\" Can i share these two queries to my customer, so that they can ask their DBA to run those? Monday, April 2, 2018 8:29 PM Yes, the query involved in deadlock is from my application, that is a simple select query. I was referring to the data you haven't gotten back yet. I tried to run above queries from my sql server. First query ran fine, but 0 records. Second query failed with below error, even though i use 'sa' user to connect. \"The metadata file name \"(null)\" is invalid. Verify that the file exists and that the SQL Server service account has access to it.\" Not surprisingly, you need to run them on the server where the deadlock occurred. The System Health session is a built-in session that tracks various events in SQL Server that reflects the system health. This includes deadlocks. Yes, ask their DBA to collect this information. Start with the ring-buffer query, as the other query can return a lot more data than you need. On SQL 2008, I believe the ring-buffer is the only option. Note that since it is a ring buffer, data is aged out by time. Monday, April 2, 2018 11:35 PM Do you mean to get full report from TRACE log in SQL Server? If so, i can ask my customer's DBA to get that. Generally the default TRACE log does not have this information, though if it's my system there's another trace log that does! There is a \"SQL Server Log\" that will have this information in full IF a couple of trace flags have been turned on, but in most servers they are turned on. Your customer's DBA hopefully can provide the info. (did you say which version of SQL Server you are using?)(oh yes you did: 2012) Yes, the ring buffer also may have partial or full deadlock information, if nothing else has. Any chance your customer is also using any other third-party monitoring tools? Even a select can be the statement that causes a deadlock, depending on whether one or both sessions have multi-statement transactions open, and what their isolation level is. Defaults on Entity Framework often use serializable isolation, which contributes to deadlocks, I'm not sure what the defaults are now for JDBC, within whatever frameworks, or what might be explicitly written into your application. Josh"
}