{
  "url": "https://www.calculator.net/date-calculator.html",
  "title": "Date Calculator",
  "text": "Date Calculator Days Between Two Dates Find the number of years, months, weeks, and days between dates. Click \"Settings\" to define holidays. Add to or Subtract from a Date History of the Gregorian Calendar The Gregorian calendar is the most prevalently used calendar today. Within this calendar, a standard year consists of 365 days with a leap day being introduced to the month of February during a leap year. The months of April, June, September, and November have 30 days, while the rest have 31 days except for February, which has 28 days in a standard year, and 29 in a leap year. The Gregorian calendar is a reformed version of the Julian calendar, which was itself a modification of the ancient Roman calendar. The ancient Roman calendar was believed to be an observational lunar calendar, based on the cycles of the moon's phases. The Romans were then believed to have adopted a 10-month calendar with 304 days, leaving the remaining 50 or so days as an unorganized winter. This calendar allowed the summer and winter months to become completely misplaced, leading to the adoption of more accurate calendars. The Republican calendar later used by Rome followed Greek calendars in its assumptions of 29.5 days in a lunar cycle and 12.5 synodic months in a solar year, which align every fourth year upon the addition of the intercalary months of January and February. From this point, many attempts were made to align the Republican calendar with the solar year including the addition of an extra month to certain years to supplant the lack of days in a particular year. In 46 BC, the calendar was further reformed by Julius Caesar, introducing an algorithm that removed the dependence of calendars from the observation of the new moon. In order to accomplish this, Caesar inserted an additional 10 days into the Republican calendar, making the total number of days in a year 365. He also added the intercalation of a leap day every fourth year, all in an attempt to further synchronize the Roman calendar with the solar year. Despite all efforts, the Julian calendar still required further reform, since the calendar drifted with respect to the equinoxes and solstices by approximately 11 minutes per year. By 1582, this resulted in a difference of 10 days from what was expected. Pope Gregory XIII addressed this by essentially skipping 10 days in the date, making the day after October 4, 1582, October 15. An adjustment was also made to the algorithm of the Julian calendar that changed which century years would be considered leap years. Under the Gregorian calendar, century years not divisible by 400 would not be leap years. These changes reduced the error from 1 day in 128 years, to 1 day in 3,030 years with respect to the current value of the mean solar year. The adoption of the Gregorian calendar occurred slowly over a period of centuries, and despite many proposals to further reform the calendar, the Gregorian Calendar still prevails as the most commonly used dating system worldwide. Holidays A holiday is a day that, either by custom or by law, is set aside such that regular activities like going to work or school are suspended, or at least reduced. The term \"holiday\" can be interpreted differently, depending on the region. In the U.S., paid leave is typically referred to as \"vacation,\" while national, religious, or cultural days off are referred to exclusively as \"holiday.\" In some regions, however, such as the United Kingdom or former British colonies, the term holiday can also refer to paid leave. Generally, holidays are meant to commemorate some event, person, or group of cultural or religious significance. Although certain holidays, such as Christmas and New Year's Day, are widely celebrated worldwide, most countries have their own set of holidays that are specific to the country, and even the same holidays may be observed differently within countries: some may receive a full suspension of typical daily activities, while others may only get partial days off. Certain countries have holidays that essentially shut down almost all businesses. As an example, in Brazil, Carnaval do Brasil results in almost a full week in which only industrial production, retail establishments, or carnival-related businesses, function. This calculator is mainly geared towards U.S. holidays, but holidays specific to a given country can be entered manually. Certain holidays can also be excluded. For a further level of specificity, federal holidays in the U.S. refer to holidays that have been recognized by the U.S. government; on these days, non-essential federal government offices are closed, and all federal employees receive paid leave. This is not necessarily true in the private sector, however, and which federal holidays a private sector employee receives is largely dependent on the discretion of the company. In some cases, an employee who is required to work on a federal holiday may receive compensation in the form of holiday pay in addition to their regular wages. Certain holidays such as New Year's Day are referred to as \"fixed holidays,\" since they fall on the same date every year. Others, such as the birthday of Martin Luther King, Jr., don't have a fixed date, because they occur on a \"floating Monday\"; in this particular case, the holiday occurs on the third Monday of January. Another widely observed holiday in the U.S., Thanksgiving, occurs on a \"floating Thursday,\" the fourth Thursday In November, hence the dates of these holidays vary by year. Below are two tables showing the dates of federal holidays in the U.S. for 2026 and 2027. 2026 U.S. Federal Holidays 2027 U.S. Federal Holidays"
}