{
  "url": "https://www.loacker.com/",
  "title": "Wafer, Chocolate and Snack | Loacker",
  "text": "Loacker's “Rebels of Goodness” is more than a slogan; it is the beating heart of a company that has built its success on quality, innovation and respect for nature. Find out moreWhat type of flavour do you like most? Discover the variety of available products for each flavour! Three crispy wafers and two layers of delicious Napolitaner cream filling with exquisite Italian hazelnuts make this Classic Napolitaner an absolute best-seller. For our cream, we use exclusively Italian hazelnuts which are freshly roasted on-site at Loacker. Thanks to our “Italian Hazelnut Orchards” project, we grow and select these precious fruits, supporting our farmers and the local economy. Discover moreIf you want a little more, Maxi promises with six crispy wafers and five layers of delicious Napolitaner cream filling maximum pleasure. For our cream we exclusively use Italian hazelnuts which are freshly roasted on-site at Loacker. Thanks to our “Italian Hazelnut Orchards” project, we pay our undivided attention to this important ingredient. Discover morePleasure at the highest level! Crispy wafers covered in dark milk chocolate refined with fine flavor cocoa from Ecuador and filled with hazelnut cream make this very creamy composition a true masterpiece. The \"Italian Hazelnut Orchards\" project aims to improve quality and sustainability of this precious ingredient. Discover moreThree crispy wafers with a pinch of cocoa are filled with two lavish layers of fine flavor dark chocolate cream. All coated with intense dark chocolate, with 60% cocoa. The perfect break for all chocolate lovers. Discover moreFour crispy wafers and three layers of the delicious cream filling made with an exclusive bled of cocoa and chocolate refined with fine flavor cocoa from Ecuador make this classic in mini size simply irresistible. The delicious cocoa from our sustainable “Cocoa Farming Program” lends a particular bouquet to this creamy classic - and promises exquisite pleasure. Discover moreLoacker Crispy Dark is the snack-size chocolate bar that brings pure pleasure and delights the senses when you feel the desire for goodness. The crumbly, innovative wafer crispies, the intense, resolute taste of cocoa bean nibs and the dark chocolate with 60% cocoa. Its melt-in-your-mouth texture is irresistibly enhanced by the crunchiness of the other two delicious ingredi-ents: crispies and cocoa bean nibs. Discover moreSo much goodness in such a small pack: Four crispy wafers and three layers of delicious cream filling with exquisite Bourbon vanilla pods in the mini size will guarantee truly exquisite moments of pleasure. The balanced sweetness and delicate taste of our cream with 100% Madagascar Bourbon vanilla from our sustainability program conquers you immediately. Discover moreVanilla delights in XL size: Six light and crispy wafers and five layers of delicious Bourbon vanilla cream filling will guarantee maximum pleasure. Just as exquisite, royal and exotic as the orchid, from whose fermented capsules the Bourbon vanilla pods are extracted, is the taste of the fine Loacker vanilla cream. With our Sustainability Program we aim for protecting our farmers and improving the living conditions of local communities. Discover moreOne layer of finest Vanilla cream filling between two extra-large crispy wafers enriched by a pinch of cocoa. The Vanilla cream filling is prepared using 100% Bourbon vanilla pods from our sustainability program in Madagascar. Try these extra-large Ice cream wafer and you’ll have the ultimate crunchy treat. A highlight for all ice cream lover! Discover moreThree crispy wafers and two layers of delicious milk cream filling will guarantee light and crispy enjoyment. The milk used for the cream, 100% Alpine and NON GMO, comes mostly from small mountain farms close to us, where the cows live happy lives. Discover moreThe fine dark milk chocolate refined with fine flavor cocoa from Ecuador with a core of tenderly melting milk cream and crispy wafer ensures unique and unforgettable moments of pleasure. Three levels of pleasure for a single extraordinary moment. And you can indulge in the crispy softness of a Choco Minis Specialty Milk Creme whenever you feel you deserve it! Discover more"
}