{
  "url": "https://verescakery.com/",
  "title": "Vere's Cakery – Freshly Baked, Beautiful Designs & Exceptional Taste!",
  "text": "Made from Scratch with a Modern Approach -ENDULZATE LA VIDAÂ ADDRESS: 5720 IMPERIAL HWY., SUITE C SOUTH GATE, CA 90280 PHONE #: (562) 454-9422 STORE HOURS Closed: Sundays & Mondays Tuesday-Friday: 9am-5pm Saturday: 9am-3pm -ENDULZATE LA VIDAÂ ADDRESS: 5720 IMPERIAL HWY., SUITE C SOUTH GATE, CA 90280 PHONE #: (562) 454-9422 STORE HOURS Closed: Sundays & Mondays Tuesday-Friday: 9am-5pm Saturday: 9am-3pm Vere’s Cakery originated from a passion for chocolate-dipped strawberries back in 2014. My husband would gift me chocolate-dipped berries as a sweet treat. I loved them so much; I began to make them myself. I shared my chocolate berries with family and friends who quickly spread the word. This led to the birth of @veres_berries an Instagram home business. My berries were creative and fun, I knew I could do more! In 2015, I expanded my menu to include a wide variety of fun and gourmet desserts catered to party themes. This expansion included delivery, set-up, and sweet treats. At the same time, I was attending college and held a full-time accounting job. Between 2016-2018 juggling being a mom, a college student, and a full-time accountant left me with little time to take orders. In 2018, while on maternity leave I felt an urge to bake a cake. Without any prior training, I made a cake for my mother’s birthday. My brutally honest family loved the cake. It was natural for me, I practiced several techniques mastering as much as I could! I later found out, my dear grandfather was a baker. He was very special to me and I like to believe he guided me through this new journey. After posting an image of my mother’s birthday cake I was blown away by the response. Orders came in faster than I could handle. The financial security of a full-time job was getting in the way of my true calling. After confiding in my husband he kindly encouraged me to leave my secure job and pursue my passion for baking. This gave birth to @veres_cakery. Not just any cakes! Tasty, fun, creative, rich, and full of flavor and always Instagram post-worthy.Â This is only the beginning. Thank you to all of our loyal clients who have supported me and are happy to watch me grow. I wouldn’t be here without you! Â© 2026 Â· Vere's Cakery. Theme by HB-Themes."
}