{
  "url": "https://www.prestonford.com/new-Hurlock+MD-2026-Ford-Maverick-XLT-3FTTW8JA4TRA31774",
  "title": "2026 Ford Maverick XLT Hurlock, MD MD | Easton, MD Salisbury, MD Cambridge, MD Maryland 3FTTW8JA4TRA31774",
  "text": "2026 Ford Maverick XLT - $32,455 Preston Price - MSRP $32,455 - - Add. Available Ford Offers: - -$1,000 - -$500 - -$500 - -$500 - -$500 - $32,455 Preston Price - MSRP $32,455 - - Add. Available Ford Offers: - -$1,000 - -$500 - -$500 - -$500 - -$500 - MSRP $32,455 - Starting Price $32,455 - Down Payment $0 - MSRP $32,455 - Starting Price $32,455 - Down Payment $0 - MSRP $32,455 - Starting Price $32,455 - Due At Signing $3,662 - MSRP $32,455 - Starting Price $32,455 - Due At Signing $3,662 Visit our Store - Preston Ford Hurlock - 4313 Preston Road Hurlock, MD 21643 - Sales: 410-673-7171 - Service: 410-673-7171 - Parts: 410-673-7171 Vehicle Information - Body Style SuperCrew - Exterior Color Oxford White - Interior Color Navy Pier And Aspen Gray - City/Highway 22/30 MPG - Engine 99A 2.0L ECOBOOST ENGINE - Transmission 8-SPEED AUTOMATIC / All Wheel Drive - Fuel Type Gasoline Fuel Dealer Comments Important Package and Feature Information Equipment Group 302A - 8-Speed Automatic Transmission - 17\"\" Carbonized Gray Painted Aluminum Wheels - Unique Cloth Front Bucket Seats - 2.0L EcoBoost Engine - 5,320 lbs GVWR - AM/FM Stereo with 6 Speakers - P225/65R17 A/S BSW Tires Safety and Security - Pedestrian impact prevention - An extra step toward safety. Pedestrians don't always stop, look, and listen, but with Pedestrian Impact Prevention, your vehicle is equipped to better see them and avoid them. This system constantly monitors the road ahead to identify and track pedestrians. It projects that image to an interior display screen, AND should an impact become likely, Pedestrian impact prevention takes steps to avoid a collision. - Rear camera - Watching your back! The rear camera helps you see obstacles and hazards you otherwise couldn't by showing enhanced images of what is behind you. The rear camera is an extra set of eyes that's both convenient and safe. - Lane departure prevention - Keep it between the lines. It only takes a moment of inattention for your vehicle to drift. With lane departure prevention, your vehicle takes corrective action to help you avoid unintentionally moving out of your lane. Lane departure prevention is an extra level of safety for you and those around you. Technology and Telematics - Smart device mirroring - Smartphone, meet smart car. You can control your device through your vehicle's infotainment system. Smart device mirroring brings together safety and convenience by making it easier to find what you're looking for while keeping your eyes on the road. - Mobile hotspot - WiFi on the fly. Connect your devices to the Internet through your vehicle's private mobile hotspot and take the internet wherever your journey takes you, without eating up your data allowance. Find the hotspot with mobile hotspot. ENGINE: 2.0L ECOBOOST, TRANSMISSION: 8-SPEED AUTOMATIC, EQUIPMENT GROUP 302A, OXFORD WHITE, 50-STATE EMISSIONS SYSTEM, CONVENTIONAL 17\"\" SPARE TIRE (215/70R17) At Preston Ford Hurlock, we're here to Serve you! Our staff is 100% dedicated to customer satisfaction and we understand that you need clear, transparent information throughout the car buying process. With our live market pricing philosophy, we offer the right cars at the right price, and the transparency to back it up! FINANCING OPTIONS: Take advantage of our attractive low-rate financing options. Our access to various Credit Unions and National Banks can provide financing for most credit levels. We can tailor a finance package to fit your needs. To get started, complete our secure online credit application. Eligible Benefits All Features - Cargo Box Tie Down Hooks - Daytime Running Lamps - Door Handles - Black - Easy Fuel Capless Filler - Enclosed Bed Storage - Flexbed Storage System - Headlamps -Wiper Activated - Headlamps-Led Auto Hi-Beam - Headlamps-Led Auto On/Off - Led Reflector Headlamps - Power Mirrors - Power Tailgate Lock - Trailer Tow Hitch - Wipers- Intermittent - 13.2\" Center Display - 4-Wheel Antilock Brake Sys - 5G Modem - Battery Saver Feature - Electric Parking Brake - Electronic Pwr Asst Steer - Ford App - Intell Access W/Push Start - Pre-Collision Assist W/Aeb - Rear View Camera - Remote Keyless Entry - Selectable Drive Modes - Sync4 - 1-Touch Down Driver Window - 2Nd Row Bench Flip-Up W/ Under-Seat Storage - 8\" Cluster Display - Cruise Control - Dual Usb - Manual A/C, Single Zone - Particulate Air Filter - Power Locks And Windows - Powerpoints - 12V - Rotary Gear Shift Dial - Unique Cloth Bucket Seats - Vinyl Soft Console Lid - Airbags - Safety Canopy - Belt-Minder Chime - Latch Child Safety System - Perimeter Alarm - Securilock Anti-Theft Sys - Tire Pressure Monit Sys Ford Co-Pilot360® Technology XLT (302A) Ford Connectivity Package (1-year included) - 2.91 Axle Ratio - GVWR: 5,320 lbs - Engine Auto Stop-Start Feature - Transmission w/Driver Selectable Mode - Automatic Full-Time All-Wheel - 45-Amp/Hr 390CCA Maintenance-Free Battery w/Run Down Protection - Regenerative 150 Amp Alternator - Trailer Wiring Harness - 1400# Maximum Payload - Gas-Pressurized Shock Absorbers - Front And Rear Anti-Roll Bars - Electric Power-Assist Speed-Sensing Steering - 13.8 Gal. Fuel Tank - Single Stainless Steel Exhaust - Permanent Locking Hubs - Strut Front Suspension w/Coil Springs - Short And Long Arm Rear Suspension w/Coil Springs - Regenerative 4-Wheel Disc Brakes w/4-Wheel ABS, Front And Rear Vented Discs, Brake Assist, Hill Hold Control and Electric Parking Brake - Lithium Ion (li-Ion) Traction Battery 1.1 kWh Capacity - Tires: P225/65R17 A/S BSW - Regular Box Style - Tire mobility kit - Body-Colored Front Bumper w/Black Rub Strip/Fascia Accent - Black Rear Step Bumper - Black Side Windows Trim and Black Rear Window Trim - Black Door Handles - Fixed Rear Window - Deep Tinted Glass - Fixed Interval Wipers - Galvanized Steel/Aluminum Panels - Black grille - Tailgate Rear Cargo Access - Integrated Storage - Cargo Lamp w/High Mount Stop Light - Auto High Beams - 6 Speakers - Streaming Audio - Integrated Roof Antenna - 2 LCD Monitors In The Front - Driver Seat - Passenger Seat - Full Folding Bench Front Facing Fold Forward Seatback Premium Cloth Rear Seat - Manual Tilt/Telescoping Steering Column - Front Cupholder - Rear Cupholder - Compass - Remote Releases -Inc: Power Fuel - Cruise Control w/Steering Wheel Controls - Voice Activated Automatic Air Conditioning - HVAC -inc: Underseat Ducts - Glove Box - Driver foot rest - Interior Trim -inc: Colored Instrument Panel Insert, Colored Door Panel Insert and Other Interior Accents - Full Cloth Headliner - Day-Night Rearview Mirror - Driver And Passenger Visor Vanity Mirrors w/Driver And Passenger Auxiliary Mirror - Full Floor Console w/Covered Storage, Mini Overhead Console w/Storage and 1 12V DC Power Outlet - Front Map Lights - Fade-To-Off Interior Lighting - Cargo Features -inc: Tire Mobility Kit - Cab Mounted Cargo Lights - Rear View Camera - Lane-Keeping System -inc: Lane-Keeping Alert, lane-keeping assist, Driver Alert and road edge detection - Dashboard Storage, Driver / Passenger And Rear Door Bins and 2nd Row Underseat Storage - Delayed Accessory Power - Driver Information Center - Redundant Digital Speedometer - Outside Temp Gauge - Digital/Analog Appearance - Seats w/Cloth Back Material - Manual Adjustable Front Head Restraints and Fixed Rear Head Restraints - 1 Seatback Storage Pocket - Front Center Armrest and Rear Center Armrest - Securilock Anti-Theft Ignition (pats) Immobilizer - Perimeter Alarm - 1 12V DC Power Outlet - Air Filtration - Side Impact Beams - Dual Stage Driver And Passenger Seat-Mounted Side Airbags - Tire Specific Low Tire Pressure Warning - Dual Stage Driver And Passenger Front Airbags - Safety Canopy System Curtain 1st And 2nd Row Airbags - Airbag Occupancy Sensor - Driver knee airbag - Mykey System -inc: Top Speed Limiter, Audio Volume Limiter, Early Low Fuel Warning, Programmable Sound Chimes and Beltminder w/Audio Mute - Rear child safety locks - Outboard Front Lap And Shoulder Safety Belts -inc: Rear Center 3 Point, Height Adjusters and Pretensioners - Fuel Economy Est-Combined (MPG): 25 (2025) - Fuel Economy Est-Combined (MPG): 37 (2025) - EPA Fuel Economy Est - City (MPG): 22 (2025) - EPA Fuel Economy Est - City (MPG): 40 (2025) - EPA Fuel Economy Est - Hwy (MPG): 30 (2025) - EPA Fuel Economy Est - Hwy (MPG): 34 (2025) - Gross Traction Battery Capacity (kWh): 1.1 - Cold Cranking Amps @ 0° F (Primary): 390 - Cold Cranking Amps @ 0° F (2nd): 390 - Maximum Alternator Capacity (amps): 150 - Base Curb Weight (lbs): 3856 - Gross Vehicle Weight Rating Cap (lbs): 5240 - Gross Vehicle Weight Rating Cap (lbs): 5320 - Gross Combined Wt Rating (lbs): 6145 - Dead Weight Hitch - Max Trailer Wt. (lbs): 2000 - Dead Weight Hitch - Max Tongue Wt. (lbs): 200 - Wt Distributing Hitch - Max Trailer Wt. (lbs): 2000 - Wt Distributing Hitch - Max Tongue Wt. (lbs): 200 - Maximum Trailering Capacity (lbs): 2000 - Suspension Type - Front: Strut - Suspension Type - Rear: Short And Long Arm - Axle Type - Front: Independent - Axle Type - Rear: Independent - Axle Ratio (:1) - Front: 2.91 - Axle Ratio (:1) - Rear: 2.91 - Brake Type: 4-Wheel Disc - Brake ABS System: 4-Wheel - Brake ABS System (Second Line): 4-Wheel - Disc - Front (Yes or ): Yes - Disc - Rear (Yes or ): Yes - Front Tire Size: P225/65HR17 - Rear Tire Size: P225/65HR17 - Front Wheel Size (in): 17 X 7 - Rear Wheel Size (in): 17 X 7 - Front Wheel Material: Aluminum - Rear Wheel Material: Aluminum - Steering Type: Rack-Pinion - Turning Diameter - Curb to Curb (ft): 40 - Fuel Tank Capacity, Approx (gal): 16.5 - Fuel Tank Capacity, Approx (gal): 13.8 - Wheelbase (in): 121.1 - Length, Overall (in): 199.7 - Width, Max w/o mirrors (in): 72.6 - Height, Overall (in): 68.7 - Ground to Top of Load Floor (in): 30.1 - Ground Clearance, Front (in): 8.6 - Ground Clearance, Rear (in): 8.6 - Cargo Box Length @ Floor (in): 54.4 - Cargo Box Width @ Top, Rear (in): 53.3 - Cargo Box Width @ Floor (in): 53.3 - Cargo Box Width @ Wheelhousings (in): 42.6 - Cargo Box (Area) Height (in): 20.3 - Tailgate Width (in): 49.8 - Cargo Volume (ft³): 33.3 - Passenger Capacity: 5 - Front Head Room (in): 40.3 - Front Leg Room (in): 42.8 - Front Shoulder Room (in): 57.3 - Front Hip Room (in): 55.4 - Second Head Room (in): 39.6 - Second Leg Room (in): 36.9 - Second Shoulder Room (in): 55.6 - Second Hip Room (in): 54.1 - Vehicle Name: Ford Maverick - Body Style: SuperCrew - Body Code: T - EPA Greenhouse Gas Score: 5.0 (Est) - EPA Greenhouse Gas Score: 7.0 (Est) - Tons/yr of CO2 Emissions @ 15K mi/year: 7.1 (2025) - Tons/yr of CO2 Emissions @ 15K mi/year: 4.8 (2025) Warranty - 3Yr/36,000 Bumper / Bumper - 5Yr/60,000 Powertrain - 5Yr/60,000 Roadside Assist - 8Yr/100,000 Hybrid Unique -Components If Equipped Additional rebates may be available to reduce your price further. All prices include freight and destination. Pricing of vehicles on this website does not include options that may have been installed at the Dealership. Pricing includes current rebates and manufacturer incentives such as Ford Credit Retail Bonus Customer Cash. Manufacturer incentives are subject to residency restrictions. All financing is subject to approved credit. Monthly payment calculator is an estimate and does not include tax, title, license or doc fee of $799. Please contact the Dealership for latest pricing and monthly payment. Published price subject to change without notice to correct errors or omissions or in the event of inventory fluctuations. Price good for 2 days only, please contact store by email or phone for details. While every effort has been made to ensure display of accurate data, the vehicle listings within this website may not reflect all accurate vehicle items. Accessories and color may vary. All Inventory listed is subject to prior sale. Every effort will be made to hold your vehicle of interest but may be sold prior to the time of purchase. In the event your vehicle of interest is sold, we will do our best to find a like model. The vehicle photo displayed may be an example only. Vehicle Photos may not match exact vehicle. Though we make every effort to provide you the most accurate, up-to-date information, occasionally, one or more vehicles on this website may be incorrect due to typographical, photographic, occasional human or technical error. We reserve the right to refuse to honor any incorrect internet prices as we cannot account for the occasional human or technical error. Please confirm vehicle price with Dealership. See Dealership for details. 2/4/2026 Additional rebates may be available to reduce your price further. All prices include freight and destination. Pricing of vehicles on this website does not include options that may have been installed at the Dealership. Pricing includes current rebates and manufacturer incentives such as Ford Credit Retail Bonus Customer Cash. Manufacturer incentives are subject to residency restrictions. All financing is subject to approved credit. Monthly payment calculator is an estimate and does not include tax, title, license or doc fee of $799. Please contact the Dealership for latest pricing and monthly payment. Published price subject to change without notice to correct errors or omissions or in the event of inventory fluctuations. Price good for 2 days only, please contact store by email or phone for details. While every effort has been made to ensure display of accurate data, the vehicle listings within this website may not reflect all accurate vehicle items. Accessories and color may vary. All Inventory listed is subject to prior sale. Every effort will be made to hold your vehicle of interest but may be sold prior to the time of purchase. In the event your vehicle of interest is sold, we will do our best to find a like model. The vehicle photo displayed may be an example only. Vehicle Photos may not match exact vehicle. Though we make every effort to provide you the most accurate, up-to-date information, occasionally, one or more vehicles on this website may be incorrect due to typographical, photographic, occasional human or technical error. We reserve the right to refuse to honor any incorrect internet prices as we cannot account for the occasional human or technical error. Please confirm vehicle price with Dealership. See Dealership for details. 2/4/2026"
}