{
  "url": "https://bayevskitchen.com/champignon-guide/",
  "title": "Champignons: Cutting, How to Store +10 Recipe Ideas",
  "text": "Champignons are lamellar mushrooms with a rounded cap (its color can vary from milky white to brown) and a squat stalk. They are one of the most popular mushrooms in world cooking. First, because they are specially cultivated rather than harvested. Thanks to cultivation, they are safe and impossible to confuse with their poisonous counterparts. And this is the second reason for the popularity of mushrooms. And the third is a pleasant and fairly neutral taste with slight aniseed notes, which perfectly combines with meat, vegetables, cheeses and other ingredients. Champignons began to be cultivated in Italy for more than 1,000 years. Today they are common mostly in European and American cuisine. How to cook mushrooms, how to slice and how to store, what are some unusual recipes with this product – in my new blog. Champignons: General Characteristics Champignons are loved by novice cooks and chefs of the best restaurants in the world. First, because of their versatility in cooking techniques. They can be eaten raw, fried, steamed, boiled, baked, marinated, and deep-fried. The second reason is their amazing ability to combine with a wide variety of foods. Cheeses, any kind of meat, eggs, vegetables, fish, dairy products – mushrooms advantageously emphasize their taste and create a perfect new combination. The mushrooms themselves taste quite neutral, but light shades perfectly reveal combinations of other products. With mushrooms, you can even combine ingredients that are completely incongruous without this binding link: pasta with cottage cheese, tomato paste and mushrooms, for example. Champignons are nutritious, they have a lot of proteins and carbohydrates, for vegetarians they are, though not the best, but a substitute for meat. Champignons are artificially cultivated mushrooms, they are not poisonous. Therefore, you can safely buy and cook them without fear of departure. Basic Ways to Slice Mushrooms Champignons are cut into thin slices, cubes or sticks. But beforehand the mushrooms need to be prepared: - If you are using fresh mushrooms, rinse them in water. Frozen first need to defrost at room temperature, then rinse. If you are in a hurry and need to speed up the defrosting process, you can pour boiling water over them. - Sort all the mushrooms by size, they should be about the same; - Remove the film that connects the cap to the stalk. If there are any rotten, spoiled areas, remove them; - Using a soft brush or sponge, remove any soil or dirt particles that may have adhered to you – these will remain even after you have washed them thoroughly; - Remove the skin from the head. To do this, gently pick it up with a knife and pull; - If the mushrooms were left in the refrigerator for a long time and strongly dried out, such areas should be cut off. They can greatly spoil the taste of the finished dish. Let’s talk about cutting. Slicing 1. Take a large, sturdy cutting board. 2. Separate the stalk, cut the head in half. 3. Holding the hat half with your left hand, carefully cut it into equal thin slices. To make the mushroom more stable when slicing, you can turn it hat side down. Dice cutting 1. Separate the stalk. 2. Cut each part of the mushroom into slices of equal thickness first. 3. Carefully press the slices together and cut crosswise to make square slices of equal size. Dicing is great for making a variety of mushroom sauces. Slicing into julienne strips 1. Separate the heads and stems. 2. Cut stem into four pieces, flip over and slice again. 3. Slice the caps in the same way. Choose the slicing method according to the recommendations in the recipe or based on your personal preference. Techniques for Cooking Mushrooms Champignons can be eaten raw, pan-fried, grilled and deep-fried, boiled, baked in the oven and even cooked in the microwave. Let’s consider the peculiarities of different cooking techniques. - Boil mushrooms in a stainless steel or enameled saucepan. Whole and large mushrooms will cook in 10-15 minutes, and chopped into pieces will be enough for 5. - In the multicooker you can cook mushrooms without water – they have enough of their own juice, which will be released in the process of cooking. Use the stew mode, for cooking it will take 20 minutes. - Roasting in a pan. Mushrooms are added to an already well heated frying pan and fry over low heat. For whole mushrooms you need 15 minutes, sliced mushrooms will be cooked in 5-10 minutes. For a crust with a deep golden color, I recommend mixing vegetable oil and butter. - Deep frying. For this, small and equal-sized whole mushrooms are used. The mushrooms should be pre-cooked for 10 minutes. Then breaded in breadcrumbs and fried in oil for 7-9 minutes. This is a ready stand-alone dish, which is served with a variety of sauces. - Marinating. There are many recipes for pickled mushrooms. Mushrooms need to be well washed, small ones are not cut, large ones – cut into 2-4 parts. It is important that they are the same size. Then you need to boil water, boil the mushrooms for 20 minutes, and at the very end add vinegar and spices to taste. Then place the mushrooms in dry glass jars, pour the water in which they were boiled, close hermetically and send them to cool in a cold place. - In the oven. For complete cooking, you need to bake mushrooms 25-30 minutes, preheating the oven to 190 degrees. Take this into account if you are cooking multi-component dishes – if other vegetables or meat need more time, it is better to add mushrooms later. You don’t have to grease with olive oil, but you can. - Cooking on an air grill. You need to heat it up to 200 degrees, and the mushrooms will be cooked in just 12 minutes. About the same time is needed to cook mushrooms on an open fire or barbecue. - Cooking in the microwave oven. Turn on maximum power, and in 3 minutes the mushrooms will be ready. You do not need to add water or oil, mushrooms enough of their own juices. If the dish is multicomponent, you need to consider the timing and technique of cooking the other ingredients. Sometimes mushrooms are added in the middle of the cooking process, so that they are not overcooked and do not lose their flavor and aroma, their texture. To prevent the mushrooms from darkening during cooking, you can add a spoonful of vinegar, lemon juice or a pinch of citric acid to the water. Fresh mushrooms are added to salads, without heat treatment. It is enough to wash the mushrooms well and remove the films. With what Spices do Mushrooms Go Well? In the process of heat treatment, mushrooms partially lose their flavor and aromas. But this can be corrected. Choosing the right spices and seasonings will not only emphasize and enhance the natural unique flavor of mushrooms. They also promote proper protein absorption. Champignons are ideally combined with such spices: - green onions, dill and parsley. They favorably emphasize the flavors of mushrooms and are often used in salads; - garlic. It is used when cooking fried mushrooms. I advise you first fry the garlic in a pan, and when its flavor unfolds as much as possible, add mushrooms; - Provencal and Italian herbs enhance the flavor of mushrooms in soups and summer salads; - nutmeg is usually added to sauces and gravies with mushrooms; - rosemary is excellent with fresh mushrooms in salads. Other win-win options are to stew mushrooms in wine, sour cream, and combine them with fresh vegetables. But oregano pepper, bay leaf and cilantro in dishes with mushrooms is better not to add. How to Store Mushrooms? In the refrigerator It is better to store mushrooms in the refrigerator, and even then not more than 3 days. They do not retain their appearance, freshness and taste qualities for a long time, so it is not worth buying mushrooms “to store”. You can extend their shelf life a bit longer by wrapping mushrooms in clingfilm. If you bought them really fresh, they can last a week. Open the bag in which they are stored once every 2-3 to air them out, to get rid of condensation. Freezing If you don’t plan to use the mushrooms anytime soon, you can freeze them and store them in the freezer. Freezing is done as follows: - Wipe the mushrooms with a dry cloth. Do not wash or wet them! - Pack the mushrooms in containers or heat packs. Larger ones can be pre-cut, smaller ones can be frozen whole; - Put the closed bags or containers in the freezer. Freezing cooked mushrooms You can freeze cooked mushrooms. In this case, you need to drain the broth, let them dry out well, and then place them in bags and send them to the freezer. Pre-cooked frozen mushrooms can be stored in the freezer for up to 6 months, while raw frozen mushrooms – only up to 40 days. Some people dry mushrooms, but I do not recommend doing it – together with water in the process of dehydration, they lose their taste and smell, and then they will be absolutely useless. How to Determine if the Mushrooms Are Spoiled? You can visually detect the signs of spoiled mushrooms. They begin to shrink, wrinkles appear. If you notice such “symptoms”, try to cook the mushrooms immediately, having previously cut off the dried out places. Otherwise, the processes will progress: sticky slime will appear, an unpleasant putrid smell, mushrooms will darken. If the damage is shallow and small, you can cut off all the darkened places and wash the mushrooms well. But you can eat them only after heat treatment. If there is slime and deep damage, they become unfit for consumption, there is a high probability that mold, bacteria, and fungi develop in the rotten places. This can lead to food poisoning. What to Cook with Mushrooms? Top 10 Unusual but Simple Recipes I have selected 10 dishes that I myself sometimes prepare with pleasure. They are as simple as possible to prepare, but insanely delicious. 1. Pickled mushrooms from Gordon Ramsay. These mushrooms turn out very tender, soft, sweet, sourness in them is felt only slightly and perfectly refreshes the taste of the snack. You’ll find a simplified version of this recipe on my website. Instead of dough, use a large mushroom cap as the base and top with whatever toppings you like – sauce, meat, vegetables, and definitely more mozzarella. This is the kind of pizza you’re sure to surprise your guests at your party! Plus, it has far fewer calories than a regular slice of pizza and is gluten-free. 3. Vegetarian mushroom meatballs. The mushrooms in this recipe are a great substitute for ground meat – both nutritionally and flavor-wise. 4. Champignons stuffed with cheese and garlic. This is an appetizer you can’t tear yourself away from until the mouthwatering caps on your plate are done. 5. Lamb stew with mushrooms and peas. This is a classic dish made for dank and rainy weather – to stay home, cook a delicious meal, dine with a glass of red wine and enjoy the company of your loved one. This is what happiness looks like. 6. Soup with udon noodles, spring vegetables and mushrooms. A simple Japanese-style broth is the perfect balance of sweet and salty with light hints of lemon, complemented by the freshness of broccoli, asparagus and the nutritional value of mushrooms. Tasty, healthy, and very pretty. 7. Champignons roasted with garlic. Spanish and Mexican national dish served on toasted toast or as tapas. In the Mexican version it is very spicy, red chili peppers are added to the garlic. 8. Tortellini with mushrooms and cheese. This dish looks very pretty when served, you’ll enjoy it already from the look of it. And the mushroom stuffed tortellini tastes just divine! 9. Champignons stuffed with arugula and nuts. A very elegant appetizer that you can easily make yourself. The family will say you cook like a chef at an expensive restaurant! Why not mix two completely different foods and get a new palette of flavors? Plus, you don’t need to heat treat the mushrooms and it only takes 5 minutes to make the salad."
}