{
  "url": "https://www.redmond.gov/386/Microsoft-Redmond-Campus-Refresh",
  "title": "Microsoft Redmond Campus Refresh | Redmond, WA",
  "text": "- Home - Government - Departments & Divisions - Planning - Neighborhoods - Overlake - Microsoft Redmond Campus Refresh Microsoft Redmond Campus Refresh Redmond has been the home of the Microsoft Corporate Campus for the last 33 years and Microsoft continues to invest in our community as they build for the future. The Refresh project that is currently underway replaces 12 older office buildings with approximately 3 million square feet of office space within 17 new buildings. These new office buildings are designed and clustered into five distinctive villages. The design of the campus is both pedestrian and bicycle friendly and includes retail shops, restaurants, running and walking trails, sports facilities and open spaces. There will be no internal roads within the new campus as all traffic is routed to the perimeter roads and then to the underground garage. Construction of the garage is underway. Project Timeline Project Overview The project is an investment for the community and the more than 47,000 employees that work on the campus. With a 2-acre open plaza, the modern campus provides the employees and the greater community a space to both gather and work. Scheduled to complete in 2023, some of the highlights of the campus modernization include: - 17 new four to five story buildings, grouped into 5 villages. - Public amenities including: retail shops, restaurants, running and walking trails, sports facilities and green spaces. - A pedestrian and bicycle friendly campus. Traffic is routed along the perimeter roads to the underground parking. - Pedestrian and bicycle bridge over State Route 520 that will connect to the Sound Transit's Redmond Technology Center light rail station. For more information on the Sound Transit project see Light Rail Extension Project. - Implementation of sustainable design strategies to embody the ecology of the region. Video showing the concept of the future campus. Microsoft Refresh Project (Campus Modernization) - Location: Microsoft East Campus, Redmond Located between 156th Avenue NE and NE 36th Way and then between NE 31st Street and NE 36th Street - Project Size: 17 new office buildings, approximately 3 million square feet - Owner/developer: Microsoft - Construction Managers: CBRE, JLL, and OAC - General Contractors: Skanska, Balfour Beatty, GLY, and Sellen - Project/Architects: - Whatcom Village: LMN Architects - Sammamish Village: NBBJ - Building R: Diller Scofidio + Renfro - Washington Village: ZGF Architects LLP - Chelan Village: WRNS Studio - Campus Landscape: Berger Partnership - Target Completion Date: mid-2025 Public Notices - Microsoft SEPA Threshold Determination (PDF) Opens in New Window - Geothermal Report (PDF) Opens in New Window - Geowell Report Opens in New Window Opens in New Window - Microsoft Refresh Building 207 Notice of Application Project Details (PDF) Opens in New Window - Microsoft Refresh Chelan Village Notice of Application Project Details (PDF) Opens a New Window. - Microsoft Refresh Sammamish Village Notice of Application Project Details (PDF) Opens a New Window. - Microsoft Refresh Whatcom Village Notice of Application Project Details (PDF) Opens a New Window. - Microsoft Refresh Washington Notice of Application Project Details (PDF) Opens a New Window. - Microsoft Refresh Garage Notice of Application Project Details (PDF) Opens a New Window. Design Review Board - Washington Village - DRB Agenda (PDF) - Microsoft Refresh Whatcom Village, Bldg R (207), Site/ Garage Landscaping - DRB Agenda (PDF) - Pre-Application Microsoft Refresh Site Landscaping - DRB Agenda (PDF) Opens in New Window - Pre-Application Microsoft Refresh - Jewel - DRB Agenda (PDF) Opens in New Window - Sammamish Village MLUE - DRB Agenda (PDF) Opens a New Window. - Chelan Village MLUE - DRB Agenda (PDF) Opens a New Window. - Chelan Village & Garage Portals - DRB Agenda (PDF) Opens a New Window. - Sammamish Village - DRB Agenda (PDF) Opens a New Window. - Washington Village - Bridge Landing DRB Agenda (PDF) Opens a New Window. - Washington Village DRB Agenda (PDF) Opens a New Window. - Whatcom Village DRB Agenda (PDF) Opens a New Window. - Pre-Application Microsoft Refresh DRB Agenda (PDF) Opens a New Window. - Pre- Application Microsoft Refresh DRB Agenda (PDF) Opens a New Window. - Briefing Microsoft Refresh Project DRB Agenda (PDF) Opens a New Window. - Jason Lynch Deputy Director, Development ServicesPhone: 425-556-2483 Location: Microsoft East Campus, Redmond Project Phase: Permit Review and Construction Timeline: 2018 to 2025 - Traffic & Cameras View current and upcoming traffic impacts within the City of Redmond. Go to Traffic Viewer"
}