{
  "url": "https://www.almanac.com/plant/dill",
  "title": "Dill: Planting, Growing, and Harvesting Dill Weed in the Garden | The Old Farmer's Almanac",
  "text": "An Easy, Fragrant Herb That Pairs Well with Pickles and Pollinators Read Next Types - ‘Fernleaf’ dill is a compact variety that works well in containers and is not prone to bolting. - ‘Bouquet’ is a larger variety that produces a lot of seeds. - ‘Mammoth’ is another tall variety and is considered one of the best for pickling and other culinary uses, such as in potato salads, cucumber soup, and fish dishes. Gardening Products Cooking Notes Many people love to make dill pickles with their fresh dill. Learn how to make dill pickles. You can also add dill as a seasoning in countless recipes. More Like This Comments Hi, Donna. It sounds like you stored your dill seeds in egg cartons, not that you have started your dill seeds in egg cartons. Checking to see if your seeds are still good is as easy as placing ten seeds on a damp paper towel, folding it up, and placing it in a plastic bag. Put the bag in a warm spot and check after a week or so to see if any of the seeds have sprouted. If 2 out of 10 germinate, that means a germination rate of about 20%—not very good, so either plant more of them than usual or buy fresh seeds altogether. If 8 out of 10 germinate, that means 80%—not bad at all! You can likely get away with using them for another season. Hi, Jolie, The drenching rain you cite probably did it in, causing root rot. It's likely that the soil in the pot did not drain well—and/or the pot simply was not deep enough. Most varieties of dill create long tap roots that need space to stretch out. The transplant may have suffered from being moved. Think of it: being uprooted and resettled is a traumatic readjustment for any plant (or person) and not all survive. In future, provide a deep pot, rich (composted) well-draining soil (the pot material should not make a significant difference if all else is suitable), and give it 6 to 7 hours of direct sun (indoors, give is a south- or west-facing window). Indoors in part sun, water only when soil dries out; outdoors, especially in hot environments, regular moisture is the rule."
}