{
  "url": "https://theiowacenter.org/vita/",
  "title": "Volunteer Income Tax Assistance (VITA) | Iowa Center for Economic Success",
  "text": "Volunteer Income Tax Services (VITA) Understanding and fulfilling tax obligations is the foundation of financial security and stability. The Iowa Center provides access to free income tax preparation services for qualified individuals through the Volunteer Income Tax Assistance (VITA) Program. The IRS’s VITA program offers free tax help to individuals, families, and small businesses filing on a Schedule C. VITA is available to people who generally make $69,000 or less, and provides specialized assistance for persons with disabilities, the elderly, and limited English-speaking taxpayers. The Iowa Center operates 17 VITA sites in Iowa: THE STATEWIDE IOWA VITA COALITION As leader of the Iowa VITA Coalition, The Iowa Center partners with 21 organizations to operate 82 sites across the state of Iowa. Locations: Volunteer for VITA Do you want to make a difference in our community? Volunteer to assist low-to-moderate income individuals, families and small businesses who need assistance preparing their tax returns. In addition to tax preparation, our volunteers help clients to understand their tax obligations and overcome obstacles to achieve correct, timely and complete tax filings. No experience is necessary – volunteers need to be trustworthy, have attention to detail, and a desire to make a difference. Volunteers must complete an online training provided by the IRS, pass a test based on the training, and commit to maintain the privacy and confidentiality of taxpayer information. Many of our volunteers are retired CPAs, college students, financial planners, corporate finance executives and others who enjoy working with numbers. Our busiest time of year is during tax season which runs from February 5 – April 15. But we have volunteer opportunities available year round. Sign up now to start the training process or receive more information! VITA Small Business Filing Some small businesses qualify for free tax filing through the VITA program. See the guidelines listed below to determine if you might qualify to file on a Schedule C through VITA. • Total expenses under $35,000 • Profit from business (sole proprietorship) • Business did not have a net loss • Accounting method is cash (no cash receivables, accounts payable, or inventory) • Expenses (advertising, commission and fees, health insurance*, insurance, non-mortgage rent or lease of property, repairs and maintenance) o Self-employed health insurance deduction only o Vehicle expenses (using the Standard Mileage Rate method) o Business use of cell phone • Home is not the place of business If your small business falls out of scope based on these parameters, The Iowa Center can still help you. Our Small Business Tax Services program is designed to make sure you can understand and fulfill your tax obligations."
}