{
  "url": "https://en.m.wikipedia.org/wiki/2026_Winter_Olympics",
  "title": "2026 Winter Olympics - Wikipedia",
  "text": "2026 Winter Olympics The 2026 Winter Olympics (Italian: Olimpiadi invernali del 2026), officially the XXV Winter Olympic Games and commonly known as Milano Cortina 2026, is an international multi-sport event taking place from 6 to 22 February 2026 at sites across Lombardy and Northeast Italy. A joint bid by Milan and Cortina d'Ampezzo was awarded the 2026 Winter Olympics at the 134th IOC Session on 24 June 2019, beating another joint bid made by Stockholm and Åre, Sweden. Milano Cortina 2026 will be the first Olympic Games to be officially co-hosted by two cities;[6] Milan will primarily host the ice events, and the remaining events will be hosted in clusters around Cortina and the Valtellina and Fiemme valleys. These will mark the third Winter Olympics, and the fourth Olympics overall, to be hosted by Italy; Cortina d'Ampezzo previously hosted the 1956 Winter Olympics.[7] The 2026 Games will feature the debut of ski mountaineering as a Winter Olympic event[8] and will be the first Olympic Games under the IOC presidency of Kirsty Coventry.[9] Bidding process Host city selection Milan and Cortina d'Ampezzo were selected as the host cities on 24 June 2019 at the 134th IOC Session in Lausanne, Switzerland. The three Italian IOC members, Franco Carraro, Ivo Ferriani and Giovanni Malagò, and two Swedish IOC members, Gunilla Lindberg and Stefan Holm, were ineligible to vote as stated in the Olympic Charter.[10][11][12] Development and preparations Venues The Games will primarily utilize existing venues across Lombardy and Northeast Italy, including those used by the 1956 Winter Olympics previously held in Cortina d'Ampezzo, and by the 2013 Winter Universiade hosted by the province of Trentino. Most ice events, aside from curling, will be held in the Milan cluster, while sliding and snow events will be held in clusters around Cortina, Valtellina and the Fiemme Valley. A new 12,000-seat multi-use arena designed by David Chipperfield was constructed in Milan's Santa Giulia district, which will host ice hockey.[14][15] Stadio San Siro will host the opening ceremony, while the historic Verona Arena will host the closing ceremony.[16][17] Athletes will be hosted in several Olympic villages, depending on the location of their sport; Milan Olympic Village, Cortina d'Ampezzo Olympic Village, as well as hotels.[18] Milan Cluster Cortina d'Ampezzo Cluster Valtellina Cluster Val di Fiemme Cluster Verona Speed skating venue selection During the bidding process, the bidding committee proposed that the speed skating events could be held at the existing Ice Rink Piné in Baselga di Piné. Despite the infrastructure being ready, it required a roof which impact and cost studies indicated would be costly, potentially exceeding the budget. So instead, the committee deliberated over three choices: building an ice rink in the pavilions of Fiera Milano (in a possibility to be permanent or temporary), options that would require significant structural work, or move the events to the Oval Lingotto in the city of Turin which required no structural changes.[19] The venue was constructed to host the speed skating during the 2006 Winter Olympics and after the Games, has hosted events such as exhibitions, fairs and conferences. The venue hosted the same sport in 2007 Winter Universiade. In April 2023, it was estimated that the temporary ice rink in Fiera Milano would cost nearly €20 million, which would be paid for with private funds. The proposal to use Turin's Oval Lingotto received opposition from Milan-area officials, as Turin was part of the initial stages of the project, but later withdrawn. One of the spokespersons to reject this proposal was the Milan mayor Giuseppe Sala and officials from the host regions of Lombardy and Veneto.[20] Fiera Milano was confirmed as the speed skating venue in April 2023.[21][22] Olympic torch The Olympic torch relay started on 26 November 2025 with the flame lighting in Olympia, Greece, and concludes on 6 February 2026 in Milan, Italy, coinciding with the opening ceremony at Stadio San Siro. Along with the 13 regional units and seven regions in Greece, the flame is scheduled to visit the 110 provinces of Italy, making 60 stops over 63 days across 12,000 kilometres (7,500 mi).[23] The Olympic torch was presented in a simultaneous event held in Milan, Italy and Osaka, Japan. It was revealed at the Triennale di Milano and at the Italian pavilion at Expo 2025 as a way of connecting the two twin cities, as Milan previously hosted Expo 2015.[24][25][26] The torch is light blue whereas the corresponding Paralympic torch is bronze.[27] Named \"Essential\"; developed by Eni and its subsidiary Versalis, designed by Studio Carlo Ratti Associati and produced in Italy by Cavagna Group, the torches are made primarily of an alloy of recycled aluminium and bronze. They run bio-LPG, a fuel made from renewable materials, produced at the Enilive biorefinery in Gela, and have been designed to be refilled up to ten times in order to cut down on the number of torches produced.[28] Following the lighting of the Olympic flame in Olympia, a handover ceremony happened in Athens on 4 December 2025,[29] where the flame then arrived in Rome to visit all 110 provinces of Italy, making 60 stops over 63 days across 12,000 kilometres (7,500 mi) and involving 10,001 torchbearers.[23][30] The torch will be in Naples for Christmas, in Bari for New Year's Eve, and in Cortina d'Ampezzo on 26 January to commemorate 70th anniversary since it hosted the 1956 Winter Olympics.[23] While the torch is in Piedmont, a tribute is planned for skier Matilde Lorenzi, who died while training in October 2024.[31] The torch relay plans to visit every World Heritage Site in the country.[32] On 29 November 2024, Italian comedy trio Gli Autogol were announced as official narrators for the torch relay.[33] Medals On 15 July 2025, the official medals of the Games were unveiled in Venice, designed as two halves that symbolise the culmination of an athlete and Para athlete’s journey and of all those who have walked beside them along the way, it was created by the Istituto Poligrafico e Zecca dello Stato (IPZS).[34][35] The medals featured an essential design that places emotion and teamwork at its core, they had the traditional Olympic five-ring symbol on one side, with an inscription on the reverse that details the event and commemorates the venue.[36][37] The Games Opening ceremony The opening ceremony will be held on 6 February 2026 at Stadio San Siro in Milan, titled \"Armonia\" (Harmony).[38] The ceremony will be produced by Banijay Live (Balich Wonder Studio). Marco Balich, Creative Lead of the Opening Ceremony, explained that the word harmony derives from Ancient Greek: \"It means 'bringing together' in musical terms, different elements.\"[39] The opening ceremony will also feature special performances from American singer Mariah Carey[40][41][42] and Italian artists Laura Pausini and Andrea Bocelli.[43][44] Sports The 2026 Winter Olympics are scheduled to feature 116 medal events in 16 disciplines, an increase of seven events and one discipline over Beijing 2022. New medal events will include men's and women's dual moguls in freestyle skiing, the return of the men's and women's doubles in luge (replacing the open doubles event), men's and women's team alpine combined, women's large hill individual in ski jumping, and mixed relay team in skeleton. The Games will have the highest percentage of women's participation in Winter Olympic history, at 47%.[45][46] Nordic combined remains the only sport in which only men compete. The alpine mixed team parallel event has been dropped. Alpine combined will switch from an individual format to two-person teams; the event had seen diminishing participation due to evolving technical and training requirements, and had been dropped from the FIS Alpine Ski World Cup circuit in 2020.[47][48][49] Team ski jumping and Nordic combined will also switch to two-person teams, with the latter adopting a large hill / 2×7.5 km (4.7 mi) course.[46] For the first time, women will race the same distances as men in cross-country skiing.[46] At the 138th IOC Session on 20 July 2021, the IOC approved a proposal by the organising committee to add ski mountaineering as a debuting optional sport.[50] It will consist of three medal events: men's sprint, women's sprint, and mixed relay.[51] On 2 February 2024, the International Ice Hockey Federation (IIHF) announced that an agreement had been reached with the National Hockey League (NHL) for a break in its regular season to allow the league's players to participate in the Olympics for the first time since 2014. The NHL was originally scheduled to compete in 2022 as well but opted out due to the COVID-19 pandemic.[52] Numbers in parentheses indicate the number of medal events contested in each discipline. - Alpine skiing (10) ( ) - Biathlon (11) ( ) - Bobsleigh (4) ( ) - Cross-country skiing (12) ( ) - Curling (3) ( ) - Figure skating (5) ( ) - Freestyle skiing (15) ( ) - Ice hockey (2) ( ) - Luge (5) ( ) - Nordic combined (3) ( ) - Short-track speed skating (9) ( ) - Skeleton (3) ( ) - Ski jumping (6) ( ) - Ski mountaineering (3) ( ) - Snowboarding (11) ( ) - Speed skating (14) ( ) Closing ceremony The closing ceremony will be held at the Verona Arena on 22 February 2026, entitled \"Beauty in Action\".[53] Along the cultural segments the ceremony will feature the closing remarks, and the formal handover to the French Alps as the host region of the 2030 Winter Olympics[54] The first name confirmed to perform at the closing ceremony was the world-renowned ballet dancer Roberto Bolle, the principal dancer at La Scala Theatre Ballet. He and director Alfredo Accatino have previously worked together on the 2006 Winter Olympics opening ceremony.[55] Participating National Olympic Committees The following 92 National Olympic Committees and the Independent Olympic Athletes have qualified athletes. The Olympic Committees of Russia and Belarus remain suspended for violating the Olympic Truce due to the 2022 Russian invasion of Ukraine. As with the 2024 Summer Olympics in Paris, individual Russian and Belarusian athletes at the 2026 Games may compete as \"Individual Neutral Athletes\" (AIN) without national identification.[56][57] Individual neutral athletes have to be approved by each sport's international federation, and then the IOC's panel.[58] As individual athletes, AIN is not considered a delegation during the opening ceremony or in the medal tables.[59] International federations that are allowing Russian and Belarusian athletes to compete under the Individual Neutral Athlete banner include the International Skating Union (ISU) for the various skating events[58] and the International Ski Mountaineering Federation (ISMF) for the ski mountaineering events.[60] In all, 20 athletes (13 from Russia and 8 from Belarus) would compete at the Games in alpine skiing, cross-country skiing, figure skating, freestyle skiing, luge, short-track speed skating, ski mountaineering and speed skating.[61] Russian and Belarusian athletes are not allowed to compete in team events like ice hockey and curling, since the IOC has ruled that \"a group of Individual Neutral Athletes cannot be considered a team\".[56] Other NOCs have had at least one male or female competitor meet the minimum alpine skiing and cross-country skiing requirements.[62][63] Benin, Guinea-Bissau and the United Arab Emirates are expected to make their Winter Olympics debuts.[64] Number of athletes by National Olympic Committee Calendar The first version of the schedule was released in March 2024. Competitions start two days before the opening ceremony on 4 February with the mixed doubles event on curling, and end on 22 February 2026 with the men's ice hockey tournament final.[65] The second version of the schedule was released in December 2024.[66] - All times and dates use Central European Time (UTC+1) Marketing Emblem For the first time, the emblem of an Olympic Games was determined via a public vote. On 6 March 2021 during the 2021 edition of Sanremo Music Festival finals, two candidate designs titled \"Dado\" and \"Futura\" were unveiled by former Italian Olympic gold medallists Federica Pellegrini and Alberto Tomba. They were both designed by Landor Associates.[67][68] On 30 March 2021, \"Futura\" was announced as the winning emblem.[69][70] The emblem consists of a stylized \"26\" written in a single stroke, representing the impact of \"small gestures\", and \"sport, solidarity, and sustainability\".[71] Slogan The Games' official slogan, \"IT's Your Vibe\", was announced on 23 February 2025; it uses \"IT\" as both an abbreviation for Italy (i.e. \"[Italy's] Your Vibe\") and as the contraction \"It's\", with variants of the slogan used in other contexts to reflect upon the Games and its host country.[72][73] Mascot An online vote closing on 28 February 2023 was held among a list of candidates to select the two mascots of the event. The winning candidates, designed by the students of a school in Taverna and inspired by stoats,[74] were presented during the second night of the Sanremo Music Festival 2024 on 7 February 2024.[75] Their names were revealed to be Tina and Milo (derived from the names of the host cities), and are portrayed as sister and brother.[76][77][78] The choice of stoats has been explained as being due to these animals' embodiment of \"the contemporary Italian spirit\" of curiosity, ability to change according to the seasons, and capacity of adaptation to challenging habitats.[77][78] The two main mascots are additionally accompanied by six snowdrop flowers, called \"The Flo\".[79] Milo, a brown stoat, and Tina, a white stoat, are brother and sister \"born in the mountains of Italy\", who \"decided to move to the city\". Tina, the main Olympic mascot, symbolises art, music, and the transformative force of beauty. Milo, the Paralympic mascot, was born without a leg but uses his tail to help him to take a normal life with some ingenuity, willpower, and creativity.[77] Theme song During the Sanremo Music Festival 2022 finals, the two final candidates for the official anthem of the event were presented, with a poll opening afterward. On 7 March 2022, \"Fino all'alba\" (\"Until the dawn\")—composed by the youth music group La Cittadina of the San Pietro Martire in Seveso, and performed during Sanremo by Arisa—was announced as the winner.[80] Broadcasting rights In Italy, domestic pay-TV rights are owned by Warner Bros. Discovery,[32] with free-to-air coverage and digital rights owned by RAI under a sublicense agreement with the European Broadcasting Union.[81] On 16 January 2023, the IOC announced that it had renewed its European broadcast rights agreement with Warner Bros. Discovery Sports to last from 2026 through to 2032. The contract covers pay television and streaming rights to the Summer, Winter, and Youth Olympics on Eurosport and Discovery+ in 49 European territories.[32] Unlike the previous contract where corporate precursor Discovery, Inc. was responsible for sublicensing them to broadcasters in each country,[82][83] free-to-air rights packages were concurrently awarded to the EBU and its members to cover at least 100 hours of each Winter Olympics.[32] EBU member RAI then signed a sublicensing deal for Italian free-to-air TV and digital rights.[81] Concerns and controversies Corruption allegations and scandals On 21 May 2024, the Guardia di Finanza raided the offices of Fondazione Milano Cortina 2026, Quibyt and Deloitte for irregularities over the selection of certain sponsors, such as bid-rigging, irregular payments and uncertain validity over relationships between the Fondazione officials.[84] The investigations mainly concern Deloitte and accusations of corruption and bid-rigging against three people.[85][86] In July 2025, the Prosecutor's Office of Milan started an investigation into alleged corruption regarding the public works tender for the Milan Olympic Village. 74 individuals were identified, with offences of corruption, forgery, or abuse of public offices.[87] According to reports by the media, the accused boasted of their friendship with Fabrizio Piscitelli, former leader of the Irriducibili, who was murdered in a Rome park in 2019. Their reputation in football's violent circles helped them present themselves as influential figures within Rome's criminal underworld.[88] The investigation, disclosed by the Venice prosecutor's office, details how two brothers from Rome, linked to Lazio's ultra mafia group known as the Irriducibili, were arrested after trying to illegally obtain contracts related to Olympic construction works.[89] In November 2025, the Italian Government's so-called[clarification needed] 'Olympics rescue decree', which classified the organizing foundation of the upcoming Winter Games as a private entity, has been referred to the Constitutional Court of Italy in a motion led by the Milan Prosecutor's Office to assess its constitutional legitimacy. The Milan Court has raised concerns about the constitutionality of a recent government decree intended to shield the Milano Cortina Foundation from investigations into alleged bid rigging and corruption scandals.[90][91] Infrastructural and venue issues Sliding sports venue During the bidding process, the Italian government proposed to restore the Eugenio Monti Olympic Track in Cortina (used during the 1956 Winter Olympics), to be relaunched as a federal centre also for sledding and skeleton, despite opposition from the International Olympic Committee. The project has received criticism from environmental groups due to the planned felling of 20,000 square metres (220,000 sq ft) of larch forest.[92][93] The minimum cost of restoring the closed track was initially estimated at €14 million, while in the official Milan-Cortina bid dossier the cost indicated was €100 million (similar budget needed to build the Cesana Pariol track used at the 2006 Winter Olympics).[94] After initially forecasting an expenditure of €40–50 million, the Veneto Region allocated funding up to €85 million to build the new Olympic venues. An annual expenditure of €400,000 was also planned for the management of the facility, which would be open four months a year, to be settled through the establishment of €8 million fund.[95] Due to the rising cost of construction materials, the Veneto region president Luca Zaia said in February 2023 that the restoring cost for the Eugenio Monti track could be upwards of €120 million.[96] Calling for tenders to award the work, no company came forward with a bid by the 31 July 2023 deadline;[97] even after that, no company interested in carrying out the work could be found, both for economic reasons and because of the difficulty to complete all works before the start of the Olympics.[98] Due to critical issues, costs and prohibitive times for the total renovation of Cortina track, the mayor of Innsbruck, Austria, made a proposal for the use of the Igls Olympic Sliding Centre in Innsbruck.[99] On 16 October 2023 the Italian National Olympic Committee (CONI) announced that the track will not be rebuilt to host the 2026 Olympic Winter Games, and the sliding events could be held outside of Italy.[100][101] However, the current Italian government wanted the sliding events to remain in Italy, so they studied the possibility of revamping the Cesana Pariol track which hosted the events at the 2006 Winter Olympics, which has been dormant since 2011.[102] Since then, several construction companies have submitted bids to study a potential reconstruction of the Eugenio Monti track.[103] A bid was won to build a new sliding track (Cortina Sliding Centre) instead of rebuilding the Eugenio Monti track, which was demolished.[104] Despite concerns about the new track not being ready on time, it was confirmed in September 2024 that the new Eugenio Monti track was on schedule, and that homologation of the track was expected by March 2025.[105] From 24 to 28 March 2025, the venue's first tests were held.[106][107] Mt. Van Hoevenberg Olympic Bobsled Run in Lake Placid, United States, has been selected as the back-up venue for the sliding events.[108] Venues in Austria (Olympic Sliding Centre Innsbruck in Igls) and Switzerland (St. Moritz-Celerina Olympic Bobrun in St. Moritz) were previously discussed as back-up sites.[109][110] In late 2025, international training periods were planned by the International Bobsleigh and Skeleton Federation (IBSF) and the International Luge Federation (FIL) to allow all internationally competing athletes to learn and train on the new track well ahead of the Olympic Games. Luge athletes were expected to begin this training on 27 October 2025.[46] Bobsleigh and skeleton athletes had a planned training block from 7 to 16 November, immediately followed by the opening week of the Bobsleigh World Cup, where further training and official racing took place from 17 to 23 November.[111] The athletes were scheduled to return to Cortina in the days leading up to the 2026 Games for a final training period prior to the start of the Olympic competition.[111] Ice hockey venue delays The construction of the main ice hockey venue, Milano Santa Giulia Ice Hockey Arena, has faced notable delays and concerns over rink size, leading to criticism from the NHL.[112] IIHF president Luc Tardif announced in January 2026 that the stands would not be completed on time, leading to reduced capacity, but assured that the rink and player facilities would be ready.[113][114] At the end of January, organisers admitted that the venue was not going to be fully complete in time, despite the IOC's Games executive director, Christophe Dubi, saying it was \"absolutely certain\" it would be ready.[115] Security concerns Trial for the death of a security guard During the night between 7 and 8 January 2026, security guard Pietro Zantonini was found dead from exposure near the arena construction site in Cortina, while he was in services for the Olympic organisation.[116] The Belluno Public Prosecutor's Office has opened an investigation into the worker's working conditions by Ss Security&Bodyguard.[117] No-fly zones and several threats U.S. and Italian security teams have flagged the risk of \"lone actor\" drone attacks, similar to those seen in recent global conflicts. No-fly zones are strictly enforced over all venues. Researchers (such as Palo Alto Networks) have warned of state-sponsored \"killware\" and phishing campaigns targeting ticketing systems and athletes' personal data.[118] While no specific Winter Olympic athlete has reported a death threat this week, confusion may stem from the Winter Spine Race (a separate ultra-marathon taking place now), where humanitarian and runner Sarah Porter was recently forced to withdraw following credible death threats from Afghanistan.[119] Presence of US ICE security officers On 17 January 2026, the second Trump administration confirmed that the U.S. Department of State's Diplomatic Security Service (DSS) would deploy United States Immigration and Customs Enforcement (ICE)'s Homeland Security Investigations division \"to vet and mitigate risks from transnational criminal organisations\". ICE was similarly involved in past major sports events \"as part of international partnerships related to human trafficking and drug trafficking\".[120][121][122] On 24 January 2026, according to Italian newspaper Il Fatto Quotidiano, ICE agents were already permanently stationed at the U.S. Embassy in Rome.[123] The news sparked protests from both Italian citizens and opposition parties to the right-wing-to-far-right majority party Fratelli d'Italia accusing it of favoring the introduction of foreign military forces that use \"brutal and inhumane methods\" against the population.[124][125][126][127][120] The event was also supported by the Minnesota general strike and riots against the conservative party's policy, following the killing of American citizens Renee Good and Alex Pretti by ICE agents in the same days.[128] During the protests Italian state broadcaster RAI aired a video of ICE agents threatening to break the window of the vehicle its crew were using to report in Minneapolis.[129][130][127] The Italian minister of the interior Matteo Piantedosi, regarding the alleged presence of the forces, stated that \"We are not aware of this, but foreign delegations choose whom to turn to in order to ensure their own security. I don't see what the problem is. Security coordination remains the responsibility of the national authorities.\" The Department of Homeland Security (DHS) stated that \"all security operations remain under Italian authority\" and \"ICE does not conduct immigration enforcement operations in foreign countries\".[120][131] A petition campaign to prevent agents from entering Italian territory has been launched on Change.org.[132] U.S. Olympic officials announced they would change the name of their assigned hospitality space from \"Ice House\" to the \"Winter House\" to avoid a reference to the agency.[133] Diplomatic boycotts Latvian boycott of Russian and Belarusian athletes Latvian Public Media, which is a part of the Public Broadcasting of Latvia, announced it would not cover the participation of athletes from Russia and Belarus (competing as Individual Neutral Athletes, or AIN), including their individual events. Instead, live broadcasts will feature advertisements, interviews with Latvian athletes, or other content.[134] Tom Circenis, the TV3 Group's director of sports programming, confirmed that channels would insert commercial breaks during Russian and Belarusian athletes' performances, describing this as an editorial decision coordinated with the Latvian Olympic Committee. This policy constitutes a boycott in response to the participation of neutral athletes from \"aggressor countries.\"[135] See also - 2026 Winter Paralympics - Olympic Games held in Italy - 1956 Winter Olympics – Cortina D'Ampezzo - 1960 Summer Olympics – Rome - 2006 Winter Olympics – Turin - 2026 Winter Olympics – Milan and Cortina D'Ampezzo - List of IOC country codes - 2026 Summer Youth Olympics – Multi-sport event in Dakar, Senegal Notes - ^ Only an English motto will be used during the Games. There is no Italian equivalent of the motto adopted.[1] - ^ Named \"Milano San Siro Olympic Stadium\" during the Games.[4] - ^ Named \"Verona Olympic Arena\" during the Games.[5] - ^ Individual Belarusian and Russian athletes will compete as Individual Neutral Athletes, due to the Russian invasion of Ukraine that began in 2022. - ^ Belarusian athletes will compete as Individual Neutral Athletes, due to Belarus's involvement in Russia's invasion of Ukraine that began in 2022. - ^ Russian athletes will compete as Individual Neutral Athletes, due to the country's invasion of Ukraine that began in 2022. References - ^ \"IT's Your Vibe: the motto of Milano Cortina 2026\". Milano Cortina 2026. International Olympic Committee. Archived from the original on 23 February 2025. Retrieved 20 February 2025. - ^ \"Mattarella to open Milan-Cortina Games\". Agenzia Nazionale Stampa Associata. 16 October 2025. Archived from the original on 28 October 2025. Retrieved 16 October 2025. - ^ \"Italy's president to declare 2026 Games open\". Inside the Games. 20 October 2025. Archived from the original on 27 October 2025. - ^ \"Milano San Siro Olympic Stadium\". olympics.com. Archived from the original on 28 October 2025. Retrieved 27 October 2025. - ^ \"Verona Olympic Arena\". olympics.com. Archived from the original on 28 October 2025. Retrieved 27 October 2025. - ^ \"How Italy will pull off the Olympics in two cities more than 250 miles apart\". NBC News. 29 October 2025. Archived from the original on 29 October 2025. - ^ Longman, Jeré (24 June 2019). \"Italy Is Chosen to Host 2026 Winter Olympics\". The New York Times. Archived from the original on 24 June 2019. Retrieved 9 February 2020. - ^ Merrell, Chloe (20 July 2021). \"Milano Cortina 2026: Ski Mountaineering to debut\". Olympics.com. Archived from the original on 29 July 2024. Retrieved 7 November 2025. - ^ Erba, Iacopo (18 September 2025). \"\"L'Italia ha tutto per affascinare il mondo\": la presidente del Cio Kirsty Coventry promuove i Giochi diffusi e guarda al futuro olimpico\". Eurosport (in Italian). Archived from the original on 16 December 2025. - ^ \"Lausanne To Host Vote For Winning 2026 Winter Olympic Bid Instead of Milan After Italy Enters Race\". GamesBids.com. 20 September 2018. Archived from the original on 24 April 2020. Retrieved 21 September 2018. - ^ \"IOC To Move Up 2026 Olympic Bid Vote Three Months, Now June 2019\". GamesBids.com. 9 October 2018. Archived from the original on 24 April 2020. Retrieved 9 October 2018. - ^ \"Winter Olympics: Italy's Milan-Cortina bid chosen as host for the 2026 Games\". BBC Sport. 24 June 2019. Archived from the original on 10 September 2019. Retrieved 24 June 2019. - ^ a b \"Milan-Cortina awarded the Olympic Winter Games 2026\". olympic.org. IOC. 24 June 2019. Archived from the original on 21 September 2019. Retrieved 25 June 2019. - ^ \"Piling work to start on ice hockey venue for Milan Cortina 2026\". Inside the Games. 4 June 2023. Archived from the original on 20 July 2024. Retrieved 30 January 2025. - ^ \"David Chipperfield Architects unveils Winter Olympics arena in Milan\". 11 March 2022. Archived from the original on 11 March 2022. - ^ \"2026 opening ceremony set for San Siro stadium\". ESPN.com. 29 October 2021. Archived from the original on 29 October 2021. Retrieved 30 January 2025. - ^ \"Verona Arena undergoes renovation\". Inside the Games. 16 August 2025. Archived from the original on 5 September 2025. - ^ \"The Olympic and Paralympic Villages\". Olympics.com. Archived from the original on 2 February 2026. Retrieved 2 February 2026. - ^ Ridley, Bob (19 April 2023). \"Fiera Milano Rho To Be New Home for Speed Skating at 2026 Winter Olympics\". The Stadium Business. Archived from the original on 19 April 2023. Retrieved 19 April 2023. - ^ \"Bach to meet Italian PM as Milan Cortina 2026 speed skating venue due to be ratified\". Inside the Games. 14 April 2023. Archived from the original on 17 April 2023. - ^ Rowbottom, MIke (19 April 2023). \"Milan The Unanimous Choice for Speed Skating at 2026 Winter Olympics\". Inside the Games. Archived from the original on 19 April 2023. Retrieved 19 April 2023. - ^ Ridley, Bob (19 April 2023). \"Fiera Milano Rho To Be New Home for Speed Skating at 2026 Winter Olympics\". The Stadium Business. Archived from the original on 19 April 2023. Retrieved 19 April 2023. - ^ a b c \"Milano Cortina 2026 unveils \"Greatest Journey\" as Olympic Torch Relay route announced\". olympics.com. International Olympic Committee. 26 November 2024. Archived from the original on 27 November 2024. Retrieved 14 April 2025. - ^ \"Milano Cortina 2026 Olympic Torch at Expo 2025 Osaka\". Milano Cortina 2026. International Olympic Committee. 12 July 2024. Archived from the original on 26 July 2024. Retrieved 28 November 2024. - ^ \"Al via il viaggio della fiamma olimpica di Milano Cortina\". ansa.it (in Italian). Agenzia Nazionale Stampa Associata. 26 November 2024. Archived from the original on 28 November 2024. Retrieved 28 November 2024. - ^ \"Milano Cortina 2026 and the Olympic Torch: A journey without equal\". Inside the Games. 27 November 2024. Archived from the original on 27 November 2024. Retrieved 3 February 2025. - ^ \"Winter Olympics torch unveiled in joint ceremony in Milan and Osaka\". France 24. Agence France-Presse. 14 April 2025. Archived from the original on 14 April 2025. Retrieved 14 April 2025. - ^ \"Innovation and sustainability at the heart of the torches of the Olympic and Paralympic Winter Games Milano Cortina 2026\". olympics.com. International Olympic Committee. 14 April 2025. Archived from the original on 14 April 2025. Retrieved 14 April 2025. - ^ \"Torch for the Milano Winter Games lit in low-key indoor ceremony\". Reuters. 26 November 2025. Archived from the original on 26 November 2025. - ^ \"The Greatest Journey\". Milano Cortina 2026. International Olympic Committee. Archived from the original on 3 December 2024. Retrieved 28 November 2024. - ^ Matar, Daniella (26 November 2024). \"Olympic flame for 2026 Milan-Cortina Games will go on 63-day journey across Italy\". AP News. Archived from the original on 2 December 2024. Retrieved 28 November 2024. - ^ a b c d Roxborough, Scott (16 January 2023). \"Warner Bros. Discovery, European Broadcasting Union Secure Olympics Rights in Europe Through 2032\". The Hollywood Reporter. Archived from the original on 16 January 2023. Retrieved 8 February 2023. - ^ \"Gli Autogol racconteranno il Viaggio della Fiamma\". Milano Cortina 2026 (in Italian). International Olympic Committee. 29 November 2024. Archived from the original on 2 December 2024. Retrieved 29 November 2024. - ^ \"Milano Cortina 2026 reveals medals for next year's Olympic and Paralympic Winter Games\". olympics.com. International Olympic Committee. 15 July 2025. Archived from the original on 26 July 2025. Retrieved 15 July 2025. - ^ \"Milano Cortina unveil striking medals\". Inside the Games. 16 July 2025. Archived from the original on 16 July 2025. - ^ \"A medal-worthy legacy: How the Milan Cortina 2026 medals honor and reinvent Olympic history\". nbcolympics.com. NBC Sports. 17 July 2025. Archived from the original on 19 July 2025. Retrieved 18 July 2025. - ^ \"Italy showcases medals for 2026 Winter Games\". Reuters. 15 July 2025. Archived from the original on 2 September 2025. - ^ \"Harmony (Armonia): the vision that will unite the Opening Ceremony of the Olympic Winter Games Milano Cortina 2026\". olympics.com. International Olympic Committee. 17 October 2025. Archived from the original on 28 October 2025. - ^ \"Harmony (Armonia): the vision that will unite the Opening Ceremony of the Olympic Winter Games Milano Cortina 2026\". Milan-Cortina 2026. 16 October 2025. Archived from the original on 14 January 2026. - ^ \"Mariah Carey, announced as a first music icon of the Milano Cortina 2026 Winter Olympic Games Opening Ceremony\". Milan-Cortina 2026. 15 December 2025. Archived from the original on 16 December 2025. - ^ Sian, Millie (15 December 2025). \"Carey to sing at Winter Olympics opening ceremony\". BBC Sport. Archived from the original on 16 December 2025. Retrieved 15 December 2025. - ^ Dampf, Andrew (15 December 2025). \"All I want for Christmas is the Olympics. Mariah Carey to perform at Milan Cortina opening ceremony\". AP News. Archived from the original on 16 December 2025. Retrieved 15 December 2025. - ^ \"Laura Pausini will appear at the Opening Ceremony of the Milano Cortina 2026 Olympic Winter Games\". Milan-Cortina 2026. 2 January 2026. Archived from the original on 13 January 2026. - ^ \"Maestro Andrea Bocelli to perform at the Opening Ceremony of the Olympic Winter Games Milano Cortina 2026\". Milan-Cortina 2026. 11 January 2026. Archived from the original on 13 January 2026. - ^ \"Milano Cortina 2026 set to become the most gender-balanced Olympic Winter Games in history\". olympics.com. International Olympic Committee. Archived from the original on 28 June 2022. Retrieved 24 June 2022. - ^ a b c d \"Alpine skiing combined to become team event for Milan Cortina 2026\". Inside the Games. 20 June 2023. Archived from the original on 20 July 2024. Retrieved 31 January 2025. - ^ \"Alpine combined to be team event at '26 Games\". ESPN.com. 21 June 2023. Archived from the original on 21 June 2023. Retrieved 31 January 2025. - ^ Sheinin, Dave (10 February 2022). \"The end of the combined? Alpine officials contemplate the future of the event\". The Washington Post. Archived from the original on 10 February 2022. Retrieved 31 January 2025. - ^ \"Alpine Combined To Become Team Event At 2026 Games\". snowindustrynews.com. Archived from the original on 9 July 2023. Retrieved 9 July 2023. - ^ Mather, Victor (19 February 2022). \"What's new for the next Winter Olympics? Ski mountaineering\". The New York Times. ISSN 0362-4331. Archived from the original on 19 February 2022. Retrieved 3 February 2025. - ^ Sharma, Hritika (21 July 2021). \"Ski mountaineering added to 2026 Winter Olympic program\". Infobae. Archived from the original on 9 January 2022. Retrieved 22 July 2021. - ^ Lev, Jacob (2 February 2024). \"NHL players to return to Olympics in 2026 and 2030\". CNN. Archived from the original on 2 June 2025. Retrieved 3 February 2024. - ^ \"Closing Ceremony of the Milano Cortina 2026 Olympic Winter Games to Be a Tribute to \"Beauty in Action\"\". Milan Cortina 2026. 6 November 2025. Archived from the original on 14 November 2025. - ^ \"Verona's Roman Arena to host Winter Games closing ceremony\". Reuters. 6 November 2025. Archived from the original on 14 November 2025. - ^ \"Ballet star Roberto Bolle will headline 2026 Winter Olympics closing ceremony in Verona\". AP News. 6 November 2025. Archived from the original on 14 November 2025. - ^ a b \"Russian teams remain banned from competing at 2026 Winter Games\". Reuters. 27 May 2025. Archived from the original on 28 May 2025. Retrieved 21 June 2025. - ^ \"Individual Neutral Athletes to compete at Milano Cortina 2026 Olympic Winter Games under same conditions as for Paris 2024\". International Olympic Committee. 19 September 2025. Archived from the original on 13 January 2026. - ^ a b Agence France-Presse (20 December 2024). \"Russian Skaters Allowed to Compete as Neutrals in 2026 Winter Olympics\". The Moscow Times. Archived from the original on 20 December 2024. Retrieved 22 December 2024. - ^ Daffunchio Picazo, Raúl (5 March 2024). \"Paris 2024: Flag, anthem and rules for Individual Neutral Athletes approved\". Inside the Games. Archived from the original on 19 March 2024. Retrieved 20 March 2024. - ^ Carro, Javier (30 December 2024). \"Five Russian athletes authorised to compete internationally\". Inside the Games. Archived from the original on 11 January 2025. Retrieved 3 June 2025. - ^ \"ЦСП опубликовал итоговый список россиян, которые выступят на Олимпиаде\". РБК (in Russian). 28 January 2026. Retrieved 28 January 2026. - ^ \"Qualification System for Alpine Skiing\" (PDF). Olympics.com. IOC. Archived (PDF) from the original on 9 December 2023. Retrieved 24 August 2024. - ^ \"Qualification System for XXV Olympic Winter Games, Milano Cortina 2026\" (PDF). Olympics.com. International Ski Federation (FIS). 21 June 2024. Archived (PDF) from the original on 9 December 2023. Retrieved 12 February 2025. - ^ \"'I love making UAE proud': Inspirational Emiratis take home 16 medals at Special Winter Olympics\". The National News. 17 March 2025. Archived from the original on 17 March 2025. - ^ \"Competition Schedule V.5 (by session)\" (PDF). Milano Cortina 2026. Milano-Cortina Organising Committee for the 2026 Olympic and Paralympic Winter Games. 13 March 2024. Archived (PDF) from the original on 16 July 2024. Retrieved 10 September 2024. - ^ \"Milano Cortina 2026: Full test events calendar\". Inside the Games. 28 December 2024. Archived from the original on 28 December 2024. - ^ \"Dal festival di Sanremo Pellegrini e Tomba lanciano 'Dado' o 'Futura', loghi di Milano-Cortina 2026\". la Repubblica (in Italian). 6 March 2021. Archived from the original on 16 January 2023. Retrieved 21 March 2021. - ^ \"Milano Cortina 2026 Launch Online Vote to Decide Emblem\". International Olympic Committee. 9 March 2021. Archived from the original on 10 March 2021. Retrieved 21 March 2021. - ^ Primavera, Erika (7 March 2021). \"Olimpiadi 2026, 'Dado' o 'Futura': ecco il loghi per Milano Cortina\" (in Italian). Rome. DIRE. Archived from the original on 16 January 2023. Retrieved 21 March 2021. - ^ \"Milano Cortina 2026, i nuovi simboli. E' 'Futura' il logo scelto, bianco per le olimpiadi, colorato per le paralimpiadi – Sport\". Agenzia ANSA (in Italian). 30 March 2021. Archived from the original on 16 January 2023. Retrieved 30 March 2021. - ^ \"Milan Cortina 2026 unveil \"Futura\" design as Winter Olympic and Paralympic logo\". inside"
}