{
  "url": "https://dictionary.cambridge.org/dictionary/english/produce",
  "title": "PRODUCE | English meaning - Cambridge Dictionary",
  "text": "produce verb [T] (MAKE) She works for a company that produces (= makes for sale) electrical goods. - makeCan I make you a cup of coffee? - produceCalifornia produces a lot of grapes. - createLeonardo da Vinci created the masterpiece we know as \"Mona Lisa\". - inventAlexander Graham Bell is credited with inventing the telephone. - developThey are working to develop the next generation of underwater vehicles. - manufactureThe car is manufactured in Germany. - buildThe house was built in the 1950s. - constructThe company wants to construct a 175-mile pipeline. - put something upPutting up a wall will not solve the problem. - erectIt's unlawful to erect a building until you get approval. - assembleHe has a job assembling furniture in a warehouse. - put togetherWithout the instruction sheet, I've got no idea how to put all these parts together. - Plutonium is a fuel used to produce nuclear energy. - $4 million worth of souvenirs and gift items have been produced for the event. - The meat produced from a pig is called pork, bacon, or ham. - The government has produced a series of leaflets designed to extend public awareness of the dangers of AIDS. - New York City produces 10500 tons of residential waste each day. - anti-creative - artefact - attribute - attribute something to someone phrasal verb - bang something out phrasal verb - crank - formation - fructify - generate electricity - generative - generativity - grind - reforge - reissue - remake - rig something up phrasal verb - roll (something) out phrasal verb - scare - stitch - toss You can also find related words, phrases, and synonyms in the topics: produce verb [T] (CAUSE) produce verb [T] (FILM/MUSIC) Compare to be in charge of making a musical recording and to be responsible for the arrangement of the music, the combination of the different instruments or voices and the general sound of it - acquire - acquisition - armourer - aspect ratio - auteur - dolly - executive producer - filmmaker - filmmaking - fog machine - framing - principal photography - production designer - prop - recut - rehearsal - rehearse - reshoot - restage - staging You can also find related words, phrases, and synonyms in the topics: produce verb [T] (BRING OUT) - The company produced receipts in substantiation of its claim. - He opened his suitcase and produced a large box of chocolates."
}