{
  "url": "https://www.loacker.com/int/en/about-us/the-story-of-a-family/our-history.html",
  "title": "Our history | Loacker",
  "text": "We have a lot to tell! Let’s begin with how our story began many years ago. As the saying goes: A big dream is essential if you want to shape the future. Alfons Loacker had a dream, and in 1925 he made it come true when he bought the pastry shop in Bolzano where he had worked ever since he was a boy. It was he who created the first \"Bolzano wafer\", a scrumptious delight, crisp and thin, filled with the most luscious creams. Alfons’s pastry-making skills, using ingredients he himself selected, were an instant hit and the business slowly but steadily began to grow. Armin Loacker had a diploma as a pastry chef, had gained some experience abroad and a strong desire to make his own contribution to the family business. In 1958 he joined the company as a production manager. Ten years later, he was joined by his sister Christine, who brought her visionary approach to bear as head of administration and distribution. The purchase of the first automated oven for wafers boosted production exponentially and export began to grow thanks to the new stay-fresh packaging. The new arched cooling system and other smart ideas made the Loacker pastry business one of the most important in Alto Adige/Südtirol. In 1974 the bakery was moved up to Renon, in Auna di Sotto, a thousand metres above sea level. The winding Alpine road with hairpin bends complicated matters but Armin said that the best things are made where the air is fresh and pure, the water crystal clear, and where the view of the Sciliar/Schlern uplifts the spirit. Shortly after, the goodness and superb taste and quality of Loacker ventured beyond the borders of South Tyrol and then out of Italy and into the world. The distribution of Loacker wafer specialties in Northern Italy began and thanks to an increasing global demand, new markets like Middle East, China or Japan opened up. Loacker's presence at important touchpoints such as airports and tourist island destinations helped to improve brand and product awareness. For the first time the Loacker Gnometti appeared in an Italian TV spot. They also helped Loacker to conquer the leadership in the Italian market. While Andreas Loacker took care of the entire development sector, Ulrich Zuenelli became the director of the sales sector as well as the president of the board of directors. Martin took charge as Chairman of the Board of LFH GmbH. When we felt the need for a new production facility, it was only natural to choose Heinfels, in East Tyrol at the entrance of an idyllic valley a thousand meters above sea level. Here, nature charms us once again with beautiful green pastures and snow-covered mountain. In short, a landscape that reflects the naturalness and genuineness of our products. A wafer made in such pristine nature is a thrill for all the senses. With the Loacker Cafés, Loacker returns to its origins being a confectionery store and patisserie back in 1925 As an innovative man with clear vision, Armin was one of the pillars of the company. His open-mindedness and pragmatism helped pave the way for the success that Loacker has achieved over the years. He has carried out great technological and product innovations, helping Loacker to become a successful international brand. \"Only if you use the best will you obtain the best\" was the motto that always accompanied his work, just as it does ours. As the sun rises over the Alps on April 3rd, 2025, we celebrate a milestone few companies reach: our 100th birthday! From humble beginnings in a small pastry shop to a global name synonymous with quality and taste, it's been an incredible journey."
}