{
  "url": "https://alaska.gov/kids/learn/facts.htm",
  "title": "Facts About Alaska, Alaska Kids' Corner, State of Alaska",
  "text": "The following is a greeting given in one of the 20 indigenous languages recognized by the State of Alaska. - Adeâ ndadz dengitâa? - Language: Deg Xinag - Translation: \"Hello, how are you?\" Facts About Alaska Facts About Alaska Mountains Of the 20 highest peaks in the United States, 17 are in Alaska. Denali, the highest peak in North America, is 20,320 ft. above sea level. Denali, the Native Alaskan name for the peak, means \"The Great One.\" Water Bodies The Yukon River, almost 2,000 miles long, is the third longest river in the U.S. There are more than 3,000 rivers in Alaska and over 3 million lakes. The largest, Lake Iliamna, encompasses over 1,000 square miles. Glaciers Alaska has an estimated 100,000 glaciers, ranging from tiny cirque glaciers to huge valley glaciers. There are more active glaciers and ice fields in Alaska than in the rest of the inhabited world. The largest glacier is the Malaspina at 850 square miles. Five percent of the state, or 29,000 square miles, is covered by glaciers. Compass Points Alaska boasts the northernmost (Point Barrow), the easternmost (Pochnoi Point on Semisopochnoi Island in the Aleutians), and the westernmost (Amatignak Island in the Aleutians) points in the United States.\" Coastline Alaska has 6,640 miles of coastline and, including islands, has 33,904 miles of shoreline. Volcanoes There are more than 70 potentially active volcanoes in Alaska. Several have erupted in recent times. The most violent volcanic eruption of the century took place in 1912 when Novarupta Volcano erupted, creating the Valley of Ten Thousand Smokes which is now part of Katmai National Park. Earthquakes On March 27, 1964, North America's strongest recorded earthquake, with a moment magnitude of 9.2, rocked central Alaska. Each year Alaska has approximately 5,000 earthquakes, including 1,000 that measure above 3.5 on the Richter scale. Of the ten strongest earthquakes ever recorded in the world, three have occurred in Alaska. Common Misconceptions About Alaska Most visitors have pleasant surprises in store when they come to Alaska. Three common misconceptions concerning Alaska are weather, road conditions, and prices. Bad Weather Over a third of all vacation/pleasure visitors found the weather better than expected. During the summer, average daytime temperatures throughout the state range from the 60s to the 90s. Bad Road Conditions Almost the entire length of the Alaska Highway is asphalt-surfaced, and approximately half of the roads in the state's highway system are paved. High Prices Contrary to popular belief, prices throughout Alaska are generally quite reasonable. To help illustrate the cost of a vacation, the following chart provides high and low prices for a few of the basics. More specific pricing may be obtained in the Official State Vacation Planner. Alaska Facts State Nick Name: \"The Last Frontier\" - the name Alaska is derived from the Aleut word \"Alyeska,\" meaning \"great land.\" State Motto: \"North to the Future\" State Capital: Juneau, located in the Southeast region of Alaska, has a population of 33,277 (2015 Estimate of Population, Alaska Department of Labor and Workforce Development) Alaska Map: Alaska Flag: NOTE: The State of Alaska is not responsible for the content/information on any site outside of a State of Alaska department."
}