{
  "url": "https://support.microsoft.com/de-de/windows/behebung-dass-bluetooth-in-windows-verschwunden-ist-4af6139c-2b7e-44ba-8d05-16c86365b2fd",
  "title": "Behebung, dass Bluetooth in Windows verschwunden ist - Microsoft-Support",
  "text": "Behebung, dass Bluetooth in Windows verschwunden ist Gilt für Das Bluetooth-Symbol oder der Bluetooth-Umschalter fehlt möglicherweise oder wird in den Einstellungen oder Schnelleinstellungen abgeblendet angezeigt, wenn Windows das Bluetooth-Feature nicht erkennen oder aktivieren kann. In diesem Fall werden möglicherweise keine Bluetooth-Optionen angezeigt, oder Sie können Bluetooth möglicherweise nicht aktivieren oder deaktivieren. Dieses Problem kann aus verschiedenen Gründen auftreten, z. B. falsche Bluetooth-Einstellungen, veraltete oder inkompatible Treiber, beendete Systemdienste, Hardwarefehler oder Probleme durch aktuelle Windows-Updates. Probieren Sie die folgenden Lösungen zur Problembehandlung aus, um das Problem zu beheben: Wenn Sie ein Windows 11 Gerät verwenden, führen Sie zunächst die automatisierte Bluetooth-Problembehandlung in der Hilfe-App aus. Es wird automatisch Diagnose ausgeführt und versucht, dieses Bluetooth-Problem zu beheben. Wenn Sie kürzlich ein Upgrade auf Windows 11 oder installierte Updates durchgeführt haben, ist Ihr aktueller Bluetooth-Treiber möglicherweise nicht kompatibel. Suchen Sie nach aktualisierten Treibern. - Wählen Sie start > Geräte-Manager aus. - Wählen Sie im Geräte-Manager Bluetooth und dann den Namen des Bluetooth-Adapters aus, der das Wort „radio\" enthalten kann. - Halten Sie den Bluetooth-Adapter gedrückt (oder klicken Sie mit der rechten Maustaste darauf), und wählen Sie dann Treiber aktualisieren > Automatisch nach aktueller Treibersoftware suchen aus. Befolgen Sie die Schritte, und wählen Sie dann Schließen aus. - Wählen Sie nach der Installation des aktualisierten Treibers Starten > Power > Neu starten aus, wenn Sie zum Neustart aufgefordert werden, und überprüfen Sie dann, ob das Verbindungsproblem dadurch behoben wird. Im Flugzeugmodus wird Bluetooth deaktiviert. Stellen Sie sicher, dass sie deaktiviert ist. - Drücken Sie Windows + A, um die Schnelleinstellungen zu öffnen. - Stellen Sie sicher, dass der Flugzeugmodus deaktiviert ist. Einige Bluetooth-Treiber werden über Windows Update geliefert. - Wählen Sie start > Einstellungen > Windows Update aus. - Wählen Sie Nach Updates suchen aus. Lassen Sie es alle verfügbaren Updates herunterladen und installieren. Ein Neustart hilft bei der Behebung temporärer Systemprobleme, die Bluetooth betreffen. - Wählen Sie Start > Power > Neustart aus. Das Bluetooth-Symbol oder der Bluetooth-Umschalter fehlt möglicherweise oder wird in den Einstellungen oder im Info-Center abgeblendet angezeigt, wenn Windows das Bluetooth-Feature nicht erkennen oder aktivieren kann. In diesem Fall werden möglicherweise keine Bluetooth-Optionen angezeigt, oder Sie können Bluetooth möglicherweise nicht aktivieren oder deaktivieren. Dieses Problem kann aus verschiedenen Gründen auftreten, z. B. falsche Bluetooth-Einstellungen, veraltete oder inkompatible Treiber, beendete Systemdienste, Hardwarefehler oder Probleme durch aktuelle Windows-Updates. Probieren Sie die folgenden Lösungen zur Problembehandlung aus, um das Problem zu beheben. Wenn Sie ein Windows 10 Gerät verwenden, führen Sie zunächst die automatisierte Bluetooth-Problembehandlung in der Hilfe-App aus. Es wird automatisch Diagnose ausgeführt und versucht, dieses Bluetooth-Problem zu beheben. Wenn Sie kürzlich ein Upgrade auf Windows 10 oder installierte Updates durchgeführt haben, ist Ihr aktueller Bluetooth-Treiber möglicherweise nicht kompatibel. Suchen Sie nach aktualisierten Treibern. - Wählen Sie Start aus, geben Sie Geräte-Manager ein, und wählen Sie es aus den Ergebnissen aus. - Wählen Sie im Geräte-Manager Bluetooth und dann den Namen des Bluetooth-Adapters aus, der das Wort „radio\" enthalten kann. - Halten Sie den Bluetooth-Adapter gedrückt (oder klicken Sie mit der rechten Maustaste darauf), und wählen Sie dann Treiber aktualisieren > Automatisch nach aktueller Treibersoftware suchen aus. Befolgen Sie die Schritte, und wählen Sie dann Schließen aus. - Wählen Sie nach der Installation des aktualisierten Treibers Starten > Power > Neu starten aus, wenn Sie zum Neustart aufgefordert werden, und überprüfen Sie dann, ob das Verbindungsproblem dadurch behoben wird. Im Flugzeugmodus wird Bluetooth deaktiviert. Stellen Sie sicher, dass sie deaktiviert ist. - Drücken Sie Windows + A, um die Schnelleinstellungen zu öffnen. - Stellen Sie sicher, dass der Flugzeugmodus deaktiviert ist. Einige Bluetooth-Treiber werden über Windows Update geliefert. - Wählen Sie Start > Einstellungen > Update & Security > Windows Update aus. - Wählen Sie Nach Updates suchen aus. Lassen Sie es alle verfügbaren Updates herunterladen und installieren. Ein Neustart hilft bei der Behebung temporärer Systemprobleme, die Bluetooth betreffen. - Wählen Sie Start > Power > Neustart aus. Wenn ein anderes Bluetooth-Problem vorliegt, lesen Sie Beheben von Bluetooth-Problemen in Windows."
}