{
  "url": "https://www.espn.com/",
  "title": "ESPN - Serving Sports Fans. Anytime. Anywhere.",
  "text": "Favorites Customize ESPN ESPN Sites ESPN Apps AD to the Wizards?! Grading the shocking trade, and why one team came out on top Anthony Davis joins Washington in an eight-player trade. Kevin Pelton breaks down what's next for the Wizards and the Mavericks. NBA trade buzz: Live updates and intel during deadline week Chris Paul is headed to Toronto, but will he stay there? Catch up on what we're hearing from insiders. TOP HEADLINES LATEST DEADLINE DISCUSSIONS Shams: Mavs essentially cutting their losses by trading AD to Wizards Windy: Coby White will be a spark plug for the Hornets NBA SCOREBOARD High school stories of 11 Super Bowl stars -- and 2 coaches OLYMPICS COUNTDOWN OPENING CEREMONY: FRIDAY Who you calling old? At the 2026 Olympics, age is just a number Lindsey Vonn, Nick Goepper, Gus Kenworthy and Maddy Schaffrick are in their golden years at the 2026 Olympics. Just don't call them old. How Laila Edwards carved her own path as USA Hockey's first Black player Laila Edwards, a standout at Wisconsin, is ready for her Olympic debut as USA Hockey's first Black player. MEN'S COLLEGE HOOPS Ranking the top 12 men's Coach of the Year contenders at midseason From Fred Hoiberg and the turnaround he's authored at Nebraska to usual suspects, see who made the short list. Bracketology: The good, and the less good, about Illinois' recent success The Fighting Illini are the top 2-seed -- with plenty of time this season to move further up the board. MEN'S COLLEGE HOOPS SCOREBOARD Christian Gonzalez vs. JSN? Will Campbell vs. DeMarcus Lawrence? Sorting five key Super Bowl matchups Can Christian Gonzalez contain Jaxon Smith-Njigba? Will DeMarcus Lawrence get the best of Will Campbell? Here are five matchups that will matter Sunday. Our full list of Super Bowl LX picks: 58 experts predict the final score of Seahawks-Patriots Will the Seahawks or Patriots win? Who will be the MVP? Our analysts and reporters make their predictions. GEARING UP FOR SUPER BOWL LX Who does Gronk like in Super Bowl LX? Stephen A.: Drake Maye's mobility 'problematic' for Seahawks Top Headlines - Sources: Mavs overhaul again, trade AD to Wiz - Sources: Lonzo to become free agent after trade - Sources: Paul lands with Raptors in 3-team trade - Sources: Sixers trade McCain to OKC for 4 picks - Sources: Bulls trade White, Conley to Hornets - Hamlin reinjured in fall searching fire wreckage - Rangers' Panarin traded to Kings, gets extension - Darnold: Oblique 'feels really good' ahead of SB - ✨ Top 10 MLB prospect rankings for every team Customize ESPN ICYMI Lakers get fancy with this off-the-backboard LeBron slam Austin Reaves tosses the ball off the backboard to LeBron James for a thunderous finish. Sounding Off Stephen A. appalled by Kraft's HOF snub, wonders what it means for Brady Stephen A. Smith voices his unhappiness over Robert Kraft not making the Pro Football Hall of Fame and wonders if Tom Brady will be a first-ballot Hall of Famer. You be the GM! Trending Now Inside James Franklin's rapid recruiting overhaul at Virginia Tech In a sprint to the early signing period, Franklin gutted his former school and brought life to the Hokies. NBA trade grades: McCain, Harden Garland, Davis, Vucevic dealt The Grizzlies, Clippers, Cavaliers, Celtics, Mavericks and Bulls are among the teams that have made trades. We're grading every deal. 2026 NFL mock draft: Miller's pick predictions in Rounds 1-2 Matt Miller goes two rounds deep in his latest NFL mock draft. Which prospects rose after the Senior Bowl? Which teams need QBs? Why this New Jersey gym is known as the 'most dangerous gym in America' Diamond Gym doesn't just build muscle -- it tests the resolve of everyone who walks through the door. Top 100 MLB prospects for 2026: Griffin, McGonigle, more Where do stars of tomorrow such as Konnor Griffin and Kevin McGonigle land as we rank baseball's best young players? Sign up to play the #1 Fantasy Baseball Game Sign up for FREE! Sign up for FREE! Get a custom ESPN experience Enjoy the benefits of a personalized account Select your favorite leagues, teams and players and get the latest scores, news and updates that matter most to you."
}