{
  "url": "https://kprofiles.com/b-a-p-members-profile/",
  "title": "B.A.P Members Profile (Updated!) - Kpop Profiles",
  "text": "B.A.P Members Profile and Facts: B.A.P (비에이피) is a 5-member South Korean boy group under MA Entertainment, consisting of Yongguk, Daehyun, Youngjae, Jongup, and Zelo. They debuted on January 26, 2012, under TS Entertainment with their first single album, Warrior. Background Information: As of February 18, 2019 all the members’ contracts with TS had been terminated and they announced they wouldn’t renew. B.A.P initially disbanded on February 18, 2019, though, they were reformed on June 12, 2024, by MA Entertainment minus Zelo who’s currently serving in the military, but is expected to return as well. Group Name Meaning: Best Absolute Perfect Official Greeting: “Hello, we are B.A.P! Yes sir!” B.A.P Official Fandom Name: B.A.B.Y Fandom Name Meaning: Baby Always Behind You B.A.P Official Color: Spring Green B.A.P Official Logo: Latest Dorm Arrangement: Yongguk has moved out from the dorm. Daehyun left the dorm to live on his own. Youngjae has his own room. Jongup has his own room. Zelo‘s living with his family. Official SNS: Blog (Japan): ameblo.jp/bap-blog X: @BapJapanstaff YouTube: B.A.P / (Japan): B.A.P JAPAN OFFICIAL b.stage: B.A.P Facebook: OFFICIALB.A.P MA Ent. Official SNS: Instagram: @maenter_official X: @maenter1234 YouTube: MA ENTERTAINMENT Facebook: MA Entertainment B.A.P Member Profiles: Yongguk Stage Name: Yongguk (용국) Birth Name: Bang Yong-guk (방용국) Position(s): Leader, Main Rapper Birthday: March 31st, 1990 Zodiac Sign: Aries Chinese Zodiac Sign: Horse Height: 182 cm (6’0″) Weight: 60 kg (132 lbs) Blood Type: O MBTI Type: INTJ Nationality: Korean Matoki Bunny: ShiShi Mato (Red) Instagram: @bangstergram X: @BAP_Bangyongguk SoundCloud: bangxter Yongguk Facts: – He was born in Incheon, South Korea. – He has an older sister (Natasha – a tattoo’s artist and model) and a twin brother (Yongnam). – Education: KyungHee Cyber University. – He was a trainee for 6 years. – If B.A.P were a family he’d be the dad. – He’s the closest to Himchan. – Yongguk speaks Korean, Japanese, and English. – He is learning Spanish, when he has time he watches a lot of Latino dramas: télénovelas. – His hobbies are playing alone, exercising/writing lyrics, & composing. – His favorite colors are red and black. – He only started to talk when he was 5 years old. – His favorite food is Sushi. – His chores is to manage what goes on in the dorm. – In the dorm he used to share a room with Himchan. – On August 23, 2018 TS Ent. announced that Yongguk’s contract expired and he decided to leave the company. They mentioned that B.A.P will promote as 5 members until their contracts will expire. – In March 2019, he released his 1st solo full album, “BANGYONGGUK”. – Yongguk enlisted in August 2019. He was discharged in May 2021. – Yongguk produced the debut track for the group JUST B‘s “DAMAGE”. – He enlisted on August 1, 2019, and was discharged on May 18, 2021. – On March 30, 2023, he signed under YY Entertainment. – Yongguk’s Ideal Type: A virtuous woman. Show more Bang Yongguk fun facts… Daehyun Stage name: Daehyun (대현) Birth Name: Jung Dae-hyun (정대현) Position(s): Main Vocalist, Face of the Group Birthday: June 28th, 1993 Zodiac Sign: Cancer Chinese Zodiac Sign: Rooster Height: 179 cm (5’10″) Weight: 63 kg (139 lbs) Blood Type: A MBTI Type: ENFP Nationaltiy: Korean Matoki Bunny: Keke Mato (Grey/Pink) Instagram: @official_jdh X: @daehyun_2019 Soundcloud: DOF Daehyun Facts: – Daehyun was born in Gwangju then later moved to Busan. – He has an older brother. – Education: Nataraja Academy in Busan. – He was a trainee for a total of 2 years and trained with the group for about 7 months. – If B.A.P were a family he’d be the oldest son. – His hobby is watching movies. – His favorite food used to be cheesecake, but in a recent interview he said he doesn’t like it anymore. – He is the closest to Youngjae. – Daehyun likes fluorescent colors. – He speaks with a very heavy Busan dialect. – Daehyun has tattoos (2). – His chores in the dorm is cleaning the restroom. – Daehyun was a co host on the show “Idol Battle Likes” for the first 2 episodes. – Daehyun would like to try acting in the future because he learned some acting while they were shouting for Skydive. – He is friends with Daniel ex Wanna One. Both of them went to the same dance academy in Busan. – Daehyun bought Seventeen’s Seungkwan (when Seventeen were still rookies) rib eye. Seungkwan said he would pay him back, but Daehyun is still waiting. (Celuv iTV ‘I am Celeb’) – He is also close to Boy Republic’s Suwoong and JBJ’s Hyunbin. – Daehyun said that Jongup’s and Himchan’s belonging are everywhere, blocking the way, so Daehyun just have to step on their belongings if he wants to go to kitchen.XD – Daehyun acted in the musicals “Napoleon” (with BTOB’s Changsub) and in “All Shock Up” (with PENTAGON’s Jihno). – In the dorm he used to share a room with Zelo. – On February 18, 2019 his contact with TS Entertaining ended, and he did not renew. – He is now signed under STX Lion Heart Entertainment. – He debuted as a soloist on April 2019. – Daehyun acted in a web drama called “Meal Kid” (2020). (With SF9‘s Zuho playing as brothers) – He enlisted in the military on November 17, 2020 and was discharged on May 16, 2022. – On December 29, 2023, he signed under MA Entertainment. – Daehyun’s Ideal Type: Someone like Shin Saimdang. Show more Jung Daehyun fun facts… Youngjae Stage Name: Youngjae (영재) Birth Name: Yoo Young-jae (유영재 ) Position(s): Lead Vocalist Birthday: January 24th, 1994 Zodiac Sign: Aquarius Chinese Zodiac Sign: Rooster Height: 178 cm (5’10”) Weight: 65 kg (143 lbs) Blood Type: AB MBTI Type: INFP Nationality: Korean Matoki Bunny: Joko Mato (Yellow) Instagram:@yjaybaby X: @BAP_Youngjae Youngjae Facts: – He was born in Seoul, South Korea. – He has an older brother. – Education: Uijeongbu Technical High School. – He was a trainee for 4 years. – If B.A.P were a family he’d be the mom (he insists that’s his role, not Himchan’s). – He was a trainee at JYP for about a year, but joined TS because his debut didn’t seem to be nearing any time soon. – He audited for JYP together with BTS’s J-Hope and Halo’s Dino. – Youngjae is friends with JB from GOT7 and with Sungjae from BTOB. – He is the closest to Daehyun. (They became very close during their trainee days.) – Youngjae revealed that he and BTS’s Jin, BTOB‘s Eunkwang, and VIXX’s Ken are in a gaming crew, called “The Strongest Idol” and Youngjae is the leader. (“Lee Guk Joo’s Young Street”) – His hobbies are listening to music and sleeping. – His favorite food is meat. – Youngjae’s favorite color is sky blue. – His chores in the dorm is to keep everything organized. – In the dorm he shared a room with Jongup. – On February 18, 2019 his contact with TS Entertaining ended, and he won’t renew. – He debuted as a solo artist in April 2019. – On August 29, 2019, he signed under DMost Entertainment. – He was the MC for the rookie group BLITZERS‘ official debut showcase. – He enlisted on November 8, 2022 and was discharged on May 7, 2024. – On March 15, 2022, Youngjae signed with Forstar Company as an actor, his contract ended on May 16, 2024. – Youngjae’s Ideal Type: Someone who likes him a lot. Show more Yoo Youngjae fun facts… Jongup Stage Name: Jongup (종업) Birth Name: Moon Jong-up (문종업) Position(s): Main Dancer, Lead Vocalist Birthday: February 6th, 1995 Zodiac Sign: Aquarius Chinese Zodiac Sign: Pig Height: 174 cm (5’9″) Weight: 66 kg (145 lbs) Blood Type: B MBTI Type: INTP Nationality: Korean Matoki Bunny: Dada Mato (Green) Instagram: @moonjongyeup X: @jongup_official Soundcloud: ifyoulike0101 Jongup Facts: – He was born in Seoul, South Korea. – He has 2 older brothers. – Education: Hanlim Arts High School. – He was a trainee for 1.5 years. – He’s known for being the most awkward in the band. – If B.A.P were a family he’d be the 2nd oldest son. – His hobbies are listen to music/ dancing – Jongup’s favorite color is Black. – His favorite food is raw meat and hamburgers. – He is a big fan of McDonald’s. – Jongup likes to watch “Shingeki no Kyojin”. – He likes buying shoes. – Besides singing, Jongup also raps in his songs “Now” and “Try My Luck”. – He is the closest to Zelo. – His chores in the dorm is cleaning the dishes. – Boy Republic’s Suwoong, JBJ’s Hyunbin, Sonamoo’s NewSun, and Jongup belong to the same friend circle called “999 Squad”. – In the dorm he used to share a room with Youngjae. – On February 18, 2019, his contact with TS Entertaining ended, and he won’t renew. – In November 2019, Jongup has signed on with The Groove Company. – On May 7, 2020, he debuted as a soloist with the single album “Headache“. – On February 15, 2023, he was revealed as a contestant on the show “Peak Time“. – He is signed to MA ENTERTAINMENT since May 22, 2023. – Jongup enlisted on May 19, 2025 and will be discharged on November 18, 2026. – Jongup’s Ideal Type: He says he doesn’t have an ideal type, but he’d like her to be older than him. He also said he’d like a girl who shares his interest in anime. Show more Moon Jongup fun facts… Zelo Stage Name: Zelo (젤로) Birth Name: Choi Jun-hong (최준홍) Position(s): Lead Rapper, Lead Dancer, Maknae Birthday: October 15th, 1996 Zodiac Sign: Libra Chinese Zodiac Sign: Rat Height: 188.5 cm (6’2″) Weight: 63 kg (139 lbs) Blood Type: A MBTI Type: N/A Nationality: Korean Matoki Bunny: Toto Mato (Blue) Instagram: @byzelo X: @zelo96 TikTok: @zeloofficial Website: byzelo.com SoundCloud: zelo96-4 Zelo Facts: – He was born in Mokpo, South Korea. – He has an older brother. – Education: Sungdae Middle School, School of Performing Arts Seoul. – He was a trainee for 6 years. – He wants his fan girls to call him “Oppa” even though he is younger than most of them. – If B.A.P were a family he’d be he’d be the “cute and pure maknae ”. – His hobbies are listening to music, writing lyrics, skateboarding, beatboxing. – Zelo graduated from SOPA in 2015, he was schoolmates with Joy (Red Velvet), Yerin (GFriend), and Hayoung (Apink). – He likes grey, green, and red. – He is the closest to Jongup. – His favorite food is Kimchi. – He speaks Korean and English. – Zelo is friends with BTS’s J-Hope. They went to same academy in Gwangju for rap and dance. – He is also close with SEVENTEEN’s Hoshi. (Celuv iTV ‘I am Celeb’) – Zelo got a nose piercing in 2016. – Zelo’s shoe size is 285 mm. – His chores in the dorm was to do the laundry. – He used to share a room with Daehyun. – On December 10, 2018 during the last concert of B.A.P’s European tour, Zelo mentioned that his contract with TS Ent. has officially ended and the European tour was not in his plan, but because he wanted to see Babyz he decided to attend. – On December 24, 2018 it was announced that Zelo’s contract with TS Ent. expired since December 2, 2018 and he decided to leave TS Ent. and B.A.P. – He debuted as a soloist under A Entertainment. – On October 3, 2019 Zelo confirmed on Instagram that he left A Entertainment. – He was a contestant on “Street Man Fighter” in 2022. – On December 12, 2023, Zelo enlisted in the military and will be discharge on June 11, 2025. – Zelo’s Ideal Type: A person who’s good at English & have pretty smile. Show more Zelo fun facts… Former Member: Himchan Stage Name: Himchan (힘찬) Birth Name: Kim Him-chan (김힘찬) Position(s): Sub-Vocal, Rapper, Visual Birthday: April 19th, 1990 Zodiac Sign: Aries Chinese Zodiac Sign: Horse Height: 180 cm (5’11”) Weight: 69 kg (152 lbs) Blood Type: O MBTI Type: ENFP Nationality: Korean Matoki Bunny: Tats Mato (Pink) Instagram: @chanchanieeeeee X: @BAP_Himchan Himchan Facts: – He was born in Seoul, South Korea. – He has an older sister. – Education: National School for Traditional Music – He was a trainee for 1.5 years. – If B.A.P were a family he’d be the mom. – He was an MC for MTV‘s “The Show“. – He is the closest to Yongguk. – His hobby is shopping (looking for pretty clothes) – His favorite colors are black, gold, and red. – His favorite food is Japanese Food. – Himchan is very talkative as he does not like silence. (NCT Night Night Radio) – Himchan is close with Seventeen’s Woozi and Wonwoo. (Celuv iTV ‘I am Celeb’) – He is also close to JBJ’s Hyunbin. – His chores in the dorm is to throw out the garbage. – In the dorm he used to share a room with Yongguk. – After Yongguk moved out, Himchan has the room all for himself. – On July 24, 2018 a woman accused Himchan of sexual harassment. The police is currently investigating as Himchan is denying the accusation saying it was consensual. – On February 18, 2019 his contact with TS Entertaining ended, and he didn’t renew. – He debuted solo on October 25, 2020 under OGAM Entertainment, with the single “Reason Of My Life“. – On February 24, 2021 it was announced that Himchan has been found guilty of sexual harassment (back from 2018) and was sentenced to 10 months in prison. – Himchan’s Ideal Type: A kind woman. Show more Himchan fun facts… Note: Please don’t copy-paste the content of this page to other sites/places on the web. Please do respect the time and effort the author put in compiling this profile. If you need/want to use info from our profile, please kindly put a link to this post. Thanks a lot – KProfiles.com Note 2: Source for members’ MBTIs. Daehyun confirmed his MBTI as ENFP here. Youngjae revealed his MBTI as INFP here. Zelo confirmed his MBTI as ENFP here. For Reference On MBTI Types: E = Extroverted, I = Introverted N = Intuitive, S = Observant T = Thinking, F = Feeling P = Perceiving, J = Judging (Special thanks to: CuteBunnyFromMato, Min Ailin, ST1CKYQUI3TT, Sowna, • Patority •, Renn1sm, Hoshi No Hikari, Syaviera Fier, Jin’s my husband, wife & son, grxce, lynkimhr, darkheart94, jenna_lov, Erin, wingedllama, สรัสวดี, kittykat, Min Peyo, Alex Stabile Martin, jxnn, Anonymous Kpopper, Vebin, WowItsAiko _ , Anissa, Best.Upsolute.Perfect, Kim Taehyung Forever, Daesukie, Jaea, Blossom, Bob X, Sarah Zimmerli, Heather, Risa Tamura, *~Nyx~*, Sarah Zimmerli, Taeyong56, xkinohuff, Elina, Darknight526, Mrs. Choi, Amy Kim Saotome, Hailz, My Freroli, KittyDarlin, HKI, Hoshi No Hikari, Thorben Hauerstein, KyutieWizard, KHGSMel, lol what, he boyz enthusiast, macaroolia, Sontje, StarlightSilverCrown2, Kpopgoestheweasel, liz, Huy, and more!) Related: B.A.P Discography Latest Official Release: Who is your B.A.P bias? Do you know more facts about them? Feel free to comment below."
}