{
  "url": "https://forums.terraria.org/index.php?threads/terratcg-the-terraria-collectible-card-game.140791/",
  "title": "tModLoader - TerraTCG - the Terraria Collectible Card Game! | Terraria Community Forums",
  "text": "billybobmcbo Terrarian TerraTCG TerraTCG is a Collectible Card Game built inside of Terraria! Challenge your Town NPCs to intense games of 1v1 card-based combat, grow your collection with booster packs, and experiment with exciting new strategies! The initial set of TerraTCG contains 100 cards, with over 25 NPC decks to duel against! To begin playing TerraTCG in-game, craft a TerraTCG Deckbox at a workbench using 5 wood. The Deckbox gives access to the Deck Editor. You'll only start with a few cards, but more can be gained by defeating any town NPC in a duel! To kickstart your collection, you can also find a small number of packs scattered in chests in any newly generated world.Talk to the Guide first for a good first opponent, and the option to view an in-game tutorial! Beyond the guide, the following NPCs can all be challenged to a game: - the Merchant - the Nurse - the Arms Dealer - the Goblin Tinkerer - the Traveling Merchant - the Clothier - the Dryad - the Nerdy Slime Ocean Creatures vs Jungle Creatures Cavern Creatures vs Mushroom Creatures Grow your Collection! All 100 TerraTCG cards can be obtained by opening packs rewarded by beating NPCs or bosses in a game! Each pack has a 1-in-15 chance to upgrade a card to a rare foil variant! Up the Stakes! Once you've gotten enough practice playing against your Townsfolk, you're ready to challenge the bosses themselves! Beating an NPC's second deck awards you with a \"Duel Invitation\", an item that can be used in the presence of a boss to start a life-or-death game of TerraTCG! Defeating a boss in a game of TerraTCG will slay the boss and unlock its progress in the world, but losing that game will result in death! Disclaimer While the PvE mode of this mod is fully supported in Multiplayer, there is currently no support for PvP games. Stay tuned for a future update! How to Play For a full illustrated gameplay tutorial, talk to the Guide in-game and ask to duel! Initial Setup TerraTCG is a card game played between two players. Each player begins by shuffling their deck and drawing 5 cards. One player is then selected randomly to go first. Each player has 3 resource types: There are 3 types of Card in TerraTCG: Item Cards can be attached to creatures, and provide bonuses to their stats. It costs Mana Crystals to play Items from the hand. Items provide effects such as Townsfolk are a special card type that provide powerful sources of advantage, such as: TerraTCG is a card game played between two players. Each player begins by shuffling their deck and drawing 5 cards. One player is then selected randomly to go first. Each player has 3 resource types: - Hearts: The player's life total. Each player starts with 4 hearts, losing one whenever a Creature they control dies. If a player loses all 4 hearts, their opponent wins the game! - Mana Crystals: Spent to perform most actions in the game, such as attacking with Creatures or equipping Items. Start at 1 per turn, then regenerate at a growing rate throughout the game. - Townsfolk Emblem: Used to cast Townsfolk, powerful one-off cards that can turn the tide of the game. Only 1 is generated per turn. There are 3 types of Card in TerraTCG: - Creatures, which are placed onto the battlefield for combat. - Items, which provide temporary or permanent buffs to creatures. - Townsfolk, which provide powerful single-use effects like card draw. Item Cards can be attached to creatures, and provide bonuses to their stats. It costs Mana Crystals to play Items from the hand. Items provide effects such as - Increasing a creature's damage - Decreasing a creature's attack cost - Restoring a creature's health Townsfolk are a special card type that provide powerful sources of advantage, such as: - Drawing cards - Gaining extra mana crystals - Buffing your creatures without spending Mana Crystals Last edited:"
}