{
  "url": "https://www.imdb.com/title/tt18070898",
  "title": "Sunny (TV Series 2024) - IMDb",
  "text": "Follows Suzie, an American woman living in Japan, and Sunny, a domestic robot made by her husband's company, as they uncover the dark truth of what really happened to Suzie's husband and son... Read allFollows Suzie, an American woman living in Japan, and Sunny, a domestic robot made by her husband's company, as they uncover the dark truth of what really happened to Suzie's husband and son, who disappeared in a mysterious plane crash.Follows Suzie, an American woman living in Japan, and Sunny, a domestic robot made by her husband's company, as they uncover the dark truth of what really happened to Suzie's husband and son, who disappeared in a mysterious plane crash. - Awards - 1 nomination total Browse episodes Featured reviews Apple have done it again. Their content is often quirky and unusual and Sunny is no exception. Rashida Jones's Suzie is a great character, spiky and sarcastic. As her relationship develops with Sunny her robot it becomes normal watching them interact. Having Japan and Japanese culture, mixed with an American protagonist, and the difficulties this brings when a tragedy happens is interesting. The futuristic elements are also really well conceived as they are believable, and not too unlike our present world. I love to watch foreign films and series as subtitles don't bother me. Don't let it put you off. Rashida Jones's Suzie is a great character, spiky and sarcastic. As her relationship develops with Sunny her robot it becomes normal watching them interact. Having Japan and Japanese culture, mixed with an American protagonist, and the difficulties this brings when a tragedy happens is interesting. The futuristic elements are also really well conceived as they are believable, and not too unlike our present world. I love to watch foreign films and series as subtitles don't bother me. Don't let it put you off. Ok, seen a lot of negative reviews which I don't get. I like this show, it works for me and I look forward to the next week's episode. It's not predictable, doesn't follow the usual recipe and explores a stranger in a strange land with unfamiliar customs, at least where a loved one is lost in mysterious circumstances as an American wife coming to grips not knowing her Japanese husband's secret work life. And yakuza thrown in to make it interesting. It has a fair bit of quirkiness, which I like. Yes a lot of it is in Japanese, but it's got subs, so that's okay. I'm giving 7 for now, maybe give it more at the end of the season. It has a fair bit of quirkiness, which I like. Yes a lot of it is in Japanese, but it's got subs, so that's okay. I'm giving 7 for now, maybe give it more at the end of the season. I really have no idea what I'm watching. I heard Rashida talk about this show on a Conan O'Brien podcast, so I thought I'd give it a watch. I like to watch new shows anyway, so why not. Right from the get go it's disjointed, and doesn't make much sense. Rashida plays the typical, rude and crude, angry American who refuses to assimilate to the Japanese culture, and talks down to everyone. Completely embarrassing! Sunny the robot is so stupid, cheap looking, and cheesy. We're on episode 8 and still trying to put together all the pieces to this story. The only thing remotely interesting is the involvement of the Yakuza, but don't get your hopes up. I'll see it through as I've already made it this far, but if you're looking for a great story, great writing, and amazing acting, this isn't the show for you. I heard Rashida talk about this show on a Conan O'Brien podcast, so I thought I'd give it a watch. I like to watch new shows anyway, so why not. Right from the get go it's disjointed, and doesn't make much sense. Rashida plays the typical, rude and crude, angry American who refuses to assimilate to the Japanese culture, and talks down to everyone. Completely embarrassing! Sunny the robot is so stupid, cheap looking, and cheesy. We're on episode 8 and still trying to put together all the pieces to this story. The only thing remotely interesting is the involvement of the Yakuza, but don't get your hopes up. I'll see it through as I've already made it this far, but if you're looking for a great story, great writing, and amazing acting, this isn't the show for you. I thought the first 3 episodes were great, lots of mystique, interesting plot line and a broad spectre of characters. It was attention grabbing. But at some point it just took a turn in to a surreal japanese game show-esq story with no clear plot. It tries to explore moral questions but it quickly becomes flat and uninteresting. It fails to keep your attention, and although it has an interesting problem : can a robot (AI) have free will, an intriguing and relevant philosophical question, it fails to connect on an intelectual level. At a point I just stop caring about the protagonists or the problem in hand. Loads of potential but it just seems like the writers had no idea how to explore the plot in an interesting way. It's as if the Matrix turned in to a Disney cartoon midway... I love Sci fi and I love Rashida Jones but I can't figure this show out. I'm not sure what it's about after 3 episodes. The fact that 70% of it is in Japanese makes it even harder. Rashida Jones' job seems to be to stand there half slumped and speak in English to people speaking to her in Japanese. She doesn't have any drive or maybe it's the way she portrays it I get no sense of urgency or even fear or trepidation from her as she's trying to figure out what happened to her husband and son. The writing is really uneven. This makes me sad. I wanted to like it, it's just too obscure for me I guess. Did you know - TriviaThe series is based on the novel The Dark Manual by Colin O'Sullivan. - ConnectionsReferenced in Late Night with Seth Meyers: Rashida Jones/Antony Starr/Julia Phillips (2024) - SoundtracksSukiyo Aishite Performed by Mari Atsumi - How many seasons does Sunny have?Powered by Alexa Details - Release date - Country of origin - Official site - Language - Also known as - Dark Manual - Filming locations - Production companies - See more company credits at IMDbPro - Color - Sound mix - Aspect ratio - 2.35 : 1 Contribute to this page Suggest an edit or add missing content"
}