{
  "url": "https://reviews.birdeye.com/vanderbilt-birth-center-176918264078553",
  "title": "Vanderbilt Birth Center - 41 Reviews - Healthcare in Nashville, TN - Birdeye",
  "text": "This profile has not been claimed by the business owner or representative. to update business information, get appointment requests, engage visitors with web chat, and more! 3212 West End Ave #100, Nashville, TN, 37203, United States Get directionsHonestly wish I would have just gone to the hospital in the first place for labor. I was GBS positive and needed penicillin during labor to protect the baby. I was given the antibiotics too quickly and had an allergic reaction which resulted in me being transfered to the hospital due to my baby being in distress so early into labor where it wasn't viable for me to push. My husband left at the time to get us food and I was alone in the room struggling with fever like symptoms due to the reaction until someone eventually came ... read more We’ve technically only had one child here and it was before VUMC purchased it, back when it was Baby & Co. However, our fourth child was meant to be delivered here and would have if we hasn’t risked out and had to go to VUMC and the melrose midwives. That being said, our prenatal care was absolutely fantastic. We’re currently pregnant with our 5th and going here for treatment and hope to deliver in September. Everyone is super nice and very competent. They know their business. As far as comfort, the birth rooms are great and... read more Could not recommend this place enough. This is my fifth baby, and the first birth experience that I could genuinely enjoy. My birth team included Sarah and Alydia, and they were beyond amazing! Would repeat the entire process with them any day. If there ever is another baby, I can guarantee that the birth center is my first choice for caring for baby and myself. Thank you guys for helping us meet our perfect boy. We will never forget that night. I've never given birth but I live at the apartments across the street and the fire alarm regularly goes off in the middle of the night and keeps me up pls fix it I truly cannot say enough good things about the Vanderbilt Birth Center. From my very first prenatal appointment to my dream labor and delivery, the care I received far exceeded every expectation. The midwives lead with such compassion and gentleness. At every visit, I felt heard, supported, and never rushed. Every one of my wishes was honored, and my birth was everything I hoped it would be. I am endlessly grateful for this place and for how special they made my first pregnancy experience. Vanderbilt Birth Center has a 3.9 star rating with 41 reviews. Vanderbilt Birth Center is open now. It will close at 5:00 p.m. Speak with a specialist to learn how you can grow with Birdeye. We are reachable at profiles@birdeye.com"
}