{
  "url": "https://www.clinicaladvisor.com/features/gina-2024-asthma-update/",
  "title": "GINA 2024 Asthma Update: Revised Recommendations on Treatment, Goals, Remission - Clinical Advisor",
  "text": "The Global Initiative for Asthma (GINA) has issued the 2024 update to its global strategy for asthma management and prevention report, as published on GINA’s website. The GINA 2024 asthma update includes key changes on a number of topics, including: - diagnosing asthma; - cough variant asthma; - assessing asthma control; - goal of asthma treatment; - asthma remission; - initial treatment in adults, adolescents, and children; and - medication recommendations. Authored by the GINA Science Committee, the newly-released 2024 report also includes several updated sections, including the section on allergen immunotherapy. The guidance is intended for primary care practitioners, specialists, and other health care professionals. Revised Diagnostic Flowchart GINA revised the diagnostic flowchart for adults, adolescents, and children aged 6 to 11 years presenting with chronic or recurrent respiratory symptoms in clinical practice. The flowchart includes guidance for measuring peak expiratory flow (PEF) for diagnosing asthma, in recognition of the fact that many health care providers do not have ready access to spirometry, the report authors noted. When PEF is used, the GINA Science Committee recommends using the best of 3 measurements each time and that the same meter should be used for follow-up testing, as measurements may be different from meter to meter by as much as 20%. The report authors also advise documenting evidence for an asthma diagnosis before initiation of inhaled corticosteroid (ICS)-containing treatment. Cough Variant Asthma Patients with cough variant asthma usually have normal spirometry, and the only abnormality in lung function may be airway hyper-responsiveness on bronchial provocation testing, the committee noted. Most of these patients have sputum eosinophilia, and they may have increased fractional concentration of exhaled nitric oxide (FeNO). The usual recommendations for asthma are advised in patients with cough variant asthma. Ongoing Monitoring GINA advises that providers assess patients’ symptom control for the previous 4 weeks or longer and identify other potential risk factors for exacerbations, persistent airflow limitation, or side effects. The updated report also recommends measuring lung function at diagnosis or treatment initiation, 3 to 6 months after beginning ICS therapy, and then periodically and more frequently in at-risk patients and for those with severe asthma. Risk factors for exacerbations include short-acting beta 2 agonist (SABA) overuse, inadequate ICS, other medical conditions, exposures such as smoking and air pollution, psychosocial factors, lung function, and type 2 inflammatory markers. For assessing symptom control, clinicians are advised to inquire about their patients’ frequency of asthma symptoms, any night waking or limitation of activity, and the frequency of symptom relief in those using SABA. Treatment Goals and Remission From a clinical perspective, the long-term goal of asthma management is to achieve the best possible outcomes for patients, including symptom control and minimizing exacerbation risk, according to the committee. “It is also important to elicit the patient’s (or parent/caregiver’s) goals regarding their asthma, as these may differ from medical goals,” the committee stated. In childhood asthma, the most important predictors of remission are fewer, milder, or decreasing frequency of symptomatic episodes, good or improving lung function, and less airway hyper-responsiveness. Risk factors for persistence of asthma in children include atopy, parental asthma/allergy, later onset of symptoms, wheezing without a cold, and maternal smoking or tobacco smoke exposure. For adults with asthma, predictors of remission on treatment with biologic therapy for severe asthma include improved short-term asthma symptom control, improved lung function, fewer comorbidities, earlier onset, and no or lower baseline maintenance oral corticosteroid (OCS) use. For remission off treatment in adults, predictors of clinical persistence are moderate-to-severe airway hyper-responsiveness and nasal polyps. Changes in Treatment Recommendations Recommendations for initial asthma treatment in adults and adolescents include key changes in tracks 1 and 2. In the preferred initial treatment (track 1), as-needed-only low-dose ICS-formoterol is preferred in steps 1 and 2. Low-dose ICS-formoterol maintenance-and-reliever therapy (MART) is preferred for step 3. Medium-dose ICS-formoterol MART is preferred in step 4 for patients who have daily asthma symptoms, wake at night with asthma at least once per week, and have low lung function. For step 5, it is recommended that patients with severe asthma be referred for expert assessment, phenotyping, and add-on treatment. As alternative initial treatment (track 2), it is preferred that patients with infrequent symptoms take ICS when SABA is taken vs daily ICS plus as-needed SABA; this ensures that patients receive at least some ICS. Additional guidance regarding medications and doses for track 1 anti-inflammatory reliever (AIR) therapy have been provided. Recommendations include use of relevant ICS-formoterol devices (dry-powder inhalers and pressurized metered-dose inhalers) and doses for AIR therapy, according to age group and treatment step, as well as the corresponding dosing regimens and maximum number of inhalations to be taken in 1 day. Among other treatment options, before prescribing montelukast, a leukotriene receptor antagonist, GINA advises that clinicians assess the benefits and risks and counsel patients or their parents/caregivers about the risk of neuropsychiatric events. Using a combination of high-dose ICS-long-acting beta 2 agonists (LABA) can be considered in adults and adolescents, although the increase in ICS usually provides little added benefit, noted the report authors. GINA recommends that a high dose only be used on a trial basis for 3 to 6 months when good asthma control is not achieved with medium-dose MART with ICS-formoterol or medium-dose ICS plus LABA and/or a third controller. Long-acting muscarinic antagonists (LAMAs) may be used as add-on treatment in a separate inhaler for patients aged 6 years and older or in a triple combination inhaler for patients aged 18 years and older in cases when asthma is persistently uncontrolled with medium or high-dose ICS-LABA. The addition of a LAMA to medium- or high-dose ICS-LABA may modestly improve lung function but not symptoms, according to the committee. Treatment Re-evaluation For patients receiving ongoing treatment for severe asthma who have had a good response to type 2 target therapy, GINA recommends re-evaluating the need for each asthma medication every 3 to 6 months and emphasizes that the patients should not completely stop their ICS-containing therapy. Minimizing OCS use is a high priority, and the committee advises gradually decreasing or stopping OCS first owing to significant adverse effects. If a patient’s asthma is well controlled, ceasing other therapies can be considered. For adults and adolescents with well-controlled asthma, stepping down treatment can be considered. The committee advises that stepping down can occur when symptoms are well controlled and lung function has been stable for at least 3 months. For patients with a risk for exacerbations, stepping down treatment should be done only with close supervision. GINA advises engaging patients in the process, documenting their asthma status, providing clear instructions and a written action plan, ensuring that the patients have sufficient medication to resume their previous dose if needed, monitoring symptoms, and scheduling a follow-up visit. “Stepping down ICS doses by 25% to 50% at 3-month intervals is feasible and safe for most patients,” the committee stated. Children: Initial Treatment Recommendations Initial asthma treatment recommendations in children aged 6 to 11 years also have been updated. Symptom levels and lung function for initial treatment steps are similar to those for adults and adolescents. Additional details have been provided about studies, populations, and outcomes in this age group. For children aged 6 to 11 years with asthma symptoms that are well controlled on low-dose ICS or are using SABA alone and have symptoms occurring less frequently than twice per week, GINA recommends ICS whenever SABA is taken. Infrequent asthma symptoms are now regarded as occurring 1 to 2 days per week or less; the preferred initial treatment is low-dose ICS whenever SABA is taken, in combination or separate inhalers. For children with asthma symptoms occurring 2 to 5 days per week, the preferred initial treatment is low-dose ICS plus as-needed SABA. For children aged 6 to 11 years who have daily asthma symptoms, wake at night once or more per week, and have low lung function, the preferred initial treatment is medium-dose ICS-LABA plus as-needed SABA, or low-dose ICS-formoterol MART. For children whose initial asthma presentation is during an acute exacerbation, the preferred initial approach is to treat as for an exacerbation, including a short course of OCS if the exacerbation is severe, and then to commence step 3 or step 4 treatment and schedule follow-up. Updates on SCIT and SLIT Report authors updated the section on allergen immunotherapy after doinga a systematic review for articles on subcutaneous immunotherapy (SCIT) and sublingual immunotherapy (SLIT) for asthma. For clinicians considering using SCIT for adults or children with asthma, GINA advises weighing the potential benefits compared with pharmacologic treatment and allergen avoidance against the risk for adverse effects and inconvenience and cost of a longer course of treatment, which is usually 3 to 5 years. Also, SCIT should not be initiated until the patient has good asthma control, according to the guidance. For adults or adolescents with asthma who are sensitized to house dust mite (HDM) and have persisting asthma symptoms despite low- to medium-dose ICS-containing treatment, clinicians may consider adding HDM SLIT, but only when forced expiratory volume in 1 second (FEV1) is more than 70% predicted, the guidance states. Among children with asthma who are sensitized to ragweed, SLIT may be added before and during the ragweed season if FEV1 is 80% predicted or more. Other Changes Among other changes, mild asthma is regarded as a retrospective label and cannot be used to determine which patients may receive step 1 or 2 treatment. Evidence supports use of structured outpatient pulmonary rehabilitation programs for improving patients’ functional exercise capacity and quality of life. Also, a new section has been provided on preventing occupational asthma in adults, as 5% to 20% of new cases of adult-onset asthma may be attributed to occupational exposure. Patients who have suspected or confirmed occupational asthma should be referred for expert assessment owing to the economic and legal implications, according to the committee. GINA Science Committee: Process and Goals As with previous GINA reports, the 2024 report is based on a twice annual update of the evidence, which forms the basis for the recommendations made by the GINA Science Committee. The committee, which is comprised of leaders in adult and pediatric asthma research, performed a full-text review for 64 publications, of which 34 publications were discussed at committee meetings. As the committee noted in the newly released 2024 report, “When asthma care is consistent with evidence-based recommendations, outcomes improve.” They further added, “This strategy report is a resource document for health care professionals, intended to set out the main goals of asthma treatment and the actions required to ensure their fulfillment, as well as to facilitate the achievement of standards for quality asthma care.” This article originally appeared on Pulmonology Advisor References: Global Initiative for Asthma. Global strategy for asthma management and prevention, 2024. Updated May 2024. Available at: https://ginasthma.org/wp-content/uploads/2024/05/GINA-2024-Strategy-Report-24_05_22_WMS.pdf"
}