{
  "url": "https://www.mtouton.com/producers/willm",
  "title": "Willm | Monsieur Touton Selection",
  "text": "Willm In 1896 the Willm family founded the Willm Estate in Barr, at the foot of the majestic Kirchberg de Barr Grand Cru vineyard. Willm has always been concerned with revealing the best of his terroirs and sharing his exceptional wines with the whole world. Thanks to the adventurous founder Emile WILLM, the estate's wines were the first from Alsace to be exported to the United States in the early 1930s, after prohibition laws were lifted. Their wines are celebrated for their blend freshness, minerality and elegance; they are synonymous with tradition, terroir, purity and refinement. If Willm isn't in an American history book, it should be. The winery was the first producer in Alsace to export to the United States after prohibition, and it's said that Al Capone favored the wines after his release from Alcatraz. Though the Willm family has been making wine in Alsace since 1896, their French heritage dates back to 1398. Willm's portfolio includes four Grand Crus, sparkling Cremant d'Alsace and late-harvest sweet wines, in addition to their reserve range. The winery is known for its easy-drinking, well-priced Riesling that pairs well with shellfish, grilled seafood and white meats. Among Alsace's rarer sparklers is Willm's Crémant d'Alsace Blanc de Noirs, a white bubbly made from 100% Pinot Noir. The vineyards span the Haut-Rhin (upper Rhine) and the Bas-Rhin (lower Rhine) in three locations, encompassing a diversity of soils and allowing Willm to produce a range of styles. The winery received its organic certification in 2012. Climate: The Willm vineyard is located in the Barr region of northern Alsace at an altitude of 200-400 meters, extending from the mountainous base of the Vosges to the plains of Alsace and the Rhine. Bordered by the Vosges Mountains to the west, the Barr hillsides benefit from a dry and sunny microclimate thanks to their south-southeast exposure, optimal for cultivating the vines. The fluctuation between warm days and cool nights in autumn is conducive to a slow, prolonged grape maturation. Soils: Our diverse soils are a product of the region's diverse landscape. The mountainous Vosges make way for smaller hills which stretch into various flatlands—just a few of about a dozen geological formations that comprise our region's landscape. The vineyard itself consists primarily of granite and clay-limestone soils, while the coastal marine environment contributes to the terroir's mineral-rich quality."
}