{
  "url": "https://www.pixar.com/finding-dory",
  "title": "Finding Dory — Pixar Animation Studios",
  "text": "She Just Kept Swimming Forgetful blue tang Dory is living happily in the reef with Marlin and Nemo when Dory suddenly remembers that she has a family out there who may be looking for her, the trio takes off on a life-changing adventure across the ocean to California’s prestigious Marine Life Institute, a rehabilitation center and aquarium. In an effort to find her mom and dad, Dory enlists the help of three of the MLI’s most intriguing residents: Hank, a cantankerous “septopus\" who frequently gives employees the slip; Bailey, a beluga whale who is convinced his biological sonar skills are on the fritz; and Destiny, a nearsighted whale shark. Deftly navigating the complex inner workings of the MLI, Dory and her friends discover the magic within their flaws, friendships and family. Trailers Teaser Trailer 1 Trailer 2 T H E C H A R A C T E R S Dory Dory is a bright blue tang with a sunny personality. She suffers from short-term memory loss, which normally doesn’t upset her upbeat attitude—until she realizes she’s forgotten something big: her family. She’s found a new family in Marlin and Nemo, but she’s haunted by the belief that someone out there is looking for her. Dory may have trouble recalling exactly what—or who—she’s searching for, but she won’t give up until she uncovers her past and discovers something else along the way: self-acceptance. Nemo & Marlin Dory is on a mission to the California coast to track down her family, and Marlin and Nemo are there to help her. Nemo may just be a young clownfish with a lucky fin, but he wholeheartedly believes in Dory. After all, he understands what it’s like to be different. And Marlin, who of course knows how it feels to lose family, realizes he has no choice but to pack up his nervous energy and skepticism and embark on yet another adventure, this time to help his friend in need. Hank Hank is an octopus. Actually, he’s a “septopus”: he lost a tentacle—along with his sense of humor—somewhere along the way. But Hank is just as competent as his eight-armed peers. An accomplished escape artist with camouflaging capabilities to boot, Hank is the first to greet Dory when she finds herself in the Marine Life Institute. But make no mistake: he’s not looking for a friend. Hank is after one thing—a ticket on a transport truck to a cozy Cleveland facility where he’ll be able to enjoy a peaceful life of solitude. Bailey Bailey is the Marine Life Institute’s resident beluga whale who is convinced his biological sonar skills are on the fritz. The good news—or bad news, depending on who you ask—is that doctors at the MLI can’t seem to find anything wrong with him. Bailey’s flair for the dramatic never ceases to push his neighbor’s buttons: whale shark Destiny can’t seem to get through to him, no matter how hard she tries. Maybe he’ll listen to new friend Dory, who seems to be full of crazy ideas. . The Master Mimic A mimic octopus, the inspiration for Hank, has the ability to ward off predators by mimicking other creatures (like a sea snake, flatfish or lionfish) . Likewise, it can camouflage itself against its background, from jagged coral to a sandy sea bottom. It can streamline its body and fold into itself. Its arms are covered in hundreds of suckers, which have the ability to attach to almost any surface, giving the animal unmatched mobility, as well as an uncanny ability to manipulate items like the lid of a jar. Destiny Destiny may be a clumsy swimmer, but she has a big heart. She has a big everything, actually—whale sharks are the biggest fish in the sea. Destiny resides in the Marine Life Institute, where one day an oddly familiar blue tang named Dory falls into her pool. Destiny is admittedly embarrassed by her obvious lack of grace, a product of poor eyesight, but Dory thinks she swims beautifully. And Dory is delighted to learn that her supersized friend speaks whale, too. Becky Becky is an offbeat, kooky loon who takes a liking to Marlin. Although she inspires little confidence—especially from a certain, skeptical clownfish—she might be smarter than she looks. Fluke & Rudder Fluke and Rudder are a pair of lazy sea lions who were rehabilitated at the Marine Life Institute. Marlin and Nemo find them snoozing on a warm—and highly coveted—rock just outside the facility. These sea lions really enjoy their down time and would rather not be bothered mid nap—but their bark is far worse than their bite. T H E W O R L D The Great Barrier Reef The Great Barrier Reef’s vibrantly colored coral and seaweed provide a fun and friendly home for Marlin, Nemo and the newest member of their family, Dory. Water And Light The filmmakers knew early on how important it would be to get the water just right for the film. Whether someone is on the reef, in the open ocean or the aquarium, the water can run more green, or more blue, depending on the sequence. Inside the Marine Life Institute, the water actually becomes a light source. Humans tend to fall into silhouettes in the background and the water really underscores that this is a story about a fish. Marine Life Institute The “Jewel of Morro Bay”—the Marine Life Institute (MLI), is a rescue and rehabilitation center and premiere aquarium. Shipping Lanes The Shipping Lanes are a stark and foreboding wasteland of shipwrecked vessels and shipping containers. Home to pesky hermit crabs and other creatures, the shipping lanes are filled with surprises."
}