{
  "url": "https://www.reddit.com/r/github/comments/15kua54/copilot_is_rubbish_and_im_tired_of_pretending_it/",
  "title": "Reddit - The heart of the internet",
  "text": "Copilot is rubbish, and I'm tired of pretending it isn't. What's happening here? It's as though I'm living in an alternate universe. People heap praise on this tool and claim they use it. But I question, who are these individuals? Let me set the context: I've been using this tool for a month. Far from aiding my development process, it's slowed me down, making me a less effective developer. I've been triggered by viewing their demo on YouTube today. (https://www.youtube.com/watch?v=PMSoHPuD8G8 this one) Firstly, they prompt the tool to summarize what's happening, and it responds with a wall of LLM 40 sentences - the quintessence of unreadable nonsense. Immediately, they resort to a more simplistic \"please summarise this\", and they receive a definition of a file from Wikipedia. I can't help but wonder how this is beneficial to anyone? The developers continually upload demos about writing basic if/else statements in Ruby templates, where the presenter comments, \"it isn't my first language, so I need help\". This seems to be the epitome of flawed application: a user writing code in a language they don't comprehend, accepting suggestions provided by a language model. I have tried using this tool and, personally, I don't get the appeal. This tool doesn't function like an IDE - To be in the flow, I need my tools to be powerful and helpful, while simultaneously keeping out of the way to allow me to be productive. They need to be predictable and reliable. When I open a tag, I expect my IDE to immediately add a closing one, the same with parentheses and curly braces. I want quick and accurate feedback. With this tool, the feedback is inconsistent - sometimes it's a line, sometimes a block. It begins something but fails to finish it. Thus, instead of focusing on writing, I have to divert my attention to checking and closing the tags, parentheses, curly braces, et cetera it opened. It disrupts my flow, slowing me down and burdening me with tasks that basic editors were resolving decades ago. As programmers often comment - writing code is easy, understanding and reading it is the challenging part. When Copilot prompts me with something, it will take me longer to read it, understand it, and potentially modify it to my preference than to just write it myself. And don't even get me started on writing comments or summarizing files. The least helpful type of comment is the one that simply describes what the line below does. I don't need to know that the 'reverse' method on an array reverses an array. I'm a developer, I can read code. I need to understand why something was done a certain way, the context, and the rationale behind unusual methods, not a mere description of what they do. This tool cannot write context, sensible comments or summarize a file effectively. It simply spits out walls of text, which often take longer to read than reading the code. For me, this tool has proven useless for nearly everything it purports to do. The sole exception might be that if you're using a library for the first time, it may prompt you with a block of code that you wanted. But a well-crafted 'getting started' guide should provide the same."
}