{
  "url": "https://www.dole.com/about-us",
  "title": "About Us | Dole",
  "text": "About Us Our Mission: To Make The World A Healthier Place Commitment to Quality Eating right is an important part of your life. We are dedicated to the highest quality standards, providing people nutritious, farm-fresh products that taste delicious and exceed expectations. Combining responsible farming practices, comprehensive programs for food safety, pledged transparency, and state-of-the-art production, we give people the power to experience healthy living. Environmental Responsibility We are constantly improving and enhancing our growing techniques to create food that’s good for you and easy on the planet. In nature, everything is connected and as a leader in the fruit and vegetable categories, we take pride in our environmental and social practices. Belief In Our People Great products start with amazing people. That’s why we work tirelessly to continuously improve the lives and livelihoods of our farmers and workers, offering competitive wages, substantial benefits, and safe work environments. Our main core values of Integrity, Loyalty, Commitment and Respect are there to guide every decision we make. At Dole, we believe that happy hands always grow the most delicious produce. Our Vision Marketing the most nutritious of foods with the lowest environmental impact, in Dole plc our ambition is to make the world a healthier, more sustainable place. In bringing together collective strengths and reach and local on-the-ground resources and expertise to create a new global leader, we strive to harness the full potential of the fresh produce industry. Our vertically integrated supply chain will allow us to further optimise the supply chain from farm to fork- forging the most direct route to market, while our iconic DOLE brand will act as the focal point for innovation and new product development, adding value and providing a tangible point of difference. By doing so we seek to present to our customers a compelling proposition and to consumers worldwide, produce which meets and exceeds their expectations. Our Roots Since the beginning, everything we do at Dole revolves around a simple principle: quality, and quality, and quality. Since then, Dole has grown into an industry leader with a broad range of products and markets, continually striving to put the highest-quality food on tables around the world. - 1851 The foundations of Dole Food Company, Inc. are laid as Bostonians Samuel Castle and Amos Cooke set up their trading company in Hawaii. - 1899 Fresh out of Harvard’s School of Horticulture & Agriculture, James Drummond Dole arrives in Hawaii. - 1901 James Dole begins growing pineapples in Wahiawa, Oahu and establishes the Hawaiian Pineapple Company. As the company grows, Hawaii, and the “Dole” name, become synonymous with pineapples. - 1933 Recognizing the popularity and quality associated with James Dole’s name, the DOLE brand starts appearing on cans of pineapple and pineapple juice. - 1961 Castle & Cooke acquires the Dole Food Company, keeping the popular DOLE brand. - 1964 Expanding into bananas when purchasing the Standard Fruit and Steamship Company, the control of our bananas from the time they are grown until the time they arrive at customers’ warehouses furthers our ability to ensure quality. - 1990 Dole expands to include packaged fresh vegetables, including pre-cut vegetables and salads. This soon becomes our fastest growing segment in supermarkets. - 1995 Dole’s global reach extends to more than 90 countries with over 170 fresh and packaged food products. - 2001 Organic bananas are introduced. - 2013 Sale of Dole’s packaged foods branch to Itochu Corporation is completed, enabling us to focus on fresh produce. - 2016 Dole launches multi-year collaboration with The Walt Disney Company to promote family fun healthy eating - 2018 Dole owner David Murdock completes sale of a 45% equity stake in Dole Food Company to Total Produce. - 2018 Dole refreshes brand identity to evoke farm freshness in its evolved logo."
}