{
  "url": "https://en.m.wikipedia.org/wiki/Shifting_Gears_(TV_series)",
  "title": "Shifting Gears (TV series) - Wikipedia",
  "text": "Shifting Gears (TV series) Shifting Gears is an American television sitcom created by Julie Thacker Scully and Mike Scully for ABC through 20th Television. The series stars Tim Allen, Kat Dennings, Seann William Scott, Daryl \"Chill\" Mitchell, Maxwell Simkins, and Barrett Margolis. It premiered on ABC on January 8, 2025.[1] In April 2025, ABC renewed the series for a second season which premiered on October 1, 2025.[2][3] Premise [edit]Still mourning the death of his wife, a gruff widower who runs an auto restoration shop reluctantly takes in his estranged (and newly divorced) daughter, with his two grandchildren.[4] Cast and characters [edit]Main cast [edit]- Tim Allen as Matt Parker[5] - Kat Dennings as Riley Parker,[6] Matt's daughter - Seann William Scott as Gabriel - Daryl \"Chill\" Mitchell as Stitch - Maxwell Simkins as Carter Parker, Riley's son - Barrett Margolis as Georgia Parker, Riley's daughter Recurring [edit]- Cynthia Quiles as Frankie[7] - Jenna Elfman as Eve Drake[a], Riley's former boss - Lucas Neff as Jimmy, Riley's former husband - Nancy Travis as Charlotte Miller, Matt’s dater - Carson Fagerbakke as Amelie, Gabriel's new girlfriend Guest stars [edit]- Brenda Song as Caitlyn Baker, Riley's high school friend - Felipe Esparza as Bob - Chelsea London Lloyd as Emma Foster - Jay Leno as himself - Patricia Richardson as Grief group member #1 (season 2)[9] - Richard Karn as Roger (season 2)[9] - Debbe Dunning as Grief group member #2 (season 2)[9] - Mookie Betts as himself (season 2)[10] - Lilly Singh as Jen (season 2)[11] - Gabriel Iglesias as himself (season 2)[12] - Lori Greiner as herself (season 2)[12] - Luke Macfarlane as Sam Parker (season 2)[13] Episodes [edit]Series overview [edit]Season 1 (2025) [edit]Season 2 (2025–26) [edit]Production [edit]A pilot episode was ordered in March 2024 made by 20th Television and written by Mike Scully and Julie Thacker Scully.[31] The project was given a series order by ABC in July 2024. It is from the studio 20th Television and starring Tim Allen and Kat Dennings. Mike Scully and Julie Thacker Scully were involved in the pilot but left the project. Allen executive produces with Marty Adelstein, Becky Clements, Richard Baker, Rick Messina and pilot director John Pasquin.[32] Michelle Nader joined as showrunner and executive producer in September 2024.[33] Dennings is also a producer. Jim Patterson, Bob Daily and John Amodeo also executive produce.[34] Seann William Scott joined the cast of the series in October 2024. Also in the cast for the series are Daryl \"Chill\" Mitchell, Maxwell Simkins and Barrett Margolis.[35] In November 2024, Brenda Song was cast to guest star.[36] In December 2024, Jenna Elfman joined the cast in a recurring role.[8] In January 2025, Nancy Travis was cast in a guest star.[37] In February 2025, Jay Leno joined the cast as a guest star.[38] In August 2025, it was reported that Patricia Richardson, Richard Karn, and Debbe Dunning are set to appear as guest stars for the second season premiere episode while Lilly Singh is also set to guest star on an episode.[9][11] Shifting Gears is filmed at Walt Disney Studios in Burbank, California.[39] On April 3, 2025, ABC renewed the series for a second season.[2] On September 5, 2025, ABC ordered three more episodes for the second season, increasing the total number of episodes for the season from ten to thirteen.[40] On September 9, 2025, Gabriel Iglesias and Lori Greiner were cast to guest star as themselves.[12] On October 6, 2025, it was announced that Mookie Betts would make a guest appearance on the October 8, 2025 episode.[10] On December 9, 2025, it was reported that Luke Macfarlane was cast to guest star.[13] Release [edit]Shifting Gears premiered on ABC on January 8, 2025.[1] Its second season premiered on October 1, 2025.[3] In Canada, the series aired on CTV Television Network.[41] Shifting Gears is available for streaming on Hulu and Disney+, with each episode appearing the day after its broadcast premiere.[42] Reception [edit]Critical response [edit]The review aggregator website Rotten Tomatoes reported a 47% approval rating with an average rating of 3.3/10, based on 15 critic reviews. The website's critics consensus reads, \"Shifting Gears has a formidable pair of sitcom stars in Tim Allen and Kat Dennings, but flavorless characters and flat jokes keep their new comedic vehicle stuck in neutral.\"[43] Metacritic, which uses a weighted average, assigned a score of 51 out of 100 based on 12 critics, indicating \"mixed or average\" reviews.[44] Ratings [edit]The premiere of Shifting Gears on January 8, 2025, set an audience record for ABC, amassing nearly 17 million multi-platform viewers in its first seven days across ABC, Hulu, Hulu on Disney+, and digital platforms.[45][46] This marks a 173% increase over its same-day audience of 6.2 million.[47] The episode also garnered around 12.5 million viewers without counting linear encores, still up 101% from the same-day audience, making it ABC's strongest series debut since The Conners in 2018 and the broadcaster's most-watched streaming debut to date.[48] Shifting Gears opened its 2025–26 season on ABC with 4.37 million viewers for its initial broadcast on October 1. After a week of cross-platform viewing, including streaming on Hulu, Disney+, and DVR playback, the series' audience grew to 7.57 million, a 73% increase. Its adults 18–49 rating rose from 0.35 to 1.17, equivalent to roughly 1.59 million viewers in that demographic. Approximately 42% of the total audience over five weeks came from streaming, with the majority of the adults 18–49 rating derived from digital platforms.[49] The Season 2 premiere of Shifting Gears attracted 7.57 million viewers in its first week, surpassing ABC's Abbott Elementary, which drew 6.64 million viewers for its premiere.[50] Season 1 [edit]Season 2 [edit]Accolades [edit]At the 5th Astra TV Awards, Tim Allen and Kat Dennings were nominated for Best Actor and Best Actress in a Comedy Series, respectively, while Shifting Gears was also nominated for Best Cast Ensemble in a Broadcast Network Comedy Series.[51][52] Footnotes [edit]References [edit]- ^ a b Webb Mitovich, Matt (November 11, 2024). \"ABC Sets Midseason Dates for Rookie, Will Trent, Tim Allen Comedy; 15-Week Break Ahead for Thursday Dramas\". TVLine. Archived from the original on November 11, 2024. Retrieved November 11, 2024. - ^ a b Andreeva, Nellie (April 3, 2025). \"'Shifting Gears' Renewed For Season 2 By ABC, 'Doctor Odyssey' Remains On The Bubble\". Deadline Hollywood. Retrieved April 3, 2025. - ^ a b Petski, Denise (July 17, 2025i). \"ABC Fall Premiere Dates: '9-1-1' Franchise, 'High Potential', 'Grey's Anatomy', 'Dancing' & More\". Deadline Hollywood. Retrieved July 17, 2025. - ^ Petski, Denise (May 21, 2024). \"Tim Allen Comedy Pilot 'Shifting Gears' Casts Maxwell Simkins & Barrett Margolis\". Deadline Hollywood. Archived from the original on June 24, 2024. Retrieved October 17, 2024. - ^ Badasie, Charlene (January 7, 2025). \"Tim Allen Shares New Details About His Shifting Gears Sitcom Character\". CBR. Retrieved February 12, 2025. - ^ Dumaraog, Ana (January 15, 2025). \"Shifting Gears Review: Tim Allen's New ABC Show Is Good... If You Love Tim Allen\". ScreenRant. Retrieved February 12, 2025. - ^ \"CYNTHIA QUILES\". resumes.actorsaccess.com. - ^ a b Andreeva, Nellie (December 12, 2024). \"Jenna Elfman Joins ABC's 'Shifting Gears' In Return To Multi-Camera Comedy\". Deadline Hollywood. Archived from the original on December 13, 2024. Retrieved December 13, 2024. - ^ a b c d Cordero, Rosy (August 19, 2025). \"'Home Improvement' Reunion Set For 'Shifting Gears' Season 2 Premiere: Patricia Richardson, Richard Karn & Debbe Dunning To Appear\". Deadline Hollywood. Retrieved August 19, 2025. - ^ a b Pennacchio, George (October 6, 2025). \"Dodger favorite Mookie Betts tries his hand at TV, knocks it out of the park on 'Shifting Gears'\". ABC7 Los Angeles. Retrieved October 8, 2025. - ^ a b Schwartz, Ryan (August 26, 2025). \"Shifting Gears Adds Lilly Singh — See Exclusive Season 2 Key Art\". TVLine. Retrieved August 26, 2025. - ^ a b c Otterson, Joe (September 9, 2025). \"'Shifting Gears' Season 2 Casts Gabriel Iglesias, Lori Greiner in Guest Roles (EXCLUSIVE)\". Variety. Retrieved October 15, 2025. - ^ a b Andreeva, Nellie (December 9, 2025). \"'Shifting Gears': Luke Macfarlane Cast As Long-Missing Parker Family Member\". Deadline Hollywood. Retrieved December 10, 2025. - ^ a b Pucci, Douglas (January 10, 2025). \"Wednesday Ratings: Shifting Gears Delivers Solid Debut on ABC, Abbott Elementary Hits Regularly-Scheduled Time Slot-High in 18-49 with It's Always Sunny in Philadelphia Crossover\". Archived from the original on January 15, 2025. Retrieved January 10, 2025. - ^ a b Pucci, Douglas (January 16, 2025). \"Wednesday Ratings: President Biden's Farewell Address Attracts Audience of Over 20 Million Across Four Broadcast Networks and Three Cable News Outlets\". Programming Insider. Archived from the original on January 19, 2025. Retrieved January 16, 2025. - ^ a b Pucci, Douglas (January 23, 2025). \"Wednesday Ratings: Chicago Drama Trio Gives NBC the Prime Time Win\". Programming Insider. Retrieved January 24, 2025. - ^ a b Pucci, Douglas (January 30, 2025). \"Wednesday Ratings: NBC Tops Prime Time with One Chicago Crossover\". Programming Insider. Retrieved January 30, 2025. - ^ a b Pucci, Douglas (February 6, 2025). \"Wednesday Ratings: Super Bowl's Greatest Commercials on CBS Steady in Demos from Year-Ago Special\". Programming Insider. Retrieved February 6, 2025. - ^ a b Pucci, Douglas (February 13, 2025). \"Wednesday Ratings: The Masked Singer 13th Season Premiere Helps Fox Win Broadcast Among 18-49 and 25-54\". Programming Insider. Retrieved February 13, 2025. - ^ a b Pucci, Douglas (February 27, 2025). \"Wednesday Ratings: Survivor 48th Season Premiere Lifts CBS to Top All Prime Time Demos\". Programming Insider. Retrieved February 27, 2025. - ^ a b Pucci, Douglas (March 6, 2025). \"Wednesday Ratings: 'Survivor' and 37th Premiere of 'The Amazing Race' Gives CBS the Lead in Nearly Every Demo\". Programming Insider. Retrieved March 6, 2025. - ^ a b Pucci, Douglas (March 13, 2025). \"Wednesday Ratings: CBS Tops in Viewers and Female Demos, ESPN Leads Among Male Demos with NBA\". Programming Insider. Retrieved March 13, 2025. - ^ a b Pucci, Douglas (March 20, 2025). \"Wednesday Ratings: 'Opry 100' Special on NBC is Top Primetime Telecast in Total Viewers\". Programming Insider. Retrieved March 20, 2025. - ^ a b \"Shows A-Z - shifting gears on abc\". The Futon Critic. Retrieved January 9, 2026. - ^ a b Pucci, Douglas (October 3, 2025). \"Wednesday Ratings: NBC and CBS Share in Broadcast Leadership with Returns of Programming in Regular Time Slots\". Programming Insider. Retrieved October 3, 2025. - ^ a b Pucci, Douglas (October 10, 2025). \"Wednesday Ratings: NBC Leads in Viewers, MLB Postseason on Cable Tops in Key Demos\". Programming Insider. Retrieved October 10, 2025. - ^ a b Pucci, Douglas (October 17, 2025). \"Wednesday Ratings: NBC and FS1 Again Share Victory on the Night\". Programming Insider. Retrieved October 17, 2025. - ^ a b Pucci, Douglas (October 24, 2025). \"Wednesday Ratings: ESPN Leads Prime Time Among Key Adult Demos with NBA, Inside the NBA Hits 2-Year High for Regular Season in ESPN Debut\". Programming Insider. Retrieved October 24, 2025. - ^ a b Pucci, Douglas (October 31, 2025). \"Wednesday Ratings: MLB World Series a Domestic and International Success\". Programming Insider. Retrieved October 31, 2025. - ^ a b Pucci, Douglas (November 7, 2025). \"Wednesday Ratings: NBC Leeds Primetime in Total Viewers and CBS Earns Demo Victory\". Programming Insider. Retrieved November 7, 2025. - ^ Schneider, Michael (March 6, 2024). \"Tim Allen Plots Another Return to ABC, Which Orders Comedy Pilot 'Shifting Gears'\". Variety. Archived from the original on January 8, 2025. Retrieved October 17, 2024. - ^ Porter, Rick (July 29, 2024). \"Tim Allen Comedy 'Shifting Gears' Nabs Series Order at ABC\". The Hollywood Reporter. Archived from the original on January 8, 2025. Retrieved October 17, 2024. - ^ Andreeva, Nellie (September 25, 2024). \"Michelle Nader Joins ABC's 'Shifting Gears' As Showrunner As She Inks Overall Deal With 20th Television\". Deadline Hollywood. Archived from the original on January 14, 2025. Retrieved October 17, 2024. - ^ Otterson, Joe (October 16, 2024). \"Tim Allen, Kat Dennings ABC Comedy 'Shifting Gears' Casts Seann William Scott\". Variety. Archived from the original on January 4, 2025. Retrieved October 17, 2024. - ^ Andreeva, Nellie (October 16, 2024). \"Seann William Scott Joins Tim Allen & Kat Dennings In ABC Comedy Series 'Shifting Gears'\". Deadline Hollywood. Archived from the original on January 11, 2025. Retrieved October 17, 2024. - ^ Petski, Denise (November 18, 2024). \"Brenda Song Reunites With Kat Dennings In Tim Allen's 'Shifting Gears' ABC Comedy Series\". Deadline Hollywood. Archived from the original on November 25, 2024. Retrieved December 19, 2024. - ^ Grebenyuk, Yana (January 22, 2025). \"Tim Allen's 'Last Man Standing' Wife Nancy Travis Joins His ABC Sitcom 'Shifting Gears' in Guest Role (Exclusive)\". Us Weekly. Retrieved February 12, 2025. - ^ Porter, Rick (February 11, 2025). \"Jay Leno Drives Into ABC's 'Shifting Gears'\". The Hollywood Reporter. Retrieved March 9, 2025. - ^ \"Shifting Gears - FAQ\". 1iota.com. Archived from the original on December 23, 2024. Retrieved December 23, 2024. - ^ Andreeva, Nellie (September 5, 2025). \"'Shifting Gears' Gets Order For 3 More Episodes By ABC, Paving Way For 'Scrubs' To Run On Wednesday\". Deadline Hollywood. Retrieved September 5, 2025. - ^ Bailey, Tom (October 2, 2025). \"How to watch 'Shifting Gears' season 2 online – stream Tim Allen comedy from anywhere\". Tom's Guide. Retrieved October 17, 2025. - ^ Schwartz, Ryan (August 26, 2025). \"Shifting Gears Adds Lilly Singh — See Exclusive Season 2 Key Art\". TVLine. Retrieved October 17, 2025. - ^ \"Shifting Gears: Season 1\". Rotten Tomatoes. Retrieved February 27, 2025. - ^ \"Shifting Gears: Season 1\". Metacritic. Retrieved February 8, 2025. - ^ Manfredi, Loree Seitz and Lucas (January 17, 2025). \"'Shifting Gears' With Tim Allen Becomes ABC's Best Series Launch in 6 Years With 17 Million Viewers | Exclusive\". TheWrap. Retrieved January 25, 2025. - ^ Schneider, Michael (January 18, 2025). \"Tim Allen's 'Shifting Gears' Is Now ABC's Most-Streamed Series Premiere Ever\". Variety. Retrieved January 25, 2025. - ^ Zaccaria, Alexis (January 18, 2025). \"Tim Allen's Sitcom Sets 6-Year Viewership Record For ABC Despite 42% RT Score\". Screen Rant. Retrieved January 25, 2025. - ^ Campione, Katie (January 18, 2025). \"'Shifting Gears' Premiere Scores Record Streaming Audience For ABC, Up 173% In 7 Days Of Viewing\". Deadline Hollywood. Retrieved January 25, 2025. - ^ Porter, Rick (October 14, 2025). \"TV Ratings: 'Shifting Gears,' 'Abbott Elementary' Premieres Get Big Streaming Lifts (Exclusive)\". The Hollywood Reporter. Retrieved October 17, 2025. - ^ Seitz, Loree (November 4, 2025). \"CBS' 'Tracker' and ABC's 'High Potential' Lead Fall TV Broadcast Premiere Ratings With Solid Growth\". TheWrap. Retrieved November 13, 2025. - ^ \"A Complete List of the 2025 Astra TV Awards Nominations\" (Press release). The Astras. May 15, 2025. Retrieved May 16, 2025. - ^ Bayer, Dan (May 15, 2025). \"The 2025 Hollywood Creative Alliance (HCA) Astra TV Award Nominations\". Next Best Picture. Retrieved October 17, 2025."
}