{
  "url": "https://mouthfulsfood.com/forums/index.php?/topic/1029-on-cheese/",
  "title": "On cheese - Dairy and Eggs - Moutfulsfood",
  "text": "Wilfrid Posted February 24, 2024 Posted February 24, 2024 I have no idea when I last looked at the cheese selection in Zabar’s. But what a good selection of (expensive) French cheeses. They have Formaggio and even Murray’s beat. I got a poor Pont L’Eveque from Citarella recently. Zabar’s has that, but also a more promising one. And a Livarot. Plus L’Ami du Chamertin and Soumaintrain, both of which seem to survive the trip that turns Epoisses into a hockey puck. These aren’t easy to find in New York. I bought the Soumaintrain for almost $30. Quote StephanieL Posted February 26, 2024 Posted February 26, 2024 (edited) My parents were recently in Norway, and among their gifts to me was a set of jams that are each meant to be paired with a specific cheese. It'll be interesting to see if cherry and licorice(!) jam really does go with Manchego. Edited February 26, 2024 by StephanieL Quote Wilfrid Posted March 1, 2024 Author Posted March 1, 2024 I will say that the Soumaintrain goes on forever; not only large but so rich. Quote small h Posted March 17, 2024 Posted March 17, 2024 I think this might be a perfect cheese. Slight sourness, and simultaneously firm and creamy. https://www.murrayscheese.com/dp/murray-s-cave-aged-original-buttermilk-basque Also a lot cheaper in the store than online. Quote Wilfrid Posted March 18, 2024 Author Posted March 18, 2024 Woke up this morning and the apartment was richly stinky. I had left the Herve Mons Camembert out last night. 👃 Quote voyager Posted March 18, 2024 Posted March 18, 2024 I remember making a special trip to the Abbey at Citeaux, southeast of Dijon. We brought a ripe Soumaintrain back to our chambre d'hote north of Beaune. I joyously told our hostess of our treasure and her response was, \"I'm sure the housekeeper will be pleased.\" Oooops. 1 Quote StephanieL Posted March 18, 2024 Posted March 18, 2024 Heh. Reminds me of our time in Paris, when we bought a nice ripe cheese specifically to have for breakfast on the day we left....3 days after purchase. It was glorious, BTW--we devoured it with Poilane bread right outside of the bakery. Quote voyager Posted March 19, 2024 Posted March 19, 2024 Reminds me of the time at fromagerie Ferme St.Hubert when after making a decent purchase the salesperson offered us \"very ripe Epoisses\", offert. We declined, trying to get across that a full sized palpitating Epoisses and two people in a hotel room with time constraints was a sketchy proposition. Quote Sneakeater Posted March 30, 2024 Posted March 30, 2024 My sick-food dinner last (Thursday) night was a Gyspy Ham sandwich (on She Wolf Bakery's unbelievable Sprouted Rye Bread with L'amuse Signature Gouda and Polish whole-grain mustard. The Gypsy Ham (a sort of ham loaf seasoned judiciously with paprika) was great. And She Wolf's Sprouted Rye Bread bests any German/Nordic rye bread I've heretofore gotten in New York. But I want to talk about L'amuse Signature Gouda. This Netherlands product is quite simply the richest, most complex Gouda I've ever had -- and I've been to actual Gouda (maybe I just visited the wrong stalls). It has a strongly nutty undercurrent beneath some sharpish top notes. It is delicious. I got it from Farm to People, but they seem to have sourced it from Essex Street Cheese. I can't recommend it highly enough. Quote Wilfrid Posted March 31, 2024 Author Posted March 31, 2024 By Essex Street, do you mean Formaggio? Quote Simon Posted March 31, 2024 Posted March 31, 2024 46 minutes ago, Wilfrid said: By Essex Street, do you mean Formaggio? I was curious, and I think Sneak means this: https://essexcheese.com/lamuse-gouda (though it looks like Formaggio does source from Essex St.) Quote sourbroughten Posted March 31, 2024 Posted March 31, 2024 Essex Street Cheese is a company that selects and imports a small number of cheeses to the US. L'Amuse Gouda is one, as is their signature Marcel Petite Comte which had for a short while been sold at a dedicated stand in the original Essex St Market. They can be found now in many better cheese shops. Quote Sneakeater Posted March 31, 2024 Posted March 31, 2024 19 hours ago, Simon said: I was curious, and I think Sneak means this: https://essexcheese.com/lamuse-gouda (though it looks like Formaggio does source from Essex St.) Yup that's what I mean. Quote MitchW Posted April 1, 2024 Posted April 1, 2024 Apparently, Fresh Direct sources that gouda from Essex St. as well. Quote Wilfrid Posted April 1, 2024 Author Posted April 1, 2024 I didn’t finish the Livarot from Zabar’s before my trip to LV last week. It’s still good (the exposed surface paste had dried but I cut that off). Boy does it stink. I keep cheese in my wine fridge; I really wouldn’t want this one in the regular fridge that I am opening all the time. Quote Wilfrid Posted April 8, 2024 Author Posted April 8, 2024 Please go to Formaggio while they have vast wheels of Tomme de la Coze, and I mean vast, at least a foot across. A cheese to get excited about. 1 Quote small h Posted April 9, 2024 Posted April 9, 2024 On 4/7/2024 at 8:47 PM, Wilfrid said: Please go to Formaggio while they have vast wheels of Tomme de la Coze Okay. I need capers anyway. Quote small h Posted April 18, 2024 Posted April 18, 2024 On 4/7/2024 at 8:47 PM, Wilfrid said: Tomme de la Coze I like it fine, but I'm not all that excited about it. Quote voyager Posted April 18, 2024 Posted April 18, 2024 Cheese is difficult. It is alive and constantly morphing. Like they say you never dip your foot in the same river, you never eat the same cheese. We've had cheese that was very disappointing that we somehow neglected to toss, only to find it buried in the cheese bin later, now ethereal, if a little stinky. Quote StephanieL Posted April 19, 2024 Posted April 19, 2024 On 4/18/2024 at 1:47 PM, voyager said: Cheese is difficult. It is alive and constantly morphing. Like they say you never dip your foot in the same river, you never eat the same cheese. We've had cheese that was very disappointing that we somehow neglected to toss, only to find it buried in the cheese bin later, now ethereal, if a little stinky. Just like when we kept a block of feta in the fridge a little too long, and found that it had changed into something wonderful and funky (and irreproducible). 1 Quote voyager Posted April 19, 2024 Posted April 19, 2024 1 hour ago, StephanieL said: Just like when we kept a block of feta in the fridge a little too long, and found that it had changed into something wonderful and funky (and irreproducible). Husband did the same thing. Horrible odor but absolutely sublime interior flavor, He now keeps one mouldering/aging in a sealed container. Quite amazing stuff, so very different from normal feta. Quote"
}