{
  "url": "https://www.lawsuit-information-center.com/roundup-lawsuit.html",
  "title": "Monsanto Roundup Lawsuit | January 2026 Update",
  "text": "In this post, our Roundup lawyers will give you: - An update on where things stand in the Roundup class action lawsuit in August 2025 - The likely direction the Roundup litigation will take moving forward, and - The expected future settlement amounts in the Bayer Roundup lawsuit (Phase 2) 61,000 Roundup Cases Left… and Counting As of May 2025, Monsanto has reached settlement agreements in nearly 130,000 Roundup lawsuits, paying approximately $11 billion. Bayer achieved this through large-scale block settlements with law firms handling high volumes of claims, along with pre-trial resolutions in individual cases. Although these settlements account for approximately two-thirds of the total, Monsanto estimates that roughly 61,000 active Roundup lawsuits remain pending. The majority of these cases are now in state courts across the country, though more than 4,000 remain consolidated in the federal MDL in California. New weedkiller lawsuits continue to be filed regularly. Our legal team hears daily from individuals recently diagnosed with non-Hodgkin lymphoma (NHL) after years of using Roundup. If you believe you may have a claim, contact us directly through our online form or by calling 800-553-8082. Roundup Lawsuit Updates and News It has been a long and often frustrating road for victims of Roundup exposure. What began with a single California jury handing down a $289 million verdict seven years ago has evolved into one of the most significant product liability lawsuits in U.S. history. Bayer has spent the years since trying to contain the fallout. The company has been busy. It has fought thousands of cases in court, secured multi-billion-dollar settlements, and advanced legal theories aimed at shielding it from future claims. Below is a detailed timeline of verdicts, appeals, and legal developments. January 17, 2026 – Supreme Court Yesterday, the U.S. Supreme Court agreed to take up a case that could have significant implications for Bayer’s long-running Roundup litigation. The review will address, as we talk a lot about below, whether federal pesticide labeling rules preempt state failure-to-warn claims, an issue that has divided lower courts and driven years of costly lawsuits. While Bayer welcomed the decision as an important step toward containing the litigation, the broader reality remains unchanged. With more than $10 billion already paid and tens of thousands of cases still open, we are where we are—this review may help bring clarity, but it is far from certain that it will be enough to alter Bayer’s overall exposure. January 6, 2026 – Over 5,000 total cases The Roundup MDL in the Northern District of California has 4,511 pending cases, with 5,240 total cases, as of January 2026. December 9, 2025 – MDL Drops 18 Cases The number of pending cases in the Roundup MDL in the Northern District of California decreased by 18 over the last month, bringing the total number of cases down to 4,508. November 4, 2025 – 18 New Cases in MDL Another 18 new cases were added to the Roundup MDL during the month of October. That brings the total number of pending cases in the MDL up to 4,490. October 2, 2025 – Roundup MDL No one talks about the Roundup MDL anymore, but there are 4,472 cases still pending in what is the ninth-largest MDL in the country. In a new order this week, we are reminded why more cases are being filed in state court. The MDL judge ruled on the admissibility of several expert witnesses in the Roundup litigation. He made it clear that Rule 26 reports must stand on their own and that depositions cannot fill in the gaps, which is certainly a form-over-substance issue. The result was that some experts were tossed for thin analysis, while others survived. October 1, 2025 – Bayer Settles Shareholder Lawsuit Bayer investors are seeking final approval of a $38 million settlement to resolve claims that the company misled shareholders about litigation risks tied to Monsanto’s Roundup weedkiller. The deal will end five years of litigation. The gist of the lawsuit is that shareholders sued Bayer for downplaying Roundup’s cancer-related liabilities during its 2018 acquisition of Monsanto, citing massive jury verdicts against Monsanto as proof. September 20, 2025 – Monsanto Win Affirmed The Illinois Appellate Court affirmed on Wednesday Monsanto’s trial win in a Cook County Roundup case, rejecting plaintiffs’ efforts to overturn a September 2023 defense verdict. The plaintiffs argued that the trial was tainted by juror bias, faulty jury instructions on proximate cause, and the trial court’s refusal to grant a continuance when their lead lawyers contracted COVID-19. The panel held that the juror in question expressed frustration with plaintiffs’ counsel but ultimately affirmed his impartiality, and the trial judge acted within his discretion in keeping him. The court acknowledged that a more detailed proximate cause instruction might have been preferable, but found the short-form version adequate, given that there was only one defendant. It also upheld the denial of a mistrial after the plaintiffs’ counsel fell ill, noting that the trial was nearly complete and further delay would have placed an undue burden on the jurors. These are just really hard issues to win on appeal. The appellate courts give the trial judge great deference, often affirming decisions that the judges on the panel would not have made if they were the trial judge. September 17, 2025 – Roundup Appeal: Monsanto Faces Stiff Task To Keep Win At 9th Cir. A Ninth Circuit panel heard argument on whether a trial court erred in striking a general-causation expert and tossing a Roundup injury suit at summary judgment. The case arrived from the Northern District of California’s Roundup MDL after the court excluded a peer-reviewed methodology and entered judgment in favor of the company. During oral argument, the panel pressed both sides on Daubert’s gatekeeping standards and the breadth of discretion afforded to district courts in excluding bad science, while noting the MDL’s long history and extensive record. We will await this ruling but there is not a lot of focus on the Roundup MDL at this point. September 4, 2025 – Monsanto Purchase Records The MDL judge in California has opened the door for Roundup plaintiffs to access Bayer’s internal due diligence documents from its 2018 purchase of Monsanto. Those records, originally produced in a shareholder case challenging whether Bayer misled investors about Roundup’s litigation risks, will now be available to the lawyers representing individuals who allege the weedkiller caused their non-Hodgkin lymphoma. The ruling could significantly expand the evidentiary record, offering plaintiffs new insight into what Bayer and Monsanto knew about Roundup’s potential dangers before and after the merger. By securing access to due diligence files, plaintiffs might find new evidence to bolster claims that Bayer and Monsanto failed to warn about the risks. The judge specifically noted that the companies’ internal assessments of Roundup litigation risk are relevant to proving what they knew and when they knew it. Bayer insists it has already produced millions of pages of discovery in the federal multidistrict litigation and maintains that no additional records can change the scientific consensus it cites for Roundup’s safety. Truthfully, this is probably not a huge deal. But who knows what is in those documents? September 2, 2025 – Bayer’s Roundup Replacement Bayer may finally be learning from its bruising Roundup experience. The company announced that it has filed for regulatory approval of a new herbicide called CropKey in the United States, the European Union, Brazil, and Canada. Unlike Roundup, which is built on glyphosate, CropKey’s active ingredient is icafolin-methyl. Bayer is pitching it as a safer, next-generation product designed to sidestep the cancer controversies that have fueled an avalanche of litigation. Bayer and its Monsanto unit remain buried under thousands of Roundup lawsuits, with more being filed each month. Its legislative push to limit liability through state law changes has produced only mixed results. Juries continue to deliver significant verdicts, and the science linking long-term glyphosate exposure to cancer has grown too credible to ignore. Against that backdrop, Bayer is betting that CropKey can not only open a new commercial chapter but also help draw a line under its litigation exposure. Bayer may finally dial down the endless litigation spiral. It has quietly settled thousands of Roundup cases this year and is now bringing closure to the massive PCB saga. In a landmark development, Bayer reached agreements in principle with over 200 plaintiffs who had claimed exposure to PCBs at Sky Valley Education Center near Seattle just this week. The stock market cheered the settlement, just like it would cheer more Roundup settlements. Get More Roundup Lawsuit Updates and News 👈 August 7, 2025 – Bayer Sets More Money Aside for Roundup Settlements and Verdicts Bayer’s latest financial disclosure has added another $1.37 billion to its litigation reserves related to Roundup, the controversial weed killer at the heart of tens of thousands of cancer-related lawsuits in the U.S It also reports settlements of thousands of lawsuits. So is this enough? Not even close. Is it a good development? Absolutely. Plaintiffs’ Roundup law firms are of one of two minds: (1) Let’s get a settlement like the one they just did, or (2) those settlement amounts are not enough and we need to load up, attack, and try more cases. August 4, 2025 – Delaware Is Becoming Another State Court Hub Delaware state courts are becoming an increasingly attractive forum for Roundup cancer lawsuits. In a new lawsuit filed Saturday in the Superior Court of Delaware, 92 plaintiffs from across the country sued Monsanto Company and Bayer CropScience LP, alleging they developed Non-Hodgkin Lymphoma after prolonged exposure to Roundup. July 21, 2025 – Pesticide Injury Accountability Act Over the past several years, a troubling trend has emerged in state legislatures—one that quietly undermines the rights of people injured by toxic pesticides like Roundup. States such as Iowa and Idaho have enacted laws that effectively immunize pesticide manufacturers from liability, provided the EPA approves their products. These laws treat federal registration not just as a regulatory green light, but as an impenetrable legal shield against failure to warn claims. The practical effect is that victims of herbicide-linked illnesses, including non-Hodgkin’s lymphoma, are blocked from justice in their own state courts simply because the product was rubber-stamped by a federal agency. That is the backdrop for Senator Cory Booker’s newly introduced Pesticide Injury Accountability Act. The legislation aims to strip away those state-level protections by amending FIFRA to create a federal right of action for those harmed by pesticides. This bill is a direct response to Monsanto’s long-running defense strategy to avoid jury trials in every way possible. July 22, 2025 – Roundup Criteria Expanded In recent years, we tightened our Roundup case criteria. That meant turning away many potential clients who did not meet strict thresholds for pesticide exposure or who fell outside the statute of limitations. We required a clear and consistent history of Roundup use over several years and imposed firm deadlines for when claims could be filed. But we are now revisiting and reopening our criteria. If you were exposed to Roundup and later developed non-Hodgkin’s lymphoma, we encourage you to reach out even if you were told in the past that your case did not qualify. June 30, 2025 – Supreme Court Wants Trump Administration Opinion The U.S. Supreme Court requested the views of the Department of Justice regarding Bayer’s latest attempt to curb thousands of lawsuits alleging its Roundup weedkiller causes cancer. Bayer is appealing a Missouri court decision that upheld a $1.25 million jury verdict awarded to a man who claimed his non-Hodgkin lymphoma was caused by long-term exposure to Roundup. Bayer’s dream is that the Supreme Court find that federal law, specifically the EPA’s approval of Roundup without a cancer warning, should preempt state-law failure-to-warn claims. Bayer’s CEO put out a statement of optimism. The stock market seems to disagree. Bayer stock is down 4.5% today. June 24, 2025 – New Jersey Supreme Court Grants Multicounty Litigation for Roundup Lawsuits The New Jersey Supreme Court has approved the creation of a multicounty litigation (MCL) docket for personal injury claims alleging that Monsanto’s Roundup weed killer caused non-Hodgkin lymphoma and other health issues. The order assigns all current and future Roundup-related cases in the state to Judge Gregg A. Padovano in Bergen County for coordinated pretrial proceedings. This decision comes after plaintiffs renewed their request in February 2025, citing 36 active cases across eight counties and predicting the case count would exceed 100. The court had previously denied MCL status in 2024 due to a lower number of filings. Plaintiffs argued that centralization would reduce duplicative discovery and prevent inconsistent rulings. Monsanto opposed the motion again, maintaining that the volume did not justify consolidation. This decision to consolidate Roundup cases into a multicounty litigation docket is not a huge deal, but it adds more pressure on Bayer to move toward a global settlement (or at least speed up the process of settling more lawsuits to reduce the inventory). June 22, 2025 – U.S. Supreme Court to Weigh In on Roundup Preemption Fight The U.S. Supreme Court is set to consider a petition for certiorari in Durnell v. Monsanto, a case that could have sweeping implications for Roundup litigation nationwide. At the heart of the case is whether federal law—specifically the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA)—preempts state-based failure-to-warn claims. Monsanto argues that because the EPA has approved glyphosate-based product labels without cancer warnings, plaintiffs cannot sue under state law for failure to include such warnings. But lower courts are divided. The Ninth Circuit has allowed these claims to proceed, while the Eleventh Circuit has taken the opposite view—creating a circuit split the Supreme Court may now resolve. The Court is expected to announce whether it will grant certiorari following its June 26, 2025, conference. If it takes the case, the justices would likely hear arguments during the 2025–2026 term. For plaintiffs and their lawyers, this is a critical juncture. A ruling against Monsanto would cement the ability of victims to hold the company accountable under state tort law, regardless of federal regulatory silence. A ruling in Monsanto’s favor could gut thousands of Roundup lawsuits pending across the country. Either way, the Supreme Court’s involvement underscores the high stakes—and raises pressure on Bayer to seriously consider a global resolution before the legal landscape shifts again. June 17, 2025 – New Study on Glyphosate A major new two-year study published in Environmental Health finds that glyphosate causes multiple types of cancer in rats, including leukemia, even at doses regulators consider “safe.” The study, led by Italy’s Ramazzini Institute with participation from institutions like Boston College and Mount Sinai, exposed rats to glyphosate through drinking water starting in the womb. Over 1,000 rats were tracked. All treated groups showed increased tumor rates compared to controls, and many of the cancers were rare for this breed. Key findings: - Glyphosate and glyphosate-based herbicides both led to benign and malignant tumors. - Leukemia was a key concern, especially following prenatal exposure. - The effects appeared even at doses below or equal to the current EU safety limits. - Researchers say the co-formulants in herbicide products may enhance glyphosate’s carcinogenic effects. So this study adds to a growing body of science connecting glyphosate exposure to cancer and other health issues, including liver, reproductive, and metabolic disorders. June 16, 2025 – Settlement in Roundup Trial Monsanto has reached a settlement in the Roundup cancer lawsuit brought by a Texas man, resolving the case shortly before closing arguments were set to begin. The case, Grantges v. Monsanto, was tried in St. Louis County Circuit Court. This is a smart move for Monsanto, which really needs to avoid taking more blockbuster verdicts. June 13, 2025 – Punitive Damage Award Stricken by Florida Court In a troubling decision, an intermediate appellate court has blocked punitive damages in a Roundup cancer case, stripping a California plaintiff of the $75 million awarded by the jury that heard the evidence in the case. The plaintiff, who developed non-Hodgkin’s lymphoma after long-term use of Monsanto’s glyphosate-based herbicide, had convinced the jury that Monsanto acted with conscious disregard for human safety. But the appellate court held that the punitive award was preempted by federal law, pointing to the EPA’s conclusion that glyphosate is “not likely” to be carcinogenic. This ruling guts the jury’s ability to punish corporate misconduct, even in the face of overwhelming internal evidence showing Monsanto knew about glyphosate’s cancer risks and deliberately chose not to warn the public. The EPA’s regulatory opinion, which is likely to change next year, is not a get-out-of-jail-free card, especially given that the International Agency for Research on Cancer has classified glyphosate as a probable human carcinogen, and juries have repeatedly found Monsanto’s conduct reprehensible. Federal law sets a floor, not a ceiling. The jury looked at Monsanto’s internal documents that have long offended juries, ghostwritten studies, suppression of safety concerns, and manipulation of regulators, and made its decision accordingly. June 6, 2025 – St. Louis County Trial The Grantges v. Monsanto cancer trial is currently on Day 10 in St. Louis County Circuit Court. Plaintiff is still presenting his case against Monsanto Co., alleging that his non-Hodgkin’s lymphoma was caused by Roundup exposure. The plaintiffs called Donna Farmer and the plaintiff this week. Donna Farmer is a Monsanto toxicologist and the lead spokesperson for the company on the safety of Roundup. She concedes in a 2009 internal email that “you cannot say that Roundup does not cause cancer,” acknowledging that Monsanto had not conducted carcinogenicity studies on the full Roundup formulation. Dr. Farmer also admits to editing scientific articles without being listed as an author and states that it was standard practice for Monsanto to contribute content to publications authored by seemingly independent scientists. May 27, 2025 – $611 Million Affirmed In a big win for victims, a Missouri appellate court on May 27, 2025, affirmed a $611 million verdict against Monsanto, holding the company accountable for exposing consumers to Roundup, a product that juries are now repeatedly finding causes cancer. The original jury award totaled $1.56 billion, but was trimmed by the trial judge. Still, the appellate court’s decision keeps a massive punitive award intact against Bayer’s Monsanto for knowingly selling a carcinogenic product without warning. The plaintiffs, each diagnosed with non-Hodgkin’s lymphoma, argued that Monsanto knew for years about the dangers of glyphosate, Roundup’s active ingredient, yet refused to warn the public or pull the product. The court flatly rejected Monsanto’s claims that expert testimony about EPA regulatory failures was unfair (a huge issue in this litigation) or that the damages were too high. May 19, 2025 – Bankruptcy for Bayer? Bayer is reportedly considering a Chapter 11 bankruptcy filing for its Monsanto subsidiary, a move that would push all current and future Roundup cancer lawsuits into the bankruptcy system. According to a recent report from the Wall Street Journal, this strategy is gaining traction inside Bayer after repeated trial losses and over $10 billion already paid to settle claims that Roundup causes non-Hodgkin lymphoma. There are two very different ways to interpret this. On one hand, Bayer cannot pay the’ full and fair value of these lawsuits. The company’s market cap in 2025 has collapsed to roughly $25.65 billion, less than half of the $63 billion it spent to acquire Monsanto in 2018. If you do the math, $25.65 billion divided by 70,000 potential plaintiffs comes out to under $400,000 per case — and that assumes every dollar of market value goes to claimants, which it will not. From Bayer’s perspective, you can see why they would roll the dice on a long-shot appeal to the U.S. Supreme Court instead of trying to settle these cases at those kinds of numbers. So while plaintiffs understandably do not want to hear this, getting an average payout of even $100,000 per case in a global settlement may be difficult given the scope of the liabilities and the financial strain Bayer is already under, unless the plan is just to litigate Bayer into bankruptcy. On the other hand, this may be less about what Bayer can afford and more about what it wants to pay. Like Johnson & Johnson and 3M before it, Bayer seems to be following a familiar corporate playbook — using the specter of bankruptcy to force a discount on settlement payouts. But unlike J&J’s “Texas Two-Step,” Bayer is not dumping its liabilities into a shell company. This is more akin to what happened in the Exactech litigation, where the weight of the lawsuits pulled the company itself into bankruptcy. May 9, 2025 – Caranci Verdict Affirmed Monsanto failed to overturn a $175 million verdict awarded to 83-year-old Ernest Caranci, who developed non-Hodgkin’s lymphoma after decades of using Roundup. The October 2023 Philadelphia jury verdict included $150 million in punitive damages. On May 8, 2025, the Pennsylvania Superior Court upheld the verdict, rejecting Monsanto’s appeal and affirming that the jury’s decision was supported by scientific evidence and legal procedure. This affirms the significant verdict that triggered Phase II of the Bayer glyphosate litigation for plaintiffs, following a string of defense verdicts. March 23, 2025 – Jury Hammers Bayer with $2.1 Billion Roundup Verdict in Georgia On Friday, a Georgia jury sent another loud and clear message to Bayer, ordering the company to pay $2.1 billion to a plaintiff who developed non-Hodgkin lymphoma after using Roundup. The staggering award includes $65 million in compensatory damages and an eye-watering $2 billion in punitive damages—a clear rebuke of Bayer’s continued refusal to take responsibility for the dangers of glyphosate. Bayer has rolled out the same tired argument that the verdict contradicts scientific evidence and regulatory consensus—a line that it really has to retire. The company will likely try to slash the damages on appeal, as it has done in other cases, where some original jury awards were reduced by 90% or more. But the sheer size of this verdict underscores the risk Bayer continues to take by fighting these cases instead of settling them. This is the latest significant courtroom loss for Bayer, which is drowning in Roundup litigation. Despite paying $10 billion to settle past claims, the company still faces over 60,000 active lawsuits, many of which are in state courts, where juries have consistently delivered massive verdicts in favor of plaintiffs. Meanwhile, Bayer has set aside only $5.9 billion for future Roundup settlements—an amount that now looks laughably insufficient. This verdict also comes at a critical time for Bayer, which is losing in court and in the court of public opinion. The company is already lobbying Congress for immunity from Roundup lawsuits, warning lawmakers that it may withdraw the product from the U.S. market if litigation costs continue to escalate. But these hollow threats aren’t stopping juries from punishing Bayer for choosing to fight rather than fairly compensate victims. With another multi-billion-dollar verdict on the books, Bayer’s strategy looks increasingly reckless. This case should serve as a wake-up call: if the company continues to gamble with jury trials, it will dig a deeper and deeper hole. March 19, 2025 – Push for Roundup Consolidation in New Jersey A second request to centralize lawsuits against Monsanto and Bayer over Roundup exposure has been submitted to the New Jersey Supreme Court. Plaintiffs in 36 cases across eight jurisdictions seek to consolidate their cases in Atlantic County Superior Court, arguing that centralization would improve judicial efficiency, streamline discovery, and prevent inconsistent rulings. Currently, 41 cases are pending in New Jersey, with plaintiffs asserting that Roundup exposure led to severe health conditions, including non-Hodgkin lymphoma. The plaintiffs anticipate that if their request is approved, the total number of cases could exceed 100. The New Jersey Supreme Court previously denied a similar request in June due to an insufficient number of cases. Monsanto has opposed the renewed bid, maintaining that the number of claims does not justify multicounty litigation. December 8, 2024 – Mistrial in Chicago November 20, 2024 – RFK Jr. and Roundup Robert F. Kennedy Jr. has long been a vocal critic of Roundup. In 2018, he was involved with the legal team representing Dewayne Johnson, a former school groundskeeper who alleged that prolonged exposure to Roundup caused his non-Hodgkin’s lymphoma. Johnson’s case is widely regarded as the starting point for this litigation. A jury awarded Johnson $289 million, finding that Monsanto acted with “malice and oppression” by failing to warn consumers about the potential health risks of its product. After the verdict, Kennedy remarked, “This jury found Monsanto acted with malice and oppression because they knew what they were doing was wrong and did it with reckless disregard for human life.” He called the decision a strong message to Monsanto’s boardroom. You like him or hate him. But Kennedy is clearly on the right side of this issue. (Here is a Facebook post from him. ) If Kennedy is confirmed as Secretary of Health and Human Services, his leadership could meaningfully influence the Roundup litigation. True to his history, he is likely to advocate for stricter oversight of herbicides and pesticides, potentially pushing federal agencies like the EPA or FDA to re-evaluate the safety of glyphosate. Any regulatory action questioning or limiting glyphosate’s use could strengthen plaintiffs’ claims, supporting arguments that Roundup is hazardous and inadequately regulated. Such a shift in regulatory and political climate—especially under a conservative administration—might force Bayer to reassess its jumbled legal strategy and reconsider a more aggressive pursuit of a global Roundup settlement. October 24, 2024 – Massachusetts State Court Follows 3rd Circuit A Massachusetts state court has found that federal law preempts a plaintiff’s claims that Monsanto failed to warn about the potential dangers of its weed killer, Roundup. Plaintiff’s design defects remain, but it is certainly a blow to lose the failure to warn claim. The ruling mirrors the 3rd Circuit’s opinion in Schaffner v. Monsanto. The concern is that this case provides judges who are inclined to favor corporate protection, such as those who support Monsanto, with a legal basis to do so, and we will likely see more opinions like this. October 10, 2024 – New $78 Million Verdict in Philadelphia The jury in Melissen awarded $3 million in compensatory damages and $75 million in punitive damages. Plaintiffs needed a big win, and we got one. September 11, 2024 – Loss in Philadelphia In Young v. Monsanto, a Philadelphia jury cleared Monsanto of liability, rejecting claims that its Roundup weedkiller caused the plaintiff’s non-Hodgkin lymphoma. The jury found that the plaintiff did not provide sufficient evidence to prove that Roundup was the cause of his cancer. Plaintiffs will not win every Roundup lawsuit. Some cases are stronger than others. But to put this in context, in the five Roundup cases tried in Philadelphia, plaintiffs have won three. The biggest verdict was $2.25 billion (later reduced to $404 million so we will use that number), while the two other wins included verdicts of $3.5 million and $175 million. Including those two losses, the average of these verdicts is approximately $194.17 million. August 16, 2024: Big Appellate Win for Bayer Bayer won a big victory in the 3rd Circuit yesterday. The court ruled that federal pesticide labeling regulations preempt state laws. This decision, stemming from a case in Pennsylvania, centers around whether the EPA-approved pesticide labels, which do not include cancer warnings for Roundup, override state requirements for such warnings. The court emphasized that once the EPA approves a label that omits specific health warnings, state laws demanding those warnings are preempted by federal law. I don’t think Bayer’s fantasy of this going to the U.S. Supreme Court will become a reality. But we do now have a split among federal appellate courts over the issue of federal preemption of state warning requirements on pesticides. So, it is more realistic today than it was before this opinion. July 23, 2024: Important Appellate Win in Oregon Plaintiff won a big appeal of a jury verdict in Oregon. The plaintiff contended that the trial court erred by excluding testimony from his expert, Dr. Charles Benbrook, regarding EPA regulations. Dr. Benbrook was set to explain the U.S. pesticide regulatory framework, including how the EPA reviews products under FIFRA, evaluates cancer risks, and issues labeling requirements. He would have highlighted how the EPA’s approach can differ from agencies like the International Agency for Research on Cancer (IARC), especially on glyphosate’s carcinogenicity. The Oregon appellate court ruled it was an error to exclude his testimony, reversed the judgment, and ordered a new trial. Monsanto cross-appealed, arguing FIFRA preempted the claims, but the court rejected that, just as every other court has, finding neither express nor implied preemption applied. June 5, 2024 – Roundup Verdict Reduced to $400 Million A Philadelphia Court of Common Pleas judge has reduced the verdict in McKivision from January from $2.25 billion to $400 million. I think the jury’s verdict should be respected. But we can all agree that $400 million is still an extremely large sum of money. May 23, 2024 – Existential Threat Bayer AG Chief Executive Officer Bill Anderson has described the ongoing wave of Roundup lawsuits over the widely used weedkiller Roundup as an “existential threat” to the company. Speaking at the Executives’ Club of Chicago, Anderson emphasized the dire nature of the litigation threat, admitting that the glyphosate litigation threatens Bayer’s ability to survive and innovate for farmers. If you read these updates regularly, how long have I been saying this? I swear I think he stole it from me. I’ve also been saying, like he says, that Monsanto makes a lot of other quality products. It does innovate for farmers. These two things can be true at the same time. I think it is an existential threat, not because it is a situation that cannot be controlled. It is because Bayer will not do what it knows it must to resolve this litigation. Yes, it will have to take some lumps and pay a lot of money in settlements. But isn’t that better than going bankrupt? That is where we are heading. April 6, 2024 – Billion Dollar Verdict Reduced A judge knocked back the $1.56 billion jury verdict in state court in Missouri to three plaintiffs in November last year to $611 million. Bayer will call it a win. But let’s all agree that a $611 million verdict is a darn good verdict. April 2, 2024 – New Roundup Lawsuits We got a call a few hours ago from a new client diagnosed with NHL in 2024. This one individual’s tragedy reminds us all how this particular litigation works. Obviously, there is a latency period between the time of exposure to Roundup and the onset of non-Hodgkin lymphoma. This means that after someone is exposed to Roundup, it could take several years before symptoms of non-Hodgkin lymphoma manifest. The latency period is the time required for the exposure to Roundup to initiate changes or damage in the body’s cells, which eventually can lead to the development of NHL and other forms of cancer. So if Bayer stops selling Roundup today – see the March 19 update below – we will still be seeing new claims for the next 10 years. This is bad news for Bayer. But discontinuing the product or putting a warning on it would at least start the clock on the end of any Roundup litigation. February 1, 2024 – What Is at Stake for Bayer Reuters has a quote that I think is really on point: January 30, 2023 – $6.7 Billion in Roundup Verdicts This is the updated scorecard of Roundup verdicts: The average payout for the last six Roundup lawsuits that went to trial, including a zero for the defense verdict, is a stunning $617,387,142.86. January 26, 2024 – McKivision Verdict The verdict is back in McKivision: $2.25 billion. The jury awarded $250 million in compensatory damages and $2 billion in punitive damages. This was an educated jury. Half of the 12 jurors were college-educated, and two had master’s degrees. Plaintiffs’ arguments are working in front of men, women, educated, uneducated, you name it. Whoever did the focus groups for Bayer and told their lawyers to shoot for an educated jury should be fired. Bayer should change the warning on Roundup today and do what it did last time – start settling cases with lawyers with the largest number of cases. I keep saying this verdict, and that verdict is a game changer, and we go back to business as usual. But this may be the verdict that turns the tide. January 11, 2024 – Monsanto’s “Cynical Diversion” One leitmotif in these comments is my complaint that Monsanto, for lack of a better phrase, is such a baby when it loses. Judge James Crumlish III of the Philadelphia Court of Common Pleas agrees. He sternly opposed Monsanto’s attempt to remove him from the case after a $175 million verdict as a transparent and manipulative tactic. He said the company’s goal is not to contest the trial’s evidence but to undermine the jury and the trial judge. He described Monsanto’s efforts as a delay tactic and a cynical diversion. Again, this is not a one-off. Monsanto has previously attempted to disqualify judges in other cases, alleging bias against their defense. These efforts include a failed attempt to disqualify a California judge and accusations of favoritism against another Philadelphia judge after a $3.5 million verdict. Monsanto is the litigation version of politics in 2024. If you disagree with me, it must be because you are acting in bad faith. Why does any of this really matter? Who cares if a defendant is being a baby? A rational defendant in Monsanto’s shoes right now would be doing everything it could to settle these lawsuits. But stuff like this makes you wonder if the company is rational about this litigation. I say the company… but maybe it is their outside lawyers. I’m not sure who is driving this train. But the adults in the room need to step up. 2023 Updates Roundup Update December 6, 2023 Bayer loses. Again. Yesterday, another Philadelphia jury ordered Bayer to pay nearly $3.5 million to a woman who alleged that the company’s Roundup weedkiller caused her cancer. The verdict, reached after a three-week trial and two days of jury deliberation, comprised $462,500 in compensatory damages and $3 million in punitive damages. This verdict represents Bayer’s fifth consecutive loss. There is another trial in Philadelphia next month. I predict that the verdict will be more than $3.5 million. In 15 trials, juries awarded victims a few thousand dollars shy of $4.5 billion. So, the average Roundup verdict is $300 million. If you multiply $300 million by the estimated 40,000 remaining cases, you get $12 trillion. (This is a little misleading because of trials with multiple plaintiffs, but you get the idea.) Roundup Update November 20, 2023 In a verdict that truly redefines this litigation, a Missouri jury ordered Monsanto on Friday to pay over $1.5 billion in damages to three former users of its Roundup weedkiller, who claimed the product caused their non-Hodgkin’s lymphomas. The state court in Jefferson City, Missouri, awarded the plaintiffs a combined $61.1 million in actual damages and $500 million each in punitive damages. Valorie Gunther from New York, Jimmy Draeger from Missouri, and Daniel Anderson from California were the plaintiffs in the lawsuit. All three were diagnosed with non-Hodgkin’s lymphoma. The jury determined that Monsanto was responsible for their injuries due to not providing sufficient warnings about the dangers of Roundup. These last four verdicts will almost certainly have an outsized impact on Roundup settlement amounts. Bayer keeps waiting to settle, hoping something good will happen. This is going from bad to worse to – I’ll say it again, existential threat – for Bayer. We will get another verdict in Philadelphia in Martel v. Nouryon Chemicals, probably early next month. Bayer should settle that case today. But it won’t. Roundup Update November 2, 2023 The Legal Intelligencer correctly reports that plaintiffs’ Roundup attorneys are ramping up the pressure on Bayer to resolve numerous lawsuits or remove its Roundup pesticide from the market after three substantial verdicts amounting to over half a billion dollars were awarded against Monsanto. Of course, the pressure of recent juries in Missouri, Pennsylvania, and California totaling over $500 million has changed the landscape. Plaintiffs’ lawyers want fair Roundup settlement offers and, at a minimum, a reasonable warning on the product. Here is a quote from a Cornell professor: “What’s surprising is they didn’t settle these cases. If I were Monsanto, I would settle the best cases with the best lawyers, and bring to trial the worst cases with the worst trials. I’m guessing they thought that was their strategy, too. But they made a mistake.” But, actually, this is how Monsanto won nine in a row, doing exactly this. But Bayer did not want to overpay, and the plaintiffs’ demands for settlement were just too high. Bayer is said to be weighing bankruptcy. But I don’t think they really are. One option is the Texas Two-Step. The “Texas two-step” is a corporate maneuver that involves a divisional merger strategy often associated with liability restructuring for companies facing numerous lawsuits. They know the Texas Two-Step will not work and will just cost them millions more in legal fees from a company that is already bleeding legal fees. Bayer could declare bankruptcy. But I do not think a single person within Bayer is really considering this as an option. I laid out the plan a few days ago. Settle these cases. Put a warning on the product. And get back to ruling the agricultural world. Roundup Update October 31, 2023 $332 million in Dennis. The jury awarded $7 million in compensatory damages and $325 million in punitive damages. Getting one huge verdict last week was great. But now three for three in just a few weeks, totaling over $500 million, is a complete game changer. Yes, Bayer won nine trials in a row. We kept telling you it was smoke and mirrors – they are letting weak cases go to trial. These last three verdicts prove this hypothesis. Like Caranci, there was nothing unusual about Mr. Dennis’s case. He used Roundup on his lawn and garden for 35 years and was diagnosed with non-Hodgkin’s lymphoma at age 51. These typical Roundup lawsuits are getting these incredible verdicts. It is time to start talking about whether Roundup is an existent"
}