{
  "url": "https://en.wikipedia.org/wiki/Bayram_(Turkey)",
  "title": "Bayram (Turkey) - Wikipedia",
  "text": "Bayram (Turkey) Bayram is the Turkic word for a nationally-celebrated festival or holiday, applicable to both national (i.e. secular) and religious celebrations. Likely owing to the enduring Ottoman Turkish influence in the Balkans and parts of South-Eastern Europe, many non-Turkish peoples like Romanians, Bosniaks, Albanian Muslims, Gorani people, Pomaks as well as Muslims from the Northern Caucasus such as Chechens, Avars, Ingush and Muslims from Azerbaijan, Crimea and other Turkic peoples, have similarly adopted the use of the word \"Bayram\", using the term \"Lesser Bairam\" to refer to their own Eid al-Fitr celebrations; \"Greater Bairam\" refers to Eid al Adha.[1] State holidays in Turkey have set dates under the nationally-used Gregorian Calendar, while the Islamic religious holidays are coordinated and publicly announced in advance by the Government's Presidency of Religious Affairs department according to the Lunar Calendar, and are subsequently accommodated into the national Gregorian Calendar, which results in the dates for religious holidays changing every year with a shift margin of approximately 11 days. Large scale non-Turkish or non-Islamic traditions and celebrations may similarly be called Bayram. Halloween is called \"Cadılar Bayramı\" (\"Bayram of Witches\"), Easter is \"Paskalya Bayramı\" (\"Easter Bayram\"), Christmas is \"Noel Bayramı\" (\"Christmas Bayram\"), Passover is \"Hamursuz Bayramı\" (\"No-dough Bayram\"), and Hanukkah is \"Yeniden Adanma Bayramı\" (\"Renewal\" or \"Rededication Bayram\"). Not every special occasion or holiday is referred to as a Bayram; those that are not include World Health Day, and Liberation of Istanbul, among others.[2] National festivals of Turkey [edit]- New Years' Day (\"Yılbaşı\" or \"Yılbaşı Bayramı\")[3] - National Sovereignty and Children's Day (\"Ulusal Egemenlik ve Çocuk Bayramı\"), April 23 (1920)[4] - Workers' Day (\"İşçi Bayramı\"), May 1 - Commemoration of Atatürk, Youth and Sports Day (\"Atatürk'ü Anma, Gençlik ve Spor Bayramı\"), May 19 (1919)[5] - Victory Day (\"Zafer Bayramı\"), August 30 (1922) - Republic Day (\"Cumhuriyet Bayramı\"), October 29 (1923)[6] - Cabotage Day is coasting festival for the anniversary of Turkish coasting independence (cabotage rights). Every First July (1926)[7] - Turkism Day, 3 May (1945) - Democracy and National Unity Day, 15 July (2016) Former national festival - Freedom and Constitution Day (\"Hürriyet ve Anayasa Bayramı\"), May 27 (1960) - İyd-i Millî, 23 July (1909) Religious festivals of Turkey [edit]- Eid al-Fitr (\"Şeker Bayramı\", i.e. \"Bayram of Sweets\", or, \"Ramazan Bayramı\", i.e. \"Ramadan Bayram\"), 1st of Shawwal - Eid al-Adha (\"Kurban Bayramı\", i.e. \"Sacrifice Bayram\"), Dhu al-Hijjah 10-13 - Passover (\"Hamursuz\" (mean matzah) bayramı, mostly celebrated by Turkish Jews or Jewish minorities and also locally celebrated by some unreligious groups as folk festival)[8] - Easter (It is commonly called \"paskalya yortusu“ in western Turkey; some groups in the east call it \"Paskalya Bayramı)[9] Folk festivals [edit]- Nowruz (“Nevruz Bayramı\" or \"Ergenekon Bayramı\" celebrates the spring equinox.[2] - Hidirellez bayramı is for the start of spring and summer days. - Kosaqan or Yılgayakh - A spring feast and festival Turkic and Altai folklore. - Sayaqan or Yhyakh - A summer feast and festival Turkish folklore. - Paktaqan - An autumn feast and festival Turkic and Altai folklore. - Paynaqan - A winter and pine tree feast and festival in Turkic and Altai folklore. - Nardoqan - Nardoqan or Narduğan was a Turkic-Mongolian holiday for the winter solstice. See also [edit]References [edit]- ^ Newby, Gordon (2013). A Concise Encyclopedia of Islam. London: Oneworld Publications. p. 43. ISBN 978-1-78074-477-3. - ^ a b Ahmady, Kameel 2009: Another Look at East and Southeast Turkey. GABB Publication, Diyarbakır. p 248. - ^ \"New Year's Eve 2023 in Turkey\". www.timeanddate.com. Retrieved 6 October 2023. - ^ \"National Sovereignty and Children's Day\". tc-america.org. Retrieved 6 October 2023. - ^ \"Türkiye observes Commemoration of Ataturk, Youth and Sports Day\". www.aa.com.tr. Retrieved 6 October 2023. - ^ Kiani, Tamkeen (6 June 2022). \"Turkey Republic Day\". National Today. Retrieved 6 October 2023. - ^ 1 Temmuz Kabotaj Bayramı ve Başkanlığımızın Mesajı Çanakkale Liman Başkanlığı (in Turkish) 1 July 2014 Archived 24 March 2015 at the Wayback Machine - ^ \"Hamursuz Bayramı Mesajı\". www.hatay.gov.tr. Archived from the original on 16 April 2023. Retrieved 13 April 2023. - ^ \"Süryaniler Paskalya Bayramı kutlamayacak\". 16 April 2014. Archived from the original on 2 April 2018. Retrieved 1 April 2018. External links [edit]- Türk Dil Kurumu (TDK, Turkish Language Association): Definition of the word Bayram (The dictionary data base on the TDK site based on: Divanü Lugati't-Türk (\"Compendium of the languages of the Turks\") of Mahmud al-Kashgari, 1072–1074)"
}