{
  "url": "https://en.wikipedia.org/wiki/Aleppo",
  "title": "Aleppo - Wikipedia",
  "text": "Aleppo Aleppo[b] is a city in northern Syria, which serves as the capital of the Aleppo Governorate, the country's most populous governorate.[8] With an estimated population of 2,098,000 residents as of 2021,[update][9] it is Syria's largest city by urban area, and was the largest by population until it was surpassed by Damascus, the capital of Syria. Aleppo is also the largest city in Syria's northern governorates and one of the largest cities in the Levant region.[10][11][12] Aleppo is one of the oldest continuously inhabited cities in the world; it may have been inhabited since the sixth millennium BC.[13][14][15][16][17] Excavations at Tell as-Sawda and Tell al-Ansari, just south of the old city of Aleppo, show that the area was occupied by Amorites by the latter part of the third millennium BC.[18] That is also the time at which Aleppo is first mentioned in cuneiform tablets unearthed in Ebla and Mesopotamia, which speak of it as part of the Amorite state of Yamhad, and note its commercial and military importance.[19] Such a long history is attributed to its strategic location as a trading center between the Mediterranean Sea and Mesopotamia. For centuries, Aleppo was the largest city in the Syrian region, and the Ottoman Empire's third-largest after Constantinople (now Istanbul) and Cairo.[20][21][22] The city's significance in history has been its location at one end of the Silk Road, which passed through Central Asia and Mesopotamia. When the Suez Canal was inaugurated in 1869, much trade was diverted to sea and Aleppo began its slow decline. At the fall of the Ottoman Empire after World War I, Aleppo lost its northern hinterland to modern Turkey, as well as the important Baghdad Railway connecting it to Mosul. In 1939, it lost its main access to the sea, by Antakya and İskenderun, also to Turkey. The growth in importance of Damascus in the past few decades further exacerbated the situation. This decline may have helped to preserve the old city of Aleppo, its medieval architecture and traditional heritage. It won the title of the Islamic Capital of Culture 2006 and has had a wave of successful restorations of its historic landmarks. The battle of Aleppo occurred in the city during the Syrian civil war, and many parts of the city suffered massive destruction.[23][24] Affected parts of the city are currently undergoing reconstruction.[25][26] An estimated 31,000 people were killed in Aleppo during the conflict.[27] Etymology [edit]Proto-Semitic Origins [edit]The etymology of the name Aleppo (Arabic: Ḥalab, حلب) is ancient and rooted in the long history of the region. The name Ḥalab is believed to originate from a Semitic root, possibly the Proto-Semitic root ḥlb, meaning \"to milk\" or \"milk\". This connection might have arisen due to the area's association with pastoralism and the production of milk. Another possibility is that the name refers to the color \"white\", as the root ḥlb could metaphorically describe the pale or white hue of certain local soils or materials.[28] Similarly, the modern-day nickname al-Shahbāʾ (Arabic: الشهباء), meaning \"the white-colored mixed with black\", is said to be derived from its famed white marble.[29] Amorite Origins and Hittite Influence [edit]During the second millennium BCE, it became a key city of the Amorite state, who referred to it as Ḥalab. The Hittites, a contemporary Anatolian Empire within the region, referred to the city as Ḥalpa or Ḥalpu in their inscriptions. This indicates the name was already well-established by this time.[30] Aramaic and Akkadian Adaptations [edit]In Aramaic, the city retained a similar name, with forms like Ḥalba. Akkadian sources also refer to the city as Ḥalab.[31] Greek and Roman Periods [edit]During the Hellenistic and Roman periods, Aleppo was known as Beroea (Βέροια in Greek), a name likely assigned by the Seleucid rulers after the Macedonian city of the same name. Despite this, the local population continued to use the original Semitic name.[32][33] Islamic Period [edit]With the advent of Islam and the Arabization of the region, the name Ḥalab (Arabic: حلب) remained in use, reflecting its deep historical continuity. The Arabic form also preserved its earlier meanings, with folklore often associating the name with the prophet Abraham, who is said to have \"milked\" his livestock in the area to provide for travelers.[34] Modern-day English [edit]The adoption of \"Aleppo\" into English likely coincided with the Crusades (11th–13th centuries) and subsequent increased trade and travel between Europe and the Middle East. By the late 14th to early 15th centuries, the term Aleppo was well-established in English literature and travel accounts.[35] The earliest documented use of \"Aleppo\" in English occurs in translations of medieval texts and chronicles, such as the travel writings of Marco Polo, where the city is mentioned as a key trading hub. Additionally, it was featured in maps and documents produced during the European Renaissance as a center of commerce on the Silk Road.[36] History [edit]Pre-history and pre-classical era [edit]Aleppo has scarcely been touched by archaeologists, since the modern city occupies its ancient site. The earliest occupation of the site was around 8,000 BC, as shown by excavations in Tallet Alsauda.[37][unreliable source?] Aleppo appears in historical records as an important city much earlier than Damascus. The first record of Aleppo comes from the third millennium BC, in the Ebla tablets when Aleppo was referred to as Ha-lam (𒄩𒇴).[38] This has been identified as an early form of Ḥalab due to an interchange of /m/ and /b/ that has been attested in Sumerian texts, including with the cuneiform sign Lam.[39] Some historians, such as Wayne Horowitz, identify Aleppo with the capital of an independent kingdom closely related to Ebla, known as Armi,[40] although this identification is contested. The main temple of the storm god Hadad was located on the citadel hill in the center of the city,[41] when the city was known as the city of Hadad.[42] Naram-Sin of Akkad mentioned his destruction of Ebla and Armanum,[43] in the 23rd century BC.[44][45] However, the identification of Armani in the inscription of Naram-Sim as Armi in the Eblaite tablets is heavily debated,[46] as there was no Akkadian annexation of Ebla or northern Syria.[46] In the Old Babylonian and Old Assyrian Empire period, Aleppo's name appears in its original form as Ḥalab (Ḥalba) for the first time.[45] Aleppo was the capital of the important Amorite dynasty of Yamḥad. The kingdom of Yamḥad (c. 1800–1525 BC), alternatively known as the 'land of Ḥalab,' was one of the most powerful in the Near East during the reign of Yarim-Lim I, who formed an alliance with Hammurabi of Babylonia against Shamshi-Adad I of Assyria.[47] Hittite period [edit]Yamḥad was devastated by the Hittites under Mursili I in the 16th century BC. However, it soon resumed its leading role in the Levant when the Hittite power in the region waned due to internal strife.[45] Taking advantage of the power vacuum in the region, Baratarna, king of the Hurrian kingdom of Mitanni instigated a rebellion that ended the life of Yamhad's last king Ilim-Ilimma I in c. 1525 BC,[48] Subsequently, Parshatatar conquered Aleppo and the city found itself on the frontline in the struggle between the Mitanni, the Hittites and Egypt.[45] Niqmepa of Alalakh who descends from the old Yamhadite kings controlled the city as a vassal to Mitanni and was attacked by Tudhaliya I of the Hittites as a retaliation for his alliance to Mitanni.[49] Later the Hittite king Suppiluliumas I permanently defeated Mitanni, and conquered Aleppo in the 14th century BC. Suppiluliumas installed his son Telepinus as king and a dynasty of Suppiluliumas descendants ruled Aleppo until the Late Bronze Age collapse.[50] However, Talmi-Šarruma, grandson of Suppiluliumas I, who was the king of Aleppo, had fought on the Hittite side, along with king Muwatalli II during the Battle of Kadesh against the Egyptian army led by Ramesses II.[c] Aleppo had cultic importance to the Hittites as the center of worship of the Storm-God.[45] This religious importance continued after the collapse of the Hittite empire at the hands of the Assyrians and Phrygians in the 12th century BC, when Aleppo became part of the Middle Assyrian Empire,[52] whose king renovated the temple of Hadad which was discovered in 2003.[53] In 2003, a statue of a king named Taita bearing inscriptions in Luwian was discovered during excavations conducted by German archeologist Kay Kohlmeyer in the Citadel of Aleppo.[54] The new readings of Anatolian hieroglyphic signs proposed by the Hittitologists Elisabeth Rieken and Ilya Yakubovich were conducive to the conclusion that the country ruled by Taita was called Palistin.[55] This country extended in the 11th-10th centuries BC from the Amouq Valley in the west to Aleppo in the east down to Maharda and Shaizar in the south.[56] Due to the similarity between Palistin and Philistines, Hittitologist John David Hawkins (who translated the Aleppo inscriptions) hypothesizes a connection between the Syro-Hittite states Palistin and the Philistines, as do archaeologists Benjamin Sass and Kay Kohlmeyer.[57] Gershon Galil suggests that King David halted the Arameans' expansion into the Land of Israel on account of his alliance with the southern Philistine kings, as well as with Toi, king of Ḥamath, who is identified with Tai(ta) II, king of Palistin (the northern Sea Peoples).[58] State of Bit Agusi [edit]During the early years of the 1st millennium BC, Aleppo was incorporated into the Aramean realm of Bit Agusi, which held its capital at Arpad.[59] Bit Agusi along with Aleppo and the entirety of the Levant was conquered by the Assyrians in the 8th century BC and became part of the Neo-Assyrian Empire during the reign of Tiglath-Pileser III until the late 7th century BC,[60] before passing through the hands of the Neo-Babylonians and the Achaemenid Persians.[61] The region remained known as Aramea and Eber Nari throughout these periods. Classical antiquity (Beroea) [edit]Alexander the Great took over the city in 333 BC. Seleucus Nicator established a Hellenic settlement in the site between 301 and 286 BC. He called it Beroea (Βέροια), after Beroea in Macedon; it is sometimes spelled as Beroia. Beroea is mentioned in 1 Macc. 9:4. Northern Syria was the center of gravity of the Hellenistic world and Greek culture in the Seleucid Empire. As did other Greek cities of the Seleucid kingdom, Beroea probably enjoyed a measure of local autonomy, with a local civic assembly or boulē composed of free Hellenes.[62] Beroea remained under Seleucid rule until 88 BC when Syria was conquered by the Armenian king Tigranes the Great and Beroea became part of the Kingdom of Armenia.[63] After the Roman victory over Tigranes, Syria was handed over to Pompey in 64 BC, at which time they became a Roman province. Rome's presence afforded relative stability in northern Syria for over three centuries. Although the province was administered by a legate from Rome, Rome did not impose its administrative organization on the Greek-speaking ruling class or Aramaic speaking populace.[62] The Roman era saw an increase in the population of northern Syria that accelerated under the Byzantines well into the 5th century. In Late Antiquity, Beroea was the second largest Syrian city after Antioch, the capital of Roman Syria and the third largest city in the Roman world. Archaeological evidence indicates a high population density for settlements between Antioch and Beroea right up to the 6th century. This agrarian landscape still holds the remains of large estate houses and churches such as the Church of Saint Simeon Stylites.[62] Ecclesiastical history [edit]The names of several bishops of the episcopal see of Beroea, which was in the Roman province of Syria Prima, are recorded in extant documents. The first whose name survives is that of Saint Eustathius of Antioch, who, after being bishop of Beroea, was transferred to the important metropolitan see of Antioch shortly before the 325 First Council of Nicaea. His successor in Beroea Cyrus was for his fidelity to the Nicene faith sent into exile by the Roman Emperor Constantius II. After the Council of Seleucia of 359, called by Constantius, Meletius of Antioch was transferred from Sebastea to Beroea but in the following year was promoted to Antioch. His successor in Beroea, Anatolius, was at a council in Antioch in 363. Under the persecuting Emperor Valens, the bishop of Beroea was Theodotus, a friend of Basil the Great. He was succeeded by Acacius of Beroea, who governed the see for over 50 years and was at the First Council of Constantinople in 381 and the Council of Ephesus in 431. In 438, he was succeeded by Theoctistus, who participated in the Council of Chalcedon in 451 and was a signatory of the joint letter that the bishops of the province of Syria Prima sent in 458 to Emperor Leo I the Thracian about the murder of Proterius of Alexandria. In 518, Emperor Justin I exiled the bishop of Beroea Antoninus for rejecting the Council of Chalcedon. The last known bishop of the see is Megas, who was at a synod called by Patriarch Menas of Constantinople in 536.[64][65] After the Arab conquest, Beroea ceased to be a residential bishopric, and is today listed by the Roman Catholic Church as a titular see.[66] Very few physical remains have been found from the Roman and Byzantine periods in the Citadel of Aleppo. The two mosques inside the Citadel are known to have been converted by the Mirdasids during the 11th century from churches originally built by the Byzantines.[67] Medieval period [edit]Early Islamic period [edit]The Sasanian Persians led by King Khosrow I pillaged and burned Aleppo in 540,[68][69] then they invaded and controlled Syria briefly in the early 7th century. Soon after Aleppo was taken by the Rashidun Muslims under Abu Ubaidah ibn al-Jarrah in 637. It later became part of Jund Qinnasrin under the Umayyad Caliphate. In 944, it became the seat of an independent Emirate under the Hamdanid prince Sayf al-Dawla, and enjoyed a period of great prosperity, being home to the great poet al-Mutanabbi and the philosopher and polymath al-Farabi.[70] In 962, the city was sacked by the Byzantine general Nikephoros Phokas.[71] Subsequently, the city and its emirate became a temporary vassal of the Byzantine Empire. For the next few decades, the city was disputed by the Fatimid Caliphate and Byzantine Empire, with the nominally independent Hamdanids in between, eventually falling to the Fatimids in 1017.[72] In 1024, Salih ibn Mirdas launched an attack on Fatimid Aleppo, and after a few months was invited into the city by its population.[73] The Mirdasid dynasty then ruled the city until 1080, interrupted only in 1038–1042, when it was in the hands of the Fatimid commander-in-chief in Syria, Anushtakin al-Dizbari, and in 1057–1060, when it was ruled by a Fatimid governor, Ibn Mulhim. Mirdasid rule was marked by internal squabbles between different Mirdasid chieftains that sapped the emirate's power and made it susceptible to external intervention by the Byzantines, Fatimids, Uqaylids, and Turkoman warrior bands.[74] Seljuq and Ayyubid periods [edit]In late 1077, Seljuk emir Tutush I launched a campaign to capture Aleppo during the reign of Sabiq ibn Mahmud of the Mirdasid dynasty, which lasted until 1080, when his reinforcements were ambushed and routed by a coalition of Arab tribesmen led by Kilabi chief Abu Za'ida at Wadi Butnan.[75] After the death of Sharaf al-Dawla of the Uqaylid dynasty in June 1085, the headman in Aleppo Sharif Hassan ibn Hibat Allah Al-Hutayti promised to surrender the city to Sultan Malik-Shah I. When the latter delayed his arrival, Hassan contacted the Sultan's brother Tutush. However, after Tutush defeated Suleiman ibn Qutulmish, who had intended to take Aleppo for himself, in the battle of Ain Salm, Hassan went back on his commitment. In response, Tutush attacked the city and managed to get hold of parts of the walls and towers in July 1086, but he left in September, either due to the advance of Malik-Shah or because the Fatimids were besieging Damascus.[76][77] In 1087, Aq Sunqur al-Hajib became the Seljuk governor of Aleppo under Sultan Malik Shah I.[78] During his bid for the Seljuk throne, Tutush had Aq Sunqur executed and after Tutush died in battle, the town was ruled by his son Ridwan.[79][80] The city was besieged by Crusaders led by the King of Jerusalem Baldwin II in 1124–1125, but was not conquered after receiving protection by forces of Aqsunqur al Bursuqi arriving from Mosul in January 1125.[81] In 1128, Aleppo became capital of the expanding Zengid dynasty, which ultimately conquered Damascus in 1154. In 1138, Byzantine emperor John II Komnenos led a campaign, which main objective was to capture the city of Aleppo. On 20 April 1138, the Christian army including Crusaders from Antioch and Edessa launched an attack on the city but found it too strongly defended, hence John II moved the army southward to take nearby fortresses.[82] On 11 October 1138, a deadly earthquake ravaged the city and the surrounding area. Although estimates from this time are very unreliable, it is believed that 230,000 people died, making it the seventh deadliest earthquake in recorded history. In 1183, Aleppo came under the control of Saladin and then the Ayyubid dynasty. When the Ayyubids were toppled in Egypt by the Mamluks, the Ayyubid emir of Aleppo An-Nasir Yusuf became sultan of the remaining part of the Ayyubid Empire. He ruled Syria from his seat in Aleppo until, on 24 January 1260,[83] the city was taken by the Mongols under Hulagu in alliance with their vassals the Frankish knights of the ruler of Antioch Bohemond VI and his father-in-law the Armenian ruler Hethum I.[84] The city was poorly defended by Turanshah, and as a result the walls fell after six days of siege, and the citadel fell four weeks later. The Muslim population was massacred and many Jews were also killed.[85] The Christian population was spared. Turanshah was shown unusual respect by the Mongols, and was allowed to live because of his age and bravery. The city was then given to the former Emir of Homs, al-Ashraf, and a Mongol garrison was established in the city. Some of the spoils were also given to Hethum I for his assistance in the attack. The Mongol Army then continued on to Damascus, which surrendered, and the Mongols entered the city on 1 March 1260.[86] Mamluk period [edit]In September 1260, the Egyptian Mamluks negotiated for a treaty with the Franks of Acre which allowed them to pass through Crusader territory unmolested, and engaged the Mongols at the Battle of Ain Jalut on 3 September 1260. The Mamluks won a decisive victory, killing the Mongols' Nestorian Christian general Kitbuqa, and five days later they had retaken Damascus. Aleppo was recovered by the Muslims within a month, and a Mamluk governor placed to govern the city. Hulagu sent troops to try to recover Aleppo in December. They were able to massacre a large number of Muslims in retaliation for the death of Kitbuqa, but after a fortnight could make no other progress and had to retreat.[87] The Mamluk governor of the city became insubordinate to the central Mamluk authority in Cairo, and in Autumn 1261 the Mamluk leader Baibars sent an army to reclaim the city. In October 1271, the Mongols led by general Samagar took the city again, attacking with 10,000 horsemen from Anatolia, and defeating the Turcoman troops who were defending Aleppo. The Mamluk garrisons fled to Hama, until Baibars came north again with his main army, and the Mongols retreated.[88] On 20 October 1280, the Mongols took the city again, pillaging the markets and burning the mosques.[89] The Muslim inhabitants fled for Damascus, where the Mamluk leader Qalawun assembled his forces. When his army advanced following the Second Battle of Homs in October 1281, the Mongols again retreated, back across the Euphrates. In October 1299, Ghazan captured the city, joined by his vassal Armenian King Hethum II, whose forces included some Templars and Hospitallers.[90] In 1400, the Mongol-Turkic leader Tamerlane captured the city again from the Mamluks.[91] He massacred many of the inhabitants, ordering the building of a tower of 20,000 skulls outside the city.[92] After the withdrawal of the Mongols, all the Muslim population returned to Aleppo. On the other hand, Christians who left the city during the Mongol invasion, were unable to resettle back in their own quarter in the old town, a fact that led them to establish a new neighbourhood in 1420, built at the northern suburbs of Aleppo outside the city walls, to become known as al-Jdeydeh quarter (\"new district\" Arabic: جديدة). Ottoman era [edit]Aleppo became part of the Ottoman Empire in 1516 as part of the vast expansion of the Ottoman borders during the reign of Selim I. The city then had around 50,000 inhabitants, or 11,224 households according to an Ottoman census.[93] In 1517, Selim I obtained a fatwa from Sunnite religious leaders and unleashed violence on the Alawites, killing 9,400 men, which is known as the Massacre of the Telal.[94] It was the centre of the Aleppo Eyalet; the rest of what later became Syria was part of either the eyalets of Damascus, Tripoli, Sidon or Raqqa. Following the Ottoman provincial reform of 1864 Aleppo became the centre of the newly constituted Vilayet of Aleppo in 1866. Aleppo's agriculture was well-developed in the Ottoman period. Archaeological excavations revealed water mills in its river basin.[95][96] Contemporary Chinese source also suggests Aleppo in the Ottoman period had well-developed animal husbandry.[96] During his travels to the Levant in the 17th century, French traveler Jacques Goujon recounted how the Maronite community in Aleppo, facing financial difficulties and considering conversion to Islam due to their inability to pay the jizya tax, was aided by the Franciscans who bought their church, enabling them to meet their tax obligations.[97] Moreover, thanks to its strategic geographic location on the trade route between Anatolia and the east, Aleppo rose to high prominence in the Ottoman era, at one point being second only to Constantinople in the empire. By the middle of the 16th century, Aleppo had displaced Damascus as the principal market for goods coming to the Mediterranean region from the east. This is reflected by the fact that the Levant Company of London, a joint-trading company founded in 1581 to monopolize England's trade with the Ottoman Empire, never attempted to settle a factor, or agent, in Damascus, despite having had permission to do so. Aleppo served as the company's headquarters until the late 18th century.[98] As a result of the economic development, many European states had opened consulates in Aleppo during the 16th and the 17th centuries, such as the consulate of the Republic of Venice in 1548, the consulate of France in 1562, the consulate of England in 1583 and the consulate of the Netherlands in 1613.[99] The Armenian community of Aleppo also rose to prominence in this period as they moved into the city to take up trade and developed the new quarter of Judayda.[100] The most outstanding among Aleppine Armenian merchants during the late 16th and early 17th centuries were Khwaja Petik Chelebi, the richest merchant in the city, and his brother Khwaja Sanos Chelebi, who monopolized Aleppine silk trade and were important patrons of the Armenians.[101][102] However, the prosperity Aleppo experienced in the 16th and 17th century started to fade as silk production in Iran went into decline with the fall of the Safavid dynasty in 1722. By mid-century, caravans were no longer bringing silk from Iran to Aleppo, and local Syrian production was insufficient for Europe's demand. European merchants left Aleppo and the city went into an economic decline that was not reversed until the mid-19th century when locally produced cotton and tobacco became the principal commodities of interest to the Europeans.[98] According to Halil İnalcık, \"Aleppo ... underwent its worst catastrophe with the wholesale destruction of its villages by Bedouin raiding in the later years of the century, creating a long-running famine which by 1798 killed half of its inhabitants.\"[103] The economy of Aleppo was badly hit by the opening of the Suez Canal in 1869. This, in addition to political instability that followed the implementation of significant reforms in 1841 by the central government, contributed to Aleppo's decline and the rise of Damascus as a serious economic and political competitor with Aleppo.[98] The city nevertheless continued to play an important economic role and shifted its commercial focus from long-distance caravan trade to more regional trade in wool and agricultural products. This period also saw the immigration of numerous \"Levantine\" (European-origin) families who dominated international trade. Aleppo's mixed commercial tribunal (ticaret mahkamesi), one of the first in the Ottoman Empire, was set up around 1855.[104] Reference is made to the city in 1606 in William Shakespeare's Macbeth. The witches torment the captain of the ship the Tiger, which was headed to Aleppo from England and endured a 567-day voyage before returning unsuccessfully to port. Reference is also made to the city in Shakespeare's Othello when Othello speaks his final words (ACT V, ii, 349f.): \"Set you down this/And say besides that in Aleppo once,/Where a malignant and a turbanned Turk/Beat a Venetian and traduced the state,/I took by th' throat the circumcised dog/And smote him—thus!\" (Arden Shakespeare Edition, 2004). The English naval chaplain Henry Teonge describes in his diary a visit he paid to the city in 1675, when there was a colony of Western European merchants living there. The city remained under Ottoman rule until the empire's collapse, but was occasionally riven with internal feuds as well as attacks of cholera from 1823. Around 20–25 percent of the population died of plague in 1827.[105] In 1850, a Muslim mob attacked Christian neighbourhoods, tens of Christians were killed and several churches looted. Though this event has been portrayed as driven by pure sectarian principles, Bruce Masters argues that such analysis of this period of violence is too shallow and neglects the tensions that existed among the population due to the commercial favor afforded to certain Christian minorities by the Tanzimat Reforms during this time which played a large role in creating antagonism between previously cooperative groups of Muslim and Christians in the eastern quarters of the city.[106] By 1901, the city's population was around 110,000. In October 1918, Aleppo was captured by Prince Feisal's Sherifial Forces and the 5th Cavalry Division of the Allied forces from the Ottoman Empire during the World War I. At the end of war, the Treaty of Sèvres made most of the Vilayet of Aleppo, including the cities of Urfa, Marash, and Aintab, part of the newly established nation of Syria. However, Kemal Atatürk annexed most of the Vilayet of Aleppo as well as Allied-controlled Cilicia to Turkey in his War of Independence. The Muslim Arab and Kurdish residents in the province supported the Turks in this war against the French, including the leader of the Hananu Revolt, Ibrahim Hananu, who directly coordinated with Atatürk and received weaponry from him. The outcome, however, was disastrous for Aleppo, because as per the Treaty of Lausanne, most of the vilayet was made part of Turkey with the exception of Aleppo and Alexandretta;[107] thus Aleppo was cut from its northern satellites which connected it to the Anatolian cities beyond on which Aleppo depended heavily in commerce. Moreover, the Sykes-Picot division of the Near East separated Aleppo from most of Mesopotamia, including its twin city of Mosul, which also harmed the economy of Aleppo. The outcome of these newly created borders was epochal, as they redirected Syria's would-be capital from Aleppo to Damascus. French mandate [edit]The State of Aleppo was declared by French General Henri Gouraud in September 1920 as part of a French plan to make Syria easier to administer by dividing it into several smaller states. France became more concerned about the idea of a united Syria after the Battle of Maysaloun. By separating Aleppo from Damascus, Gouraud wanted to capitalize on a traditional state of competition between the two cities and turn it into political division. The people in Aleppo were unhappy with the fact that Damascus was chosen as capital for the new nation of Syria. Gouraud sensed this sentiment and tried to address it by making Aleppo the capital of a large and wealthier state with which it would have been hard for Damascus to compete. The State of Aleppo as drawn by France contained most of the fertile area of Syria: the fertile countryside of Aleppo in addition to the entire fertile basin of river Euphrates. The state also had access to sea via the autonomous Sanjak of Alexandretta. On the other hand, Damascus, which is basically an oasis on the fringes of the Syrian Desert, had neither enough fertile land nor access to sea. Basically, Gouraud wanted to satisfy Aleppo by giving it control over most of the agricultural and mineral wealth of Syria so that it would never want to unite with Damascus again.[108][109] Damascus's relative economic weakness was further exacerbated by the economic success of Beirut during the 1920s, a territory part of the larger French Mandate at the time.[110] The limited economic resources of the Syrian states made the option of completely independent states undesirable for France, because it threatened an opposite result: the states collapsing and being forced back into unity. This was why France proposed the idea of a Syrian federation that was realized in 1923. Initially, Gouraud envisioned the federation as encompassing all the states, even Lebanon. In the end however, only three states participated: Aleppo, Damascus, and the Alawite State. The capital of the federation was Aleppo at first, but it was relocated to Damascus. The president of the federation was Subhi Barakat, an Antioch-born politician from Aleppo. The federation ended in December 1924, when France merged Aleppo and Damascus into a single Syrian State and separated the Alawite State again. This action came after the federation decided to merge the three federated states into one and to take steps encouraging Syria's financial independence, steps which France viewed as too much.[108][109] When the Syrian Revolt erupted in southern Syria in 1925, the French held in Aleppo State new elections that were supposed to lead to the breaking of the union with Damascus and restore the independence of Aleppo State. The French were driven to believe by pro-French Aleppine politicians that the people in Aleppo were supportive of such a scheme. After the new council was elected, however, it surprisingly voted to keep the union with Damascus. Syrian nationalists had waged a massive anti-secession public campaign that vigorously mobilized the people against the secession plan, thus leaving the pro-French politicians no choice but to support the union. The result was a big embarrassment for France, which wanted the secession of Aleppo to be a punitive measure against Damascus, which had participated in the Syrian Revolt, however, the result was respected. This was the last time that independence was proposed for Aleppo.[111] Bad economic situation of the city after the separation of the northern countryside was exacerbated further in 1939 when Alexandretta was annexed to Turkey as Hatay State,[112][113][114] thus depriving Aleppo of its main port of Iskenderun and leaving it in total isolation within Syria.[115] Post-independence [edit]The increasing disagreements between Aleppo and Damascus led eventually to the split of the National Block into two factions: the National Party, established in Damascus in 1946, and the People's Party, established in Aleppo in 1948 by Rushdi al-Kikhya, Nazim Qudsi and Mustafa Bey Barmada.[116] An underlying cause of the disagreement, in addition to the union with Iraq, was Aleppo's intention to relocate the capital from Damascus. The issue of the capital became an open debate matter in 1950 when the Popular Party presented a constitution draft that called Damascus a \"temporary capital\".[117] The first coup d'état in modern Syrian history was carried out in March 1949 by an army officer from Aleppo, Hussni Zaim. However, lured by the absolute power he enjoyed as a dictator, Zaim soon developed a pro-Egyptian, pro-Western orientation and abandoned the cause of union with Iraq. This incited a second coup only four months after his.[118] The second coup, led by Sami Hinnawi (also officer from Aleppo), empowered the Popular Party and actively sought to realize the union with Iraq. The news of an imminent union with Iraq incited a third coup the same year: in December 1949, Adib Shishakly led a coup preempting a union with Iraq that was about to be declared.[119] Soon after Shishakly's domination ended in 1954, a union with Egypt under Gamal Abdul Nasser was implemented in 1958. The union, however, collapsed three and a half years later when a junta of young Damascene officers carried out a separatist coup. Aleppo resisted the separatist coup, but eventually it had no choice but to recognize the new government.[120] In March 1963 a coalition of Baathists, Nasserists, and Socialists launched a new coup whose declared objective was to restore the union with Egypt. However, the new government only restored the flag of the union. Soon thereafter disagreement between the Baathists and the Nasserists over the restoration of the union became a crisis, and the Baathists ousted the Nasserists from power. The Nasserists, most of whom were from the Aleppine middle class, responded with an insurgency in Aleppo in July 1963. Again, the Ba'ath government tried to absorb the dissent of the Syrian middle class (whose center of political activism was Aleppo) by putting to the front Amin al-Hafiz, a Baathist military officer from Aleppo.[121] President Hafez al-Assad, who came to power in 1970, relied on support from the business class in Damascus.[122] This gave Damascus further advantage over Aleppo, and hence Damascus came to dominate the Syrian economy. The strict centralization of the Syrian state, the intentional direction of resources towards Damascus, and the hegemony Damascus enjoys over the Syrian economy made it increasingly hard for Aleppo to compete. Despite this, Aleppo remained a nationally important economic and cultural center.[123] On 16 June 1979, thirty-two military cadets were massacred by antigovernmental Islamist rebel group Muslim Brotherhood.[124][125] In the subsequent violence around fifty people were killed.[126] On 10 July a further twenty-two Syrian soldiers were killed.[127] Both terrorist attacks were part of the Islamist uprising in Syria.[128] In 1980, events escalated into the a large-scale military operation in Aleppo, where Syrian government responded with military and security forces, sending in tens of thousands of troops backed by tanks, armored vehicles and helicopters.[129] Several hundred rebels were killed in and around city and eight thousand were arrested. By February 1981, the Islamist uprising in the city of Aleppo was suppressed.[130] Since the late 1990s, Aleppo has become one of the fastest growing cities in the Levant and the Middle East.[131] The opening of the industrial city of Shaykh Najjar and the influx of new investments and flow of the new industries after 2004 also contributed to the development of the city.[132] In 2006, Aleppo was named by the Islamic Educational Scientific and Cultural Organization (ISESCO) as the capital of Islamic culture.[133] Before the Syrian civil war, Aleppo was the third largest city in the Middle East after Cairo and Beirut in terms of the number of Christians.[134] Syrian civil war [edit]On 12 August 2011, some months after protests had begun elsewhere in Syria, anti-government protests were held in several districts of Aleppo, including the city's Sakhour district. During this demonstration, which included tens of thousands of protesters, security forces shot and killed at least twelve people.[135] Two months later, a pro-government demonstration was held in Saadallah Al-Jabiri Square, in the heart of the city. According to the New York Times, the 11 October 2011 rally in support of Bashar al-Assad was attended by large crowds,[136] while state and local media claimed more than 1.5 million attended and stated that it was one of the largest rallies ever held in Syria.[137] In early 2012, rebels began bombing Aleppo after the spread of anti-government protests. On 10 February 2012, suicide car bombs exploded outside two security compounds — the Military Intelligence Directorate's local headquarters, and a Syrian Internal Security Forces barracks[138] — reportedly killing 28 (four civilians, thirteen military personnel and eleven security personnel)[138] and wounding 235.[139] On 18 March 2012, another car bomb blast in a residential neighbourhood reportedly killed two security personnel and one female civilian, and wounded 30 residents.[140][141] In late July 2012, the conflict reached Aleppo in earnest when rebels in the city's surrounding countryside mounted their first offensive there,[142] apparently trying to capitalise on momentum gained during the Damascus assault.[143] Then, some of the civil war's \"most devastating bombing and fiercest fighting\" took place in Aleppo, often in residential areas.[142] In the summer, autumn and winter of 2012 house-to-house fighting between armed opposition and government forces continued, and by the spring 2013 the Syrian Army had entrenched itself in the western part of Aleppo (government loyalist forces were operating from a military base in the southern part of the city) and the Free Syrian Army in the eastern part with a no man's land between them.[142] One estimate of casualties by an international humanitarian organization is that by this time 13,500 had been killed in the fighting — 1,500 under 5 years of age — and that another 23,000 had been injured.[142] Local police stations in the city, used as bases of government forces and hated and feared by residents, were a focus of much of the conflict.[144][145] As a result of the severe battle, many sections in Al-Madina Souq (part of the Old City of Aleppo World Heritage Site), including parts of the Great Umayyad Mosque of Aleppo and other medieval buildings in the ancient city, were destroyed and ruined or burnt in late summer 2012 as the armed groups of the Syrian Arab Army and the Free Syrian Army fought for control of the city.[146][147][24] By March 2013, a majority of Aleppo's factory owners transferred their goods to Turkey with the full knowledge and facilitation of the Turkish government.[148] A stalemate that had been in place for four years ended in July 2016, when Syrian Army troops closed the last supply line of the rebels into Aleppo with the support of Russian airstrikes. In response, rebel forces launched unsuccessful counter-offensives in September and October that failed to break the siege; in November, government forces embarked on a decisive campaign. The rebels agreed to evacuate from their remaining areas in December 2016.[150] Syrian government victory with Russian aerial bombardment was widely seen as a potential turning point in Syria's civil war.[151][152] On 22 December, the evacuation was completed with the Syrian Army declaring it had taken complete control of the city.[153] Red Cross later confirmed that the evacuation of all civilians and rebels was complete.[154] When the battle ended, 50"
}