{
  "url": "https://abcnews.go.com/International/wireStory/collision-migrant-speedboat-greek-coast-guard-vessel-leaves-129828523",
  "title": "Collision between migrant speedboat, Greek coast guard vessel leaves at least 15 dead - ABC News",
  "text": "Collision between migrant speedboat, Greek coast guard vessel leaves at least 15 dead A collision between a speedboat carrying migrants and a Greek coast guard patrol vessel off the eastern Aegean island of Chios late Tuesday has left at least 15 migrants dead, while a search and rescue operation involving patrol boats, a helicopter and... ATHENS, Greece -- A collision between a speedboat carrying migrants and a Greek coast guard patrol vessel off the eastern Aegean island of Chios has killed at least 15 people, the coast guard said late Tuesday, while a search and rescue operation involving patrol boats, a helicopter and divers was underway for potentially missing people. The bodies of 14 people — 11 men and three women — were recovered from the sea, the coast guard said, while another 25 migrants, including about 11 children, were rescued and transported to a hospital on Chios, as were two coast guard officers who were injured in the incident. One of the injured women later died in hospital, the coast guard added, bringing the total death toll to at least 15. The total number of people who had been on board the speedboat was not immediately clear, and a search and rescue operation involving four patrol vessels, an air force helicopter and a private boat carrying divers was underway for potentially missing passengers. Video footage by a local news site showed at least one person being carried in a blanket from a boat moored on the side of a jetty into a waiting coast guard vehicle with blue flashing lights, as others appear to lead two children, one of them limping, toward the car. The coast guard did not immediately have further information on exactly how the collision occurred. Michalis Giannakos, the head of Greece's public hospital workers' union, said staff at the hospital in Chios were all on alert to handle the sudden influx of injured and were on standby for potentially more people. Speaking on Greece's Open TV channel, Giannakos said several of the injured required surgery. Greece is a major entry point into the European Union for people fleeing conflict and poverty in the Middle East, Africa and Asia. Fatal accidents are a common occurrence. Many undertake the short but often perilous crossing from the Turkish coast to nearby Greek islands in the eastern Aegean. But increased patrols and allegations of pushbacks — summary deportations without allowing for asylum applications — by Greek authorities have reduced crossing attempts. Greece, along with several other European Union countries, has been tightening its regulations on migration. In December, the European Union was overhauling its migration system, including streamlining deportations and increasing detentions. There has long been a fierce debate among EU members about migration. Since a surge in asylum-seekers and other migrants to Europe a decade ago, public debate on the issue has shifted and far-right parties have gained political power. EU migration policies have hardened, and the number of asylum-seekers is down from record levels."
}