{
  "url": "https://getupnote.com/",
  "title": "Best Notes App - Write and Organize with UpNote",
  "text": "UpNote offers flexible ways to organize your notes: hashtags, nested notebooks, pinning notes to the top of the note list, adding notes to Quick Access and filtering notes using matched keywords. Complete Note Editor UpNote provides a complete editor with multiple rich text options, Markdown support, creation of lists, insertion of images, links, attachments, quotes, code blocks, multiple fonts from the configuration, highlighting of text in various colors, and more. Always in Sync. Available Offline UpNote automatically syncs across all your devices. You can also access and write notes without internet connection. Beautiful Themes and Dark Mode Apply UpNote’s elegant themes to your taste. Dark themes work excellently for those who prefer distraction-free mode. Web Clipper Extensions Quickly save any web page from your browser with UpNote’s extension available for Chrome, Safari and Firefox. Access the Focus mode, where all the notes, notebooks and menus are hidden, so you can work in a distraction-free environment. Advanced Features Backup and Version History UpNote supports automatic notes backup so you can be sure that your notes will always be safe with you no matter what. Protect Notes with Lock Be it on mobile or desktop, you can lock UpNote app with a passcode to prevent your notes from being accidentally opened and viewed when you are not around. Sticky Window Taking notes during an online conference or learning is convenient with Keep-Window-on-Top feature. Your notes will be kept above other windows while you are working. Links between Notes Quickly and conveniently jump between notes and sections using internal links Export Export your notes to Text, PDF, HTML or Markdown. You can export notes as separate documents or combining into a single document. Collapsible Section Hide some note content and expand them as needed with the collapsible section. This is especially useful for organizing content in a long note. Share note via a web link Share your note with your friends or readers via a secret web link. Spaces You can separate your notes into different spaces, where notes in one space do not appear in other spaces. Templates You can quickly create a new note from your templates. Pricing UpNote is free to use and sync across all your devices. The free version allows up to 50 notes with basic features. UpNote Premium allows you to create unlimited number of notes with other advanced features: Write unlimited notes on iOS, Mac, Android, Windows and Linux Add attachments, tables, codes and more to your notes Protect your notes and notebooks with lock Elegant themes and notebook covers Export to text, PDF, HTML and Markdown formats You can purchase UpNote Premium from the iOS, Android or Mac app with 2 options: $1.99/month or $39.99 Lifetime. Sign in to your UpNote account to sync your premium on all devices, including the Windows app. Prices may vary depending on your region and applicable sales taxes. This app is beautifully made. A work of art. The creator clearly had the user in mind with this app. On iPhone you have quick access to many things like pasting the date, changing font color, lists, etc. On Mac the app is beautiful and you have an awesome focus mode for the note you’re writing. Fantastic by ChrisJallen I've tried quite a few note apps and this is clearly an improved version of some notables, frankly Im surprised others havent seemingly updated their ui in a couple years. This feels fresh, easy to use and completely pleasant experience. Easy to drag drop things in like a scrapbook. Good job! Well designed and easy to use by NancyEngle I love the app. After trying several other note apps, which I use to make notes for my genealogy research and novel writing, I found yours’ to be the easiest and quickest way to keep track of everything. I love that it automatically syncs with my other devices. Super impressed! by carthhourse2000 This app is seriously good. It’s simple, clean and a real joy to use. All the features I need and no extra clutter that I don’t. I needed something that syncs between my Mac and iOS devices and that works flawlessly. Evernote Replacement by adamb1997 This is looking like the perfect evernote replacement. The offering of a lifetime subscription rather than an extortionate monthly price has tipped this app for me. Good balance of features, not as stacked as Notion, but if you like the usability of evernote but not the price then this is on par. Just what i was looking for! by rabidmutt I’ve been searching for a replacement note management app for over a year. After using 3 different ones over the last 18 months, each having one or more issues and / or missing features I wanted, Upnote seems to have it all. I downloaded and ran the free version for about a week and then upgraded to the Pro, which was reasonably priced."
}