{
  "url": "https://www.thefreedictionary.com/uncle",
  "title": "Uncle - definition of uncle by The Free Dictionary",
  "text": "uncle Also found in: Thesaurus, Medical, Acronyms, Idioms, Encyclopedia, Wikipedia. un·cle (ŭng′kəl)n. Idiom: 1. a. The brother of one's mother or father. b. The husband of a sibling of one's mother or father. 2. Used as a form of address for an older man, especially by children. 3. A kindly counselor. 4. Slang A pawnbroker. 5. Uncle Uncle Sam. cry/say uncle Informal To indicate a willingness to give up a fight or surrender: tickled my brother until he cried uncle. [Middle English, from Anglo-Norman, from Latin avunculus, maternal uncle; see awo- in Indo-European roots.] American Heritage® Dictionary of the English Language, Fifth Edition. Copyright © 2016 by Houghton Mifflin Harcourt Publishing Company. Published by Houghton Mifflin Harcourt Publishing Company. All rights reserved. uncle (ˈʌŋkəl)n 1. a brother of one's father or mother 2. the husband of one's aunt 3. a term of address sometimes used by children for a male friend of their parents 4. slang a pawnbroker [C13: from Old French oncle, from Latin avunculus; related to Latin avus grandfather] Collins English Dictionary – Complete and Unabridged, 12th Edition 2014 © HarperCollins Publishers 1991, 1994, 1998, 2000, 2003, 2006, 2007, 2009, 2011, 2014 un•cle (ˈʌŋ kəl)n. 1. a brother of one's father or mother. 2. an aunt's husband. 3. a familiar title or term of address for any elderly man. 4. (cap.) Uncle Sam. Idioms: say or cry uncle, to concede defeat. [1250–1300; < Old French < Latin avunculus mother's brother; akin to Old English èam uncle, Latin avus grandfather] Random House Kernerman Webster's College Dictionary, © 2010 K Dictionaries Ltd. Copyright 2005, 1997, 1991 by Random House, Inc. All rights reserved. ThesaurusAntonymsRelated WordsSynonymsLegend: Switch to new thesaurus Based on WordNet 3.0, Farlex clipart collection. © 2003-2012 Princeton University, Farlex Inc. uncle nounRelated words adjective avuncular adjective avuncular Collins Thesaurus of the English Language – Complete and Unabridged 2nd Edition. 2002 © HarperCollins Publishers 1995, 2002 Translations عَم، خالعَمٌّ أو خَال вуйчокалекосвакострикочичо strýcstrýček onkelfarbrormorbror enoenopuolikummisetäsetäsetäpuoli onclema tante ujakstric nagybácsi oncle paman föðurbróðirföîurbróîir; móîurbróîir; frændimóðurbróðir おじ 외삼촌 avunculuspatruus dėdė tēvocis oomoompjepandjesbaassuikeroomnonkel strýkoujo stric farbrormorbroronkel ลุง bác uncle [ˈʌŋkl] N1. → tío m my uncle and aunt → mis tíos Uncle Sam → el tío Sam (personificación de EE.UU.) Uncle Tom (US) negro que trata de congraciarse con los blancos to cry or say uncle (US) → rendirse, darse por vencido my uncle and aunt → mis tíos Uncle Sam → el tío Sam (personificación de EE.UU.) Uncle Tom (US) negro que trata de congraciarse con los blancos to cry or say uncle (US) → rendirse, darse por vencido 2. (= fence) → perista m Collins Spanish Dictionary - Complete and Unabridged 8th Edition 2005 © William Collins Sons & Co. Ltd. 1971, 1988 © HarperCollins Publishers 1992, 1993, 1996, 1997, 2000, 2003, 2005 Collins English/French Electronic Resource. © HarperCollins Publishers 2005 Collins German Dictionary – Complete and Unabridged 7th Edition 2005. © William Collins Sons & Co. Ltd. 1980 © HarperCollins Publishers 1991, 1997, 1999, 2004, 2005, 2007 Collins Italian Dictionary 1st Edition © HarperCollins Publishers 1995 uncle (ˈaŋkl) noun the brother of a person's father or mother, or the husband of an aunt. He's my uncle; Hallo, Uncle Jim! Kernerman English Multilingual Dictionary © 2006-2013 K Dictionaries Ltd. uncle → عَمٌّ أو خَال strýc onkel Onkel θείος tío eno oncle ujak zio おじ 외삼촌 oom onkel wujek tio дядя farbror ลุง amca bác 叔叔或舅舅Multilingual Translator © HarperCollins Publishers 2009 uncle n tíoEnglish-Spanish/Spanish-English Medical Dictionary Copyright © 2006 by The McGraw-Hill Companies, Inc. All rights reserved."
}