{
  "url": "https://www.horizonblue.com/members",
  "title": "Horizon BCBSNJ Members Health Plans, Tools, Forms, Login & Resources - Horizon Blue Cross Blue Shield of New Jersey",
  "text": "Enjoy easy access to your benefits information, claims, EOBs and more. Need a form? All our forms can be found in one convenient location. Explore member tools and programs to help improve your overall health. The Importance of Preventive Care Preventive health care lowers the risk for diseases, disabilities and even death. Yet millions of Americans don’t get the recommended preventive care screenings available to them. At Horizon, we want you to take advantage of your no-cost preventive care coverage. When you see an in-network doctor or other health care professional, you don't pay anything out of pocket for an annual wellness exam and well child care, including immunizations and lead and cancer screenings. An annual wellness visit is a great time to talk with your doctor about any health concerns, screenings and shots you may need, and any medicines and supplements you’re taking. To learn more about the recommended screenings and immunizations for children and adults, go to Health.gov/myhealthfinder. And to find in-network doctors and other health care professionals, use Horizon’s Doctor and Hospital Finder. We’re happy to offer convenient ways to help get the answers and the care you need. Thank you for being a Horizon member. When To Go to the Emergency Room vs Urgent Care Center Do you know where to go when you’re suddenly hurt or not feeling well? The answer depends on if it’s a life-threatening condition. If you have an illness or an injury that puts your life in immediate danger or may cause permanent harm, call 911 or go to the nearest Emergency Room, even if it’s out of network. They can best help with severe medical and behavioral health conditions like the ones listed here. But remember, if you get non-emergency care at any hospital, you will have to pay more out of your own pocket. For non-life-threatening injuries or illnesses, you have other options for care. When you need non-emergency care today, but your doctor is unavailable, you can either use Horizon CareOnlineSM – our online telemedicine option, or go to an urgent care center. Urgent care centers can treat minor illnesses and injuries that require immediate care like colds, ear pain and more. To find an in-network urgent care center or hospital near you, use Horizon’s online Doctor and Hospital Finder. No matter what your health care needs are, Horizon is committed to helping you achieve your best health. Please note that these forms are to be used by Federal Employee Program Members only"
}