{
  "url": "https://www.stonyfield.com/science-based-target/",
  "title": "Stonyfield’s Science Based Target – 30 by 30 - Stonyfield",
  "text": "Striving to Be a More Sustainable Business Expanding on our long history with climate action, Stonyfield has had our greenhouse gas reduction target accepted by the Science Based Targets initiative (SBTi). Officially, Stonyfield’s commitment is to reduce absolute Scope 1, 2, and 3 GHG emissions 30% by 2030 from a 2017 base-year. Or in other words, we’re committed to reducing the carbon footprint of our operations and supply chain by 30%, even while we continue to grow! SBTi has validated that this goal is consistent with reductions required to keep global warming to 2°C, the key objective in the Paris Climate Agreement. Science Based Targets Initiative The Science Based Targets initiative is a coalition looking to drive ambitious corporate climate action including the Carbon Disclosure Project (CDP), the United Nations Global Compact (UNGC), the World Resources Institute (WRI), and the World Wide Fund for Nature (WWF). To date, just over 600 companies globally have committed to align their GHG reduction efforts with science via the SBTi, and 240 of these companies—only 50 in North America—have targets that have been validated by SBTi. The validation indicates emissions reduction targets that align with what climate science says is necessary to meet the goals of the Paris Climate Agreement. The Science Based Targets initiative is a collaboration between the Carbon Disclosure Project (CDP), the United Nations Global Compact, the World Resources Institute (WRI), and the World Wide Fund for Nature (WWF). Our Carbon Footprint We’ve been measuring our carbon footprint since 1996 and have gotten more sophisticated in our approach over time. Today, we understand the detailed impact of our choices and can measure the opportunities we have to improve. This chart sh ows our 2017 footprint and is the basis from which we will improve over time. Our Approach Reducing our greenhouse gas emissions by 30% while we continue to grow is a big challenge. Our ambitious plan focuses on reducing emissions in 5 areas of our business: agriculture, waste, logistics, energy, and packaging. We know we can’t achieve this feat alone and are working in collaboration with our milk supply farmers, suppliers, customers, and others to innovate and improve. Get the scoop! Enter your email to get the latest Stonyfield happenings, promotions, recipes, and more."
}