{
  "url": "https://support.microsoft.com/pt-br/windows/localizar-configurações-de-bluetooth-no-windows-5027e93e-a6e8-4b4f-a412-c6c6cd6f57cc",
  "title": "Localizar configurações de Bluetooth no Windows - Suporte da Microsoft",
  "text": "Localizar configurações de Bluetooth no Windows Aplica-se a Embora várias configurações Bluetooth sejam encontradas no aplicativo Configurações , há configurações adicionais de Bluetooth que podem ser acessadas fora do aplicativo Configurações. Para localizar essas configurações adicionais de Bluetooth: - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos & Bluetooth > Dispositivos .Abrir dispositivos Bluetooth & dispositivos > Dispositivos Ou Selecione os seguintes dispositivos Bluetooth & > Dispositivos atalho: - Na janela Dispositivos & Bluetooth > Dispositivos , em Configurações relacionadas, selecione Mais configurações de Bluetooth. Observação: Se a opção Mais configurações bluetooth não existir em Configurações relacionadas, o dispositivo Windows pode não ter um adaptador Bluetooth ou os drivers do adaptador Bluetooth podem não estar instalados. - A janela Configurações do Bluetooth é aberta com configurações adicionais de Bluetooth. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos .Abrir Bluetooth & outros dispositivos Ou Selecione o seguinte Bluetooth & outros dispositivos atalho: - Na janela Bluetooth & outros dispositivos , em Configurações relacionadas, selecione Mais opções bluetooth. - A janela Configurações do Bluetooth é aberta com configurações adicionais de Bluetooth. Observação: Se a opção Mais opções bluetooth não existir em Configurações relacionadas, o dispositivo Windows pode não ter um adaptador Bluetooth ou os drivers do adaptador Bluetooth podem não estar instalados."
}