{
  "url": "https://support.google.com/maps/answer/3092445?hl=pt&co=GENIE.Platform=Desktop",
  "title": "Pesquise localizações no Google Maps - Computador - Google Maps Ajuda",
  "text": "Pode pesquisar locais e localizações com o Google Maps. Quando inicia sessão no Google Maps, pode obter resultados da pesquisa mais detalhados. Pode encontrar locais que pesquisou anteriormente e pesquisar os seus contactos por nome. Pesquise um local no Google Maps - No seu computador, abra o Google Maps. - Escreva um endereço ou o nome de um local. - Prima Enter ou clique em Pesquisar . - Para filtrar os seus resultados da pesquisa, utilize os menus pendentes abaixo da caixa de pesquisa. Verifique o mapa completo Para verificar o mapa completo e ocultar o painel lateral, no lado direito do painel, clique na seta . Pesquise uma categoria de locais no Google Maps - No computador, abra o Google Maps. - Na caixa de pesquisa, introduza uma pesquisa, como restaurantes .- Abaixo da caixa de pesquisa, podem aparecer resultados da pesquisa personalizados. - Escolha um local para o ver no mapa e mais informações. No computador: - Clique na caixa de pesquisa. - Passe o cursor do rato sobre uma sugestão de pesquisa. - Clique em Eliminar . Em dispositivos Android: - Toque na caixa de pesquisa. - Prima sem soltar a sugestão de pesquisa. - Toque em Eliminar. No iPhone e iPad: - Toque na caixa de pesquisa. - Deslize rapidamente para a esquerda ou direita na sugestão de pesquisa. Sugestão: efetue a gestão de todos os seus dados e atividade em A minha atividade. Sugestões: - Os resultados da pesquisa incluem locais que pesquisou anteriormente. Se tiver sessão iniciada, mas não obtiver resultados da pesquisa personalizada, ative a Atividade da Web e de apps. - Na parte superior do ecrã, use os botões de categoria para ver sugestões de pesquisa. - Para oferecer as melhores opções possíveis, os botões de categoria mudam com base no meio de transporte. Por exemplo, a opção de condução apresenta-lhe opções como \"Estações de serviço\", \"Carregamento de VE\" e \"Hotéis\". Filtre os seus resultados da pesquisa no Google Maps - No seu computador, abra o Google Maps. - Pesquise um tipo de empresa, de restaurante ou de local. - Escolha um filtro: - Preço: pesquise com base nos preços do restaurante. - Horário: verifique os locais que estão abertos neste momento. - Informações do hotel: consulte as datas de check-in e o número de estrelas. Partilhe os resultados da pesquisa no Google Maps - No computador, abra o Google Maps. - Pesquise um tipo de local, como um restaurante , umaloja ou umabomba de gasolina . - Na lista de resultados, na parte superior, clique em Partilhar . - Selecione uma opção: - Copie o link. - Partilhe pelo WhatsApp, X ou Gmail. - Incorpore um mapa. Encontre pesquisas recentes No separador \"Recentes\", pode rever, guardar e partilhar pesquisas recentes. Para rever pesquisas recentes: - No computador, aceda ao Google Maps. - No lado esquerdo, clique em Recentes . - Sugestão: na parte superior do separador \"Recentes\", o Maps agrupa as pesquisas por localização geográfica. Para guardar pesquisas recentes em listas guardadas: - No lado esquerdo, clique em Recentes . - Selecione as pesquisas que quer guardar. - Na parte inferior, clique em Guardar . - Para guardar numa lista existente, clique na mesma. - Para guardar numa nova lista, clique em Nova lista. Para partilhar pesquisas recentes: - No lado esquerdo, clique em Recentes . - Selecione as pesquisas que quer partilhar. - Para copiar as pesquisas para a área de transferência do computador, na parte inferior, clique em Partilhar . - Pode colar as pesquisas num email ou documento. Dicas: - Para desativar a barra lateral, na parte superior esquerda, clique no menu Desativar Mostrar barra lateral. - Para eliminar uma pesquisa recente, passe o cursor do rato sobre a imagem e clique em Eliminar . Sugestões para pesquisas no Google Maps Os exemplos incluem: - Empresas específicas: Starbucks . - Tipos de locais: café perto do Parque Eduardo VII . - Restringir os resultados ao indicar a cidade e o distrito: mercearias em Oeiras, Lisboa . - Restringir os resultados ao indicar um código postal: combustível em 2780 . - Encontrar um cruzamento: cruzamento da igreja . - Endereço, cidade, distrito, país ou aeroporto: Avenida da República 230, Cascais, Lisboa, Figo Maduro, Aeroporto de Lisboa ou Cristo Rei, Portugal . - Coordenadas de latitude e longitude: 41.40338, 2.17403 . - Amigos e outros contactos (tem de ter sessão iniciada): João Silva . - Outros nomes de pessoas nos seus contactos do G Suite. Obtenha o seu código postal ou mais informações acerca de um local Para mais informações acerca de um local, efetue uma das seguintes ações: - Selecione um minialfinete no mapa. - Coloque um alfinete no mapa. - Pesquise um local específico. Pode ver informações acerca do local, como a morada, o código postal, o horário de funcionamento, o número de telefone, o Website e as classificações ou as críticas. Sugestão: para encontrar o Website de um local, guardar um local, obter direções e partilhar um local, pode utilizar o 3D Touch no iPhone 6s e superior. Para ativar o 3D Touch, aceda à app Definições Geral Acessibilidade 3D Touch. Em seguida, abra o Google Maps e prima sem soltar um local. Como os resultados locais aparecem no Google Maps Locais gerais no mapa Os resultados locais são apresentados a pessoas que pesquisam empresas e locais perto da respetiva localização. Aparecem em vários locais no Maps e na Pesquisa. Por exemplo, se pesquisar \"restaurante italiano\" no seu dispositivo móvel, pode obter resultados locais. O Google apresenta-lhe restaurantes próximos que talvez pretenda visitar. Vários fatores, principalmente a relevância, a distância e a proeminência, influenciam os resultados locais. Estes fatores são combinados para ajudar a encontrar a melhor correspondência para a sua pesquisa. Por exemplo, se aquilo que procura se encontrar provavelmente numa empresa mais afastada de si, os algoritmos do Google podem decidir atribuir-lhe uma classificação mais elevada nos resultados locais. Saiba mais acerca dos resultados da pesquisa local no Google.Sugestão: o pagamento de outras empresas não influencia os resultados no Google Maps. O conteúdo pago no Google Maps está etiquetado. Locais relevantes para si Pode ver pesquisas personalizadas no Google Maps. Eis alguns exemplos das origens destas informações: No Google Maps Os locais personalizados que encontra podem ter origem: - Nas suas interações com locais no mapa, que incluem mapas do Google Maps que utiliza noutros sites. - Em pesquisas recentes, que incluem pesquisas de direções. - Em locais guardados ou marcados com uma estrela por si no computador, no telemóvel ou no tablet. - Em locais classificados ou criticados por si ou por pessoas nos seus círculos. - Nos seus endereços de casa e do trabalho, se os definir no Google Maps ou no seu feed. Outros produtos Google Os locais personalizados que encontra podem ter origem: - Nos mapas personalizados, se os tiver em Os Meus Mapas. - Nas pessoas e nos locais que adicionou aos seus Contactos do Google, como Pizaria Delfina. Se não pretender encontrar sugestões de pesquisa no Google Maps, atualize as suas preferências nos outros produtos Google."
}