{
  "url": "https://www.delish.com/cooking/recipe-ideas/a28848483/brioche-bread-recipe/",
  "title": "Best Brioche Bread Recipe",
  "text": "When it comes to soft, tender, pillowy bread with a tender, almost-flaky crust, brioche is king. Brioche is a yeasted dough that falls firmly into the enriched dough camp. Unlike simple lean doughs (think French bread or pita bread) that only need flour, yeast, water, and salt, enriched dough also has sugar, butter or oil, eggs, and milk or cream. The added fat changes the dough's behavior at each stage and yields a tender bite and a soft crust. It requires a bit of patience and effort, but it’s completely worth it for the resulting rich, fluffy bread. Ready to try your hand at it? Keep reading on for all of my top tips on how to ace every step: What People Are Saying: “First time to make Brioche and this recipe is amazing!!! Definitely a little time consuming but worth it. Made two huge loaves!” - RedSeahorse “This is the most ridiculously PERFECT recipe, ever! My brioche was so amazingly fabulous I had to physically restrain myself from 'testing' only one slice. It's intoxicating. Thank you so very much for the fabulous tutorial!” - auophir How To Make Brioche INGREDIENTS The Sponge - All-Purpose Flour: Just like in our dough, we’re going to use all-purpose flour here. - Yeast: Active dry or instant yeast will both work in this case; because we're blooming the yeast in the sponge portion of the dough, the type of dry yeast you use has no impact on the final product. Yeast has to be alive to be effective, but you may get a packet full of dead yeast every now and then. To avoid starting your dough with dead yeast, pay special attention to the sponge to ensure it produces air pockets before proceeding. If the dough is flat with no bubbles, start again with a fresh packet of yeast. - Milk: It’s important to warm your milk up so it’s at a lukewarm temperature before incorporating it with your flour and yeast. When it’s warm enough to take a bath in, you know you’re good to go. The Dough - Large Eggs: 6 large eggs add protein to our brioche dough, adding to the richness and structure of the bread. This recipe uses large eggs measuring about 54 grams each. If your eggs run larger, use only 5 eggs to avoid an overly wet batter! - All-Purpose Flour: I went with AP flour for this brioche recipe, but you can use bread flour or substitute half of the flour for white whole wheat flour. The critical thing to remember is that the texture of the brioche will change depending on the kind of flour you use. Flour with a higher protein content will form more gluten, resulting in a chewier brioche loaf. AP flour has 11-12% protein, bread flour has 12-13% protein, and white whole wheat flour has 13-14% protein. - Granulated Sugar: I’m calling for a large amount of sugar here, which might seem like too much for bread, but not for brioche. It’s an enriched dough, which is known for being delicious because of the butter and sugar. - Kosher Salt: A little bit of kosher salt helps tighten the gluten structure while adding flavor to our bread. - Butter: Just like the sugar, I’m calling for a large amount of butter here—1 stick per loaf. Using a whole stick of butter results in the ultimate rich and fluffy bite. STEP-BY-STEP INSTRUCTIONS First, we’re going to make the sponge for the dough. A sponge is a leavening that you make by combining flour, yeast, and milk. You’ll let it sit and ferment, and it will add texture and flavor to the dough, along with developing a structure. To make it, first microwave your milk until it’s lukewarm. Then, add it to the bowl of a stand mixer with flour and yeast. Use a spatula to mix it until well combined; it should resemble a stiff dough. Make sure that there are no dry spots at the bottom of the bowl before covering and letting it sit for around 45 minutes. Look for holes forming in the dough. It should look wobbly when you shake it with holes—like a sponge! Once the sponge is ready, add in the eggs, sugar, and kosher salt. Mix on medium speed until well-combined, then increase to medium-high speed. After increasing to medium-high speed, check in periodically with a bench scraper to make sure that there are no dry spots or pockets of sponge at the bottom of the bowl. Let it go until the dough pulls away from the sides of the bowl and isn’t too sticky. Then, while the mixture is still running, add in the (softened!) butter gradually. I recommend adding 1 Tbsp. at a time, then letting it disappear completely before adding more. After adding all the butter, the dough should be shiny and pliable, and not too sticky. Continue mixing until the dough passes the windowpane test: when stretching the dough, it gets thin enough that you can see light through it without it tearing. Once it has passed the test, butter a glass bowl and transfer the dough, then cover with plastic wrap and let it rest until it has doubled in size and is puffy and jiggly. If you’re baking the same day, turn the dough out onto a floured surface and punch it down once it has doubled in size. Using a bench scraper, cut the dough in half, then cut each half into 6 equal pieces. Flatten each piece into a long rectangular shape, then do a letter fold: fold the top half down to the middle, then the bottom half up to the middle, meeting the top half. Then, turn it 90°, and roll it into a log from the short end. Make sure it’s as flat as possible so you get a nice, tight roll. Once you’ve rolled your piece of dough, place it seam-side down, and move on to the next. Grab your pans, then decide how you want to arrange your pieces. I prefer to put the bigger ones on the outside, then stick the smaller ones in the middle. Slightly push them next to each other once they’re in the pan. Cover the pans, then let them rest for an hour (this could be 45 minutes depending on how warm your room is). After they’ve rested, give them a poke: once you see the indent isn’t bouncing all the way back and it’s wobbly, then it’s time to bake. Cover the loaves with an egg wash, then sprinkle the tops with salt before baking at 375° for around 25 to 30 minutes. You’re looking for the loaves to become deeply golden and shiny. If you want to double-check if they’re done and you have a thermometer, the inside should reach 200-209°. The best part about this bread? You can tear into it without getting a board or a knife! Grab a piece (or two), slather with even more butter (if you so desire), and enjoy your labor of love. The full list of ingredients and instructions can be found in the recipe below. Recipe Tips - Can I make this dough by hand? Technically, yes, but the stand mixer will genuinely make your life 100x easier for this recipe. Because of the extensive amount of mixing that's required to develop the gluten properly and the slow, gradual addition of butter, doing this by hand will result in a very long, very arduous process. If you're without a stand mixer, but you absolutely must have fresh brioche, try working with a half batch to yield 1 loaf. Your arms will thank you! - The dough seems very wet and sticky—is something wrong? No—it is a very moist dough! Enriched with lots of eggs and butter for that delicate crumb and fatty goodness, the dough will be quite sticky initially. Stickiness is a hallmark of enriched dough, so trust in the process and have the patience to let the gluten develop fully before adding in the butter. - How do I know when the gluten has developed properly? The windowpane test is a reliable way to check for gluten development. To perform the test, take a small piece of dough and slowly stretch it out in opposite directions: if the dough becomes thin enough to appear semi-transparent (like a pane of glass in a dirty window) before it tears, you're there! You'll have an extra desirable chew in the bread once your dough gets to this stage. The surface of the dough should look shiny and smooth, and well-hydrated. If your dough struggles to pull away from the sides of the mixer, chances are you need to increase the mixer's speed. Stay near the mixer! You might have to hold it in place as it dances across your countertop with vigorous agitation. - How should I add the butter? Slowly and with great patience. The butter addition process should take no less than 10 minutes. If you add the butter in too fast, it will not \"emulsify\" into the dough and result in an oily, broken dough. It'll still bake off well enough, but do it right, and your dough will look satisfyingly smooth, glossy, and plump. Like laminated dough, if your climate, kitchen, hands, or tools are particularly warm, it can cause the butter in the dough to separate and seep out. To combine warm temperatures, pop the dough into the refrigerator for a few minutes when you feel it start to become greasy. - Should I let the dough rest overnight? It's up to you! Generally, more time means more flavor when it comes to food. Aside from making the dough easier to handle, letting it sit in the fridge overnight is basically a slow fermentation that helps it develop a subtle depth of flavor. Because we're already letting some fermentation happen by using the sponge mixture, overnight proofing is unnecessary if you're looking to bake immediately. Or, if you're like me and love freshly baked bread straight out of the oven, bake one loaf on the day of, and save the other half of the dough to bake for the next day! - How do I know if my dough is over-proofed? Unfortunately, a final result that tastes like fermented, hoppy beer-bread is the easiest way to tell if your bread dough sat in its proofing stage for too long. But of course, by then, the loaf is baked, and starting over is probably the last thing you'll want to do. Avoid scraping your hard work by paying particular attention to the dough during the proofing stage. Timing the dough is undoubtedly helpful, but noting how the dough looks is the most reliable way to tell if the dough has proved enough. Be sure to note where the dough sits in the bowl before it starts to rest so that you can get an accurate idea of where it should be when doubled in size. You can even mark the bowl with tape or a rubber band to track your dough-baby's progress. - Why do I have to shape with letter fold rolls? Of course, you don't have to, but I simply love shaping my softer breads like this for an easy pull-apart feature once baked: you won't even need a knife to get a perfect slice of fluffy heaven. If you want to make buns instead of loaves, try our recipe for perfect brioche buns to get the shaping technique right. Storage Store any leftovers in an air-tight container at room temperature for up to 3-4 days or in the refrigerator for 6-7 days. To freeze a whole loaf or slices, wrap the brioche in plastic wrap and heavy-duty foil and store in a freezer bag for up to 3 months."
}