{
  "url": "https://worstgen.alwaysdata.net/forum/threads/fenrir-or-nidhoggr.76600/",
  "title": "Questions & Mysteries - Fenrir or Nidhoggr? | Worstgen",
  "text": "I'm leaning towards Nidhoggr, or some other type of dragon. Because the dragons ARE coming and they WILL be amazing! Plus, it'd be appropriate to have a \"Western Fire\" Dragon Zoan to contrast against Kaido's \"Eastern Water\" Dragon. I'm convinced that there's something going on with the Dragons in the backstory of One Piece. And these two \"tribes\" of Dragons are probably important to the backstory, somehow. Note that Kaido has white, curved horns. And Loki has black, straight horns. Kind of hinting at two distinct bloodlines for different Dragon-descended clans, which probably fought one another in the distant past. But, if I'm being honest, that silhouette could be just about anything. I could see it being a wolf. Like Fenrir or Skol or Hati. This is a hybrid form, so the proportions would be off no matter what. It could even be related to Sleipnir, Odin's 8 legged horse, since the face looks pretty horse-like. It also does kind of look like the \"Elk Skeleton Helmets\" that Road and that unnamed God's Knight wear. Maybe there's some connection to that? Even though, I'm not sure what it'd be. Before, I was thinking that Loki's Fruit would turn out to be the Earth God Fruit. And it still could be. All the God Fruits are probably also Zoans, by default. Going by the Chapter 1138 Mural, the same \"arrow\" pattern can be found on the \"Hellflame Serpent\" on the right, and the \"Ancient Giant with a Spear\" on the left, and the small \"moon\" between the First and Second World text boxes. So, maybe it's the Hellflame Serpent Fruit, or maybe it's the Earth God Fruit, or maybe they're one and the same? But, honestly? I can't help but feel like Oda's setting us up for a swerve here. He's showing us this big, imposing, mysterious creature who SEEMS really tough and cool. So...is Oda just setting us all up for a \"punchline\"? I can't help but feel like when we actually see Loki's Zoan form, it'll look like a joke. Something we never expected. Something kind of silly or weird. Only to make it cool again, with some kind of crazy powers. Because Oda does enjoy a good swerve. And I could see him setting up expectations here, only to subvert them, later. Take another look at some of these panels. Look at the panel next to the one where Ragnir is happy to see this form appear. The one where Loki seems to be running toward Harald. Doesn't Loki's \"legs\" look kind of...stubby to you? We see the columns in the foreground for scale. And Loki's new \"body\" seems disproportionately larger than his \"legs\". Loki's \"belly\" also looks pretty \"curved\" here. And his \"spikes\" seem a bit...\"triangular\". Like, maybe they're a little too triangular to be natural? I'm not sure what that adds up to, even if I'm on the right track. My mind's going to like...a wooden toy rocking hobby-horse or something? I don't know. I wouldn't be surprised if Loki's Devil Fruit turns out to be something more \"goofy\" than \"cool\", given just how much Oda's building up to it. Just so he can take us for a ride, and make us disappointed it's not cooler than it is, just to make it cool again by Loki using his powers in interesting ways. Also, remember the Legos from the beginning of the arc. We still don't have a explanation for those. Elbaph doesn't seem to have the technology to produce plastic construction bricks. There don't seem to be factories or specialty toymakers anywhere. So...what if the Lego's came from Loki's Devil Fruit? What if Loki basically has a toy-based Devil Fruit? If that WAS one of the God Fruits, it'd kind of fit the theme. The Sun God Fruit seems to be all about the power of Imagination. And Imu's powers, whatever they turn out to be, seems to be based on Games. So, \"Toys\" as a theme for one of the God Fruits would actually fit in pretty well. So far, all the God Fruits seem to be \"things kids like\". Literally \"playing god\". So, I don't know. Loki's Fruit could be some really cool mythological creature. Or it could literally be a child's toy. This is One Piece, both options seem equally viable. Oda's silhouettes are notoriously difficult to read. And often misleading. I wouldn't be surprised either way. I don't know, just a random possibility to think about."
}