{
  "url": "https://support.google.com/admanager/answer/6022732?hl=fr",
  "title": "Se connecter à Google Ad Manager - Aide Google Ad Manager",
  "text": "Pour vous connecter, accédez au site admanager.google.com. Saisissez le nom d'utilisateur et le mot de passe de votre compte Google. Si vous n'êtes pas sûr de l'adresse e-mail ou du mot de passe corrects, essayez la procédure de récupération de compte de Google. Si vous ne possédez pas encore de compte Ad Manager, vous pouvez : Se connecter à Google Ad Manager Résoudre les problèmes de connexion et d'accès Si vous ne parvenez pas à vous connecter à Ad Manager ou si vous avez reçu une invitation, mais que vous n'arrivez pas à accéder au compte, essayez les solutions suivantes : Vérifiez que vous utilisez le bon compte Google. Si vous disposez de plusieurs comptes Google, tels qu'un compte Gmail personnel ou un autre compte d'entreprise, vous n'êtes peut-être pas connecté à celui qui convient. Essayez de vous déconnecter, puis de vous reconnecter avec l'adresse e-mail que vous utilisez pour Google Ad Manager. Si votre compte Google est associé à plusieurs comptes Google Ad Manager, vous serez invité à sélectionner celui auquel vous souhaitez accéder lorsque vous vous connectez. Vérifiez vos autorisations. Si le message \"Accès non autorisé\" s'affiche lorsque vous utilisez Google Ad Manager, il est probable qu'une autorisation de rôle utilisateur manquante ou une association d'équipes incorrecte limite votre accès. Contactez votre administrateur réseau pour vérifier que vous êtes membre du rôle utilisateur disposant de toutes les autorisations nécessaires ou que votre profil utilisateur est associé à l'équipe appropriée. Videz le cache et supprimez les cookies de votre navigateur. Pour éliminer les données d'authentification obsolètes qui peuvent être à l'origine de problèmes de connexion, videz le cache et supprimez les cookies de votre navigateur. Vous pouvez également essayer d'accéder à Ad Manager dans une fenêtre de navigation privée. Si le problème persiste, vous devrez peut-être vider le cache plusieurs fois. Demandez à un administrateur de vérifier votre état dans Ad Manager. L'administrateur de votre réseau peut vérifier que vous êtes répertorié en tant qu'utilisateur actif sur le réseau Google Ad Manager de la façon suivante : - Connectez-vous à Google Ad Manager. - Cliquez sur Admin, puis sur Accès et autorisations. - Sous \"Utilisateurs\", votre administrateur peut vous rechercher par nom ou adresse e-mail, puis examiner votre statut : - Actif : indique que vous êtes un utilisateur actif sur le réseau. - Inactif: indique que votre compte utilisateur a été désactivé sur le réseau. Les utilisateurs inactifs ne peuvent pas accéder au réseau tant qu'un administrateur n'a pas défini leur état sur \"Actif\". - Invitation en attente : indique qu'une invitation à rejoindre le réseau a été envoyée. Recherchez l'e-mail d'invitation dans vos dossiers de boîte de réception et de spam, puis cliquez sur le lien figurant dans l'e-mail pour activer votre profil utilisateur. Si le lien d'invitation génère une erreur, demandez à votre administrateur de vérifier que l'invitation est toujours valide et qu'elle a été envoyée à la bonne adresse e-mail. Votre administrateur réseau ou tout autre utilisateur disposant de l'autorisation \"Modifier les utilisateurs, les rôles et les équipes\" peut vous renvoyer l'invitation. Si nécessaire, il peut ajouter un utilisateur. Vérifier qu'Ad Manager est activé dans la console d'administration Google Si votre organisation utilise Google Workspace, elle peut activer les utilisateurs Ad Manager via la console d'administration Google. Un administrateur de la console d'administration Google de votre réseau peut activer Ad Manager comme suit : - Connectez-vous à la console d'administration Google avec un compte administrateur. Si vous ne disposez pas d'un compte administrateur, vous ne pouvez pas accéder à la console d'administration. - Sur la page d'accueil de la console d'administration, accédez à Applications > Services Google supplémentaires. Les services activés s'affichent en premier. Toutefois, vous pouvez utiliser des filtres pour afficher les principaux services ou les services d'une organisation donnée. - Activez Google Ad Manager."
}