{
  "url": "https://en.m.wikipedia.org/wiki/Brioche",
  "title": "Brioche - Wikipedia",
  "text": "Brioche Brioche (/ˈbriːoʊʃ/, also UK: /ˈbriːɒʃ, briːˈɒʃ/,[1] US: /briːˈoʊʃ, ˈbriːɔːʃ, briːˈɔːʃ/,[2][3][4] French: [brijɔʃ] ⓘ) is a Viennoiserie of French origin whose high egg and butter content gives it a rich and tender crumb. Chef Joël Robuchon described it as \"light and slightly puffy, more or less fine, according to the proportion of butter and eggs\".[5] It has a dark, golden, and flaky crust, frequently accentuated by an egg wash applied after proofing. Brioche is considered a Viennoiserie because it is made in the same basic way as bread but has the richer aspect of a pastry because of the addition of eggs, butter, liquid (milk, water, cream, and, sometimes, brandy) and occasionally sugar. Brioche, along with pain au lait and pain aux raisins—which are commonly eaten at breakfast or as a snack—form a leavened subgroup of Viennoiserie. Brioche is often baked with additions of fruit or chocolate chips and served on its own or as the basis of a dessert, with many regional variations in added ingredients, fillings, or toppings. Forms [edit]Brioche has numerous uses in cuisine and can take on various forms, served plain or filled, as coulibiac, or with many other different savory fillings, such as fillet of beef en croute, foie gras, sausage, or cervelat lyonnais.[5] Brioche can also be served with sweet fillings, especially fresh fruits, vanilla cream, or jam.[6] Stale brioche can be topped with frangipane to make bostock .[7] Brioche à tête or parisienne is perhaps the most classically recognized form: it is formed and baked in a fluted round, flared tin; a large ball of dough is placed on the bottom and topped with a smaller ball of dough to form the head (tête).[8] Brioche de Nanterre is a loaf of brioche made in a standard loaf pan. Instead of shaping two pieces of dough and baking them together, two rows of small pieces are placed in the pan. Loaves are then proofed (allowed to rise) in the pan, fusing the pieces. The dough balls rise further during the baking process and form an attractive pattern. Brioche can also be made in a pan without being rolled into balls to make an ordinary loaf. Brioche dough contains flour, eggs, butter, liquid (milk, water, cream, and sometimes brandy), leavening (yeast or sourdough), salt, and sometimes sugar. A common flour-to-butter ratio is 2:1, but historically, brioche of varying degrees of richness (from the \"rich man's brioche\" with a flour-to-butter ratio of 3:2[9] to the cheaper pain brioché with a ratio of 4:1) have existed at the same time. The Roux Brothers used a ratio of 700 g (1.5 lb) butter to 1 kg (2.2 lb) flour. The normal preparation method is to make the dough, let it rise to double its volume at room temperature, and then punch it down and let it rise again in the refrigerator for varying periods (according to the recipe), retarding the dough to develop the flavor.[10] Refrigeration also stiffens the dough, which still rises, albeit slowly, making it easier to form. The dough is then shaped, placed in containers for the final proofing, and generally brushed on top with an egg wash before being baked at 230 °C (446 °F) until the crust browns and the interior reaches at least 90 °C (194 °F). The first rise time for small rolls is 1 to 1+1⁄2 hours; for larger brioche, the time is lengthened until the loaves double. History [edit]The first recorded use of the word in French dates from 1404.[11] It is attested in 1611 in Cotgrave's A Dictionarie of the French and English Tongues, where it is described as \"a rowle, or bunne, of spiced bread\" and its origin given as Norman.[12] In France, it developed as \"a sort of bread improved since antiquity by generations of bakers, then of pastry-makers ... with some butter, some eggs, sugar coming later ... it developed from the blessed bread [pain bénit] of the church which gradually became of better quality, more and more costly, less and less bread; until becoming savory brioche\".[13] In the 17th century \"pâté à tarte briochée\", \"a pain à brioche pauvre [poor] ... [using only] 3 eggs and 250 grams [8 oz] of butter for 1 kilogram [2 lb] of flour\" was introduced.[14] The terms pain bénit and brioche were sometimes used together or virtually interchangeably; so, for example, in another 17th-century recipe entitled: \"CHAPITRE II. Pain bénit, & brioches.\" It begins with a lighter, cheaper version of blessed bread, calling for \"a pound of fresh butter and a soft cheese [but no eggs!] for a pail of flour\"; and goes on to describe \"the more delicate that we call Cousin,\" which uses 3 pounds of butter, two kinds of cheese, and a royal pint of eggs for the same amount of flour, as well as \"some good milk\" if \"the dough is too firm.\"[15] However, sourdough and brewer's yeast preparations would both remain common well into the following century, with \"blessed bread ... more and more often replaced by brioche\" in the 18th century, where \"Those from Gisors and Gournay, great butter markets, were the most highly regarded.\"[16] For the wealthy \"from the time of Louis XIV onwards ... Butter, in widespread use at least in the northern half of France, was the secret of making brioches\".[17] \"In Gisors, on market days, they produce up to 250 or 300 kg [550 or 650 lb] of brioches. The dough is made the evening before (1 kg [2 lb] of farine, a quarter of which for the starter, 10 g [1⁄3 oz] of yeast, 7 or 8 eggs; one mixes this with the starter and 800 g [28 oz] of butter, breaking up the dough, which 'uses up the butter'). The dough is kept in a terrine, and one puts it in a mold just at the moment of baking. Thus prepared, the brioche remains light, keeps well, maintains the flavour of butter, without the stench of the starter.\"[18] Jean-Jacques Rousseau, in his autobiography Confessions, relates that \"a great princess\" is said to have advised, with regard to peasants who had no bread, \"Qu'ils mangent de la brioche\", commonly translated as \"Let them eat cake.\" This saying is commonly misattributed to Queen Marie-Antoinette, wife of Louis XVI.[19] Etymology [edit]Although there has been much debate about the etymology of the word and, thus, the recipe's origins, it is now widely accepted that it is derived from the Old French verb brier, a Norman dialectical form of broyer, to work the dough with a broye or brie (a sort of wooden roller for kneading); the suffix -oche is a generic deverbal suffix.[20] Pain brié is a Norman bread whose dense dough was formerly worked with this instrument.[21] The word is of Germanic origin, probably derived from the Proto-Indo-European root *bhreg ('to break').[22] Types [edit]- La brioche aux fruits confits or gâteau des rois - Gâche - Brioche de Nanterre[23] - Brioche vendéenne[24][25] - Brioche tressée de Metz - Cougnou[26] - Pogne, Dauphiné[27] - Gâteau de Saint-Genix, Saint-Genix-sur-Guiers[28] - Chinois or Schneckenkuchen ('snail pie'), Alsace-Lorraine - Tarte Tropézienne, with custard[29] - Brioscia, Sicily - King cake Related breads [edit]Many other breads are enriched with eggs and often milk and butter; many of them are braided.[citation needed] Gallery [edit]- A gâteau des Rois - 15 kg (33 lb) brioche in Brioche Dance, vendéenne tradition - Brioche tressée de Metz - Cougnou - Brioche Saint-Genix See also [edit]Notes [edit]- ^ \"Brioche\". Lexico UK English Dictionary. Oxford University Press. Archived from the original on 2019-12-22. - ^ \"brioche\". The American Heritage Dictionary of the English Language (5th ed.). HarperCollins. Retrieved 2 May 2019. - ^ \"Brioche\". Collins English Dictionary. HarperCollins. Retrieved 2 May 2019. - ^ \"Brioche\". Merriam-Webster.com Dictionary. Merriam-Webster. Retrieved 2 May 2019. - ^ a b Robuchon, Joël, ed. (2007). Le Grand Larousse Gastronomique. Paris: Larousse. p. 134. ISBN 978-2-03-582360-1. - ^ \"Breakfast brioche recipe\". Delicious magazine. - ^ Ray, Tamal (6 July 2019). \"Tamal Ray's recipe for brioche bostock\". The Guardian. Archived from the original on 6 July 2019. It was also where I had my first taste of bostock, a French pastry originally devised as a thrifty way to use up stale brioche. - ^ Glenn Rinsky, Laura Halpin Rinsky, The Pastry Chef's Companion: A Comprehensive Resource Guide for the Baking and Pastry Professional, 2008, p. 39 - ^ Carême, Marie-Antoine. Le pâtissier royal parisien ou Traité élémentaire et pratique de la pâtisserie ancienne et moderne, Paris: J.-G. Dentu, 1815 - ^ Baking with Julia by Julia Child, 1996, p. 26; The Oxford Companion to Food by Alan Davidson, 2006, p. 100; The Taste of Bread by Raymond Calvel, 2001; The Joy of Cooking by Rombauer and Becker, 1997, p. 741; On Food and Cooking:the science and lore of the kitchen by Harold Mcgee, 2004, p. 538 - ^ \"Brioche\". Le Trésor de la Langue Française informatisé. Analyse et Traitement Informatique de la Langue Française. Retrieved 19 June 2011. - ^ \"Cotgrave's 1611 French/English Dictionary\". pbm.com. Retrieved 19 June 2011. - ^ La très belle et Très exquisse histoire des gateaux et des friandises by Toussaint-Samat, Paris: Flammarion, 2004, pp. 189–192 - ^ Grande Histoire de la Patisserie-Confiserie française by S. G. Sender & Marcel Derrien, Geneva 2003, Minerva Press, p. 72 - ^ Nicolas de Bonnefons, \"Les Délices de la Campagne,\" Amsteldan, chez Raphael Smith: 1654, LIVRE PREMIER. CHAPITRE II - ^ Grande Histoire de la Patisserie-Confiserie française by S.G. Sender & Marcel Derrien, Geneva 2003, Minerva Press, p. 127 - ^ Maguelonne Toussaint-Samat, \"History of Food,\" Blackwell Publishing, 1992, p. 243 - ^ Prosper Montagné, Larousse gastronomoque, Larousse, 1938, p. 244 - ^ - a. Fraser, Antonia (2002). Marie Antoinette: The Journey. Anchor. pp. xviii, 160. ISBN 978-0385489492. - b. Lever, Évelyne; Temerson, Catherine (2000). Marie-Antoinette: The Last Queen of France. St. Martin's Griffin. pp. 63–65. ISBN 978-0312283339. - c. Lanser, Susan S. (2003). \"Eating Cake: The (Ab)uses of Marie-Antoinette\". In Goodman, Dena; Kaiser, Thomas E. (eds.). Marie Antoinette: Writings on the Body of a Queen. Routledge. pp. 273–290. ISBN 978-0415933957. - ^ Trésor de la langue française informatisé s.v. -oche - ^ La très belle et Très exquisse histoire des gateaux et des friandises by Toussaint-Samat, Paris: Flammarion, 2004 - ^ \"The American Heritage Dictionary of the English Language: Fourth Edition\". Retrieved 2006-06-09. - ^ Cauchy, Alix (30 December 2014). \"La brioche de Nanterre\". Le Monde des Boulangers (in French). Retrieved 8 May 2022. - ^ \"LA DANSE DE LA BRIOCHE en quelques mots\" [THE DANCE OF THE BRIOCHE in a few words]. Le Quadrille Vendéen, Groupe de Folklore de Vendée (in French). Archived from the original on March 8, 2014. - ^ \"A propos de la Brioche Vendéenne ...\" [About Brioche Vendée]. l'Association Brioche Vendéenne (in French). 28 June 2008. Archived from the original on October 11, 2013. - ^ Hervyns, Marie José (1973). De zéro à vingt et un ans [From zero to twenty-one years old] (in French). Brussels: Éditions du Bélier. p. 102. - ^ Muller, Claude (1978). Coutumes & traditions du Dauphiné (in French). Grenoble: Éditions des 4 Seigneurs; Aubenas, Éditions de Bellande. p. 66. ISBN 978-2-85231-058-2. - ^ Vie quotidienne en Savoie [Daily life in Savoy] (in French). Albertville: Amis du vieux Conflans. 1979. p. 62. - ^ Tartes & accompagnements (in French). Paris: Artémis éd. 2008. p. 7. ISBN 978-2-84416-671-5. External links [edit]- Fr:Livre de cuisine/Brioche at Wikibooks - The dictionary definition of brioche at Wiktionary"
}