{
  "url": "https://www.funtrivia.com/trivia-quiz/Sports/Sporting-Greats-114595.html",
  "title": "Sporting Greats Quiz | Wide World of Sports | 15 Questions",
  "text": "Quiz Answer Key and Fun Facts 1. I was born on September 17th, 1960 in London, England. In 1984 I entered the Formula Ford 1600 at Brands Hatch, which I won. Between 1986-91, I raced in Formula 3000, and my best finish was 3rd in 1988. In 1991, I joined the Williams Grand Prix team as a test driver, and made my F1 debut a year later for Brabham at the British GP. In 1996, I won the F1 World Championship. Who am I? 2. I was born on June 15th, 1938 in Alabama, USA. I took up baseball for a living, and made my MLB debut in 1959, winning Rookie of the Year in 1961. I set the then National League record for playing in the most consecutive games. Who am I? 3. Tennis was my sport of choice, and I won 109 titles overall. I was born on 2nd September 1952 in Illinois, USA. In 1974, I won my first Wimbledon men's title, and followed that up with another success in 1982. I was runner-up to Arthur Ashe in 1975, and Bjorn Borg in 1977. Who am I? 4. Snooker is the game I became famous for. I was born on 16th January 1948. As a professional, I won the Canadian Open four times, the first of which was in 1974. I also became World Champion in 1980 and again in 1983, I became the first player to make a maximum 147 break at the World Championships. Who am I? 5. I was born on 17th December 1973 in Northwich, England. I took up running, and in 1992 won the World junior cross country Championship. In the 1996 Atlanta Olympics, I finished 5th in the 5,000 metres, and fourth in the 2000 Sydney 10,000 metres Olympics. Who am I? 6. I am a former soccer player, born on 12th April 1941. I made my professional debut for West Ham United in September 1958, and played over 500 games for the club. I made my international debut for England against Peru in May 1962, and captained the team to World Cup success in 1966. Who am I? 7. Golf was my chosed profession. I was born in Glasgow, Scotland on 23rd June, 1963. In 1985, I won my first title, as I became Scottish strokeplay champion, and turned pro two years later, after winning the Scottish amateur championship. I played in my first Ryder Cup in 1991. In 1993, I won my first European Order of Merit title. Who am I? 8. My chosen profession was Motor Cycle racing. I was born on 4th June, 1965 in Brisbane, Australia, and come from a family of brothers, who all enjoyed racing bikes. I started my career at the Surfers Paradise Raceway riding a Yamaha, and quickly moved into Superbikes, where I finished 3rd and 1st in my first races. I moved into Grand Prix bike racing, where I became a five time World Champion. Who am I? 9. Born on 27th October 1964 in New South Wales, Australia, I chose to play the sport of cricket. In 1979, I joined Northern District, before moving on to play for my state, New South Wales. I made my Test debut against the West Indies in 1988 and ended my career against England in 1999. Who am I? 10. I was born on 23rd March 1962 in Marlow, England. In 1984 I won the first of my Olympic medals, in the Coxed Fours at Los Angeles. In 1997 I was diagnosed with diabetes, but put all the troubles behind me, and won a fifth Olympic Gold Medal in Sydney in 2000. Who am I? 11. I used football as a way to get into college. I eventually went into the military. I won a Heisman Trophy Award. I also led my NFL team to many Super Bowls, and even won two of them. I was also a 27 year old rookie in the NFL. Who am I? 12. I am an athlete who enjoyed the long jump. I was born on 29th August 1946 in New York, USA. I gained a Gold Medal at the 1968 Mexico City Olympics by smashing the World record at that time. Who am I? 13. I was born in 1941 and raised in Akron, Ohio. I was a third team All-American in high school, and a three year letter winner at Bowling Green State University. I turned pro in 1963, and was a terror to Wilt Chamberlain at 6'11\". Who am I? 14. I was a rather good thrower of darts. My real first name is John, but I go by another. I was born on 22nd March 1949 in Kircaldy, Scotland. I won the Embassy World Championship in 1982 when I became the first Scotsman to do this. Who am I? 15. I was born on 23rd May 1954 in New Jersey, USA. I took up the noble art of boxing as a profession, and won 57 amateur bouts, and in 1974 turned professional. I won the World middleweight title in 1979 and went on an unbeaten streak that lasted until my final fight against 'Sugar' Ray Leonard in 1987, which I lost on points. Who am I? Source: Author silverginger This quiz was reviewed by FunTrivia editor ozzz2002 before going online. Any errors found in FunTrivia content are routinely corrected through our feedback system."
}