{
  "url": "https://schaller.info/en/machine-heads/",
  "title": "Machine heads for electric guitars, acoustic instruments and banjos",
  "text": "Machine heads for electric guitars, acoustic instruments and banjos To be able to use the full range of Shopware 6, we recommend activating Javascript in your browser. English Deutsch English Español Français Italiano English Deutsch English Español Français Italiano Close menu Your account Log in or sign up Overview Your profile Addresses Payment methods Orders Quick order Credit Cards €0.00* Home Machine Heads Bridges Tremolos S-Locks Megaswitches, Preamp & Pickups Parts & Accessories News Close menu English Deutsch English Español Français Italiano Show all categories Machine Heads Back Show Machine Heads Machine Heads Name A-Z Name Z-A Price ascending Price descending Topseller Please set the \"Comfort functions\" Cookies to activate the wishlist! GrandTune single guitar and ukulele From €21.50* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! GrandTune Classic Lyra with guide bushings 10 mm From €150.00* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! GrandTune Classic Hauser with guide bushings 10 mm From €150.00* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! GrandTune Classic Hauser without guide bushings From €150.00* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! GrandTune Mandolin reverse and non-reverse Details Please set the \"Comfort functions\" Cookies to activate the wishlist! M6 Serie (M6 90, M6 135, M6 180, M6 Pin/Locking) Details Please set the \"Comfort functions\" Cookies to activate the wishlist! M6 Fender-Style Standard+Locking From €21.50* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! M6 Mini From €21.50* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! 70´s Fender -Style From €11.60* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Deluxe Kluson-Style From €11.60* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! BM Schaller-Style From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! BM Music Man-Style From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! BM Rickenbacker-Style From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! BM Fender-Style From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! BM Light From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! M4 90 From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! M4 180 From €24.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Lyra From €76.80* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Hauser From €76.80* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Banjo B5 From €31.40* Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Buttons Details Please set the \"Comfort functions\" Cookies to activate the wishlist! Replacement Kits Machine Heads Details Shop Service Merchant login Consumer login Shipping information Payment Contact us Newsletter facebook Instagram YouTube User Guides FlagShip Hannes®-Bridge Posts for machine heads Megaswitches Megaswitch Bass S-Locks Left or right machine head Information Imprint GTC Schaller Data protection policy Cancellation policy Statutory information obligation Cookie settings * All prices incl. VAT plus shipping costs and possible delivery charges, if not stated otherwise. This website uses cookies to ensure the best experience possible. More information... Deny Configure Accept all cookies"
}