{
  "url": "https://nineplanets.org/questions/how-many-planets-are-in-our-solar-system/",
  "title": "How Many Planets are in our Solar System? | Facts & Amount",
  "text": "A star that hosts planets orbiting around it is called a planetary system, or a stellar system, if more than two stars are present. Our planetary system is called the Solar System, referencing the name of our Sun, and it hosts eight planets. The eight planets in our Solar System, in order from the Sun, are the four terrestrial planets Mercury, Venus, Earth, and Mars, followed by the two gas giants Jupiter and Saturn, and the ice giants Uranus and Neptune. These are the eight planets of our Solar System; however, there is a ninth, or at least, there used to be a ninth planet, namely Pluto. Pluto was considered the ninth planet of our Solar System until 2006, when it was declassified to a dwarf planet. Conclusion For Pluto This happened after astronomers settled upon what would define a planet, and Pluto seemed to lack criteria. Many, even from high positions at NASA, still consider Pluto, the ninth planet of our Solar System. As such, it is quite a matter of preference for how many planets are in our Solar System. Even if Pluto is now classified as a dwarf planet, it still is remarkable, in the sense that small planets are quite a rarity when it comes to stellar systems. A New Planet? Many believe a mysterious tenth (if considering Pluto) or ninth planet is orbiting in our Solar System, commonly referred to as Planet X. This hypothetical planet might be the size of Neptune, and it would have a highly elongated orbit, even more so than Pluto. Planet X would complete one orbit around the Sun once every 10.000 or 20.000 years. Some mathematical evidence leads many to believe that this elusive planet indeed exists. In 2015, Caltech astronomers showed that something massive out there disrupts the orbits of at least several other objects located in the Kuiper Belt. This may indeed be a planet, but further evidence is needed to support this. The Solar System But let us get back to the known planets of our Solar System. The closest planet to the Sun is Mercury, followed by Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and the dwarf planet Pluto. This is the order of the planets. The smallest planet in our Solar System is Mercury, which is only one third the size of Earth, while the biggest planet in the Solar System is Jupiter, which is 11 times bigger than our Earth, and more than 1,300 could fit inside it if it were hollow. Mercury is only 0.4 AU or 58 million km / 36 million mi away from our Sun, while our Earth is at 1.00 AU or 150 million km / 93 million mi away. The farthest planet, Neptune, is 30 AU or 4.5 billion km / 2.8 billion mi away from the Sun, and if you want to know how far Pluto is, its 39.5 AU or 5.9 billion km / 3.7 billion mi away from the Sun. Here is a table about the planets in our Solar System, their mass, size, and distance from the Sun. Scientists have analized many other planetary systems throughout the Universe, and it seems that our Solar System isn’t so unique. Many other planetary systems have either less, equal, or even more planets than our Solar System. One interesting fact about our Solar System is that it lacks a specific type of planet called a Super-Earth. Super-Earth planets are terrestrial planets that are more massive and much bigger than our Earth, by several times. These giant planets are usually smaller than the gas giants; however, they should harbor life, and it would be interesting to think about how life would evolve on such a planet. Just imagine our Earth being four times bigger, at least, how many species could there have been in such a world. Are There More Planets in Our Solar System? You could say that there are 13 planets in our Solar System, maybe even more. Pluto isn’t the only dwarf planet orbiting the Sun; there are others as well. The dwarf planets Ceres, Haumea, Makemake, and Eris, are also orbiting our Sun, so there are actually 13 planets in our Solar System. The biggest dwarf planet is Pluto, followed by Eris, Haumea, Makemake, and Ceres. Some consider that the biggets moon of Pluto, named Charon, might also be a dwarf planet. Regardless of its classification, Charon is even bigger than Ceres. Ceres is an attractive dwarf planet since it is also classified as an asteroid, the biggest yet discovered. Some believe that life may have come from Ceres through the process of panspermia. Regardless, some other big-sized objects were discovered in our Solar System, such as Sedna, Quaoar, Orcus, Gonggong, Chiron, or Interamnia. Some of them have been classified as asteroids, comets, but many are possible dwarf plantes. If this is true, then our Solar System really seems like a crowded place. Who knows what we will discover in the future and if the hypothetical Planet X will also be debunked one day. Did you know? - The planet which has the most natural satellites/moons in our Solar System is the gas giant Saturn – hosting 82 moons, some of which are among the biggest we know of, like Titan, who is larger than the planet Mercury, or Iapetus, Rhea, Tethys, and Dione, which are dwarf-planet sized. - When it comes to the biggest moon in our Solar System, that would be Ganymede, Jupiter’s largest moon. It is also the ninth-largest object in our Solar System, having a radius of 2.634 km / 1.636 mi. - Everything in the Universe moves, and this also applies to our Solar System, which has an average velocity of 720,000 km / 450,000 mi per hour. - If you want to look in the direction of where our Solar System is moving, you would have to find the star Sirius and Vega. Sirius is the brightest star in the night sky, and it will be easier to find. Simply stand with your back to Sirius facing northwest, and you’ll be facing the direction of where our Solar System is headed through the Milky Way galaxy. - The Earth might not be flat, but our Solar System sure is. All the planets in the Solar System are orbiting in a very thin plane surrounding the Sun. Sources: Image Sources: - https://www.universetoday.com/wp-content/uploads/2009/07/solar-system-lrg-1280×720.png - https://content.production.cdn.art19.com/images/22/db/98/67/22db9867-ee10-4448-971c-e9618fbb3eb8/ed28995f1e943311d631d74b6a7b00be7ecba38a8f7a4f15c14913831439e750b20b06bad468bf57308467c7caded952156afd4372cd0fdb4f5097c774da7ddc.jpeg - https://cdn.mos.cms.futurecdn.net/hzLVJztTAfH2eEgsPY8RQV-1200-80.jpg - https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Solar-System.pdf/page1-1280px-Solar-System.pdf.jpg - https://www.quora.com/How-do-I-find-a-high-definition-map-of-our-solar-system-that-includes-things-like-Mars-moons-and-the-small-details-of-the-solar-system"
}