{
  "url": "https://www.drugwatch.com/legal/roundup-lawsuit/",
  "title": "Roundup Lawsuit: (February 2026) $11 Billion Paid",
  "text": "Roundup Lawsuit Roundup lawsuits filed against Monsanto (now Bayer) claim the weed killer caused cancer, and the company failed to warn about the health risks of glyphosate. Monsanto agreed to pay nearly $11 billion to settle Roundup cancer claims, but lawyers continue to investigate and accept new lawsuits as trials continue. On Jan. 16, 2026, the U.S. Supreme Court announced it will review a Roundup lawsuit in a move that could impact more than 60,000 active cancer claims. Our content is developed and backed by respected legal, medical and scientific experts. More than 30 contributors, including product liability attorneys and board-certified physicians, have reviewed our website to ensure it’s medically sound and legally accurate. legal help when you need it most. Drugwatch has provided people injured by harmful drugs and devices with reliable answers and experienced legal help since 2009. Brought to you by The Wilson Firm LLP, we've pursued justice for more than 20,000 families and secured $324 million in settlements and verdicts against negligent manufacturers. More than 30 contributors, including mass tort attorneys and board-certified doctors, have reviewed our website and added their unique perspectives to ensure you get the most updated and highest quality information. Drugwatch.com is AACI-certified as a trusted medical content website and is produced by lawyers, a patient advocate and award-winning journalists whose affiliations include the American Bar Association and the American Medical Writers Association. About Drugwatch.com - 15+ Years of Advocacy - $324 Million Recovered for Clients - 20,000 Families Helped - A+ BBB Rating - 4.9 Stars from Google Reviews Testimonials I found Drugwatch to be very helpful with finding the right lawyers. We had the opportunity to share our story as well, so that more people can be aware of NEC. We are forever grateful for them. - Legally reviewed by Whitney Ray Di Bona, Esquire - Last update: February 3, 2026 - Est. Read Time: 14 min read - Eligibility - You may qualify to file a Roundup lawsuit if you personally used Roundup for at least 40 hours, were diagnosed with non-Hodgkin lymphoma or a related subtype, and your case is still within your state’s time limit. - Lawsuit status - As of February 2026, more than 60,000 active Roundup lawsuits remain, with new cases still being filed. Bayer has recently suffered several significant losses in court, including a $2 billion verdict in Georgia. The U.S. Supreme Court will soon review a Roundup lawsuit, and its eventual ruling could be pivotal for these cases. - Settlement amounts - Bayer set aside $10.9 billion to settle some Roundup lawsuits in 2020, but thousands of lawsuits remain. Individual compensation will depend on the extent of injuries and other factors. - Deadline to file a lawsuit - The deadline to file a Roundup lawsuit varies from state to state. It can be as little as one year from the time you were diagnosed with cancer in some states. Speaking to an attorney as soon as possible is critical for filing a lawsuit on time. Do I Qualify for a Roundup Lawsuit? If you used Roundup regularly before being diagnosed with non-Hodgkin lymphoma, you might be eligible to file a lawsuit. People who are most likely to be exposed to large amounts of Roundup over a long period of time are agricultural workers and farmers. - Exposure: You used Roundup long-term in landscaping, farming or around the home. - Diagnosis: You were diagnosed with non-Hodgkin lymphoma or a related cancer. - Timing: You’re still within your state’s filing deadline. - Evidence: You can provide proof of your Roundup use and medical records showing a related cancer diagnosis. - No prior release: You haven’t already accepted a Roundup settlement. People have filed individual lawsuits seeking compensation for their injuries. Others filed class action claims for reimbursement of the cost of the product. The above criteria are guidelines; only a Roundup lawyer can tell you for sure if you qualify. The International Agency for Research on Cancer classified the active ingredient that most Roundup formulas used to have, glyphosate, as a “probable carcinogen” in humans. Lawsuits argue that despite this ruling and the studies that link glyphosate and Roundup to non-Hodgkin lymphoma or related cancers, Bayer and Monsanto continued to represent Roundup as safe for humans and the environment. “Regarding recent lawsuits attempting to link glyphosate to non-Hodgkin lymphoma, it’s essential to understand that while there’s an ongoing debate, some studies suggest a correlation,” Jonathan Rosenfeld, founder and managing attorney at Rosenfeld Injury Lawyers, told Drugwatch. “However, causation isn’t definitively established yet, and legal battles often hinge on proving this link in court.” How To File a Roundup Lawsuit If you believe Roundup exposure caused your non-Hodgkin lymphoma or a related cancer, there are seven steps for filing a Roundup lawsuit and taking it through the legal process. - Collect Your Evidence: Gather proof that you used Roundup and any medical records that show you have been diagnosed with cancer, like non-Hodgkin lymphoma. - Talk to a Lawyer: Find a lawyer who specializes in Roundup cases. Drugwatch works with leading attorneys involved in Roundup lawsuits and can help connect you with one who is well-suited to your particular case. Our attorney partners offer a free consultation to determine if you have a case. - File Your Lawsuit: Bring your case against Monsanto and Bayer (the makers of Roundup) in court before the deadline for filing expires. - Discovery Phase: Both sides will share evidence and question each other’s witnesses to prepare for the case. - Settlement Talks: Often, the case can be settled at this stage, meaning both sides agree on compensation without going to trial. - Going to Trial: If a settlement isn’t reached, your case will go to trial, where either a judge or a jury will decide the outcome. - Compensation: If you win the case or settle, you may receive financial compensation for your suffering. This process can be complex, but understanding these steps can help you navigate it more easily. Proof You’ll Need and How To Get It You can prove Roundup exposure by providing personal receipts or information from your job about Roundup use, along with proof of non-Hodgkin lymphoma or a related diagnosis. An experienced Roundup lawyer can help you obtain evidence for your lawsuit. Your lawyer will find experts to link your cancer to Roundup use and exposure. But providing personal evidence will help establish proof that you were exposed. Residential or Home Use If you’re considering a lawsuit related to Roundup, it’s essential to gather evidence showing that you used it and where. This proof can help link any health issues, like cancer, to your exposure. - Photos or videos: Take pictures or videos of yourself using Roundup and save them on your phone or social media. - Product labels: If you have empty Roundup bottles, keep them and take clear photos. - Property records: If you've moved, gather records that show where you used Roundup. - Purchase history: Keep receipts or bank statements that show where you bought Roundup. - Witness statements: Get neighbors or friends to write down their observations of you using Roundup. - Yard work notes: Record when and how often you used Roundup in your gardening. Collecting and keeping these records will make your lawsuit stronger and help an attorney connect your evidence to your health claim. If you are missing some types of proof, a lawyer can help you find other ways to show how often and where you used Roundup. Occupational Use (Job) To prove you were exposed to Roundup at work — like on a farm or landscaping job — you need to gather some important documents. These can help link any health issues, such as cancer, to your job exposure. - Pesticide use records: Look for logs that mention Roundup used by your employer. - Training certificates: Find proof of any safety training related to pesticides, especially Roundup. - Work orders or invoices: Gather paperwork showing jobs that involved using Roundup, including dates and locations. - Pesticide license: If you have a pesticide license, keep it, as it shows you were trained to handle chemicals. - Coworker statements: Get signed statements from coworkers or supervisors about how often you used Roundup. - Work schedules: Collect any documents showing your work hours and areas where you applied Roundup. Gathering these records helps your lawyer build a strong case. If you can’t find everything, your attorney can assist in tracking down the necessary documents. Medical Records If you plan to file a Roundup lawsuit, collecting the correct medical records is crucial. These documents confirm your illness, like non-Hodgkin lymphoma, and strengthen your case with the court and insurance companies. - Cancer diagnosis report: This confirms your diagnosis and includes the type of non-Hodgkin lymphoma, if available. - Medical notes: These should detail your diagnosis, symptoms and how the illness has progressed. - Treatment plan: Include details about your treatment, like chemotherapy or radiation, along with dates and side effects. - Illness severity documents: Show the seriousness of your condition and its stage, which are crucial for claims related to pain, lost wages and future medical care. Why is this important? The severity and stage of your cancer help your lawyer illustrate the impact of Roundup exposure on your life, ensuring your claim reflects what you truly deserve. Deadlines & Statutes of Limitations (SOL) Getting a free case review about qualifying to join a Roundup lawsuit is still possible. But each state has a statute of limitations, so state laws may limit your time to qualify. In some cases, the statute date may have already passed. Contact an attorney immediately to preserve your right to file a Roundup lawsuit and see if you qualify. Many states have something called a “discovery rule.” This states that the deadline to sue may start after you first discover you have non-Hodgkin lymphoma, instead of when you were first exposed to Roundup. If you are filing a wrongful death lawsuit over a family member’s death from Roundup exposure, your time limit may be different. Again, each state has a time limit that can vary depending on the state and the circumstances surrounding the death. Waiting too long to file could mean losing the chance for compensation. Roundup Lawsuit Settlement Amounts Although Bayer offered up to $10.9 billion to settle thousands of Roundup personal injury claims in 2020, thousands of cases are still pending. So far, lawyers estimate that Roundup settlement payouts are between $5,000 and $250,000, and the average settlement per plaintiff is $150,000. Keep in mind, no settlement amount is guaranteed. Your case may be worth more or less, depending on the facts in your case. People could still be diagnosed with non-Hodgkin lymphoma after using Roundup, and there could be future Roundup settlements and jury verdicts for these claimants. - Severity of your injury - Disruption of your daily life - Medical care, including future medical treatments - Emotional and mental injuries People could still be diagnosed with non-Hodgkin lymphoma after using Roundup, and there could be future Roundup settlements and jury verdicts for these claimants. However, the amount you receive (net) may be less than the total settlement (gross) because of medical liens. These include claims Medicare, Medicaid or private insurers have for treatment costs. They must be paid first. This lien repayment can reduce your payout by thousands, so understanding this helps set realistic expectations for compensation. Is the Roundup Lawsuit a Class Action? If you file a Roundup lawsuit claiming you developed non-Hodgkin lymphoma or related cancers from Roundup exposure, it will be an individual personal injury lawsuit. However, it may be added to the federal multidistrict lawsuit (MDL) involving thousands of Roundup lawsuits. A multidistrict litigation (MDL) combines many separate lawsuits with similar claims, like injuries from the same product, into one court for pretrial proceedings. Each plaintiff keeps an individual case and must prove their own facts. In contrast, a class action is a single lawsuit filed on behalf of a group with nearly identical claims, where one or more representatives act for the entire class. People have filed individual lawsuits seeking compensation for their injuries. Others filed class action claims for reimbursement of the cost of the product. Cancers Cited in Roundup Lawsuits While most Roundup lawsuits involve people with non-Hodgkin lymphoma, there are several other types of cancer named. If you developed one of these after exposure to Roundup, you are still eligible to file a Roundup lawsuit. - Anaplastic large cell lymphoma - B-lymphoblastic lymphoma - Burkitt lymphoma - Chronic lymphocytic leukemia - Cutaneous T-cell lymphoma - Diffuse large B-cell lymphoma - Extranodal marginal zone B-cell lymphoma, mucosa-associated lymphoid tissue - Follicular lymphoma - Hairy cell leukemia - Large granular lymphocytic leukemia - Lymphoplasmacytic lymphoma (Waldenström Macroglobulinemia) - Mantle cell lymphoma - Marginal zone B-cell lymphomas - Mycosis fungoides - Nodal marginal zone B-cell lymphoma - Peripheral T-cell lymphomas - Primary central nervous system lymphoma - Sézary syndrome - Small lymphocytic lymphoma - Splenic marginal zone B-cell lymphoma What Experts and Patients Say About the Roundup Lawsuits What Are the Latest Roundup Cancer Lawsuit Updates? So far, Roundup lawsuits against Bayer and Monsanto continue to be filed, and lawyers are still representing clients. Some lawsuits have already been resolved as part of the 2020 $10.9 billion Roundup settlement or in trial. As of February 2026, there are 3,902 open Roundup lawsuit cases in federal MDL in California. Timeline of Roundup Cancer Lawsuits - February 2, 2026: Roundup Cases Leaving Federal Court Over the last month, hundreds of Roundup cases that were part of the federal MDL have left that group, with some being remanded to state courts where tens of thousands of lawsuits are active. The judge overseeing the MDL has also noted that people who have declined settlement offers through the MDL's framework \"may wish to reconsider\" their decision giving the looming Supreme Court review. - January 22, 2026: Supreme Court Decision on Roundup Could Come This Summer Bayer has said that it expects a Supreme Court decision on its review of a Roundup lawsuit by June. This will be a pivotal moment for these cases. Bayer is counting on a favorable ruling to attempt to escape much of this litigation. But if the Supreme Court does not side with Bayer, or even issues a ruling narrow in scope, then that could be a significant win for these cases. - January 16, 2026: Supreme Court to Review Roundup Lawsuit In a major move that could impact thousands of cases, the U.S. Supreme Court has decided to review a Roundup lawsuit. This is something that Bayer has pushed for and has been a key part of its strategy to escape this litigation. A positive ruling from the court could be devastating for active lawsuits, but it's unclear how it will rule. Lower courts have been divided on the issue. - January 2, 2026: Iowa House to Consider Law Shielding Bayer from Roundup Lawsuits The Iowa House of Representatives is set to once again consider a bill that, if passed, could shield Bayer from Roundup litigation. That bill had failed to move forward in 2025 after it was passed by the Iowa Senate. It is unclear if the bill has enough support to pass at this time. North Dakota and Georgia are the only states so far to pass shielding laws. - December 11, 2025: More Roundup Lawsuits Filed in Federal Court While the vast majority of Roundup lawsuits are progressing in state court, there are thousands of federal cases grouped together as well. As of December, there are now more than 4,500 active federal lawsuits. That number has continued to creep up, with more than a dozen new cases filed over the last few weeks. - December 4, 2025: Journal Retracts Study That Had Found Roundup to Be Safe A journal has formally retracted a 25-year-old study that found Roundup's active ingredient to be safe. The journal said that it had made the decision to retract after \"thorough investigation into the circumstances surrounding the authorship and content of this article.\" Internal documents released years ago as part of the Roundup litigation had shown that Monsanto scientists may have assisted in the creation of the paper. - December 2, 2025: Trump Administration Clears Path for Roundup Lawsuit to Advance to Supreme Court In a move that could be critical to thousands of Roundup lawsuits, the federal government has given the green light for the U.S. Supreme Court to hear a Roundup case and has also thrown its support behind Bayer's argument that Roundup lawsuits are preempted, or overruled, by federal law. This is something that Bayer has pushed for, as it believes that a positive Supreme Court ruling could effectively end the litigation in its favor. The Court still must officially decide to take up a case. - November 25, 2025: Previous Plaintiff Win Upheld in Roundup Case A California appeals court has upheld a $28 million verdict in a previous Roundup lawsuit. The case involved a man who developed cancer after using Roundup for more than 30 years. - November 20, 2025: Bayer Settles $2 Billion Roundup Case Bayer has agreed to a settlement that will resolve a case involving a Georgia man who developed cancer after using Roundup for years. That man had won a $2 billon jury verdict in Georgia state court earlier this year. The settlement amount was not disclosed, but it provides the plaintiff with a faster payout and helps Bayer avoid a protracted legal battle over that verdict. - November 10, 2025: Bayer Stock Reportedly Down More Than 70% Since Buying Roundup Maker Monsanto Highlighting the toll that the Roundup litigation has taken, a recent Bloomberg article noted that Bayer’s stock has fallen by more than 70% since it acquired Roundup maker Monsanto in 2018. The company has put billions of dollars toward settlements and litigation fees, but tens of thousands of lawsuits remain active, with more still being filed. - November 3, 2025: Thousands of Roundup Lawsuits Remain Active in Federal Court At the start of November, there are 4,490 Roundup lawsuits active in federal court. This is an increase of about 20 cases over the last month. Remember that much of the action for these lawsuits is taking place in state courts, where tens of thousands of cases are still pending. - October 20, 2025: Bayer Expects a Supreme Court Decision on Whether it Will Hear a Roundup Case by the End of the Year Bayer expects to know in the coming months if its petition to have the U.S. Supreme Court weigh in on the Roundup litigation will be successful. In an interview with Brownfield, an ag radio network, Bayer Head of Crop Science Communications Jessica Christiansen said that the company's understanding is that it should hear back from the court by the end of the year. A Supreme Court decision in the company's favor is a key part of Bayer's strategy to attempt to escape the Roundup lawsuits. - October 15, 2025: Bayer Considering Appeal Options for $611 Million Roundup Verdict Bayer has told the Missouri Independent that it is considering its appeal options after the Missouri Supreme Court refused to hear the company's appeal of a $611 million Roundup verdict. It's unclear, however, what those appeal options may be. The likely next step would be taking the case to the U.S. Supreme Court, but a separate petition is already pending for that court to hear a Roundup case. - October 9, 2025: Supreme Court Decision on Hearing a Roundup Case Still Looming One major decision that could affect thousands of Roundup lawsuits that we are still waiting on is whether or not the U.S. Supreme Court will take up a Roundup case. Bayer is hoping that will happen. The company views a positive ruling from the court as a potential way to escape the litigation. The Supreme Court is expected to decide if it will hear a Roundup case during the 2025-26 court session. - October 2, 2025: Missouri Supreme Court Passes on Roundup Appeal In a win for several people who filed lawsuits, the Missouri Supreme Court has decided against taking up Bayer's appear of a $611 million Roundup verdict. That verdict had been awarded to three people who claimed they developed cancer after being exposed to the weed killer. - October 1, 2025: Modest Growth for Roundup MDL At the start of this month, there are 4,472 active Roundup lawsuits grouped together in the federal MDL. This is an increase of eight cases from the start of September. Much of the action surrounding these cases continues to take place in state court. Bayer recently said that it is facing more than 60,000 total Roundup lawsuits. - September 18, 2025: Previous Monsanto Win Upheld An appeals court has upheld a Roundup trial win for Monsanto. The trial, which had taken place in Illinois, had been won by Monsanto in 2023. - September 17, 2025: What's Next for Roundup Lawsuits It has been a quiet couple months for the Roundup lawsuits, but this litigation is still well underway. One of the biggest updates that we are still waiting on is whether or not the U.S. Supreme Court will hear a Roundup case. This is something that Bayer has pushed for, as it believes that a positive ruling could help it to escape the litigation. It's unclear when the Supreme Court may make a decision on hearing a case. There are still thousands of active Roundup lawsuits across the country, with more being filed. Individual cases are working their way through the legal process. - August 2025: Bayer says that there are still more than 60,000 unresolved Roundup claims. The company also announced that it has set aside about $1.3 billion in provisions for this litigation. The company has made clear that it believes these cases could be nearing a conclusion. It said that it plans to \"significantly contain\" the Roundup lawsuits by the end of 2026 as it continues to settle cases. We are also still waiting to hear whether or not the Supreme Court will agree to weigh in on a Roundup case, which Bayer is pushing for. - June 2025: The New Jersey Supreme Court has opted to created a multicounty litigation (MCL) for Roundup lawsuits. MCLs are used when many similar lawsuits are pending within a state. This groups those cases together so they can move through the legal process together in a more streamlined effort. When the application to create an MCL was filed in March, 41 cases were pending across the state. Also this month, the Supreme Court invited the solicitor general to weigh in on whether the court should hear a Roundup case. Bayer has said that, even with this delay, it still thinks a ruling could come within the next year if the Supreme Court takes the case. - May 2025: Bayer is reportedly making a renewed effort to resolve some Roundup lawsuits through another settlement. The company had previously agreed to a $10 billion settlement in 2020, but new lawsuits and big trial wins for plaintiffs continue. The settlement may involve claims in Missouri state court, where thousands of cases are pending. Also this month, Bayer lost appeals to overturn two Roundup verdicts from 2023. One had awarded $611 million to a group of plaintiffs, while the other had awarded $175 million to one plaintiff. Earlier this month, Georgia became the second state after North Dakota to sign a law that could significantly shield Bayer from the claims at the heart of many Roundup lawsuits. Similar legislation has been rejected in other states. - April 2025: Bayer announced that it has filed a petition to send a Roundup case to the U.S. Supreme Court. Front and center will be the issue of federal preemption, which has seen divided decisions among courts. If the Supreme Court were to side with Bayer, then active Roundup lawsuits that rely on state labeling laws could be in jeopardy. Also this month, North Dakota became the first state to pass a law shielding Bayer and other manufacturers from some pesticide lawsuits. There are similar bills pending in multiple states, but they may not all see success. The bill in Iowa appears to not be moving forward. - March 2025: The latest Roundup trial has ended in a massive verdict for the plaintiff. A Georgia jury awarded about $2.1 billion to John Barnes, who claimed he developed non-Hodgkin lymphoma after 20 years of using Roundup. This is one of the largest verdicts ever awarded to a Roundup plaintiff. Also this month, the Iowa Senate passed a bill proposed by Bayer that would shield the company from pesticide lawsuits. The bill will now be considered by the Iowa House of Representatives. - February 2025: The Iowa Senate has advanced a bill that would essentially prohibit Roundup lawsuits in the state. The bill, which was originally proposed by Bayer, would prevent plaintiffs from bringing failure to warn claims against pesticide manufacturers as long as they followed federal label rules. Similar bills are currently pending across multiple states. - December 2024: The latest Roundup case, Antonou v. Monsanto, has ended in a mistrial after Monsanto’s lawyer referenced a past alcohol-related criminal charge against the plaintiff during cross-examination. Judge Daniel Trevino ruled that the lawyer's line of questioning constituted “serious misconduct.\" He also cautioned Monsanto against \"any further conduct that could result in sanction or a contempt finding.\" Plaintiff’s attorneys called for a mistrial because they believe the introduction of criminal charges unfairly prejudiced the jury against the plaintiff. Some plaintiff’s firms have commented online about this behavior, condemning it as a blatant attempt to prejudice the jury. When a judge declares a mistrial, most cases will be tried again later with a new jury. - November 2024: The defendants won the latest Roundup trial in the Philadelphia Court of Common Pleas. Plaintiff Judith Womack was diagnosed with non-Hodgkin lymphoma in 2019 after she had been using Roundup for years, starting in 2015. However, the Philadelphia jury sided with Monsanto and determined that the company was not responsible for her cancer. This continues the streak of inconsistency in verdicts for recent Roundup trials. - October 2024: A Philadelphia jury awarded a $78 million verdict to a man who blamed his non-Hodgkin lymphoma on decades-long use of Roundup. William Melissen had used the weed killer regularly since 1992 and was diagnosed with cancer in 2020. This big win turned the tide on what had been a strong few months for Monsanto and Bayer, who will look to appeal the ruling. - September 2024: Bayer secured another Roundup trial win after a Philadelphia jury determined that subsidiary Monsanto’s weed killer was defective but did not cause plaintiff Ryan Young’s non-Hodgkin lymphoma. This was the second victory for Bayer in a month after a Missouri appeals court also upheld a previous win for the company. In that trial, plaintiff Stacey Moore had appealed in part based on the exclusion of his expert’s testimony in the original trial. However, the appeals court affirmed that the expert was not qualified to discuss Roundup’s potential ties to cancer. - August 2024: In a potential blow to plaintiffs, the 3rd U.S. Circuit Court of Appeals in Philadelphia ruled in Monsanto and Bayer’s favor in Schaffner v. Monsanto. The court determined in a unanimous ruling that the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA) preempts state law. The Schaffners claimed Monsanto violated the state law by not including cancer warnings on labels, but this ruling rejects that claim. This created a circuit split with previous rulings, and Bayer pushed for the issue to be determined before the Supreme Court. - July 2024: Judge Ann Butchart of the Philadelphia Court of Common Pleas upheld Monsanto's only winning trial verdict in that court. This ruling could affect future cases because several rulings regarding evidence shown at trial gave Monsanto the upper hand and disadvantaged plaintiffs. Plaintiffs are appealing this ruling. An Oregon appeals court overturned a previous Bayer win in a Roundup trial this month. The decision was based on the determination that the trial court committed an error by excluding certain testimony regarding EPA regulation. In research news, French scientists published a study in Ecotoxicology and Environmental Safety that suggests that glyphosate negatively impacts human reproductive health by contributing to infertility. - June 2024: A state court judge slashed the $2.25 billion McKivison verdict for a Pennsylvania man to $400 million dollars. The jury had originally awarded him $2 billion in punitive damages. McKivison’s lawyers say they will appeal to get the original verdict reinstated, and Bayer said it would continue to appeal the decision. Meanwhile, Bayer was reportedly heavily investing in lobbying efforts to influence Congress in favor of passing a law that would restrict Roundup-related lawsuits. Part of this campaign involved a clause in the Farm Bill, which Bayer helped draft, aiming to limit plaintiffs' claims of being uninformed about the herbicide's health risks. - May 2024: Plaintiffs applied to create a Roundup New Jersey Multicounty Litigation (MCL), but judges denied the application. According to the Court, there weren’t enough cases to warrant creating an MCL. An MCL is like an MDL in that it consolidates many cases for efficiency and cost savings. - April 2024: A Missouri court reduced the $1.56 billion verdict from November 2023 to $611 million. This was based on a U.S. Supreme Court decision limiting punitive damages to no more than 9 times the actual damages. - February 2024: The 11th U.S. Circuit Court of Appeals rejected Bayer's argument that the federal labeling requirements for pesticides trump state requirements that they come with a cancer warning. This complicates Bayer's legal strategy in dealing with lawsuits claiming Roundup cancer links. - January 2024: A Pennsylvania jury awarded John McKivison a $2.25 billion verdict after a trial in which he claimed Roundup caused his non-Hodgkin lymphoma — the largest Roundup lawsuit verdict yet. His lawsuit claimed he'd used the weedkiller around his property for 20 years. - December 2023: A jury ordered Bayer to pay $3.5 million to a plaintiff who claimed Roundup caused her to develop cancer. - November 2023: A jury in Missouri awarded $1.56 billion to four plaintiffs who claimed Roundup caused them or their spouse to develop non-Hodgkin lymphoma. Out of about 167,000 lawsuits, 113,000 had been resolved, according to Bayer. - October 2023: A San Diego jury awarded $332 million to a cancer patient after finding Monsanto didn’t adequately warn of the risks of Roundup. - June 2023: Bayer paid $6.9 million to the State of New York to settle claims that it misled consumers about the environmental effects of Roundup. - May 2023: Monsanto won the latest trial in St. Louis, Missouri, against plaintiff Sharlean Gordon. This was the company’s seventh consecutive win. - May 2021: San Francisco Judge Vince Chhabria denied Bayer’s Roundup class action lawsuit offer to settle future Roundup cancer claims for $2 billion. Chhabria deemed Bayer’s $2 billion offer to settle future Roundup cancer claims unreasonable and ordered the parties to present a better offer. “Bayer is a massive, wealthy company, and it continues to make money specifically from Roundup sales. Nor is there any indication that the company will cease its efforts to settle cases,” Judge Chhabria said in his May 2021 order. - June 2020: Bayer offered $10.9 billion to settle about 100,000 Roundup weed killer lawsuit claims. - May 2019: A California state jury awarded $2 billion to a Roundup plaintiff couple. - March 2019: A California state jury awarded $80 million to a Roundup plaintiff. - August 2018: A California state jury awarded $289 million to a Roundup plaintiff. Despite Bayer offering $10.9 billion to settle most claims, Roundup lawyers are still accepting claims to go to trial or negotiate a potential settlement. Does Glyphosate Cause Cancer? People filed Roundup lawsuits because they claimed Monsanto’s herbicide caused their non-Hodgkin lymphoma or related cancers. Monsanto was the original manufacturer of Roundup, but Bayer acquired Monsanto in 2018. “While we see various injuries, we most commonly see certain types of blood cancers linked to Roundup exposure including non-Hodgkin lymphoma and certain subtypes such as B-cell lymphomas and T-cell lymphomas,” attorney Jo Anna Pollock with Simmons Hanly Conroy told Drugwatch. Bayer and its subsidiary Monsanto are the primary defendants in thousands of lawsuits consolidated into multidistrict litigation (MDL) in California, claiming that the weedkiller Roundup caused cancer. An MDL consolidates many similar cases from across the country into one court to make litigation more efficient and save costs. Bayer maintains that Roundup is safe but stopped selling residential formulas with glyphosate, the former active ingredient, in 2023. Commercial formulas with glyphosate remain available. People who filed lawsuits say Bayer and Monsanto didn’t warn the public about the cancer risks. Injuries in Roundup lawsuits primarily involve non-Hodgkin lymphoma, a cancer affecting white blood cells. However, lawsuits also mention several other related cancers. Beyond Side Effects: Kathy’s Roundup Cancer Story Kathy Spreadbury loved caring for plants and watching them grow. As an avid gardener, the Pensacola, Florida, resident once cultivated more than 100 plumerias. But her passion was cut short when she was diagnosed with B-cell lymphoma following exposure to Roundup. After months of treatment and a painful physical decline, Kathy died on Christmas Eve in 2020. Her family blames Monsanto and Bayer for her cancer. Like many other patients and loved ones, Kathy’s husband of 37 years filed a Roundup cancer lawsuit. As they cherish Kathy’s memory, her family hopes to hold the makers of Roundup responsible. Glyphosate’s link to cancer is controversial, largely because of differing opinions from regulatory agencies. The World Health Organization classifies glyphosate as a “probable human carcinogen,” while the Environmental Protection Agency disagrees and says Roundup is unlikely to cause cancer in humans. An independent meta-analysis published in Mutation Research shows a 41% increased risk of non-Hodgkin lymphoma in agricultural workers exposed to large amounts of glyphosate. “Regarding recent lawsuits attempting to link glyphosate to non-Hodgkin lymphoma, it’s essential to understand that while there’s an ongoing debate, some studies suggest a correlation.” “Through my legal practice, I’ve witnessed the devastating impact glyphosate exposure can have on individuals and their families, underscoring the importance of addressing this issue comprehensively,” Rosenfeld said. Bayer maintains that over 800 studies submitted to the EPA confirm that glyphosate “can be used safely and does not cause cancer.” Monsanto Influenced Studies to Deceive the Public Lawsuits also claim the company actively deceived the public about Roundup’s safety. The “Monsanto Papers” — a collection of internal declassified corporate communications presented in court — revealed that the company may have hidden Roundup’s cancer link for years. It did this by influencing scientific studies related to the safety of glyphosate. A law firm representing Dewayne Johnson in a Roundup lawsuit released the Monsanto Papers during Johnson’s trial. The trial ended with a $289 million verdict in favor of Johnson in August 2018. It was reduced to $20.5 million on appeal. “[Monsanto Papers revealed] Monsanto-sponsored ghostwriting of articles published in toxicology journals and the lay media, interference in the peer review process, behind-the-scenes influence on retraction and the creation of a so-called academic website as a front for the defense of Monsanto products.” In an article published in The International Journal of Risk and Safety in Medicine, the author wrote that the papers revealed: “Monsanto-sponsored ghostwriting of articles published in toxicology journals and the lay media, interference in the peer review process, behind-the-scenes influence on retraction and the creation of a so-called academic website as a front for the defense of Monsanto products.” The website in question, “Academics Review,” has several articles criticizing studies that conclude glyphosate is harmful. According to the journal article, Monsanto allegedly funded the website. People Who Filed Roundup Lawsuits Drugwatch has analyzed several Roundup-related cases, including multidistrict litigation and class action lawsuits. Each case is unique, and outcomes vary. Discussing your situation with a lawyer can help determine if you or your family qualify for a Roundup lawsuit. Donnetta Stephens filed her suit against Monsanto and Bayer in the Superior Court of California in Alameda County in August 2020, Case No. CGC-20-585764. Roundup Usage Stephens regularly used Roundup to maintain her yard biweekly from 2000 to 2017, from April through September each year. Injuries Alleged Stephens was diagnosed with non-Hodgkin lymphoma on Dec. 15, 2017, attributing her illness to Roundup exposure. Her complaint cites significant harm, pain and suffering, physical injury and bodily impairment, including non-Hodgkin lymphoma and other cancers requiring medical intervention. Relief Sought Stephens sought compensatory damages from Bayer to cover medical costs and suffering. Additionally, she pursued exemplary and punitive damages against both Bayer and Monsanto for their alleged negligence in the development, testing, manufacture, promotion, distribution, marketing and sale of Roundup, alongside court costs. Verdict The jury ultimately ruled Roundup exposure did not reasonably cause Stephens’ cancer in December 2021. Her counsel plans to appeal the decision. In February 2019, Lisa Jones, Horacio Torres Bonilla and Kristoffer Yee filed a class action lawsuit against Monsanto on behalf of Roundup purchasers. This suit focused on deceptive labeling practices. Plaintiffs sought refunds for Roundup product purchases rather than filing personal injury claims. Deceptive Labeling Allegations Plaintiffs accused Monsanto of deceptive labeling regarding Roundup products. The label claimed glyphosate, the active ingredient, targeted only plant enzymes. Plaintiffs argued Monsanto knew the enzyme glyphosate targets is also present in human and animal gut bacteria, rendering the label false. Proposed Settlement Agreement An initial settlement proposed a $39.55 million Common Fund, with 25% for attorney fees. Claimants were to receive 10% of average retail prices for products purchased. Any unclaimed funds from the settlement will be distributed to designated cy pres charity efforts. Cy pres distribution allows the Court to take leftover money from a class action that cannot be given to plaintiffs and give it to a charity that supports the plaintiffs’ cause. Final Claims and Distribution In total, class members filed 285,399 claims representing about 1 million products. The value of valid claims reportedly ranged between $11.72 million and $13.34 million. After deducting fees and administration costs, $14 to $16 million remained for cy pres distribution. The proposed charities for the distribution would specialize in services such as ethical advertising and consumer protection. How Can a Roundup Lawyer Help Me? An experienced Ro"
}