{
  "url": "https://kids.nationalgeographic.com/space/article/what-is-a-planet",
  "title": "What is a Planet? | National Geographic Kids",
  "text": "What is a Planet? Learn about Earth's neighborhood. Far-Out Facts • Our solar system’s eight planets come in two flavors: smaller rocky planets with solid ground (Mercury, Venus, Earth and Mars) and larger gas giants (Jupiter, Saturn, Uranus, and Neptune). • You can spot six of the solar system’s planets with the naked eye from Earth—and all eight if you have binoculars or a telescope. • Astronomers have discovered hundreds of worlds beyond our solar system and are spotting more every day. Scientists believe some of these “exoplanets” may support alien life. Who knows. Maybe an alien kid elsewhere in the galaxy is wondering if you exist. Thousands of years before the invention of the Internet or Super Mario Kart, people entertained themselves by peering into the night sky and connecting the stars to create pictures—called constellations—of animals, objects, and legendary heroes. But these ancient stargazers noticed that some stars didn’t cooperate with the constellations. These oddball balls of light followed their own paths across the night sky, so the ancient Greeks called them “planetes,” meaning wanderers. By 1930, nine planets had been discovered: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and Pluto. But what exactly is a planet? It seems like an easy question. After all, you’re standing on one right now! But the scientific definition was fairly loose until recently. The discovery of other solar-system “wanderers” rivaling Pluto in size suddenly had scientists asking what wasn’t a planet. They put their heads together in 2006 and came up with three conditions for planethood: A planet must orbit the sun, be large enough so that its own gravity molds it into a spherical shape, and it must have an orbit free of other small objects. Unfortunately for Pluto, our one-time “ninth planet” failed to meet the third condition. It was downgraded to a “dwarf planet,” a classification of solar-system objects you can read about here."
}