{
  "url": "https://www.delish.com/cooking/menus/g65479054/martini-recipes/",
  "title": "40 Best Classic Martinis - How to Make A Martini Cocktail",
  "text": "1Dirty Martini PHOTO: LUCY SCHAEFFER; FOOD STYLING: BROOKE CAISON As every bartender worth their salt will tell you, the ratio for the perfect dirty martini is 5:1:1—chilled gin: dry vermouth: olive brine. That gets poured over a few ice cubes (like 3 to 5) and stirred until a little of the ice dilutes to tame this stiff classic cocktail. Get the Dirty Martini recipe. 2Porn Star Martini PHOTO: JOSEPH DE LEO; FOOD STYLING: BROOKE CAISON If you’re unfamiliar with this provocatively named cocktail, it’s made up of vanilla vodka, simple syrup, tart passion fruit (purée and liqueur), and bubbly Prosecco. It’s a summertime mood in a glass, and is ideal for when you're hot, sweaty, and thirsty. Get the Porn Star Martini recipe. Advertisement - Continue Reading Below 3Vesper Martini PHOTO: RACHEL VANNI; FOOD STYLING: BROOKE CAISON Named for Vesper Lynd, James Bond’s love interest in the 1953 novel Casino Royale, this infamously shaken and not stirred cocktail is a three-ingredient heavy hitter and the perfect pairing for a steak dinner. Get the Vesper Martini recipe. 4Lemon Meringue Pie Martinis PHOTO: RACHEL VANNI; FOOD STYLING: BARRETT WASHBURNE Advertisement - Continue Reading Below 5Frozen Hot Chocolate Martini PHOTO: LUCY SCHAEFFER; FOOD STYLING: MAKINZE GORE Baileys and a little vodka turn a frozen hot chocolate into a party-worthy cocktail. Because it uses hot chocolate mix, it comes together fast too. It would definitely be a hit around the winter holidays, but since it’s frozen, we see no reason you can’t make it all summer long too. Get the Frozen Hot Chocolate Martini recipe. 6Dragon Fruit Drop Martini PHOTO: RYAN LIEBE; FOOD STYLING: BARRETT WASHBURNE When life gives you lemons, make a lemon drop, but if you want to make a lemon drop even more delicious, add dragon fruit. The tropical fruit, also known as pitaya, offers a delicate sweetness and a vibrant pink hue that adds a colorful complement to the iconic citrus cocktail. Get the Dragon Fruit Drop Martini recipe. Advertisement - Continue Reading Below 7Chocolate Martini We love topping ours with shaved chocolate or a pinch of cocoa powder, but feel free to get creative on the garnishes! Try adding a strawberry or a spring of mint, or even adding crushed Oreos to the rim. Get the Chocolate Martini recipe. 8Tomato Tini PHOTO: JOSEPH DE LEO; FOOD STYLING: BROOKE CAISON Instead of olive brine, this martini gets its rich flavor and vibrant color from tomatoes. If you’re skeptical, hear us out: Think of this cocktail as a cleaner, crisper version of a Bloody Mary. Get the Tomato Tini recipe. Advertisement - Continue Reading Below 9Frozen Espresso Martini PHOTO: BRYAN GARDNER; FOOD STYLING: MAKINZE GORE 10Classic Vodka Martini Emily Hlavac Green Before you start, make sure your vodka and vermouth are quality—since they make up the drink, the cheap stuff just won't do. Whether you go shaken or stirred, you'll feel on top of the world after your first sip. Get the Classic Vodka Martini recipe. Advertisement - Continue Reading Below 11Drunken Peanut Butter Cups Parker Feierbach These martinis use Reese's Pieces to infuse the vodka so that they taste just like your favorite peanut butter cup. This takes a chocolate martini to a whole new level. The Reese's and peanut butter rim isn't technically necessary, but it makes these extra delightful. Get the Drunken Peanut Butter Cups recipe. 12Appletini Delish Advertisement - Continue Reading Below 13Dalgona Martini Andrew Bui Dalgona, or whipped coffee, is now the coolest thing to top all of your drinks with. Try it on top of this simple Baileys martini for an instant trendy pick me up. Get the Dalgona Martini recipe. 14Pomegranate Martini PHOTO: LUCY SCHAEFFER PHOTOGRAPHY; FOOD STYLING: ERIKA JOYCE More like a cosmopolitan than a classic martini, this recipe replaces the cosmo’s traditional cranberry juice with pomegranate. Garnish with a sugar rim and a fresh rosemary sprig for the perfect drink to serve at all your winter gatherings. Get the Pomegranate Martini recipe. Advertisement - Continue Reading Below 15Porn Star Mock-tini PHOTO: RYAN LIEBE; FOOD STYLING: MAKINZE GORE 16Crème Brûlée Martini Parker feierbach These martinis taste just like a crème brûlée with very little effort. Be sure to keep the caramel in the freezer until you are ready to serve. The caramel will eventually melt into your drink making it extra indulgent. Get the Crème Brûlée Martini recipe. Advertisement - Continue Reading Below 17Cottontail-Tini PHOTO: RACHEL VANNI; FOOD STYLING: BROOKE CAISON We're all about the nostalgic whimsy of incorporating a childhood candy favorite into a cocktail. The cotton candy is not only a garnish, but an interactive element to the drink—you can watch the candy dissolve into your glass and sweeten the cocktail after dropping it into your drink. Get the Cottontail-Tini recipe. 18Espresso Martini Erik bernstein Curious how to achieve this impressive garnish? Cover half the glass with a napkin or paper towel then dust the rest with either cocoa or espresso powder. Top the other side with coffee beans and voila! You have a drink that's not only delicious but also looks stunning. Get the Espresso Martini recipe. Advertisement - Continue Reading Below 19Sugar Cookie Martinis PHOTO: LINDA PUGLIESE; FOOD STYLING: SAM SENEVIRATNE 20Peeptini PHOTO: ERIK BERNSTEIN; FOOD STYLING: SPENCER RICHARDS Advertisement - Continue Reading Below Readers Also Read Advertisement - Continue Reading Below Advertisement - Continue Reading Below"
}