{
  "url": "https://www.microsoft.com/en-us/microsoft-365-copilot",
  "title": "Microsoft 365 Copilot | AI Productivity Tools for Work",
  "text": "Microsoft 365 Copilot Microsoft 365 Copilot, powered by Work IQ Work IQ is the unique intelligence layer behind Microsoft 365 Copilot and agents that helps Copilot know you, your job and your company—connecting individual and organizational knowledge to deliver intelligence built just for you and the flow of your work. Data Work IQ starts with your work data—all the rich knowledge in your emails, files, meetings, and chats—capturing how work gets done across your organization. Memory It builds memory from your unique style, preferences, habits, and workflows, understanding not just your org chart but your work chart. Inference By combining data and memory, Work IQ uses inference to make valuable connections, unlock insights, and predict next steps to deliver tailored experiences. Chat Supercharge productivity, streamline tasks, and uncover insights in seconds with secure AI chat powered by Work IQ. It works across Microsoft apps and gives everyone access to agents—all in the flow of work. Search Describe what you’re looking for—as a question, phrase, or command—and find it fast with AI-powered enterprise search. With Work IQ, it goes beyond keywords to surface the right results from your work content and apps. Agents Notebooks Bring together your Copilot chats, files, meeting notes, and project materials—then build on it. Copilot Notebooks helps you organize and analyze your content, and even create something new from it. You can also get AI-generated podcast-style summaries of your content to help you quickly catch up. Create Quickly turn your ideas into designed content, videos, podcasts, or surveys—or edit what you already have. Get started easily with a prompt, a template, or your company brand kit. What’s new Microsoft 365 Copilot keeps getting better. See what just dropped and discover fresh updates built to support your day-to-day and big-picture plans. Learn how Microsoft 365 Copilot and agents are transforming work Discover how Microsoft 365 Copilot and AI-powered agents are transforming work—enabling human-led, agent-operated teams to lead, automate, and scale. Researcher Researcher is a first-of-its-kind reasoning agent for complex, multistep research at work—pulling from work and web data to deliver structured insights and reports. GPT-5 in Microsoft 365 Copilot GPT-5 is now available in Microsoft 365 Copilot and Copilot Studio. GPT-5 is a significant leap in intelligence and becomes even more powerful when applied to work. Secure by design Copilot is built on a comprehensive approach to enterprise-grade security and responsible AI—so you can move faster without compromising the safeguards your business depends on. Built-in data privacy You own your data—and we help keep it that way. Prompts, inputs, and responses are never used to train the models. Governed access Copilot inherits your Microsoft 365 permissions, sensitivity labels, and retention policies—so people only see what they’re meant to. Control at every level Stay confident in how Copilot and agents are used. With the Copilot Control System, your IT has the oversight to manage them across your org. Trusted by industry leaders Get started with Microsoft 365 Copilot Add Copilot to your Microsoft 365 plan, get both together if you’re new, or try Copilot Chat today."
}