{
  "url": "https://www.imdb.com/title/tt14923260/",
  "title": "Chupa (2023) - IMDb",
  "text": "IMDb RATING 5.6/10 8.1K YOUR RATING While visiting family in Mexico, teenage Alex gains an unlikely companion when he discovers a young chupacabra hiding in his grandpa's shed. To save the mythical creature, Alex and his cousi... Read allWhile visiting family in Mexico, teenage Alex gains an unlikely companion when he discovers a young chupacabra hiding in his grandpa's shed. To save the mythical creature, Alex and his cousins must embark on the adventure of a lifetime.While visiting family in Mexico, teenage Alex gains an unlikely companion when he discovers a young chupacabra hiding in his grandpa's shed. To save the mythical creature, Alex and his cousins must embark on the adventure of a lifetime. - Awards - 1 win & 1 nomination total Cheyenne Anderson - Bully - (uncredited) Featured reviews Relax with the hate. 5.6 is too little for this movie. It is a family movie, nothing more, and it is a funny and motivational one. The CGI Chupacabras is nice, I dare to say since Falkor from \"The NeverEnding Story\" (1984) and Gizmo from \"Gremlins\" (1984) a furry creature wasn't so sympathetic and warmth. It would be a nice pet, expensive to feed but nice. Hope all people out there watch the movie with their kids, remember their roots and their late fathers. Don't be grumpy, smile for a change and understand that Chupa is not a Academy Award or Festival movie, because is not pretentious like \"Shazam: Fury of Gods\", Chupa is simple and that's why it is enjoyable, though. The CGI Chupacabras is nice, I dare to say since Falkor from \"The NeverEnding Story\" (1984) and Gizmo from \"Gremlins\" (1984) a furry creature wasn't so sympathetic and warmth. It would be a nice pet, expensive to feed but nice. Hope all people out there watch the movie with their kids, remember their roots and their late fathers. Don't be grumpy, smile for a change and understand that Chupa is not a Academy Award or Festival movie, because is not pretentious like \"Shazam: Fury of Gods\", Chupa is simple and that's why it is enjoyable, though. As a child from the 70s and 80s, this movie brought me back there. This movie reminded me of what kids movies should be. No agenda. No politics. Just fun. This movie reminded me of what watching movies as a kid was like and should be like. I watched this movie with my 11 year old daughter and she has never watched a movie with me since she was born. However, to night, we watched this together. Just us and we laughed together. Not only did this movie remind me of the lost innocence of a culture, it reminded me of the importance of just enjoying something with your kid. Is this movie great? No. Is it worth it? Absolutely. It's written like it came from a kid from the 80's and I appreciate it very much. Thank you and I mean that. It is almost impossible not to like the teeth-full creature named Chupa. Irresistible cuteness, talks and acts like the most sought-after children's toy. Incredibly creative CGIs bring up the emotions of the cuddly creature at the forefront and establish a believable real bond between the children and the creature. The director Jonas Quaron also co-written \"Gravity\" another CGI masterpiece, with his father Alfonso Quaron. And there's no doubt that the same creative genius played the role in developing the character of Chupa. Alex (Evan Whitten) was sent by his mother to visit his paternal grandfather (Demian Bichir). Alex feels alone ever since the loss of his father and immediately connects to the creature who is also young and lost his parents. It is a great children's story. It's also great for adults who like children's stories. The director Jonas Quaron also co-written \"Gravity\" another CGI masterpiece, with his father Alfonso Quaron. And there's no doubt that the same creative genius played the role in developing the character of Chupa. Alex (Evan Whitten) was sent by his mother to visit his paternal grandfather (Demian Bichir). Alex feels alone ever since the loss of his father and immediately connects to the creature who is also young and lost his parents. It is a great children's story. It's also great for adults who like children's stories. Very apt message and very well communicated by the director and screenplay. VFX could be better.the film connect with the audience very smoothly and story carry forward in a smooth fashion. Acting of every character and specially child artists are very good and flows with the story.build up of story and ending could be more elaborative but this can not be the fact which can negate it positive points.one should watch it with family and kids to generate a sense of culture, imp of joint family, conservation of endangered animals, compassion towards animals and importance of always attached to our roots. What a nice film Chupa was. The design of the creature himself was nice and I liked how it was done. This movie is about a boy named alex, played by evan whitten. He is sent by his mother to mexico to be with grandfather and cousins. Demian bichir was good here and I enjoyed him in the nun as well. So it was nice seeing him in more of a family film and had so charm to him to. Christian slater is the hunter quinn but we dont really see a lot. More to the story it was nice watching the journey and it was just cute. Overall chupa was a nice family movie with a good cast but also it had real heart and shows how a simple movie can sometimes be more enjoyable than a loud hollywood one. Did you know - TriviaThe announcement of the name was met with some criticism due to the word \"chupa\" being a slang term for fellatio in Spanish and Filipino. - GoofsThere is no way that Number plate of the car of Granddad Chava coming out on colliding with mom of Chupa. All four holes were intact, there were not torn or cracked or anything for the 4 bolts to get loose. There is no way of an animal colliding to the car from the front that will put enough force at correct places to make a properly secured number plate come unstuck. The director/ scriptwriter couldn't think of some plausible method of making Quinn come to know about Chava and his location. - ConnectionsReferenced in Film Junk Podcast: Episode 892: Air (2023) - SoundtracksBidi Bidi Bom Bom Written by Selena (as Selena Quintanilla) and Pete Astudillo Performed by Selena Courtesy of Capitol Latin under license from Universal Music Enterprises - How long is Chupa?Powered by Alexa Details - Runtime - 1h 35m(95 min) - Color - Sound mix - Aspect ratio - 2.0 : 1 Contribute to this page Suggest an edit or add missing content"
}