{
  "url": "https://www.polet.network/publications/preprints/vetier2024",
  "title": "Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe — POLET",
  "text": "Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe Vetier, M., Pavlenko, A., Jewell, J., Cherp, A. and V. Vinichenko (pre-print). Do policy targets change technology growth trajectories? Understanding the steady growth of onshore wind in Europe. POLET Working Paper series 2024-3 ABSTRACT Conflicts surrounding the expansion of wind power in Europe are increasing (Diógenes et al. 2020; Lundheim et al. 2022) which has hindered its growth in recent years (Pavlenko and Cherp 2023). However, in the near future, wind power needs to expand much more rapidly to meet the EU's climate and energy security goals (Vinichenko et al. 2023; Pavlenko and Cherp 2023). In fact, meeting the goals for renewable power of the Fit for 55 Package (EC 2021), REPowerEU (EC 2022d) and updated Renewable Energy Directive (EC 2023e) would require faster growth of onshore wind power across the EU compared to what has been observed not only in the EU but even in most individual countries (Vinichenko et al. 2023). In this paper, we seek to understand whether and how European countries plan to re-accelerate the recently stalling onshore wind power deployment considering the increasing conflicts surrounding this technology. We start with analyzing the current and historical growth patterns and maximum growth rates of onshore wind power in European countries and compare these to a similar analysis completed in 2021 (Cherp et al. 2021). We show that in most European countries (except Finland, Greece, the Netherlands, and Sweden), the growth of wind power is no longer accelerating or is even slowing down. Subsequently, we look into 17 countries’ recently updated National Energy and Climate Plans to identify their national targets for onshore wind power deployment and analyze whether and how these targets would change the historical growth trajectories. We find that eleven countries have set national targets to accelerate the historical growth of wind power, and five countries aim for growth that is faster than ever observed globally. This demonstrates the challenges for policies to overcome the inertia of socio-technical systems surrounding the deployment of wind power. To investigate whether and how such challenges were addressed historically, the paper reviews cases of re-acceleration of onshore wind power growth in the past. We identify five notable cases of past re-acceleration (Austria, Denmark, Poland, Portugal, and Spain) and show that these have mostly been due to major changes in the national policy environment. We find that historically stalling was induced by halting or significantly reducing subsidies, regulatory uncertainties, and the enaction of policies unfavorable to wind power growth, and re-acceleration was in most cases linked to the increasing of regulatory certainty, re-establishment or increasing of subsidies, and withdrawal of unfavorable policies. This is unlikely to guide the current situation. We then investigate policies proposed by the European Commission and find that these aim to address administrative, technical, and financial problems rather than social conflicts over land and other issues. Finally, we provide a detailed analysis of Sweden’s case of attempting but failing to overcome a recurring onshore wind siting deadlock. We conclude by pointing out that to meet the onshore wind targets, European countries will likely need to implement different policy measures than what they have applied in the past."
}