{
  "url": "https://forum.jami.net/t/mode-demploi-jami/481",
  "title": "Mode d'emploi jami - Support en français (French) - Jami Forum",
  "text": "Firenze 2 Bonjour, Pourquoi faire de ce fil de discussion une suite qui risque de faire doublon ? Pourquoi pas plutôt proposer la rédaction collaborative d’un VRAI mode d’emploi francophone de Jami ? On pourrait par exemple utiliser framapad pour en faire un ensemble et attirer l’attention de l’équipe de Jami dessus. Le résultat pourrait éventuellement être publié dans la rubrique dédiée du GitLab de Jami https://git.jami.net/savoirfairelinux/ring-project/-/wikis/user-manual après l’approbation de l’équipe. Il y aurait un projet par subdivision du mode d’emploi, par exemple pour l’introduction, un fichier qui s’appelle Introduction_FR pour https://git.jami.net/savoirfairelinux/ring-project/-/wikis/user-manual/introduction. Il serait même souhaitable d’ajouter pour le même endroit un fichier-tutoriel pour l’installation et la mise à jour de Jami pour chaque plateforme supportée, voire chaque distribution GNU/Linux, que ce soit par l’interface graphique ou la ligne de commande. (Ça mériterait peut-être un rubrique dédiée “setup and update Jami”/ “Installer et mettre à jour Jami”) Un fichier creer_un_compte_jami_gnu_linux_FR pour https://git.jami.net/savoirfairelinux/ring-project/-/wikis/user-manual/create-jami-account. Et ainsi de suite pour - Use your existant Jami account / Utiliser votre compte Jami existant - Configure your SIP account / Configurer votre compte SIP - Manage your contacts / Gérer vos contacts - Establish communications / Communiquer avec Jami pour expliquer comment utiliser le clavardage et lancer des appels audio et vidéo, en duo ou vers un point de rendez-vous. - Jami account configuration / Configuration du compte Jami Là, il faudrait peut-être ajouter une rubrique pour chaque partie configurable de Jami comme “Media configuration”/“Configuration des périphériques”, \" General configuration\" / \" Configuration générale\", “Configurer les extensions” / “Set up plug-in” Avec ce qu’on a pu écrire dans le forum, on peut déjà se baser sur quelque chose pour rédiger une documentation de Jami par et pour les utilisateurs. L’équipe pourrait éventuellement décider par la suite une mise en forme graphique à la façon de Melissa Riou. Tu as raison, ce n’est pas efficient. Très bonne idée, à concrétiser ! en espérant que nous ne resterons pas seuls sur ce coup là. Si tu es prêt à piloter ce projet je suis partant. Cela représente une belle somme d’heures de travail, il faudrait je pense, nous assurer au préalable que nous ne ferons pas tout cela en doublon avec un même projet qui serait en cours chez savoir faire linux. Oui nous avons la matière. Merci @Christophe, @kristof, @sblin, @aberaud de nous dire ce que vous en pensez ? kristof 4 Si savoir faire linux ne prévoit rien de son côté et nous donne l’aval : effectivement c’est une bonne idée Bonjour @sblin et à tous Est ce techniquement difficile d’intégrer une aide à l’interface du client jami ? Ou l’idée est-elle de rendre le client jami autonome et si intuitif qu’il ne nécessiterait aucuns réglages par l’utilisateur ? Ce qui n’est pas actuellement le cas et nous avouons qu’en simple utilisateurs nous ne savons pas quel réglage choisir parmi ceux proposés sur l’interface du client jami, par exemple: - quels codecs activer ou désactiver ? - tout activer, et le logiciel jami choisira à chaque conversation ? Librement sblin 6 L’interface doit être intuitive. quels codecs activer ou désactiver ? Ma question c’est pour quelle raison l’utilisateur voudrait seulement toucher à ces paramètres. Pour 99% des personnes y a 0 intérêt à changer les paramètres par défaut qui sont dans les paramètres avancés. Les paramètres avancés sont choisis pour fonctionner le plus possible. Si l’utilisateur se demande “quels codecs activer ou désactiver ?”, alors c’est qu’il ne connaît pas la réponse et qu’il ne devrait pas y toucher. 1 Like Bonjour @sblin, merci pour la clarté de votre réponse. J’en déduis que le client jami est configuré par défaut pour fonctionner de manière optimale dans la plupart des cas d’utilisation. Les paramètres avancés ne concerne donc que les personnes expérimentées pour résoudre des conditions d’utilisation particulières. L’interface du client jami est effectivement intuitive pour la plupart des utilisateurs, cependant, ces tuto https://git.jami.net/savoirfairelinux/ring-project/-/wikis/user-manual/create-jami-account nous ont été très utiles pour quelques personnes que nous avons réussies à convaincre d’utiliser jami. C’est de là que nous est venue l’idée d’une aide intégrée pour inviter et inciter des personnes habitués à des “logiciels propriétaires de grande consommation sur serveur centralisé” qui “marche tout seul sans se poser de question”, à se poser les bonnes questions et trouver des réponses pertinentes et percutantes à : \" jami fonctionne moins bien que …\" En mettant à la portée de chaque utilisateur une information accessible à partir de l’interface client jami , cela permettrais de contrer les objections et diffuser et promouvoir jami dans ce qu’il a d’unique. Comme le font très bien les articles du blog, par exemple https://jami.net/the-jami-quirks/, mais que 99% des personnes de notre entourage qui ont installé jami n’ont pas lu. Bonjour les jamis de la jamisphère Nouvelle interface jami 202105121533, bien plus intuitive, plus claire, belle esthétique MERCI aux jamis développeurs @sblin @aberaud et à tous les contributeurs"
}