{
  "url": "https://secure.runescape.com/m=news/the-roadmap-that-changes-runescape-forever",
  "title": "The Roadmap That Changes RuneScape Forever - News - RuneScape - RuneScape",
  "text": "Welcome to our biggest RuneScape Ahead ever, and the start of a bold new era for RuneScape. As we celebrate RuneScapes 25th anniversary, this moment isnt just about reflecting on how far weve come, its about looking ahead. RuneScape has always evolved alongside its players, and what were sharing today marks a defining step in that journey. Were unveiling our roadmap for the entirety of 2026, along with a brand-new identity for RuneScape, one that honours our heritage while embracing our ambition for the years to come. This new chapter is a symbol of renewal and growth, and of our commitment to delivering meaningful experiences and lasting value in everything we create. This anniversary year represents more than a milestone; its a turning pointone that sets RuneScape firmly on course for the future it deserves. And as we continue to evolve across the studio and our games, we do so with a clear purpose: to deliver brilliant content, incredible value, and experiences that are worthy of your time and trust. Check in below to explore everything we have planned for 2026, including our new dedicated integrity roadmap. The Road to Restoration Lets dive right into it with our new integrity roadmap, aptly named The Road to Restoration, a dedicated track of integrity-focused releases running alongside our main 2026 Content Roadmap. With an incredible year ahead, were excited to finally share whats coming throughout 2026 as we give the core RuneScape experience the care and attention it deserves, strengthening its foundations for every player, now and for years to come. Through these updates, well be tackling long-standing challenges like Dailyscape pressure, early- and mid-game skilling balance, visual identity, and much more. But before we dive into that lets not forget the other tiny little thing happening today. Treasure Hunter is no more. By the time youre reading this, Treasure Hunter will be removed from RuneScape, and hundreds of gameplay-impacting MTX items will no longer be available for sale. Ending the sale of these items is the first step toward our long-term ambition: removing their presence from the game entirely. Over the course of 2026, players will have the opportunity to use up any existing stockpiles, with additional chances later in the year to clear out anything that remains, before these items are ultimately made obsolete. On top of that, were excited to kick off the Road to Restoration with three brand-new releases going live today. UI Update - A New Look Starting with the UI, as we unveil a fresh look... This update delivers a familiar UI experience that keeps all the functionality you need, while introducing a cleaner, more classic, and refreshed look throughout. As part of that new visual identity, were restoring the stone UI icons and are reintroducing the circular minimap, a small but meaningful nod to the RuneScape many of us grew up with. Weve also improved the default layout to make it a stronger, more versatile option that works no matter where you are on your RuneScape journey. And this is just the beginning! This update marks the first step in a series of iterative UI improvements, with many more enhancements to come as we continue working closely with all of you to take it even further. Visual Update - Cosmetic Toggle(s) Speaking of visuals, another new introduction is the ability to toggle Cosmetic visuals! This will let you selectively hide other players' worn customisations and their animation customisations, at your discretion. Not a fan of wings...? hide them! Or perhaps you prefer to see what other people are actually wearing... no problem either. All these cosmetic toggles will be released in today's update. And later this year, we'll give you even more toggle options, including hiding other players' summoning familiar customisations. Visual Update - Misthalin & Asgarnia Facelift Last for today, but definitely not least: Our third release is a world update for Gielinor, focusing on iconic free-to-play areas like Lumbridge, Draynor, Varrock, and beyond. These locations have been brought up to the visual standard were establishing across the game, with even more updates planned later this year. And in what might be one of the weirdest patch notes weve ever written, weve also updated every Normal, Oak, and Willow tree across the entire game! Bringing them to a stronger, more consistent visual standard that better ties the world together. Dive right in today to take a look for yourself! Next steps on the road. Continuing along the Road to Restoration, well be rolling out further changes and updates throughout the year, including: Game Update - Free Runemetrics The in-game RuneMetrics functionality will become completely free for all paid members (including Bond users) later this Spring. This is part of a wider effort to make tooling more accessible and genuinely useful. Furthermore, we are no longer offering the purchase of RuneMetrics Pro subscriptions from today and have wider plans to decommission the RuneMetrics Pro website feature entirely this later year. Existing Pro subscribers will have additional time to download any data stored on the web. We will share more information about this in the coming month, including information for players with existing longer RuneMetrics Pro subscriptions - if you do currently use RuneMetrics Pro, keep an eye on your emails for further information. These updates mark the start of the Road to Restoration and set the stage for a year of rebuilding and strengthening RuneScapes core experience. Combat Update - Combat Style Moderisation In February well be launching our Combat Modernisation update. We'll be taking the three original combat styles and bringing them into the modern age. This update focuses on making combat more intuitive and easier to learn through experiential gameplay, with streamlined ability lists that are gradually introduced as you progress through the levels, alongside simpler yet deeper synergies between abilities. Melee, Ranged and Magic have long suffered from dated designs and general inconsistencies. Especially in the early game, this results in a confusing and contradictory experience, ultimately resulting in unnecessary friction during early game combat. The planned update takes learnings from previous combat updates such as Necromancy, and 2023's Combat update to modernise the styles, and to provide a clean foundation. This will make the systems easier to introduce new players to, without compromising the experience for endgame players. Below is an overarching changelist - More specific patch notes will be released alongside the update in February. - Removal or rework of unnecessary, bloated abilities - Over time, additional abilities have been added to the original styles' kits that, in hindsight, did not add additional gameplay or nuance to the style. As a result, these have been removed or reworked. - Removal of Thresholds - Thresholds are a dated concept from EoC, leading to situations where abilities often compete with one another due to their similar costs. Removing Thresholds allows for nuanced abilities with variable costs, leading to more dynamic gameplay. - Introduction of a 'basic attack' - Basic attacks are core to RuneScape's identity: Fundamentally, RuneScape has always had them through our original point and click gameplay. When we introduced an action bar based system with the Evolution of Combat, auto attacks were moved to the background of combat. Utilizing learnings from Necromancy, we're reintroducing basic attacks to the three core styles, though modernised for action bar based gameplay. - Redistributing ability unlocks by level - Abilities for Melee, Ranged and Magic will be redistributed to better introduce players to each style over time. With the reduction of abilities and introduction of a basic attack, each ability can be made meaningful and deliberate in where it is unlocked; serving as a way to progress the player's journey. - Removal of lesser abilities - Lesser abilities have always served as a point of friction for new players. Given where they're positioned, they were often worse than using an 'auto attack', and were oftentimes worse than using Slice, Piercing Shot or Wrack, yet visually they appeared to be more interesting. With the introduction of basic attacks and the redistribution of level unlocks, lesser abilities are redundant and will be removed. - Visual clean up - animation reworks, vfx and projectile updates - Melee, Ranged and Magic suffer from various visual inconsistencies. From abilities sharing the same animation (looking at you wrack), to clipping, or jagged animations. We're taking this time to modernise each ability visually; whether that's through remastering the original animation using modern technologies, reworking the visual effects to remove duplicate animations, or adding additional VFX to ensure abilities feel satisfying to use. - Normalising ammo consumption - There's a large disparity between ammo consumption for both Ranged and Magic from the early game to the endgame. In the early game, minimal ammo is consumed, leading to confusion of when it should be consumed. This is then flipped in end-game, where many thousands are consumed per hour. This consumption will be normalised, resulting in a consistent experience across the board. - Tutorialization of abilities - Currently, when abilities are unlocked, they're directly added to your action bar. This is easy to miss and does not offer guidance on what the ability does. By adding Necromancy-style UI tutorials and preventing it from being auto-added to your action bar, we aim to better explain these abilities and guide early game players within their combat journey. - Increasing Attack, Strength, Ranged & Magic to 120 - Each of the original combat style skills will be brought up to 120 to keep parity with Necromancy. - Removal of specific auras - We understand that auras timebox you into engaging in certain combat content in 1 hour increments. Alongside the skill cap increase for the core styles, we're removing Berserker, Reckless, Maniacal and Mahjarrat auras to prevent overall power creep, while reducing the reliance on auras to complete content efficiently. - Solid food rebalance - Solid food within RuneScape has always been in a bit of an odd spot. In the early game, its adrenaline cost negates any generated adrenaline through basic attacks, leading to situations where you can't gain adrenaline. In the end game on the other hand, reliance on Soul Split avoids this. To prevent solid food being a 'noob trap' in the early game, solid food has had its adrenaline cost reduced. Additionally, in the early game, food scales with your Constitution (hitpoints) level. This creates some unnecessary confusion, whereby you're punished for having a lower level. This has been removed in favour of healing static amounts. - Default action bar changes - With the introduction and subsequent removal of redundant abilities, the automatically generated action bars have become notably out of date. These have been updated to better take into account the reduced ability count, and optimised to be revolution friendly. Balance Update - New Beginnings Continuing into February, our focus shifts to the early-game experience with the first of many rebalancing updates. Well be tackling unnecessary friction in those early levels by addressing root issues like shrimp catch rates, pickpocket stun chances, drop tables, and much more. Our goal is for skilling to feel simple, rewarding, and engaging, encouraging players to progress naturally into the deeper systems these skills have to offer as they become more invested. We'll follow this with a similar update for the mid-game in Summer, and an update focused on the late-game in Autumn. Game Update - Life After Dailies RuneScape shines when players log in because they want to, not because they feel they have to. Dailyscape is fundamentally at odds with what makes RuneScape feel like RuneScape. In this update, we'll be taking a holistic look at all Dailyscape systems - from shop stocks, to vis wax, to D&Ds and even, yes, those hourly Wildy Events. We want RuneScape to be a game you enjoy playing for what it is, when you feel like it, and without a checklist of chores to complete. Game Update - Aura Overhaul Auras create a time pressure and a feeling of complexity with extra things you feel like you should consider in your setup before you start the task at hand. That's why, this spring, we intend to fully remove all Auras. No more Aura Refreshes, no more limited peak efficiency - just a more enjoyable gameplay loop. Meanwhile we will investigate if those benefits can be moved to be part of the core game experience. Game Update - GE Improvements The Grand Exchange will also get some love as we set out to address your most desired features and improvements. We're going to improve things like how items update their price, item buy limits and more. As we kick off development on this we want to hear from you with what changes and improvements youd like to see at the GE. Social Update - Squad Goals Later this year, as part of the wider Road to Restoration, well be delivering a dedicated update focused on improving RuneScapes social systems. While the full design is still taking shape, our aim is to strengthen the overall social experience through improvements to areas like chat range, broadcasts for collection log drops (and similar), and some clan-centric features that will make socialising in RuneScape feel more connected and impactful. Game Update - API Plugin Support For many years, youve asked for plugins in RuneScape similar to those in Old School. Plugins empower the community to create tools, features, and functionality that enable unique experiences and give players greater control over how they interact with the game, something youve long told us could help RuneScape truly thrive. As a result, were investing in a dedicated new development team with a single mission - to bring plugin support to the RuneScape client before the end of 2026. To do this right, were designing the very foundations of the system to empower talented community developers to do their best work. If youre one of these developers, please do visit the dedicated API channel in our Discord.gg/RS Server, where we will begin to build an API community in months ahead. Visual Update - Noise Control & Clean Up As the year progresses, well continue unifying the visual identity of Gielinor. This means decluttering content that hasnt stood the test of 25 years, while steadily bringing the world up to the cohesive, modern standard weve been building since 2020. That includes the Player Avatar Refresh, which you can read more about below! The Road Ahead The Road to Restoration is just the beginning, our first look at the core initiatives that will give the fundamental RuneScape experience the care and attention it deserves this year. This roadmap will continue to evolve with your feedback and will be shaped by your voices, your ideas, and what you think should come next. This is only the start, theres so much more coming in 2026, and we cant wait for you to experience it all! HavenHythe Part One What Is Havenhythe? Havenhythe is RuneScape's biggest area expansion to date. It's a massive stretch of land to the East of Morytania, filled with villages, stories, people, adventures and encounters... like a massive blood-thirsty hedgehog...? We'll get back to you on that one. Once the home to a first-age civilisation, it's a landmass that's packed with lots of rich, layered history. In the First Age, Havenhythe was the home to a magical nexus, the birthplace of the Colossi. And a long-dormant gateway to Vampyrium itself... which is nothing to worry about. It feels like a land full of life. A grounded and organic region populated with stories, oddities, and those small, familiar RuneScape moments. But, as you venture further beyond the village of Wendlewick, things start to change. The forests thin, the air will grow colder, and as we expand Havenhythe throughout the year, youll begin to feel that pull towards the east, where the region becomes more treacherous and vampiric. Nothing Strange Happens Here. Probably. Like the beginning of many a great story, you meet a stranger in a tavern and have a questionable drink with them before ending up on a boat, sailing towards a land that doesn't want to stay hidden anymore. Typical Tuesday afternoon for an adventurer. Once you land in Havenhythe you'll hear of strange rumours spreading through Wendlewick... rumours of a pale-skinned woman... long pointy ears... silver hair... sharp canines... red, hungry eyes.. the usual fare. Alongside these main story quests there will be standalone quests that are fun little local stories intended to go beyond the core storyline and help familiarise yourselves with locals and their customs. Small-town stuff... neighbours, chores, and the odd crab problem. The local wildlife is friendly Ok but what was that about a Dreadhog? Silverquill, the Sanguine Hedgehog, is one of our two brand-new early-game combat bosses that will be available with the launch of Havenhythe Part One. Shell teach you more about reading your opponent and responding to telegraphed attacks. If you can best this hog, you might just walk away with a handful of the silver spikes shes carrying. Those could prove rather useful later on in your Havenhythe journey especially given the Vampyres and all. If you make it through that, your next challenge awaits: Ivar, the King of Bones, a massive hill giant with a generously average IQ. This not so gentle giant will help you learn a little more about mastering your defensive prayers and may drop one of his signature clubs! With these two early-game bosses, our goal is to bring bossing back to its roots, easing new and returning players into combat, preparing them for what lies ahead, and helping close the gap between early and end-game bossing. And for the completionists among you, therell still be plenty to chase, with unique drops, pets, and titles to unlock. Alongside these new combat bosses, we'll also be introducing a new, but not so native early-game slayer creature called the \"sanguine crawler\". Game update - Hunter 110 The first part of Havenhythe brings an extension to the Hunter skill, raising it to level 110 with a new expansion of the Big Game Hunter system. This time, though, its not just about tracking, it's about surviving. Giant creatures will be hunting you, sniffing you out as you fight to gain the upper hand and bring them down. In return, youll earn valuable loot, the best Hunter XP in the game, and those all-important materials needed to craft the new level 8590 Ranged armour. Or if youre aiming even higher, the brand-new Masterwork Ranged Armour, with more details to come as we get closer to release. Beyond hunting giant creatures, Havenhythe also introduces new ways to train Hunter, such as Clockwork Trapping. Youll craft mechanical birdhouses, place them across Havenhythe with bait, and return later to collect your catch. These birdhouses are crafted using logs from the recent 110 Woodcutting update, ranging from the most basic logs all the way up to Eternal Magic logs with each tier forming the foundation of a stronger, more effective trap. And for those who prefer a more laid-back approach, Clockwork Box Traps are making their debut. Last year, we spoke about introducing new, integrity-focused training methods that feel rewarding and grounded without relying on MTX. Clockwork Box Traps are built around that philosophy: a fully craftable, efficient Hunter training method that becomes available early and remains useful as you level. Designed to be more relaxed and flexible, theyre the perfect activity to slot in between your hunts. Also Black Chinchompas. Enough said. Additionally youll also start spotting some new Jackalope creatures hopping around in Havenhythe Part One. Theyre a natural step up from rabbit snaring, smoothing out the early Hunter experience and making it more enjoyable for players just starting out. Game Update - Skilling in Havenhythe Alongside the many new Hunter skilling nodes, venturing beyond Wendlewick will reveal resources never before seen in Gielinor. Youll encounter Red Ivy, a slower-depleting tree perfect for relaxed Woodcutting, and Giant Crayfish for level 82 Fishing, alongside a host of familiar skilling nodes. Also being introduced is a new soil-sifting Archaeology familiar. As you explore Havenhythe, youll meet new faces, lend a hand where its needed, and earn achievements tied to the people and places you discover along the way. Havenhythe will continue to expand over the year, as we add more content to it. A new story quest later in the spring, A new first-age Archaeology dig site in the summer and a conclusion to Havenhythe's story with Part Two releasing towards the end of 2026, where you'll also meet the Ghrazi Blood Knights in a brand-new solo and duo combat boss encounter! This is a big moment for RuneScape and we want this to mark the next step in our new chapter. We can't wait to set sail for Havenhythe and make it a new home for you with the release of Part One. Player Avatar Yes, it's true - Player Avatar is off the shelf and on its way! For those of you who don't know, Player Avatar Refresh is a project we kicked off in 2021. Through lots of community consultancy and livestreams, we worked with you to develop a remastered visual look for your player avatar that feels true to your character as you know it today. After we discovered some technical limitations in 2022 it was placed on the shelf while we spent the past few years investing in technical upgrades that could help us make it possible. Now, we're ready to get this modern, grounded avatar into your hands over the course of multiple updates. Our first associated update will lay the foundations with a new base avatar, updated hairstyles and facial hair options, plus newly updated base clothes. We'll also be improving the quality of the chatheads including chathead animations. And we'll be looking for your feedback to help prioritise our future releases happening throughout the year. From which items or cosmetics we should update first, through to NPCs you'd like to see brought up to this standard. Look out for a survey this April to shape the future of the Player Avatar Refresh! Finally, we know that some of our modern outfits can feel a bit off at times, looking slightly too shiny, flat, or smooth in certain environments compared to the older, grainier textures. As part of the Road to Restoration later this year, well be rolling out rendering updates to begin addressing this. And as we move through 2026, well keep fine-tuning and improving the look and feel of your character until we get it just right. Game Update - Construction 120 & Player Owned House Later this summer, were bringing new life to the Player-Owned House. The Player-Owned House has been part of RuneScape since 2006, almost 20 years..! While the game has evolved significantly since then, the Player-Owned House has remained largely unchanged. This year, we want to change that and give Player-Owned Housing the attention it truly deserves. With this update, we want housing to feel connected to Gielinor once more, offering a space thats personal, welcoming, and worth returning to, whether it belongs to you or a friend. Youll gain a whole new level of control over your home, with expanded options to personalise, design, and refine the details. And we'll be giving Construction a skill increase to 120 too for good measure. Were introducing a new recipe system that lets you unlock and build furniture inspired by your past, present, and future adventures. Imagine defeating a boss and proudly displaying a trophy from that battle in your own home. Or completing a quest and earning a keepsake that preserves the memory of that journey. Through this new recipe system, our goal is simple: make your home a living reflection of the path youve taken, the memories youve made, and the victories youve earned. Part of this update is also about bringing back that social spark and the joy of showing off your home, inviting friends over and maybe even hosting the occasional house party Were still in early design at the moment, so we will be reaching out to hear what you would like to see from Player-Owned Housing in the coming weeks. Additional Updates In addition to everything weve talked about today, theres still plenty of other updates to come this year. In the spring, youll be able to jump into a brand-new standalone quest. It's a fluffy adventure and spiritual successor to Gertrudes Cat. Think Lady and the Tramp, meets Fort Forinthry. And in Autumn, we'll release another stand-alone quest. It's something a little different, but still true to our roots. We will also be bringing in remastered content updates at the end of spring, and again in autumn as we revisit some classic pieces of content. More on exactly what this involves and what content we'll remaster will be shared later this year. And of course, well have seasonal events throughout the year, with a focus on stronger game integrity, and quick ways to drop in, take part, and leave with a fancy reward. And don't forget RuneFest is back! Leagues II Leagues is back this Autumn! After the incredible response from all of you in our first-ever League, we're taking everything we've learned and pushing this even further with Leagues II. There's going to be new overpowered relics, new tasks and challenges, new rewards - all with a brand-new 'Leagues twist' that'll flip RuneScape on its head. We also heard your feedback from the CATALYST League, and with Leagues II, progression will be even faster as we want you jumping into the madness right away. We're talking more auto-completed quests, earlier access to combat relics, a smoother climb throughout the tiers and relics packing more power than before. But for now, just know - Leagues is back and once again you'll be rewriting the rules and bending RuneScape to your will. New Visual Identity As we celebrate RuneScapes 25th anniversary, and today's RuneScape Ahead, this marks more than a milestone. Alongside our roadmap plans for 2026, were also introducing a new visual identity for RuneScape, one that reflects where our game has come from, and where its heading next. This new identity is a symbol of renewal and growth, representing a renewed focus on strong game integrity, meaningful updates, and experiences that feel worth your time to return to. Think of this moment as a turning point, grounding us in what makes RuneScape special, and setting the game firmly on course for the future it deserves. This is the start of a new era, and we cant wait to build it together. That's another RuneScape Ahead under the belt! Throughout this year we will be reaching out to players to help us guide a lot of these projects forward via their feedback and were working hard to establish clear, approximate dates for each of these updates wherever possible. We hope todays announcements have you as excited about the future as we are. From setting foot on Havenhythe and uncovering its mysteries, to designing a new Player-Owned Home, seeing the Player Avatar Refresh make its debut, jumping into the next incarnation of Leagues, and experiencing a wide range of integrity updates through the Road to Restoration, 2026 is shaping up to be our most ambitious year yet. Thank you for being part of our community, heres to many more brilliant years ahead! - The RuneScape Team Mods Alex, Anvil, Azanna, Bak, Blkwitch, Boko, Brat, Breezy, Brig, Cajun, Camel, Colibri, Chaose, Dark, Daze, Desert, Dorn, Dragon, Drew, Drewid, Easty, Echo, Fallen, Forza, Fox, Frosch, Grace, Gunner, Helen, Hooli, Ink, Keyser, Kristy, Lucifer, Luma, Lunatear, Lykos, Lynx, Makkari, MIC, Morty, Muse, Nemo, Neong, Nixon, Noms, Pearce, Perpetua, Pickle, Pigeon, Rain, Ramen, Reaper, Rowley, Ryan, Samy, Sakura, Shiba, Shrew, Shrike, Skyefall, Socks, Soul, Sponge, Spyro, Stu, Sukotto, Taelae, Titus, Tri, Vegard, Volta, Who, Wov, Yuey & Zura"
}