{
  "url": "https://www.muchbetteradventures.com/magazine/best-levada-walks-madeira/",
  "title": "10 of the Best Levada Walks in Madeira",
  "text": "Madeira is an adventure paradise. Once considered the preserve of the 'newly wed or nearly dead', the Portuguese island has truly now bucked that stereotype - its forests, mountains and dramatic ridges and coastlines rightly giving the island a new image, as a raw, rugged, outdoor haven. There are more than 1,350 miles (1,170km) of levadas in Madeira - making them ideal walking trails. In terms of hiking, Madeira is well served. The island has an array of waymarked 'PR' hiking routes - including levada walks, which either bypass or follow a ‘levada’; an old stone irrigation system put in place to catch and re-route water - allowing crops to thrive. There are more than 1,350 miles (1,170km) of levadas in Madeira - making them ideal walking trails. These levada walks are spread all around Madeira. They can take you to waterfalls, to viewpoints out over cities, coast or mountains, or through the lush, legendary Laurissilva forests of Madeira - UNESCO-protected and home to primary laurel forest. No matter where they go, they tend to be exceptionally scenic - and they give the hiking network in Madeira a cultural twist. These are the 10 levada walks we have included on our list of the best: - The Caminho do Pinaculo e Folhadal (PR17) - Levada do Barreiro (PR4) - Levada dos Cedros (PR14) - Levada das 25 Fontes (PR6) - Levada Faja do Rodrigues (PR16) - Levada do Furado (PR10) - Levada do Rei (PR18) - Levado do Moinho (PR7) - Levada do Caldeirão Verde (PR9) - Levada do Pico do Castelo (PS PR3) Due to the old paths used on these routes - plus the tunnels used, and possibility of rock falls or adverse weather - these levada routes often open and close over the course of the year. Before heading out on any of these trails, be sure you not only have the appropriate equipment, navigational aids and supplies, but have also double checked that the levada walk you’re heading out to is actually open. Visit Madeira is a good place to check the opening status of any PR route. What is a Levada? Madeira's Ancient Irrigation system You may come across a couple of different styles of hiking trail in Madeira - most notably, levadas, veredas and PR routes. Here’s a quick guide to exactly what all of those mean. - Levada: Levadas are routes which follow man-made aqueducts built for irrigation purposes. They tend to be surrounded by lush greenery and they can pass through a variety of terrain. - Vereda: A ‘vereda’ is a more general term for path, so a hiking route with vereda in the title can be anything from a mountain path to a classic coastal path or forest route. - PR route: There are over 20 ‘pequena rutas’ or ‘short routes’ in Madeira, better known as PR routes. These are official routes, well kept and waymarked by the Regional Government of Madeira. Each PR route has a PR number. For example, PR1 will take you to Vereda do Pico do Areeiro, while PR21 will take you on the Caminho do Norther, from Encumeada to Riberia Grande. You can find all PR routes on the Visit Madeira website - which is also a great resource for checking the status of a route. Beyond levadas, we've also shared some of the best hikes in Madeira for those looking for more hiking goodness! The Best Levada Walks in Madeira: Mapped Here you can see the distribution of the best levada walks in Madeira, which are spread throughout the island. There is also one bonus walk included on the small island of Porto Santo, which is a 2hr 30 minute ferry ride from Madeira. The 10 Best Madeira Levada Walks 1. The Caminho do Pináculo e Folhadal (PR17) - Start/Finish: Lombo do Mouro/Encumeada - Distance: 9.3 miles (15 km), point to point. - Walking time: 6hr 30 mins - Difficulty: Challenging - Best for: A tough walk with dramatic scenery. This is one of the more challenging levada walks, but it's a beauty. Following Levada da Serra and Levada do Norte (and occasionally departing from both to walk along a stone trail), this route takes you through forest paths, where there is lush endemic flora and an plethora of waterfalls. You’ll walk through tunnels and old forests to the São Vicente Valley. From the high point of this trail, at 1,530m, you can see not only out over the valley of Ribeira Brava but to the two highest points of Madeira, Pico Ruivo (1,861m) and Pico do Areeiro (1,817m). 2. Levada do Barreiro (PR4) - Start/Finish: Poço da Neve/Casa do Barreiro - Distance: 3.2 miles (5.2km), point to point. - Walking time: 2hrs 10 minutes - Difficulty: Easy - Best for: City views from the wild. The sprawling city of Funchal can be viewed from the Levada do Barreiro hiking trail - which is short, fun and full of character. Along the route, you’ll come across Poço da Neve (the well of snow), a stone igloo built in 1813 used to store snow for use in hospitals and hotels. Past that, expect high-altitude flora on a trail which follows the levada to reach a high clearing where you can look out over the Ribeira de Santa Luzia, and indeed back down over to Funchal. From the final point of Casa do Barreiro (Barreiro’s House), the Parque Ecologico do Funchal is in front of you, and the beautiful little village of Monte is not far beyond on ER 101. Note that from the Poço da Neve starting point, this trail is almost entirely downhill. 3. Levada dos Cedros (PR14) - Start/Finish: ER 209 (Fanal)/ER 209 (Curral Falso) - Distance: 4.5 miles (7.2km), point to point. - Walking time: 3 hours - Difficulty: Moderate - Best for: Visiting a historic forest. There is such a thing as a ‘Rest and Quiet Reserve’ in Madeira - something which should definitely exist in every park, town and city - and this route will take you to one of them, in the Madeira Natural Park. This levada walk is one of ancient forests - some of which date back as long as human habitation of the island. The levada, of course, came a lot later, but it’s still one of the oldest irrigation systems to be found in Madeira. Constructed in the 17th century, the levada starts at 1,000m, in Lombo do Cedro. There are some beautiful bridges and viewpoints in amongst the UNESCO-protected Laurissilva forest. 4. Levada das 25 Fontes (PR6) - Start/Finish: Rabaçal (ER 150) - Distance: 5.3 miles (8.6km), out and back. - Walking time: 3-4hrs - Difficulty: Easy to moderate - Best for: An iconic Madeira levada walk. A ‘fonte’ is a fountain, water source or spring and this trail will take you to 25 of them. This is one of the most popular trails on Madeira, because it’s a comparatively easy hike with great rewards. Departing from ER 105 in Rabaçal, this route will take you through a landscape of fresh greenery, with far-reaching views of the Ribeira da Janela valley and again, that famous Laurissilva forest. The highlight is further on though. First (after a half-hour, out-and-back detour on the well-signposted PR6.1) you’ll reach Risco - the largest waterfall on Madeira. You’ll then follow the main route to the levada, and the atmospheric 25 Fontes Waterfall, which tumbles into a dreamy basin. Eat lunch here, then retrace your footsteps to the start point. 5. Levada Fajã do Rodrigues (PR16) - Start/Finish: Ginjas/Ribeira do Inferno - Distance: 4.8 miles (7.8km), round trip. - Walking time: 3hrs 30 minutes. - Difficulty: Easy to moderate - Best for: Unique footpaths, on the edge of the rock face. Starting in the municipality of São Vicente, this levada is also known as the Fajã da Ama. You’ll walk, on a mostly flat trail, from the Ribeira do Inferno on to a trail where dramatic, rocky tunnels are forged through the mountains, and panoramic views of the São Vicente valley wait beyond. The paths here are particularly interesting. Some segments of the route are narrow walkways which weave around huge rocky cliffs - and these are particularly spectacular. 6. Levada do Furado (PR10) - Start/Finish: ER 303 (Ribeiro Frio)/E.R. 102 (Portela) - Distance: 6.8 miles (11km), point to point. - Walking time: 5hrs - Difficulty: Moderate - Best for: Combining a levada walk with a famous viewpoint. This levada trail - which tracks one of the oldest levadas on the island of Madeira - is all about access to the Ribeiro Frio valley. You’ll find yourself creeping through forests and passing by farmlands, but the reason this is one of the best levada walks in Madeira is because when you get out into the open, you really are walking with far-reaching views out over the valley. The highlight is perhaps the well-known Portela viewpoint, from where rugged mountains jut up out of the rolling hills, and look to the coast stretching beyond, over a natural theatre of greenery. 7. Levada do Rei (PR18) - Start/Finish: São Jorge Wastewater Treatment Plant/Ribeiro Bonito - Distance: 6.6 miles (10.6km), round trip. - Walking time: 3hrs 30 minutes. - Difficulty: Moderate - Best for: Far-reaching, lush valley views. São Jorge is a parish in the municipality of Santana, notable for excellent coastal views to the north and, on to the south, the mountains of the interior range, which include the 1,592m Pico Canário. Half of the parish is covered by UNESCO-protected Laurissilva forest, and on this levada walk, you stroll through it - through tunnels formed by the vegetation and into the Ribeiro Bonito, a nature sanctuary which showcases all that rare greenery. Ribeiro Bonito is also considered to be one of the best places in Madeira for canyoning, so stick on a wetsuit and hire a guide for another great way to explore this landscape. 8. Levado do Moinho (PR7) - Start/Finish: Ribeira da Cruz (ER 101)/Junqueira - Distance: 6.5 miles (10.5km), point to point. - Walking time: 3hrs 30 minutes - Difficulty: Moderate - Best for: Tranquility. Also known as the Levada Grande, this levada used to supply several water mills, and the ruins of some of them still lie along the route - notably, the Achadas mill, the Cancelas mill and the Levada Grande mill. The mills were built by specific local communities, and the water use was exclusive to the builders at the time. This trail is relatively relaxing but does pass through some particularly wild forest with a mystical feel. It’s not often walked by tourists, so tends to be a lot calmer than other areas. It starts with a short climb and then is gently downhill for most of the rest. A waterfall tumbles into a basin near the end of the path. This can be extended with the Levada do Moinho to Levada Nova waterfall hike. 9. Levada do Caldeirão Verde (PR9) - Start/Finish: Queimadas Forest Park/Caldeirão do Inferno - Distance: 10.8 miles (17.4km), round trip. - Walking time: 6hrs 30 minutes - Difficulty: Moderate - Best for: Exploring the interior on a big day out. This is one of the longer walks on this list of the best levada hikes in Madeira, but arguably one of the most rewarding. Near the beginning of the route you can see the Casa de Abrigo das Queimadas, a triangular, traditional old house, now hidden in the Queimadas Forest Park. The terrace you'll come to is a beautiful lookout point, and through the Laurissilva forest, you'll reach the Caldeirão Verde lake and Caldeirão do Inferno, where a waterfall pours into a pool beneath a huge cliff. Bonus Walk #10: Levada do Pico do Castelo (PS PR3) - Start/Finish: Camacha/Graça Chapel - Distance: 2.5 miles (4.1km), point to point. - Walking time: 1hr 30 minutes - Difficulty: Easy to moderate - Best for: A day escape. Okay, so we're cheating here. That’s because the ‘PS’ in ‘PS PR 3’ stands for Porto Santo. That means this route is not actually on the main island of Madeira, but on Porto Santo Island, which is 27 miles northeast of Madeira. The ferry between the two islands takes 2hrs 30 minutes, but it’s worth making the journey for the quiet sandy beaches and walking trails. Porto Santo is called ‘Golden Island’ for good reason - and there are levada walks here too. Take the Levada do Pico do Castelo. It was built in the first half of the 1900s. The route runs through a typical Porto Santo landscape, taking you past heather, poplars and local plants. You’ll reach a top cliff, known as Portelinha, then descend to Serra de Fora. There are views out to the Ilhéu de Baixo islet, and the Nossa Senhora da Graça Chapel, built in the 1930s, sits near the end of the trail. When is the Best Time to Hike in Madiera? It's no secret that a big part of the reason Madeira is so popular for hiking is the fact that it's an island that is warm year-round. That said, it's worth noting that doesn't mean it's scorching all year. The \"island of eternal spring\" sits between 14-24 degrees Celsius for the majority of the year. Rain is uncommon, and it's rarely too hot. What we're telling you is that Madeira really is a year-round destination. Where to Stay in Madeira for Hiking The capital of Madeira, and the largest city, is Funchal; where rooftops layer up hills and most streets stare out at the ocean. The reason the biggest settlement was built here is that the city is shielded by the mountains from a lot of the wind, and it's also the sunniest part of the island. It's a great place to base yourself in Madeira. Another option beyond Funchal is Sao Vicente – an unspoilt village on the island's wild northern coast. The start points for the PR22 and PR17 walks are both near to the village, and you're also able to access Pico Ruivo and other inland walks from here. There are fantastic glamping and campsite options as well. What Animals Live in Madeira? Madeira is home to endemic birdlife - namely the Madeira pigeon, the Madeira firecrest and the Zino's petrel. There are also 44 other bird species on the island, roughly half of which are endemic to the wider Macaronesia area (made up of Madeira, the Azores and the Canary Islands). You can also see red-legged partridges staring out over the mountains, as pictured above. Pilot whales, Bryde's whales, sperm whales, bottlenose dolphins and Atlantic spotted dolphins can be spotted off shore. What to Eat and Drink in Madeira? Perhaps the most famous export of Madeira is the fortified wine. It can come dry, but it's usually sweet, and is often served as a dessert wine after dinner. You also need to make sure you try poncha, a popular local cocktail made with aguardente de cana or rum, honey, sugar, and either orange juice or lemon juice. On the menues, look for seafood like tuna, limpets, black scabbard fish, mackerel, trout and more. Traditional beef dishes are common, often cooked on hot coals and stuck on skewers. And we need to give a special shoutout to the bolo do caco, a type of bread made from flour and sweet potato. This is a huge favourite with locals and tourists. It's used for sandwiches as well, so keep your eye out. FAQs What are levada walks and why are they unique to Madeira? Levada walks follow historic irrigation channels, known as Levadas, that are unique to Madeira and date back to the 16th century. These narrow channels trace the contours of the island’s mountains, originally built to transport water from the wet north to the dry south. Today, they form a vast hiking network through laurel forests, deep valleys and high ridgelines, blending natural beauty with centuries of engineering heritage. What’s the difference between a levada and a vereda? A levada is an irrigation channel with a narrow path beside it, typically flat or gently sloping, originally created for water transport and maintenance. A vereda, by contrast, is a traditional footpath or mountain trail used to link villages or traverse ridges. Veredas tend to be steeper and more rugged than levadas, making them more challenging. Both offer scenic views. Which levada is best in Madeira? The most popular and arguably best levada walk in Madeira is the Levada das 25 Fontes and Risco Waterfall trail. Located in the Rabaçal valley, this route combines lush laurel forest with dramatic waterfalls and mossy stone paths. It offers an immersive introduction to the island’s natural beauty and is considered a must-do for first-time visitors. Who built the levadas in Madeira? The levadas were built over several centuries, beginning in the 1500s, by Portuguese settlers and local labourers to irrigate sugar cane and farmland. Some routes were expanded or maintained throughout the 20th century, often by hand using pickaxes and rudimentary tools. Their construction represents a monumental feat of civil engineering given Madeira’s rugged terrain. Are the routes signposted in Madeira? Yes, most official levada and vereda trails in Madeira are clearly signposted and numbered, following a PR (Percursos Recomendados) system. Trailheads typically include maps and distance markers, and the paths themselves are waymarked with yellow-and-red signs. However, due to occasional landslides or closures, it’s always wise to check trail conditions before starting and to carry a digital or physical map. How to Get to (and Around) Madeira By plane: Football fans may already know that the main airport in Madeira is the Cristiano Ronaldo Madeira International Airport. There are regular flights from Lisbon, London and beyond. By bus: Madeira is an island where it is useful to have a car, but in the towns and cities there are buses, taxis, tuk-tuks and there are also some cable cars in place. Inspired? Check out our full range of adventures in Madeira now!"
}