{
  "url": "https://support.google.com/voice/answer/115061?hl=pt-BR&co=GENIE.Platform=Desktop",
  "title": "Configurar o Google Voice - Computador - Ajuda do Google Voice",
  "text": "No Google Voice, você tem um número de telefone para chamadas, mensagens de texto e correios de voz. Com esse número você pode fazer chamadas nacionais e internacionais usando o navegador da Web e dispositivos móveis. Se você estiver nos EUA, poderá escolher seu próprio número. Além de usar o Google Voice para chamadas, mensagens de texto e correios de voz, você também pode fazer o seguinte: - Ler transcrições de correios de voz na sua Caixa de entrada e pesquisá-las como e-mails - Personalizar saudações do correio de voz - Fazer chamadas internacionais com tarifas baixas - Aproveitar a proteção contra spam para chamadas e mensagens - Bloquear autores das chamadas indesejados - Filtrar chamadas antes de atendê-las O Google Voice salva e processa suas informações em chamadas, mensagens de texto e correios de voz. O que você precisa para usar o Google Voice Sistemas operacionais compatíveis: - Chrome OS - macOS - Microsoft Windows - A funcionalidade limitada também pode estar disponível em outras plataformas Navegadores da Web compatíveis: - Google Chrome - Mozilla Firefox - Microsoft Edge - Safari Inscreva-se no Google Voice e receba seu número Importante: o Google Voice não oferece números 1–800. - Acesse voice.google.com. - Faça login na sua Conta do Google. - Leia os Termos de Serviço e a Política de Privacidade clique em Continuar. - É possível pesquisar os números disponíveis por cidade ou código de área. Se não houver números disponíveis na sua área, pesquise uma cidade ou um código de área próximo. - Ao lado do número que você escolher, clique em Selecionar. - Siga as instruções exibidas na tela. Dica: depois que configurar o Google Voice, você poderá vincular outro número de telefone. Saiba mais sobre como configurar telefones. Adicionar um atalho no Acesso rápido aos apps Se o app Google Voice não aparecer nos seus apps do Google no Chrome, você pode adicioná-lo. - Acesse voice.google.com. - No canto superior direito, clique em Apps do Google . - Em Voice , clique em Adicionar um atalho. Custo e disponibilidade - Quase todas as chamadas do Google Voice originadas nos EUA e destinadas a números desse país ou do Canadá são gratuitas. - Algumas chamadas para números de telefone específicos nos EUA e no Canadá custam USD 0,01 por minuto. - Chamadas para fora dos EUA seguem as tarifas listadas."
}