{
  "url": "https://www.stonyfield.com/about/",
  "title": "About Stonyfield - Stonyfield",
  "text": "Stonyfield Organic, a certified B Corporation, is one of the leading organic yogurt makers in the country. Here at Stonyfield Organic, we believe that taking care of organic farmers, their cows, and their life’s work will produce healthy food, healthy businesses, and a healthy planet. In fact, we were working for all of this before we even became yogurt makers. How it all began Back in 1983, our co-founders Samuel Kaymen and Gary Hirshberg were running a non-profit organic farming school on a small New Hampshire farm. They were on a mission to help family farms survive, keep food and its production healthy, and help protect the environment. However, the school needed funding. They put the farm’s seven cows to work (and all the helping hands they could wrangle) and began selling really good yogurt made without the use of toxic persistent pesticides or chemical fertilizers. Samuel and Gary did most of the work back then. They milked the cows, made the yogurt, and even made sales calls and deliveries. The yogurt was a hit. A big one. And Samuel and Gary realized that a successful organic company could make a bigger difference for family farms, people, and the planet than their school could. So, they decided to run with yogurt. 40 years later and our mission is still healthy Today, Stonyfield Organic yogurts, smoothies, milk, and cream are sold in supermarkets, natural food stores, and colleges across the country. And all of it is made without the use of toxic persistent pesticides, artificial hormones, antibiotics, or genetically modified organisms (GMOs). We’re still located in New Hampshire—about 30 miles east of the old farm—but now our organic ingredient purchases support a huge network of food producers, made up of hundreds of organic family farms, thousands of organic cows, and over 40,000 organic acres of land. In 2015, we went back to our own roots as an organic farming school when we helped Wolfe’s Neck Center for Agriculture and the Environment launch their organic dairy apprentice program. We’ve always been passionate about planet-friendly business practices—from being one of the first manufacturers to offset emissions to making our own renewable energy, and much more. In 2016, we became a certified B Corporation to validate how we’re holding ourselves to a higher standard of verified social and environmental performance, public transparency, and legal accountability. In 2022, based on our total volume of organic milk, Stonyfield avoided the following based on calculations from The Organic Center toxin calculator: - 10.8 million pounds of fertilizer - 181 thousand pounds of pesticides - 13.5 thousand ounces of antibiotics - 245.5 thousand drug treatments are avoided each year In 2022, we also achieved our goal of using 100% renewable electricity for our Londonderry, NH, manufacturing facility through a combination of purchasing renewable energy credits and supporting the construction of seven new solar arrays located in the United States. The thought and passion that started Stonyfield Organic has only grown stronger, and we’ve never stopped working for healthy food, healthy people, and a healthy planet. Get organic in your inbox! Enter your email to get the latest Stonyfield happenings, promotions, recipes, and more."
}