{
  "url": "https://www.visitorlando.com/",
  "title": "Visit Orlando | Hotels, Restaurants, Things to Do & Vacation Guide",
  "text": "Orlando For Adults If you think an Orlando vacation is kids’ stuff, think again. You are sure to delight in our endless diversity for adults. Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. You are always welcome here. The possibilities are endless. And wonder is always within reach. Experience the authentic getaway you deserve in Orlando. Did you know that it takes 121 days to fully experience everything there is to do in Orlando, Florida? Start planning your adventures now. If you think an Orlando vacation is kids’ stuff, think again. You are sure to delight in our endless diversity for adults. Prepare for the family adventure of a lifetime with endless possibilities for wondrous enchantment and unforgettable fun. Orlando’s welcoming variety ensures unforgettable vacations filled with unique experiences for every visitor. Start living your dreams today. Follow and tag @VisitOrlando to join the fun. Endless adventures await in the Theme Park Capital of the World. The choice is yours with diverse, welcoming fun for everyone. View EventsNo matter where you are staying in the Orlando area, something is probably happening nearby. You do not have to break the bank to have a blast in Orlando. Discover live music and other performances at Orlando's top venues. Think you know Orlando? If you have only experienced our tourism districts, think again. ExploreGet trusted, complimentary vacation planning assistance that can help make all your Orlando dreams come true. ExploreWith more than 480 hotels and resorts and over 130,000 rooms, you will always find the perfect place to stay in Orlando. ExploreBetween an easy-to-navigate highway system, commuter rail, and a complete range of public transportation and ride-share services, it is easy to get where you are going in Orlando. You will never run out of one-of-a-kind adventures in Orlando. See what else is waiting to amaze you."
}