{
  "url": "https://www.britannica.com/place/Dnipropetrovsk-Ukraine",
  "title": "Dnipro | Facts, History, Population, & Name Change | Britannica",
  "text": "Dnipro News • Dnipro, city, south-central Ukraine. It lies along the Dnieper River, near its confluence with the Samara. The river was considerably widened by the construction of a dam about 50 miles (80 km) downstream. Founded in 1783 as Katerynoslav on the river’s north bank, the settlement was moved to its present site on the south bank in 1786. The community was known as Novorosiysk from 1796 to 1802, when its old name was restored and it became a provincial centre. Despite the bridging of the Dnieper in 1796 and the growth of trade in the early 19th century, Katerynoslav remained small until industrialization began in the 1880s, when railways were built to Odessa, the Donets Basin, and Moscow. In 1926 the Soviets renamed it Dnipropetrovsk after the Dnieper and Ukrainian communist official Grigory Petrovsky. In an effort to shed the geographical legacy of the Soviet era, the Ukrainian government launched a “decommunization” initiative in 2016 that led to the renaming of more than 900 towns and cities. Dnipropetrovsk was by far the largest city to be so affected, and in May 2016 its name was officially shortened to Dnipro. Although Dnipro was initially spared during the Russian invasion of Ukraine in 2022, the city was subjected to missile strikes as Russia expanded its attacks on population centres and other nonmilitary targets. Dnipro is one of the largest industrial cities in Ukraine. With iron ore from Kryvyy Rih, manganese from Nikopol, coal from the Donets Basin, and electric power from the cascade of hydroelectric plants on the Dnieper, a huge iron and steel industry has developed in the city; castings, plates, sheets, rails, tubes, and wire are among the goods that have been produced. Large engineering industries have made electric locomotives, agricultural machinery, mining and metallurgical equipment, presses, and other heavy machinery, as well as light-industrial machinery and radio equipment. Coke-based chemicals, tires, plastics, paint, clothing, footwear, foodstuffs, and other materials also have been produced. - Formerly (1783–96, 1802–1926): - Katerynoslav or Ekaterinoslav - (1796–1802): - Novorosiysk, and - (1926–2016): - Dnipropetrovsk Dnipro has a university and teaching institutes of mining, agriculture, chemical technology, metallurgy, medicine, and railway and constructional engineering. Cultural amenities include several theatres and a philharmonic hall. Newer suburbs have spread to the north bank. The neighbouring suburbs of Ihren (Igren) and Prydniprovsk (Pridneprovsk) were annexed in the 1970s. Pop. (2001) 1,065,008; (2021 est.) 980,948."
}