{
  "url": "https://www.nvidia.com/en-us/drivers/",
  "title": "Download The Official NVIDIA Drivers | NVIDIA",
  "text": "Manual Driver Search No Drivers Found. Please select a different combination. Many Linux distributions provide their own packages of the NVIDIA Linux Graphics Driver in the distribution's native package management format. This may interact better with the rest of your distribution's framework, and you may want to use this rather than NVIDIA's official package. The NVIDIA App is the essential companion for PC gamers and creators. Keep your PC up to date with the latest NVIDIA drivers and technology. Best for: Best for: No Drivers Found. Please select a different combination. Note: Many Linux distributions provide their own packages of the NVIDIA Linux Graphics Driver in the distribution's native package management format. This may interact better with the rest of your distribution's framework, and you may want to use this rather than NVIDIA's official package. Enterprise customers with a current Virtual GPU (vGPU) software license (NVIDIA vPC, NVIDIA vApps or NVIDIA RTX Virtual Workstation (vWS), can log into the enterprise software download portal by clicking below. Need more information about how to access your purchased licenses? vGPU Software Downloads Details. Note: Many Linux distributions provide their own packages of the NVIDIA Linux Graphics Driver in the distribution's native package management format. This may interact better with the rest of your distribution's framework, and you may want to use this rather than NVIDIA's official package. Enterprise customers with a current Virtual GPU (vGPU) software license (NVIDIA vPC, NVIDIA vApps or NVIDIA RTX Virtual Workstation (vWS), can log into the enterprise software download portal by clicking below. Need more information about how to access your purchased licenses? vGPU Software Downloads Details. Enterprise customers with a current Virtual GPU (vGPU) software license (NVIDIA vPC, NVIDIA vApps or NVIDIA RTX Virtual Workstation (vWS), can log into the enterprise software download portal by clicking below. Need more information about how to access your purchased licenses? vGPU Software Downloads Details. Production Branch/Studio Most users select this choice for optimal stability and performance. The NVIDIA RTX Enterprise Production Branch driver is a rebrand of the Quadro Optimal Driver for Enterprise (ODE). It offers the same ISV certification, long life-cycle support, regular security updates, and access to the same functionality as prior Quadro ODE drivers and corresponding Studio Drivers (i.e., of the same driver version number). New Feature Branch (NFB)/Quadro New Feature (QNF) Users occasionally select this choice for access to new features, bug fixes, new operating system support, and other driver enhancements offered between Production Branch releases. Support duration for New Feature Branches is shorter than that for Production Branches. \"All\" Shows all available driver options for the selected product. \"Game Ready Drivers\" provide the best possible gaming experience for all major games. NVIDIA's driver team exhaustively tests games from early access through release of each DLC to optimize for performance, stability, and functionality. These drivers are certified by Microsoft’s Windows Hardware Quality Labs (WHQL). \"NFB / SLB\" New Feature Branch (NFB) [formerly known as Linux Short Lived Branch (SLB)] New Feature Branch Linux drivers provide early adopters and bleeding edge developers access to the latest driver features before they are integrated into the Production Branches. See our article to identify what type of graphics card model you have. Read more about the difference between NVIDIA RTX, NVIDIA GeForce, and NVIDIA Quadro. \"All\" Shows all available driver options for the selected product. \"Game Ready Drivers\" provide the best possible gaming experience for all major games. NVIDIA's driver team exhaustively tests games from early access through release of each DLC to optimize for performance, stability, and functionality. These drivers are certified by Microsoft’s Windows Hardware Quality Labs (WHQL). \"Studio Drivers\" provide the best possible experience for key creative applications. NVIDIA does extensive testing across the top creative applications to ensure the highest levels of performance, stability, and functionality. These drivers are certified by Microsoft’s Windows Hardware Quality Labs (WHQL)."
}