{
  "url": "https://www.cnbc.com/2026/02/02/palantir-pltr-q4-2025-earnings.html?msockid=03d75316e9396f5a243445e1e89a6eb0",
  "title": "Palantir (PLTR) Q4 2025 earnings",
  "text": "Palantir topped Wall Street's fourth-quarter estimates as more businesses and the U.S. government race to buy its artificial intelligence tools. Shares rose 5% after the bell. Here's how the company did versus LSEG estimates: - Earnings per share: 25 cents adjusted vs. 23 cents expected - Revenue: $1.41 billion vs. $1.33 billion expected Revenue grew 70% from $827.5 million in the year-ago period. For the fiscal year, sales at the Denver-based firm totaled $4.48 billion U.S. revenue for the government and commercial sectors rose to $570 million and $507 million, respectively. Those results steadily beat estimates from analysts polled by FactSet. CEO Alex Karp called the earnings \"indisputably the best results that I'm aware of in tech in the last decade\" during an interview with CNBC's Morgan Brennan. \"If you're not spending it on this, you're not spending on something that is part of keeping up with momentum,\" he added. Looking forward, the AI-powered software provider said it expects $1.532 billion to $1.536 billion in revenue for the first quarter, well above the $1.32 billion projected by FactSet. For fiscal 2026, the company guided to a range of $7.182 billion to $7.198 billion in revenue, beating the FactSet expectation of $6.22 billion. Palantir, which creates software and data tools sold to businesses and government agencies such as the Department of Defense, the Internal Revenue Service and the Department of Homeland Security, has seen a boost from skyrocketing demand for AI systems and broad retail investor enthusiasm. Karp noted the ongoing adoption of its tools by the U.S. government, a segment that saw 66% growth. \"America has become more lethal, more confident, more divergent from our adversaries, and, quite frankly, from our allies,\" he said. Karp said demand is so strong for its products, and Palantir has become \"so engaged in the U.S.\" that it has held off on selling new products to allies. Much of that demand has come from the Department of Defense, Karp said. This past summer, the company signed an up to $10 billion contract with the U.S. Army to support its software and data needs. Palantir also signed a $448 million deal with the U.S. Navy to accelerate shipbuilding production in December. In recent weeks, Palantir has faced backlash over its work with the Department of Homeland Security, and, more specifically, its work with U.S. Immigration and Customs Enforcement after federal agents fatally shot two protestors in Minneapolis. \"If you are critical of ICE, you should be out there protesting for more Palantir,\" he told CNBC. \"Our product, actually, in its core, requires people to conform with Fourth Amendment data protections.\" Palantir's U.S. commercial revenues more than doubled from last year, while the remaining U.S. commercial deal value rose 145% year over year to $4.38 billion. During the period, Palantir announced a partnership with leading AI chipmaker Nvidia. Net income totaled more than $608 million, or 24 cents per share. The company reported net income of $79 million, or 3 cents per share, a year ago. Investors set a high bar for Palantir heading into the earnings report. The beloved stock among retail investors has rallied 81% over the last year. But some Wall Street analysts have raised concerns about the stock's lofty multiple, with shares down about 15% in 2026. In November, short seller Michael Burry revealed a bet against the software analytics firm and chipmaker Nvidia. At the time, Karp told CNBC that the move was \"bats--- crazy\" and called out \"market manipulation.\" Then, the stock wrapped its worst month in two years as investors pivoted away from AI stocks due to valuation concerns and worries of a bubble. In a letter to shareholders, Karp called Palantir's profit \"pure and uncontrived\" despite rising pressure for AI companies to focus on fundamentals. The company's commercial segment has benefitted from the need for software to provide structure to large language models, he added. \"Anything lacking a zealous focus on the value being created by these technical systems, the mice that the cat actually catches, will ultimately fade to grey and be forgotten,\" Karp wrote."
}