{
  "url": "https://www.state.gov/travelers/",
  "title": "Travelers - United States Department of State",
  "text": "HomeTravelers hide Travel Resources Emergency Information & Resources U.S. Citizen TravelersPlease enroll in the Smart Traveler Enrollment Program (STEP) to receive alerts and be located in an emergency. In Case of an Emergency OverseasPlease call 1 (888) 407-4747 (U.S. and Canada) or 1 (202) 501-4444 (overseas) or contact the nearest U.S. embassy or consulate. Travel AdvisoriesAs a first step in planning any trip abroad, check the Travel Advisories for your intended destination. Our highest priority is to protect the lives and interests of U.S. citizens overseas. We do this through routine and emergency services to Americans at our embassies and consulates around the world. Find more emergency resources for: AMERICANS ABROAD FAMILY MEMBERS INTERNATIONAL PARENT CHILD ABDUCTION Passport Processing We encourage all Americans to check their passport expiration date before making any definitive plans for international travel, and to take action to renew their passport well in advance of international travel this year. Apply for a passport Renew by mail Renew Online Check your passport application status Traveling Abroad: What You Need Preparing for a Trip Abroad Advisories: As a first step in planning any trip abroad, check the Travel Advisories for your intended destination. International Financial Scams: U.S. citizens can become victims of scams at home or abroad. Smart Traveler Enrollment Program (STEP): Subscribe to get up-to-date safety and security information and help us reach you in an emergency abroad. Students Abroad: Exploring new destinations and experiencing other cultures is both rewarding and exciting, but it is also important to do so safely. Travel Tips for Everyone: Check out our Traveler’s Checklist to help you prepare for your trip. Travel Tips for Older Americans: As an increasing number of older U.S. citizens are traveling abroad, we want you to be prepared so you can enjoy your trip. Passports & Documents Where to Apply: Learn where you can apply for a passport. Renew a Passport: Learn how to renew your passport. What Form Should I Use?: The following passport wizard will prepare you to apply for a U.S. passport, whether it’s your first time applying, you need to renew, or you want to get a passport for your child. Application Status: You can check the status of your passport application online or by phone. Report Your Passport Lost or Stolen: Report your physical U.S. passport lost or stolen immediately to protect yourself from identity theft. You can replace it now or later – it’s up to you! Frequently Asked Questions: Check to see your question has already been answered. Authentication of Documents: Some documents require authentication before you can use them abroad. Visas Visa Policy and Procedure: Are you interested in immigrating to the United States or want to sponsor someone? The United States provides for immigrant visas based on family ties, employment, adoption, special immigrant categories, and the diversity visa. Business Visas: A foreign national traveling to the United States to conduct temporary business needs a visitor visa (B-1) unless qualifying for entry under the Visa Waiver Program. Diversity Visa: Annual program making a limited number of visas available to persons who meet strict eligibility requirements from countries with low rates of immigration to the United States Visa Bulletin: Provides information regarding the cut-off dates which govern visa availability in the numerically limited visa categories and other immigrant visa related information. Visa Waiver Program: Enables most citizens or nationals of participating countries to travel to the United States for tourism or business for stays of 90 days or less without obtaining a visa. U.S. Government Resources TRUSTED TRAVELER PROGRAMS Use expedited lanes at U.S. airports and when crossing international borders. CENTERS FOR DISEASE CONTROL AND PREVENTION Get health advice from CDC’s Travelers’ Health Branch. U.S. CUSTOMS AND BORDER PROTECTION Learn what to expect about CBP’s screenings when entering the U.S. TRANSPORTATION SECURITY ADMINISTRATION Discover what you can bring through airport security checkpoints. ANIMAL AND PLANT HEALTH INSPECTION SERVICE Know about animal health requirements before traveling with your pets. FOREIGN CURRENCY EXCHANGE RATES Find out how much local currency a dollar is worth. More Travel Resources Americans Abroad Lost or Stolen Passport: What you need to do if your passport is lost or stolen while traveling abroad. Victims of Crime: We support victims overseas and in the United States. Medical Emergencies: The availability and quality of medical services available can vary greatly depending on your location; contact the nearest embassy or consulate for assistance. Crisis Situations: Whether traveling or living outside of the United States, learn how to prepare yourself for a potential crisis. Financial Assistance: U.S. citizens who need money for an emergency abroad should contact the nearest embassy or consulate. Family Members Death Abroad: We can help when a U.S. citizen dies abroad. Sending Money: Need to send money for an emergency to a U.S. citizen outside the United States? We can help. Locating a Loved One: If you are worried that your loved one was affected by a crisis, there are various ways to try to get in touch – and stay in touch. International Parent Child Abduction Children’s Passport Issuance Alert Program (CPIAP): This program allows our Office of Children’s Issues to contact the enrolling parent(s) or legal guardians(s) to verify whether the parental consent requirement for minor passport issuance has been met when a child’s passport application is submitted. Stopping an Abduction in Progress: If your child is being abducted by a parent, legal guardian, or someone acting on their behalf, contact us immediately. Abducted Children: Learn how we can help if your child has been abducted by a parent, a guardian, or someone acting on their behalf and taken to another country."
}