{
  "url": "https://en.wiktionary.org/wiki/fromage",
  "title": "fromage - Wiktionary, the free dictionary",
  "text": "fromage Appearance English [edit]Etymology [edit]Pronunciation [edit]Noun [edit]fromage (countable and uncountable, plural fromages) - (uncommon) Synonym of cheese. - 1836, Louis Eustache Ude, “Fromages or Cheeses, or Iced Bavarian Cheeses”, in The French Cook, a System of Fashionable and Economical Cookery, Adapted to the Use of English Families, 13th edition, London: Ebers and Co., […], pages 366–369: - It will be necessary to premise, that there is but little difference in the manner of making fromages; they only vary in the taste; so that, by recurring to this number, it will be impossible ever to commit a mistake. […] Continue to whip it over ice, till you perceive that the isinglass is well melted and blended with the mixture; then put the fromage into a mould, round which you heap a large quantity of ice with salt. […] N. B.—Fromages require but very little isinglass. […] The author here closes the list of creams and fromages, although their number is immense. - 1860, [Henrietta Keddie], “Lady Somerville’s Maidens”, in Norman Macleod, editor, Good Words for 1860, London: Alexander Strahan and Co., […], part III, page 490, column 2: - How cheerful and contented they were in the Bow over the meals which Mrs. Crichton viewed with such pity and contempt,—the bouilli, the salad, the fragrant coffee finely concocted, the home-made bread, the thick preserves, the fromage still of goats’ milk. - 1897, National Magazine, page 371, column 1: - He went straight through the bill of fare, omitting nothing, not even the fromage, which disagreed with him generally, […] - 1899, Mrs. B. F. Head, “Strawberry Fromage”, in The New Century Cook Book: Compiled from Recipes Contributed by Ladies of Chicago and Other Cities and Towns, […], page 249: - Soak an ounce of gelatine in half pint of cold water half an hour; press a quart of ripe strawberries through a flour sieve fine enough to prevent the seeds from going through; add a cup of pulverized sugar and a few drops of cochineal to give it color, and the gelatine dissolved in hot water or over the teakettle; set the pan containing the mixture in another pan containing chopped ice; stir until it begins to thicken, then beat in rapidly a pint of whipped cream; line a mould with lady fingers, then fill with the fromage. - 2001, Betty Jo Tucker, Confessions of a Movie Addict, Hats Off Books, →ISBN, page 39: - MOUSE: I had just moved to California—for the cheese—when a casting agent spotted me and said I was perfect for the lead in Mouse Hunt. They offered me all the fromage I could eat, but I never dreamed I’d get the chance to work with my favorite funny human, Nathan Lane. - 2001, New York, page 104, column 1: - At Artisanal, diners can linger in the fromage “cave,” a clean, fluorescent space filled with iridescent wheels of Flixer (from Switzerland), Harbourne Blue (from England), and Drunken Goat (from Spain). - 2008, Carol Diuguid, editor, Zagat New York City Gourmet Shopping & Entertaining 2009, Zagat Survey, →ISBN: - “If you’re a turophile”, “paradise” awaits at Terrence Brennan’s Murray Hill bistro, where the “bountiful” retail counter is “the ultimate” “showcase” of “fragrant”, “scary-delicious” fromage in a 250-strong “worldwide assortment” that’s stocked on-site in carefully calibrated caves; […] “Very popular” for its raw-milk and hormone-free cheeses created by a “dedicated” Colchester, CT, producer, this Greenmarket vendor’s “exceptional” artisanal fromages include “breathtakingly lovely cheddar”, “tangy blue”, “pungent, flavorful” washed-rind ‘hooligan’ and “earthy” ‘womanchego’, all dispensed by a “knowledgeable” crew; […] play of “quaint” kitchen curios side-by-side with “fabulous” fromages, leading to “great finds” both edible and collectible; […] Widely considered “the gold standard of cheese in NY”, this Village “wonderland” boasts an “astounding” assortment of “premium” “artisanal and seasonal” fromages “from all over the map”, with “congenial” “experts” on staff dispensing advice and taste tests; […] “Many a new cheese lover will emerge” from this “boutique”-like Essex Street Market stall, which honors “the finest in American-made”, “small-farm” fromages with its 30-plus “artisanal” offerings (“expect the unusual here”) paired with “fresh-baked breads” from Sullivan Street Bakery; […] Say “cheese” - this site carries the best of Northeastern-produced handcrafted foods, including 80-plus varieties of “delicious” farmstead fromages, some “undiscovered” gems among them, […] Related terms [edit]Translations [edit]cheese — see cheese French [edit]Alternative forms [edit]Etymology [edit]Inherited from Middle French froumaige, formage, from Old French formage, from Early Medieval Latin fōrmāticum, from Latin fōrma (“mould”). Compare Occitan formatge. Pronunciation [edit]Noun [edit]fromage m (plural fromages) - cheese - fromage râpé ― grated cheese Derived terms [edit]Descendants [edit]- Haitian Creole: fromaj - Louisiana Creole: fromaj - Mauritian Creole: fromaz - Réunion Creole French: formaz - Seychellois Creole: fromaz - → Breton: formaj (Vannetais) - → English: fromage - → Esperanto: fromaĝo - → Ido: fromajo - → Khmer: ហ្វ្រូម៉ាហ្ស (froumaa) - → Malagasy: foromazy, frômazy - → Moroccan Arabic: فروماج - → Rwanda-Rundi: ifromaje (Rwanda), iforomaji (Rundi) - → Vietnamese: phô ma, phô mai, pho mát, phó mát - → Volapük: fromad - → Wolof: foromaas - → Wallisian: folomasi Further reading [edit]- “fromage”, in Trésor de la langue française informatisé [Digitized Treasury of the French Language], 2012 Norman [edit]Alternative forms [edit]- fronmage (Jersey) Etymology [edit]From Old French fromage. Noun [edit]fromage m (plural fromages) Old French [edit]Alternative forms [edit]Etymology [edit]Inherited from Early Medieval Latin fōrmāticum (attested from circa 800). By surface analysis, former (“to shape”) + -age. Pronunciation [edit]Noun [edit]fromage oblique singular, m (oblique plural fromages, nominative singular fromages, nominative plural fromage) Descendants [edit]Borrowings (many may come from Occitan or Catalan formatge instead): - → Gallo-Italic: - → Italo-Romance: - → Ibero-Romance: - → Others: References [edit]- Walther von Wartburg (1928–2002), “formaticum”, in Französisches Etymologisches Wörterbuch, volume 3: D–F, page 717 Categories: - English terms borrowed from French - English terms derived from French - English 2-syllable words - English terms with IPA pronunciation - English terms with audio pronunciation - English lemmas - English nouns - English uncountable nouns - English countable nouns - English uncommon terms - English terms with quotations - French terms inherited from Middle French - French terms derived from Middle French - French terms inherited from Old French - French terms derived from Old French - French terms inherited from Early Medieval Latin - French terms derived from Early Medieval Latin - French terms derived from Latin - French 2-syllable words - French terms with IPA pronunciation - French terms with audio pronunciation - Rhymes:French/ɑʒ - Rhymes:French/ɑʒ/2 syllables - French lemmas - French nouns - French countable nouns - French masculine nouns - French terms with usage examples - Norman terms inherited from Old French - Norman terms derived from Old French - Norman lemmas - Norman nouns - Norman masculine nouns - Guernsey Norman - nrf:Cheeses - Old French terms inherited from Early Medieval Latin - Old French terms derived from Early Medieval Latin - Old French terms suffixed with -age - Old French terms with IPA pronunciation - Old French lemmas - Old French nouns - Old French masculine nouns - Old French words derived through metathesis"
}