{
  "url": "https://chem-textbook.ucalgary.ca/chapter-3-main/parts-per-million-ppm-and-parts-per-billion-ppb/",
  "title": "Parts per Million (ppm) and Parts per Billion (ppb) - UCalgary Chemistry Textbook",
  "text": "Very low solute concentrations are often expressed using appropriately small units such as parts per million (ppm) or parts per billion (ppb). Like percentage (“part per hundred”) units, ppm and ppb may be defined in terms of masses, volumes, or mixed mass-volume units. There are also ppm and ppb units defined with respect to numbers of atoms and molecules. The mass-based definitions of ppm and ppb are given here: $$ppm\\,=\\frac{mass\\,solute}{mass\\,solution}\\,×\\,10^6\\,ppm$$ $$ppb\\,=\\frac{mass\\,solute}{mass\\,solution}\\,×\\,10^9\\,ppb$$Both ppm and ppb are convenient units for reporting the concentrations of pollutants and other trace contaminants in water. Concentrations of these contaminants are typically very low in treated and natural waters, and their levels cannot exceed relatively low concentration thresholds without causing adverse effects on health and wildlife. For example, the EPA has identified the maximum safe level of fluoride ion in tap water to be 4 ppm. Inline water filters are designed to reduce the concentration of fluoride and several other trace-level contaminants in tap water ([link]). Calculation of Parts per Million and Parts per Billion Concentrations According to the EPA, when the concentration of lead in tap water reaches 15 ppb, certain remedial actions must be taken. What is this concentration in ppm? At this concentration, what mass of lead (μg) would be contained in a typical glass of water (300 mL)? Solution The definitions of the ppm and ppb units may be used to convert the given concentration from ppb to ppm. Comparing these two unit definitions shows that ppm is 1000 times greater than ppb (1 ppm = 103 ppb). Thus: The definition of the ppb unit may be used to calculate the requested mass if the mass of the solution is provided. Since the volume of solution (300 mL) is given, its density must be used to derive the corresponding mass. Assume the density of tap water to be roughly the same as that of pure water (~1.00 g/mL), since the concentrations of any dissolved substances should not be very large. Rearranging the equation defining the ppb unit and substituting the given quantities yields: $$ppb\\,=\\frac{mass\\,solute}{mass\\,solution}\\,×\\,10^9\\,ppb$$ $$mass\\,solute\\,=\\frac{ppb\\,x\\,mass\\,solution}{10^9\\,ppb}$$ $$mass\\,solute\\,=\\frac{15\\,ppb\\,×\\,300\\,mL×\\frac{1.00\\,g}{mL}}{10^9\\,ppb}=\\,4.5\\,×\\,10^{−6}\\,g$$Finally, convert this mass to the requested unit of micrograms: $$4.5\\,×\\,10^{−6}\\,g\\,×\\frac{1\\,μg}{10^{−6}\\,g}=\\,4.5\\,μg$$Check Your Learning"
}