{
  "url": "https://www.mayoclinic.org/drugs-supplements-honey/art-20363819",
  "title": "Honey - Mayo Clinic",
  "text": "Overview Honey is a sweet fluid made by honeybees using the nectar of flowering plants. There are many different kinds of honey because there are many kinds of flowers. Honey can vary in color, smell and taste. Honey is mostly sugar. People may use it to make foods sweeter. It has other ingredients that can help kill bacteria, viruses and fungi. Honey may help lower swelling and irritation, also called inflammation. People may eat honey, use it in a mouth rinse, or apply it as an eye cream or eye drop. Honey may be added to wound dressings, such as gauze. What the research says Research on honey for specific conditions includes: - Heart and blood vessel disease, also called cardiovascular disease. Honey may help lower cholesterol. This may help to improve heart health. - Cough. Honey may help lessen a cough in children age 1 and older. Research hasn't shown that honey is better than other cough medicines for adults. - Dry eyes. Some studies support using a medical eye drop made with honey to treat dry eyes. These eye drops also may help with eye redness. - Digestive conditions, also called gastrointestinal conditions. Studies suggest that honey might help ease diarrhea in people with infections caused by bacteria. Because honey is high in sugar, eating too much honey could cause diarrhea. Honey also might help lessen irritation that can happen with conditions that cause gut inflammation, such as ulcerative colitis. - Seasonal allergies. Research studies haven't found that taking honey or using it as a nose spray eases seasonal allergy symptoms, also known as hay fever or allergic rhinitis. A small study found that taking honey and a medicine used to treat allergies called loratadine lessened allergy symptoms. - Wound care. Honey that has been cleaned using strict methods, known as medical-grade honey, may help heal wounds. This honey type may be used to treat burns and foot wounds in those with diabetes. Results might vary because honey isn't controlled by the U.S. Food and Drug Administration, called the FDA. Producers can make it in different ways, and the quality may not be the same between different brands. Our take Honey is generally safe for adults and children older than age 1. It might be helpful in treating burns, coughs and possibly other conditions. Safety and side effects Honey is likely safe for use as a natural sweetener, cough treatment, and product used to treat minor sores and wounds. Avoid giving honey, even a tiny taste, to babies under the age of 1 year. Honey can cause a rare but serious digestive condition called infant botulism. Raw honey may have cells in it that bacteria use to make more bacteria called spores. The spores can grow and multiply in a baby's gut. They can make a harmful toxin that can make a baby ill. The spores don't seem to affect adults or children in the same way. The most common side effects from honey include: - Nausea. - Belly pain. - Vomiting. - Stinging after putting honey on the skin. Some people are sensitive or allergic to honey. Honey may have bee pollen in it. Bee pollen allergies rarely can cause serious reactions. Symptoms may include: - Wheezing and other problems breathing. - Dizziness. - Weakness. - Sweating. - Fainting. - Irregular heart rhythms, called arrhythmias. Interactions Possible interactions include: - Phenytoin (Dilantin): Taking phenytoin and eating honey may raise the risk of side effects from taking phenytoin."
}