{
  "url": "http://www.upenet.com.br/concursos/25_SEE/",
  "title": "UPENET | Secretaria de Educação 2025",
  "text": "A SECRETÁRIA DE ADMINISTRAÇÃO e o SECRETÁRIO DE EDUCAÇÃO, tendo em vista o Decreto nº 58.354, de 02 de abril de 2025, publicado no Diário Oficial de 03 de abril de 2025, a Deliberação Ad Referendum CPP nº 054, de 23 de maio de 2024 e a Deliberação Ad Referendum CPP nº 100/2024 de 20 de agosto de 2024 da Câmara de Política de Pessoal - CPP. RESOLVEM: I. Abrir seleção pública simplificada para a contratação temporária de profissionais de Nível Superior e Médio para preenchimento de 725 (setecentos e vinte cinco) vagas para atuar, no âmbito da Secretaria de Educação, na Educação Profissional, observadas as regras contidas no ANEXO ÚNICO, que integra a presente Portaria Conjunta. II. Determinar que a seleção pública simplificada regida por esta Portaria Conjunta seja válida por 02 (dois) anos, prorrogável por igual período, a partir da data de homologação do seu resultado final. III. Estabelecer em até 12 (doze) meses o prazo de vigência dos contratos temporários provenientes da seleção pública simplificada de que trata a presente Portaria, podendo ser prorrogáveis por iguais períodos, observados os termos da Lei Estadual nº 14.547, de 21 de dezembro de 2011, e demais normas aplicáveis à matéria. IV. Instituir a Comissão Coordenadora da seleção pública simplificada responsável por sua normatização e o acompanhamento de sua execução, ficando, desde já, designados os seguintes membros, sob a presidência da primeira: V. Estabelecer que é de responsabilidade do INSTITUTO DE APOIO À UNIVERSIDADE DE PERNAMBUCO – IAUPE Concursos, a criação dos Instrumentos Técnicos necessários à Inscrição, Avaliação da Experiência Profissional e de Títulos e a divulgação dos Resultados, além de todos os comunicados que se fizerem necessários ao processo seletivo. VI. Esta Portaria Conjunta entra em vigor na data de sua publicação. ANA MARAÍZA DE SOUSA SILVA Secretária de Administração GILSON JOSÉ MONTEIRO FILHO Secretário de Educação ANEXOS ANEXO I - Quadro de Vagas ANEXO II - Da carga horária e remuneração ANEXO III - REQUISITOS DE FORMAÇÃO ACADÊMICA-ESCOLARIDADE ANEXO IV - DESCRIÇÃO SINTETICA DAS ATRIBUIÇÕES DAS FUNÇÕES ANEXO V - TABELA DE PONTUAÇÃO ANEXO VI - CRONOGRAMA ANEXO VII - DECLARAÇÃO DE DEFICIENCIA ANEXO VIII - DECLARAÇÃO DE VERIFICAÇÃO DE VÍNCULOS DO CANDIDATO ANEXO IX - FORMULARIO DE REQUERIMENTO DE ISENÇÃO DE TAXA DE INSCRIÇÃO ANEXO X - DECLARAÇÃO DE RESIDÊNCIA"
}