{
  "url": "https://www.seethroughny.net/",
  "title": "SeeThroughNY :: Home",
  "text": "The Payrolls section provides a database of names, positions, salaries and/or total earnings for individuals who have been employed by New York State, New York City, state and regional public authorities, public school districts, and New York's county, city, town and village governments. The Pensions section provides a database of names, last employer, retirement date and benefit amount for individuals who have retired from public service, including New York State, New York City, state and regional public authorities, public school districts, and New York's county, city, town and village governments. The Contracts section allows users to search collective bargaining agreements between public employers and public employees, including teachers' unions, school superindents, police departments, fire departments, and public authorities. Click \"Download Contract\" to view the contract in PDF format. Use the form below to search operational and staff expenditures by the New York State Legislature. The database includes expenditure information reported by the state Assembly and the state Senate for each of the six-month periods since Oct. 1, 2007. The Benchmarking New York tool features two searchable databases with multiple ways to analyze and compare data for different communities: Use the tools and information linked on this page to track how money is raised and spent by New York's state government, as reported in the financial plan based on the state budget. Giving New Yorkers a clearer view of how their state and local tax dollars are spent. This site is sponsored by the Empire Center for Public Policy. Public authority payroll records for 70,342 employees in 2025, 93,487 employees in 2024, 88,194 employees in 2023 have been updated. FY25 Payroll data for 390,906 employees in New York School Districts (outside NYC) was posted today. Pension data for 21,170 members of the NYC Board of Education Retirement System has been posted today."
}