{
  "url": "https://en.wikipedia.org/wiki/Cuernavaca",
  "title": "Cuernavaca - Wikipedia",
  "text": "Cuernavaca Cuernavaca[a] is the capital and largest city of the state of Morelos in Mexico. Along with Chalcatzingo, it is likely one of the origins of the Mesoamerican civilization. Olmec works of art, displayed in the Museum of Anthropology in Mexico City, were found in the Gualupita III archeological site. The city is located south of Mexico City, reachable via a 90-minute drive along the Federal Highway 95D.[3] The name Cuernavaca is a euphonism derived from the Nahuatl toponym Cuauhnāhuac and means 'surrounded by or close to trees'. The name was Hispanicized to Cuernavaca; Hernán Cortés called it Coadnabaced in his letters to Charles V, Holy Roman Emperor, and Bernal Díaz del Castillo used the name Cuautlavaca in his chronicles.[4] The coat-of-arms of the municipality is based on the pre-Columbian pictograph emblem of the city that depicts a tree trunk (cuahuitl) with three branches, with foliage, and four roots colored red. There is a cut in the trunk in the form of a mouth, from which emerges a speech scroll, probably representing the language Nahuatl and by extension the locative suffix -nāhuac, meaning 'near'.[5] Cuernavaca has long been a favorite escape for Mexico City residents and foreign visitors because of its warm, stable climate and abundant vegetation. The municipality was designated a Forest Protection Zone by President Lázaro Cárdenas in 1937 to protect the aquifers, the vegetation, and the quality of life of residents, both in Mexico City and locally.[6] The city was nicknamed the \"City of Eternal Spring\" by Alexander von Humboldt in the 19th century.[7] Aztec emperors had summer residences there, and considering its location of just a 1+1⁄2-hour drive from Mexico City, today many Mexico City residents maintain homes there.[8] Cuernavaca is also host to a large foreign resident population, including large numbers of students who come to study the Spanish language.[9] The city [edit]City of Eternal Spring [edit]Cuernavaca was one of the cities of the world nicknamed \"City of Eternal Spring\". This appelative derived from Alexander von Humboldt's Researches concerning the institutions & monuments of the ancient inhabitants of America...:[10] To the south east of the city of Cuernavaca (the ancient Quauhnahuac), on the western declivity of the Cordillera of Anahuac, in that happy region, designated by the inhabitants under the name of tierra templada (temperate region) because it is the reign of perpetual spring, rises an insolated hill, which, according to the barometrical measurement of Mr. Alzate, is one hundred and seven metres high. — Humboldt (1810) The city is located in a tropical region, but its temperature is fairly constant at 21–26 °C (70–79 °F). It is located on the southern slope of the Sierra de Chichinautzin mountains. In the morning, warm air flows up the mountains from the valley below and in the late afternoon, cooler air flows down from the higher elevations. One ubiquitous flowering plant in the city is the bougainvillea.[11] This pleasant climate has attracted royalty and nobles since Aztec times. Foreign princes, archdukes, and other nobles have been attracted to this place because of its flowers, sun, fruits, fresh-water springs, and waterfalls. Emperor Maximilian I of Mexico set up a country residence in the city. Philanthropist Barbara Hutton, who held several aristocratic titles through marriage, had a home on the outskirts of the city.[12] Princess Maria Beatrice of Savoy (b. 1943) lived there from 1971 to 1999, and the Shah of Iran, Mohammad Reza Pahlavi, lived in exile in the city following the Iranian Revolution.[13] Although a native of the U.S., Bauhaus designer Michael van Beuren established his residence in a family hacienda in Cuernavaca while fleeing the rise of the Nazi regime in Germany (where he studied and practiced his profession), and a colony of Bauhaus designers grew in the city during World War II.[7] Cuernavaca metropolitan area [edit]Cuernavaca always has been a popular place for people from Mexico City to escape the city.[14] In the 20th century, the climate and flora began to attract many foreigners as well. Population increase in this urban area began in 1940, but the metro area was not created, nor recognized, until the 1960s. From this time the population and the extension of the metropolitan area have grown. From 1960 to 1980, the population had grown from 85,620 to 368,166. From the 1980s to the present, the municipalities of Emiliano Zapata, Jiutepec, Temixco, Tepoztlán, and Xochitepec have been added to the metropolitan area. These municipalities have seen the highest rates of growth, however; population and economic activity remain concentrated in the city of Cuernavaca proper. The metropolitan area has a population of 912,024 and the municipality has 366,321 inhabitants, as of 2015.[15] Over the decades since 1970, this metropolitan area has become more economically and socially integrated with the Mexico City metropolitan area. Many people from Mexico City own second homes there for weekend retreats, both for the climate and for the well-developed infrastructure. Starting in the 1980s permanent migration of Mexico City residents began, spurred by pollution and crime problems in the capital. The 1985 Mexico City earthquake also pushed many well-to-do families there, fearful of the next catastrophe. In many of these cases, the main breadwinner commutes each day to work in Mexico City. This has produced a considerable increase in housing developments on the outskirts of the city, especially in the late 1990s and 2000s. This influx has had a positive economic benefit for the city but has put pressure on the infrastructure as well. 85% of the city of Cuernavaca is dedicated to housing, and much of this is in middle-class housing developments such as Rancho Cortés, Rancho Tetela, and Colonia del Bosque, which are located on the outskirts of the city. Lower-income housing is concentrated in the city proper.[citation needed] History [edit]Indigenous peoples [edit]Burials dated to c. 1000 BCE have been found in Gualupita, Morelos, in the north of the city.[16] The first major culture to inhabit this area was the Tlahuica, a Nahuatl-speaking people whose main settlement was where the city of Cuernavaca is today. The Tlahuicas have inhabited this area at least since the 12th century.[8] Matlatzincas could also be found in this region as late as the nineteenth century.[17] The first incursions south into the area by peoples of the Valley of Mexico occurred in the 12th century, when a lord named King Xolotl (ruler of Tetzcoco) conquered most of the Valley of Mexico. An allied Chichimeca tribe also moved south into what is now northern Morelos state, making Techintecuitla lord of the Cuauhnahuac (as they called the city) area, with the Tlahuicas concentrated in the nearby towns of Yecapixtla and Yautecatle. According to the Tlatelolco Annals, in 1365, the lord of Cuauhnahuac, Macuilxochitl, tried to conquer lands as far as the Valley of Mexico, but was met by the lord of Chalco, Tzalcualtitlan, with similar ambitions.[18] Cuauhnahuac grew to rule over most of what is now the western portion of the state of Morelos. The first Aztec emperor, Acamapichtli, began to expand his empire to the south of the Valley of Mexico and beyond in the 1370s. His successor, Huitzilihuitl, was eager to press on into what is now Morelos state because of the cotton grown there, it was called Tlalnahuatl at that time. He asked to marry the daughter of the ruler of Tlalnahuatl but was rejected. That rejection started a war that ended with an Aztec victory in 1396. Huitziliuitl then married the princess and Moctezuma I was born of the union. Credit for the conquest of Cuernavaca is given to Acamapichtli in the Mendocino Codex, but later writings cite Itzcóatl, or even Moctezuma I, as the conqueror. The conquered dominion, Tlalnahuac, was roughly the size of the modern state of Morelos, and subsequently was renamed as Cuauhnahuac by the Aztecs.[18] The local elite came to cooperate with the Mexica through marriages, gift exchanges and ceremonies, as a way to grow their own power. Besides cotton, the region also provided Tenochtitlan with amate paper and flowers for use in ceremonies. During the reign of Ahuitzotl, merchants from Cuauhnahuac travelled as far as Tehuantepec.[19] From 1403 to 1426, this province grew in strength, subduing neighboring peoples such as the Coauixcas. Eventually, the province, then ruled by Miquiuix, rebelled against the Aztec Empire. This rebellion was put down by Totoquihuatzin and Netzahualcoyotl in 1433. This area then joined in the conquests of what now are known as Taxco, Tepecuacuilco, and Ocuilán, and also fought wars with Huejotzingo, Tepoztlán, and Malinalco.[20] For tribute purposes, the dominion was divided into two zones, one headed by Cuauhnahuac and the other by Huaxtepec.[18] Spanish Conquest and colonization [edit]At the time of the Spanish Conquest, Itzohuatzin was governing Cuauhnahuac. It was a rich city and densely populated, with large farms and its characteristic ravines bridged over. The Spanish marched on Cuernavaca even before taking the Aztec capital of Tenochtitlan.[21]: 338–340 They were led by Gonzalo de Sandoval and he was joined later by the conquistador, Hernán Cortés.[18] The bridges were destroyed to prevent the Spanish from entering the city, but they were able to cross on a fallen tree. The Spanish troops pillaged and burned the city before retiring to nearby Acapantzingo, where they celebrated the first mass in Morelos on Sunday, 14 April 1521, before continuing their march on the capital.[22] The Spanish had difficulty pronouncing the Nahua name of the city and changed it to Cuernavaca.[23][24] Cortés returned to Cuernavaca in 1523, stopping in Tlaltenango, where he founded the Church of San José and constructed the first sugar plantation. The fertility of these lands compelled the conquistador to found his favorite residence here.[citation needed] Juana de Zúñiga, Cortes's wife, lived in Cuernavaca in the palace that was constructed in 1526. Cortes then moved the hacienda in Tlaltenango to Amatitlan.[5] The Franciscans arrived in Cuernavaca in 1529 and founded their 5th monastery in New Spain there. This first group included Martín de Lua, Francisco Martínez, Luis Ortiz, Juan de Cervo, Francisco de Soto, Andrés de Córdova, Martín de Jesús, Juan Juárez, Juan de Motolinía, and Juan García de Cervo.[citation needed] Originally they lived at the San Francisquito hermitage, but later they constructed the open-air chapel, Capilla Abierta, at what was to become a monastery and eventually the Cuernavaca Cathedral. They extended their presence into the neighboring communities of Tetecala, Jiutepec, and Tlaquiltenango, among others, eventually forming the province of Santo Evangelio, which would be part of the province of Mexico in 1543. In 1646, this province was reorganized several times. Cuernavaca and Cuautla became high mayorships which answered directly to the viceregal authorities in Mexico City. In 1786, New Spain was divided into twelve provinces and in 1824, Cuernavaca was initially a district of Mexico City.[18] Independence to Revolution [edit]During the Mexican War of Independence, José María Morelos was imprisoned at the Palacio de Cortés in November 1815.[25] Agustín de Iturbide's army passed through Cuernavaca to fight Vicente Guerrero in 1820 and came through again in 1821, as the head of the Ejército Trigarante.[26] After Independence and with the Constitution of 1824, the territory now known as the State of Morelos became part of the State of Mexico. Between 1827 and 1829, Cuernavaca was a district of this state. From 1829 to 1833, it was called a prefecture. In 1833, the State of Mexico declared the Atlacomulco Hacienda, which contains the Palacio de Cortés and Cortés's houses in Coyoacán, to be public property.[18] In 1834, Ignacio Echevarría and José María Tornel drafted the Plan of Cuernavaca, which permitted Antonio López de Santa Anna to disregard the laws protecting church property, exile Valentín Gómez Farías, reopen the university, and dissolve the tribunal that was set to convict Anastasio Bustamante for the assassination of Vicente Guerrero. In the same year, the State of Mexico declared Cuernavaca to be a city.[18][26] During the Mexican–American War (1846-1847), Cuernavaca was captured by the Cadwalader Brigade and was forced to pay retributions to the U.S. Army after the Cuernavaca Infantry under Francisco Modesto Olabuibel fell. During the Ayutla Rebellion in 1854, Santa Anna was forced out of the capital of Mexico City in 1855. He moved his government to Cuernavaca, reorganized it, and named a junta to elect an interim president. This junta consisted of Valentín Gómez Farías, Melchor Ocampo, Benito Juárez, Francisco de P. Zendejas, Diego Álvarez, and Joaquín Moreno. They then voted for Alvarez as president. This new president swore to uphold the Plan of Ayutla and his inauguration was celebrated with much pomp in the city.[18] Ministers from Guatemala, the United States, and Great Britain, as well as the Apostolic Delegate and the Consuls of Belgium, Chile, and some Asian countries, moved to Cuernavaca and recognized the Álvarez government.[26] In 1853, the District of Cuernavaca and the District of Mexico were declared separate.[18] During the Reform War (1857–1860) when conservatives rejected the liberal constitution of 1857, Juan Vicario voiced the cry of \"Religión y Fueros\" (Religion and Immunity) in Cuernavaca on 13 January 1858. In 1861, the Government of the State of Mexico created the districts of Cuernavaca, Jonacatepec, Tautepec, and Tetecala.[5] In order to facilitate operations against the French during the French Intervention, President Juarez divided the State of Mexico into three military districts. The third consisted of the territories of Cuernavaca, Yautepec, and Tetecala, with its capital in the city of Cuernavaca. Soon thereafter, this district fell into French hands. Maximilian I converted the Borda Garden into his summer residence and bought land in nearby Acapantzingo to construct a chalet. This prompted the construction of the Mexico-Cuernavaca highway.[18] When the French-installed monarch fell in 1867, Republican forces under Francisco Leyva, Ignacio Figueroa, and Ignacio Manuel Altamirano laid siege to Cuernavaca, which was defended by General Joaquín Ayestarán. The attackers cut off water supplies to the city and attacked on 3 January, but were met with a long series of street battles throughout the city. During the fighting, the general was killed and the Republican forces withdrew, victorious, to Mexico City, but only after burning a large portion of the city.[18] The State of Morelos was created in April 1869, with General Francisco Leyva as its first governor. Cuernavaca was declared the capital of the new state in November of the same year. In 1877, under Governor Carlos Pacheco, the Toluca-Cuernavaca highway was built and a rail connection created between Cuernavaca and Mexico City. The Porfirio Díaz Theater was opened in February 1882, and the first Public Health Board in the city was established the same year.[26] In 1891, the Diocese of Cuernavaca was established by Pope Leo XII, comprising the entire state of Morelos, with Hipolito Vera as the first bishop of Cuernavaca.[27] The first locomotive arrived on 1 December 1897, and a bridge was constructed to connect the center of the city with the train station.[28] The Bank of Morelos was founded in 1903.[26] Mexican Revolution and 20th century [edit]In 1909, the anti-reelection movement was established in Cuernavaca, and by the end of this same year guerilla operations against the Diaz government were headed by Genovevo de la O in Santa María Ahuacatitlán. Emiliano Zapata took over the movement in the south and named De la O in charge of the Cuernavaca area. On 21 May 1911, Cuernavaca was evacuated by government troops, leaving the entire state in rebel hands. Professor Brunk, describing Zapata's triumph, writes \"On the twenty-sixth, at 4 o'clock on a bright Friday afternoon, Zapata rode triumphantly into that city at the head of four thousand troops. Waving images of the Virgin of Guadalupe overhead, these revolutionaries were a ragged lot in the eyes of the urbane. But to the throngs who greeted them - the common people of Morelos, the young girls with armfuls of bougainvillea - they were conquering heroes.\"[30] President Francisco I. Madero visited the city on 12 June 1911, and he attended a banquet in the Borda Garden.[26] The city later fell to the forces of Huerta, and Zapata began to lay siege to Cuernavaca in May 1914 with 3,600 men, falling by August. Later, on 26 January 1915, the Revolutionary government was moved to the city, in defiance of Carranza and the Constitutionalists. However, Zapata lost control of Cuernavaca on 2 May 1916 and was forced to return to guerilla warfare.[30] The Spanish flu came to Cuernavaca in 1918, leaving only 3,000 survivors, although by May 1920 it had a population of 12,799.[26] Wealthy North Americans and Europeans established secondary residences in Cuernavaca and took long vacations there or frequently traveled back and forth, while servants maintained the haciendas in their absence. Sometimes, their offspring have made Cuernavaca their permanent residence, creating an enclave of natives with international roots bearing the influence of their cultures. For example, when the American designer, Michael van Beuren fled Germany with members of Bauhaus, where he was practicing his profession, he took up residence at the vacation hacienda of his parents in Cuernavaca, and stayed permanently, establishing his factory nearby and raising his family there. Others in his family began to reside there year 'round. Their children were natives of Mexico. Video on YouTube After his installation as U.S. Ambassador to Mexico in 1927, American businessman Dwight Morrow established a weekend home in Cuernavaca on the street that today bears his name. It was here that his daughter Anne met famed aviator Charles Lindbergh, whom Morrow had invited to Mexico. In celebration of his daughter's engagement to Lindbergh and to thank the people of Cuernavaca, in 1929 Morrow commissioned Diego Rivera to paint the mural \"History of Morelos, Conquest and Revolution\" at the Palacio de Cortes.[31] During the 1920s and 1930s, Cuernavaca became a place to vacation and gamble when the Hotel de la Selva was converted into the Casino de la Selva, which attracted people such as Rita Hayworth, Bugsy Siegel, and Al Capone to Cuernavaca,[citation needed] however, gambling was shut down by Lázaro Cárdenas in 1934. He is the same president who declared the area a ZPG (Forest Protection Zone). The casino hosted very important artistic works, including murals of Alvarez Icaza, Messeguer, and the architecture of Candela. The main vault was considered to be the \"Mexican Sistine Chapel\" by Nobel Prize author, Gabriel García Márquez.[citation needed] 1936 was the year that Malcolm Lowry wrote his short story, \"Under The Volcano\", which inspired his 1947 novel of the same name. It has never gone out of print and was made into a movie in 1984. Cuernavaca, or Quaunahuac, as it is called in the novel, and the surrounding area, figure prominently in this great historical novel, where extensive details on Mexican history, culture, topography, and especially, politics and religion figure prominently. The recurrent artifacts are the twin volcanos, Popocatepetl and Iztaccihuatl, and the barranca, symbols of division, death, and rebirth in the city of eternal spring. Dr. Sergio Méndez Arceo became bishop of Cuernavaca in 1952. Mendez was known as a leading voice of Liberation Theology and he was a human rights activist.[32] In 1956, Erich Fromm founded the Sociedad Mexicana de Psicoanálisis and from his house in Cuernavaca promoted new ideas in the field of psychiatry, incorporating Zen Buddhism and \"communal psychoanalytic studies\" (estudios psicoanalíticos comunitarios). This attracted many artists, composers, architects, and counterculture types here.[7] In the 1960s, the city was one of the centers of the psychedelic movement.[citation needed] Timothy Leary tried psilocybin mushrooms there in the summer of 1960 and came back regularly to repeat the experience. There was a riot in Cuernavaca in February 1957 after a police officer shot and killed Jorge Garrigós.[33] In 1966, Austrian priest Ivan Illich founded the Centro Intercultural de Documentación (CIDOC) to teach Spanish language and culture to North American missionaries. This center was closed by order of the Vatican in 1969,[33] but several of the teachers continued elsewhere in the city, making Cuernavaca a leading center of Spanish-language teaching for foreigners. More recently the city has seen a very active society dedicated to the preservation of its environment and cultural heritage. The Frente Civico which is now influential throughout the country, along with some 150 other organizations has promoted a boycott against Costco for having destroyed the Casino de la Selva to build a couple of warehouses. One of its members, Professor Jaime Lagunez, lobbied a general agreement in the national congress for the purpose of protecting its sixty archeological sites, its vegetation, historic center, and neighboring forests, among other important cultural aspects of the city.[34] The Frente Civico received the 2004 National Mendez Arceo Human Rights Award for having protected the world cultural heritage found in the city.[citation needed] 21st century [edit]The 19 September 2017 earthquake with a magnitude of 7.1 killed four people[35] and damaged or destroyed 180 homes, 11 churches, and 10 other Cuernavaca buildings, including the Cortés Palace, the cathedral, and the landmark Torre Latinoamericana, according to Fernando Manrique Rivas, general director of Protección Civil de Cuernavaca.[36] Cuernavaca instituted a curfew and possible arrest for 36 hours for violators during the COVID-19 pandemic in Mexico.[37] Open-air restaurants and bars were closed.[38] Mayor Antonio Villalobos Adan commented on 1 May that the city needs a new cemetery with capacity for 15,000 people, since the city's seven cemeteries are all saturated. It is already estimated that 40% of the population in the Antonio Barona neighborhood has been contaminated by COVID-19.[39] On 2 June, Cuernavaca reported 393 confirmed cases and 83 deaths from the virus; the reopening of the state was pushed back until at least 13 June.[40] Cuernavaca reported 1,322 cases, 1,015 recoveries, and 223 deaths on 31 August.[41] 2,566 cases were reported on 27 December 2020.[42] Four bottles of the Pfizer–BioNTech COVID-19 vaccine were stolen from \"Carlos Calero Elorduy Hospital\" run by SEDENA on 14 January.[43] This hospital plus the G. Parres general hospital, both dedicated to the care of serious COVID-19 cases, reached 100% capacity on 15 January 2021.[44] Points of interest [edit]Palace of Cortés [edit]The Palacio de Cortés is east of the Morelos Garden and is considered to be the most representative building of Cuernavaca.[45] Built by Hernán Cortés, it was finished in 1535. It is one of the oldest European-style, civil constructions in the Americas, but is executed in Renaissance style.[5] The series of arches of the central terrace, the battlements, and the thick walls are the most representative aspects of the original construction. It is said that this residence looks much like the mansion built in Santo Domingo by Diego Colón, the son of Christopher Columbus. Just outside the front of the building is an old pyramid base over which Cortés had the structure built,[45] on a hill that dominated the old city.[46] Petroglyphs recovered from the site and from throughout the city are on display. From right to left the petroglyphs are named Lagarto de San Antón, Aguila de Chapultepec, Piedra Chimalli, or Piedra de los Encantos.[45] After having been the residence of Cortés and his descendants for several centuries, the building became a warehouse, a jail, a military barracks, and then the State Government Palace (until 1969). From 1971 to 1973, the building was restored extensively and today houses the Museo Regional Cuauhnáhuac, dedicated to the history of Morelos State. It often is referred to as \"the Palacio of Cortes\". It has ten exhibit halls with maps, illustrations, photographs, works of art, and everyday items from various epochs representing the first human settlements in the state to the present day. It has murals created by Diego Rivera that reflect both Morelos and Mexican history.[45] Adjacent to the Palacio a permanent local handicraft market in which one may purchase silver jewelry, T-shirts, beaded bracelets, pottery, hammocks, blankets, and much more.[47] Morelos and Juárez Gardens [edit]The Juárez and Morelos Gardens are in the center of the city, both of which are plazas lined with trees. Between the two is the State Government Palace, a three-story building with a tezontle façade built between 1955 and 1969. The Morelos Garden dates from 1908 and is easily recognizable by the large stone statue of José María Morelos, which is known colloquially as \"Morelotes\". The Juárez Garden is located to the north of the State Government Palace and is the oldest public square in Cuernavaca.[45] The Garden contains a kiosk sometimes said to be designed by Gustave Eiffel[48][49] and brought from Britain toward the end of the 19th century.[46] Unlike most main squares in Mexico, neither of these open up the way to the main cathedral. The main cathedral in Cuernavaca is located a few blocks west of the square.[45] These two gardens or plazas are known colloquially as the \"zócalo\". Spectacles are often to be seen here and can include people dancing the \"danzón\" or other popular dances[46] and \"estudiantinas\" dressed in colonial-era Spanish garb, playing instruments and dancing, and any number of free concerts. Often clowns perform on the zocalo as well, with balloons and tricks for the children and tell double-entendre jokes for the adults. Locals use the plazas to sell products such as honey, yogurt, traditional candies, and crafts. Street food such as corn on the cob, snow cones, candies, fruit smoothies, and more generally are available.[47] Cathedral [edit]Cuernavaca Cathedral is the main church of what was the monastery of the Third Order of the Franciscans, called La Asunción, that dates back to the 16th century.[45] It sits on the southeast corner of a large atrium, which also contains a number of other chapels that were built at different times and with different architectural styles.[5][46] This complex is located at the intersection of Hidalgo and Morelos streets, a few blocks west of the town center.[45] The cathedral was built by Cortés to double as a fortress, with cannons mounted above the buttresses.[3] Over time, this church underwent a number of transformations, updating its interior. This was undone in the mid-20th century, when restoration work removed all the Neoclassical altars and images. These now are stored in the cathedral's pinacotheca and not available to the public. Restoration work uncovered al fresco murals on the lateral walls, relating to the martyrdom of Philip of Jesus, the first Mexican canonized as a saint. The only other decoration inside this church now is a modern-style crucifix and an image of the Assumption of Mary. This restoration work was carried out by Bishop Sergio Méndez Arceo.[46] After the Reform Laws in the 1860s, most of the monastery property passed into state, then private hands, leaving only what is now the cathedral and several smaller chapels on a very large atrium. The Revolution Garden was the orchard of the Cathedral,[46] and the cloister with its observatory, is now the Robert Brady Museum.[3] The church became the Cathedral of Cuernavaca in 1891.[5][45][46] Next to the cathedral is the \"open chapel\" (capilla abierta) of San José, which is an original structure built in the 16th century. It also was rescued and restored by Bishop Méndez Arceo and is one of the oldest constructions on the site. The building consists of a vault with three arches that face the atrium. These arches are supported by a pair of flying buttresses. Inside the arches is an altarpiece dating from the 17th century.[5][46] The main entrance is on Hidalgo Street, where one passes between two large chapels called the Chapel of Santa Cruz and the Chapel of the Tercera Orden. The Tercera Orden is considered to be the more valuable artistically of the two, with its highly sculpted early Baroque main and side portals painted in various colors. Inside, there is a later Churrigueresque main altar. A third chapel, called the Chapel of Nuestra Señora de los Dolores is farther into the atrium and near the Open Chapel of San José.[45] The bell tower was added in 1713. The cathedral was damaged during the September 2017 earthquake, but it has since been restored.[50][51] Other churches of interest [edit]- Parish of Nuestra Señora de Guadalupe (El Sagrario) was built as a family chapel by Manuel de la Borda in the 18th century. The façade is Baroque, but it has greatly deteriorated in recent years due to acid rain. The cupola is particularly noteworthy.[52] - Parish of Los Tres Reyes Magos in Tetela was built in the 16th century by Franciscan monks. It is Baroque style, and there is a fresco inside painted by Marcos Aldaña. The stone fence around the perimeter of the church was designed by British sculptor John Spencer in the 1980s.[53][54] - El Calvario refers to two buildings just north of the Historic Center of Cuernavaca. The smaller is a chapitel (open-air chapel) built in 1538 at what was then the entrance to the city. It gets its name from the cross on top. There is a fountain in front called Fuente de los Leones or Fuente de las Ranas. In 1772 the chapitel was dedicated to the Virgin of Guadalupe, and there is a large fair every 12 December. The larger building is the church of San Jose, built in 1939.[55][56] - The Church of Tepetates, built in the 16th century at the time of the conquest of Cuauhnáhuac, was named after the type of soil found in the area. It is located off Guerrero Street in the old district of Tecoac, which was one of the five neighborhoods that made up the center of the City of Cuernavaca. For years it was the symbol of the city due to its picturesque façade flanked by two cypresses. This temple is designed in neoclassic style, dedicated to Jesus of Nazareth. The church a small atrium, an open chapel, and a nave in addition to two bells that date from 1791. Fr. William Wasson founded the orphanage Nuestros Pequeños Hermanos here in 1954.[57] It is believed the church was built upon a teocalli (Prehispanic temple).[58] - Santuario de Tlaltenango. Temple of San José is said to be the first church built in the American continent (1523) on the grounds of Hernán Cortés's hacienda. Next to this is the larger Sanctuary of Our Lady of Tlaltenango built in honor of the \"Virgin of Miracles\" in 1730. The largest belltower in Morelos was built in 1886. There is a large street fair every 8 September.[58] A few blocks away is the Chapel of San Jerónimo, built during the second half of the 16th century, for the common people since masses in the Church of San José were officiated only for the wealthy.[59] - Parish of St. John the Apostle, built in the 18th century (Chapultepec). There is an image of el Señor de las Batallas, a representation of Christ as a soldier in honor of soldiers from the State of Morelos.[60][61] - Parish of San Luis Obispo (Amatitlan), built in the 17th century. The church is run by Franciscans.[62][63] - Parish of San Miguel Arcangel, built in the 18th century. (Acapantzingo)[64] - Church of San Nicolás Tolentino, built in the 16th century. (Ahuatepec). On the right side of the church there is a mausoleum with the remains of the revolutionary general Antonio Barona, companion of Emiliano Zapata, who was killed by rival general Genovevo de la O.[65] - Church of San Lorenzo Mártir, built in the 16th century. (Chamilpa)[66] - Church of El Divino Salvador a Baroque church built by Franciscans in the 16th century (Ocotepec).[67] During the 1914 Siege of Cuernavaca, the people of the town donated the bells so they could be melted down and used as cannonballs.[68] Just east of Ocotepec is the Benedictine monastery of Nuestra Señora de los Angeles designed by Gabriel Chávez de la Mora. The chapel is round and is used for Catholic retreats.[58] There are a number of non-Catholic churches in Cuernavaca also, notably the Episcopal Cathedral of San Miguel Arcángel located at the corner of Calles Guerrero and Santos, Centro Historico. - Teopanzolco, Aztec, date from the Middle to Late Postclassic Period (1300-1521) - Cuernavaca Cathedral and Convent, built in 1529-late 17th century, by the Franciscans. A UNESCO WHS.[69][70][71] - Chapel of Santa María, chapel of the Cuernavaca Cathedral - Asunción de María y San José Parish, built in the 16th century.[84] - Museo Fotográfico de Cuernavaca (El Castillito), house built in early 20th century. - Museo de Arte Indígena Contemporáneo, building built in 17th century.[85] Teopanzolco [edit]Teopanzolco is an archeological site located just east of the historic downtown of Cuernavaca. Until recently its construction was dated to the year 1427, but new evidence revealed by 19 September 2017 earthquake suggests the original structure was built between 1150 and 1200 CE.[86][87] Teopanzolco was an important ceremonial center during the 15th and 16th centuries when the native Tlahuicas were dominated by the Aztecs. The site shows significant Aztec influence. It has a large pyramidal base, called the Gran Basamento, topped by two shrines, much like the Templo Mayor in Tenochtitlan. In fact, the new finds indicate that Teopanzolco predates the Templo Mayor and served as a model for the latter.[88] Only the stone columns of these shrines remain today. The teocalli, (sacred plaza) contains fourteen monuments including a circular altar dedicated to the wind deity Ehécatl. There are also two concentric structures separated by a moat or ditch. Both might have been dedicated to Quetzalcoatl, the feathered-serpent deity, or to Tlāloc, god or rain. The ruins were discovered during the Siege of Cuernavaca in 1914 as the Zapatistas used the heights to place their cannons.[89] Centro Cultural Teopanzolco [edit]The Cultural Center next to the pyramids has recently been remodeled and now includes several first-class concert halls. There is outside seating facing the pyramids where one can see a video mapping of the pyramid site (Spanish only).[90] centro-cultural-teopanzolco/ English (Retrieved Dec 16, 2016) Borda Garden [edit]The Borda Garden is located near the cathedral on Morelos Street. Originally, this was a house bought by José de la Borda, the mining magnate of Taxco in the mid-18th century. Later, his son, Manuel de Borda y Verdugo, transformed the grounds of the house into gardens filled with flower and fruit trees to satisfy his passion for botany.[citation needed] These gardens also contain a number of fountains and an artificial lake that were completed in 1783. Today the complex contains an art gallery, offices, a restaurant, and an open-air theater. In 1865, this was the summer home of Emperor Maximilian I and his wife Carlota Amalia. Some sources say the emperor met his mistress, \"La India Bonita\", there, (although other sources say they met at his home called \"El Olindo\" in Acapantzingo.)[91][92] In the late 19th and early 20th centuries the Borda Garden sponsored soirees, such as those sponsored by Porfirio Díaz and Emiliano Zapata. Today the area is a public park where the gardens have been maintained and it is possible to take a short boat ride on the lake. The house has been converted into a museum. Six of its halls are dedicated to temporary exhibits while the other seven are devoted to recreating the characteristics of the 18th and 19th centuries.[45] The Church of Nuestra Señora de Guadalupe is located next to the Borda Garden, and was constructed by Manuel de la Borda in 1784. It has a Baroque façade and what is considered to be the best cupola in the city. It was the royal chapel of Emperor Maximilian.[45] The cupola was badly damaged in the earthquake of 2017.[93] Robert Brady Museum [edit]The Robert Brady Museum is on Nezahualcoyotl Street and occupies the building known as the Casa de la Torre, originally part of the monastery of La Asunción.[45] In 1960, it was purchased by the U.S. artist, Robert Brady, who transformed it into his home and a private art and collectible museum.[3] It contains a collection of art and crafts from around the world as well as the original Self-Portrait with Monkey painted by Frida Kahlo. Other works are by artists such as Miguel Cobarruvias, Pelegrí Clavé, María Izquierdo, and Rufino Tamayo. Non-Mexican paintings include those from North America and Europe. Other objects in the collection include antique furniture, African and Indian crafts, and archeological pieces.[46] The collection occupies fourteen rooms of the old house, which has been kept mostly the way it was when Brady died in 1986 and bequeathed the house and its contents to the city.[3][45] Tlaltenango [edit]Tlaltenango used to be a separate town, but now is a neighborhood of Cuernavaca city. The main attraction there is the church compound containing the Church of San José and the Church of Nuestra Señora de los Milagros de Tlaltenango. San José is one of the oldest churches in Mexico, built between 1521 and 1523. Two centuries later an image of the Virgin appeared to members of this village, prompting the building of the second church. This is the Sanctuary of Nuestra Señora de los Milagros, which was built in 1730, with its bell towers built at the end of the 19th century.[45][46] Hacienda Atlacomulco [edit]The Hacienda de San Antonio Atlacomulco is located south of the Cuernavaca and was established by Hernán Cortés as one of the first sugar plantations in Mexico. Descendants of the Conquistador held the property until the 19th century, when it became the property of Lucas Alamán, who modernized the facility. The hacienda lost its surrounding properties during the Mexican Revolution and all that remains is the main house. After a long period of restoration and modification, the hacienda today houses an exclusive hotel, which can accommodate conventions and banquets.[45][46] Museum of Traditional and Herbal Medicine and the Ethnicbotanical garden [edit]South of the city center is Acapantzingo, which had been a separate town, but now is part of the city. A large farm owned by Emperor Maximilian I existed there in the 1860s. It was named Olindo, referring to a character in the poem by Torquato Tasso.[45] The emperor used this property as one of his residences in Cuernavaca, and according to rumor, to enjoy the company of a certain beautiful Indian woman.[46] On this farm and in what was the Pavilion, is now the Museum of Traditional and Herbal Medicine (Museo de Medicina Tradicional). The museum sponsors workshops and classes on the use of plants to make soap, cremes, dyes, decorative objects and more. Outside is the ethnicbotanical garden with exhibits including 800 species of plants organized by uses, such as the making of textiles, animal feed, condiments, ritual, and others.[45] Children's \"Kite\" Museum [edit]Located on Avenida Vicente Guerrero 205, Colonia Lomas de Selva is the Papalote Children's Museum an interactive children's museum with up to thirty exhibitions and artistic experiences for children, such as a bed of nails, Vincent van Gogh room, Lego, garden, sandbox, bubble factory, and others. Some exhibits are even for "
}