{
  "url": "https://iskconbrasil.com/index.php/o-que-e-o-vaishnavismo/",
  "title": "O que é o Vaishnavismo? – ISKCON Brasil",
  "text": "O Vaishnavismo é uma das principais tradições da cultura espiritual védica ou hindu mais ampla. Ao contrário de algumas tradições védicas, os Vaishnavas acreditam que a realidade última é pessoal. Assim, eles entendem que Deus é a pessoa Suprema e todo-atraente, ou Krishna. Eles reconhecem que todos os seres vivos são pessoas eternas e que todos os problemas da vida estão enraizados no esquecimento da alma individual da sua relação com Deus. Os Vaishnavas ensinam que ao cantar os nomes de Deus a alma pode redespertar seu conhecimento espiritual original, viver pacificamente nesta vida e retornar ao reino espiritual, ou Vaikuntha, o lugar sem ansiedade, no momento da morte. Existem quatro sampradayas principais ou linhagens Vaishnava, todas baseadas originalmente na Índia. Os Vaishnavas adoram o Senhor Vishnu, o Senhor Rama e o Senhor Krishna como diferentes manifestações do mesmo Senhor Supremo ou de uma divindade suprema, embora os estilos de adoração e ênfase sejam diferentes. A tradição Vaishnava influenciou amplamente a cultura do Sul da Ásia através da música, dança, teatro e arte. A filosofia sincera e os textos poéticos sagrados do Vaishnavismo integram uma teologia profunda com um discurso social astuto. Os principais sastras, ou escrituras, Vaishnavas são os ensinamentos de Krishna no Bhagavad-gita, incluídos na obra mais longa, o Mahabharata), o Srimad Bhagavatam (um dos dezoito Puranas), o Ramayana e o mais recente Sri Chaitanya – Charitamrita do século 16.. A ISKCON faz parte da tradição Gaudiya, ou Chaitanya Vaishnava, que vem da região da Bengala da Índia. Os Gaudiyas dão ênfase especial aos ensinamentos do santo e avatar do século 16, Sri Caitanya Mahaprabhu. O Gaudiya Vaishnavismo, por sua vez, deu origem à Sociedade Internacional para a Consciência de Krishna (ISKCON), que foi fundada por Srila Prabhupada em 1966. Sua organização, ISKCON, aumentou a consciência e o crescimento do Vaishnavismo em todo o mundo desde o final dos anos 1960. Hoje, os ensinamentos Vaishnavas cruzaram todas as fronteiras geográficas e provaram ser relevantes no atendimento das necessidades essenciais da humanidade."
}