{
  "url": "https://en.wikipedia.org/wiki/Nutella",
  "title": "Nutella - Wikipedia",
  "text": "Nutella Nutella (UK: /nʌˈtɛlə/ nuh-TEL-ə, US: /nuːˈtɛlə/ ⓘ noo-TEL-ə,[1] Italian: [nuˈtɛlla]; stylized in all lowercase) is a brand of sweetened hazelnut cocoa spread.[2][3][4] Nutella is manufactured by the Italian company Ferrero and was introduced in 1964, although its first iteration dates to 1963.[5] History [edit]Pietro Ferrero owned a bakery in Alba, an Italian town known for the production of hazelnuts. In 1946, he sold the initial 300-kilogram (660 lb) batch of Pasta Gianduja, derived from gianduja. Originally sold as a solid block, Ferrero started to sell a creamy, spreadable version in 1951 as Supercrema gianduja.[6][7] In 1963, Ferrero's son Michele Ferrero, alongside Francesco Rivella, revamped Supercrema gianduja with the intention of marketing it throughout Europe. Its composition was modified, and it was renamed \"Nutella\". The first jar of Nutella left the factory in Alba on April 20, 1964. The product was an instant success.[8] Nutella's global proliferation took place during Italy’s post-war economic boom (the Italian economic miracle). Popular both among children and adults, leftists held it in esteem as the Italian response to the American peanut butter.[9] In 1983, Nutella was released in America for the first time.[7] In 2012, French senator Yves Daudigny proposed a tax increase on palm oil from €100 to €400 per tonne. At 20 percent, palm oil is one of Nutella's main ingredients, and the tax was dubbed \"the Nutella tax\" in the media.[10] That year, Ferrero settled a class action lawsuit in the US that alleged their advertisements misrepresented Nutella's healthiness by paying $3 million and removing advertising featuring the health claims.[11] On 14 May 2014, Poste Italiane issued a 50th anniversary Nutella commemorative stamp.[12][13] The 70 Euro cent stamp was designed by Istituto Poligrafico e Zecca dello Stato and features a jar of Nutella on a golden background.[12] Ferrero held a Nutella Day on 17 and 18 May to celebrate the anniversary.[14] Ingredients [edit]The main ingredients of Nutella are sugar and palm oil (greater than 50%). It also contains 13% hazelnuts,[16] cocoa solids, and skimmed milk.[17] In the United States and the United Kingdom, Nutella contains soy products.[18] Nutella is marketed as \"hazelnut cream\" in many countries. Under Italian law, it cannot be labelled as a \"chocolate cream\", as it does not meet minimum cocoa solids concentration criteria. Each 220g jar of Nutella uses approximately 50 hazelnuts.[19] Ferrero uses 25 percent of the global supply of hazelnuts, though not all of this is used exclusively in Nutella.[20] In November 2017, the company modified the recipe slightly, increasing the sugar and skimmed milk powder content.[21] Since the colour of the product is lighter in tone, the Hamburg Consumer Protection Center estimated that the cocoa content was also reduced.[22] The traditional Piedmont recipe, gianduja, is a mixture containing approximately 71.5% hazelnut paste and 19.5% chocolate. Nutella was developed in Piedmont, Italy, due to a lack of cocoa beans after post-war rationing reduced the availability of the raw material.[23] Processing [edit]Nutella is described as a chocolate and hazelnut spread,[24][25] although it is mostly made of sugar and palm oil. The manufacturing process for this food item is very similar to a generic production of chocolate spread. Nutella is made from sugar, modified palm oil, hazelnuts, cocoa powder, skimmed milk powder, whey powder, soy lecithin, and vanillin.[26][27] The process of making this spread begins with the extraction of cocoa powder from the cocoa bean. These cocoa beans are harvested from cocoa trees and are left to dry for about ten days before being shipped for processing.[28] Typically, cocoa beans contain approximately 50 percent of cocoa butter; therefore, they must be roasted to reduce the cocoa bean into a liquid form.[28] This step is not sufficient for turning cocoa bean into a chocolate paste because it solidifies at room temperature and would not be spreadable. After the initial roast, the liquid paste is sent to presses, which are used to squeeze the butter out of the cocoa bean. The final products are round discs of chocolate made of pure compressed cocoa. The cocoa butter is transferred elsewhere so it can be used in other products. The second process involves the hazelnuts. Once the hazelnuts have arrived at the processing plant, a quality control is issued to inspect the nuts so they are suitable for processing. A guillotine is used to chop the nuts to inspect the interior.[29] After this process, the hazelnuts are cleaned and roasted. A second quality control is issued by a computer-controlled blast of air, which removes the bad nuts from the batch.[29] This ensures that each jar of Nutella is uniform in its look and taste. Approximately 50 hazelnuts can be found in each jar of Nutella, as claimed by the company.[30] The cocoa powder is then mixed with the hazelnuts along with sugar, vanillin and skim milk in a large tank, until it becomes a paste-like spread.[28] Modified palm oil is then added to help retain the solid phase of the Nutella at room temperature, which substitutes for the butter found in the cocoa bean. Whey powder is then added to the mix to act as a binder for the paste. Whey powder is an additive commonly used in spreads to prevent the coagulation of the product, because it stabilizes the fat emulsions.[31] Similarly, lecithin, a form of a fatty substance found in animal and plant tissues, is added to help emulsify the paste, as it promotes homogenized mixing of the different ingredients, allowing the paste to become spreadable. It also aids the lipophilic properties of the cocoa powder, which, again, keeps the product from separating.[30] Vanillin is added to enhance the sweetness of the chocolate. Nutrition [edit]Nutella contains 10.4 percent of saturated fat and 58% of processed sugar by weight. A two-tablespoon (37-gram) serving of Nutella contains 200 calories, including 99 calories from 11 grams of fat (3.5 g of which are saturated) and 80 calories from 21 grams of sugar. The spread also contains 15 mg of sodium and 2 g of protein per serving (for reference a Canadian serving size is 1 tablespoon or 19 grams).[32][33] Production [edit]Nutella is produced in various facilities. In the North American market, it is produced at a plant in Brantford, Ontario, Canada[34] and more recently in San José Iturbide, Guanajuato, Mexico.[35] For Australia and New Zealand, Nutella has been manufactured in Lithgow, New South Wales, since the late 1970s.[36] Two of the four Ferrero plants in Italy produce Nutella, in Alba, Piedmont, and in Sant'Angelo dei Lombardi in Campania.[37] In France, a production facility is located in Villers-Écalles.[38] For Eastern Europe (including Southeast Europe, Poland, Turkey, Czech Republic and Slovakia) and South Africa, it is produced in Warsaw and Manisa. For Germany and northern Europe, Nutella is produced at the Ferrero plant in Stadtallendorf, which has been in existence since 1956.[39] Nutella entered the Russian market and also has a production plant in Vladimir.[40] Ferrero also has a plant in Poços de Caldas, Brazil, which supplies the Brazilian market, with part of the production being exported overseas.[41] It is also manufactured in Turkey and exported to countries such as India. Global production in 2013 was about 350,000 tonnes.[42] As of 2015, it was sold in 75 countries.[7] Use [edit]In Italy, one of the most common ways to consume it is by spreading it on slices of filone (a typical Italian loaf bread) or between two or more slices of sandwich bread (pancarrè e Nutella). These two uses are very typical among Italian children as an afternoon snack or during school recess. It is also traditionally used as a filling in cornetti, bomboloni, and crepes, or in recipes such as sbriciolona alla Nutella and nutellotti, soft cookies with a warm Nutella center.[citation needed] Within Europe, Nutella is a popular topping for pancakes among children in Ireland,[43] often fills the peach-shaped breskvice cookies in Croatia, replacing the traditional jam[44] and is spread atop baguettes in France, creating open sandwiches eaten with coffee for breakfast.[45] Outside of Europe, Nutella is used to fill sandwiches in Senegal, which are then eaten as an afternoon snack.[46] See also [edit]References [edit]- ^ Eleftheriou-Smith, Loulla-Mae (21 September 2015). \"The correct way to pronounce Nutella in the UK is 'nut-ella', 'new-tell-uh' is just for America\". The Independent. - ^ Ayto, John (2013), \"Nutella\", The Diner’s Dictionary, Oxford University Press, doi:10.1093/acref/9780199640249.001.0001, ISBN 9780199640249, retrieved 2019-03-17 {{citation}} : CS1 maint: work parameter with ISBN (link) - ^ \"Michele Ferrero | Italian industrialist\". Encyclopedia Britannica. Retrieved 2019-03-17. - ^ \"Nutella hands £4m job to Krow ahead of relaunch\". Brand Republic News. August 22, 2007. Retrieved March 18, 2011. - ^ Mitzman, Dany (17 May 2014). \"Nutella: How the world went nuts for a hazelnut spread\". BBC News Magazine. Retrieved 18 May 2014. - ^ Carridice, Adriel. \"The History of Nutella (3)\". NutellaUSA.com. Archived from the original on 18 May 2015. Retrieved 2013-01-28. - ^ a b c Hilliard, Emily (2015). \"Nutella\". In Goldstein, Darra (ed.). The Oxford Companion to Sugar and Sweets. Oxford University Press. pp. 487–488. ISBN 978-0-19-931339-6. - ^ Carridice, Adriel. \"The History of Nutella (2)\". NutellaUSA.com. Archived from the original on 21 October 2015. Retrieved 2013-01-28. - ^ Kostioukovitch, Elena (2010). Why Italians Love to Talk About Food. London: Duckworth Books. p. 96. ISBN 978-0-330-42522-3. - ^ Willsher, Kim (2012-11-12). \"France's 'Nutella amendment' causes big fat international row\". The Guardian. Retrieved 22 November 2012. - ^ Tepper, Rachel (2012-04-26). \"Nutella Lawsuit: Ferrero Settles Class-Action Suit Over Health Claims For $3 Million\". Huffington Post. Retrieved 27 April 2012. - ^ a b \"Nutella diventa un francobollo\" [Nutella becomes a stamp]. Yahoo! Finance (in Italian). 14 May 2014. Retrieved 18 May 2014. - ^ Amabile, Flavia (15 May 2014). \"I nostri primi 50 anni con la Nutella\" [Our first 50 years with Nutella]. La Stampa (in Italian). Retrieved 18 May 2014. - ^ \"Nutella ha 50 anni, arriva anche un francobollo\" [Nutella is 50 years old, a stamp is introduced]. ansa.it (in Italian). Agenzia ANSA Società Cooperativa. 17 May 2014. Retrieved 18 May 2014. - ^ Dewey, Caitlin (16 January 2017). \"How Nutella plans to 'trick' you into thinking it's healthier than it is\". The Sydney Morning Herald. Retrieved 21 February 2023. Unlike most peanut or almond butter, Nutella is composed largely of sugar and palm oil; hazelnuts are its distant third ingredient. - ^ \"Nutella – Breakfast for Champions?\". Greenpeace.org. May 28, 2008. Retrieved March 18, 2011. - ^ \"Nutella Jar Ingredients\". FoodWatch. - ^ \"Nutella and Nutrition: Food Pyramid and Guidelines\". NutellaUSA.com. Archived from the original on 2015-08-20. Retrieved 2013-01-28. - ^ \"8 Facts about Nutella that You Probably Didn't Know\". Essential Italy. Retrieved 2025-04-19. - ^ Narula, Svati Kirsten (14 August 2014). \"A frost in Turkey may drive up the price of your Nutella\". Quartz. Atlantic Media. Retrieved 14 August 2014. - ^ LaVito, Angelica (November 8, 2017). \"Nutella's new recipe sparks #NutellaGate Twitter backlash\". CNBC. - ^ Squires, Nick (November 7, 2017). \"Nutella fans go nuts over changes to recipe of beloved chocolate spread\". The Telegraph. Archived from the original on 2022-01-12. - ^ Carridice, Adriel. \"The History of Nutella (1)\". NutellaUSA.com. Archived from the original on 12 September 2015. Retrieved 2013-01-28. - ^ Smithers, Rebecca (November 7, 2017). \"Choc horror: fans outraged by Nutella's secret recipe change\". The Guardian. - ^ Akhtar, Khalil (April 4, 2017). \"Hard nut to crack: The quest to make Nutella a bit more Canadian\". CBC News. - ^ \"Deconstructed Nutella: nuts, cocoa – and 58 % sugar\". The Guardian. January 20, 2017. - ^ Peterson, Hayley (February 17, 2016). \"Many parents are terrified to feed their kids Nutella\". Business Insider. - ^ a b c \"How is Nutella Made\". Wanttoknowit.com. 28 December 2011. - ^ a b Triwood1973 (25 May 2008). \"Chocolate Spread : How Its Made\". Archived from the original on 2021-11-07 – via YouTube. {{cite web}} : CS1 maint: numeric names: authors list (link) - ^ a b \"Nutella Australia\". - ^ \"Whey Powder\". Milkingredients.ca. 13 December 2013. - ^ \"Nutella settles lawsuit from angry mom, drops health claims\". CTV News. 27 April 2012. Archived from the original on 2020-11-12. Retrieved 2013-08-29. - ^ \"Nutrition Facts and Analysis for Chocolate-flavored hazelnut spread\". NutritionaData. Retrieved 2008-11-09. - ^ \"Frequently Asked Questions\". Nutella.ca. Ferrero Canada Limited. Archived from the original on 2013-11-25. Retrieved 2012-11-26. - ^ \"Abre Ferrero primera planta en México\". Reforma. Retrieved 2015-06-07. - ^ \"Ferrero Australia History\". Ferrero Australia. Archived from the original on 2012-10-27. Retrieved 2012-11-26. - ^ \"Stabilitmenti\". Ferrero Italia SpA. Archived from the original on 2018-03-06. Retrieved 2012-11-26. - ^ \"Où nous trouver\". Ferrero France. Archived from the original on 2012-12-24. Retrieved 2012-11-26. - ^ \"produktion\". offizielle Website von Ferrero Deutschland. Archived from the original on 2014-05-21. Retrieved 2016-11-04. - ^ \"Ferrero prepares for major multi-million expansion in Russian markets\". Confectionery Production. 22 October 2018. Retrieved 15 April 2019. - ^ \"A história\". Ferrero do Brasil. - ^ Amoroso, Ludovico (14 May 2014). \"Nutella festeggia i suoi primi 50 anni e chiude le porte di Piazza Affari\". La Repubblica. Retrieved 30 November 2016. - ^ Mac Con Iomaire, Máirtín (2011). \"Ireland\". In Albala, Ken (ed.). Food Cultures of the World Encyclopedia. Vol. 4: Europe. California: Greenwood. p. 203. ISBN 978-0-313-37626-9. - ^ Foss, Richard (2011). \"Croatia\". In Albala, Ken (ed.). Food Cultures of the World Encyclopedia. Vol. 4: Europe. California: Greenwood. p. 78. ISBN 978-0-313-37626-9. - ^ Abramson, Julia (2011). \"France\". In Albala, Ken (ed.). Food Cultures of the World Encyclopedia. Vol. 4: Europe. California: Greenwood. p. 116. ISBN 978-0-313-37626-9. - ^ Yount, Chelsie (2011). \"Senegal\". In Albala, Ken (ed.). Food Cultures of the World Encyclopedia. Vol. 1: Africa and the Middle East. California: Greenwood. p. 157. ISBN 978-0-313-37626-9. Further reading [edit]- Padovani, Gigi (2014). Mondo Nutella. 50 Anni di Innovazione [Nutella World: 50 Years of Innovation] (in Italian). Milan: Rizzoli Etas. ISBN 978-88-17-07167-3."
}