{
  "url": "https://techcommunity.microsoft.com/blog/microsoftteamsblog/what’s-new-in-microsoft-teams--microsoft-ignite-2024/4287538",
  "title": "What’s New in Microsoft Teams | Microsoft Ignite 2024 | Microsoft Community Hub",
  "text": "Welcome to Ignite 2024! We’re excited to share a LOT of really innovative and useful new features with you. Getting everything ready to present at Ignite keeps us incredibly busy this time of year, as you might imagine. But it’s also a time when I find myself reflecting on the impact that all of these Teams features that we’re about to highlight can have on so many different aspects of work. I’m continually impressed that with each update, collaboration in Teams gets smoother, and new Copilot features help me be more productive, and work smarter and faster. This year’s additions to Teams move the bar even further as they support a richer flexible working experience and harness the power of AI to help you do more. There’s exciting news to share in every one of our categories, and I hope you’ll scroll through the healthy list of updates below, and let us know which ones you think will benefit you the most. Or if you’d like, jump to your favorite category first: - Microsoft Places - Chat and Collaboration - Meetings, Mesh in Teams, Webinars and Town Halls - Teams Rooms and Devices - Teams Phone - Teams Fundamentals - Frontline Worker Solutions Microsoft Places One of the most exciting products being announced at this year's Ignite is Microsoft Places, an AI-powered workplace solution for flexible work available with a Teams Premium license. Places alongside Microsoft 365 Copilot and Microsoft Teams make up the AI-powered workplace, solutions reimagining flexible work in a way that empowers every employee to achieve their best outcomes. Places intelligently allows you to coordinate your hybrid team to make the most of in-office days, modernize how employees make connections, and optimize space management with occupancy and utilization data. Recommended in-office days with Copilot: Generally available now Deciding whether to go to the office depends on your in-person meetings and who else plans to be there. Copilot in Places makes this decision easier by recommending if today is a good day to come into the office based on your scheduled in-person meetings, your coworkers’ planned attendance, and any leader guidance that exists. Managed booking with Copilot: Generally available now With schedules and meetings constantly shifting, avoid the frantic rush to update your room booking at the last minute. Places goes beyond a simple booking app, using Copilot to help you manage room bookings. Regardless of shifting schedules, Copilot will ensure you always have the right space to work. Places finder: Generally available now All meeting rooms and desks are not created equal. Save yourself time figuring out which room or desk has the space and technology you need using Places finder, your booking helper. Workplace presence: Generally available now No more missed connections when you and your colleagues are in the office. Seamlessly coordinate meetings, teamwork, and connections with workplace presence. Your workplace presence updates with your work plan and includes an automatic update of your location to “office” when connecting your laptop to a monitor at an in-office desk or peripheral in a bring your own device (BYOD) room. Users have control of this feature and can also update their workplace presence manually to set where they are. See who is nearby in 1:1 or group chats to easily coordinate lunch, brainstorming sessions, or in-person meetings. You can find location information on your colleagues’ profile card or in the participant list in group chats. In 2025, workplace presence will automatically update with Wi-Fi signals. Space analytics with Copilot: Generally available now Optimizing space for a hybrid workforce is difficult if you don’t have visibility into how often employees are coming into the office and what spaces are actually being used. Make better space decisions with occupancy and utilization insights and Copilot recommendations from intent data, check-ins, and device signals, with space analytics. Make sure your workplace is working for your employees. Team guidance: Generally available now Trying to create the right in-person cadence for your team is challenging. Find the best work patterns for your team with team guidance, which identifies a purpose for team days in the office. Meet the needs of the group by working with team guidance to establish expectations and adjust the rhythm. Quick book: Generally available now Forgetting to book meeting rooms for the day leads to a last-minute rush to book. For in-office meetings without a room booked, Places will prompt you to book rooms and offer recommendations from the Places card. View suggested rooms for each meeting, and 'quick book' rooms in bulk for the day. Book a space for all your meetings all at once. Chat and Collaboration Copilot file summary in chat: Public preview in early 2025 When a file is shared in a chat, you don’t always have the time to open it, read through, and grasp the key ideas. With new file summaries in 1:1 and group chats in Teams, Microsoft 365 Copilot can quickly summarize content from Microsoft Word documents, PowerPoint presentations, and PDFs, so you can understand the main points without opening the file. This feature is also available on mobile, making it easier to grasp key ideas without reading an entire document on a small screen while on the move. It respects the file's security policies, ensuring that only users with access to the file receive a summary, which will carry the same sensitivity label as the original file. Storyline integrated in Teams: Public preview in early 2025 Employee communications are often scattered across multiple locations, leading to frustration, delays, and overload. Storyline in Teams empowers leaders to share communications with an entire company, and simplifies the ways you and your colleagues share and connect. The Storyline integration provides a new way to discover content, contribute your ideas and perspectives, and express yourself while staying in your flow of work in Teams. Integration of communities with Teams and much more is coming next year. The new chat & channels experience: Available now in public preview The new chat and channels experience is designed to help you collaborate more efficiently and effectively. It’s simple by default, enabling everyone to stay on top of what matters, and it’s powerful on demand, allowing you to organize information and communicate your way. Catch up on chat, channels and teams in one place, use filters to triage messages, create custom sections to organize conversations by topics, and more. Join hundreds of customers like Eaton, Vodafone, VML, Itaú Unibanco S/A and Kyndryl who are using the new chat and channels experience as part of the Teams private preview program. Learn more here. Loop workspace in a channel: Generally available in early 2025 Channels in Microsoft Teams streamline collaboration by bringing people, content, and apps together and helping to organize them by project or topic. You will be able to add a Loop workspace tab to standard channels enabling your team to brainstorm, co-create, collect, and organize content—together in real-time. Everyone in the Team gets access to the Loop workspace, even as Team membership changes, and the workspace adheres to the governance, lifecycle, and compliance standards set by the Microsoft 365 Group backing the team. To get started, click the plus sign (+) at the top of the channel and select Loop from the app list. Name pronunciation: Available now in public preview, generally available in early 2025 You can now record and share the correct pronunciation of your name, fostering inclusivity and ensuring colleagues pronounce names accurately. Simply open your profile card to make a recording. This recording will be accessible on your profile card to individuals at your workplace or school using Microsoft 365. With a single click, you can listen to your colleagues' name pronunciations. Skin tone setting for emojis and reactions: Generally available now The new skin tone setting for emojis and reactions in Teams lets you personalize your digital interactions by selecting a skin tone that best represents you. In your settings, you can choose from a range of skin tones. Once selected, this will be consistently applied across chat, channels and meetings as well as on various clients, allowing you to express yourself more authentically in conversations. Changing skin tone in Teams Settings > Appearance and accessibility in Teams for Desktop: Meetings, Mesh, Webinars, and Town Halls Copilot in Teams can analyze content shared on-screen: Public preview in early 2025 Maximize meeting insights with Microsoft 365 Copilot’s new ability to analyze content presented in Teams. Copilot’s ability to reason over any content shared on screen ensures that no meeting details are overlooked. Copilot provides a 360-degree view of meetings by analyzing spoken words, chat messages, and now, on-screen content. This comprehensive data enables users to ask Copilot to summarize or find specific information from screen-shared content (e.g., ‘Which products had the highest sales?’), consolidate insights across both the conversation and presentation (e.g., 'What was the feedback per slide?'), and draft new content based on the entire meeting (e.g., 'Rewrite the paragraph shared on the screen incorporating the feedback from the chat’). This works for any content shared while sharing your desktop screen (including but not limited to documents, slides, spreadsheets, and websites, irrespective of platform or app). Support for PowerPoint Live and Whiteboard in Teams will be available at a later date. Live transcription in Teams meetings support for multiple spoken languages: Generally available in early 2025 Meeting transcription will soon support multilingual meetings. When enabled, meeting participants can set their own spoken language and translation language, and the meeting transcript will capture the discussion regardless of languages spoken. Microsoft Teams supports 51 spoken languages and 31 translation languages. Live translated captions and live translated transcript will also support translation for multilingual meetings. Intelligent recap for calls from chat and ‘Meet now’ meetings: Generally available in December 2024 Soon, you will be able to enjoy AI-generated summaries for more types of meetings, even when they aren’t scheduled in advance. Intelligent meeting recap will be available for impromptu calls and meetings, like those started from ‘Meet now’ and calls started from chat. You can easily browse the recording by speakers and topics, as well as access AI-generated notes, AI-generated tasks, and name mentions after the ad-hoc meeting ends. This capability will be available for users with a Teams Premium or M365 Copilot license. Translated intelligent meeting recap: Generally available in 2025 Users will get an intelligent meeting recap automatically generated in the translation language they selected for the meeting. Users can also change the translation language of intelligent meeting recap from the Recap tab. Active meeting protection notifications of sensitive screenshared content: Public preview in early 2025 AI is powering entirely new screensharing protections. When a presenter is screen sharing content, active meeting protection automatically detects some types of information that are potentially sensitive, such as social security numbers and credit card numbers, and alerts both the presenter and the meeting organizer to prevent unintentional sharing. This capability will be available for users with a Teams Premium license. Meeting sensitivity upgrade notification based on shared file: Generally available in early 2025 For Microsoft 365 E5 and Premium customers, we’re making it easier to leverage sensitivity labels from Microsoft Purview Information Protection to help set the right protection settings to meetings. A meeting sensitivity upgrade can now be triggered when an attendee shares a file in a Teams meeting chat or during a live share that has a higher sensitivity setting. The meeting’s settings can be upgraded either automatically or via a recommendation to the organizer, to inherit the same sensitivity setting as the file shared in the meeting. Moderated meetings in Teams: Generally available in early 2025 Some organizations in regulated industries such as financial services are subject to restrictions around which employees can meet or communicate with each other. Moderated meetings gives organizations with Information Barrier (IB) tenants the option to allow users with conflicting policies to join the same meeting in the presence of an approved moderator. For meetings set up with this new feature, the organizer and co-organizers can only let in attendees after the approved moderator has joined the meeting. This capability will be available for users with a Teams Premium license. Email verification for external participants to join Teams meetings: Generally available in early 2025 Microsoft Teams now enhances the security and trustworthiness of your meetings with a new feature: email verification for external participants. This allows meeting organizers with a Teams Premium license to require external participants to verify their email addresses with a one-time passcode (OTP) before joining the meeting. Once verified, participants will appear in the meeting with an ‘email-verified’ label, offering a more reliable way for organizers to manage external participants. This enhancement ensures that email-verified users enjoy a better in-meeting experience compared to unverified participants. Additionally, if an email-verified user joins the meeting with the email address to which the meeting invite was sent, they will bypass the lobby and be directly placed into the meeting, honoring the lobby bypass settings for invited participants. The external participant will show up in the meeting, roster, and chat with an 'email verified' tag, and their profile card will display the verified email address, ensuring organizers have participant information for follow-ups. For more information, see the article in the Microsoft tech blog. New admin policy to prevent bots from joining Teams meetings: Generally available now We’re introducing a new policy in Teams admin center that allows admins to block unwanted bots from joining meetings. The policy consists of two parts for optimal meeting security. First, admins can use the ‘External Access’ setting in Teams admin center to block known bot domains. Second, admins can enable a CAPTCHA-based human verification test and apply it to anonymous and non-federated users. Once set, any anonymous user that attempts to join the meeting will be required to pass the CAPTCHA test before proceeding. Learn more here. Support for SMS text notifications to attendees in Microsoft Bookings app: Generally available now Microsoft Bookings users can now send SMS notifications for both customer-scheduled and staff-scheduled appointments, enhancing communication between organizations and customers. Customers can benefit from automated SMS confirmations, service details, updates, and reminders, ensuring they never miss an appointment. Previously available only for Virtual Appointments and Bookings customer scheduled appointments, this premium feature now extends to all Bookings appointments. These capabilities are generally available to users with a Teams Premium license in the US, UK, and Canada. SMS notifications will expand to the Netherlands in December 2024. For more information on Microsoft Bookings and its premium features, see the article in the Microsoft Teams blog. Intelligent meeting recap available for Microsoft 365 GCC High: Generally available now Intelligent meeting recap is now available for Microsoft 365 GCC High environments. Intelligent meeting recap uses AI to provide a quick summary of your meetings, highlighting key discussion points, identifying follow-up actions, and offering quick access to significant points such as name mentions, when a screen was shared, individualized speaker markers, topics, and chapters. This capability will be available for users with a Teams Premium or M365 Copilot license. Disable copying of live captions, transcripts, and recap for meetings: Generally available in December 2024 We’re expanding the existing control called ‘Turn off copying or forwarding of meeting chat’ to include live captions, transcription, and meeting recap. With this change, meeting organizers with a Teams Premium license will see a control called ‘Turn off copying and forwarding of meeting chat, live captions, and transcript’ in the meeting options. When this control is enabled, meeting participants won’t be able to copy the meeting chat, live captions, live transcript, or any insights generated from intelligent meeting recap. New calendar experience in Microsoft Teams: Generally available now The calendar in Teams has been redesigned for reliability and familiarity—you can now enjoy the same calendar experience across Teams and Outlook, with integration of both Copilot and Places to help infuse intelligence into your time management. Copilot capabilities like draft an agenda and managed booking, and Places capabilities like recommended in-office days, Places finder, and Places card are all available in the new Teams calendar experience. In addition to Copilot and Places features, the new Teams calendar brings new capabilities to Teams like calendar sharing, month view, multi-day view, print support, filtering, support for multiple time zones, and more. You’ll find the ‘New calendar’ toggle at the top right of the calendar app in Teams. It only takes one click to upgrade to the new Teams calendar, and you can easily pick up and resume exactly where you left off in classic Teams calendar. Enhancements to iPad Teams calendar: Available now in public preview We’ve updated the iPad Teams calendar to leverage the iPad’s form factor and make the scheduling process more seamless for iPad users. Users will now enjoy a default 5-day work week view, with options to switch to agenda, day, and 7-day week views. Enhanced features include a join button for easy access to upcoming meetings, synced category colors from the desktop, and the ability to reschedule events by simply dragging and dropping. New expanded gallery view for minimized meeting window: Generally available now The new expanded gallery option enhances the meeting view that is shown to attendees and presenters while the main meeting window is minimized, making it easier to stay aware of meeting events. The single-tile meeting view normally shown when the meeting window is minimized, which shows the active speaker, has been enhanced with the option to expand to a gallery view which shows up to 4 meeting participants and a ‘Me’ video tile. When screensharing, the presenter meeting window appears in expanded gallery view by default, showing up to 4 participants in the meeting, a preview of the content being shared, and the presenter video, if the camera is active. Support for 50k attendees in a Town Hall: Generally available in December 2024 Organizers of town hall instances can now reach a wider audience in a single event with the expanded ability to host a maximum of 50,000 simultaneous attendees. This increase serves as a significant jump from the previous attendee cap of 20,000 for organizers with a Teams Premium license. The quality and stability of town halls will remain constant up to this new limit, providing high-quality and reliable content to participants. For events with more than 20,000 concurrent attendees, streaming chat and reactions are disabled for all attendees. Organizations can get support for audiences up to 50,000 concurrent attendees by reaching out to the Microsoft 365 Live Event Assistance Program (LEAP) for assistance. DVR capabilities for Town Hall on desktop and web: Public preview in December 2024 Digital Video Recording (DVR) functionality in town halls now enables event attendees to interact with an instance of a live streaming town hall in the same way they would a recorded piece of content, when viewing via desktop or web. This makes it easier to digest the content being presented, giving viewers the ability to pause and move forward or back within a town hall, navigate to any previously-streamed timestamp, and interact in other ways that make viewing a town hall more convenient. This feature is available for all town halls regardless of license assigned to the organizers. Event chat for Town Hall: Generally available now Previously in a town hall, only presenters and organizers could chat with each other. With this new update, attendees, presenters and organizers can now chat together during a town hall using the new event chat feature. Presenters and organizers can still chat privately during the town hall as well. Watermark in webinars: Generally available now The watermark capabilities available in meetings are now supported in webinars. Help deter data leaks with watermarking over attendee screen shares and video feeds. Watermarking provides each viewer’s email address on the screen as a watermark. This feature requires a Teams Premium license. Out of the box eCDN experience: Generally available now Microsoft eCDN now offers an out-of-the-box experience, providing a true zero-configuration eCDN solution. This saves IT admins and network engineers time by eliminating the need to upload and update subnet data. The feature prevents potential errors and offers advanced site and VPN detection, delivering near-zero cross-site traffic and traffic over VPN. This translates to improved peering efficiency and reduced rebuffering. Microsoft eCDN available in GCC: Generally available now Government Community Cloud (GCC) customers can now purchase the Microsoft eCDN SKU via the M365 Admin Center. Microsoft eCDN helps reduce bandwidth consumption during large live events, such as all-hands meetings and town halls, while delivering high-quality video. The solution works out of the box and requires no software or hardware installation. Embed support for Teams Town Hall: Generally available in November 2024 Users will be able to embed Teams town halls in the SharePoint sites they manage. This capability will allow town hall attendees to watch the event instance within a particular SharePoint site. Host and attendee interaction visibility for multi-room Mesh events: Generally available now Mesh event attendees can now see raised hands and reactions from attendees in other rooms during large, multi-room Mesh events. This creates a greater sense of audience feedback as a whole across all rooms in a Mesh event, and increases total audience engagement. Additionally, event hosts will now be able to move between all rooms in a multi-room Mesh event. Automatically generate avatars from photos: Generally available now Automatically generate personalized avatars from photos. Simply take or upload a photo of yourself, and our AI technology will generate a realistic digital avatar. This feature is available to all Teams customers with avatars enabled. Microsoft Mesh app on PC supports guest access for events: Generally available now Event organizers can invite guest users outside their organization to Mesh events, providing an opportunity for broader collaboration and networking. Guests can sign in to Mesh app to join events, participate in discussions, and experience the same interactive features as internal users. This feature only applies to Mesh environments from Microsoft. Microsoft Mesh app on Meta Quest supports hand interactions: Generally available now Microsoft Mesh app users on Meta Quest 2, 3, and Pro headsets can now use their hands to use the app, move around in event environments, and interact with objects. Motion controllers continue to be supported, and users can switch between using controllers or their hands while using the app. New collaborative Project Studio environment in Microsoft Mesh: Generally available now The Project Studio environment is a new space for immersive meetings and Mesh events. This space has been designed for synchronous teamwork and productivity for small groups to collaborate on content. Collaboration tools like whiteboards will be added to the environment as they become available. Teams Rooms and Devices Speaker recognition: Generally available for Teams BYOD rooms in early 2025 Now you can get intelligent recaps and maximum value from Copilot in any Teams meeting no matter where you meet. Participants in any meeting space who have securely enrolled their voice via Teams Settings, can be recognized by their voice and attributed in meeting transcripts with cloud-based speaker recognition, whether it has a Teams Rooms system deployed or not. Speaker recognition in a bring your own device (BYOD) room requires a Teams Premium license or Copilot for the meeting host. Learn more about speaker recognition and voice profiles. Dual display enhancements on Teams Rooms on Android: Generally available now Now you can enjoy an enhanced meeting experience in Teams Rooms on Android with dual display rooms that show up to 18 videos (3x3 on each screen) when no content is shared. This creates a consistent experience across Windows and Android-based Teams Rooms. Additionally, admins can remotely switch screens in dual display mode using device settings and the Teams admin center, resolving front-of-room display issues without needing physical intervention. Learn more about this release. Cloud IntelliFrame video feeds on Teams Rooms on Android and mobile devices: Generally available now You can now experience Cloud IntelliFrame, the video framing capability that enhances the visibility of people in the room for online meeting attendees, on Teams Rooms on Android and Teams Mobile (iOS and Android) devices when joining a meeting that has participants in a Teams Rooms on Windows. Learn more about Cloud IntelliFrame. Usage reports for bookable desks in the Teams Rooms Pro Management portal: Generally available in January 2024 Where your people choose to work is crucial information for space planning and management. Admins get more insight into how their desk pools are used, and when. Utilization, reservation, and occupancy data for bookable desks are visible in the Teams Rooms Pro Management portal. Learn more about the Pro Management portal. Auto-association of peripherals in BYOD rooms: Public preview in early 2025 Manually associating peripherals to rooms may feel like an endless task if your organization has several bring your own device (BYOD) spaces. IT admins will be able to streamline the process with this feature which utilizes meeting room invite data to automatically associate peripherals to that space. Learn more. AI assistant in the Teams Rooms Pro Management portal: Public preview in early 2025 Get on-demand answers to your in-the-moment questions about Teams device management while working in the Teams Rooms Pro Management portal. Save time and effort with an AI-powered assistant that can help answer “how to” product questions and provide data and insights specific to inventory in your organization’s environment. Teams Phone Survivable Branch Appliance (SBA) can now support outages for up to 7 days: Generally available now Survivable Branch Appliance enables users to continue placing and receiving PSTN calls in the event of a network outage. SBA relies on authentication tokens that are renewed daily. With this upcoming update, SBA will be able to use expired authentication tokens for up to 7 days. This will allow users to maintain connectivity for an extended period of time in the event of an outage. Availability timing for this update will vary depending on your Session Border Controller vendor. Learn more. Delayed simultaneous ring settings: Generally available in early 2025 For teams with shared call responsibilities, delayed simultaneous ring will ensure calls configure the intended recipient first, instead of notifying everyone the moment a call comes in. This helps reduce noise and minimizes distractions —especially for roles like delegates and customer service teams. Queues app available on Teams phone devices: Generally available in early 2025 As part of our continued investments in the Queues app for Microsoft Teams, we are extending the Queues app to be available on phone devices. This experience will help agents manage customer interactions directly from their Teams phone device. Agents will be able to opt in or opt out of queues and access call history, which includes details like customer names, phone numbers, call times, and actions taken during the call. This ensures agents have all the information they need at their fingertips, making it easier to provide personalized and effective customer service. Speed dial support on line keys: Generally available now To enhance the calling experience for high call volume users, you can configure quick access to your most frequently dialed contacts using line keys. Whether you’re in a busy office environment or multitasking across a variety of activities, having speed dial options readily available on your phone’s line keys can help improve efficiency and productivity. Collaborative call delegation on Teams phone devices: Available now in public preview, generally available in early 2025 Teams phone device users will soon be able to share access to their phone line with a specific group of users, without a structured delegation system. This enables group members to receive and initiate calls on behalf of others, enabling a simple and collaborative communication experience. Fundamentals Copilot in Teams admin center: Generally available next quarter Copilot in Teams admin center simplifies administrative tasks such as setting up protected meetings and assigning phone numbers to users. It also provides valuable insights into configured policies, helps troubleshoot poor meeting quality, and offers configuration recommendations. These features are designed to enhance and optimize the overall Teams experience. Brand impersonation phishing protection: Available now in public preview, generally available in November 2024 This feature helps IT admins identify if an external user is targeting their enterprise users by impersonating a brand commonly targeted by phishing attacks. It monitors initial contacts in chat with individual users, and notifies the user that the message may be spam or a phishing attempt. Block malicious users from your organization: Available now in private preview, generally available in December 2024 With this feature in Teams, you can prevent users in your organization from collaborating with specific people outside the organization. Admins can now set up a list of users that are blocked from collaborating with their organization. If a user is added to the block list, people in your organization will not be able to have 1:1 and group chats with these users. If chats already exist before a user is added to the block list, the blocked user will be removed from the chat. Navigate meetings and messages hands-free, with the power of AI in the driver's seat [iOS]: Available now in public preview Stay connected on the move with CarPlay support. Teams in CarPlay now includes the ability to use Siri to respond to notifications and send messages to your chats and channels. Now it's easier to join Teams meetings and safely engage in discussions with quick actions like raise hand. New Teams optimizations for VDI: Generally available now for Windows 365 and AVD, Citrix now in public preview VDI enhancements for Teams include improved Teams performance in a Virtual Desktop Infrastructure (VDI) environment, such as the ability to see animations. It brings features that are more aligned with the native client experience and Includes auto-updates that coordinate with mainline Teams client updates in Teams VDI environments, which reduces asynchronous updates. Apple Vision Pro with better MAM/Authenticator support: Generally available now Authenticator for Microsoft 365 apps and Intune integration in Teams, now available for Apple Vision Pro! This release delivers the top user request for seamless MAM Conditional Access support, ensuring enhanced security and productivity for Teams on Apple Vision Pro platform. Mac menu bar: Available now in public preview Microsoft Teams for Mac devices is adding an extension to the macOS Menu Bar, where users will find a Teams icon with a persistent indicator of their presence status. Users can change their presence status with the Menu Bar extension, which also contains additional actions for streamlining Teams workflows. iPad multi-window support: Available now in private preview Teams now supports multiple windows on iPad. Effortlessly organize your split view experience with the Teams windows to easily navigate across meetings, chats, and more. “What’s New” section in Teams admin center: Generally available in early 2025 Admins can stay informed about new Teams features in a more streamlined way with What's New. Instead of finding Teams features within Message Center, which also includes service updates, \"What's New\" only includes Teams new feature details, including documentation for relevant admin controls for new features, making it easier for admins to learn and take action. Admins can also test new features in public preview with a smaller set of users before deploying more broadly by navigating to the Microsoft 365 admin center. Improved performance for anonymous users joining Teams meetings on web: Generally available now We’ve been listening to your feedback and have redesigned the meeting join experience for anonymous users on the web—delivering a 5x reduction in time for the webapp to load, and nearly 3x improvement in time to transition the user to the meeting stage screen. We’ve also streamlined the user experience so that it is simpler to use and easier to navigate. These enhancements help make external collaboration easier and smoother, and are available now for meetings on Safari, Firefox, Chrome and Edge browsers. Teams manageability at scale through Admin Units: Generally available now Introducing Administrative units (AUs) in Teams, a feature that allows organizations to delegate specific administrative roles to manage subsets of users or groups based on attributes such as department, location, or business unit. For example, local admins can be enabled to assign Teams Phone policies for their specific geographic region instead of relying upon central Admin to manage them. This capability enhances scalability and efficiency in Teams management by enabling more targeted and effective administration. Remote log collection in Teams admin center: Private and public previews in early 2025 This feature simplifies the process of collecting Teams client logs by automating the task, eliminating the need for any action from end users. It ensures that logs are gathered efficiently and seamlessly, aiding in quicker troubleshooting and issue resolution. Best practice configuration recommendations for Teams meetings and calls: Generally available December 2024 IT admins will be able to monitor and identify the best practice recommendations to ensure the highest quality Teams collaboration experience, especially calls and meetings. For example, when high network traffic is detected, a recommendation to open UDP ports on both Network and Client firewalls to Microsoft Teams Services will be displayed. Frontline Worker solutions Agents in SharePoint: Generally available in November 2024 Empower your frontline workers to find the information stored in your SharePoint, such as company policies or onboarding guidance, as efficiently and effectively as possible with help of AI. Easily share an agent you've created with your team in your Teams chat. Imagine you’re on the sales floor and a customer asks what the return policy is. Simply @mention the agent right within Teams and get the return policy information you were looking for in seconds. Windows 365 shared mode for Frontline: Available now in public preview Windows 365 shared mode for Frontline is a cost-effective way to employ virtual desktops at scale. It allows organizations to provision Cloud PCs to be used (non-concurrently) across a greater number of users. Whether it’s a factory floor, a shipping center, or any organization where users may not need full-time Cloud PC access, Windows 365 Frontline shared mode provides a secure, non-personalized Windows desktop experience that resets upon sign-out for the next user. Extended support for shared device mode (SDM) for 3P MDMs: Generally available in 2025 Make sharing devices among your frontline workers as efficient and secure as possible with global sign-in, global sign-out, and conditional access policy targeting. This functionality has been available on Intune for Android devices since 2023 and iOS devices since early 2024. We have now expanded support for Shared Device Mode (SDM) to Android devices via third-party mobile device management providers like Omnissa (formerly VMware) and SOTI. Jamf support for shared device mode on iOS will be coming soon. Flexible membership for deploying Teams at scale: Public preview in November 2024 In December 2023, we empowered IT Admins to quickly create location-based teams with standardized channels utilizing the Entra attributes from the Teams admin center. This significantly improved the efficiency of Teams deployment at scale. To provide additional flexibility, this month we’re expanding access to allow team owners to make manual changes where needed, like adding or removing an employee."
}