{
  "url": "https://www.torhoermanlaw.com/roundup-lawsuit/",
  "title": "Roundup Lawsuit [January 2026 Update] | Free Consultation",
  "text": "If you or a loved one suffered injuries, property damage, or other financial losses due to another party’s actions, you may be entitled to compensation for those losses. Contact the experienced Chicago personal injury lawyers from TorHoerman Law for a free, no-obligation Chicago personal injury lawsuit case consultation today. If you or a loved one suffered a personal injury or financial loss due to a car accident in Chicago, IL – you may be entitled to compensation for those damages. Contact an experienced Chicago auto accident lawyer from TorHoerman Law today to see how our firm can serve you! If you or a loved one have suffered injuries, property damage, or other financial losses due to a truck accident in Chicago, IL – you may qualify to take legal action to gain compensation for those injuries and losses. Contact TorHoerman Law today for a free, no-obligation consultation with our Chicago truck accident lawyers! If you or a loved one suffered an injury in a motorcycle accident in Chicago or the greater Chicagoland area – you may be eligible to file a Chicago motorcycle accident lawsuit. Contact an experienced Chicago motorcycle accident lawyer at TorHoerman Law today to find out how we can help. If you have been involved in a bicycle accident in Chicago at no fault of your own and you suffered injuries as a result, you may qualify to file a Chicago bike accident lawsuit. Contact a Chicago bike accident lawyer from TorHoerman Law to discuss your legal options today! Chicago is one of the nation’s largest construction centers. Thousands of men and women work on sites across the city and metropolitan area on tasks ranging from skilled trades to administrative operations. Unfortunately, construction site accidents are fairly common. Contact TorHoerman Law to discuss your legal options with an experienced Chicago construction accident lawyer, free of charge and no obligation required. Nursing homes and nursing facilities should provide a safe, supportive environment for senior citizens, with qualified staff, nurses, and aids administering quality care. Unfortunately, nursing home abuse and neglect can occur, leaving residents at risk and vulnerable. Contact an experienced Chicago nursing home abuse lawyer from TorHoerman Law today for a free consultation to discuss your legal options. If you are a resident of Chicago, or the greater Chicagoland area, and you have a loved one who suffered a fatal injury due to another party’s negligence or malpractice – you may qualify to file a wrongful death lawsuit on your loved one’s behalf. Contact a Chicago wrongful death lawyer from TorHoerman Law to discuss your legal options today! If you have suffered a slip and fall injury in Chicago you may be eligible for compensation through legal action. Contact a Chicago slip and fall lawyer at TorHoerman Law today! TorHoerman Law offers free, no-obligation case consultations for all potential clients. When a child is injured at a daycare center, parents are left wondering who can be held liable, who to contact for legal help, and how a lawsuit may pan out for them. If your child has suffered an injury at a daycare facility, you may be eligible to file a daycare injury lawsuit. Contact a Chicago daycare injury lawyer from TorHoerman Law today for a free consultation to discuss your case and potential legal action! If you or a loved one suffered injuries, property damage, or other financial losses due to another party’s actions, you may be entitled to compensation for those losses. Contact the experienced Edwardsville personal injury lawyers from TorHoerman Law for a free, no-obligation Edwardsville personal injury lawsuit case consultation today. If you or a loved one suffered a personal injury or financial loss due to a car accident in Edwardsville, IL – you may be entitled to compensation for those damages. Contact an experienced Edwardsville car accident lawyer from TorHoerman Law today to see how our firm can serve you! If you or a loved one have suffered injuries, property damage, or other financial losses due to a truck accident in Edwardsville, IL – you may qualify to take legal action to gain compensation for those injuries and losses. Contact TorHoerman Law today for a free, no-obligation consultation with our Edwardsville truck accident lawyers! If you or a loved one suffered an injury in a motorcycle accident in Edwardsville – you may be eligible to file an Edwardsville motorcycle accident lawsuit. Contact an experienced Edwardsville motorcycle accident lawyer at TorHoerman Law today to find out how we can help. If you have been involved in a bicycle accident in Edwardsville at no fault of your own and you suffered injuries as a result, you may qualify to file an Edwardsville bike accident lawsuit. Contact an Edwardsville bicycle accident lawyer from TorHoerman Law to discuss your legal options today! Nursing homes and nursing facilities should provide a safe, supportive environment for senior citizens, with qualified staff, nurses, and aids administering quality care. Unfortunately, nursing home abuse and neglect can occur, leaving residents at risk and vulnerable. Contact an experienced Edwardsville nursing home abuse attorney from TorHoerman Law today for a free consultation to discuss your legal options. If you are a resident of Edwardsville and you have a loved one who suffered a fatal injury due to another party’s negligence or malpractice – you may qualify to file a wrongful death lawsuit on your loved one’s behalf. Contact an Edwardsville wrongful death lawyer from TorHoerman Law to discuss your legal options today! If you have suffered a slip and fall injury in Edwardsville you may be eligible for compensation through legal action. Contact an Edwardsville slip and fall lawyer at TorHoerman Law today! TorHoerman Law offers free, no-obligation case consultations for all potential clients. When a child is injured at a daycare center, parents are left wondering who can be held liable, who to contact for legal help, and how a lawsuit may pan out for them. If your child has suffered an injury at a daycare facility, you may be eligible to file a daycare injury lawsuit. Contact an Edwardsville daycare injury lawyer from TorHoerman Law today for a free consultation to discuss your case and potential legal action! If you or a loved one suffered injuries on someone else’s property in Edwardsville IL, you may be entitled to financial compensation. If property owners fail to keep their premises safe, and their negligence leads to injuries, property damages or other losses as a result of an accident or incident, a premises liability lawsuit may be possible. Contact an Edwardsville premises liability lawyer from TorHoerman Law today for a free, no-obligation case consultation. If you or a loved one suffered injuries, property damage, or other financial losses due to another party’s actions, you may be entitled to compensation for those losses. Contact the experienced St. Louis personal injury lawyers from TorHoerman Law for a free, no-obligation St. Louis personal injury lawsuit case consultation today. If you or a loved one suffered a personal injury or financial loss due to a car accident in St. Louis, IL – you may be entitled to compensation for those damages. Contact an experienced St. Louis car accident lawyer from TorHoerman Law today to see how our firm can serve you! If you or a loved one have suffered injuries, property damage, or other financial losses due to a truck accident in St. Louis, IL – you may qualify to take legal action to gain compensation for those injuries and losses. Contact TorHoerman Law today for a free, no-obligation consultation with our St. Louis truck accident lawyers! If you or a loved one suffered an injury in a motorcycle accident in St. Louis or the greater St. Louis area – you may be eligible to file a St. Louis motorcycle accident lawsuit. Contact an experienced St. Louis motorcycle accident lawyer at TorHoerman Law today to find out how we can help. If you have been involved in a bicycle accident in St. Louis at no fault of your own and you suffered injuries as a result, you may qualify to file a St. Louis bike accident lawsuit. Contact a St. Louis bicycle accident lawyer from TorHoerman Law to discuss your legal options today! St. Louis is one of the nation’s largest construction centers. Thousands of men and women work on sites across the city and metropolitan area on tasks ranging from skilled trades to administrative operations. Unfortunately, construction site accidents are fairly common. Contact TorHoerman Law to discuss your legal options with an experienced St. Louis construction accident lawyer, free of charge and no obligation required. Nursing homes and nursing facilities should provide a safe, supportive environment for senior citizens, with qualified staff, nurses, and aids administering quality care. Unfortunately, nursing home abuse and neglect can occur, leaving residents at risk and vulnerable. Contact an experienced St. Louis nursing home abuse attorney from TorHoerman Law today for a free consultation to discuss your legal options. If you are a resident of St. Louis, or the greater St. Louis area, and you have a loved one who suffered a fatal injury due to another party’s negligence or malpractice – you may qualify to file a wrongful death lawsuit on your loved one’s behalf. Contact a St. Louis wrongful death lawyer from TorHoerman Law to discuss your legal options today! If you have suffered a slip and fall injury in St. Louis you may be eligible for compensation through legal action. Contact a St. Louis slip and fall lawyer at TorHoerman Law today! TorHoerman Law offers free, no-obligation case consultations for all potential clients. When a child is injured at a daycare center, parents are left wondering who can be held liable, who to contact for legal help, and how a lawsuit may pan out for them. If your child has suffered an injury at a daycare facility, you may be eligible to file a daycare injury lawsuit. Contact a St. Louis daycare injury lawyer from TorHoerman Law today for a free consultation to discuss your case and potential legal action! Depo-Provera, a contraceptive injection, has been linked to an increased risk of developing brain tumors (including glioblastoma and meningioma). Women who have used Depo-Provera and subsequently been diagnosed with brain tumors are filing lawsuits against Pfizer (the manufacturer), alleging that the company failed to adequately warn about the risks associated with the drug. Despite the claims, Pfizer maintains that Depo-Provera is safe and effective, citing FDA approval and arguing that the scientific evidence does not support a causal link between the drug and brain tumors. You may be eligible to file a Depo Provera Lawsuit if you used Depo-Provera and were diagnosed with a brain tumor. Suboxone, a medication often used to treat opioid use disorder (OUD), has become a vital tool which offers a safer and more controlled approach to managing opioid addiction. Despite its widespread use, Suboxone has been linked to severe tooth decay and dental injuries. Suboxone Tooth Decay Lawsuits claim that the companies failed to warn about the risks of tooth decay and other dental injuries associated with Suboxone sublingual films. Tepezza, approved by the FDA in 2020, is used to treat Thyroid Eye Disease (TED), but some patients have reported hearing issues after its use. The Tepezza lawsuit claims that Horizon Therapeutics failed to warn patients about the potential risks and side effects of the drug, leading to hearing loss and other problems, such as tinnitus. You may be eligible to file a Tepezza Lawsuit if you or a loved one took Tepezza and subsequently suffered permanent hearing loss or tinnitus. Elmiron, a drug prescribed for interstitial cystitis, has been linked to serious eye damage and vision problems in scientific studies. Thousands of Elmiron Lawsuits have been filed against Janssen Pharmaceuticals, the manufacturer, alleging that the company failed to warn patients about the potential risks. You may be eligible to file an Elmiron Lawsuit if you or a loved one took Elmiron and subsequently suffered vision loss, blindness, or any other eye injury linked to the prescription drug. The chemotherapy drug Taxotere, commonly used for breast cancer treatment, has been linked to severe eye injuries, permanent vision loss, and permanent hair loss. Taxotere Lawsuits are being filed by breast cancer patients and others who have taken the chemotherapy drug and subsequently developed vision problems. If you or a loved one used Taxotere and subsequently developed vision damage or other related medical problems, you may be eligible to file a Taxotere Lawsuit and seek financial compensation. Parents and guardians are filing lawsuits against major video game companies (including Epic Games, Activision Blizzard, and Microsoft), alleging that they intentionally designed their games to be addictive — leading to severe mental and physical health issues in minors. The lawsuits claim that these companies used psychological tactics and manipulative game designs to keep players engaged for extended periods — causing problems such as anxiety, depression, and social withdrawal. You may be eligible to file a Video Game Addiction Lawsuit if your child has been diagnosed with gaming addiction or has experienced negative effects from excessive gaming. Thousands of Uber sexual assault claims have been filed by passengers who suffered violence during rides arranged through the platform. The ongoing Uber sexual assault litigation spans both federal law and California state court, with a consolidated Uber MDL (multi-district litigation) currently pending in the Northern District of California. Uber sexual assault survivors across the country are coming forward to hold the company accountable for negligence in hiring, screening, and supervising drivers. If you or a loved one were sexually assaulted, sexually battered, or faced any other form of sexual misconduct from an Uber driver, you may be eligible to file an Uber Sexual Assault Lawsuit. Although pressure cookers were designed to be safe and easy to use, a number of these devices have been found to have a defect that can lead to excessive buildup of internal pressure. The excessive pressure may result in an explosion that puts users at risk of serious injuries such as burns, lacerations, an even electrocution. If your pressure cooker exploded and caused substantial burn injuries or other serious injuries, you may be eligible to file a Pressure Cooker Lawsuit and secure financial compensation for your injuries and damages. Several studies have found a correlation between heavy social media use and mental health challenges, especially among younger users. Social media harm lawsuits claim that social media companies are responsible for onsetting or heightening mental health problems, eating disorders, mood disorders, and other negative experiences of teens and children You may be eligible to file a Social Media Mental Health Lawsuit if you are the parents of a teen, or teens, who attribute their use of social media platforms to their mental health problems. The Paragard IUD, a non-hormonal birth control device, has been linked to serious complications, including device breakage during removal. Numerous lawsuits have been filed against Teva Pharmaceuticals, the manufacturer of Paragard, alleging that the company failed to warn about the potential risks. If you or a loved one used a Paragard IUD and subsequently suffered complications and/or injuries, you may qualify for a Paragard Lawsuit. Patients with the PowerPort devices may possibly be at a higher risk of serious complications or injury due to a catheter failure, according to lawsuits filed against the manufacturers of the Bard PowerPort Device. If you or a loved one have been injured by a Bard PowerPort Device, you may be eligible to file a Bard PowerPort Lawsuit and seek financial compensation. Vaginal Mesh Lawsuits are being filed against manufacturers of transvaginal mesh products for injuries, pain and suffering, and financial costs related to complications and injuries of these medical devices. Over 100,000 Transvaginal Mesh Lawsuits have been filed on behalf of women injured by vaginal mesh and pelvic mesh products. If you or a loved one have suffered serious complications or injuries from vaginal mesh, you may be eligible to file a Vaginal Mesh Lawsuit. Above ground pool accidents have led to lawsuits against manufacturers due to defective restraining belts that pose serious safety risks to children. These belts, designed to provide structural stability, can inadvertently act as footholds, allowing children to climb into the pool unsupervised, increasing the risk of drownings and injuries. Parents and guardians are filing lawsuits against pool manufacturers, alleging that the defective design has caused severe injuries and deaths. If your child was injured or drowned in an above ground pool accident involving a defective restraining belt, you may be eligible to file a lawsuit. Recent scientific studies have found that the use of chemical hair straightening products, hair relaxers, and other hair products present an increased risk of uterine cancer, endometrial cancer, breast cancer, and other health problems. Legal action is being taken against manufacturers and producers of these hair products for their failure to properly warn consumers of potential health risks. You may be eligible to file a Hair Straightener Cancer Lawsuit if you or a loved one used chemical hair straighteners, hair relaxers, or other similar hair products, and subsequently were diagnosed with: NEC Lawsuit claims allege that certain formulas given to infants in NICU settings increase the risk of necrotizing enterocolitis (NEC) – a severe intestinal condition in premature infants. Parents and guardians are filing NEC Lawsuits against baby formula manufacturers, alleging that the formulas contain harmful ingredients leading to NEC. Despite the claims, Abbott and Mead Johnson deny the allegations, arguing that their products are thoroughly researched and dismissing the scientific evidence linking their formulas to NEC, while the FDA issued a warning to Abbott regarding safety concerns of a formula product. You may be eligible to file a Toxic Baby Formula NEC Lawsuit if your child received baby bovine-based (cow’s milk) baby formula in the maternity ward or NICU of a hospital and was subsequently diagnosed with Necrotizing Enterocolitis (NEC). Paraquat, a widely-used herbicide, has been linked to Parkinson’s disease, leading to numerous Paraquat Parkinson’s Disease Lawsuits against its manufacturers for failing to warn about the risks of chronic exposure. Due to its toxicity, the EPA has restricted the use of Paraquat and it is currently banned in over 30 countries. You may be eligible to file a Paraquat Lawsuit if you or a loved one were exposed to Paraquat and subsequently diagnosed with Parkinson’s Disease or other related health conditions. Mesothelioma is an aggressive form of cancer primarily caused by exposure to asbestos. Asbestos trust funds were established in the 1970s to compensate workers harmed by asbestos-containing products. These funds are designed to pay out claims to those who developed mesothelioma or other asbestos-related diseases due to exposure. Those exposed to asbestos and diagnosed with mesothelioma may be eligible to file a Mesothelioma Lawsuit. AFFF (Aqueous Film Forming Foam) is a firefighting foam that has been linked to various health issues, including cancer, due to its PFAS (per- and polyfluoroalkyl substances) content. Numerous AFFF Lawsuits have been filed against AFFF manufacturers, alleging that they knew about the health risks but failed to warn the public. AFFF Firefighting Foam lawsuits aim to hold manufacturers accountable for putting peoples’ health at risk. You may be eligible to file an AFFF Lawsuit if you or a loved one was exposed to firefighting foam and subsequently developed cancer. PFAS contamination lawsuits are being filed against manufacturers and suppliers of PFAS chemicals, alleging that these substances have contaminated water sources and products, leading to severe health issues. Plaintiffs claim that prolonged exposure to PFAS through contaminated drinking water and products has caused cancers, thyroid disease, and other health problems. The lawsuits target companies like 3M, DuPont, and Chemours, accusing them of knowingly contaminating the environment with PFAS and failing to warn about the risks. If you or a loved one has been exposed to PFAS-contaminated water or products and has developed health issues, you may be eligible to file a PFAS lawsuit. The Roundup Lawsuit claims that Monsanto’s popular weed killer, Roundup, causes cancer. Numerous studies have linked the main ingredient, glyphosate, to Non-Hodgkin’s Lymphoma, Leukemia, and other Lymphatic cancers. Despite this, Monsanto continues to deny these claims. Victims of Roundup exposure who developed cancer are filing Roundup Lawsuits against Monsanto, seeking compensation for medical expenses, pain, and suffering. Our firm is about people. That is our motto and that will always be our reality. We do our best to get to know our clients, understand their situations, and get them the compensation they deserve. At TorHoerman Law, we believe that if we continue to focus on the people that we represent, and continue to be true to the people that we are – justice will always be served. Without our team, we would’nt be able to provide our clients with anything close to the level of service they receive when they work with us. The TorHoerman Law Team commits to the sincere belief that those injured by the misconduct of others, especially large corporate profit mongers, deserve justice for their injuries. Our team is what has made TorHoerman Law a very special place since 2009. Use the chatbot on this page to see if you qualify for a Roundup Lawsuit instantly. You can also contact TorHoerman Law for a free consultation. The Roundup lawsuit claims that Monsanto's popular weed killer, Roundup, causes cancer. The main ingredient, glyphosate, has been linked to Non-Hodgkin's Lymphoma. Numerous studies and the International Agency for Research on Cancer (IARC) have classified glyphosate as a probable human carcinogen. Despite this, Monsanto continues to deny these claims. Victims of Roundup exposure who developed cancer are filing lawsuits against Monsanto, seeking compensation for medical expenses, pain, and suffering. 4,508 Roundup Lawsuits are consolidated in federal court, filed mainly by farm workers and landscapers claiming health issues like non-Hodgkin's lymphoma from glyphosate exposure. Bayer is seeking state legislation to obtain legal immunity from cancer claims related to Roundup, arguing that compliance with EPA regulations should suffice. Our Roundup Lawyers are reviewing potential claims from individuals diagnosed with non-hodgkin's lymphoma and other diseases potentially caused by Roundup exposure. The active ingredient in Roundup (Glyphosate) has been linked to an increased cancer risk, specifically Non Hodgkin’s Lymphoma. Roundup Lawsuits are being filed against BayerAG and Monsanto for failing to warn consumers about the dangers of Roundup exposure. Over 80% of Roundup Lawsuits, which amount to over 100,000 cases, have been settled. The landmark $10 billion settlement agreement includes $1.25 billion for future Roundup claims. If you or a loved one suffered injuries resulting from Roundup weed killer exposure, you may qualify to participate in a Roundup lawsuit. Contact an experienced Roundup lawyer to discuss your legal options today, free of charge and no obligation required. TorHoerman Law is no longer accepting clients for this litigation. The Roundup Weed Killer lawsuit recorded an increase in total multidistrict litigation (MDL) cases from December 2025 to January 2026. The docket rose from 4,508 total cases in December 2025 to 4,511 total cases in January 2026, resulting in three new filings during the month. The Roundup Weed Killer lawsuit involves claims that exposure to the herbicide Roundup caused non-Hodgkin’s lymphoma and other cancers. Plaintiffs allege that the manufacturer failed to adequately warn users about the risk of cancer associated with Roundup use. If you or a loved one suffered injuries resulting from Roundup weed killer exposure, you may qualify to participate in a Roundup lawsuit. Contact an experienced Roundup lawyer to discuss your legal options today, free of charge and no obligation required. December 22, 2025: Journal Retracts Monsanto-Backed Roundup Safety Study Cited for Decades A scientific journal has officially retracted a 2000 review article that defendants have repeatedly cited to argue that Roundup is safe. The paper, published in Regulatory Toxicology and Pharmacology, concluded that glyphosate does not pose a cancer risk. According to the retraction notice and recent reports, Monsanto funded the article and helped draft it, even though the authors presented it as independent research. The journal cited undisclosed conflicts of interest and ethical issues as the reason for the retraction. Internal company documents released during Roundup litigation revealed that Monsanto scientists participated in outlining, editing, and shaping the manuscript, while outside academics were credited as the named authors. The study has been used in regulatory submissions and court filings for years to support glyphosate’s safety profile. Its retraction removes a key source that defendants relied on and adds to the evidence questioning the credibility of industry-backed science used to defend Roundup in cancer lawsuits. The Roundup Weed Killer lawsuit experienced an increase in total multidistrict litigation (MDL) cases between November 2025 and December 2025. The docket rose from 4,490 cases in November 2025 to 4,508 cases in December 2025, resulting in 18 new filings. The Roundup Weed Killer lawsuit involves allegations that long-term exposure to glyphosate, the active ingredient in the Roundup herbicide, caused non-Hodgkin lymphoma and related cancers. Plaintiffs assert that product labeling and safety disclosures did not adequately warn users about carcinogenic risks associated with glyphosate exposure. If you or a loved one suffered injuries resulting from Roundup weed killer exposure, you may qualify to participate in a Roundup lawsuit. Contact an experienced Roundup lawyer to discuss your legal options today, free of charge and no obligation required. A California appellate court has affirmed a $28 million verdict against Bayer in a Roundup cancer case, dealing another legal blow to the company amid its ongoing efforts to settle thousands of glyphosate-related lawsuits nationwide. $28 Million Verdict Affirmed in California Last week, the court upheld a $28 million judgment in favor of a plaintiff who alleged that Bayer’s Roundup weedkiller caused their cancer. This comes as Bayer has been working to resolve a wave of large verdicts and appeals across the U.S., including recent settlements in Georgia, Philadelphia, and other jurisdictions. Impact on Pending Litigation The affirmed verdict is significant because it arrived just as Bayer has begun withdrawing appeals and entering settlements in several major cases. Legal analysts suggest Bayer likely regrets not settling this California case before the appellate opinion was issued. Outlook for Future Trials No new Roundup trials are expected in the immediate future. Attorneys anticipate that proceedings will remain paused while awaiting clarification on whether the U.S. Supreme Court will hear the key preemption issue, a legal argument that could affect Bayer’s liability under federal law. Bayer’s Position Moving into 2026 After a difficult year in the courtroom, Bayer CEO Bill Anderson has committed to making progress in 2026 on resolving the remaining lawsuits. The company continues to face pressure from plaintiffs and the public as Roundup litigation draws closer to a potential conclusion. More updates are expected as the new year approaches and strategic decisions unfold regarding unresolved claims. Bayer has withdrawn several key appeals in high-profile Roundup cancer lawsuits, signaling a potential shift in strategy as litigation pressure builds. The company notably dropped its appeal of the $2.1 billion Georgia verdict, one of the largest awards in the ongoing litigation. In addition, Bayer has also abandoned its appeals of three plaintiff victories out of the Philadelphia Court of Common Pleas. These moves may indicate Bayer’s intent to resolve remaining Roundup appeals rather than pursue further courtroom battles. Legal observers suggest this could be part of a broader effort to stem escalating trial risks and jury awards. If this strategy continues, it may mean fewer future Roundup cases go before a jury, and potentially signal the approaching resolution of the nationwide litigation. Attorneys following the litigation are now watching closely to see whether Bayer will continue this pattern and begin settling more of the remaining cases. Bayer AG has reached a confidential settlement with plaintiff John Barnes in a Georgia Roundup Lawsuit after a Cobb County jury issued a $2.1 billion verdict earlier this year. Court filings confirm that Barnes and Monsanto agreed to vacate the judgment in exchange for an undisclosed settlement amount. The jury awarded Barnes $65 million in compensatory damages and $2 billion in punitive damages based on evidence alleging that Monsanto failed to disclose cancer risks associated with Roundup exposure. Barnes attributed his cancer diagnosis to long-term Roundup use and argued that Monsanto engaged in a misinformation campaign to downplay carcinogenic risks identified in internal materials dating back to the 1980s. According to Law360, Monsanto continues to deny liability but stated that it will consider settlements when doing so aligns with broader litigation strategy. The settlement also resolves additional Roundup Lawsuits involving adverse verdicts covered under Bayer’s existing litigation provisions. The Barnes settlement occurred as Georgia lawmakers advanced new legislation that limits manufacturer liability for pesticide-related injuries. The statute takes effect in January and deems any federally approved warning label sufficient for liability purposes. The law excludes pesticides for which the U.S. Environmental Protection Agency determines that a manufacturer withheld or misrepresented material safety information. Legislative activity in Georgia reflects a broader nationwide trend in which state governments evaluate the interaction between federal pesticide regulation and product liability claims. Roundup lawsuits continue to proceed nationwide. Monsanto has faced more than 100,000 product liability claims alleging injuries linked to Roundup exposure. Jury awards have varied significantly across jurisdictions, including Pennsylvania, Missouri, and other states. A California federal judge has approved a $38 million settlement between Bayer AG and a class of investors who claimed the company misled them about the legal and financial risks tied to its 2018 acquisition of Monsanto, the maker of Roundup weedkiller. The investors, including major pension funds, alleged Bayer downplayed the scope of Roundup-related cancer litigation, which inflated the stock prices of its American depositary receipts traded in the United States. U.S. District Judge Richard Seeborg granted final approval to the agreement after years of litigation in which Bayer failed to dismiss the case or block class certification. The court also awarded plaintiffs’ counsel at Cohen Milstein Sellers & Toll PLLC 9.3 million dollars in attorney fees and 3.2 million dollars in expenses. Judge Seeborg described the case as “hard fought” and noted that settling spared investors from complex trial arguments about whether U.S. securities laws applied to transactions involving a foreign company’s ADRs. Lead counsel Carol Gilden said the settlement confirms that foreign corporations can be held accountable under U.S. securities laws when they mislead domestic investors. Bayer, which admitted no wrongdoing, stated it was pleased to resolve the matter and move forward. The certified class includes investors who purchased Bayer ADRs between May 23, 2016, and July 6, 2020. If you or a loved one suffered injuries resulting from Roundup weed killer exposure, you may qualify to participate in a Roundup lawsuit. Contact an experienced Roundup lawyer to discuss your legal options today, free of charge and no obligation required. The Roundup multidistrict litigation recorded 4,472 cases in October and 4,490 in November. This minor increase keeps the total just below the 4,500 mark. Plaintiffs allege that exposure to glyphosate, the active ingredient in Roundup, caused non-Hodgkin’s lymphoma. The MDL continues to move through pretrial litigation, with recent activity focused on expert testimony and case-specific discovery. The Missouri Supreme Court has declined to review a $600 million judgment against Bayer in a Roundup cancer lawsuit, affirming lower court rulings that found the herbicide causes non-Hodgkin lymphoma. The decision concludes one of the few Roundup Lawsuits in Missouri to reach final judgment and adds to Bayer’s growing financial and legal challenges tied to glyphosate-based weed killers. The case originated in Cole County, where a 2023 jury awarded four plaintiffs $1.56 billion in damages. Circuit Judge Daniel Green later reduced the total to $611 million, a decision upheld by the Western District Court of Appeals in May. The Supreme Court’s refusal to hear Bayer’s appeal effectively ends the litigation at the state level. The jury determined that Monsanto, and later Bayer, failed to warn consumers about cancer risks and that Roundup’s formulation was defective. Punitive damages made up the majority of the award, which will continue to accrue 9% annual interest until paid, now exceeding $700 million. Under Missouri law, half of the punitive damages will go to the state’s Tort Victims Compensation Fund, which assists individuals whose judgments exceed available insurance coverage. A portion of that fund also supports legal aid organizations across the state. Bayer maintains that Roundup is safe and continues to argue that state-based failure-to-warn claims are preempted by federal law. The company has paid roughly $11 billion to settle nearly 100,000 Roundup Lawsuits, with about 61,000 still pending nationwide. Bayer has also sought legislative protection from further claims, lobbying for bills in Missouri and Congress that would shield it from future Roundup-related litigation. Bayer discontinued production of glyphosate-based Roundup for consumer use and announced it is seeking regulatory approval for a new herbicide intended to replace Roundup in major markets, including the U.S., Europe, and Brazil. Two Kansas City-area residents have filed lawsuits against Monsanto and Bayer, alleging that long-term exposure to Roundup weed killer caused their non-Hodgkin lymphoma diagnoses. The lawsuits, filed separately in Jackson and Platte counties, name plaintiffs Christopher McClure and Kenneth Payton. Both men claim decades of Roundup use and exposure at their residences. The World Health Organization’s International Agency for Research on Cancer classified glyphosate as a “probable human carcinogen” in 2015, citing non-Hodgkin lymphoma as a primary cancer associated with exposure. The lawsuits assert that Monsanto and Bayer knew of the dangers of glyphosate and other toxic components in Roundup, including arsenic, formaldehyde, ethylene oxide, and 1,4-dioxane, but failed to warn consumers. The filings claim Monsanto misrepresented data, suppressed unfavorable research, and promoted Roundup as safe despite internal acknowledgment of potential cancer risks. Monsanto’s chief toxicologist allegedly admitted that no carcinogenicity studies were ever conducted on the full Roundup formulation because such studies were not required by the Environmental Protection Agency (EPA). Since Bayer’s acquisition of Monsanto in 2018, the company has assumed liability for Roundup-related claims. To date, Bayer has paid approximately $11 billion to settle about 100,000 Roundup Lawsuits nationwide, but continues to maintain that the product is safe when used as directed. A recent New York Times editorial argued that glyphosate, the active ingredient in Roundup, is “essentially harmless.” But leading independent research and regulatory reviews show the issue is far more complex than the piece suggests. While the editorial highlights assessments by the EPA and EFSA, it downplays independent findings from the International Agency for Research on Cancer (IARC), which classified glyphosate as “probably carcinogenic to humans.” This conclusion was based on strong evidence of DNA and chromosomal damage in human cells and increased tumor incidence in animal studies. A 2019 meta-analysis published in Mutation Research further found that individuals with the highest exposures to glyphosate-based herbicides had a 41% higher risk of non-Hodgkin lymphoma compared to those with the lowest exposure. The editorial also overlooks litigation outcomes that have drawn on weeks of expert testimony and scientific data. Multiple U.S. juries have already linked glyphosate exposure to cancer in real people, awarding substantial verdicts based on evidence of inadequate warnings and corporate influence over “safety” literature. Regulatory reviews are also divided. While the EPA has maintained glyphosate is not likely to cause cancer when used as directed, agencies in France, Germany, and Canada have called for stricter restrictions or reassessments due to growing evidence of long-term risks. Importantly, unlike regulatory bodies that balance safety against economic benefits, IARC’s sole mandate is to evaluate carcinogenic potential. Finally, the editorial ignores dose–response complexities. While glyphosate targets a plant enzyme absent in humans, exposure levels among agricultural workers and rural residents can be significantly higher than in the general population. Peer-reviewed studies in Environmental Health and International Journal of Epidemiology have found measurable glyphosate in human urine samples, raising concerns about cumulative exposure and health outcomes. In short, the weight of independent science indicates glyphosate is not benign. Courts, scientists, and public health experts continue to warn that dismissing risks as “hysteria” ignores real evidence of carcinogenic potential and undermines trust in regulatory oversight. Between September and October, the Roundup multidistrict litigation (MDL) experienced a modest increase in case volume,rising from 4,464 to 4,472 total cases. This eight-case increase continues a trend of relatively steady filings in the ongoing litigation over allegations that glyphosate, the active ingredient in Roundup, causes non-Hodgkin’s lymphoma and other cancers. The lawsuits claim that Monsanto (now owned by Bayer) failed to adequately warn consumers and regulators about the potential health risks of its widely used herbicide. While many cases have resolved through settlements, including Bayer’s multi-billion-dollar agreements in past years, new claims are still being filed, and some continue to proceed toward trial. Despite the small increase in total cases this month, the MDL remains one of the largest active mass torts in the country, with a strong focus on scientific evidence, expert testimony, and causation issues in upcoming proceedings. If you or a loved one suffered injuries res"
}