{
  "url": "https://en.wikipedia.org/wiki/Fiorucci",
  "title": "Fiorucci - Wikipedia",
  "text": "Fiorucci Fiorucci (Italian pronunciation: [fjoˈruttʃi]) is an Italian fashion label founded by Elio Fiorucci in 1967. The first Fiorucci shop exposed Milan to the styles of Swinging London and to American classics, such as the T-shirt and jeans. By the late 1970s, the direction of stylistic influence had reversed, and the Fiorucci store in New York City become famous for the foreign fashions it introduced to the United States. Known as the \"daytime Studio 54\",[1] it attracted trendsetters from Andy Warhol to Madonna.[1] As a leader in the globalisation of fashion, Fiorucci scoured the globe for underground trends, introducing a newly affluent mass market to styles such as thongs from Brazil and Afghan coats. The label also popularised camouflage and leopard-skin prints before creating the designer jean market with the invention of stretch jeans.[1] Advertising for these jeans usually featured a woman's buttocks in skin-tight denim, or in one case obscured by pink fluffy handcuffs, whilst the company logo was two cheeky angels modelled after Raphael's cherubs. However, mismanagement of the company led to receivership in 1989, and the brand was subsequently dogged by legal battles over trademarks. Several relaunches failed to make much impact. Elio Fiorucci was found dead in his Milan home on 20 July 2015, at the age of 80.[2] A month before his death, the brand was sold to Janie and Stephen Schaffer, who had founded the high street chain Knickerbox together in 1986.[3] After an online Fiorucci launch and a campaign featuring Georgia May Jagger, a 5,000 sq ft destination store opened on Brewer Street in London's Soho in September 2017 during London Fashion Week. The launch party saw the Theo Adams Company transform L'Escargot, London's oldest French restaurant, into a world of disco, hedonism, and horror. The event was described by Women's Wear Daily as \"the kind of party that many brands would kill for: achingly cool, outrageously oversubscribed and lots of fun.\"[4] The following month Rizzoli launched a book entitled Fiorucci to celebrate 50 years of the brand, with a foreword by Oscar-winning director Sofia Coppola.[5] Early years [edit]Elio Fiorucci was born in Milan on 10 June 1935, son of a shoe shop owner. One day in 1962, Elio came up with the idea of making galoshes in bright primary colours whilst working at his father's shop. When they were featured in a local weekly fashion magazine, the galoshes caused a sensation. After a trip to London in 1965, Elio was determined to bring Carnaby Street fashions to Milan. He opened his first shop on Galleria Passarella in Milan on 31 May 1967, selling clothes by London designers such as Ossie Clark and Zandra Rhodes.[citation needed] In 1968, Fiorucci looked East for inspiration, buying cheap T-shirts from India and turning rice sacks into bags.[6] Two years later, the company set up its own manufacturing plant, and adopted the \"two angels\" logo created by Italo Lupi.[6] In 1974, the company opened a huge new store on Via Torino in Milan, expanding beyond fashion to offer books, furniture, and music.[6] The new shop also had a performance area, a vintage clothing market, and a restaurant,[6] and was financed by an investment from the Standa department stores, part of the Montedison group. Meanwhile, the label introduced the monokini and thong from Brazil, causing controversy with the topless photos used to advertise them.[6] Glass beads from New Mexico were another hit.[6] In 1975, the company opened its first store overseas, on the King's Road in London and launched a children's collection called Fioruccino.[6] It brought Afghan coats to the mass market and popularised the leopard-skin prints[6] first created by Elsa Schiaparelli two decades before. Heyday [edit]In 1976 Fiorucci opened a store in New York City, down the block from Bloomingdale's on East 59th Street between Lexington and Park Avenues in Manhattan,[6] with the goal of introducing the brand to American trendsetters during the disco age. Customers such as Cher,[1] and Terence Conran[1] rubbed shoulders with Jackie Onassis[1] and Lauren Bacall;[1] they might also see drag queen Joey Arias serving the King of Spain,[7] author Douglas Coupland absorbing the store's pop culture,[8] or Calvin Klein and Gloria Vanderbilt buying jeans.[1] In the early 1980s, Fiorucci's art director was jewelry designer Maripol, known for creating Madonna's look at the time. Other employees included Madonna's brother, Christopher Ciccone; Terry Jones of i-D magazine; Oliviero Toscani, who shot many of the famous Benetton ads;[1] and interior designer Jim Walrod.[1] In May 1979, the artist Kenny Scharf had his first solo exhibition in the New York City store, titled \"Fiorucci Celebrates the New Wave\" and featuring his colorful, retro-futuristic \"Estelle Series.\" The opening included a performance by Klaus Nomi, a classically trained countertenor.[9][10] Meanwhile, the company continued to bring new products to market, including velvet slippers from China and a collection made from DuPont's new Tyvek fabric.[6] In 1978, they were the first fashion house to license their name for a collection of sunglasses, whilst in 1981, a Disney license led to a highly successful range of clothes emblazoned with Mickey Mouse.[6] Ever on the pulse of the times, Fiorucci sponsored the reunion of Simon and Garfunkel in The Concert in Central Park on 19 September 1981, attended by 400,000 people or more, and on the bill for their birthday party in 1983 was a then-unknown Madonna.[6] In 1982, the company launched the first stretch jeans with Lycra, and the success of the 5-pocket \"Safety\" jeans was recognised three years later in a licensing deal with Wrangler Jeans.[6] In 1987, Fiorucci produced the Junior Gaultier line designed by Jean-Paul Gaultier,[6] and in 1989, they went back to their roots with a deal with Vivienne Westwood, queen of the London street scene.[6] The company expanded rapidly after 1978, launching new stores across the US, Europe and Asia. In 1981, Benetton bought Montedison's 50% stake in Fiorucci, which was reduced to 33.3% in 1986[11] when Elio Fiorucci brought in Iranian businessman Massimo Aki Nuhi (Akinouhi) as a third partner via his holding company Aknofin.[12] Benetton sold their remaining stake to Fiorucci and Aki Nuhi in August 1987.[12] Despite thriving sales, the company was dogged by poor management and had to close the New York store in 1986; Betsey Johnson has suggested \"Fiorucci was the most happening place. It never stopped being happening — it just left New York City, because I don't think New York City was happening enough by the mid-80's\".[1] Fiorucci closed down the rest of the US retail locations in 1988 after a franchise dispute, moving instead to a wholesale strategy. The company went into administration in April 1989, after a dispute over the strategic direction of the firm that had seen Elio offer to buy out Aki Nuhi.[13] Revival [edit]The company was rescued by the Tacchella brothers of Italian jeans company Carrera S.p.A., who sold on the company to Japanese jeans group Edwin Co., Ltd for 45bn lire (~US$41m).[14] In January 1996, after a plea bargain, Elio Fiorucci was given a suspended jail sentence of 22 months for inflating the value of invoices to increase the value of the company to Carrera at the expense of his creditors.[15] Luciano Benetton was cleared of similar charges, on the grounds that he had not been involved at an operational level during his time (September 1985 - September 1987) on the board of Fiorucci.[16] Originally, Edwin planned to launch five stores in key cities like London,[14] but although they signed an initial deal on 4 June 1990 that was ratified that October, Edwin did not gain control of the Fiorucci assets until May 1992.[17] In fact, they would later lose the rights to the Fiorucci name in Canada on the grounds of disuse.[17] However, one of Edwin's first acts was a deal with Coles Myer that would see 68 Fiorucci concessions in stores across Australia.[6] They opened a new store in Piazza San Babila, Milan in early 1993, that included a variety of branded boutiques.[18] It took them longer to get things going in North America, after a 1993 deal with Mary Ann Wheaton of Wheaton International[19] fell through. In 1995 they licensed the rights for eyewear in the US to Swan International Optical, and then opened a US office in September 1997.[20] However, the strategy of their licensee, Stephen Budd, to sell the brand into US department stores didn't work out,[1] so in 1999, they announced a plan to open a New York store once again.[21] The initial plan was to open in time for Christmas 1999, but the store on lower Broadway finally opened its doors in June 2001.[1] Commentators such as Kim Hastreiter were sceptical that it could recapture the buzz of times past, given the increased competition in mass-market clubbing gear from the likes of H&M and The Limited.[1] Meanwhile, the brand continued to thrive in Europe, and regained some of its former notoriety in 1995 with a poster campaign for its jeans featuring a naked woman's buttocks and pink furry handcuffs, which became instant bestsellers.[6] In 1999, it launched a successful perfume, followed by a second, Fiorucci Loves You, in 2001, and \"Miss Fiorucci\" makeup in 2003.[6] Edwin have been aggressively expanding the brand throughout Asia, from Seoul to Tokyo and China.[6] Although Elio Fiorucci retained creative control during the Edwin era, the new owners were protective of the Fiorucci trademarks, and took legal action against H&M in the US when Elio designed H&M's Poolside line. He had also set up a brand of his own called Love Therapy,[22] and designed for Agent Provocateur. In March 2003, Elio Fiorucci announced that after 36 years, he was closing the doors to his historic shop in Corso Vittorio Emmanuele, Milan. When Fiorucci hit the scene nearly 40 years ago, he blew Italy - and the rest of the world - away with a larger-than-life attitude. He brought in the new and unexpected, pre-dating the surge of today's \"lifestyle\" stores. Fiorucci mixed clothing with beauty products, vintage items, music and home furnishings. He even used his retail space for artistic performances. Elio, who had become an ethical vegetarian,[22] said the reason he was closing his shop was because he had \"fallen out of love\" with fashion. In 2015, the year Elio Fiorucci died, the brand was sold by the Japanese trading house Itochu to Janie Schaffer, an ex-CEO of Victoria's Secret, and her business partner and former husband Stephen. Their plans to relaunch the brand began in early 2017 with pop-up shops in Barneys in New York, and Selfridges and Harrods in London.[citation needed] In popular culture [edit]In 1979, along with Halston and Gucci, Fiorucci was name-checked in the Sister Sledge disco song, \"He's the Greatest Dancer\".[23] Another artist, singer and songwriter Terence Boylan, also name-checked Fiorucci in his 1980 song, \"Shake Your Fiorucci\" [(Suzy Terence Boylan Asylum 6E-201 (1980)]. As did Antipodean band Australian Crawl in their 1980 song, \"Hoochie Gucci Fiorucci Mama\", which also referenced Gucci. The Beverly Hills Fiorucci store was featured in the 1980 cult classic movie Xanadu, where the ELO video \"All Over the World\" was filmed. A fake Fiorucci store was built on the set of the final battle in New York City for the movie Superman II in 1979. Christopher Ciccone stated in his book Life with My Sister, Madonna that he worked at the Manhattan store in the early 80's; also stating that is where he met his lover. British artist Mark Leckey used the brand name in his landmark work from 1999, Fiorucci Made Me Hardcore.[24] Fiorucci was mentioned in the song \"Beverly Hills\" by the band The Circle Jerks. Brazilian band Mamonas Assassinas, in their song \"Pelados em Santos\", has the narrator mentioning buying Fiorucci pants and Reebok shoes to his beloved in Paraguay, a haven for counterfeit products. Argentinian band Sumo, in their song \"La Rubia Tarada\", mentions \"posh faces, crass glances and men fitted in Fiorucci\" in a description of a high-class aspiring, unauthentic youth culture. Argentinian rock superstar Charly García, in his song \"Dos Cero Uno\", mentions \"He got tired of making protest songs and sold out to Fiorucci,\" referencing what his detractors said about him leaving folk rock and switching to new wave. The 1981 EP Minor Disturbance by American punk band The Teen Idles featured the song \"Fiorucci Nightmare\". In 2017, American DJ Alex Gimeno best known for Ursula 1000 released the album Galleria which contains the single \"Fiorucci\". Also in 2017, Hyperpop artist Charli XCX released the album Number 1 Angel, upon which the song Babygirl mentions 'Fiorucci jeans'.[25] References [edit]- ^ a b c d e f g h i j k l m n Chaplin, Julia (2001), \"Fiorucci: Once So Hot and Now, Can It Be Again?\", New York Times (published 2001-06-10), retrieved 2008-04-29 - ^ \"Fashion designer Elio Fiorucci is dead\". ANSA.it. July 20, 2015. Retrieved July 20, 2015. - ^ Gonzalez-Rodriguez, Angela (2015-11-04). \"Former Victoria's Secret CEO Janie Schaffer buys Fiorucci\". FashionUnited. Retrieved 2024-05-10. - ^ Neel, Julia (2017-09-17). \"Fiorucci Toasts Reincarnation With Madcap London Party\". WWD. Retrieved 2024-05-10. - ^ \"Fiorucci Official Website\". - ^ a b c d e f g h i j k l m n o p q r s \"Memorabilia:Fiorucci's Steps\". Fiorucci Design Office S.r.l. 2004. Archived from the original (Flash) on 2008-02-25. Retrieved 2008-04-29. - ^ Lahr, John (1994-08-22), \"Arias On Holliday\", The New Yorker, p. 46 - ^ Colman, David (2007-09-30), \"Take a Sharp Turn at Fiorucci\", The New York Times - ^ Gruen, John, Keith Haring: The Authorized Biography, New York: Prentice Hall, 1991. - ^ Hager, Steven (1986), Art After Midnight: The East Village Scene, St. Martin's Press - ^ \"fallimento Fiorucci. Benetton \" indagato \"\", Corriere della Sera, p. 25, 1993-04-22, retrieved 2008-04-29 - ^ a b \"Benetton returns share of Fiorucci to Nuova Italia\", Daily News Record, 1987-08-28 - ^ \"Elio Fiorucci is buying his partner's 50% stake\", WWD, 1989-02-06 - ^ a b Bannon, Lisa (1991-02-01), \"Fiorucci plans collection, opening of 5 flagship stores\", WWD - ^ \"Bancarotta. Condannato lo stilista Fiorucci\", Corriere della Sera, p. 45, 1996-01-20, retrieved 2008-04-29 - ^ \"Bancarotta: a giudizio Luciano Benetton\", Corriere della Sera, p. 11, 1996-02-23, retrieved 2008-04-29 - ^ a b Gamache, Barry (1995). \"Serious Intent To Resume Use of Trade-mark Must Be Found to Excuse Absence Of Use In Summary Expungement Case\" (PDF). Leger Robic Richard / Robic, Quebec. Archived from the original (PDF) on 2011-06-12. Retrieved 2008-04-29. Discusses Canadian trademark case Edwin Company Ltd. v. 176718 Canada Inc., No. T-803-94, March 30, 1995; 60 CPR (3d) 464 (FCTD) in which Edwin appealed the 1994 loss of the rights to the Fiorucci name. - ^ Forden, Sara Gay (1993-11-08), Footwear News {{citation}} : Missing or empty|title= (help) - ^ Gordon, Maryellen; White, Constance C.R. (1993-08-03), \"Wheaton plans Fiorucci store comeback\", WWD - ^ Parr, Karen (1997-09-25). \"FIORUCCI EYES U.S. COMEBACK\". Women's Wear Daily. Archived from the original on 2023-04-20. Retrieved 2023-04-20. - ^ Cardona, Mercedes (1999-05-31), \"Fiorucci Dances Back Onto Scene: Italian Line That Ruled During Disco Returns To U.S. With Plans For Stores\", Advertising Age - ^ a b Giovanni Orso (2012-03-05). \"Visti da vicino: Elio Fiorucci\" (in Italian). Eco di Biella. Archived from the original on 2012-11-10. Retrieved 2013-03-04. - ^ \"He's The Greatest Dancer by Sister Sledge\". Songfacts. Retrieved 20 April 2023. - ^ Mark Leckey, \"Fiorucci Made Me Hardcore,\" Guggenheim, 1999. Accessed 09/13/17 https://www.guggenheim.org/artwork/15753 - ^ \"Charli XCX Gets Extremely Real About Her Mixtape And New Music\". The FADER. 2017-04-13. Retrieved 2023-11-03. Further reading [edit]- Babitz, Eve (1980), Fiorucci: The Book, Milan: Harlin Quist, distributed by Dial/Delacorte, p. 144, ISBN 978-0-8252-2608-3 Published at the height of the label's influence, this book is now a sought-after record of the time, selling for US$100's. - Malossi, Giannino (1987), Liberi Tutti: 20 Anni di Moda Spettacolo, Milan: Mondadori, ISBN 88-04-30544-4 Second edition published in 2007 by Lampi di Stampa, Milan ISBN 978-88-488-0629-9. - Mulassano, Adriana (1979), I Mass-moda: Fatti e Personaggi dell'Italian Look, Florence: Spinelli Editore - Connikie, Yvonne (1990), Fashions of a Decade: The 1960s, London: Batsford Ltd (published 1990-11-05), p. 64, ISBN 978-0-7134-6437-5 Also available in US editions"
}