{
  "url": "https://en.wikipedia.org/wiki/Lior",
  "title": "Lior - Wikipedia",
  "text": "Lior Lior Attar, better known simply as Lior,[1] is an independent Australian singer-songwriter based in Melbourne. He is best known for his 2005 debut studio album Autumn Flow, which featured singles such as \"Daniel\", the title track and his signature song \"This Old Love\". Early life and education [edit]Lior was born in Rishon LeZion, Israel and he and his family moved to Sydney when he was 10.[2][3] They made their first Australian home in Lane Cove, and Lior studied at Killara High School and the University of New South Wales.[4] Career [edit]2000–2007: Early EP, Autumn Flow and Doorways of My Mind [edit]In 2000, Lior released his debut extended play The Soul Suicide EP. In October 2004, Lior released his debut studio album Autumn Flow. Autumn Flow made its ARIA chart debut in early 2005, peaking at number 45. Lior has toured with the WOMAD festival in 2005 to the UK, Singapore and Korea. At ARIA Music Awards of 2005, the album was nominated for three awards; Breakthrough Artist, Best Male Artist, and Best Independent Release.[5] In 2005, the album was one of the fifteen nominees for radio station triple j's inaugural J Award,[6] given to \"an album of outstanding achievement as an Australian musical work of art – for its creativity, innovation, musicianship and contribution to Australian music.[7] Autumn Flow was certified gold by ARIA in 2006. In February 2006, Lior released a live album, Doorways of My Mind, recorded at the Northcote Social Club. The album consisted mostly of tracks from Autumn Flow as well as some new material such as \"Diego and the Village Girl\", \"Burying Chances\" and \"Avinu Malkeinu\" (a traditional prayer). At the ARIA Music Awards of 2006, the album was nominated for two awards; Best Independent Release and Best Blues and Roots Album. Lior moved from Sydney to Melbourne in 2007.[8] 2008–2012: Corner of an Endless Road, Tumbling into the Dawn and Giggle and Hoot [edit]In February 2008, Lior released his second studio album, Corner of an Endless Road. The album debuted at number 13 on the ARIA charts. At the ARIA Music Awards of 2008, the album was nominated for the Best Independent Release.[9] In 2008, Lior toured extensively, both in his home country of Australia and abroad including feature performances at the Edinburgh Festival. In early 2009, he performed with the Adelaide Symphony Orchestra for a series of outdoor concerts. In 2009, Lior launched the Shadows and Light Tour, a collaboration with renowned shadow artists Stephen Mushin and Anna Parry; an interactive performance combining Lior's music with live shadow art performance and featured a season at the Sydney Opera House.[10] In 2009, Lior was approached by children's television show Giggle and Hoot series producer Clare Gerber, and was asked to write a song. He agreed thinking \"this could be fun\" and wrote \"Hoot's Lullaby\". The song played nightly on ABC 2 just before 7:00pm, and marked the end of children's programming on the channel for the day.[11][12] In October 2010, Lior released his third studio album Tumbling into the Dawn. The album peaked at number 26 on the ARIA charts. In 2011 Lior wrote and recorded \"Hey Hootabelle\" for Giggle and Hoot. At the APRA Music Awards of 2012, the song won the APRA Award for Best Original Song Composed for Screen.[13] 2013–2018: Compassion, Scattered Reflections and Between You and Me [edit]In September 2013, Lior and Nigel Westlake premiered Compassion at the Sydney Opera House. Compassion is an orchestral song cycle for voice and orchestra consisting of original melodies and orchestration set to ancient texts in Hebrew and Arabic, all centred around the wisdom of compassion.[14][15][16][17] The performance was recorded and the album of Compassion was released in November 2013. At the ARIA Music Awards of 2014, it won the ARIA Award for Best Classical Album. Lior premiered Compassion in the US with the Austin Symphony Orchestra in 2016 and was subsequently awarded the Austin Table Critics' Award for Best Symphonic Performance of 2015-16 and in 2016 Lior also won the Melbourne Music Prize Civic Choice Award for Compassion.[citation needed] In March 2014, Lior released his fourth studio album Scattered Reflections. The album peaked at number 23 on the ARIA charts. In April 2015, Lior was invited as the sole Australian artist to perform at the prestigious 100 year anniversary of the landing at Gallipoli, performing his song \"Safety of Distance\" with the Gallipoli choir leading in to the dawn service.[18] In June 2015, Autumn Flow was re-released as a tenth anniversary edition.[19] From December 2015, Lior played the part of Motel Kamzoil in Fiddler on the Roof at Melbourne's Princess Theatre opposite musical theatre star Anthony Warlow.[20] In 2016, Lior worked with producer Tony Buchen to write an orchestral score for The Wider Earth, a Queensland theatre production based on Charles Darwin's journey on HMS Beagle.[21][22][23] At the 2016 Matilda Theatre Awards, the music won Best Original Theatre Score.[24] In 2016 Lior co-wrote and recorded a children's album with The Idea of North and Elena Kats-Chernin for the HUSH Foundation. Created for the dual purpose of raising funds for the children's hospital as well as making original music to be played in the wards, the album A Piece of Quiet featured original music written to lyrics written by the children in the hospital wards and was released in October 2016. At the ARIA Music Awards of 2017, the album was nominated for Best Children's Album. Throughout 2018 Lior toured with Australian pianist and composer Paul Grabowsky in performing a collection of Lior's songs adapted and reinterpreted for piano and voice.[25] In 2019 Lior featured as the guest vocalist for the Australian Chamber Orchestra's 'Luminous' tour which toured nationally in Australia as well as performances in the Barbican in London.[26] In September 2018, Lior released his fifth studio album Between You and Me.[27] In 2018 Lior was awarded a Fellowship of the Australian Institute of Music in recognition of outstanding achievements and services to Australian music. 2019–present: Air Land Sea and Animal in Hiding [edit]In 2019, Lior formed the musical group Air Land Sea with Nadav Kahn and Tony Buchen. The group released four singles and a self-titled studio album across 2019.[28] In 2019 Lior was awarded the Sidney Myer Creative Fellowship, an award of A$160,000 over two years, given to mid-career creatives and thought leaders.[29] As part of the 2021 WOMADelaide concert series, Lior performed his symphony Compassion alongside composer Nigel Westlake and the Adelaide Symphony Orchestra.[30] In 2021, Lior collaborated with fellow singer-songwriter Domini Forster on Animal in Hiding. Lior said \"She's been my support act for awhile now, after awhile, she became the backing vocalist in my band and then leading up to my last solo album, we decided we'd have a crack at writing a song together.\"[30] The EP is scheduled for released on 15 October 2021. Philanthropy [edit]In a 2015 interview, Lior mentioned working for the charities Cambodian Children's Trust and Global Poverty Project as well as supporting Oscar's Law.[31] Discography [edit]Albums [edit]Studio albums [edit]Live albums [edit]Other albums [edit]Compilation albums [edit]Extended plays [edit]Certified singles [edit]Awards [edit]AIR Awards [edit]The Australian Independent Record Awards (commonly known informally as AIR Awards) is an annual awards night to recognise, promote and celebrate the success of Australia's Independent Music sector. ARIA Music Awards [edit]The ARIA Music Awards is an annual awards ceremony that recognises excellence, innovation, and achievement across all genres of Australian music. Lior has won two awards from nine nominations.[38] APRA Awards [edit]The APRA Awards are held in Australia and New Zealand by the Australasian Performing Right Association to recognise songwriting skills, sales and airplay performance by its members annually. Lior has won one award from five nominations.[39] J Award [edit]The J Awards are an annual series of Australian music awards that were established by the Australian Broadcasting Corporation's youth-focused radio station Triple J. They commenced in 2005. References [edit]- ^ Murfett, Andrew (15 February 2008). \"Empty halls are long gone for this muso on the rise\". Melbourne: The Age. Retrieved 12 April 2013. - ^ Iaccarino, Clara (7 November 2005). \"Lior happy to go with the Flow\". The Sydney Morning Herald. Archived from the original on 20 September 2014. Retrieved 12 April 2013. - ^ Dow, Steve (7 September 2009). \"Blend it like Bedouin\". Archived from the original on 3 November 2014. Retrieved 11 November 2010. - ^ Sams, Christine (26 September 2005). \"Softly, softly approach\". The Sun-Herald. Archived from the original on 12 March 2014. - ^ Duell, Chris (14 September 2005). \"Lior 3 ARIA Nominations\". LoudnLocal. Retrieved 14 October 2012. - ^ \"The J Award – Nominated Albums: Autumn Flow / Lior\". triple j – The J Awards. Australian Broadcasting Corporation. 2005. Archived from the original on 6 January 2011. - ^ \"The J Award – 2005\". triple j – The J Award. Australian Broadcasting Corporation. 2005. Retrieved 21 August 2019. - ^ Mathieson, Craig (9 February 2013). \"Songs in the key of co-operation\". The Sydney Morning Herald. Fairfax Media. - ^ Emerging artists dominate 2008 ARIA Award nominations (PDF), September 2008 - ^ \"Sydney Theatre Co Announces Lior Shadows & Light at Wharf\". broadwayworld.com. Wisdom Digital Media. 30 June 2009. Retrieved 13 October 2012. - ^ Kingsmill, Kate (25 January 2014). \"Expansion of Lior's horizon\". The Sydney Morning Herald. Fairfax Media. - ^ \"Lior Hoot's Lullaby\". TuneGenie. MusicToGo. 2009–2010. Retrieved 13 October 2012. - ^ \"2012 Winners\". Australasian Performing Right Association. 2012. Archived from the original on 14 April 2014. - ^ \"LIOR & WESTLAKE: SONGS WITH ORCHESTRA\". Sydney Opera House. Archived from the original on 21 April 2013. Retrieved 12 April 2013. - ^ \"Songs with Orchestra\". www.sydneysymphony.com. The Sydney Symphony. Retrieved 12 April 2013. - ^ Christopher, Lissa (31 August 2013). \"Songs of sorrow and hope\". The Sydney Morning Herald. Fairfax Media. Archived from the original on 5 September 2013. - ^ Cunningham, Harriet (9 September 2013). \"Showing their measure with sound of compassion\". The Sydney Morning Herald. Fairfax Media. Archived from the original on 3 August 2015. - ^ Cashmere, Paul (25 April 2015). \"Lior Performs Anzac Song At Gallipoli Dawn Service\". Noise11.com. Retrieved 13 December 2023. - ^ Barnes, Candice (13 July 2015). \"Lior looks back on Autumn Flow for Aussie anniversary tour\". The Sydney Morning Herald. Retrieved 21 August 2019. - ^ \"Fiddler on the Roof lures folk singer-songwriter Lior to musical stage\". The Australian. 29 December 2015. - ^ Cooper, Nathanael (9 April 2016). \"Puppets, Lior, Charles Darwin come together for theatre\". The Sydney Morning Herald. Fairfax Media. Archived from the original on 16 August 2016. - ^ Steller, Megan (12 April 2016). \"Darwin's journey of discovery brought to life with puppets\". Limelight Magazine. Archived from the original on 16 August 2016. - ^ Ritchie, Emily (14 July 2016). \"Where Beagle dares: The Wider Earth depicts a young Darwin\". The Australian. News Corp Australia. - ^ \"Lior - Yamaha - Music - Australia\". au.yamaha.com. Retrieved 13 December 2023. - ^ Travels, Theatre (8 June 2019). \"Review: Lior with Paul Grabowsky at The Dunstan Playhouse, Adelaide Festival Centre\". Theatre Travels. Retrieved 13 December 2023. - ^ \"A Beautiful Cohesion\". Australian Chamber Orchestra. Retrieved 13 December 2023. - ^ \"Lior - Between You and Me\". The Street Theatre. 1 August 2018. Retrieved 13 December 2023. - ^ \"New Album Review: Air Land Sea by Air Land Sea\". The Sound Check. 24 August 2019. Retrieved 19 February 2020. - ^ \"Past Award Recipients\". Sidney Myer Fund & The Myer Foundation. Retrieved 2 November 2022. - ^ a b \"Lior Is Reconnecting With People On A Live Level\". scenestr.com. 6 May 2021. Retrieved 14 October 2021. - ^ Picken, Matthew (23 October 2015). \"Matt Chats With Lior\". colosoul.com. Archived from the original on 7 March 2016. - ^ \"Discography Lior\". Australian Charts. Hung Medien. Retrieved 19 February 2020. - ^ \"ARIA Accreditations 2006\". ARIA. 2006. Retrieved 19 February 2020. - ^ Ryan, Gavin (2011). Australia's Music Charts 1988–2010 (PDF ed.). Mt Martha, Victoria, Australia: Moonlight Publishing. p. 167. - ^ \"ARIA Charts – Accreditations – 2025 Singles\" (PDF). Australian Recording Industry Association. Retrieved 14 May 2025. - ^ \"BIO\". Lior. Retrieved 19 February 2020. - ^ a b \"History Wins\". Australian Independent Record Labels Association. Archived from the original on 10 March 2016. Retrieved 18 August 2020. - ^ \"ARIA Awards Search Results – Lior\". ARIA Awards. Retrieved 19 February 2020. - ^ \"Lior APRA Awards\". APRA Awards (Australia). Retrieved 19 February 2020. - ^ \"The J Award 2005\". Triple J. Australian Broadcasting Corporation. 2005. Retrieved 15 August 2020. External links [edit]- Official web site - Lior discography at MusicBrainz"
}