{
  "url": "https://www.saberingles.com.ar/lists/irregular-verbs.html",
  "title": "Irregular Verbs - Lista de Verbos Irregulares en inglés",
  "text": "Presentamos aquí una lista de verbos irregulares en inglés con traducción al español. Por cada verbo se incluye: - el Infinitive (Infinitivo) - la forma del Simple Past (Pasado Simple, por ejemplo: I arrived yesterday) - el Past Participle (Participio Pasado, que se utiliza en el tiempo Present Perfect, por ejemplo: I have broken a glass) - su traducción al español Los verbos regulares forman el Simple Past y el Past Participle agregando -ed al infinitivo. Los verbos irregulares no siguen esta regla y deberás aprenderlos de memoria. También hemos compilado otras listas de verbos: Verbos para niveles básicos Verbos para niveles avanzados Si quieres practicar, prueba con los Ejercicios Interactivos ¿Cómo se forma el tiempo Pasado Simple? Simple Past ¿Cómo se forma el tiempo Presente Perfecto? Present Perfect Lista de verbos para niveles básicos Lista de verbos para niveles avanzados ¿Quieres hacer ejercicios de verbos? Mira aquí: Ejercicios para Nivel Básico Otras páginas que pueden interesarte: Libros recomendados (Ad) Inglés para Latinos Un programa de aprendizaje diseñado especialmente para latinos. Contiene un amplio rango de vocabulario, frases, tablas de verbos, preguntas y respuestas. Y lo más importante: el autor enseña la gramática en forma práctica, sin reglas aburridas. Ver más El Secreto para Hablar Inglés como un Nativo en 6 Meses Con este exitoso método aprenderás vocabulario, gramática y pronunciación rápidamente, sin memorizar reglas y sin esfuerzo. Sigue las instrucciones paso a paso para alcanzar el nivel más alto posible y hablarás inglés como un nativo. Ver más English for Everyone Este libro es fantástico para aprender vocabulario y expresiones mediante imágenes muy didácticas, en inglés americano y británico. Además ofrece gran variedad de ejercicios para practicar. Recomendado para todas las edades y niveles. Ver más"
}