{
  "url": "https://www.xe.com/en-gb/currencyconverter/convert/?Amount=1&From=EUR&To=GBP",
  "title": "1 EUR to GBP - Euros to British Pounds Exchange Rate",
  "text": "1 EUR to GBP - Convert Euros to British Pounds Xe currency converter 1.00 EUR = 0.86474534 GBP Mid-market rate at 00:21 UTC Speak with a currency expert today. We can beat competitor rates. We use the mid-market rate for our Converter. This is for informational purposes only. You won’t receive this rate when sending money. Login to view send rates Did you know you can send money abroad with Xe? EUR to GBP exchange rates today Convert Euro to British Pound Convert British Pound to Euro EUR to GBP chart See your 1 EUR in motion. Our live EUR to GBP chart tracks 12 months of real-time, mid-market rates and shows exactly how much your money was worth at any point in time. Want to know when the rate moves in your favor? Set a rate alert and we’ll let you know when it hits your target. 1 EUR = 0.864745 GBP Feb 5, 2026, 00:21 UTC EUR to GBP Chart Compare and save When you compare Xe to leading banks and providers, the difference is clear. Bank-beating rates and no hidden fees mean more value on every transfer. Sending 20,000.00 GBP - Provider - Xe - Exchange rate - 1.308000 - Transfer fee - 0 GBP - Recipient gets 26,160.00 USD +399.33 USD - Provider - Nationwide - Exchange rate - 1.289000 - Transfer fee - 15.00 GBP - Recipient gets 25,760.66 USD -399.33 USD Rates obtained as of 11/25/2025 The comparison savings are based on a single transfer from GBP 20,000 to USD. Savings are calculated by comparing the exchange rate including margins and fees provided by each bank and Xe on the same day 11/25/2025. The comparison savings provided are only accurate for the given example and may not include all costs and charges. Different currency exchange amounts, currency types, dates, times, and other individual factors will result in different comparison savings. These results may therefore not be indicative of actual savings and should be used for guidance only. The rate comparison chart is updated quarterly. Popular Euro (EUR) pairings International money transfers done right Xe makes international money transfers simple. See all pricing upfront, get reliable delivery estimates, and track every transfer in real time. Send to 190+ countries in 130+ currencies. Send money destinations Connecting the world More live EUR currency charts Currency information Learn more about the EUR and GBP EUR - Euro Our currency rankings show that the most popular Euro exchange rate is the EUR to USD rate. The currency code for Euros is EUR. The currency symbol is €. EuroGBP - British Pound Our currency rankings show that the most popular British Pound exchange rate is the GBP to USD rate. The currency code for British Pounds is GBP. The currency symbol is £. British PoundXe for business Global business payments simplified. Whether you need to make cross-border payments or FX risk management solutions, we’ve got you covered. Schedule international transfers across 130 currencies in 190+ countries. EUR to GBP frequently asked questions As of 00:21 UTC, the mid-market EUR to GBP rate is €1 = £0.8647. The mid-market rate is the midpoint between buy and sell prices in global currency markets. To see how much this transfer would be with Xe, visit our send money page. 1 EUR equals 0.86 GBP using the current mid-market exchange rate of £0.8647. If you're looking to send 1 EUR to GBP, check if Xe could save you money on your transfer. Get a live quote on our send money page and see the full price upfront. To convert currencies, visit the top our Currency Converter, select your preferred currency pair, enter your amount, and view the live mid-market rate. Yes. You can set up a EUR to GBP rate alert on our rate alerts page or within the Xe app. Get a notification when your desired rate is reached and stay on top of currency shifts. To see how much a 1 EUR to GBP transfer would cost with Xe, visit our send money page and enter your details into the live quoter. You will get real-time exchange rates, estimated delivery times, and all fees shown upfront before you start your transfer."
}