{
  "url": "https://internship.purcari.wine/",
  "title": "Program de internship Purcari - Obține experiență valoroasă în industria vinului în Chișinău, Moldova",
  "text": "Programul de Internship, lansat în cadrul Grupul de Vinării Purcari, este șansa noastră de a descoperi și de a dezvolta talente. În același timp, e punctul tău perfect de plecare pentru o experiență valoroasă. Te invităm să scrii istorie GRUPUL DE VINĂRII PURCARI, lider în industria vinicolă din Europa Centrală și de Est, își trasează originile încă din 1827. Renăscut în 2003, Grupul și-a consolidat poziția de pionierat, gestionând peste 1.450 de hectare de podgorii de primă calitate și operând șapte platforme de producție în România, Moldova și Bulgaria. Cu recunoaștere internațională, vinăriile noastre – Château Purcari, Crama Ceptura, Bostavan, Domeniile Cuza, Angel’s Estate, Bardar, și altele – demonstrează angajamentul nostru neclintit către excelență. Până în prezent, am obținut peste 130 de premii Decanter, iar în 2021, Château Purcari a fost onorat ca „Cea mai medaliată vinărie din lume”, subliniind performanța noastră excepțională la concursuri de prestigiu global. În plus, ca mărturie a succesului și inovației noastre, din februarie 2018, Grupul a făcut istorie prin listarea la Bursa de Valori București sub simbolul WINE, devenind astfel primul Grup de crame din Europa de Est care accede pe piața bursieră. Suntem mândri să fim cel mai mare exportator de vinuri îmbuteliate din Republica Moldova, având o prezență impresionantă în peste 40 de țări la nivel mondial. Echipa noastră, formată din peste 1000 de angajați pasionați, continuă să scrie istoria Grupului de Vinării Purcari zilnic, dedicându-se fără rezerve tradiției și inovației în arta vinificației. Îndemnăm entuziaștii vinului și profesioniștii aspiranți să se alăture programului nostru de internship și să devină parte din această călătorie extraordinară. Alăturați-vă nouă în continuarea tradiției, excelenței și inovației la Grupul de Vinării Purcari, acolo unde istoria și pasiunea se împletesc pentru a crea vinuri remarcabile, apreciate la nivel mondial. Află mai multe și cum se desfășoară procesul de selecție a candidaților Dacă ai nevoie să-ți amintești cum se scrie o scrisoare de intenție, descarcă modelul de aici Este important să indici în subiectul mesajului titlul poziției pentru care aplici, conform exemplului: Candidatură pentru Programul Internship Purcari: Junior Marketing Manager Perioadă depunere CV-uri: 2 săptămâni de la data lansării programului. Perioadă de selecție CV-uri: 4 săptămâni după încheierea perioadei de depunere a CV-urilor. * Doar candidații selectați în baza CV-ului și a scrisorii de intenție vor fi contactați pentru etapa de testare și interviu (online). Consultă mai jos pozițiile vacante lansate în cadrul Programului de Internship, înregistrându-te în programul de stagiere, și construiește-ți o carieră de succes. Beneficii Vei avea posibilitatea să relaționezi cu profesioniști din domeniu (vitivinicol și nu doar), de la care vei dobândi cunoștințe și abilități practice necesare în viitorul carierei tale. În calitate de stagiar, vei obține experiență valoroasă de muncă, inclusiv prin participarea la diverse workshop-uri, traininguri și cursuri de specialitate. Acestea îți vor servi un bun punct de plecare pentru explorarea oportunităților profesionale. Îți vei pune în aplicare și-ți vei întări soft skill-urile – calități personale care te vor avantaja în fața viitorilor angajatori. Printre cele mai necesare pentru o carieră de succes se regăsesc: încrederea în sine, comunicarea, gândirea creativă și critică, managementul timpului, luarea deciziilor, lucrul în echipă și leadership-ul. Acest program de internship poate reprezenta podul către viitorul tău job. Dacă vei da dovadă de implicare, vei da randament și te vei integra în echipă, sunt șanse să primești o ofertă de job chiar în cadrul Grupului Purcari. Este o prioritate pentru noi să-ți oferim acces la cele mai noi tehnologii, întrucât doar astfel vom pregăti angajați competitivi, inclusiv pentru piața internațională. Pe lângă experiența profesională valoroasă, mai oferim și remunerare de minimum 30% din salariul mediu pe această poziție. s. Purcari, rn. Ștefan Vodă. mun. Chișinău Locul de muncă este în Chișinău or. Chișinău mun. Chișinău Locul de muncă este în Chișinău or. Chișinău mun. Chișinău Locul de muncă este în Chișinău mun. Chișinău mun. Chișinău Locul de muncă este în Chișinău r.Strășeni, s.Onești mun. Chișinău Locul de muncă este în r. Vulcănești, s. Etulia sau r. Ștefan Vodă, s. Purcari mun. Chișinău mun. Chișinău Locul de muncă este în Chișinău Internshipul oferit de Purcari a fost o experiență tangentă cu studiile în domeniul financiar, pe care le-am absolvit. Această perioadă m-a provocat prin multitudinea și diversitatea de proiecte, contribuind, astfel, la dezvoltarea mea profesională și personală – motive care m-au determinat să devin parte a acestei companii. Victoria Moldovan Expert investiții, fuziuni și achiziții Audit Intern Stagiul de practică din cadrul Grupului Purcari reprezintă pista mea de lansare în carieră. Echipa prietenoasă, proiectele interesante și oportunitățile de dezvoltare m-au convins să rămân aici pentru a-mi dezvolta competențele de marketing și pentru a descoperi domeniul vitivinicol. Astăzi sunt mândră să activez acasă și să contribui la recunoașterea și promovarea vinului moldovenesc pe arena mondială. Adelina Palancica Brand Development Manager Marketing Sunt recunoscătoare că, în urma celor 6 luni de internship, am ajuns să fiu angajată în cadrul Purcari Wineries Group. În perioada stagiului de practică am învățat meserie de la cei mai buni și mi-am confirmat că marketingul este domeniul în care aș vrea să cresc profesional. Mă bucur să fac parte dintr-o echipă dinamică și vizionară. Agnesia Tonu Brand Development Cooordinator Marketing M-am aliniat culturii Purcari acum un an și sunt mândru de alegerea făcută. Provocările pe care le întâmpin zilnic îmi marchează parcursul profesional, îmi consolidează încrederea în sine și mă stimulează să devin mai bun de la o zi la alta. Le sunt recunoscător colegilor, care mă inspiră prin propriul exemplu, și pentru comunicarea eficientă din cadrul echipei. Anton Tofan Specialist Marketing Marketing Programul de internship este șansa companiei Purcari de a descoperi și de a dezvolta talente, precum și oportunitatea studenților și tinerilor specialiști în căutarea perspectivelor de carieră. La Purcari noi nu subapreciem și nu scutim de responsabilități, La Purcari noi ne concentrăm pe obiective, muncim cot la cot și culegem laurii împreună. În prima zi ești stagiar, în cea de-a doua ești deja specialist marketing, recruiter, tehnolog în vinificație etc. Astfel reușim să-i atragem și să-i creștem pe cei mai buni – prin sarcini și proiecte reale, datorită cărora stagiarii noștri progresează în 6 luni cât alții în 2 ani, aducând zilnic plusvaloare Grupului Purcari. Ludmila Stratuța Director Resurse Umane Oferim o gamă largă de programe de Internship – de la cele tehnice, de producere a vinului, de creștere a strugurilor, pe partea de agricultură, până la partea financiară – vânzări, audit, relații cu investitorii etc. Dacă îți dorești să scrii istorie, să pui umărul la ceva măreț, să contribui la dezvoltarea industriei viti-vinicole moldovenești, locul tău este la Purcari. Eugeniu Baltag Director Audit Intern"
}