{
  "url": "https://www.scientificamerican.com/article/nasa-delays-artemis-ii-moon-mission-to-march-after-critical-test-raises/",
  "title": "NASA delays Artemis II moon mission to March after critical test raises issues | Scientific American",
  "text": "NASA has delayed its upcoming moon mission to at least March following a crucial test of the Artemis II rocket. Technically a test flight, Artemis II will see four astronauts fly a 10-day journey around the moon and back to Earth, a mission that will take them farther into space than any human has gone before. NASA on Tuesday said the mission’s wet dress rehearsal, which involved fueling the Space Launch System (SLS) rocket, and then initiating a countdown sequence, had revealed issues with both the rocket and the Orion capsule that is supposed to house the four astronauts who will be flying on board. On supporting science journalism If you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today. Indeed, this critical test of Artemis II’s systems was not smooth sailing: some hours into fueling the rocket, the SLS appeared to be leaking liquid hydrogen from its core stage, which houses its main engines. That caused NASA to temporarily pause loading the rocket’s propellant in order to troubleshoot the problem. And later a valve on the Orion capsule malfunctioned as engineers also attempted to troubleshoot several dropouts of ground teams’ audio communications channels. Fuel leaks have plagued the SLS before. Artemis I, the predecessor mission to Artemis II, also suffered from fuel leaks during its wet dress rehearsal and at other points in the lead-up to the mission, causing its launch to be delayed by weeks. “We really did learn a lot from the Artemis I mission, and we implemented a lot of the lessons learned yesterday,” said Lori Glaze, acting associate administrator for NASA’s Exploration Systems Development Mission Directorate, at a press conference on Tuesday. “We also identified some additional issues [with Artemis II], and we will be tackling those.” In social media posts on X, NASA administrator Jared Isaacman acknowledged that the SLS “has the lowest flight rate ... of any NASA-designed vehicle” and that, “with more than three years between” the last Artemis launch and Artemis II, the agency had “fully anticipated encountering challenges.” At Tuesday’s press conference, John Honeycutt, chair of the Artemis II Mission Management Team, said teams had extensively tested the hydrogen propellant fuel lines for the SLS following the problems seen with Artemis I but that the issues that arose during Monday’s test fueling had “caught us off guard.” Glaze added that NASA does not have a new date for a second wet dress rehearsal yet. Editor’s Note (2/3/26): This article was updated after posting to include additional information."
}