{
  "url": "https://icriforum.org/about-coral-reefs/what-are-corals/",
  "title": "What are corals? | ICRI",
  "text": "Coral biology Corals are invertebrate animals belonging to a large group of colourful and fascinating animals called Cnidaria. Other animals in this group that you may have seen in rock pools or on the beach include jelly fish and sea anemones. Although Cnidarians exhibit a wide variety of colours, shapes and sizes, they all share the same distinguishing characteristics; a simple stomach with a single mouth opening surrounded by stinging tentacles. Each individual coral animal is called a polyp, and most live in groups of hundreds to thousands of genetically identical polyps that form a ‘colony’. The colony is formed by a process called budding, which is where the original polyp literally grows copies of itself. Coral are generally classified as either “hard coral” or “soft coral”. There are around 800 known species of hard coral, also known as the ‘reef building’ corals. Soft corals, which include seas fans, sea feathers and sea whips, don’t have the rock-like calcareous skeleton like the others, instead they grow wood-like cores for support and fleshy rinds for protection. Soft corals also live in colonies, that often resemble brightly coloured plants or trees, and are easy to tell apart from hard corals as their polyps have tentacles that occur in numerals of 8, and have a distinctive feathery appearance. Soft corals are found in oceans from the equator to the north and south poles, generally in caves or ledges. Here, they hang down in order to capture food floating by in the currents that are usually typical of these places. What are coral reefs? Hard corals extract abundant calcium from surrounding seawater and use this to create a hardened structure for protection and growth. Coral reefs are therefore created by millions of tiny polyps forming large carbonate structures, and are the basis of a framework and home for hundreds of thousands, if not millions, of other species. Coral reefs are the largest living structure on the planet, and the only living structure to be visible from space. As we currently know them, coral reefs have evolved on earth over the past 200 to 300 million years, and over this evolutionary history, perhaps the most unique feature of corals is the highly evolved form of symbiosis. Coral polyps have developed this relationship with tiny single-celled plants, known as zooxanthellae. Inside the tissues of each coral polyp live these microscopic, single-celled algae, sharing space, gas exchange and nutrients to survive. This symbiosis between plant and animal also contributes to the brilliant colors of coral that can be seen while diving on a reef. It is the importance of light that drives corals to compete for space on the sea floor, and so constantly pushes the limits of their physiological tolerances in a competitive environment among so many different species. However, it also makes corals highly susceptible to environmental stress. Coral reefs are part of a larger ecosystem that also includes mangroves and seagrass beds. Mangroves are salt tolerant trees with submerged roots that provide nursery and breeding grounds for marine life, that then migrate to the reef. Mangroves also trap and produce nutrients for food, stabilise the shoreline, protect the coastal zone from storms, and help filter land based pollutants from run off. Seagrasses are flowering marine plants that are a key primary producer in the food web. They provide food and habitat for turtles, seahorses, manatees, fish and foraging sea life such as urchins and sea cucumbers, and are also a nursery for many juvenile species of sea animals. Seagrass beds are like fields that sit in shallow waters off the beach, filtering sediments out of the water, releasing oxygen and stabilising the bottom. How do corals eat? While most of a corals diet is obtained from zooxanthellae, they can also ‘fish’ for food too. During feeding a coral polyp will extend its tentacles out from its body and wave them in the water current where they encounter small fish, plankton or other food particles. The surface of each tentacle has thousands of stinging cells called cnidoblasts, and when small prey floats or swims past, the tentacles fire these stinging cells, stunning or killing the prey before passing it to the mouth. How do they reproduce? Many coral species reproduce once or twice each year. Most coral species spawn by releasing eggs and sperm into the water, but the period of spawning varies from one species to another. When an egg and a sperm meet they form a larva known as a planula. The baby coral looks like a little tiny jellyfish and floats around near the surface at first, and then in the water column until it finds a suitable space to call home – usually a hard surface to attach to. Other limited distribution coral species are brooders. This is where only male gametes are released into the water, then taken in by female coral animals containing egg cells. Fertilization occurs inside the female coral, and a small planula develops inside it. This planula is released through the mouth of the female coral and drifts or crawls away to settle elsewhere and grow into a new colony. Coral spawning happens at the same time each year and appears to be related to the lunar cycle. This allows scientists and divers the opportunity to observe this magnificent phenomenon, along with all the fish and predators that come to feed on them. How fast do they grow? Even in ideal conditions, these reef building corals are slow growing. They exhibit a wide range of shapes. For instance, branching corals have primary and secondary branches. Sub-massive corals look like fingers or clumps of cigars and have no secondary branches. Table corals form table-like structures and often have fused branches. Elkhorn coral has large, flattened branches. Foliose corals have broad plate-like portions rising in whorl-like patterns. Encrusting corals grow as a thin layer against a substrate. Massive corals are ball-shaped or boulder-like and may be as small as an egg or as large as a house. Mushroom corals resemble the unattached tops of mushrooms. In general, massive corals tend to grow slowly, increasing in size from 0.5 cm to 2 cm per year. However, under favorable conditions (high light exposure, consistent temperature, moderate wave action), some species can grow as much as 4.5 cm per year. In contrast to the massive species, branching colonies tend to grow much faster, and under favorable conditions, these colonies can grow vertically by as much as 10 cm per year. Where are they found? Coral reefs are found throughout the oceans, from deep, cold waters to shallow, tropical waters. Temperate and tropical reefs however are formed only in a zone extending at most from 30°N to 30°S of the equator; the reef-building corals prefering to grow at depths shallower than 30 m (100 ft), or where the temperature range is between 16-32oc, and light levels are high. Source: NOAA’s National Ocean Service, Education Division Based on current estimates, shallow water coral reefs occupy somewhere between 284,000 and 512,000 km2 of the planet (cold-water (deep) coral reefs occupy even more area). If all the world’s shallow water coral reefs were crammed together, the space would equal somewhere between an area of land ranging from the country of Ecuador (the low estimate) to Spain (the higher estimate). This area-about 198 thousand square miles in an ocean of 140 million square miles-represents less than 0.015 percent of the ocean. Yet coral reefs harbor more than one quarter of the ocean’s biodiversity. That’s an amazing statistic when you think about it: no other ecosystem occupies such a limited area with more life forms. What does a coral reef look like? It was Charles Darwin who originally classified coral reefs as to their structure and morphology, and described them as follows: - Fringing reefs lie near emergent land. They are fairly shallow, narrow and recently formed. They can be separated form the coast by a navigable channel (which is sometimes incorrectly termed a “lagoon”). - Barrier reefs are broader and lie farther away from the coast. They are separated from the coast by a stretch of water which can be up to several miles wide and several tens of metres deep. Sandy islands covered with a characteristic pattern of vegetation have sometimes formed on top of a barrier reef. The coastline of these islands is broken by passes, which have occupied the beds of former rivers. - Atolls are large, ring-shaped reefs lying off the coast, with a lagoon in their middle. The emergent part of the reef is often covered with accumulated sediments and the most characteristic vegetation growing on these reefs consists of coconut trees. Atolls develop near the sea surface on underwater islands or on islands that sink, or subside."
}