{
  "url": "https://www.newsweek.com/entertainment/tv/love-is-blind-season-10-release-11440679",
  "title": "‘Love Is Blind’ Season 10: Release Date, Cast, Trailer and Latest Updates - Newsweek",
  "text": "“Love is Blind” Season 10 is fast approaching. The Emmy-nominated series, which premiered in 2020, releases on Netflix February 11th, 2026. And it's fair to say the contestants are in the mood for love. This season is set in Ohio, where singletons from across the state will once again attempt to spark connections with complete strangers without ever seeing what they look like. It follows an unprecedented 9th season which broke with convention. For the first time in the show's history, no one got married. “Whether they succeed or fail,” series creator Chris Coelen tells Tudum, “the trying is the most enjoyable and important part for me.” ‘Love is Blind’ Season 10 Release Date “Love is Blind” Season 10 releases on February 11th, 2026 on Netflix. ‘Love is Blind’ Season 10 Episodes “Love is Blind” Season 10 episodes release every Wednesday on Netflix, as confirmed by the streamer. ‘Love is Blind’ Season 10 Episode Release Schedule As with previous seasons, the first six episodes will release at once. Then, new episodes will air every Wednesday. The full “Love is Blind” Season 10 episode release schedule is as follows: - Episode 1 — February 11th, 2026 - Episode 2 — February 11th, 2026 - Episode 3 — February 11th, 2026 - Episode 4 — February 11th, 2026 - Episode 5 — February 11th, 2026 - Episode 6 — February 11th, 2026 - Episode 7 — February 18th, 2026 - Episode 8 — February 18th, 2026 - Episode 9 — February 18th, 2026 - Episode 10 — February 25th, 2026 - Episode 11 — February 25th, 2026 - Episode 12 — March 4th, 2026 ‘Love is Blind’ Season 10 Trailer The latest trailer for “Love is Blind” Season 10 released January 27th, 2026. It's focused on the brand new pod squad, which features the likes of senior marketing manager Dynasty, management consultant Tyler, and ER doctor Haramol. ‘Love is Blind’ Season 10 Singles There are 32 singles in “Love is Blind” Season 10, aged 28-38. They're all based in Ohio, from Cincinnati to Columbus. Netflix's official description of the show lists, “a dancer-turned-flight attendant, a former professional soccer player, an infectious diseases doctor, and plenty of pet parents.” There are also “a high number of women on the Leo/Virgo cusp paired alongside Pisces men — an intriguing combination when it comes to romance.” What Happened in ‘Love is Blind' Season 9 In “Love is Blind” Season 9, no one got married. That's a first for the long-running dating show. Series creator Chris Coelen tells Tudum, “While we’re always rooting for our participants to find a lifelong commitment — because that’s what they all say they come to Love is Blind for — most importantly, we root for them to make the decisions they feel are right for themselves. And I think that’s what happened here.”"
}