{
  "url": "https://www.formula1.com/en/latest/article/first-look-haas-show-off-their-new-livery-for-2026-f1-season.5h7RFMnGXxpcmIVY3D56Xi",
  "title": "FIRST LOOK: Haas show off their new livery for 2026 F1 season",
  "text": "FIRST LOOK: Haas show off their new livery for 2026 F1 season Haas have unveiled the livery for their 2026 Formula 1 challenger. Haas have unveiled their 2026 Formula 1 challenger, and a striking white and red livery, in a series of digital renders on social media, one week out from Barcelona Shakedown week. The American squad have stuck to their traditional approach of launching online before revealing their machine when it first hits the race track – rather than a bespoke event. Haas will run an unchanged line-up of Esteban Ocon and Ollie Bearman for their 11th season in Formula 1, with Ayao Komatsu continuing to lead the operation as Team Principal. Their reveal offered another glimpse into what we can expect from Formula 1's sweeping new chassis and Power Unit rules that will feature smaller and lighter race cars with engines that have a 50-50 power split between fuel and electric and run advanced sustainable fuel. The revised livery, which is predominantly white, also features increased branding from Toyota Gazoo Racing (TGR), who have expanded their collaboration with the team into a title partnership for 2026. Owner Gene Haas said: \"Like all teams, we’ve faced the challenge of competing in 2025 while looking to design and now build these new-regulation entries for the 2026 season. \"The pre-season will be crucial to understand what these cars are capable of and how the drivers, engineers and teams in general adapt to them. We at least have continuity in terms of the drivers, with Ollie [Bearman] and Esteban [Ocon], as well as in our design and engineering teams. \"Last season’s competition in the midfield was of an exceptionally high standard, it was tough, and we need to go out again and continue to develop – both on and off-track.\" Komatsu added: \"It feels almost a bit surreal to be unveiling a new car this early in the year but it’s not any less exciting venturing into a new F1 campaign – especially one with such a change in regulations. “We’re fully focused on being ready for Shakedown Week in Barcelona. It’s been a monumental effort from everyone on the team to work with such a tight turnaround time from the end of last season to putting cars on track in January. \"It goes without saying that after so much talk, we can’t wait to see how these cars will perform and what we’ll face as we then progress through our test programs ahead of Australia.\" Technical Director Andrea De Zordo said work on the 2026 car \"actually started in the second half of 2024 with a small group looking at the concept of the new car\" with a full switch over of resources being triggered after last year's summer break. Haas will head to Barcelona this weekend to begin their final preparations before the car breaks cover for the first time during the Shakedown Week at the Circuit de Barcelona-Catalunya on January 26. It's a five-day private test, where teams are permitted to run on three of the five days. They will then head to Bahrain for official pre-season testing on February 11-13 and February 18-20. Ocon, who will compete in his second season with Haas, said: \"I'm excited about this year. This team is really growing, and this team is learning a lot. Since I arrived, there have been a lot of great things that have happened. \"We’re growing the team and welcoming more partners, and it’s very serious how we’re going racing into this year. I really hope, and I trust that this team will give us a great tool to be fighting towards the front, and towards the points.\" Bearman, who will compete in his second season in F1 this year, added: \"I really upped my game, I felt like in the second half of the season, I started to put down some really strong results that I was really happy with, and that was critical for me. I'm excited to continue that this year.\" Haas – who will once again run Ferrari Power Units – will be looking to improve on their eighth-placed finish in the Teams' Championship last year. Next Up Related Articles - Team Previews 2026All you need to know about Williams - DRIVING TOMORROW: James Vowles on F1’s future - Antonelli outlines title goal ahead of 2026 season - Williams show off their new livery for 2026 F1 season - Button joins Aston Martin as Team Ambassador - DRIVING TOMORROW: Button on the future of the F1 driver pathway"
}