{
  "url": "https://beck-online.beck.de/Home/29341",
  "title": "Alle Module - Inhaltsübersicht Module - beck-online",
  "text": "Fachmodule Agrarrecht PLUS Das Fachmodul Agrarrecht PLUS enthält Kommentare, Handbücher, Entscheidungen, Aufsätze und Vorschriften zu allen für das Agrarrecht relevanten Rechtsbereichen. Es ermöglicht den Abonnentinnen und Abonnenten im Bereich des Agrarrechts fundierte und praxisgerechte Informationen schnell und einfach abzurufen und zu nutzen. zum InhaltAnwaltliches Berufsrecht PLUS Dieses Fachmodul gibt Ihnen für Ihre anwaltliche Tätigkeit eine sichere Basis. Von der BRAO, BORA und der FAO über die Anwaltshaftung bis zur Rechtschutzversicherung - das gesamte Berufsrecht der Rechtsanwälte wird so kompetent wie aktuell erläutert. Damit macht sich dieses Modul für Ihre Kanzlei schnell bezahlt. zum InhaltAnwaltsnotar PLUS Das Fachmodul Anwaltsnotar PLUS enthält Kommentare, Handbücher, Entscheidungen, Aufsätze und Vorschriften zu allen für den Anwaltsnotar relevanten Rechtsbereichen. Es ermöglicht allen, die als Anwaltsnotar tätig sind, fundierte und praxisgerechte Informationen schnell und einfach abzurufen und zu nutzen. zum InhaltArbeitsrecht INTERNATIONAL Bei der Beratung großer Unternehmen sind grenzüberschreitende Sachverhalte vielfach Normalität. Erweitern Sie darum Ihre Onlinebibliothek mit dem Modul Arbeitsrecht INTERNATIONAL um zahlreiche Kommentare und Handbücher zum europäischen Arbeitsrecht, manche davon in Englisch. Mit diesen Werken sind Sie ideal gerüstet für Ihre internationalen Mandate. Das Modul kann zu den drei Fachmodulen Arbeitsrecht PLUS, PREMIUM oder OPTIMUM hinzugebucht werden. zum InhaltArbeitsrecht PLUS Dieses Modul deckt mit seinen Kommentaren, Handbüchern, Formularen und Arbeitshilfen alle wichtigen arbeitsrechtlichen Themen ab. Mit den exklusiv enthaltenen Fachnews aus dem Arbeitsrecht sind Sie stets aktuell informiert. Enthalten ist außerdem Rechtsprechung zum Thema im Volltext, auch über die enthaltenen Zeitschriften hinaus. Das Aufbaumodul Arbeitsrecht PREMIUM ist die ideale sozial- und arbeitsrechtliche Ergänzung für Ihre komplexen Fälle. Mit dem umfangreichen Arbeitsrecht OPTIMUM sind Sie darüber hinaus auch für eine umfassende Recherche bis hin zu Detailfragen des Arbeits- und Sozialrechts für besonders anspruchsvolle Fälle gerüstet. Finden Sie im Modulvergleich das für Sie optimale Modul. zum InhaltArbeitsrecht OPTIMUM Das Fachmodul Arbeitsrecht OPTIMUM ist für all diejenigen geeignet, die noch tiefer in die Rechtsmaterie eintauchen möchten und die auf spezifische Fragen Antworten benötigen. So viele wertvolle Kommentare und Handbücher finden Sie sonst nirgendwo. Zusätzlich zu den Inhalten des Fachmoduls Arbeitsrecht PREMIUM stellt es weitere hochkarätige Handbücher und Kommentierungen zu Spezialthemen des Arbeitsrechts sowie zum Sozialrecht zur Verfügung, unter anderem Holthausen/Kurschat, Vertragsgestaltung für Geschäftsführer, Vorstände und Aufsichtsräte Willemsen/Hohenstatt/Schweibert/Seibt, Umstrukturierung und Übertragung von Unternehmen, sowie Linck/Krause/Bayreuther, Kündigungsschutzgesetz. Sehen Sie alle Vorteile auf einen Blick im Modulvergleich. Für die international ausgerichtete Praxis lässt sich das Modul mit Arbeitsrecht INTERNATIONAL erweitern. zum InhaltArbeitsrecht PREMIUM Mit einer erweiterten Auswahl an hilfreichen Kommentaren und Handbüchern vergrößert das Fachmodul Arbeitsrecht PREMIUM Ihren Recherchepool zum Arbeitsrecht und ergänzt den Umfang des Arbeitsrecht PLUS um sozialrechtliche Werke. Gegenüber dem Grundmodul stehen weitere Handbücher und Kommentierungen zum Arbeitsrecht und zusätzlich Werke zum Sozialrecht zur Verfügung, darunter Münchener Handbuch zum Arbeitsrecht, Bd. 1-4, Schaub, Arbeitsrechts-Handbuch und BeckOK Sozialrecht, Hrsg. Rolfs/Giesen/Meßling/Udsching. Noch mehr Inhalte auf dem Gebiet des Arbeitsrechts bietet für Spezialisten das Modul Arbeitsrecht OPTIMUM. Welches Modul für Sie das beste ist, zeigt Ihnen der Modulvergleich. zum InhaltArbeitsrecht in der Kirche PLUS Auf Grundlage des verfassungsrechtlich garantierten Selbstbestimmungsrechts sind die Kirchen befugt, die rechtliche Ausgestaltung ihrer Dienst- und Arbeitsverhältnisse selbst zu regeln. Mit diesem Fachmodul stehen Ihnen praxisrelevante Kommentare, Handbücher, Lexika etc. zum kirchlichen Arbeitsrecht zur Verfügung, die einen guten Einstieg in diese besondere Rechtsmaterie bieten, und alle arbeits- und tarifrechtlichen Fragen zuverlässig beantworten. zum InhaltArbeitsschutzrecht PLUS Dieses Fachmodul vereint Werke zum Arbeitsschutzrecht aus den verschiedenen Rechtsgebieten. Ob zum Arbeitszeitgesetz oder Sicherheit und Gesundheitsschutz: Mit diesem Modul sind Sie über die arbeitsrechtlichen Module hinaus gerüstet für die Beratung in arbeitsschutzrechtlichen Belangen. zum InhaltArzneimittelrecht Kohlhammer Dieses Fachmodul zum Arzneimittelrecht enthält den hochkarätigen Kommentar Sander zum Arzneimittelrecht und die dazugehörige Entscheidungssammlung, des mit beck-online kooperierenden Verlages W. Kohlhammer. zum InhaltAusländer- und Migrationsrecht PLUS Das Fachmodul erlaubt die schnelle Fallbearbeitung im Ausländer- und Migrationsrecht. Enthalten sind zahlreiche Standardwerke, alle wichtigen Gesetze, Formulare und ein umfassender Fundus an Rechtsprechung und Fachaufsätzen. Anmerkung der Datenbankredaktion: EZAR NF (Entscheidungssammlung zum Zuwanderungs-, Asyl- und Freizügigkeitsrecht) wird nicht mehr aktualisiert; in beck-online erfasst ist der Datenbestand ab 2005 bis Anfang 2021. Die aktuellen Kommentierungen mit weiterführender Literatur zum Migrations-, Einwanderungs-, Ausländer- und Asylrecht stehen Ihnen in unserem Aufbaumodul Ausländer- und Migrationsrecht PREMIUM zur Verfügung. zum InhaltAusländer- und Migrationsrecht PREMIUM Das Ausländer- und Migrationsrecht ist in den beiden letzten Jahrzehnten zu einer rechtlich und politisch zentralen Thematik aufgestiegen. Dieses PREMIUM-Modul berücksichtigt diese Relevanz und bietet Ihnen ein breites Spektrum an weiteren Nachschlagewerken zum Migrations-, Einwanderungs-, Ausländer- und Asylrecht, die das bisherige Fachmodul Ausländer- und Migrationsrecht PLUS inhaltlich ergänzen. Anmerkung der Datenbankredaktion: EZAR NF (Entscheidungssammlung zum Zuwanderungs-, Asyl- und Freizügigkeitsrecht) wird nicht mehr aktualisiert; in beck-online erfasst ist der Datenbestand ab 2005 bis Anfang 2021. zum InhaltBank- und Kapitalmarktrecht PLUS Das Online-Modul zum gesamten Bankrecht, zu KWG, Börsenrecht, Wertpapierrecht ... uvm. - aktuell, rechtssicher und komfortabel. Die Aufbaumodule Bank- und Kapitalmarktrecht PREMIUM und OPTIMUM sind die perfekte Ergänzung für Ihre komplexen Fälle. zum InhaltBank- und Kapitalmarktrecht PREMIUM Das Aufbaumodul Bank- und Kapitalmarktrecht OPTIMUM ist die perfekte Ergänzung für Ihre komplexen Fälle. Bank- und Kapitalmarktrecht OPTIMUM Banken-Regulatorik und Bankpraxis FCH In Kooperation mit Finanz Colloquium Heidelberg (FCH) bietet das Modul bewährte Lösungen speziell für die Bankpraxis sowie für die korrekte Umsetzung und Einhaltung aller (aufsichts-) rechtlicher Vorgaben. Praktische Checklisten für die tägliche Arbeit sowie Prüfungsansätze für interne und externe Prüfungen liefern konkrete Hilfestellungen von der Strategieebene bis auf die unterste Arbeitsebene für alle Fachbereiche einer Bank oder eines Finanzdienstleistungsunternehmens. zum InhaltBaurecht Öffentliches Baurecht Kohlhammer Öffentliches Baurecht PLUS Öffentliches Baurecht PREMIUM Das neue Modul Öffentliches Baurecht PREMIUM bietet zusätzlich zu den PLUS-Inhalten nützliche und wichtige Werke zum Bauplanungs- und Fachplanungsrecht. Auch Spezialthemen wie die EU-Bauproduktenverordnung oder die Immobilienwertermittlungsverordnung werden behandelt. Der BeckOK Bauvertragsrecht und der BeckOK Vergaberecht erweitern das Themenspektrum. zum InhaltPrivates Baurecht ibr-online Für die erweiterte Recherche: Privates Baurecht ibr-online & Privates Baurecht PLUS: Mit der Kombination der Inhalte der beiden Module des ID-Verlages und des Verlages C.H.BECK verfügen Sie über ein besonders umfassendes Angebot zum Bau- und Architektenrecht in einem Modul. Privates Baurecht ibr-online/Privates Baurecht PLUS Privates Baurecht ibr-online & Privates Baurecht PLUS – darauf können Sie bauen: maßgebende und top-aktuelle Inhalte. Eine Kooperation des id Verlages und des Verlages C.H.BECK. Privates Baurecht ibr-online/Privates Baurecht PREMIUM Privates Baurecht ibr-online & Privates Baurecht PREMIUM – darauf können Sie bauen: maßgebende und top-aktuelle Inhalte. Eine Kooperation des id Verlages und des Verlages C.H.BECK. Privates Baurecht PLUS Die maßgebenden Kommentierungen und Handbücher, u.a. Kapellmann/Messerschmidt, VOB A/B; BeckOK Bauvertragsrecht und neu: BeckOK HOAI (vormals Messerschmidt/Niemöller/Preussner, HOAI); Messerschmidt/Voit, Privates Baurecht. Umfangreiche Rechtsprechung und Aufsätze aus Beck‘schen Zeitschriften, Gesetzestexte, praktische Formulare und führende Zeitschriften wie NZBau ab 2000 und ZfBR ab 1999. Das maßgebliche private Bau- und Architektenrecht wissenschaftlich fundiert und praxisgerecht erläutert. Für die erweiterte Recherche: Privates Baurecht ibr-online/Privates Baurecht PLUS: Mit der Kombination der Inhalte der beiden Module des ID-Verlages und des Verlages C.H.BECK verfügen Sie über ein besonders umfassendes Angebot zum Bau- und Architektenrecht in einem Modul. Privates Baurecht PREMIUM Privates Baurecht PREMIUM ergänzt das Modul Privates Baurecht PLUS und bietet zusätzlich wichtige Werke für die Bearbeitung baurechtlicher Angelegenheiten. Die Beck'schen VOB- und Vergaberechts-Kommentare VOB Teil B und Teil C sind ebenso enthalten wie der neue BeckOK HOAI (vormals Messerschmidt/Niemöller/Preussner, HOAI), der HOAI-Kommentar von Fuchs/Berger/Seifert und das Praxishandbuch Architektenrecht von Thode/Wirth/Kuffer. Umfangreiche Kommentierungen des neuen Bauvertragsrechts finden Sie im MüKo BGB, Band 6/III, und im BeckOK Bauvertragsrecht. Dem Praktiker erleichtern verschiedene Formularbücher die Arbeit. zum InhaltBeamtenrecht PLUS Ein nicht unbedeutender Teil der Erwerbstätigen befindet sich in einem öffentlich-rechtlichen Dienstverhältnis als Beamtin oder Beamter. Mit dem Fachmodul Beamtenrecht PLUS haben Sie ein starkes Werkzeug zur Bearbeitung dieses Sonderrechts aus dem Bereich des öffentlichen Diensts zur Hand. Das Fachmodul verfügt über Kommentare und Handbücher zu maßgeblichen bundesrechtlichen Regelungen im Beamtenrecht, Kommentierungen des Landesrechts in Baden-Württemberg, Bayern, Hessen, Niedersachsen und Nordrhein-Westfalen, eine umfangreiche Sammlung bundes- und landesrechtlicher Vorschriften sowie einschlägige Entscheidungen. zum InhaltBeck-Kommunalpraxis Beck-KOMMUNALPRAXIS Baden-Württemberg PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Baden-Württemberg PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank. Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften, umfangreicher Rechtsprechung und Fachnews. Beck-KOMMUNALPRAXIS Bayern PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Bayern PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank. Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Brandenburg PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Brandenburg PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Hessen PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Hessen PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Mecklenburg-Vorpommern PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Mecklenburg-Vorpommern PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften, umfangreicher Rechtsprechung und Fachnews. Beck-KOMMUNALPRAXIS Niedersachsen PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Niedersachsen PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Nordrhein-Westfalen PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Nordrhein-Westfalen PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\", die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften, umfangreicher Rechtsprechung und Fachnews. Beck-KOMMUNALPRAXIS Rheinland-Pfalz PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Rheinland-Pfalz PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Sachsen PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Sachsen PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Sachsen-Anhalt PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Sachsen-Anhalt PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Schleswig-Holstein PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Schleswig-Holstein PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\" sowie die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. Beck-KOMMUNALPRAXIS Thüringen PLUS Das Fachmodul Beck-KOMMUNALPRAXIS Thüringen PLUS bietet Kommentierungen, Texte und Rechtsprechung für das gesamte Bundes-, Landes- und Kommunalrecht in einer einzigen Datenbank: Die \"Praxis der Kommunalverwaltung\", die stets aktuellen Beck´schen Online-Kommentare zum TVöD, TV-L, zur TV-L Entgeltordnung und zum VwVfG vereint mit Beck’schen Gesetzestexten, Zeitschriften und umfangreicher Rechtsprechung sowie Fachnews. BeckOK Steuerrecht Das Fachmodul BeckOK Steuerrecht bietet sämtliche steuerrechtlichen BeckOK zum Vorzugspreis. Topaktuell und praxisgerecht werden die wichtigsten deutschen Steuergesetze und das Verfahrensrecht von renommierten Autoren kommentiert. zum InhaltBetreuungsrecht PLUS Bilanzrecht Grundmodul Das Bilanzrecht Grundmodul liefert Ihnen die wichtigsten Materialien zur Bilanzerstellung und -prüfung. Es enthält nicht nur den führenden Kommentar zum Handels- und Steuerbilanzrecht – den Beck'schen Bilanz-Kommentar, sondern auch das Handbuch Deubert/Förschle/Störk, Sonderbilanzen. Die einschlägigen Steuer- und Wirtschaftsgesetze, die internationalen Rechnungslegungsstandards und Verordnungen der EU, Verwaltungsvorschriften der Steuerbehörden sowie die einschlägige Rechtsprechung zum Bilanz- und Steuerrecht (u.a. EuGH, BFH, FG, BGH, OLG) sind auch in diesem Modul im Volltext enthalten und abrufbar. zum InhaltBilanzrecht PLUS Bei der Bilanzerstellung und -prüfung erhalten Sie kompetente Unterstützung durch das erweiterte Modul Bilanzrecht PLUS. Es enthält den führenden Kommentar zum Handels- und Steuerbilanzrecht – den Beck'schen Bilanz-Kommentar – sowie zusätzlich Hopt, HGB (§§ 238 bis 342e HGB). Die einschlägigen Steuer- und Wirtschaftsgesetze, die internationalen Rechnungslegungsstandards und Verordnungen der EU, Verwaltungsvorschriften der Steuerbehörden sowie die einschlägige Rechtsprechung zum Bilanz- und Steuerrecht (u.a. EuGH, BFH, FG, BGH, OLG) im Volltext sind ebenso abrufbar. Im Preis enthalten ist die monatliche Print-Ausgabe der \"BC - Zeitschrift für Bilanzierung, Rechnungswesen und Controlling\" mit Onlinearchiv. zum InhaltBilanzrecht PREMIUM Bilanzrecht PREMIUM - Das Modul für den Profi bei Bilanzerstellung und -prüfung in Beck-Qualität. Sie erhalten kompetente Unterstützung durch den führenden Kommentar zum Handels- und Steuerbilanzrecht – den Beck'schen Bilanz-Kommentar, den Münchner Kommentar zum HGB, Band 4: §§ 238-342e und Hopt, HGB (§§ 238 bis 342e HGB). Mit dem IFRS-Handbuch und dem Deubert/Förschle/Störk, Sonderbilanzen stehen Ihnen weitere Nachschlagewerke für die praktische Arbeit zur Verfügung. Natürlich enthält das Modul auch die einschlägigen Gesetze, Entscheidungen und Verwaltungsvorschriften für die tägliche Arbeit. Im Preis enthalten sind die monatlichen Print-Ausgaben der \"BC - Zeitschrift für Bilanzierung, Rechnungswesen und Controlling\" und der \"IRZ - Zeitschrift für Internationale Rechnungslegung\" jeweils mit Onlinearchiv. zum InhaltCompliance PLUS Das Thema Compliance hat in den letzten Jahren eine rasante Entwicklung genommen und für die Unternehmen erheblich an Bedeutung gewonnen: sie werden mit einer wachsenden Zahl von Compliance-Herausforderungen konfrontiert und die wirtschaftlichen Auswirkungen von Compliance-Verstößen können existenzbedrohende Ausmaße annehmen. Dieses Fachmodul bietet Ihnen eine unerlässliche Arbeitsgrundlage für Ihre tägliche Praxis: Aktuelle Kommentare, Handbücher und Lexika helfen Ihnen dabei, Compliance-Verstöße effizient und wirksam vorzubeugen. Die perfekte Ergänzung für die vertiefte Recherche - die Aufbaumodule Compliance PREMIUM und Compliance OPTIMUM. Compliance PREMIUM Dieses PREMIUM-Fachmodul bietet umfassende und aktuelle Informationen zu den Themen Lieferkettensorgfaltspflichtengesetz, Risikomanagement, Außenwirtschaftsrecht, Lobbyregistergesetz, DS-GVO sowie CSR. Es vertieft das gleichnamige PLUS-Modul u.a. mit der Zeitschrift NZWiSt. Das Aufbaumodul Compliance OPTIMUM ist die perfekte Ergänzung für Ihre komplexen Fälle. zum Inhalt Compliance OPTIMUM Dieses Fachmodul erweitert die gleichnamigen PLUS- und PREMIUM-Module und bietet die optimale Information für Unternehmensvorstände, Compliance-Abteilungen, Verantwortliche im Risikomanagement, Rechtsanwaltskanzleien im Bereich Wirtschaftsrecht und entsprechende Kontrollbehörden. Im Modul enthalten sind weitere hochkarätige Handbücher und Kommentierungen zu Spezialthemen wie LkSG, HinSchG, ESG-Compliance, unter anderem: - Fleischer/Mankowski, Lieferkettensorgfaltspflichtengesetz; - Hilgendorf/Roth-Isigkeit, Die neue Verordnung der EU zur Künstlichen Intelligenz; - BeckOK HinSchG, Hrsg. Colneric/Gerdemann Corona und COVID-19 PLUS Datenschutz- und Informationsfreiheitsrecht PLUS Datenschutzfragen begegnen immer mehr Juristen in ihrer täglichen Arbeit. Datenschutz-Folgenabschätzung, Meldepflichten bei Datenschutzverletzungen, Cookie-Zustimmung und Online-Tracking, Gesichtserkennung oder das Mitarbeiterscreening prägen die Beratungspraxis und die Auseinandersetzungen vor Gericht. Neben der Datenschutz-Grundverordnung (DS-GVO) und dem BDSG sind zahlreiche sondergesetzliche Vorschriften zu beachten. Diese Normen werden eingehend kommentiert. Die Zeitschrift ZD sowie umfangreiche Sammlungen von Normen, Rechtsprechung und Aufsätzen halten das Modul stets aktuell. Bitte beachten Sie auch das Aufbaumodul Datenschutz- und Informationsfreiheitsrecht PREMIUM. zum InhaltDatenschutz- und Informationsfreiheitsrecht PREMIUM Das PREMIUM-Fachmodul zum Datenschutz- und Informationsfreiheitsrecht begleitet die dynamische Rechtsentwicklung stets aktuell und zuverlässig. Zusätzlich zu den Inhalten von Datenschutz- und Informationsfreiheitsrecht PLUS finden Sie hier weitere renommierte Werke wie etwa Ehmann/Selmayr, Datenschutz-Grundverordnung, oder v.d. Bussche/Voigt, Konzerndatenschutz. Nützlich sind auch die Kommentare zu wichtigen Landesdatenschutzgesetzen und zu Sonderthemen wie dem BMG sowie die Handbücher zum bereichsspezifischen Datenschutz. zum InhaltDatenwirtschaftsrecht PLUS Die EU-Regelungen zu Datenzugang, -austausch und -nutzung sind komplex und werden oft als unübersichtlich empfunden. Dabei geht es insbesondere um sehr große Online-Dienste und um Daten ohne Personenbezug, sogenannte \"Big Data\". Das Fachmodul zum Datenwirtschaftsrecht bietet konzentrierte Informationen insbesondere zum Digital Services Act (DSA), Digital Markets Act (DMA), Data Governance Act (DGA) sowie zum deutschen Datennutzungsgesetz (DNG). Jetzt mit MMR - Zeitschrift für das Recht der Digitalisierung, Datenwirtschaft und IT. zum InhaltDVEV DVEV Basismodul Das DVEV Basismodul ist speziell für die Mitglieder der Deutschen Vereinigung für Erbrecht und Vermögensnachfolge e.V. (DVEV) entwickelt worden. Es bietet Zugriff auf eine umfangreiche Bibliothek mit Kommentaren, Handbüchern, Formularen, Rechtsprechung, Gesetzen, Fachnews und Arbeitshilfen des Verlages C.H.BECK, des NOMOS Verlages, zerb Verlages und des Deutschen Anwaltverlages. Zum Basismodul werden Erweiterungsmodule speziell zu den Bereichen Familienrecht, Steuerrecht, Erbrechtliche Berechnungen sowie zum BeckOGK zum Zivilrecht angeboten. Den umfangreichsten Inhalt mit zusätzlichen Werken aus den Bereichen des Steuerrechts und des Stiftungsrechts bietet das DVEV Premiummodul. Die Module sind exklusiv nur für Mitglieder des DVEV beziehbar. Ein gültiger Nachweis ist erforderlich. Bestellen Sie bitte per E-Mail: beck-online@beck.de. zum InhaltDVEV Premiummodul Das DVEV Premiummodul ist speziell für die DVEV Mitglieder entwickelt worden und bietet einen noch umfangreicheren Zugriff auf die erbrechtliche Bibliothek mit Kommentaren, Handbüchern, Formularen, Rechtsprechung, Gesetzen, Fachnews und Arbeitshilfen des Verlags C.H.BECK, dem NOMOS Verlag, dem zerb Verlag und dem Deutschen Anwaltverlag. Insgesamt acht Titel aus den Bereichen des Steuerrechts, des Stiftungsrechts und dem internationalen Erbrecht erweitern das DVEV Basismodul. Zusätzlich sind die Erweiterungsmodule zu den Bereichen Familienrecht, Steuerrecht, Erbrechtliche Berechnungen sowie zum BeckOGK zum Zivilrecht erhältlich. Das Modul ist exklusiv für Mitglieder des DVEV beziehbar. Ein gültiger Nachweis ist erforderlich. Bestellen Sie bitte per E-Mail: beck-online@beck.de. Erweiterungsmodule DVEV beck-online.GROSSKOMMENTAR zum Zivilrecht Verlassen Sie sich in der weiten Welt des Zivilrechts für den Einstieg ebenso wie für die tiefgreifende Recherche auf eine gleichermaßen tiefgründige wie aktuelle Kommentierung. Mit dem Modul beck-online.GROSSKOMMENTAR zum Zivilrecht haben Sie eine umfassende und wachsende Sammlung der im BeckOGK kommentierten zivilrechtlichen Gesetze und Verordnungen zur Hand. Der beck-online.GROSSKOMMENTAR verbindet als innovative Großkommentierung, speziell für die digitale Nutzung entwickelt, das Niveau der umfangreichsten Erläuterungswerke mit den Vorzügen ständiger Aktualität. Fortlaufend arbeiten Sie mit der neuesten Kommentierung, ohne sich durch einen Dschungel unregelmäßig aktualisierter Einzelbände wühlen zu müssen. Der BeckOGK wird damit zum führenden Wegweiser durch das sich immer schneller wandelnde Recht. zum InhaltDVEV Erweiterungsmodul Erbrechtliche Berechnungen Online DVEV Erweiterungsmodul Familienrecht DVEV Erweiterungsmodul Steuerrecht Energierecht PLUS Dieses Fachmodul deckt den öffentlich- und privatrechtlichen Ordnungsrahmen der Energiewirtschaft, insbesondere auch das Regulierungsrecht, ab. Die Energiewende ist bereits weitgehend berücksichtigt. Neben den juristischen Themen werden auch energiewirtschaftliche Zusammenhänge und energiepolitische Zielsetzung behandelt. Im Mittelpunkt stehen die zahlreichen Kommentare und Handbücher sowie die Zeitschriften EnWZ, EWeRK und IR. Das Modul wird stets aktuell gehalten mit Aufsätzen, Rechtsprechung und Normen zum Energierecht. Für alle, die auch den von Säcker herausgegebenen Berliner Kommentar zum Energierecht nutzen wollen, steht das Aufbaumodul Energierecht PREMIUM bereit. zum InhaltEnergierecht PREMIUM Dieses PREMIUM-Fachmodul vertieft das Energiewirtschaftsrecht und ausgewählte Sonderbereiche wie das Energie- und Stromsteuerrecht. Im Mittelpunkt steht der von Säcker u.a. herausgegebene Berliner Kommentar zum Energierecht, der ab sofort als BeckOGK zum Energierecht fortgeführt wird. Als zusätzliche Zeitschriften sind Netzwirtschaften & Recht, N&R (dfv) sowie Klima und Recht, KlimR enthalten. zum InhaltErbrecht PLUS Das Online-Modul zum gesamten Recht der Vermögensnachfolge, zu Testamentsgestaltung und zu Unternehmensnachfolge – mit ausführlichen Kommentierungen, aktuellen Entscheidungen sowie Musterschriftsätzen, Vertragsmustern, Formulierungs- und Gestaltungsvorschlägen. Noch umfangreichere Informationen bietet das Modul Aufbaumodul Erbrecht PREMIUM. zum InhaltErbrecht PREMIUM Das Fachmodul Erbrecht PREMIUM erweitert das PLUS-Angebot z.B. mit den Werken Burandt/Rojahn, Erbrecht, Dutta/Weber, Internationales Erbrecht und Troll/Gebel/Jülicher, Erbschaftsteuer- und Schenkungsteuergesetz. Inhalte für die vertiefte Recherche bietet zusätzlich das Aufbaumodul Erbrecht OPTIMUM. zum InhaltErbrecht OPTIMUM Das Online-Angebot für die umfassendere Recherche. Zusätzlich zu den Inhalten der Fachmodule Erbrecht PLUS und PREMIUM finden Sie hier weitere renommierte Werke wie etwa Krug/Daragan/Bernauer, Die Immobilie im Erbrecht, Richter, Stiftungsrecht, und Bonefeld/Kroiß/Tanck, Der Erbprozess. zum InhaltEuroparecht PLUS Die große Europarecht-Bibliothek direkt auf Ihrem Schreibtisch - alles, was Sie täglich brauchen, papierlos, komfortabel zu durchsuchen, fundiert, einfach und schnell: - führende aktuelle Kommentare zu den europäischen Verträgen, wie z.B. die große Sammlung von Grabitz/Hilf/Nettesheim, Das Recht der Europäischen Union, oder Callies/Ruffert, EUV/AEUV, - maßgebende Kommentierungen zum Europäischen Sekundärrecht sowie zum Kartell- und Wettbewerbsrecht, zu Beihilfen, Grundrechten und Rechtsschutz, - umfangreiche und aktuelle Rechtsprechung im Volltext, dazu EuZW, EuR, euvr und ZaöRV, aktuelle Vorschriften und vieles mehr, intelligent und komfortabel verlinkt. Die aktuellen Kommentierungen mit weiterführender Literatur zum europäischen Primärrecht und ausgewählten Bereichen des Sekundärrechts, kombiniert mit umfangreichem Bestand an EU-Vorschriften, stehen Ihnen in unserem Aufbaumodul Europarecht PREMIUM zur Verfügung. Europarecht PREMIUM Dieses PREMIUM-Modul kombiniert die aktuellen Kommentierungen mit weiterführender Literatur zum europäischen Primärrecht und ausgewählten Bereichen des Sekundärrechts. Neben den großen Kommentaren zum Recht der EU, den führenden europarechtlichen Zeitschriften und einer umfassenden Rechtsprechungssammlung bietet das Modul Zugang zum umfangreichen Bestand an EU-Rechtsvorschriften Familienrecht PLUS Das Fachmodul Familienrecht PLUS bietet zu allen wichtigen familienrechtlichen Themen Kommentare, Handbücher u.a. Weiterer Bestandteil des Fachmoduls sind aktuelle Fachnews aus dem Familienrecht sowie über unsere Zeitschriften hinausgehende Rechtsprechung im Volltext. Noch mehr Inhalte finden Sie in den Fachmodulen Familienrecht PREMIUM und Familienrecht OPTIMUM. Familienrecht PREMIUM Das Fachmodul Familienrecht PREMIUM ergänzt das Basismodul Familienrecht PLUS um wichtige Kommentare und Handbücher zu allen relevanten Bereichen des Familienrechts einschließlich des Scheidungs- und Sozialhilferechts. Das Aufbaumodul Familienrecht OPTIMUM ist die perfekte Ergänzung für Ihre komplexen Fälle. Familienrecht OPTIMUM Das Fachmodul Familienrecht OPTIMUM ergänzt die Module Familienrecht PLUS und Familienrecht PREMIUM um wichtige Kommentare und Handbücher zu allen relevanten Bereichen des Familienrechts einschließlich des Sorgerechts, Versorgungsausgleichs, Adoptionsrecht, Betreuungsrecht, Internationalen Familienrechts und Verfahrens- und Steuerrecht. Gewerblicher Rechtsschutz PLUS Das Fachmodul bietet umfassende und aktuelle Informationen zum gesamten \"grünen Bereich\" inklusive Urheberrecht. Es enthält Highlights wie den Jahreskommentar Köhler/Bornkamm, UWG und die Zeitschriftenfamilie der GRUR. Ideal auch für Fachanwälte gemäß § 14h FAO. Bitte beachten Sie auch das Aufbaumodul Gewerblicher Rechtsschutz PREMIUM. zum InhaltGewerblicher Rechtsschutz PREMIUM Für komplexe Herausforderungen und ein breiteres Meinungsspektrum – mit allen Inhalten des PLUS-Moduls und weiteren Highlights. Dieses PREMIUM-Fachmodul vertieft das gleichnamige PLUS-Modul u.a. mit der Praktikerzeitschrift GRUR-Prax. Übrigens: Die ultimative Lösung ist Gewerblicher Rechtsschutz OPTIMUM. zum InhaltGewerblicher Rechtsschutz OPTIMUM Mehr geht nicht im Gewerblichen Rechtsschutz: Das neue OPTIMUM-Modul mit allen Inhalten des PREMIUM-Moduls und zahlreichen Spezialwerken u.a. zum Social-Media-Recht und Influencer-Marketing sowie mit dem Highlight MMR • Zeitschrift für das Recht der Digitalisierung, Datenwirtschaft und IT. zum InhaltHandels- und Gesellschaftsrecht INTERNATIONAL Das Ergänzungsmodul beinhaltet alle Themenbereiche des Internationalen Wirtschaftsrechts entsprechend dem neuen § 14n FAO und setzt dabei den Schwerpunkt im Handels- und Gesellschaftsrecht. Es liefert wichtige, praxisrelevante Aspekte für die erfolgreiche internationale Mandatsarbeit. Das Spektrum reicht von Kommentaren und Handbüchern bis zu Formular- und Lehrbüchern für den ersten Einstieg. Abgerundet wird das Modul durch die zweimonatlich erscheinende Zeitschrift für Internationales Wirtschaftsrecht (IWRZ). Einige Werke befinden sich noch in Vorbereitung. Voraussetzung für das Abonnement dieses Moduls ist der Bezug von Handels- und Gesellschaftsrecht PLUS, PREMIUM oder OPTIMUM. zum InhaltHandels- und Gesellschaftsrecht OPTIMUM Das Fachmodul bietet die optimale Information vor allem für Wirtschaftsjuristen, Rechtsanwälte und Richter. Zusätzlich zum Plus- und Premium-Modul stehen rund 30 wichtige Kommentare, Handbücher und Formularbücher wie der Münchener Kommentar zum GmbHG zur Verfügung. zum InhaltHandels- und Gesellschaftsrecht PLUS Das Fachmodul enthält namhafte Kommentare, Handbücher und Zeitschriften sowie Formulare, Entscheidungen, Aufsätze, Gesetze und Fach-News zum Handels- und Gesellschaftsrecht. Es beleuchtet das HGB und die Kernbereiche des Gesellschaftsrechts ebenso praxisnah wie wissenschaftlich fundiert. Damit ist das Modul in besonderer Weise für Anwaltskanzleien und Rechtsabteilungen in Unternehmen geeignet. Die Aufbaumodule Handels- und Gesellschaftsrecht PREMIUM und OPTIMUM sind die perfekte Ergänzung für Ihre komplexen Fälle. zum InhaltHandels- und Gesellschaftsrecht PREMIUM Das Fachmodul bietet fundierte und praxisgerechte Information vor allem für Wirtschaftsjuristen, Rechtsanwälte und Richter. Zusätzlich zum Plus-Modul stehen zahlreiche Premium-Inhalte zur Verfügung, allen voran die Münchener Kommentare zum HGB und zum AktG und die neuen Zeitschriften GWR Online und ZPG. Das Aufbaumodul Handels- und Gesellschaftsrecht OPTIMUM ist die perfekte Ergänzung für Ihre komplexen Fälle. zum InhaltHochschulrecht PLUS Das Fachmodul bündelt die laufend aktuellen BeckOK sowie weitere Werke zum Hochschulrecht verschiedener Bundesländer: Bayern, Baden-Württemberg, Niedersachsen, Hessen, Nordrhein-Westfalen und Hamburg. Daneben finden sich Standardwerke wie Fischer/Jeremias/Dieterich, Prüfungsrecht, alle wichtigen Gesetze und ein umfassendes Rechtsprechungsarchiv zum Hochschulrecht. zum InhaltIDW Bewertung und Transaktionsberatung Dieses Fachmodul bietet Ihnen das umfassende Fachwissen zur Unternehmensbewertung. Neben den aktuellen fachlichen Vorgaben berücksichtigt das Modul Hinweise und Lösungen für die praktische Umsetzung. Kernstück ist der Themenband Bewertung und Transaktionsberatung aus der WPH Edition. Dieser behandelt alle wichtigen Maßnahmen für die Absicherung von Käufen und Verkäufen von Unternehmen oder Unternehmensteilen mit Blick auf gesellschaftsrechtliche, umwandlungs- und kapitalmarktrechtliche wie auch steuerliche, erb- und familienrechtliche Aspekte. Abgerundet wird das Modul durch die entsprechenden IDW Verlautbarungen sowie weitere relevante Werke aus dem IDW Verlag. zum InhaltIDW Sanierung und Insolvenz Dieses Fachmodul bietet Ihnen das umfassende Fachwissen zur Sanierung und Insolvenz. Neben den aktuellen fachlichen Vorgaben berücksichtigt das Modul Hinweise und Lösungen für die praktische Umsetzung. Es wendet sich in erster Linie an Insolvenzrechtler. Kernstück ist der Themenband Sanierung und Insolvenz aus der WPH Edition, der die Beratung und Betreuung von in Schieflage geratenen Unternehmen beleuchtet. Wichtige Details nicht nur für Wirtschaftsprüfer enthalten die zehn für das Modul ausgewählten IDW Verlautbarungen. IDW Wirtschaftsprüfung Dieses Fachmodul wurde speziell für Wirtschaftsprüfer entwickelt. Die Inhalte des IDW Verlags und des Verlags C.H.BECK ergeben zusammen eine einzigartige Online-Datenbank, die Ihnen alle wesentlichen Fachinformationen für Ihre tägliche Arbeit zur Verfügung stellt: IDW Prüfungsstandards und weitere IDW Verlautbarungen, WP Handbuch (Hauptband) und der WPH-Band \"Assurance\", WPO Kommentar (Ziegler/Gelhausen), die Zeitschrift WPg – Die Wirtschaftsprüfung, Beck'sche Normen (Auswahl) sowie Rechtsprechung aus BeckRS und BeckEuRS (Auswahl). Das Modul kann mit weiteren bilanz-, steuer- und wirtschaftsrechtlichen Modulen von beck-online kombiniert werden. Genau darauf abgestimmt gibt es die Zusatzmodule Wirtschaftsprüfer und Steuerberater PLUS und Wirtschaftsprüfer und Steuerberater PREMIUM. Der Hauptband des WP Handbuchs und der Band \"Assurance\" sind enthalten. Die übrigen Bände der WPH Edition werden in dieses Modul nicht aufgenommen. Immobilien- und Immobilienwirtschaftsrecht PLUS Dieses Fachmodul bietet einen schnellen, wissenschaftlich fundierten und stets aktuellen Zugriff auf alle mit der Immobilie als Wirtschaftsgut zusammenhängenden Rechtsfragen unter Berücksichtigung ihrer wirtschaftlichen Bedeutung und der jeweiligen Rechtsprechung. Kommentare, Handbücher, RWS-Skripte, praxisgerechte Formulare, Zeitschriften und Fachdienste bieten umfassende Informationen zum Lebenszyklus der Immobilie. Besonderes Augenmerk liegt dabei auf dem jeweiligen Vertragsrecht und dem Vertragsmanagement. Eine fortlaufend aktualisierte Sammlung der wichtigsten Gesetze und Verordnungen rundet das Modul ab. Noch umfangreichere Informationen bietet das Aufbaumodul Immobilien- und Immobilienwirtschaftsrecht PREMIUM. zum InhaltImmobilien- und Immobilienwirtschaftsrecht PREMIUM Das Fachmodul Immobilien- und Immobilienwirtschafsrecht PREMIUM ergänzt das Basismodul Immobilien- und Immobilienwirtschafsrecht PLUS um wichtige Kommentare und Handbücher. Im Mittelpunkt stehen hier insbesondere betriebswirtschaftlich geprägte Themen, wie etwa Projektentwicklung, Finanzierung, Investitionen, Transaktionen, Steuerrecht oder Bewertung von Immobilien. Enthalten sind z.B. Meyer, Handbuch Immobilienwirtschaftsrecht, BeckOGK Zivilrecht (Auszüge) und die ZfIR – Zeitschrift für Immobilienrecht (RWS-Verlag). zum InhaltInsolvenzrecht PLUS Das Fachmodul Insolvenzrecht PLUS bietet ein umfangreiches Angebot an Kommentaren, Handbüchern, Aufsätzen, Gesetzen und Rechtsprechung. Noch mehr Informationen erhalten Sie mit dem Aufbaumodul Insolvenzrecht PREMIUM oder Sanierungsrecht PLUS. Insolvenzrecht PREMIUM Insolvenzrecht RWS Dieses Fachmodul umfasst insolvenzrechtliche Kommentare (u.a. KPB, Kommentar zur InsO), Handbücher und die Zeitschriften ZRI und ZVI des mit beck-online kooperierenden RWS Verlages. Neu hinzugekommen ist das journalistische Fachmagazin INDat Report. Es veröffentlicht Markttrends der Branche, investigative und hintergründige Recherchen, Praxisreports sowie Statistiken zu allen Insolvenzverwalterbestellungen. zum InhaltIT-Recht PLUS Das Fachmodul bietet fundierte und praxisgerechte Information für alle, die sich mit dem IT-Recht und dem Multimediarecht beschäftigen. Das Spektrum reicht vom klassischen Hard- und Softwarerecht über Datenschutz und E-Commerce bis zum unlauteren Wettbewerb und entspricht somit den Bedürfnissen der Fachanwaltschaft für Informationstechnologierecht (§ 14k FAO). Dies alles wird laufend aktuell gehalten. Das Aufbaumodul IT-Recht PREMIUM ist noch breiter angelegt und hilft bei der Lösung selbst schwierigster Fälle. zum InhaltIT-Recht PREMIUM Dieses Fachmodul bietet fundierte und praxisgerechte Information für alle, die sich vertieft mit dem IT-Recht und dem Multimediarecht beschäftigen. Die PREMIUM-Inhalte Auer-Reinsdorff/Conrad, Handbuch IT- und Datenschutzrecht, weitere Handbücher und Kommentare sowie ein Formularbuch lassen in diesem dynamischen Rechtsgebiet keine Wünsche offen. zum InhaltJA PREMIUM Das Modul JA PREMIUM ist speziell auf die Bedürfnisse von Jurastudenten zugeschnitten. Es umfasst: - studienrelevante Gesetzestexte - zwei BGB Kommentierungen - die stets aktuellen beck'schen Onlinekommentare zu GG, StGB, StPO, VwGO und VwVfG - über 16000 Rechtsprechungsdokumente (inkl. studienrelevanter Urteile) aus Beck'schen Zeitschriften - die Ja im Volltext ab Januar 2005 - monatlicher Printbezug der Zeitschrift JA (wird gesondert berechnet) JuS PREMIUM Das Modul JuS PREMIUM ist speziell auf die Bedürfnisse von Jurastudenten zugeschnitten. Es umfasst: studienrelevante Gesetzestexte zwei BGB Kommentierungen - die stets aktuellen beck'schen Onlinekommentare zu GG, StGB, StPO, VwGO und VwVfG über 16000 Rechtsprechungsdokumente (inkl. studienrelevanter Urteile) aus beck'schen Zeitschriften JuS Lernprogramme zum BGB FachNews die JuS im Volltext ab Januar 2000 - monatlicher Printbezug der Zeitschrift JuS (wird gesondert berechnet) Kartellrecht OPTIMUM Das OPTIMUM-Modul: Für komplexe Herausforderungen und ein breiteres Themenspektrum - mit den Zeitschriften ZWeR (RWS Verlag) und EuZW sowie profunden und innovativen Kommentaren. Und natürlich mit allen Inhalten von Kartellrecht PLUS und PREMIUM. Kartellrecht PLUS Dieses PLUS-Fachmodul zum Kartellrecht bietet einen guten Einstieg in das europäische und deutsche Recht. Die Kommentare, Handbücher und zwei Lehrbücher ermöglichen die rasche Orientierung. Ein Highlight ist die Neue Zeitschrift für Kartellrecht - NZKart. Besonders hervorzuheben ist die große Aktualität"
}