{
  "url": "https://secure.runescape.com/m=news/25th-anniversarycelebrations---this-week-in-runescape",
  "title": "25th Anniversary Celebrations - This Week In RuneScape - News - RuneScape - RuneScape",
  "text": "RuneScape's 25th Anniversary Celebrating 25 years of adventure Step into Gielinor to mark a celebration 25 years in the making! Celebrate the games 25th anniversary with a special activity featuring 25 bite-sized tasks, each inspired by a different year of the games history. Jump into the festively decorated Lumbridge castle courtyard and recall iconic moments as you journey through 25 years of adventure! Talk with RuneScape's first NPC Hans to get your list and set off around Gielinor on a little sightseeing trip! Complete all 25 tasks to earn yourself the Anniversary Cape but don't forget to pick up the scarf and snatch some cake as well! Other cities are also getting into the spirit and have put up some festive bunting! Inverted Skillcapes Gather up those shards! Alongside the 25th Anniversary celebrations Hans has got his hands on special upgrade tokens to unlock inverted coloured versions of the skillcapes, including the new Necromancy inverted skillcape! To earn an inverted skillcape, youll take part in a new annual progression system. Start by speaking with Hans and choosing the skill you want to focus on. While wearing that skills cape, head out and train as normal to collect upgrade shards. Gather enough shards to unlock the inverted 99 or 120 version of the cape, then return to Hans to exchange them for an upgrade token. Take that token to the relevant skill master, and theyll unlock the inverted cape for you. Its a simple journey: pick a skill, train it while wearing your cape, collect shards, and claim your reward! To take part, youll need to have reached at least level 99 in a skill. You can only focus on skills that are 99 or higher, and each year you can earn up to four inverted cape tokens as your cap will reset on the anniversary. If you choose to unlock both the 99 and 120 inverted versions for the same skill, this still counts as a single annual slot, its one journey with two milestones to achieve. Patch Notes Fixes and Improvements in this Week's Game Update General - Minimum combat level has been adjusted on the private instance of the Flesh-hatcher Mhekarnahz boss fight - Resolved an issue where the minions Flesh-hatch Mhekarnahz spawns would rarely stay alive on 0hp Community The latest updates from our community Runetube Scapers' Screenshots Pink Skirts Player Events Each week the Pink Skirts put on a selection of fun activities that everyone can join. Here are the main events this week: Croesus (Learner Event) - Wednesday 7th January, 18:00 Gametime - Who: Redwigon & Aarie - Where: Croesus front - World: 76 - FC: Ahelp Nex: Angel Of Death - When: Friday 09th January, 20:00 Gametime - Who: Pippyspot & Boss Guild - Where: Ancient Prison - Nex Lobby - World: 88 - FC: Boss Guild Skill 'n' Chill - When: Thursday 08th January, 20:00 Gametime - Who: MandyPandy & Spirits of Arianwyn - Where: Christmas Village - World: 116 If these don't take your fancy, take a look at the full events schedule here. Theres sure to be something youll enjoy! Community Spotlight Boss Guild Boss Guild are a learner friendly PvM community with over 10,000 members that host daily boss masses and events, along with teamfinding and forming. They'll be hosting some Angel Of Death masses to help the community learn the boss in a chill and relaxed environment with no requirements, newcomers and learners alike are welcome to join! Schedule (Gametime): - Friday 9th January - 20:00 - Angel Of Death Mass - Saturday 10th January - 20:00 - Angel Of Death Mass - Sunday 11th January - 20:00 - Angel Of Death Mass Join the friends chat \"Boss Guild\" and join up on Discord! - The RuneScape Team Mods Alex, Azanna, Bak, Balkan, Blkwitch, Boko, Brat, Breezy, Brig, Cajun, Camel, Colibri, Chaose, Dark, Daze, Desert, Dorn, Dragon, Drew, Drewid, Easty, Echo, Fallen, Forza, Fox, Frosch, Grace, Gunner, Helen, Hooli, Ink, Keyser, Kristy, Luma, Lunatear, Lykos, Lynx, Makkari, MIC, Morty, Muse, Nemo, Neong, Nixon, Noms, Pearce, Perpetua, Phoenix, Pickle, Pigeon, Rain, Ramen, Reaper, Rowley, Ryan, Samy, Sakura, Shiba, Shrew, Shrike, Skyefall, Socks, Soul, Sponge, Spyro, Stu, Sukotto, Taelae, Tiger, Titus, Toasty, Toebeans, Tri, Vegard, Volta, Who, Wov, Yuey & Zura"
}