{
  "url": "https://help.hbomax.com/us-en/Answer/Detail/000002552",
  "title": "HBO Max | Get help signing in to HBO Max using your HBO Max email and password.",
  "text": "Can't sign in to HBO Max If you're having trouble signing in to your HBO Max account, choose the device you're using below. Choose the device you're using: You may need to try more than one of these solutions: Try signing in to HBO Max on another supported device (computer or TV). Try signing in without your password. Here's how: - When prompted for your password, choose get a code instead. - Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code). This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). Didn't get the email? - Enter the 6-digit code from your email. - If prompted, add or update the password for your account. - Choose who's watching and you're ready to stream. If you signed up through Apple, try restoring your subscription. Here's how: - Open the HBO Max app on the iPhone or iPad where you subscribed to HBO Max. - Choose Sign In. - Choose Sign In and then Restore Purchase. If we find an active HBO Max subscription in the Apple App Store, we'll sign you into your HBO Max account. Try clearing the HBO Max cache: - On your Android device, go to Settings. - Choose Search and type HBO Max. - Choose HBO Max from the search results. - Choose Storage & cache or Storage. - Choose Clear cache. - Open HBO Max and try signing in again. - On your Amazon Fire tablet, go to Settings > App & Games > Manage All Applications. - Choose HBO Max from the list of apps. - Choose Force Stop. - Choose Clear Cache. - Choose Clear Data. - Open HBO Max and try signing in again. Delete the HBO Max app from your phone or tablet and install it again. Then, open HBO Max and try signing in again. If you get a 'Your device time is out of sync' error on your phone or tablet, make sure the date and time are correct on your device. For help, go to Google's Set date & time article or Apple's iPhone: Change time or iPad: Change time article. You may need to try more than one of these solutions: Try signing in to HBO Max on another supported device (phone, tablet, or TV). Try signing in without your password. Here's how: - When prompted for your password, choose get a code instead. - Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code). This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). Didn't get the email? - Enter the 6-digit code from your email. - If prompted, add or update the password for your account. - Choose who's watching and you're ready to stream. - Make sure you're using a supported browser. - Check to see if there's an update available for your browser. To find out how to do this, search the internet for update + the name of your browser (i.e., update Chrome). Try using a different supported browser (Chrome, Firefox, Microsoft Edge, or Safari). This will help determine if the issue is limited to a particular browser. - Clear your browser's cookies for HBOMax.com. To find out how to do this, search your browser's help for 'cookies.' - Close and reopen your browser. - Go to HBOMax.com and try signing in again. If you still can't sign in on your computer, try clearing your browser's cache. To find out how to do this, search your browser's help for 'clear cache.' If you're getting a 'Your device time is out of sync' error, make sure your computer's date and time are correct. For help, go to Microsoft's How to set your time article or Apple's Change date & time article. You may need to try more than one of these solutions: Try signing in to HBO Max on another supported device (phone, tablet, or computer). Try signing in without your password. Here's how: - When prompted for your password, choose get a code instead. - Check your inbox for an email sent by HBO Max (email subject: Time Sensitive: Your One-Time HBO Max Code). This email should arrive within a few minutes. Be sure to search all inbox folders (including Promotions, Junk, and Spam). Didn't get the email? - Enter the 6-digit code from your email. - If prompted, add or update the password for your account. - Choose who's watching and you're ready to stream. If you signed up through Apple, try restoring your subscription. Here's how: - Open the HBO Max app on the Apple TV where you subscribed to HBO Max. - Choose Sign In. - Choose Use Email Address and then Restore Purchase. If we find an active HBO Max subscription in the Apple App Store, we'll sign you into your HBO Max account. If the 6-digit code isn't working, here are some things to try: - Open a private or incognito browser window and then go to HBOMax.com/signin. - Try signing in another way (e.g. Use Email Address or scan the QR code on your TV). - Try using a different supported browser (Chrome, Firefox, Microsoft Edge, or Safari). Delete the HBO Max app from your TV device and then reinstall HBO Max from the app store. Then, open HBO Max and try signing in again. If you get a 'Your device time is out of sync' error on your computer, make sure your device's date and time are correct. For help, search the internet for 'Change device time + your device' (e.g. 'Change device time Android TV'). Sometimes we'll ask you to solve a puzzle to help keep your account secure. If you're having trouble with the Captcha puzzle challenge, choose Restart to start the challenge over. You can also choose Audio Challenge to access your account another way."
}