{
  "url": "https://www.cnbc.com/2026/02/04/trump-homan-minnesota-ice-immigration.html",
  "title": "Trump admin to withdraw 700 federal officers from Minnesota: Homan",
  "text": "The Trump administration will draw down 700 federal law enforcement officers from Minnesota \"effective immediately,\" White House border czar Tom Homan said Wednesday. After that partial withdrawal, around 2,000 federal agents will remain in the state — a roughly 25% reduction — with most concentrated in the Twin Cities area encompassing Minneapolis and St. Paul, Homan said at a news conference in Minneapolis. Homan announced the pullback after touting what he said was \"unprecedented cooperation\" between the federal government and state and local entities. That cooperation boosts efficiency, requiring fewer officers to be sent into communities \"to assume custody of a criminal alien target\" and freeing up resources, Homan said. \"More officers taking custody of criminal aliens directly from the jails, means less officers on the street doing criminal operations,\" he said. \"This is smart law enforcement, not less law enforcement.\" He repeatedly insisted the administration is \"not surrendering\" in Minneapolis, which has become a hotbed of civil unrest over the administration's aggressive deportation tactics. A \"complete drawdown\" in the area will depend on continued cooperation from state and local agencies, as well as \"the decrease of the violence, the rhetoric and the attacks against [U.S. Immigration and Customs Enforcement] and Border Patrol,\" Homan said. The top Senate Democrat said the announced reduction is insufficient. Senate Minority Leader Chuck Schumer, D-N.Y., called Homan's partial drawdown \"like a drop in the bucket to the people of Minneapolis.\" It's \"not close to enough,\" Schumer said on the Senate floor after Homan's comments. \"They all have to leave now.\" White House press secretary Karoline Leavitt said in a statement to CNBC that \"an unprecedented number of counties in Minnesota\" have agreed to work with Homan to \"coordinate with ICE to transfer custody of criminal aliens upon their release.\" Those commitments from local officials \"will continue to be monitored for compliance,\" Leavitt said. Tensions between the immigration forces and protesters exploded after federal agents killed two U.S. citizens, Renee Nicole Good and Alex Pretti, during separate altercations in January. Homeland Security Secretary Kristi Noem initially rushed to defend those killings while accusing both Good and Pretti of domestic terrorism. But as public opinion rapidly soured on ICE, the administration modulated its tone on the deaths, and President Donald Trump sent Homan to Minnesota manage on-the-ground operations, replacing Gregory Bovino Border Patrol commander at large. In an interview with NBC News later Wednesday, Trump said, \"I learned that maybe we could use a little bit of a softer touch\" on immigration. \"We're not surrendering the president's mission on a mass-deportation operation,\" Homan said at the presser. \"If you're in the country illegally, if we find you, we'll deport you. But this is about a targeted enforcement operation, and that's what we're going to be doing.\""
}