{
  "url": "https://www.mdanderson.org/cancerwise/what-s-new-in-kras-mutation-research-.h00-159696756.html",
  "title": "What’s new in KRAS mutation research? | MD Anderson Cancer Center",
  "text": "What’s new in KRAS mutation research? April 04, 2024 Medically Reviewed | Last reviewed by an MD Anderson Cancer Center medical professional on April 04, 2024 Cancer cells often develop genetic mutations that initiate and sustain the growth of tumors. The most frequently mutated of these oncogenic driver genes, called KRAS, is associated with some of the most fatal cancer types: lung, pancreatic and colorectal cancers. The replacement of the amino acid glycine at position 12 leads to mutations that have been dubbed G12C, G12D, G12R, G12V and others, depending on which amino acid replaces the glycine. Mutations also occur at other codons along the chromosome, such as Q61. These mutations trap the protein in an “on” state and cause cells to multiply uncontrollably, causing cancer. This perhaps explains why KRAS mutations are seen in about a quarter of all solid cancerous tumors, including 90% of pancreatic cancer tumors, which most commonly have the G12D mutation. Creating the first KRAS inhibitors Although KRAS and its links to cancer were discovered decades ago, characteristics of its protein structure was thought to make it “undruggable.” That changed a few years ago when the Food and Drug Administration (FDA) approved covalent inhibitors of the KRAS G12C mutation, the drugs sotorasib and adagrasib, both of which were tested at MD Anderson. “These are really game-changing inhibitors, but the ability of the cancer cells to adapt is still in play,” says Scott Kopetz, M.D., Ph.D., professor of Gastrointestinal Medical Oncology and associate vice president of Translational Integration. Kopetz has done extensive work on KRAS mutations in colorectal cancer and will be honored with a the AACR-Waun Ki Hong Award for Outstanding Achievement in Translational and Clinical Cancer Research at the 2024 American Association for Cancer Research (AACR) Annual Meeting. “A KRAS inhibitor was considered the holy grail of oncology, but the tumors are finding ways around it.” Because cancer adapts, KRAS inhibitors alone have not generally been able to eliminate tumors, and often the cancer cells become resistant to the drug. Therefore, even if the treatment appears to initially work, the cancer can relapse. That’s why current research is investigating other ways to overcome resistance, such as targeted therapy combinations (for example, giving the patient both chemotherapy and a KRAS inhibitor). “This space is going to explode, and there are a lot of newer drugs and drug combinations that we think will be effective,” says David Hong, M.D., professor of Investigational Cancer Therapeutics. Working to better understand the mutations There are also efforts to develop similarly selective drugs that target a mutation like KRAS G12D to better treat pancreatic cancer, or even one to target multiple different KRAS mutations, which would be called a pan-KRAS inhibitor. “The next few years are going to change the discussion around targeting RAS,” says Shubham Pant, M.D., professor of Gastrointestinal Medical Oncology and leader of a clinical trial testing a vaccine with the potential to prevent relapse of KRAS-mutated pancreatic cancers. “It’s an exciting time.” Pant is also a co-author of research (Abstract 2547/7) presented at the 2024 AACR Annual Meeting that focuses on the KRAS Q61 mutation — a relatively rare and understudied variant — in gastrointestinal cancers. His team found that the Q61 mutation is found among only 5% of patients with a KRAS mutation, with the highest frequency in those with pancreatic cancer and cholangiocarcinoma. They also found that pancreatic cancer patients with a Q61 mutation had a poorer outlook than those without the mutation, possibly because there is a co-mutation that occurs along with Q61. However, more research is needed to determine why that’s the case and to potentially develop drugs to inhibit these KRAS mutations. In a separate study (Abstract 1212), led and presented by Marcelo Negrao, M.D., assistant professor of Thoracic/Head & Neck Medical Oncology, the MD Anderson team found that co-mutations in KEAP1 and STK11 and NRF2 signaling may distinguish lung cancer patients who don’t respond well to adagrasib treatment from those who have particularly long survival. In addition, postdoctoral fellow Saikat Chowdhury, Ph.D., who received a AACR-John Kincade Scholarship Fund Scholar-in-Training Award for this abstract, will present the Shen Laboratory’s findings (Abstract 1250) on why colorectal cancer seems to develop resistance to sotorasib. It might be due to co-mutations of a gene called PIK3CA and increased levels of Hedgehog signaling. “Mutation co-alterations can lead to resistance,” Hong says. “This is important because even as these drugs are starting to work, they don’t lead to long-lasting remission.” The next generation of KRAS inhibitors These findings about Q61 help show why a pan-KRAS inhibitor, one that could target many different types of KRAS mutations, would be so helpful. To that end, Gamze Bildik Elcik, Ph.D., a postdoctoral fellow in the Bast/Lu Laboratory at MD Anderson, is presenting the lab’s findings (Abstract 1215) on the tumor suppressor protein DIRAS3, which had already been shown to reduce cancer cell growth in pancreatic and ovarian cancers. Their new data shows DIRAS3 is a promising pan-RAS inhibitor that selectively targets the active, cancer-causing form of KRAS. “We are making progress on a few fronts,” Kopetz says. “What we are recognizing is that the same patient can have multiple mechanisms of resistance.” Therefore, other next-generation treatments will likely include a targeted therapy combination, with a KRAS inhibitor along with another drug or immunotherapy agent. Kopetz will be presenting results on this sort of combination, specifically the KRAS G12C inhibitor adagrasib given with an epidermal growth factor receptor inhibitor called cetuximab in patients with metastatic colorectal cancer. “We are learning much faster than we have in years past, and the lessons we learn for one type of mutation will likely apply to other KRAS mutations,” Kopetz. “The next wave of inhibitors is coming, and patients should be very hopeful.” Learn about research careers at MD Anderson. This space is going to explode, and there are a lot of newer drugs and drug combinations that we think will be effective. David Hong, M.D. Professor of Investigational Cancer Therapeutics"
}