{
  "url": "https://hoycuriosidades.com/paises/curiosidades-de-los-templos-de-angkor-wat/",
  "title": "+46 Curiosidades de los Templos de Angkor Wat Datos curiosos",
  "text": "Lo que encontraras en el articulo Curiosidades de los Templos de Angkor Wat. Datos importantes e interesantes acerca de los Templos de Angkor Wat. ¿Alguna vez has escuchado hablar de los Templos de Angkor Wat? Si no lo has hecho y has llegado aquí por mera coincidencia, te invitamos a quedarte y descubrir todo sobre esta maravilla del mundo. Y si has oído hablar de estos templos y quieres aprender más sobre estos, pues déjanos decirte que también has llegado al lugar correcto Porque te presentaremos una lista de datos interesantes que probablemente no conoces ¡Así que no esperes más y descubre todo sobre los Templos Angkor Wat! Curiosidades de los Templos de Angkor Wat: simbolos de la cultura camboyana Como ya hemos mencionado, hoy podrás describir todo sobre los Templos de Angkor Wat, verdaderos símbolos de la cultura camboyana. Para ello te presentaremos una larga lista de interesantes datos curiosos sobre este patrimonio de la humanidad. Podrás pasear por su historia, descubrir sus características menos conocidas, y muchísimos datos más que seguramente no podrás creer. Listado de curiosidades de los Templos de Angkor Wat - Es el principal templo de Camboya. - Su origen se remonta al siglo XII y es de culto hinduista. - Se trata del símbolo de Camboya, y su importancia es tal que incluso se encuentra en la bandera del país. - La bandera de Camboya consta de tres franjas, una de ellas de color rojo y mayor tamaño, ubicada en el centro del pabellón y donde se encuentra una representación del templo. - La palabra Angkor en su nombre significa “capital” y Wat “templo”. - Inicialmente fue conocido con el nombre de Preh Pisnokar, el nombre póstumo del que fuera su fundador: Suryavarman II. - Se cree que el Emperador Suryavarman II asumió el trono de Camboya tras asesinar al rey regente llamado Dharanindravarman II, y para legitimar su reinado mando a construir este templo. - Consta de más de mil templos de variados tamaños, los cuales se extienden por el interior de la selva abarcando cerca de 200 kilómetros cuadrados. - Este templo fue construido junto a la antigua ciudad de Yashodharapura, cuyo nombre significa ciudad sagrada. - Tomo 37 años erigirlo. - Cuenta una leyenda que el emperador Suryavarman II soltó un buey a la espera que, bajo fuerzas divinas, este se tumbaría en el lugar adecuado para la construcción del templo. - Angkor Wat es el templo hinduista más grande del mundo. - Consta de tres recintos rectangulares concéntricos de altura creciente, en el más interno se elevan cinco torres en forma de loto, llegando a una torre central de 65 metros. - El templo está rodeado por un lago de 3,6 kilómetros de longitud y de una anchura de 200 metros. - La longitud de sus muros externos suman un total de 364,24 exactamente lo que dura un año solar. - La torre principal del templo y el altar tienen una media de 91×91 hat, el cual representa un codo camboyano que equivale 0.435 metros, que es la duración media en días entre un equinoccio y un solsticio. - Angkor Wat fue durante muchos años un templo budista, esto fue desde 1177 cuando la ciudad de Angkor fue saqueada por los Cham y luego con la llegada de Jayavarman VII. - Con el reinado de Jayavarman VIII el templo de Angkor Wat fue utilizado nuevamente para el culto hinduista. - La primera visita documentada de un occidental al templo se produjo en 1586 y fue realizada por el fraile capuchino portugués llamado António da Madalena. - Fue descrito por António da Mandalena como una construcción extraordinaria imposible de describir por escrito y que posee todos los refinamientos que el genio humano puede concebir. - Algunos exploradores como Charles Emile Bouillevaux misionero francés y Hneri Mouhot naturalista, registraron en sus obras la existencia del templo. - Con el paso de los siglos muchos templos quedaron abandonados y fueron absorbidos por la selva, sin embargo los monjes budistas realizan constantemente tareas de conservación y cuidado ya que el templo es su hogar actual. - Fue construido como morada de los dioses, y el acceso al mismo solo estaba permitido a la elite. - El templo fue declarado Patrimonio de la Humanidad por la UNESCO en 1992. - El primer edificio en ser levantado fue el Preah Ko, en el cual aún es posible encontrar restos de imágenes de Shiva. - Todos los turistas que deseen acceder al templo deben hacerlo con las piernas y los hombros cubiertos. - Bayon es uno de los templos más increíbles de Angkor, es conocido como el templo de las 200 caras de budas sonrientes, este se mantiene intacto desde su construcción en el siglo XII. - La película Tom Raider protagonizada por Angelina Jolie utilizo como escenario los numerosos templos de Angkor Wat. - La película “Firts they killed my father” también protagonizada por Angelina Jolie fue estrenada en Camboya y el lugar elegido para su proyección fue el solar en que hallan las doce torres de Angkor Wat conocidas como Prasat Sour Prat. Más curiosidades sobre los Templos de Angkor Wat Ahora te presentaremos algunas curiosidades adicionales sobre los Templos de Angkor Wat, y si crees que las anteriores fueron interesantes, estas te dejaran con la boca abierta. ¡Sigue leyendo y descúbrelas! - Las terrazas de los elefantes y el rey leproso son los dos monumentos más hermosos del lugar, estos contienen numerosos grabados en su parte inferior y están llenos de símbolos y esculturas. - Muchas monedas de Camboya cuentan con la imagen de Angkor Wat. - Angkor Wat está ubicada hacia el oeste, a dirección típicamente asociada con la muerte en la cultura hindú. - Los bajorrelieves en Angkor Wat se lee en sentido contrario a las agujas del reloj, otra indicación de que el templo está asociado con rituales funerarios. - Fue dedicado a Vishnu una deidad hindú. - Tenía un muro exterior que encerraba a toda la ciudad al palacio real, sin embargo no quedan muchos restos de este en la actualidad. - Los ladrillos de las construcciones fueron unidos de forma casi invisible, ya que para juntarlos se utilizó un compuesto vegetal en lugar de un mortero. - Muchas de las superficies de la ciudad fueron pintadas por sus constructores originales, sin embargo o quedan demasiados restos de pintura. - Angkor Wat fue construida con piedras areniscas las cuales fueron transportadas desde una cantera a 25 kilómetros de distancia. - Un emisario chino vivió en Angkor Wat durante 1296 y 1297, este escribió un relato constando su experiencia, siendo este el único relato de la ciudad que data del siglo XIII. - Henri Mouhot fue un explorador francés quien ayudo a poner a Angkor Wat en la mira del mundo debido a que publicó un artículo sobre su visita a mediados del siglo XX. - Sokimez es una empresa privada fundada por un empresario étnico vietnamita-camboyano quien ha alquilado Angkor Wat a Camboya desde 1990. - La mayor parte del dinero recibido para la restauración de la cuidad proviene del extranjero. - Jacqueline Kennedy primera dama de Estados Unidos se arriesgó a visitar Angkor Wat durante la guerra de Vietnam ya era su sueño ver este monumento. - Paramount Pictures tuvo que pagar 10000 dólares por día para grabar las escenas de la película Tom Raider, la filmación tardo siete días. - Cuando fue descubierto se removió una capa de naturaleza de todos los templos de la ciudad, esto los dejó sin protección contra la erosión. - Los templos de la ciudad intentan imitar el Monte Meru, el cual es considerado un monte sagrado que sirve como morada para los dioses. - Actualmente es utilizado por los budistas como lugar de culto. Los Templos de Angkor son una verdadera maravilla, y si has quedado tan impresionado como nosotros con todas esta curiosidades. Pues te invitamos a compartirlas con tus amigos y a demostrar tu conocimiento sobre este gran monumento camboyano."
}