{
  "url": "https://www2.myfloridalicense.com/online-services/",
  "title": "Online Services – MyFloridaLicense.com",
  "text": "Search and find applicants, licensed individuals and businesses within the Food and Lodging industry that are regulated by the Department of Business and Professional Regulation File a complaint against a licensee or an individual you suspect of performing Unlicensed Activity This search capability assists you in finding DBPR approved courses that satisfy your profession’s Continuing Education requirements. Providers submit documentation to comply with continuing education requirements. See reporting error definitions here. Register and submit monthly controlled substance distribution information. My Account Online Services Features: Once you have registered, you will receive an email with a temporary password and then you will create your own unique, secure password. If you do not receive the email with the temporary password after a short amount of time, be sure to check your Junk Mail or SPAM folder for the email. After you have successfully logged in you will be able to link your license OR Exam Candidate# to the online account you created. Step-by-Step Tutorials: Create Your Online Account | Applicant Record or License | Add/Delete Employees Using a shared or public computer? Be sure to log out and close all browser windows when you’re done. This will help keep your information secure. About My Account Online Services Features: Once you have registered, you will receive an email with a temporary password and then you will create your own unique, secure password. If you do not receive the email with the temporary password after a short amount of time, be sure to check your Junk Mail or SPAM folder for the email. After you have successfully logged in you will be able to link your license to the online account you created. Step-by-Step Tutorials: Create Your Online Account | Link Your License to Your Online Account | Add/Delete Employees Search and find applicants, licensed individuals and businesses within the Food and Lodging industry that are regulated by the Department of Business and Professional Regulation Register and submit monthly controlled substance distribution information. This search capability assists you in finding DBPR approved courses that satisfy your profession’s Continuing Education requirements. Providers submit documentation to comply with continuing education requirements. See reporting error definitions here. File a complaint against a licensee or an individual you suspect of performing Unlicensed Activity CONNECT WITH US Call 850-487-1395 | Contact Center | Visit the FAQ Section"
}