{
  "url": "https://www.bullion.com/spotprices/gold-price",
  "title": "Live Gold Prices | Gold Price Per Ounce | Bullion.com",
  "text": "New Customer ? Sign up There are no items in the cart. ($23.00) -0.46 % ($0.89) -0.99 % $6.30 0.28 % ($12.20) -0.68 % Our spot price chart accurately reports gold spot prices in real-time. Use the table to the right to discover the gold price today in ounces, grams, and kilograms. Identify trends by examining our historical spot price chart below, showing the price of gold in various time frames, including 24-hours, 3 days, 1 week, 1 month, 3 months, YTD, 1 year, 5 years, and all time. Bookmark this page to receive accurate and up-to-date gold spot prices information. Learn more about spot price, and how to use it, in the FAQ section below. Use this tool to find out exactly what your gold is worth based on the current spot price per troy ounce. Just enter your quantity, purity level, and local currency to calculate the real-time value of your holdings. Troy ounces are the global standard for pricing gold and remain the benchmark for serious investors. Whether you're checking the value of coins, bars, or scrap, this calculator ensures total clarity—so you're never in the dark about what your gold is really worth. Gold has been a cornerstone of wealth preservation for centuries, valued for its stability, tangibility, and independence from the control of governments or banks. At Bullion.com, we believe in empowering practical, cost-conscious individuals to protect their financial future by offering the lowest gold prices and premiums available. Gold prices are shaped by a variety of factors, but at their core, they reflect a universal truth: gold is a finite resource with intrinsic value that transcends time and borders. Here’s how these factors influence its price: Gold thrives in times of uncertainty. When economic systems falter, currencies depreciate, or inflation soars, people turn to gold as a safe haven. This isn’t just theory—it’s history. During the 2008 financial crisis, gold prices surged as markets plummeted. More recently, the collapse of major banks in 2023 caused a rush to gold, driving its price to new highs. What makes gold unique in these situations is its universal appeal. Unlike fiat currencies that can be devalued or stocks that can plummet, gold’s intrinsic value is untouchable. It’s not tied to any specific government, making it a refuge for those who distrust centralized systems. Inflation eats away at the purchasing power of fiat currencies, but gold stands immune. Central banks often respond to crises by printing more money, flooding the market with devalued currency. Each additional dollar reduces the value of those already in circulation, eroding savings and wages over time. Gold operates outside of this cycle. Its value doesn’t diminish as more dollars are printed. For example, a dollar in 1990 had significantly more purchasing power than today, but an ounce of gold has retained—if not increased—its purchasing power over the same period. Gold shines brightest when the world seems most uncertain. Whether it’s war, trade disputes, or political unrest, these events erode confidence in governments and financial institutions. When this happens, people turn to gold as a universally trusted asset that transcends borders. Recent examples include Middle Eastern tensions in 2024, which drove gold prices to $2,450 per ounce, and the 2023 bank collapses, which saw gold rally as investors sought safe-haven assets. Gold isn’t just a hedge—it’s a lifeboat during the storms of global uncertainty. Gold’s ability to retain purchasing power over time is perhaps best demonstrated by its relationship to the cost of major purchases, like new cars. The chart below shows how many ounces of gold were needed to purchase an average new car at different points in history: 1990: Gold was priced at $383 per ounce, and it took 39 ounces of gold to buy a new car priced at $15,000. This was a time when gold’s price was relatively stable, but it was still significantly undervalued compared to its long-term trends. 2000: Gold’s price dropped to $273, and the amount of gold needed for a car increased significantly to 73 ounces. This period saw a dip in gold’s value as economic optimism surged, but it also highlighted the cyclic nature of gold prices. 2010: During the financial crisis, gold surged to $1,420 per ounce, drastically reducing the amount needed to just 20 ounces of gold for a $29,000 car. This was a stark reminder of gold’s value as a hedge during economic turmoil. 2020: Gold remained strong at $1,770, requiring 21 ounces of gold for a $37,000 car. Despite higher car prices, gold’s value kept pace, demonstrating its resilience. 2023: Gold’s price of $1,940 means it would take approximately 25 ounces to buy a $48,000 car. While car prices have increased dramatically, gold’s purchasing power has remained robust, maintaining its role as a reliable store of wealth. Gold has consistently demonstrated its ability to preserve purchasing power, even as the cost of significant purchases like cars has risen over time. While the number of ounces needed to buy a car has fluctuated slightly due to market forces, gold remains a reliable store of value. This stability contrasts sharply with fiat currencies, which steadily lose value due to inflation. By investing in gold through Bullion.com, you’re not just preserving your wealth—you’re securing the ability to make significant purchases in the future, regardless of economic conditions. Fiat currency—paper money issued by governments—relies entirely on trust. Governments promise the value of their money, but history has shown that this promise can be broken. Whether through excessive money printing, poor fiscal policies, or outright mismanagement, fiat currencies have repeatedly lost their value over time. Gold, by contrast, is immune to these pitfalls because it is a tangible asset with intrinsic value. It has no counterparty risk, no reliance on political stability, and no expiration date. Gold is the antidote to the fragility of fiat money. Here’s why it stands apart as the ultimate hedge: Gold is unique because it is finite and cannot be created at will. Unlike fiat currency, which central banks can print in unlimited quantities to cover debt or stimulate economies, gold's supply is constrained by the physical reality of mining and refining. This scarcity ensures that gold retains its value regardless of how much money governments choose to print. For example, during the 2008 financial crisis, the Federal Reserve’s quantitative easing program injected trillions of dollars into the economy, devaluing the purchasing power of existing dollars. Meanwhile, gold prices surged, reflecting its role as a safe-haven asset. The same pattern emerged during the COVID-19 pandemic, as governments worldwide flooded their economies with newly printed money. Gold is untouchable by inflationary policies, making it a reliable store of wealth when fiat money loses its value through oversupply. Inflation silently erodes the value of money over time, diminishing purchasing power and punishing savers. A dollar in 1970 had far more purchasing power than it does today. In fact, the U.S. dollar has lost over 98% of its value since the early 20th century. Gold, on the other hand, has not only preserved its purchasing power but also increased in value. Consider this: In 1971, when the U.S. abandoned the gold standard, gold was priced at $35 per ounce. Today, gold is worth over $1,900 per ounce—a staggering increase that far outpaces the erosion of the dollar. While a dollar buys less bread, milk, or housing each year, gold consistently holds its value against these essentials. Gold’s resistance to inflation makes it an indispensable asset for those who want to protect their wealth from the relentless devaluation of fiat money. Gold transcends national borders and political systems. Unlike fiat currencies, which are tied to specific governments and economies, gold is universally recognized and trusted. This universality is what makes gold especially valuable during times of political instability or currency collapse. For example: In Argentina (2001), hyperinflation and a financial crisis rendered the peso nearly worthless. Argentinians who held gold were able to preserve their purchasing power and secure necessities. In Zimbabwe (2008), runaway inflation wiped out the value of the Zimbabwean dollar, forcing citizens to rely on gold and barter for everyday goods. In Venezuela (2018), gold became a lifeline for citizens facing inflation rates of over 1,000,000%. Those with access to gold could escape the financial devastation. Gold is a currency without borders. Its value isn’t tied to any single government or central bank, making it a hedge not only against inflation but also against geopolitical risk and currency collapse. Whether you’re in the United States, Europe, or Asia, gold is a universally accepted and trusted asset. For individuals looking to safeguard their wealth, gold offers a level of security that fiat currency simply cannot match. When you own gold: You are immune to the consequences of excessive money printing. You are protected from the slow theft of inflation. You hold a globally recognized asset that is valuable in any economy, under any conditions. Gold isn’t just an investment—it’s a financial shield. At Bullion.com, we make it easier and more affordable than ever to own this timeless asset, ensuring your wealth is protected no matter what happens to fiat money. By choosing gold, you’re opting out of the risks inherent in fiat currency and securing a future where your purchasing power is truly yours to control. At Bullion.com, we know that every dollar counts when it comes to building your wealth. That’s why we’ve designed our services around delivering maximum value and clarity, empowering you to invest in precious metals with confidence. Here’s how we stand apart: High premiums can eat away at your investment potential, and we don’t think you should settle for that. Bullion.com is dedicated to offering the most competitive pricing on popular products without sacrificing quality. Streamlined Selection: By focusing on in-demand items like Gold Eagles and gold bars, we cut unnecessary overhead, allowing us to pass the savings on to you. Accessible for Everyone: Whether you’re buying a single coin or stacking bars, our low prices make precious metals investing achievable for all budgets. The last thing you need in today’s world is a confusing or opaque buying experience. At Bullion.com, we pride ourselves on offering a straightforward, honest approach to investing in precious metals. Clear and Simple Pricing: No hidden fees, no confusing terms—just the price you see, backed by our commitment to fairness. Authenticity Guaranteed: Every product undergoes strict verification processes, so you know you’re getting exactly what you’re paying for. Secure Delivery: With insured and discreet shipping, you can trust that your investment will arrive safely at your door. When you invest with us, you know exactly where your money is going—no surprises, no gimmicks. We understand that navigating the precious metals market can feel overwhelming, especially for new investors. That’s why Bullion.com goes beyond just selling gold and silver to provide resources that give you the upper hand. Market Updates You Can Use: Stay informed on price movements, economic trends, and the factors shaping the market today. Step-by-Step Guidance: Learn how to choose the best products for your portfolio, store your investments securely, and develop a strategy that fits your goals. Dedicated Support: Have questions? Our experienced team is here to offer guidance, ensuring you’re equipped to make informed decisions. Gold isn’t just an investment—it’s your financial shield. At Bullion.com, we make it easy, affordable, and secure to protect your wealth with gold. Explore our selection of cheap, low-premium gold bars and coins today and take control of your financial future. The gold price today will update every 60 seconds in real-time during the trading day based on the market. To see the current gold price, please reference the gold price chart above. The current market price of gold which can be bought for immediate delivery is called the gold spot price. The gold spot price is the price of one troy ounce of gold in US Dollars. Our website shows the real-time gold spot price, in addition to the historical gold price in the chart above. The gold spot price can fluctuate throughout the day, based on market factors such as supply, demand, economic events, and geopolitical events. The actual gold price you may pay to purchase gold in the form of gold bars or gold coins may differ from the gold spot price, based on costs of production, procurement, supply, and demand. Comparing cheap gold investment buffalos across listings is a useful strategy for securing the lowest premium possible. The gold spot price is calculated from gold futures contracts on the Commodities Exchange (COMEX) to determine the price of gold today. The price of the contract is set by gold supply and demand. The gold bid price and the gold ask price are the prices at which gold can be bought and sold, respectively. The gold bid price is the highest price the buyer is willing to pay for gold. When selling gold, a dealer will purchase gold at the bid price. The gold ask price is the lowest price the seller is willing to sell gold. When buying gold, a dealer will sell gold at the ask price. The difference between the gold bid price and the gold ask price is called the bid-ask spread, which can vary based on the current supply and demand in the market, transaction size, as well as other factors. Gold is an actively traded asset, and is bought and sold constantly by traders, investors, banks, which causes the price of gold to change frequently. The gold price changes throughout the trading day and is updated in real-time on our website to provide the current gold price, whether you are interested in buying or selling gold. The gold price is influenced by many factors, including economic factors such as interest rates and currency exchange rates. A rise in inflation could lead to an increase in gold demand, as the purchasing power of the currency decreases. Historically, gold has held its value over time. Non-economic factors also influence the price of gold, such as global events, political unrest, or wars which can lead to an increase in gold demand as a safe haven asset. The price of physical gold is based on the current market gold price, as well as a premium over the gold spot price. Physical gold has a cost to procure, manufacture and distribute, which is why you cannot typically purchase gold for the gold spot price. The premium over spot is the markup an investor will pay above the raw gold value of a product. For example, if the gold spot price is $2,000 per ounce and an investor purchased a 1 oz gold product for $2,100, the premium over spot is $100, which is the difference between the $2,100 gold product and the $2,000 gold price. You can buy physical gold from a reputable dealer online or from a local coin shop. Gold bullion are products are typically purchased for their gold content, and are in the form of gold coins, bars (ingots), or rounds, while collectible coins are typically purchased for both the metal value and the numismatic or collectible value. There are several gold coins produced by sovereign mints around the world, including the American Gold Eagle and American Gold Buffalo from the United States Mint, the Canadian Gold Maple Leaf from the Royal Canadian Mint, the British Gold Britannia from The Royal Mint, the Australian Gold Kangaroo from The Perth Mint, and the Austrian Gold Philharmonic from the Austrian Mint. Many buyers start with a cheap gold maple leafs deals search to compare options across mints. You can check out our selection of Gold Coins here. The most popular size of gold bars is the 1 oz gold bar, also produced by renowned mints such as Pamp Suisse and Valcambi Suisse. Gold bars are produced in a variety of sizes to provide options for investors, including several gram sizes, up to a kilo. Our full selection of gold bars can be viewed here. The amount you invest in gold depends on your overall investment goals. Gold is considered a safe-haven asset that could be a hedge against inflation, global tension, market uncertainty, as well as currency fluctuations, due to its finite nature and historical evidence of holding its value over time. We recommend working with a finance professional for any investment advice. Gold and other precious metals can be a way to diversify your portfolio. The gold/silver ratio is the price relationship between the current price of gold and the current price of silver in the market. The calculation is the price of gold divided by the price of silver. This ratio is tracked historically to see when silver may be relatively inexpensive relative to gold, and vice versa. Best Rated I'm very satisfied with the 10oz silver bars I received. I had no issues with the purchase process and received the product with no issues in and in a timely ma ... Order has arrived. Shipping on your end was fast but with the recent weather conditions delivery was delayed. You get 5 stars from me! Products received were ... Great introductory offer. It was easy to place my order. Website is very good. Missed my chance to apply a promo code and contacted customer support. They cancelled the order and resubmitted it with the promo code applied. Very happy wit ... Great product great price fast shipping. No issues at all. Simple and easy. Quick response to questions. I was elated to find 20 ounces of silver at spot. After this initial deal goes through I will be increasing my stack. Thanks for the spot deals that you offer as a silver stacker that is what I look for because you buy silver to stack and preserve your wealth because if you buy ... Found your link through Walmart.com and followed it to your web address out of pure curiosity. Great first time experience. The website was very easy to use. Payment process also good Great Pricing...Ill be back! Nice website layout….intuitive and easy. Especially like the bank account connection. Also liked the new-customer tube of silver buffalos at spot. Thanks for the great price Great first time buyer offer. Good prices overall Easy website and great prices. A+++ Fast, easy and straight forward as it gets. Very good experience Thank you very much looking forward to buying more in the future after I receive this order thank you and you have a great day Easy process. So far so good Online experience was fantastic"
}