{
  "url": "https://www.news18.com/cricket/icc-t20-world-cup-2026-dates-venues-full-match-schedule-released-aa-ws-bl-9875674.html",
  "title": "ICC T20 World Cup 2026: Check Full Schedule, Teams, Groups Venues And Dates | Cricket News - News18",
  "text": "ICC T20 World Cup 2026: Check Full Schedule, Teams, Groups Venues And Dates ICC T20 World Cup Full Schedule: The 20-team competition will be held across venues in India and Sri Lanka over a four-week window. The 10th edition of the ICC Men’s T20 World Cup is scheduled to be held from February 7 to March 8. India and Sri Lanka will co-host the biannual competition. Having won the prized silverware in 2024, India enters the latest edition as defending champions. Suryakumar Yadav & Co. will be joined in the party by former winners West Indies, England, Australia, Pakistan and Sri Lanka. Recommended Stories - Sinhalese Sports Club in Sri Lanka gets floodlights ahead of T20 World Cup - PAK Boycott Means Little To India, Focus Remains Performance & Security: Top Govt. Sources - Michael Vaughan Picks T20 World Cup Semifinalists: 'India, England, New Zealand &...' - T20WC Warm-Up: Zimbabwe, Oman, Nepal win their respective games Fellow ICC full members South Africa, New Zealand, Afghanistan, Zimbabwe and Ireland will also be vying for the top honours, while leading associate teams USA, Namibia, Netherlands, Oman, Italy, Scotland, Nepal, UAE and Canada will also strive to make their presence felt. These 20 participants have been divided into four groups of five teams each to determine the qualifiers for the Super 8s stage. India, Pakistan, USA, Namibia and the Netherlands are part of Group A, while Australia, Sri Lanka, Oman, Ireland and Zimbabwe make up Group B. Group C features West Indies, England, Scotland, Italy and Nepal and Group D has South Africa, New Zealand, Afghanistan, Canada and UAE. Teams will play their respective group rivals once in the initial stage before the top 2 sides from all four groups qualify for the Super 8s. The Super 8 qualifiers will be further divided into two groups of four teams each, where teams play 3 games apiece. The top 2 sides from either group will advance to the semi-finals. Kolkata, Mumbai, Delhi, Ahmedabad and Chennai will play host to matches of the Indian leg. In Sri Lanka, Colombo and Pallekele have been allocated the games. Full schedule for the ICC Men’s T20 World Cup 2026 Group Stage Saturday, February 7 - Netherlands vs Pakistan at 11am (05:30 GMT) – SSC, Colombo - Scotland vs West Indies at 3pm (09:30 GMT) – Eden Gardens, Kolkata - India vs USA at 7pm (13:30 GMT) – Wankhede Stadium, Mumbai Sunday, February 8 - Afghanistan vs New Zealand at 11am (05:30 GMT) – MA Chidambaram Stadium, Chennai - England vs Nepal at 3pm (09:30 GMT) – Wankhede Stadium, Mumbai - Sri Lanka vs Ireland at 7pm (13:30 GMT) – R Premadasa Stadium, Colombo Monday, February 9 - Scotland vs Italy at 11am (05:30 GMT) – Eden Gardens, Kolkata - Oman vs Zimbabwe at 3pm (09:30 GMT) – SSC, Colombo - Canada vs South Africa at 7pm (13:30 GMT) – Narendra Modi Stadium, Ahmedabad Tuesday, February 10 - Namibia vs Netherlands at 11am (05:30 GMT) – Arun Jaitley Stadium, New Delhi - New Zealand vs UAE at 3pm (09:30 GMT) – MA Chidambaram Stadium, Chennai - Pakistan vs USA at 7pm (13:30 GMT) – SSC, Colombo Wednesday, February 11 - Afghanistan vs South Africa at 11am (05:30 GMT) – Narendra Modi Stadium, Ahmedabad - Australia vs Ireland at 3pm (09:30 GMT) – R Premadasa Stadium, Colombo - England vs West Indies at 7pm (13:30 GMT) – Wankhede Stadium, Mumbai Thursday, February 12 - Sri Lanka vs Oman at 11am (05:30 GMT) – Pallekele International Cricket Stadium, Kandy - Italy vs Nepal at 3pm (09:30 GMT) – Wankhede Stadium, Mumbai - India vs Namibia at 7pm (13:30 GMT) – Arun Jaitley Stadium, New Delhi Friday, February 13 - Australia vs Zimbabwe at 11am (05:30 GMT) – R Premadasa Stadium, Colombo - Canada vs UAE at 3pm (09:30 GMT) – Arun Jaitley Stadium, New Delhi - Netherlands vs USA at 7pm (13:30 GMT) – MA Chidambaram Stadium, Chennai Saturday, February 14 - Ireland vs Oman at 11am (05:30 GMT) – SSC, Colombo - Scotland vs England at 3pm (09:30 GMT) – Eden Gardens, Kolkata - New Zealand vs South Africa at 7pm (13:30 GMT) – Narendra Modi Stadium, Ahmedabad Sunday, February 15 - Nepal vs West Indies at 11am (05:30 GMT) – Wankhede Stadium, Mumbai - Namibia vs USA at 3pm (09:30 GMT) – MA Chidambaram Stadium, Chennai - India vs Pakistan at 7pm (13:30 GMT) – R Premadasa Stadium, Colombo Monday, February 16 - Afghanistan vs UAE at 11am (05:30 GMT) – Arun Jaitley Stadium, New Delhi - England vs Italy at 3pm (09:30 GMT) – Eden Gardens, Kolkata - Australia vs Sri Lanka at 7pm (13:30 GMT) – Pallekele International Cricket Stadium, Kandy Tuesday, February 17 - Canada vs New Zealand at 11am (05:30 GMT) – MA Chidambaram Stadium, Chennai - Ireland vs Zimbabwe at 3pm (09:30 GMT) – Pallekele International Cricket Stadium, Kandy - Scotland vs Nepal at 7pm (13:30 GMT) – Wankhede Stadium, Mumbai Wednesday, February 18 - South Africa vs UAE at 11am (05:30 GMT) – Arun Jaitley Stadium, New Delhi - Namibia vs Pakistan at 3pm (09:30 GMT) – SSC, Colombo - India vs Netherlands at 7pm (13:30 GMT) – Narendra Modi Stadium, Ahmedabad Thursday, February 19 - Italy vs West Indies at 11am (05:30 GMT) – Eden Gardens, Kolkata - Sri Lanka vs Zimbabwe at 3pm (09:30 GMT) – R Premadasa Stadium, Colombo - Afghanistan vs Canada at 7pm (13:30 GMT) – MA Chidambaram Stadium, Chennai Friday, February 20 - Australia vs Oman at 7pm (13:30 GMT) – Pallekele International Cricket Stadium, Kandy Super 8 Saturday, February 21 - TBD vs TBD at 7pm (13:30 GMT) – R Premadasa Stadium, Colombo Sunday, February 22 - TBD vs TBD at 3pm (09:30 GMT) – Pallekele International Cricket Stadium, Kandy - TBD vs TBD at 7pm (13:30 GMT) – Narendra Modi Stadium, Ahmedabad Monday, February 23 - TBD vs TBD at 7pm (13:30 GMT) – Wankhede Stadium, Mumbai Tuesday, February 24 - TBD vs TBD at 7pm (13:30 GMT) – Pallekele International Cricket Stadium, Kandy Wednesday, February 25 - TBD vs TBD at 7pm (13:30 GMT) – R Premadasa Stadium, Colombo Thursday, February 26 - TBD vs TBD at 3pm (09:30 GMT) – Narendra Modi Stadium, Ahmedabad - TBD vs TBD at 7pm (13:30 GMT) – MA Chidambaram Stadium, Chennai Friday, February 27 - TBD vs TBD at 7pm (13:30 GMT) – R Premadasa Stadium, Colombo Saturday, February 28 - TBD vs TBD at 7pm (13:30 GMT) – Pallekele International Cricket Stadium, Kandy Sunday, March 1 - TBD vs TBD at 3pm (09:30 GMT) – Arun Jaitley Stadium, New Delhi - TBD vs TBD at 7pm (13:30 GMT) – Eden Gardens, Kolkata Knockouts Wednesday, March 4 - First semi-final at 7pm (13:30 GMT) – Eden Gardens, Kolkata or R Premadasa Stadium, Colombo Thursday, March 5 - Second semi-final at 7pm (13:30 GMT) – Wankhede Stadium, Mumbai Sunday, March 8 - Final at 7pm (13:30 GMT) – Narendra Modi Stadium, Ahmedabad or R Premadasa Stadium, Colombo"
}