{
  "url": "https://www.falloutcascadia.com/level-design-showcase",
  "title": "Level Design — Fallout: Cascadia",
  "text": "LEVEL DESIGN Fallout: Cascadia aims to bring a map almost twice the size of Fallout 4 into the hands of its players. This is no small task and our map has been constantly under development for several years by some incredibly talented developers and has undergone several revisions to fit the needs of our vision perfectly. On this page some locations and areas of the game will be showcased with more available on our social media outlets. MERCER ISLAND Mercer Island is currently home to no one, beyond feral ghouls and other wasteland threats. Attempts have been made to settle on the island, with little success. A clever scavenger could make a tidy profit off of the island, provided that they can make it across the irradiated waters of Lake Washington first. DES MOINES Des Moines sits next to the Puget Sound, and while it was once a proud shipyard and vacation destination, it now sits abandoned. Scavengers occasionally pick through the town, while Mirelurks and Orclaws fight for dominance over the ruins, both trying to make the town their nest. The occasional group of settlers have tried taking back the town, only to end up dead. Because of this, many locals believe the area is cursed. DOWNTOWN SEATTLE Downtown Seattle, now referred to as Downtown, is home to many monsters, raider gangs, and malfunctioning robots. Despite this, scavengers risk their lives and enter the sprawling ruins to recover valuable salvage, hoping to sell it at Pike’s Place or Cascade and get rich. Few of them ever make it back, even fewer in one piece. REDMOND Redmond, before the war, was a city on the rise. It boasted large skyscrapers and technological achievements, both of which ceased mattering on October 23rd, 2077. The city is now home to many dangers, chief among them being the Greenbacks, raiders with an affinity for energy weapons and all other forms of technology. Their hold on the city is threatened, however, by Mirelurks trying to expand their colony to the city from the nearby lake. BELLEVUE Before the Great War, Bellevue was a monument to wartime industry and ingenuity. Its destruction was almost absolute. Now, only Deathclaws and other wasteland horrors stalk its irradiated streets. MISC LEVEL DESIGN GALLERY What follows beneath is a gallery of level design from all over the Pacific Wasteland with no specific categorization, just to give you a better idea of what to expect to find in our world."
}