{
  "url": "https://worstgen.alwaysdata.net/forum/threads/elbaf-is-our-way-back-to-mariejoa.75682/",
  "title": "Speculations - Elbaf is our way back to Mariejoa | Worstgen",
  "text": "Honestly felt compelled to make this thread before we find out anything about Heaven's Realm but I think there is a strong possibility the following is legitimate. TLDR: Essentially I believe Elbaf (containing Treasure Tree Adam) and Mariejoa (containing Sunlight Tree Eve) are inherently connected via Island Clouds and Bubble Resin, and it will be how Luffy and crew assault Mariejoa after he becomes Pirate King - Elbaf is centered around the world's oldest Adam Tree. - We know Elbaf has Island Clouds, per its reveal, which strongly suggests Heaven's realm is definitely tied to some form of sky island/islands - On the flipside we know Yarukiman Mangroves produce the bubble resin we see in Sabaody. We also know that its the reason the bubbles work in Fishman Island because the roots of Sunlight Tree Eve \"breathe\" it out. On top of this. Neptune talks about how it exists on the surface and provides sunlight to FI. - Usopp even notes the trees have a connection - On top of this, we know of Fishman Island is surrounded by roots of Eve then it suggests the top must be near Mariejoa, even if Oda hasnt drawn it yet. There isnt much else to say about that, but the BIGGEST evidence comes from the fact that Mariejoa for some reason allows for bubble technology. The only explanation can be that Eve is nearby, though the dialogue here seems to imply some sort of reinforced bubble technology was switched to. So either Eve produces stronger bubbles or Mariejoa has a way to just randomly produce bubbles that theoretically should only exist in Mangrove atmosphere. We know Vegapunk produced Island Clouds manually so maybe he also produced Resin Bubbles? So Im not sure if this helps or harms my theory but nonetheless I have to share it. So that really comes to the end of my theory. High West has never been shown, and neither has Sunlight Tree Eve, but given the natures of both trees and locations I have a feeling that this is what Heaven's Realm is actually meant for, especially since the trees have a connection to each other and if we all believe Luffy will fight Imu in Mariejoa, then this could be how its done. Anyway, just wanted to get this thought out there. I know others have different forms of this theory but this is the one Ive always gravitated towards, even before Elbaf was shown and as far back as WCI when we knew a giant tree existed upon it TLDR: Essentially I believe Elbaf (containing Treasure Tree Adam) and Mariejoa (containing Sunlight Tree Eve) are inherently connected via Island Clouds and Bubble Resin, and it will be how Luffy and crew assault Mariejoa after he becomes Pirate King - Elbaf is centered around the world's oldest Adam Tree. - We know Elbaf has Island Clouds, per its reveal, which strongly suggests Heaven's realm is definitely tied to some form of sky island/islands - On the flipside we know Yarukiman Mangroves produce the bubble resin we see in Sabaody. We also know that its the reason the bubbles work in Fishman Island because the roots of Sunlight Tree Eve \"breathe\" it out. On top of this. Neptune talks about how it exists on the surface and provides sunlight to FI. - Usopp even notes the trees have a connection - On top of this, we know of Fishman Island is surrounded by roots of Eve then it suggests the top must be near Mariejoa, even if Oda hasnt drawn it yet. There isnt much else to say about that, but the BIGGEST evidence comes from the fact that Mariejoa for some reason allows for bubble technology. The only explanation can be that Eve is nearby, though the dialogue here seems to imply some sort of reinforced bubble technology was switched to. So either Eve produces stronger bubbles or Mariejoa has a way to just randomly produce bubbles that theoretically should only exist in Mangrove atmosphere. We know Vegapunk produced Island Clouds manually so maybe he also produced Resin Bubbles? So Im not sure if this helps or harms my theory but nonetheless I have to share it. So that really comes to the end of my theory. High West has never been shown, and neither has Sunlight Tree Eve, but given the natures of both trees and locations I have a feeling that this is what Heaven's Realm is actually meant for, especially since the trees have a connection to each other and if we all believe Luffy will fight Imu in Mariejoa, then this could be how its done. Anyway, just wanted to get this thought out there. I know others have different forms of this theory but this is the one Ive always gravitated towards, even before Elbaf was shown and as far back as WCI when we knew a giant tree existed upon it"
}