{
  "url": "https://baike.baidu.com/item/安克创新科技股份有限公司/22784730",
  "title": "安克创新科技股份有限公司_百度百科",
  "text": "安克创新科技股份有限公司（Anke Innovation Technology Co., Ltd），简称安克创新，是一家以从事研究和试验发展为主的企业，专注于智能配件和智能硬件的设计、研发和销售业务，成立于2011年12月6日，注册地址位于长沙高新开发区尖山路39号长沙中电软件园有限公司一期七栋7楼701室，创始人、法定代表人及CEO为阳萌。 [2] [69] 安克创新前身是湖南海翼电子商务有限公司 [1]。2012年，自主研发的第一款产品Anker 4500mAh超薄移动电源上市。2013年，研发PowerIQ™智速充技术。 [2]2015年，启动中东、澳洲、南美洲、非洲、东南亚等地区的线下渠道销售 [3]，上线国内京东旗舰店、天猫旗舰店 [2]。2016年，更名为湖南海翼电子商务股份有限公司 [1-2] [42]，并完成首笔融资 [7]。2017年，亮相欧洲最大的展会IFA [2]。2018年，变更为安克创新科技股份有限公司 [1] [42]。2019年，主营业务收入66.5亿元人民币 [64]。2020年，在深圳证券交易所创业板上市 [71]。 [2]2021年，营业收入达到125.74亿元 [2]，全球用户数超过1亿 [2]。2022年，推出首个应用“全氮化镓”的氮化镓充电系列 [61]。2023年，发行可转债申请获深交所受理 [29]。2024年，业务已覆盖超过146个国家和地区 [49]，注册资本变为53141.0776万元人民币 [36]。2025年12月2日，安克创新(300866.SZ)向港交所递交H股发行上市申请。 [46] [98] 安克创新曾获《2020凯度BrandZ中国全球化品牌50强》第11位 [86]、2022中国新经济企业500强第266位 [85]、入选福布斯中国2023ESG创新企业 [82]、入选《2024中国出海品牌百强榜》榜单。 [34] - 公司名称 - 安克创新科技股份有限公司 - 外文名 - Anke Innovation Technology Co., Ltd [69] - 所属行业 - 研究和试验发展 [69] - 成立时间 - 2011年12月06日 [69] - 法定代表人 - 阳萌 [69] - 总部地点 - 长沙高新开发区尖山路39号长沙中电软件园有限公司一期七栋7楼701室 [69] - 经营范围 - 一般项目：机械设备研发；电子专用材料研发；储能技术服务；人工智能应用软件开发；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广；人工智能理论与算法软件开发；家用电器研发；软件开发等 [69] - 公司类型 - 股份有限公司（上市、自然人投资或控股） [69] - 员工数 - 5034 人 [69]（2023年报） - 统一社会信用代码： - 91430111587017150P - 组织机构代码： - 587017150 - 注册号： - 430111000141466 - 经营状态： - 开业 - 公司类型： - 股份有限公司(上市、自然人投资或控股) - 成立日期： - 2011年12月06日 - 法定代表人： - 阳萌 - 营业期限： - 2011年12月06日 至 无固定期限 - 注册资本： - 53,615.7605万(元) - 审核/年检日期： - 2025年12月11日 - 登记机关： - 湖南湘江新区管理委员会 - 企业地址： - 长沙高新开发区尖山路39号长沙中电软件园有限公司一期七栋7楼701室 经营范围： 一般项目：机械设备研发；电子专用材料研发；储能技术服务；人工智能应用软件开发；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广；人工智能理论与算法软件开发；家用电器研发；软件开发；智能机器人的研发；地理遥感信息服务；集成电路设计；电子产品销售；家用电器零配件销售；电力电子元器件销售；幻灯及投影设备销售；电池销售；家用视听设备销售；电池零配件销售；移动终端设备销售；电子专用材料销售；音响设备销售；智能车载设备销售；可穿戴智能设备销售；智能家庭消费设备销售；智能基础制造装备销售；智能机器人销售；家用电器销售；物联网技术研发；电子专用设备销售；网络与信息安全软件开发；计算机系统服务；智能控制系统集成；人工智能行业应用系统集成服务；信息咨询服务（不含许可类信息咨询服务）；社会经济咨询服务；信息技术咨询服务；电子（气）物理设备及其他电子设备制造；电力电子元器件制造；其他电子器件制造；移动终端设备制造；家用电器制造；电子专用设备制造；电子元器件制造；电子元器件与机电组件设备制造；音响设备制造；智能基础制造装备制造；智能车载设备制造；可穿戴智能设备制造；智能家庭消费设备制造；自有资金投资的资产管理服务；贸易经纪；进出口代理；技术进出口；货物进出口。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动） 发展历程 播报编辑 初创阶段 2011年12月6日，公司在湖南注册成立，注册名称是湖南海翼电子商务有限公司 [1]，创始人兼CEO是阳萌 [44]，首款产品是笔记本电脑替换电池；同年，全球品牌Anker在美国加州注册完成 [41]，公司通过亚马逊进入美国、英国、德国、法国、意大利等欧美市场销售Anker产品，产品月销量突破100万美金。 [2] 2012年，集团深圳研发中心（PDC）成立，自主研发的第一款产品Anker 4500mAh超薄移动电源上市，并通过亚马逊进入日本、西班牙、加拿大市场销售Anker产品。 [2] 2013年，集团日本公司Anker Japan Co.,Ltd、香港公司Anker Technology Co.,Limited、英国公司Anker Technology（UK）Ltd成立，正式形成“1+X”全球化架构，并创新研发PowerIQ™智速充技术，引领行业走向技术升级的新里程碑。 [2] 2014年，Anker入驻美国最大的连锁超市之一Staples，拓展线下市场，并被日本经济报Nikkei称赞为“亚洲的能源品牌”。 [2] 2015年，公司从跨境电商渠道切入，启动中东、澳洲、南美洲、非洲、东南亚等地区的线下渠道销售 [3]，上线国内京东旗舰店、天猫旗舰店，正式布局国内市场，车载充电器入驻部分城市高端专车，移动电源、充电器等产品入驻中国区洲际酒店、皇冠假日、智选假日、假日酒店四大品牌酒店 [2]；同年，安克创新开始调整品牌战略，孵化出Nebula、Eufy和Soundcore三大品牌分别支撑投影仪、家居智能硬件及智能音频三类新产品，由此逐渐向品牌化转型。 [58] 2016年6月6日，公司完成股份制改造，更名为湖南海翼电子商务股份有限公司 [1-2] [42]；9月30日，湖南海翼电子商务股份有限公司取得全国中小企业股份转让系统 （“新三板”）同意挂牌函（证券简称：海翼股份，证券代码：839473） [4]；12月12日，湖南海翼电子商务股份有限公司完成首笔融资，由IDG领投3.27亿元，企业整体估值达36亿元 [7]；同年，公司正式成立智能家居事业部，子公司深圳海翼智新科技有限公司成立，祝芳浩任总裁，进行Roav车载智能硬件、Nebula智能屏显设备等新项目的研发，布局车载智能和智能投影领域。 [2] [8] 2017年，第一次亮相欧洲最大的展会IFA，现场完成了50万美元的订单 [2]；Nebula智能微投获120万美金支持，创全球家庭娱乐类智能硬件众筹记录 [10]，并成为Google Assistant 在全球范围内挑选的首批10个合作伙伴之一 [11]；推出了两款定制移动电源：精灵球版和皮卡丘版；2017年，董事会审议通过公司名称由“湖南海翼电子商务股份有限公司”变更为“安克创新科技股份有限公司”，公司证券简称由“海翼股份”变更为“安克创新”。 [2] 2018年1月，公司名称正式变更为安克创新科技股份有限公司 [1] [42]；6月，Anker推出了两款NS主题的移动电源，获得任天堂授权 [14]；8月，安克创新从新三板退市 [66]；当地时间10月25日下午5:00，安克创新在美国纽约召开2018年新品发布会：正式发布多款新品，其中全球首发GaN（氮化镓）元件的Anker PowerPort Atom PD系列充电产品是亮点。 [68] 成功上市 2019年5月，安克创新向证监会提交了招股说明书，欲在创业板上市 [66]；5月28日，安克创新全资子公司Anker HK 与 PML Holding 签订股权转让协议，将其持有的 Jouz HK（连同其下属全资子公司 Jouz Japan 及 Jouz Korea）的全部股份以人民币500万元的价格转让给阳萌控制的 PML Holding；6月5日，安克创新全资子公司海翼科技将其持有的筑思（深圳）100%股权以人民币100万元的价格转让予阳萌；10月11日，安克创新向证监会更新了资料，据招股书显示，安克创新2016年至2018年营业收入分别为25.07亿元、39.03亿元、52.32亿元，净利润分别为2.27亿元、3.29亿元、4.27亿元，2019年上半年，公司营收28.33亿元，净利润2.56亿元 [67]；2019年，安克创新在沙特设立办公室，产品进驻中东地区最大连锁零售店，Anker5款产品成功登陆Apple官方商店 [2]；同年，安克创新已拥有充电、音频、家居、智新四大事业部，搭建了强中台与强研发体系，并不断扩展产品品类 [58]；2019年主营业务收入66.5亿元人民币，98.47%的收入都来自境外，境外收入中又有56.45%来自北美地区。 [64] 2020年7月16日，安克创新首发上会，拟于深交所创业板上市，计划公开发行新股数量不超过4100万股，保荐机构为中金公司，该次拟募集资金14.15亿元，分别用于深圳产品技术研发中心升级项目、长沙软件研发和产品测试中心项目、长沙总部运营管理中心建设和升级项目、补充营运资金项目 [63]；8月24日，安克创新科技股份有限公司人民币普通股股票在深圳证券交易所创业板上市，证券简称为“安克创新”，证券代码为“300866”，公司人民币普通股股份总数为406,427,207股，其中35,581,634股股票自上市之日起开始上市交易 [71]，以66.32元/股的发行价登陆创业板后，截至上市首日A股收盘，其股价较发行价上涨121.41%至146.86元/股，对应总市值为596.88亿元 [58] [64]；12月，安克创新发布了登陆深交所创业板后的第一份业绩报告，报告显示：2020年1月至9月，公司营业收入60.19亿元，同比增长32.45％，净利润5.33亿元，同比增长15.68％；第三季度营业收入24.9亿元，比2019年同期增长45.57％，归属于上市公司股东的净利润2.56亿元，比2019年同期增长24.91％ [65]；同年，安克创新全球用户数超过8000万元。 [2] 2021年5月，安克创新在国内举办了首场发布会，阳萌在现场表示，“我们发现，很多大型消费品公司，在中国的营收都能占到总营收的15%至20%，而我们的中国市场营收占比还不到2%” [58]；11月17日，在2021秋季飞书未来无限大会上，安克创新与飞书会议共创的一款视频会议一体终端在大会推出，作为飞书对外开放的第一款原生集成飞书会议室的安卓方案，安克创新主要开发的这款Anker PowerConf B500视频会议一体终端凭借深度集成飞书会议系统所带来的便捷性能和高颜值的外观吸引了不少关注 [62]；2021年，安克创新全年营业收入达到125.74亿元 [2]，同比增长34.45%，企业线上交易额约80亿，其中跨境电商交易额约75亿元 [60]，全球营收突破百亿，全球用户数超过1亿。 [2] 2022年上半年，安克创新的自有平台独立站贡献的收入占总营收的比例仅为5.69%，较2021年上半年的5.58%仅提升了0.11个百分点，但收入同比增长30.03%，线下渠道贡献的收入占总营收的比例为35.66%，较2021年上半年的34.78%提升了0.88个百分点，收入同比增长12.39% [58]；7月，安克创新召开2022旗舰新品发布会，联合5家全球领先的芯片厂商，公布了4项最新的充电技术并发布7款年度旗舰新品，推出首个应用了“全氮化镓”的氮化镓充电系列，其中多款新品为全球首次面世、首个应用等开创品 [61]；7月8日，安克创新及相关方签署了《杭州和谐超越三期股权投资合伙企业（有限合伙）合伙协议》及相关文件，公司以自有资金出资人民币2000万元认购杭州和谐超越三期股权投资合伙企业（有限合伙）份额 [59]；12月27日，安克创新发布公告称，已与深圳润雪正式签署房产买卖预售协议，约定由安克创新全资子公司购买后者开发的房产 [58]；2022年，安克创新全年收入142.51亿，归母净利润11.43亿 [2]，在中东市场成绩亮眼，营收达1.1亿美元，同比上升35.71%，占全球总营收的5.35%。 [57] 稳步发展 2023年3月，安克创新正式同亚马逊云科技成立联合创新实验室，在采用亚马逊云科技服务的基础上，推动安克创新将数据分析、机器学习等服务进行规模化应用，赋能业务创新 [53]；7月，安克创新与深圳市积加跨境网络科技有限公司在安克创新总部正式签订合同协议，达成官方合作，积加ERP将为安克创新提供数字化建设服务，助力安克创新搭建世界一流的业务数据中台 [52]；7月24日，在协办方Shulex和副会长单位安克创新的协助下，湖南省跨境电子商务协会第五十一期私享会“走进Anker，共探AI助力出海新思路”成功举办 [56]；8月，安克创新发行可转债申请获深交所受理 [29]，同月，在湖南湘江新区举行的加快建设全球研发中心城市核心引领区座谈会上，安克创新副总裁张希透露了企业的发展宏图：计划在湖南湘江新区建设湖南新总部基地，同步打造集团长沙研发中心 [55]；11月，协创数据接受投资者调研时称，公司已与安克创新建立了长期稳定的合作关系 [54]；2023年全年收入175.07亿，同比增长22.85%，净利润16.15亿人民币，同比增长41.22%。 [2] 2024年1月，公司在CES2024展会上展出了最新一代扫地机器人eufyX10ProOmni [43]，同月，飞书携手安克创新举办“走近先进”活动， 60 余位企业家、高管共同探讨“探索 AI 时代业务新玩法”，畅聊 AI 时代下，如何更好地为业务赋能 [50]；2月，安克创新获得一项实用新型专利授权，专利名为“收纳包及掌上电子设备组件”，专利申请号为CN202321667752.4，授权日为2024年2月6日 [31]，同日获得一项外观设计专利授权，专利名为“清洁机器人的主体”，专利申请号为CN202230816207.1，授权日为2024年2月6日 [30]；4月24日消息，安克创新发布2023年年报，财报显示，安克创新2023年营收175.07亿元，同比增长22.85%；实现归母净利润16.15亿元，同比增长41.22%；扣非归母净利润为13.44亿元，同比增长71.88%；毛利率为43.53%，同比增长4.81% [47]；7月27日消息，安克创新科技股份有限公司发生工商变更，公司注册资本由40642.7207万人民币元变为52848.279100万人民币元 [33]；9月19日，安克创新公告，公司拟以自有资金2.85亿元收购海翼远致、公司员工刘文兵持有的深圳海翼智新科技有限公司合计6.6557%股权，该次收购完成后，公司持有海翼智新的股权将上升至81.9968% [51]；10月10日消息，安克创新披露投资者关系活动记录表显示，公司业务已覆盖超过 146 个国家和地区，在北美、欧洲、日本等成熟市场，公司持续挖掘市场空间，并积极拓深品牌影响力，在澳大利亚、东南亚、拉美的潜力市场，公司正在开展“火种计划”，积极探索当地消费者偏好及渠道特点 [49]；11月14日，安克创新向不特定对象发行可转换公司债券申请获深交所审核通过 [35]；12月，安克创新科技股份有限公司发生工商变更，公司注册资本由52848.2791万人民币元变为53141.0776万人民币元。 [36] 2025年1月7日，深圳市光因科技有限公司宣布与安克创新达成战略性合作协议，以先进技术赋能安克创新旗下的Anker SOLIX系列 [45]；2月，安克创新宣布，已成功获得中国证券监督管理委员会的批准，向不特定对象发行可转换公司债券，募集资金不超过11.05亿元，其中，2.01亿元将专项用于便携及户用储能产品的研发及产业化项目。 [46]11月10日，安克创新发布公告称，公司董事会审议通过了《关于公司发行H股股票并在香港联合交易所有限公司上市的议案》等相关议案。 [97]12月2日，安克创新(300866.SZ)向港交所递交H股发行上市申请。 [98] 2026年1月19日，飞书宣布与安克创新联合发布“AI录音豆”，单体仅10克，单体续航8小时。 [99] 2026年1月，IT之家消息，飞书与安克创新联合发布的“AI 录音豆”智能录音硬件现已在京东上架，这是飞书旗下首款硬件产品，定价为 899 元。 [100] 企业治理 播报编辑 核心管理层 分支机构 主要股东 主要投资 主营业务 播报编辑 业务范围 一般项目：机械设备研发；电子专用材料研发；储能技术服务；人工智能应用软件开发；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广；人工智能理论与算法软件开发；家用电器研发；软件开发；智能机器人的研发；地理遥感信息服务；集成电路设计；电子产品销售；家用电器零配件销售；电力电子元器件销售；幻灯及投影设备销售；电池销售；家用视听设备销售；电池零配件销售；移动终端设备销售；电子专用材料销售；音响设备销售；智能车载设备销售；可穿戴智能设备销售；智能家庭消费设备销售；智能基础制造装备销售；智能机器人销售；家用电器销售；物联网技术研发；电子专用设备销售；网络与信息安全软件开发；计算机系统服务；智能控制系统集成；人工智能行业应用系统集成服务；信息咨询服务（不含许可类信息咨询服务）；社会经济咨询服务；信息技术咨询服务；电子（气）物理设备及其他电子设备制造；电力电子元器件制造；其他电子器件制造；移动终端设备制造；家用电器制造；电子专用设备制造；电子元器件制造；电子元器件与机电组件设备制造；音响设备制造；智能基础制造装备制造；智能车载设备制造；可穿戴智能设备制造；智能家庭消费设备制造；自有资金投资的资产管理服务；贸易经纪；进出口代理；技术进出口；货物进出口。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动） [69] 主要业务 安克创新专注于智能配件和智能硬件的设计、研发和销售，主要销售渠道为Amazon、Ebay、天猫、京东等海内外线上平台，同时在北美、欧洲、日本和中东等发达国家和地区，与沃尔玛、百思买以及贸易商合作。安克创新致力于在全球市场塑造中国消费电子品牌，打造了智能充电品牌Anker，并相继推出Soundcore、eufy、Nebula等自主品牌，在AIoT、智能家居、智能声学、智能安防等领域，拥有全球140多个国家与地区超1亿用户。 [2] 主要品牌 播报编辑 主营产品 播报编辑 产品品类 主要产品 知识产权 播报编辑 专利成果 软件著作权 作品著作权 经营状况 播报编辑 股票信息 经营业绩 年报显示，2017年，安克创新国外销售达38.15亿元，占整体营收的97.52%，国内营收9705万元，同比增长154.60% [3]。公司在2014年、2015年营业收入分别为7.46亿元、13.02亿元 [4]。2016年营收25亿人民币，2017年营收39亿人民币，2018年营收达到52.32亿人民币 [5]。2019年营收65亿人民币，2020年营收93.53亿人民币 [27]，2021年营收125.74亿人民币 [26]，2022年营收142.51亿人民币。 [28] 2024年4月，安克创新发布2023年年度报告，该公司营业收入为175.07亿元，同比增长22.85%。归属于上市公司股东的净利润为16.15亿元，同比增长41.22%。归属于上市公司股东的扣除非经常性损益的净利润为13.44亿元，同比增长71.88%。基本每股收益为3.9733元。此外，拟向全体股东每10股派发现金红利20元(含税)，以资本公积金向全体股东每10股转增3股。 [77] 2024年8月，安克创新半年报数据显示，2024年1-6月营业总收入为96.48亿元，较2023年同期增长36.55%，净利润为8.72亿，较2023年同期增长6.36%，每股收益1.6505元，净资产收益率为10.44%，每股经营现金流量为1.5919元，销售毛利率为45.18%，所处行业为消费电子。 [76] 2024年10月29日，安克创新发布2024年三季报。报告显示，公司前三季度营业收入为164.49亿元，同比增长39.56%；归母净利润为14.72亿元，同比增长21.29%；扣非归母净利润为13.03亿元，同比增长41.13%；基本每股收益2.78元。 [75] 社会责任 播报编辑 环境责任 安克创新坚守以可持续发展为核心的绿色环保发展理念，大力倡导产业的绿色转型和变革，以提高行业标准化程度并减少浪费。一方面，倡议将充电器从手机、笔记本等电子设备的标准配件中移除，旨在有效减少电子废弃物的产生，促使消费者重复利用已有的充电设备，以及倡导统一USB Type-C接口，因为“兼容性”有助于实现多个品牌和设备的互联互通，从而减少消费者重复购买的行为和使用多个接口的需要，提高充电器的重复利用率，减少废弃物产生和节约资源。 [88] 另一方面，通过技术推动能源效率革命，如氮化镓充电产品推动行业内的小体积潮流，不仅用于数码充电配件，还用于户外移动电源设备，降低能源损耗，为节能减排贡献力量。以及积极推动循环经济模式，包括生产能够兼顾手机、笔记本、平板等设备同时充电的多口充电器和利用提供代金券方式，鼓励消费者回收旧设备的移动电源回收项目。 [88] 在企业自身经营上，安克创新致力于推动绿色产品的研发和生产，涉及到设计、材料选取、包装。产品自设计阶段起就注重对环境造成的影响，从能源利用方式、消费者的产品使用场景、提高产品寿命和资源利用效率等方面入手，包括引入小型光伏系统、提供持久耐用的产品。 [88] 其次，推动绿色环保材料创新，探索可再生、可降解和可循环利用等材料在产品中的应用，并将绿色材料理念融入到产品开发流程，在为消费者带来良好体验的同时，实现持续减少资源消耗和环境污染。如Anker环保数据线使用从植物中提取的可再生生物基材料，减少了30%-40%石油基塑料的使用。 [88] 社会公益 安克创新关注弱势群体，特别是特殊教育儿童群体、有公共卫生救治需求或受灾后亟待重建的地区 [89]。2022年共有297位员工参与公益社组织员工绿色低碳出行活动，对应配套捐赠了17000元，美国办公室也在地球日举办了环保活动 [88]。公司积极履行社会责任，适时进行慈善援助，截至2023年底，累计捐赠现金和物资价值超过 1000万元。 [89] 重要事件 播报编辑 专利诉讼纠纷 2017年12月，安克创新的同行ZAGG和Mophie向加州联邦法院提起诉讼，认为安克创新子公司某产品侵犯了其6项专利权，要求判令停止侵权并赔偿合理许可费用及诉讼费用等。ZAGG是一家纳斯达克上市的全球性移动设备配件研发、生产与销售公司。而Mophie是一家总部位于美国加州的移动智能设备及配件设计商和制造商，2017年其被ZAGG收购。 [66] 2018年10月，另一家公司Magnacharge向特拉华州联邦地区法院提起诉讼，认为安克创新子公司的产品“QI标准无线充电器”侵犯其US7417402号专利，请求判决确认被告侵犯其US7417402号专利并赔偿。 [66] 2019年4月，Sovereign以安克创新侵犯两项专利权为由起诉至向特拉华州地区法院，要求赔偿损失和律师费。 [66] 被强制执行事件 2024年5月，中国执行信息公开网显示，安克创新科技股份有限公司近日新增一则被执行人信息，执行标的500439.0元，执行法院为长沙市岳麓区人民法院，案件号为（2024）湘0104执5269号。 [32] “懂王”充电宝事件 2024年8月13日，特斯拉CEO马斯克在X平台对特朗普连线采访，这次对话吸引了全球网民的广泛关注。社交网络上流传的一张照片显示，特朗普在连线中使用了一款充电宝，有网友发现，这款充电宝与中国品牌安克创新的一款磁吸充电宝极为相似。安克创新团队迅速行动，抢抓了这次意外的“富贵”。 [48] 特朗普使用安克充电宝的消息传到国内，受此影响，安克创新股价在8月13日收盘前一度跳涨近3%，最终以上涨0.65%收盘，报54.27元/股。 [48] 2024年8月14日，安克创新在其抖音官方旗舰店展示了这款磁吸充电宝，并将特朗普连线的照片作为产品展示的首图。产品页面还特别标注了“懂王同款”“我们更懂快充”等宣传语。在ANKER安克官方旗舰店的直播间，主播详细讲解该款产品。客服在评论区留言称，该款产品为名人同款。媒体记者询问ANKER安克官方旗舰店客服，该款产品是否为“美国前总统特朗普同款充电宝”，该客服予以了确认。 [48] 奖金分红8亿元 2025年2月，安克创新一张内部PPT图片疑似在社交平台流传，其中显示，安克创新2024年奖金分红高达8亿元，有494人年收入破百万，迅速引发热议。PPT内容显示，2022年-2024年，安克创新的经营分享奖奖金总包和年收入破百万人数都在逐年增长。2022年经营分享奖奖金总包为2.5亿元，2023年这个数字涨到了4.7亿元，2024年几乎翻倍，达到了8亿元。此外，公司年收入破百万人数也从2022年的209人，增长至2023年的287人，2024年更是多达494人。并且预计，2025年的经营分享奖奖金总包还会增长至“10亿+”。 [37] 2025年2月25日，安克创新相关负责人回复记者称，上述图片来源于公司内部会议，内容属实。 [37] 召回部分移动电源 2025年6月20日，安克创新发布关于主动召回部分批次基础款移动电源的公告。公告称，因部分批次的基础款移动电源产品存在安全风险，经国家市场监督管理部门6月20日批准，安克即日起主动对型号为A1642/A1647/A1652/A1680/A1681/A1689/A1257的部分批次产品发起召回，请持有相关产品的用户立即停止使用。公告显示，该公司部分基础款移动电源产品存在安全风险，经湖南省市场监督管理部门审批，决定召回涉及多个型号的71万余件产品。同时，安克创新在美国也拟召回115.8万件充电宝产品。此次安克中国区召回的产品价格范围在149元-229元之间，若中国区用户全部选择全额退款，将直接造成1.06亿—1.63亿元的亏损。 [91] 安克表示，在最近的质量安全检查中发现，某供应商部分批次的行业通用电芯，存在未经批准的原材料变更，这可能导致极少数产品在长期循环使用后隔膜绝缘失效，进而引发过热甚至燃烧的安全隐患。截至目前，公司已下架所有官方电商平台相关型号产品，并已终止与该供应商的合作。 [90] 后续，不少购买了充电宝的消费者反馈，在将召回充电宝寄出的过程中，遇到快递公司拒绝收件。提交申请后客服审批完成后邮寄了防火袋。收到防火袋之后，客服又短信通知安排了快递上门取件。没想到快递公司却说充电宝是违禁品，让消费者打电话取消快递订单。从多家快递公司取件员口中得知，中通快递、韵达快递、极兔速递、申通快递都不允许寄送锂电池。仍接收充电宝邮寄订单的有京东快递和中国邮政，且对充电宝要求为电量不超过2万毫安。京东快递取件员表示，充电宝只能通过陆运邮寄，航空不行。 [92] 2025年6月30日，关于充电宝召回的情况，安克创新向记者表示：“安克正在主动进行有效有序的全量召回，为保障召回中的安全，共发出超8万个防火保护袋，目前召回率已达10%。” [93] 2025年9月，市场监管总局召开新闻发布会，通报称，针对今年上半年充电宝发生多起自燃事故，市场监管总局成立充电宝召回督导组赴广东、江苏等地进行督导，组织广东、湖南、北京等11个省（市）市场监管部门，开展线索排查、缺陷调查和召回工作。在市场监管部门调查影响下，安克创新科技股份有限公司决定对存在安全隐患的充电宝产品实施召回。截至2025年9月，安克创新公司累计召回56.5万件（占召回总量的78.7%），完成消费者退款8566.4万元。 [95-96] 企业文化 播报编辑 价值观 使命 极致创新，激发可能。 [2] 愿景 搭建一个互相激发的创造者乐园，成为全球消费者热爱的品牌。 [2] 价值观 第一性，求极致，共成长。 [2] 品牌标识 \"Anker 安克\"是德语中的：锚，是不折不挠、奋勇向前的意志。“Innovations 创新”是企业长久生命力的保障，这也是公司的全新定位。五个上升的圆：坚持用创新为用户创造五星体验。 [2] 社会荣誉 播报编辑"
}