{
  "url": "https://www.yodersrestaurant.com/restaurant/lunch-and-dinner-menu/",
  "title": "Lunch and Dinner Menu",
  "text": "Mon - Friday 11:00 AM to 8:00 PM Saturday 11:30 AM -8:00 PM Homemade Dressings: French (Our House), Ranch, Thousand Island, Blue Cheese, Italian Herb & Spice, Honey Mustard Dressings: Kraft Fat-Free Raspberry Vinaigrette Chopped turkey, egg, peas, bacon, cheese and tomatoes. Layered on a bed of crisp lettuce. Our customers’ favorite! 17.95 Breaded chicken tenders or grilled chicken breast, served on top of crisp lettuce. Garnished with cucumber, cheese, tomato and egg. 18.95 A bed of crisp lettuce with onions, cheese and tomatoes. Served with Mom’s Homemade Chili over the top and tortilla chips. 16.95 Choice of three side dishes and homemade bread. 12.95. Add a fourth side for 4.00. Farm fresh field greens topped with tomato, onion, cucumber, shredded cheese, and croutons. 6.95. French Fries covered with beef gravy & melted cheddar. 8.95. Thick cut onion rings, battered and deep fried till golden crisp. Served with your choice of dipping sauce. 7.95. A sharable basket filled with our homemade dinner rolls and corn bread. Served with apple butter. (Serves 5). 6.95. Ask your server Cup 5.95 Bowl 6.95 Cup 5.95 Bowl 6.95 9.95 Country cooking Southern style. All-natural chicken, hand breaded and deep pressure fried to seal in the juices and give it a crispy texture outside. Customers’ favorite, hands down! Our House Dressing makes the perfect dipping sauce! Dark & White 22.95 Dark 19.95 White 23.95 Dark 16.95 White 18.95 8 oz. skinless, boneless all-natural breast marinated in our special garlic recipe and sautéed. Plain breast also available. 16.95 Tender strips of chicken breaded and deep fried. Comes with BBQ sauce for dipping or your choice of dressing. Sm 15.95 18.95 White meat turkey breast and homemade stuffing smothered in our made-from-stock beef gravy. 16.95 19.95 Bone in chicken lightly dusted in our homemade seasoning, baked until juicy and delicious. Served with stuffing and your choice of two sides. Sm 16.95 18.95 All the favorites: meatloaf, turkey and fried chicken! Served with homemade mashed potatoes and green beans. 21.95 Southern goodness. Blackened grilled shrimp served on homemade cheesy grits with one side. 19.95 Your choice of breaded butterflied shrimp or grilled seasoned shrimp. Served with cocktail sauce and two sides. 19.95 Fish fried crispy and delicious, served with fries. 19.95 Country cooking Southern style. All-natural chicken, hand breaded and deep pressure fried to seal in the juices and give it a crispy texture outside. Customers’ favorite, hands down! Our House Dressing makes the perfect dipping sauce! Dark & White 20.50 Dark 18.95 White 21.95 Dark 14.95 White 16.95 Crispy fried chicken breast, applewood smoked bacon, dijonnaise, fresh lettuce and tomato on a brioche roll. 16.95 All-natural: garlic seasoned or plain. 14.95 Choose from American, Swiss, Cheddar or Colby 8.95 9.95 10.95 Add Cheese 2.00 10.95 9.95 Topped with sautéed onions and melted provolone on a sub roll. Served with Au jus. 16.95 Golden-fried chicken tenders, slaw and tangy pickles, drizzled with hot honey. Sweet-heat perfection. 14.95 On homemade bread, served with real mashed potatoes, and smothered in our made-from-stock beef gravy. Sm 13.95 16.95 Sliced thick and grilled. Our Amish guests say it’s the best! Sm 14.95 16.95 Well done and served Amish chunky style. Smothered in our made-from-stock beef gravy. Sm 16.95 19.95 Grilled tender and topped with cooked onions. 16.95 With bacon add 3.95 Ground beef and veggies topped with mashed potatoes & cheese. Includes choice of one side. 16.95 A country-style favorite! Perfectly seasoned and smothered in our made-from-stock beef gravy. Sm 15.95 17.95 Golden fried chopped beef steak, smothered in a rich pepper country gravy. 17.95 Served on a Brioche bun. Top with your favorites: Lettuce, tomato, pickle, onion, mayo 9.95 Add a side dish to your burger for only 4.00 Sorry, no discount on one less side dish with dinners."
}