{
  "url": "https://www.princess.com/cruise-destinations/caribbean-cruises/cruises-to-puerto-rico",
  "title": "The Best Cruises to Puerto Rico - Princess Cruises",
  "text": "Cruises to Puerto Rico Relax on white sand beaches with short cruises to the Bahamas and the Caribbean From romantic Bahamas getaways to relaxing Caribbean cruises, relax on sunny beaches and recharge with scenic boat rides along the crystalline waters. Lounge on the golden shores of the Eastern Caribbean, or relive history in the Western Caribbean, where ancient civilizations await. Short cruises to Bahamas ports, — like Princess Cays®, — Princess’ Private Island resort — and other nearby islands, allow you to experience relaxation in your own way, whether sunbathing, exploring or making a splash with water activities. Sink your toes into the soft sands of St. Thomas. Featured ports on Your Cruise to Puerto Rico Get an overview of some of the ports you could visit on your cruises to Puerto Rico (plus our main departure port, San Juan). - San Juan, departure port - Tortola - St. Kitts - Antigua - Grenada - Barbados - St. Thomas - St. Maarten - St. Vincent Visit the Old San Juan in Puerto Rico. Get ready to live on island time, times five. With the most ports of any seven-day itinerary – five islands. – these cruises have something for everyone, whether you prefer to seek adventure in St. Lucia and Barbados or hit the beach in Martinique. Enjoy our only weeklong voyages to take in the natural beauty and culture of the Southern Caribbean, all from San Juan, a departure port just an easy direct flight away. Rugged peaks and sheltered bays define Tortola, the largest of the British Virgin Islands. Stroll through Road Town’s lively harbor, then set out by catamaran to explore white-sand beaches like Cane Garden Bay. History buffs can visit 18th-century ruins, while adventurers can hike Sage Mountain or snorkel in the crystalline waters of the surrounding cays. It’s a destination where laid-back island life meets natural beauty at every turn. St. Kitts and the neighboring island of Nevis were once considered the crown jewels of the Caribbean, and it's easy to see why. Green hillsides, fields of sugarcane and dramatic volcanoes rise into the strikingly blue sky. With its beautifully restored colonial buildings, imposing Brimstone Hill Fortress and museum of Alexander Hamilton at his birthplace, history lovers will have plenty to explore after relaxing on the beautiful beaches on a cruise to St. Kitts. Antigua serves up laid-back Caribbean charm with a touch of adventure. With 365 beaches — one for every day of the year — this island is a beach lover’s dream, framed by turquoise water and gentle surf. Unwind in a quiet cove, snorkel vibrant reefs or soar through the Antiguan rainforest on a zipline. Only available on our Southern Caribbean cruises, Antigua offers a mix of sun, serenity and thrill in one stop. Known as the Spice Isle, Grenada welcomes you with the scent of nutmeg and warm ocean breezes. Wander through the colorful capital of St. George’s, where colonial buildings line the waterfront, or hike to cascading waterfalls deep in the jungle. With black-sand beaches, coral reefs and spice plantations to explore, Grenada is a rich blend of nature, culture and Caribbean flavor that makes every moment ashore feel special. Barbados brings together British charm and island soul, from its elegant plantation homes to its lively beach bars. Explore limestone caves, swim with sea turtles or savor fresh-caught flying fish with a splash of local rum. This island is a gem of the Southern Caribbean, known for its warm hospitality and sun-soaked coastlines. It’s a must-see stop exclusive to our seven-day cruises from San Juan. Cruise to St. Thomas, an American paradise that contains everything alluring about the Caribbean: sparkling sands, pirate history, coral reef snorkeling and shipwreck dives. St. Thomas is also known for its stunning beaches, including Magens Bay and nearby Trunk Bay — named one of the 7 Cruise Wonders of the World. Its deep harbor is one of the most iconic in the Caribbean, so you can take relaxation to a whole other level with all the sun, rum punch and island music you could ever dream of. St. Maarten island. Two islands in one, St. Maarten is split between France and the Netherlands, but comes together as one memorable experience. From the Dutch-inspired port of Philipsburg with its historic colonial architecture and warm beaches, to the French hub of Marigot full of designer boutiques and bistros, a cruise to St. Maarten has something for you. Raw, lush and less-traveled, St. Vincent is a haven if you love nature and exploration. Hike the slopes of La Soufrière volcano, stroll through tropical botanical gardens or snorkel in warm waters off volcanic black-sand beaches. With fewer crowds and more unspoiled landscapes, this island invites you to slow down and connect with the wilder side of the Caribbean — one waterfall, reef and rainforest trail at a time. What will you do on a Puerto Rico cruise? Our Puerto Rico excursions offer unforgettable ways to connect with the island’s spirit. Step into Old San Juan’s storied streets, hike El Yunque’s misty trails or indulge in the flavors of traditional Puerto Rican cuisine. Welcome to the San Juan cruise port Where cobblestones meet coastline, San Juan surrounds you with history and culture that you can explore to your heart’s content. With endless things to do in San Juan, Puerto Rico, you won’t ever be bored. Take in sweeping views from the Castillo San Felipe del Morro, browse artisan markets tucked into 16th-century streets or cool off with a piña colada in the city where it was invented. With boutique hotels, hidden courtyards and colorful murals around every turn, there’s no better place to begin — or end — your Caribbean cruise. Discover your perfect San Juan, Puerto Rico excursion for your next cruise with Princess. Escape to the open sea with Princess Cruises. Why cruise with Princess Caribbean cuise onboard experience featured program Award-winning programs. World-class chefs. And Caribbean-themed activities, day and night. With Princess, your ship is a destination all its own. Ship activities for every cruise to the Caribbean All you need to know about Caribbean getaway cruises Sometimes you just need to get away from it all. On a short getaway cruise, you'll experience elegant accommodations, internationally-inspired cuisine Let Princess get you there with travel, airfare & hotels Cruise deals and promotions Start planning the vacation of your dreams with a cruise you'll love at a price you can't beat. Explore our latest featured deals, snag some last-minute savings and see how our all-inclusive packages can make your getaway even better. Escape to the open sea with Princess Cruises. The beautiful Piazza lets the light shine in."
}