{
  "url": "https://www.reddit.com/r/WalmartEmployees/comments/1d8wmnb/new_yearly_bonus_for_associates_info/",
  "title": "Reddit - The heart of the internet",
  "text": "New Yearly Bonus for Associates Info As mentioned at this year’s Associate’s Week Meeting during Shareholders, regular associates can now receive a yearly bonus up to $1,000! The announcement was also made on Walmart’s corporate site: https://corporate.walmart.com/news/2024/06/05/the-investment-continues-walmart-launches-associate-bonuses-new-opportunities As for the finer details, that’s now available on OneWalmart for associates to view here: https://one.walmart.com/content/usone/en_us/company/news/announcements/associate-bonus.html Common questions that have already been asked (and will continue to be asked) are listed in the second link, such as: What is the new associate Bonus? Walmart is a place where you can come for a good job, stay for a great career, and then retire. We want to see you grow and prosper from benefits like Live Better U, our 401k, and Associate Stock Purchase plans. This annual hourly bonus is the next step. It’s based on store performance and scales with years of service so we celebrate and reward long-term associates. https://one.walmart.com/content/usone/en_us/company/news/announcements/associate-bonus/jcr:content/par/block_container_1002701916/block-container-par/image_tabs_2_0/parsys_tab_0/columns_new/column_1/image_2_0.img.png/1717533880197.png Why invest in this new bonus? We’re investing in you, because we want to see you grow and prosper here and because you are Walmart. When you give us feedback, it shapes the way we invest. You’ve told us how important it is to have a bonus separate from your regular pay. You’ve also told us it matters to have a bonus tied to your years of service and your store’s performance. That’s why we’re making this new investment in you. And it starts right now. How does it work? The associate bonus is designed to reward hourly associates for working as a team, taking care of customers, and helping their store succeed. The bonus is based on store performance and scales with years of service so the longer you’ve been with Walmart, the more you can make, up to $1,000. You can find details about your eligibility in the Associate Bonus Toolkit linked on this page. Who’s eligible and when does it pay out? This investment will be paid annually and will include eligible hourly store associates and store-based Health & Wellness associates. Whether you’re full-time or part-time, you’ll be able to earn this bonus if you've been with Walmart for at least one year, with the first payout in March of 2025. See the associate toolkit for more details on eligibility. One of the bigger questions that will be asked is about the metrics behind how the bonus is determined: This bonus will be based 75% on Sales and 25% on Profit Growth. This means eligible associates’ bonus payout will grow as their store’s profit grows. Associate Bonus Eligibility There are a few things you need to know about who is eligible for the new associate bonus program: Associates must be employed through and have at least 12 consecutive months of employment on Jan. 31, 2025, to be eligible for the first payout in March 2025. Associates must be in full-time/part-time status as of Jan. 31 of each year to qualify. For the March 2025 payout, this means associates need to meet the criteria below as of Jan. 31, 2025. (Associates with temporary status on Jan. 31, 2025, are not eligible. Temporary associates who have at least 12 months of service and convert to full-time/part-time status by Jan. 31, 2025, will be eligible for payout. The associate’s time as a temporary associate.) Years of service will be determined by length of employment as of Jan. 31 based on the associate’s most recent hire date. (For the March 2025 payout, associates’ length of employment will be determined as of Jan. 31, 2025) Associates who are coded as full-time status on Jan. 31 or part-time associates whose average hours align to the table below will be considered full-time. Remaining eligible associates will be considered part-time. https://one.walmart.com/content/usone/en_us/work1/people/toolkits/associate-bonus/manager/bonus-announcement/jcr:content/par/image_tabs_2_0_copy/parsys_tab_0/image_2_0_copy_copy__271914358.img.jpg/1717450523118.jpg"
}