{
  "url": "https://www.falloutcascadia.com/factions",
  "title": "Factions — Fallout: Cascadia",
  "text": "FACTIONS Republic of Cascadia Time only moves forward. And the Republic of Cascadia is poised to go beyond simply returning safety and a good quality of life back to the wasteland. Founded out of the city of Cascade in 2289, this flourishing new republic has been called \"the jewel of the Pacific coast.\" It has seen the return of many Old World institutions: art, culture, economy, and law. It is currently led by the Republic's 4th President: Oliver Pearse, who is assisted by his sister, adviser, and the Republic's Attorney General, Emily. To many, the Republic of Cascadia is a beacon of hope. But to others, they represent the large-scale expansion which plagued the Old World. With dissenters such as the Red Leafs and other rogues becoming more present, the Republic is strengthening its grip on the wasteland. However: is the safety of their nation worth the inevitable cost? The Red Leafs The Red Leafs began as a grassroots reactionary movement to the American annexation of Canada in 2072. While they barely survived for the first 150 years or so after the Great War, now they are re-surfacing as they face a new contender: the Republic of Cascadia. Concerned by the RoC’s growing political power which they feel leans toward authoritarianism, the Leafs are proponents of reciprocating the annexation that they once faced. They wish to overthrow the current government and bring political power back to the hands of the people. Turbulent and guerrilla, the Red Leafs intend to bring about their revolution at any cost, making it clear that they will topple anyone who stands in their way. Many wastelanders find their cause attractive, but are concerned about the methods - do the ends justify the means? New California Republic The NCR’s presence in the Pacific Wasteland is an unsteady one, as the conflict between the Red Leafs and ROC comes to a climax. While they have made diplomatic moves towards the ROC, establishing an embassy to foster relations, they remain otherwise neutral to the conflict. Meanwhile, this neutrality leaves many of their soldiers stationed in their few established bases feeling like they’ve hit a dead end in their service. This isn’t without good reason either, as those who get sent there are rarely reassigned, and there’s no battles to be fought beyond the occasional bar fight at the RAM. Despite this topor, there are still some among the denizens of the Pacific Wasteland who fear that behind this exterior, the NCR is making plans to take the wasteland for its own. Could they be right, or is the Bear in hibernation?"
}