{
  "url": "https://support.google.com/earth/answer/21955?hl=de",
  "title": "Google Earth Pro installieren und deinstallieren - Google Earth-Hilfe",
  "text": "Wichtig: Damit Sie Google Earth Pro und die zugehörigen Funktionen nutzen können, benötigen Sie eine der folgenden Versionen: - Für Google Earth Pro ist Version 7.1.8 oder neuer erforderlich. - Wenn Sie auf Google Street View zugreifen möchten, während Sie Google Earth Pro verwenden, benötigen Sie mindestens die Version 7.3.3. Wenn Sie Google Earth Pro installieren oder ein Upgrade auf die neueste Version durchführen möchten, laden Sie einfach die Anwendung herunter. Systemanforderungen Damit Sie Google Earth Pro auf dem Computer verwenden können, muss das System die Mindestanforderungen erfüllen. Systemanforderungen: WindowsMindestanforderungen: - Betriebssystem: Windows 7 - CPU: mindestens 1 GHz - Arbeitsspeicher (RAM): 2 GB - Festplatte: 2 GB verfügbarer Speicherplatz - Internetverbindung - Grafikprozessor: kompatibel mit DirectX 9 oder OpenGL 1.4 Empfohlen: - Betriebssystem: Windows 7 oder neuer - CPU: Dual-Core-Prozessor mit mindestens 2 GHz - Arbeitsspeicher (RAM): 4 GB - Festplatte: 4 GB verfügbarer Speicherplatz - Highspeed-Internetverbindung - Grafikprozessor: kompatibel mit DirectX 11 oder OpenGL 2.0 Mindestanforderungen: - Betriebssystem: Mac OS X 10.8 - CPU: 64-Bit-Prozessor von Intel - Arbeitsspeicher (RAM): 2 GB - Festplatte: 2 GB verfügbarer Speicherplatz - Internetverbindung - Grafikprozessor: kompatibel mit OpenGL 1.4 Empfohlen: - Betriebssystem: Mac OS X 10.8 oder neuer - CPU: 64-Bit-Dual-Core-Prozessor von Intel - Arbeitsspeicher (RAM): 4 GB - Festplatte: 4 GB verfügbarer Speicherplatz - Highspeed-Internetverbindung - Grafikprozessor: kompatibel mit OpenGL 2.0 Mindestanforderungen: - Betriebssystem: Ubuntu 14/Fedora 23 (bzw. gleichwertig) oder neuer - CPU: amd64-kompatibler Prozessor mit 1 GHz - Arbeitsspeicher (RAM): 2 GB - Festplatte: 2 GB verfügbarer Speicherplatz - Internetverbindung - 3D-Grafik-Subsystem: kompatibel mit OpenGL 1.4 Empfohlen: - CPU: amd64-kompatibler Prozessor mit 2 GHz - Arbeitsspeicher (RAM): 4 GB - Festplatte: 4 GB verfügbarer Speicherplatz - Highspeed-Internetverbindung - 3D-Grafik-Subsystem: OpenGL 2.0-kompatibel - Bildschirm: 1280 × 1024 Pixel, hohe Farbtiefe (32 Bit) Google Earth Pro wird von den neuesten Versionen der Linux-Distributionen Ubuntu und Fedora unterstützt. Unter Umständen lässt sich die Anwendung auch mit anderen beliebten Distributionen nutzen. Aufgrund der großen Vielfalt der verfügbaren Linux-Plattformen kann dies jedoch nicht garantiert werden. Google Earth Pro installieren Google Earth Pro installieren: Windows- Laden Sie Google Earth Pro herunter. - Klicken Sie doppelt auf die Datei und folgen Sie den Schritten in der Anleitung. - Öffnen Sie Google Earth Pro. Klicken Sie dazu auf Start „Programme“ Google Earth Pro. Wählen Sie anschließend „Google Earth Pro“ aus. - Laden Sie Google Earth Pro herunter. - Öffnen Sie die Datei „GoogleEarthProMac-Intel.dmg“. - Öffnen Sie die Datei „Install Google Earth Pro.pkg“ und folgen Sie den Schritten in der Anleitung. - Öffnen Sie den Ordner „Programme“ und klicken Sie doppelt auf „Google Earth Pro“, um die Anwendung zu starten. Hinweis: Während der Installation müssen Sie das Administratorpasswort für Max OS X angeben. Es wird nicht an Google weitergegeben. Installationsfehler beheben Bevor Sie Fehler gemäß der Anleitung unten beheben, sollten Sie Folgendes prüfen: - Prüfen Sie, ob Ihr Betriebssystem unterstützt wird. - Wenn Sie Google Earth Pro verwenden, sollten Sie auf Ihrem Computer Administratorrechte haben. Sie können die Installation auf Ihrem Computer auch über ein Administratorkonto durchführen. MSI- oder DLL-Fehler - Deinstallieren Sie zuerst Ihre aktuelle Version von Google Earth Pro. Öffnen Sie dazu die Systemsteuerung wählen Sie \"Programm deinstallieren\" aus. Hinweis: Bei einigen Windows-Versionen lautet der Pfad Systemsteuerung Programme deinstallieren oder ändern. - Laden Sie die aktuelle Version von Google Earth Pro herunter. Wenn Probleme beim Verbindungsaufbau mit Google Earth Pro auftreten und auf Ihrem Computer eine Firewall installiert ist, kann Google Earth Pro möglicherweise nicht auf das Internet zugreifen. Beispiele für gängige Firewalls: - McAfee Personal Firewall Plus (auch in McAfee Internet Security Suite) - ZoneAlarm - Norton Personal Firewall Sie können Fehler beheben, indem Sie die Einstellungen Ihrer Sicherheitssoftware öffnen und Folgendes prüfen: - Die Datei googleearth.exe wird nicht blockiert (nur Windows). - Der Zugriff auf \"Port 80\" ist auch für Anwendungen möglich, bei denen es sich nicht um einen Browser handelt. Hinweis: Vor der Installation von Google Earth Pro müssen Sie das Administratorpasswort für Max OS X angeben. Es wird nicht an Google weitergegeben. Google Earth Pro deinstallieren Google Earth Pro deinstallierenÄltere Windows-Versionen - Klicken Sie auf Start Einstellungen Systemsteuerung. - Doppelklicken Sie auf Software. - Wählen Sie Google Earth Pro aus. - Klicken Sie auf Deinstallieren Ja Fertig. Windows 7 und höher - Klicken Sie auf Start Einstellungen Systemsteuerung. - Klicken Sie doppelt auf Programm deinstallieren oder ändern. - Wählen Sie Google Earth Pro aus. - Klicken Sie auf Deinstallieren. - Öffnen Sie den Ordner „Programme“ und suchen Sie nach „Google Earth Pro“. - Klicken Sie mit der rechten Maustaste auf das Symbol für Google Earth Pro und wählen Sie Löschen aus. Gehen Sie wie hier beschrieben vor, wenn Sie alle Google Earth Pro-Dateien von Ihrem Mac entfernen möchten: - Öffnen Sie den Finder. - Klicken Sie oben auf Gehe zu. - Halten Sie auf Ihrer Tastatur die Alt-Taste gedrückt und klicken Sie auf Library. - Gehen Sie zu Caches Google Earth Pro und löschen Sie alle Dateien. - Gehen Sie dann zu Library Application Support Google Earth Pro und löschen Sie alle Dateien. Ältere Versionen von Mac OS X: - Öffnen Sie den Finder. - Klicken Sie auf das Symbol für das Basisverzeichnis mit Ihrer Nutzer-ID. - Gehen Sie zu Library Caches Google Earth Pro und löschen Sie alle Dateien. - Gehen Sie dann zu Library Application Support Google Earth Pro und löschen Sie alle Dateien."
}