{
  "url": "https://languagetool.org/pt-BR/",
  "title": "Verificador gramatical por AI gratuito - LanguageTool",
  "text": "Mais de 2 mil empresas confiam nas nossas ferramentas de IA - BMW Group - European Union - Spiegel Magazine - Deutsche Presse-Agentur (dpa) - Deezer - TÜV Süd - Algemeen Nederlands Persbureau (ANP) - Heise - Max-Planck-Gesellschaft - Blinkist - Bertelsmann Stiftung - Schweizer Radio und Fernsehen (SRF) - Kronen Zeitung - JetBrains - IP Australia Experimente o Editor LanguageTool para uma Melhor Experiência de Escrita Crie sua conta gratuita - Experiência de escrita sem distrações - Dicionário Pessoal - As estatísticas ajudam você a manter o foco na sua escrita - Os textos são armazenados em segurança - Tenha acesso a ainda mais sugestões de pontuação, estilo e tipografia avançados com o \"Modo Exigente\" - Escolha entre o modo escuro e claro Nossa extensão de navegador funciona em qualquer lugar da web Receba dicas sobre como melhorar seu texto (incluindo conselhos de pontuação) enquanto digita um e-mail, uma postagem de blog ou apenas um simples tweet. Qualquer que seja o idioma que você esteja usando, o LanguageTool o detectará automaticamente e dará sugestões. Para respeitar a sua privacidade, nenhum texto é armazenado pela extensão do navegador Mais de 1 milhão de usuários confiam no LanguageTool para escrever O melhor verificador gramatical para Firefox com mais de 1 milhão de usuários Mais de 4 milhão de usuários confiam na LanguageTool com sua escrita Verificador gramatical de alto nível para Chrome com mais de 3 milhões de usuários Você fala uma língua estrangeira? A Ferramenta de Escritura Mais Internacional Existem mais de 7.000 idiomas e vários países multilíngues no mundo. O LanguageTool ajuda como um verificador ortográfico internacional e uma ferramenta de parafraseamento em vários idiomas, incluindo: e mais de 30 outras línguas e dialetos Atinja todo o seu potencial conhecendo suas estatísticas Esse recurso ajuda você a manter a consistência na sua escrita, acompanhando sua produtividade. Ele também fornece uma visão geral dos idiomas usados, erros cometidos e sugestões aplicadas, para que você possa ver por si mesmo como suas habilidades de redação melhoraram. Integra-se ao seu programa de escritório favorito Tire o máximo proveito de seus documentos e entregue resultados sem erros. Não importa se você está trabalhando em uma dissertação, uma redação, um livro, ou se deseja apenas anotar algo. - Obter Extensão do Google Docs Verifique erros gramaticais e ortográficos em todos os seus textos no Google Docs com a extensão para navegador do Language Tool. - Obter Aplicativo macOS para Microsoft Word O LanguageTool para macOS permite que você verifique o texto no Microsoft Word e na maioria dos seus aplicativos favoritos do Mac. Verificação de texto para LibreOffice Corrigir Ortografia Você é vítima de erros de digitação e ortografia com muita frequência? O LanguageTool encontra todos os erros e os sublinha em vermelho. Soletre cada nome, frase e palavra que escrever … ah, e do jeito certo! Verificar Gramática As regras gramaticais nunca foram tão fáceis! O LanguageTool ajudará a livrar sua escrita de todas as gafes gramaticais, como concordância incorreta entre sujeito e verbo, formas plurais incorretas ou uso indevido de formas gramaticais. Corrigir Pontuação Vígulas, travessões e hífhens…ai, ai, ai! A pontuação adequada pode ser complicada - mas o LanguageTool garante que você use os espaços corretamente. Pode até ajudá-lo a formar frases complexas e dizer quando você usou muitas exclamações!!! Maiúsculas e minúsculas É tudo sobre as maiúsculas, certo? Ah, e minúsculas também. O LanguageTool corrige maiúsculas e minúsculas incorretas, esteja você escrevendo nomes, meses, lugares ou identidades nacionais. Melhorar Estilo O LanguageTool ajuda sua escrita a ser tão elegante quanto você, detectando frases usadas em excesso, estrangeirismos, palavras redundantes e escolha inadequada de palavras. Tudo o que você precisa fazer para encontrar o melhor estilo é procurar o sublinhado azul. Algo mais? Perguntas Frequentes Dê ao seu texto um tom profissional e evite erros constrangedores de estilo, pontuação e gramática O LanguageTool conta apenas com a correção ortográfica? LanguageTool corrige erros de ortografia, mas também oferece uma análise de escrita completa de todos os textos possíveis. Além da ortografia, gramática e escolha de palavras, o estilo do idioma também é corrigido. Até que ponto o LanguageTool detecta erros de vírgula? O LanguageTool encontra todos os tipos de erros de pontuação e os corrige. Sua correção distingue entre vírgulas opcionais e obrigatórias. Até mesmo estruturas de frases complexas podem ser corrigidas pela verificação de vírgulas. Como funcionam a detecção e a correção de erros do LanguageTool? A exibição de erros e os cartões de sugestões são exibidos automaticamente e diretamente durante a digitação. Isso significa que os textos podem ser verificados e corrigidos em apenas alguns momentos. Para ver sinônimos, basta clicar duas vezes em qualquer palavra. Leia maisQuais idiomas podem ser verificados com o LanguageTool? O LanguageTool domina mais de 30 idiomas e dialetos. Seus principais são inglês, espanhol, alemão, francês, holandês e português. Em sua versão em inglês, você pode escolher entre seis variedades padrão (EUA, Reino Unido, Canadá, Austrália, Nova Zelândia e África do Sul). O LanguageTool é grátis? O LanguageTool está disponível em duas versões. A gratuita corrige a ortografia, bem como pontuação simples e alguns erros de estilo. Somente a versão Premium mostrará todos os erros e fornecerá o melhor texto possível. Contas de equipe para empresas também estão disponíveis. Leia maisO LanguageTool funciona no meu programa? O LanguageTool não se restringe a um programa ou site específico. Existem várias extensões e add-ons disponíveis em todos os navegadores de internet populares. Além disso, o nosso editor de texto está disponível como aplicativo para iOS, macOS (Apple) e Windows. Você só precisa de uma conta de usuário. Leia maisO LanguageTool é adequado para reescrever frases? O LanguageTool agora oferece uma função de parafraseamento baseada em I.A., além da correção. Isso ajuda a reescrever frases inteiras para torná-las mais simples, curtas ou mais formais. Leia maisO LanguageTool pode me ajudar a corrigir uma tese de graduação ou mestrado? Se você tem que escrever um trabalho de conclusão de curso, uma tese de graduação ou de mestrado da universidade, o LanguageTool pode ajudá-lo a ter certeza de que não existam erros. O assistente de estilo também é particularmente útil para outros textos acadêmicos em escolas ou editoras. A propósito, estudantes têm direito a um desconto ao adquirir o LanguageTool. Leia maisLiberte o escritor profissional que há em você com o LanguageTool Premium Vá muito além da gramática e da verificação ortográfica e impressione com uma escrita clara, precisa e estilisticamente correta. Saiba mais"
}