{
  "url": "https://en.wikipedia.org/wiki/4",
  "title": "4 - Wikipedia",
  "text": "4 4 (four) is a number, numeral and digit. It is the natural number following 3 and preceding 5. It is a square number, the smallest semiprime and composite number, and is considered unlucky in many East Asian cultures. Evolution of the Hindu-Arabic digit [edit]Brahmic numerals represented 1, 2, and 3 with as many lines. 4 was simplified by joining its four lines into a cross that looks like the modern plus sign. The Shunga would add a horizontal line on top of the digit, and the Kshatrapa and Pallava evolved the digit to a point where the speed of writing was a secondary concern. The Arabs' 4 still had the early concept of the cross, but for the sake of efficiency, was made in one stroke by connecting the \"western\" end to the \"northern\" end; the \"eastern\" end was finished off with a curve. The Europeans dropped the finishing curve and gradually made the digit less cursive, ending up with a digit very close to the original Brahmin cross.[1] While the shape of the character for the digit 4 has an ascender in most modern typefaces, in typefaces with text figures the glyph usually has a descender, as, for example, in . On the seven-segment displays of pocket calculators and digital watches, as well as certain optical character recognition fonts, 4 is seen with an open top: .[2] Television stations that operate on channel 4 have occasionally made use of another variation of the \"open 4\", with the open portion being on the side, rather than the top. This version resembles the Canadian Aboriginal syllabics letter ᔦ. The magnetic ink character recognition \"CMC-7\" font also uses this variety of \"4\".[3] Mathematics [edit]Lagrange's four-square theorem states that every positive integer can be written as the sum of at most four squares.[4][5] Four is one of four all-Harshad numbers. Each natural number divisible by 4 is a difference of squares of two natural numbers, i.e. . A four-sided plane figure is a quadrilateral or quadrangle, sometimes also called a tetragon. It can be further classified as a rectangle or oblong, kite, rhombus, and square. Four is the highest degree general polynomial equation for which there is a solution in radicals.[6] Four is the only square number where is a prime number. The four-color theorem states that a planar graph (or, equivalently, a flat map of two-dimensional regions such as countries) can be colored using four colors, so that adjacent vertices (or regions) are always different colors.[7] Three colors are not, in general, sufficient to guarantee this.[8] The largest planar complete graph has four vertices.[9] A solid figure with four faces as well as four vertices is a tetrahedron, which is the smallest possible number of faces and vertices a polyhedron can have.[10] The regular tetrahedron, also called a 3-simplex, is the simplest Platonic solid.[11] It has four regular triangles as faces that are themselves at dual positions with the vertices of another tetrahedron.[12] The smallest non-cyclic group has four elements; it is the Klein four-group.[13] An alternating groups are not simple for values ≤ . There are four Hopf fibrations of hyperspheres: They are defined as locally trivial fibrations that map for values of (aside from the trivial fibration mapping between two points and a circle).[14] In Knuth's up-arrow notation, , and so forth, for any number of up arrows.[15] There are four dimensions in the theory of Minkowski space, three of space and the one being time. List of basic calculations [edit]In culture [edit]- Four is the sacred number of the Zia, an indigenous tribe located in the U.S. state of New Mexico.[16] - Superstition about the number four is most common in East Asian nations, where it is a homonym for \"death\" in many languages.[17] In logic and philosophy [edit]- The symbolic meanings of the number four are linked to those of the cross and the square. \"Almost from prehistoric times, the number four was employed to signify what was solid, what could be touched and felt. Its relationship to the cross (four points) made it an outstanding symbol of wholeness and universality, a symbol which drew all to itself\". Where lines of latitude and longitude intersect, they divide the earth into four proportions. Throughout the world kings and chieftains have been called \"lord of the four suns\" or \"lord of the four quarters of the earth\",[18] which is understood to refer to the extent of their powers both territorially and in terms of total control of their subjects' doings. - The Square of Opposition, in both its Aristotelian version and its Boolean version, consists of four forms: A (\"All S is R\"), I (\"Some S is R\"), E (\"No S is R\"), and O (\"Some S is not R\").[citation needed] Religion [edit]Judaism Four represents the four matriarchs (Sarah, Rebecca, Rachel, and Leah); the four sides of the world, the four extremes. Christianity Four represents the 3+1 of the Holy Trinity engendered as the one God and has a particular significance in Christian Theology because of that. In Augustinian numerology, four represents the earth and earthly affairs. In technology [edit]- In internet slang, \"4\" can replace the word \"for\" (as \"four\" and \"for\" are pronounced similarly). For example, typing \"4u\" instead of \"for you\". - In Leetspeak, \"4\" may be used to replace the letter \"A\". Other groups of four [edit]- Approximately four weeks (4 times 7 days) to a lunar month (synodic month = 29.54 days). Thus the number four is universally an integral part of primitive sacred calendars. - Four seasons in a year: spring, summer, autumn and winter. References [edit]- ^ Georges Ifrah, The Universal History of Numbers: From Prehistory to the Invention of the Computer transl. David Bellos et al. London: The Harvill Press (1998): 394, Fig. 24.64 - ^ \"Seven Segment Displays (7-Segment) | Pinout, Types and Applications\". Electronics Hub. 22 April 2019. Archived from the original on 28 July 2020. Retrieved 28 July 2020. - ^ \"Battle of the MICR Fonts: Which Is Better, E13B or CMC7? - Digital Check\". Digital Check. 2 February 2017. Archived from the original on 3 August 2020. Retrieved 28 July 2020. - ^ Spencer, Joel (1996), Chudnovsky, David V.; Chudnovsky, Gregory V.; Nathanson, Melvyn B. (eds.), \"Four Squares with Few Squares\", Number Theory: New York Seminar 1991–1995, New York, NY: Springer US, pp. 295–297, doi:10.1007/978-1-4612-2418-1_22, ISBN 978-1-4612-2418-1 {{citation}} : CS1 maint: work parameter with ISBN (link) - ^ Peterson, Ivars (2002). Mathematical Treks: From Surreal Numbers to Magic Circles. MAA. p. 95. ISBN 978-0-88385-537-9. 7 is an example of an integer that can't be written as the sum of three squares. - ^ Bajnok, Béla (13 May 2013). An Invitation to Abstract Mathematics. Springer Science & Business Media. ISBN 978-1-4614-6636-9. There is no algebraic formula for the roots of the general polynomial of degrees 5 or higher. - ^ Bunch, Bryan (2000). The Kingdom of Infinite Number. New York: W. H. Freeman & Company. p. 48. - ^ Ben-Menahem, Ari (6 March 2009). Historical Encyclopedia of Natural and Mathematical Sciences. Springer Science & Business Media. p. 2147. ISBN 978-3-540-68831-0. (i.e. That there are maps for which three colors are not sufficient) - ^ Molitierno, Jason J. (19 April 2016). Applications of Combinatorial Matrix Theory to Laplacian Matrices of Graphs. CRC Press. p. 197. ISBN 978-1-4398-6339-8. ... The complete graph on the largest number of vertices that is planar is K4 and that a(K4) equals 4. - ^ Grossnickle, Foster Earl; Reckzeh, John (1968). Discovering Meanings in Elementary School Mathematics. Holt, Rinehart and Winston. p. 337. ISBN 9780030676451. ...the smallest possible number of faces that a polyhedron may have is four - ^ Grossnickle, Foster Earl; Reckzeh, John (1968). Discovering Meanings in Elementary School Mathematics. Holt, Rinehart and Winston. p. 337. ISBN 9780030676451. ...face of the platonic solid. The simplest of these shapes is the tetrahedron... - ^ Hilbert, David; Cohn-Vossen, Stephan (1999). Geometry and the Imagination. American Mathematical Soc. p. 143. ISBN 978-0-8218-1998-2. ...the tetrahedron plays an anomalous role in that it is self-dual, whereas the four remaining polyhedra are mutually dual in pairs... - ^ Horne, Jeremy (19 May 2017). Philosophical Perceptions on Logic and Order. IGI Global. p. 299. ISBN 978-1-5225-2444-1. Archived from the original on 31 October 2022. Retrieved 31 October 2022. The Klein four-group is the smallest noncyclic group,... - ^ Shokurov, A.V. (2002). \"Hopf fibration\". In Michiel Hazewinkel (ed.). Encyclopedia of Mathematics. Helsinki: European Mathematical Society. ISBN 1402006098. OCLC 1013220521. Archived from the original on 1 May 2023. Retrieved 30 April 2023. - ^ Hodges, Andrew (17 May 2008). One to Nine: The Inner Life of Numbers. W. W. Norton & Company. p. 249. ISBN 978-0-393-06863-4. 2 ↑↑ ... ↑↑ 2 is always 4 - ^ Bulletin - State Department of Education. Department of Education. 1955. p. 151. Four was a sacred number of Zia - ^ Lachenmeyer, Nathaniel (2005). 13: The Story of the World's Most Notorious Superstition. Penguin Group (USA) Incorporated. p. 187. ISBN 978-0-452-28496-8. In Chinese, Japanese, and Korean, the word for four is, unfortunately, an exact homonym for death - ^ Chevalier, Jean and Gheerbrant, Alain (1994), The Dictionary of Symbols. The quote beginning \"Almost from prehistoric times...\" is on p. 402. - Wells, D. The Penguin Dictionary of Curious and Interesting Numbers London: Penguin Group. (1987): 55–58 External links [edit]- Marijn.Org on Why is everything four? - A few thoughts on the number four, by Penelope Merritt at samuel-beckett.net - The Number 4 - The Positive Integer 4 - Prime curiosities: 4"
}