{
  "url": "https://www.isbe.net/Pages/Model-Mathematics-Curriculum.aspx",
  "title": "Model Math Curricular Resources",
  "text": "FOCUS STRONGLY WHERE THE STANDARDS FOCUS. The standards call for a greater focus in mathematics. Rather than racing to cover topics in today’s mile—wide, inch—deep curriculum, teachers use the power of the eraser and significantly narrow and deepen the way time and energy is spent in the math classroom. They focus deeply on the major work of each grade so that students can gain strong foundations: solid conceptual understanding, a high degree of procedural skill and fluency, and the ability to apply the math they know to solve problems inside and outside the math classroom. COHERENCE - THINK ACROSS GRADES, AND LINK TO MAJOR TOPICS WITHIN GRADES Thinking across grades: The Standards are designed around coherent progressions from grade to grade. Principals and teachers carefully connect the learning across grades so that students can build new understanding onto foundations built in previous years. Teachers can begin to count on deep conceptual understanding of core content and build on it. Each standard is not a new event, but an extension of previous learning. Instead of allowing additional or supporting topics to detract from the focus of the grade, these topics can serve the grade level focus. For example, instead of data displays as an end in themselves, they support grade--‐level word problems. RIGOR: IN MAJOR TOPICS PURSUE CONCEPTUAL UNDERSTANDING, PROCEDURAL SKILL AND FLUENCY, AND APPLICATION WITH EQUAL INTENSITY. Conceptual understanding: The Standards call for conceptual understanding of key concepts, such as place value and ratios. Teachers support students’ ability to access concepts from a number of perspectives so that students are able to see math as more than a set of mnemonics or discrete procedures. Procedural skill and fluency: The Standards call for speed and accuracy in calculation. Teachers structure class time and/or homework time for students to practice core functions such as single--‐digit multiplication so that students have access to more complex concepts and procedures. Application: The Standards call for students to use math flexibly for applications. Teachers provide opportunities for students to apply math in context. Teachers in content areas outside of math, particularly science, ensure that students are using math to make meaning of and access content."
}