{
  "url": "https://www.baladin.it/en/brewery",
  "title": "Brewery",
  "text": "The Baladin farm brewery was originally created in 1996 as a brewpub (production and bar) in Piozzo - a small village in the Langhe area in the province of Cuneo - by its founder and master brewer Teo Musso. Throughout its evolution, it has moved several times following the changes in its production needs: from a few square meters stolen from the All Baladin has a modern production facility with a nominal capacity of 50,000 hectoliters per year. It has been entirely built in Italy by craftsmen who have designed it specifically for craft production, which is characterized by flexibility. It is designed to preserve the integrity of the ingredients, keeping the beer alive, with no pasteurization. The facility can always be visited by the public, including during production, to ensure maximum transparency. Because Beer is Earth! This motto has always guided the Baladin approach. Explaining that beer is an agricultural product is at the heart of our message. To translate our words into facts, years ago we decided to change how we buy our ingredients. In 2012 we reached a fundamental milestone: We became a farm brewery and we took on responsibility for the entire production chain, starting from the earth and farming the land. The symbol of this process is Nazionale: the first 100% Italian beer made with water from the Maritime Alps, malted barley from Basilicata and Marche, hops from our fields in Piozzo, yeast grown at our laboratory and a few Italian spices. Piozzo is a small village near Cuneo, overlooking the wine-producing Langhe region. How could Teo Musso come up with the idea of making beer and open his brewery here? The people of Piozzo were probably not too surprised. They are down-to-earth people, but also proud and with a strong sense of initiative. Walking around the A complex project such as Baladin needs a motivated group of people who share its path and philosophy. Teo Musso guides an important team, with long-standing members and new young minds who stimulate the exchange of ideas and bring new energy to the Baladin group in its many activities: production, distribution, administration, services. It all started with some young friends called by Teo in 1986 to help him at the pub. Now, hundreds of people are part of the Receive email updates about Baladin's World © Copyright 2026 Baladin - Privacy Policy - Cookie Policy - Disclaimer - Selezione Baladin SRL PIVA 02947730046"
}