{
  "url": "https://www.clinicaladvisor.com/news/airq-identifies-uncontrolled-asthma-exacerbation-risk/",
  "title": "AIRQ Tool Heightens Awareness of Uncontrolled Asthma, Exacerbation Risk - Clinical Advisor",
  "text": "The Asthma Impairment and Risk Questionnaire (AIRQ) is a useful composite tool for assessing asthma control and exacerbation risk, investigators reported in the Annals of Allergy, Asthma & Immunology. Researchers evaluated how AIRQ compared with other asthma evaluation modalities with respect to assessing asthma control and predicting exacerbation risk. Toward that end, they conducted a post hoc analysis using data from a 12-month longitudinal study of AIRQ in adults (aged 18 years and older) and adolescents (aged 12 to 17 years) with a physician diagnosis of asthma. In the post hoc analysis, the researchers compared the performance of the AIRQ, the Global Initiative for Asthma symptom control questions tool (GINA SCT), and the Asthma Control Test (ACT) in assessing asthma control and predicting exacerbations relative to each other and to physician expert opinion (EO). Patients with varying disease severity were enrolled from 24 US specialty care sites and 1 specialty-affiliated primary care clinical site from May to November 2019. The analysis included 1064 patients who completed a mean (SD) of 10.5 (2.8) monthly follow-up surveys, with 76.4% completing at least 11 surveys. Their mean age was 43.8 (19.3) years, 70.0% were female, and 79.0% were White. The AIRQ cohort included 375 patients, the GINA SCT cohort had 354 patients, the ACT cohort had 523 patients, and the physician expert opinion cohort had 575 patients. The AIRQ and GINA SCT had a high predictive ability to differentiate ACT well-controlled vs not-well-controlled and very poorly controlled asthma (receiver operator characteristic area under curve [ROC AUC], AIRQ 0.90; GINA SCT 0.86), as well as the ability to differentiate ACT very poorly controlled asthma from well- and not-well-controlled asthma (ROC AUC, AIRQ 0.91; GINA SCT 0.87). The AIRQ demonstrated a small but significantly increased ROC AUC for predicting ACT vs the GINA SCT (P =.03 for separating well-controlled asthma from all others and P =.01 for separating very poorly controlled from all others). The researchers further noted that, upon enrollment, proportion of patients assessed as having well-controlled asthma was significantly lower in the AIRQ cohort vs the proportion of patients in the other 3 cohorts (ie, GINA SCT, ACT, and expert opinion) who were assessed as having completely or well controlled asthma (P <.01 for all pairwise comparisons, except for daily rescue use, AIRQ and GINA SCT P >.05). Notably, only physician expert opinion used the rating of “completely controlled.” Patients who had at least 1 or at least 2 previous-year exacerbations were less likely to be rated as having well-controlled asthma using the AIRQ vs the other 3 assessment modalities (P <.01 for all pairwise comparisons). Additionally, among individuals with previous- and subsequent-year exacerbations, a smaller percentage were rated as being well-controlled at baseline with the AIRQ vs being well-controlled or completely controlled with the other 3 assessment modalities. The percentages of those rated as well-controlled or completely controlled with 1 or more exacerbation was 2.1% for AIRQ, 3.6% for GINA SCT, 6.5% for ACT, and 7.7% for physician expert opinion (P <.01 for all pairwise comparisons). The percentages of those rated as well-controlled or completely controlled with 2 or more subsequent-year exacerbations were 1.2% for AIRQ, 2.3% for GINA SCT, 3.4% for ACT, and 4.2% for physician expert opinion (P <.001 for all pairwise comparisons). Among several study limitations, patients were followed in specialty care and were mostly White, non-Hispanic, and treated for moderate-to-severe disease. Also, AIRQ items are binary choices, and predicting exacerbations involves more than an asthma control tool. “The AIRQ heightens clinician awareness of uncontrolled asthma that might be missed by ACT, GINA SCT, and EO in underestimating uncontrolled asthma,” the study authors concluded. “By being more accurate in identifying uncontrolled asthma, AIRQ provides an increased opportunity to appropriately educate, engage in shared decision-making conversations, change or step up therapies, and implement medical or psychosocial evaluations and interventions to reduce the risk of future exacerbations,” the researchers stated. Disclosure: This study was supported by AstraZeneca. Some of the study authors declared affiliations with biotech, pharmaceutical, and/or device companies. Please see the original reference for a full list of authors’ disclosures. This article originally appeared on Pulmonology Advisor References: Chipps BE, Zeiger RS, Beuther DA, et al. Advancing assessment of asthma control with a composite tool: the Asthma Impairment and Risk Questionnaire. Ann Allergy Asthma Immunol. Published online March 15, 2024. doi:10.1016/j.anai.2024.03.011"
}