{
  "url": "https://www.behindthename.com/name/sophia",
  "title": "Meaning, origin and history of the name Sophia - Behind the Name",
  "text": "Gender Feminine Scripts Σοφία(Greek) Pronounced Pron. /soʊ.ˈfi.ə/(English) /sə.ˈfaɪ.ə/(British English) /so.ˈfi.a/(Greek) /zo.ˈfiː.a/(German) [key·simplify] Meaning & History Means \"wisdom\" in Greek. This was the name of an early, probably mythical, saint who died of grief after her three daughters were martyred during the reign of the emperor Hadrian. Legends about her probably arose as a result of a medieval misunderstanding of the phrase Hagia Sophia \"Holy Wisdom\", which is the name of a large basilica in Constantinople.This name was common among continental European royalty during the Middle Ages, and it was popularized in Britain by the German House of Hanover when they inherited the British throne in the 18th century. It was the name of characters in the novels Tom Jones (1749) by Henry Fielding and The Vicar of Wakefield (1766) by Oliver Goldsmith.In the United States this name was only moderately common until the 1990s when it began rising in popularity, eventually becoming the most popular for girls from 2011 to 2013. A famous bearer is the Italian actress Sophia Loren (1934-). Related Names Rootsophia Other Languages & CulturesSofi, Sofya(Armenian) Sofia, Sofiya(Bulgarian) Sofia, Sònia(Catalan) Sofija, Sonja(Croatian) Sofie, Žofie, Soňa(Czech) Sofia, Sofie, Sonja, Vivi(Danish) Sofia, Viivi(Estonian) Sofia, Sohvi, Sonja, Viivi(Finnish) Sophie(French) Sofía(Galician) Sopia, Sopio(Georgian) Szofi, Zsófia, Szófia, Szonja, Zsófika, Zsóka(Hungarian) Soffía, Sonja(Icelandic) Sofia, Sonia(Italian) Sofija(Latvian) Zofija, Sofija(Lithuanian) Sofija, Sonja(Macedonian) Sofia, Sofie, Sonja, Vivi(Norwegian) Zofia, Sonia, Zosia(Polish) Sofia, Sonia(Portuguese) Sofia, Sonia(Romanian) Sofia, Sofiya, Sofya, Sonya(Russian) Sofija, Sonja(Serbian) Sofia, Žofia, Soňa(Slovak) Sofija, Zofija, Sonja(Slovene) Sofía, Sofi, Sonia(Spanish) Sofia, Sofie, Sofi, Sonja, Vivi(Swedish) Sofia, Sofiia, Sofiya(Ukrainian) Popularity People think this name is Name Days Images Altered image depicting how Hagia Sophia basilica may have looked before it became a mosque Categories 2000s, 2010s, Ancient Greek words, Angelina Ballerina characters, asteroids, Barbie's roles, Brooklyn 99 characters, child actors, Claymore characters, cricketers, D.Gray-man characters, Edinburgh Seven, empresses, English princesses, Fire Emblem characters, Granblue Fantasy characters, House of Anubis characters, House of Cards US characters, intellect, intelligence, isograms, it girls, Jane Austen characters, JESC names, Julie Chan is Dead characters, Kennedy family, legend, Leo Tolstoy characters, literature, medieval, Megami Tensei characters, mothers, mythology, never out of the US top 1000, Oliver Goldsmith characters, Orange is the New Black characters, Orthodox saints, Philip K. Dick characters, princesses, Professor Layton characters, Righteous Among the Nations, royalty, saints, Sims 3 characters, Six Feet Under characters, song titles, Sousei No Aquarion characters, Squishmallows, Star Ocean characters, Suikoden characters, Taylor Swift songs, The Four Hundred members, The Golden Girls characters, The Loud House characters, The Marvelous Mrs. Maisel characters, The Rolling Stones songs, The Sopranos characters, The Walking Dead characters, The West Wing characters, Tomb Raider characters, top 10 in Australia, top 10 in Austria, top 10 in Germany, top 10 in Greece, top 10 in Hawaii, top 10 in Malaysia, top 10 in New Zealand, top 10 in Northern Ireland, top 10 in Singapore, top 10 in Switzerland, top 10 in the Philippines, top 10 in the UK, top 10 in the US, Tori Amos lyrics, Virtua Tennis opponent characters, virtues, Westworld characters, Wii Sports Club opponent Miis, Wii Sports series opponent Miis, William Faulkner characters, wisdom, wives of Joseph Smith, women's history, Xeno characters Sources & References - Lexicon of Greek Personal Names, available from https://search.lgpn.ox.ac.uk/browse.html?facet-nymRef=Σοφία."
}