{
  "url": "https://inspire.aota.org/",
  "title": "AOTA INSPIRE | 2026 Annual Conference & Expo",
  "text": "Join us to refresh and recharge – along with thousands of practitioners, educators, and students this April to build your skills, connections, and momentum. Prices increase after the Early Bird deadline on February 23. Get the best OT event of the year at the best price possible! AOTA INSPIRE 2026 | Annual Conference & Expo takes place April 23–25, 2026, with preconference institutes and special events on April 22. Conference registration and housing reservations are open now! Register soon to get the best price possible. Refresh, recharge, and INSPIRE yourself in the Southern California sunshine! Get discounted tickets to nearby Disneyland®, enjoy world-class dining, and make your conference trip feel like a getaway as you learn, connect, and grow with other OT practitioners. Use our guide to get support from your employer to attend AOTA INSPIRE 2026 | Annual Conference & Expo Save on registration by attending as a group with your workplace or school. Businesses and organizations like yours can find advertising opportunities or reserve space in our expo hall. Volunteering for AOTA INSPIRE | 2026 Annual Conference & Expo is an excellent way to support your national professional Association, meet the leaders, network, and so much more! Submit this form to receive the latest updates for AOTA INSPIRE 2026 | Annual Conference & Expo—the largest gathering of occupational therapy professionals in the world. 7501 Wisconsin Avenue, Suite 510E Bethesda, MD 20814-6519 The American Occupational Therapy Association (AOTA) is the national professional association established in 1917 to represent the interests and concerns of occupational therapy practitioners and students of occupational therapy and to improve the quality of occupational therapy services. This website uses cookies to provide you a faster and more customized site experience. The information we collected through cookies helps us understand how you use AOTA’s website and services. By continuing your use of this website, you consent to this use of cookies. See our privacy policy for more information."
}