{
  "url": "https://www.reddit.com/r/Edgerunners/comments/11dhode/lucydavid_relationship/",
  "title": "Reddit - The heart of the internet",
  "text": "Lucy/David Relationship. So, lately I’ve started seeing more and more people I guess… question the legitimacy of their love? I guess Im gonna idk, make this another discussion but also put my thoughts out here. To me, it was obvious Luce cared about David. From the 2nd episode when he was firing the sandy so much they were in the ambulance and she took him to the ripperdoc. To when she did everything she did after the jumpcut to keep David safe from Arasaka. She legitimately cared and loved David, you dont have to be lovey-dovey to be in a relationship. If anything thats not even remotely healthy. Im happy they portrayed their relationship that way because it felt they were like best friends who fell in love and were soul mates. Thats how love SHOULD be. On top of that, if you had doubts their love was real. The last few scenes we saw of them, when Lucy kissed him one last time and brought him back from going cyberpyscho… man not only did that fuck me up but it proved how much she loved him and how much he loved her. He did everything he did for her, she did everything she did for him. Idk why people in some threads think Sasha or Becca wouldve been better for him. Let me touch on the ending, “Lucy moving on” Lucy never moved on, she wouldn’t be able to. She never moved on from Arasaka, thats why she hid her deep dive port, why she didnt tell anyone about her past apart from David, and why she wanted to save David from Arasaka’s control. She realized they weren’t worlds apart like she thought they were in ep 4. I dont see Lucy moving on, especially when you rewatch the ending credits. Shes back in NC, shes back in her old apartment, shes back to being alone and definitely looked depressed as shit. Either that ending credit scene show before she met david or it’s after EVERYTHING. Lemme know how yall feel about this, it’d be a nice talking piece for a while. Also for those saying the ending is obvious because of what we were showed, its not that obvious."
}