{
  "url": "https://www.britannica.com/money/LinkedIn",
  "title": "LinkedIn | Overview, History, & Microsoft Acquisition | Britannica Money",
  "text": "- Date: - 2002 - present - Ticker: - MSFT - Share price: - $411.21 (mkt close, Feb. 03, 2026) - Market cap: - $3.05 tr. - Annual revenue: - $305.45 bil. - Earnings per share (prev. year): - $16.0 - Sector: - Information Technology - Industry: - Software - CEO: - Mr. Satya Nadella - Headquarters: - Mountain View LinkedIn is a business-oriented social media platform and social networking website founded in 2002 and headquartered in Sunnyvale, California. In 2016 software and cloud computing giant Microsoft acquired the company in a deal valued at $26 billion. Unlike other social networks, such as Facebook and Instagram, which are often purely recreational, LinkedIn emphasizes a user’s professional connections. Users create profile pages that have a structure similar to a résumé, in that users can summarize their career, advertise their particular skills, and list their education and employment history. Connections are formed between users when one accepts an invitation from another to join his or her network. LinkedIn allows users to further their careers by searching for jobs, finding connections (even thirdhand) at a particular company, and receiving recommendations from other users. Membership is free; however, with payment for premium service, users can receive more profiles in their search results and see the full profile of any LinkedIn user. Venture capitalist Reid Hoffman, product designer Allen Blue, marketing professional Konstantin Guericke, engineer Eric Ly, and engineer Jean-Luc Vaillant founded LinkedIn, and the website was launched in 2003. Growth was slow at first. In 2005 LinkedIn introduced services that allowed companies to post job listings and search the network for prospective employees. In addition to offering these professional services, LinkedIn allows companies to advertise on the site. LinkedIn finally became profitable in 2007. That year the site had more than 15 million members, and by 2011 LinkedIn had more than 100 million members worldwide. LinkedIn’s initial public offering (IPO) that same year raised $353 million. In 2016 LinkedIn was acquired by Microsoft for approximately $26 billion. As of 2024 the LinkedIn platform hosts more than a billion members from more than 200 countries. In its 2023 fiscal year, Microsoft reported global revenue of $15 billion from its LinkedIn division, with $7 billion coming from hiring software aimed at company recruiters and $1.7 billion from sales of premium subscriptions. In 2024 LinkedIn and Microsoft released a report titled “AI at Work Is Here. Now Comes the Hard Part.” Using data collected from more than 31,000 survey participants, the report highlighted the increasingly important role of artificial intelligence (AI) at work. LinkedIn, which already offered many courses for professional development, announced that same year that 50 new AI-related courses would be free for all members until July 2024. The company also announced new AI-generated insights for premium members that would appear on users’ news feeds. Another new AI feature was a tool that the site claimed could help users determine whether they are a valid fit for an open position and would recommend methods to stand out from other applicants."
}