{
  "url": "https://doorcountybeerfestival.com/buy-tickets/",
  "title": "BUY TICKETS - Door County Beer Festival",
  "text": "General Admission: Aug 1 – Nov 30: $50 Dec 1 – June 20: $55 Early Access: Aug 1 – Nov 30: $70 Dec 1 – June 20: $75 Designated Driver: $15 General Admission Ticket price includes a Door County Beer Festival souvenir beer glass and unlimited 3 oz tastings from over 40 Midwest breweries Enjoy an afternoon with friends, meet the brewers, for an additional purchase, try food from local chefs, and enjoy the live music! You must be 21 to enter the festival grounds. All attendees MUST PRESENT PROPER ID TO ENTER THE TASTING GROUNDS. No exceptions. Designated Driver Tickets for designated drivers are $15 and include a commemorative glass, two free non-alcoholic beverages and live music. Designated Drivers MUST be 21 to enter the tasting tent. If you have ticket questions or need more information please email info@peninsulapacers.com. EARLY ACCESS Early Access ticket holders will get exclusive access to the grounds from 11 am to noon. Schedule TBA Parking IMPORTANT PARKING INFO FOR ATTENDEES: Parking will not be available AT About Thyme Farm. Festival goers must ride a FREE shuttle to the grounds. Please plan to arrive early to catch a bus. Buses will run continuously from the designated pickup/drop off locations including: Baileys Harbor Rec Park, Roost & Banter, Egg Harbors Visitor Center, Gibraltar Town Center(Library), Sister Bay Library. Shuttles are also available for lodging guests only at Baileys Harbor Yacht Club, Baileys Grove Campground, Parkwood Lodge, Birchwood Lodge, The Dörr Hotel and The Landmark Resort. Due to Fyr Bal landing on the same day as the fest this year, we WILL NOT HAVE A SHUTTLE STOP IN EPHRAIM The gate at the Beer Fest grounds opens at 11 am for Early Access attendees and 12 pm for General Admission attendees. Parking will be available at Brann Field and Schoolhouse Park, as well as along streets throughout Baileys Harbor. For timing purposes, it takes approximately 10 minutes to walk from Anclam Beach to the location of the shuttle stop."
}