{
  "url": "https://www.weihenstephaner.com/our-brewery/brewery-tour",
  "title": "Brewery Tour - Our Brewery - Weihenstephaner",
  "text": "Brewery Tour From how the beer is made to how it is enjoyed Get to know our brewery and take a look behind the scenes! Start your tour in our own museum before exploring the brewery and learning about the brewing process step by step. And, of course: Finish strong with a guided tasting of our beer specialities. Sounds good, right? Our new booking tool will be available on Monday, February 9th. Are you interested? Monday 10:00 o´clock (German) Tuesday 10:00 o´clock (English) & 13:30 o´clock (German) Wednesday 10:00 o´clock (English) Please note: Tours need to be booked in advance. We do not offer tours outside of the designated operating hours which means we are also closed on public holidays. Fees (tax included): Please get in contact with: info@weihenstephaner.de and tell us the date of your planned visit and the number of visitors. No guided tours outside the defined hours possible. Brewery Tour, Museum & Tasting Duration: 120 minutes Fees: Adults 25€ | Adolescents 10€* | Children free of charge** (Adults until the end of March 2025: 14 Euros) PLEASE NOTE: payment only in cash *Adolescents from 10 to 17 years of age, access only when accompanied by an adult **Children from 6 to 9 years of age, access only when accompanied by an adult More information MEETING POINT Bayerische Staatsbrauerei Weihenstephan Alte Akademie 2, 85354 Freising Parking at the bottom of our Bräustüberl. Please walk up to our front desk and register there. MORE INFORMATION Please note that your registration has only been successful after confirmation by us. Adolescents to 17 years of age as well as children from six to nine years need to be accompanied by an adult. Children under the age of six are not allowed to go on a brewery tour due to safety reasons. Please wear sturdy shoes. The tour is not accessible free for disabled people. Some of the rooms can only be accessed by climbing a series of stairs. - Maximum of 15 visitors CONTACT Telefon: +498161 / 536-0 E-Mail: info@weihenstephaner.de"
}