{
  "url": "https://support.google.com/translate/answer/6142478?hl=en&co=GENIE.Platform=Desktop",
  "title": "Translate written words - Computer - Google Translate Help",
  "text": "You can use the Google Translate app to translate written words or phrases. You can also use Google Translate in a web browser like Chrome or Firefox. Important: To translate in Chrome on your mobile device, you need Javascript. Learn how to turn on Javascript. Translate text - On your computer, open Google Translate. - At the top of the screen, select the languages to translate. - From: Choose a language or select Detect language . - To: Select the language that you want the translation in. - In the text box on the left, enter the text you want to translate. - Choose what you want to do: - Look up details: To check available details for each result, such as definitions, examples, or other translations, click Look up details.This is currently available only for selected languages. - Listen: To hear the translation, click Listen . To change the audio speed, click Settings at the top right and select Normal, Slow, or Slower. - Copy: To copy the translation to the clipboard, click Copy translation . - Rate or edit: Suggested edits can help improve translations. To rate a translation or suggest an edit, click Thumbs up or Thumbs down . - Share: To send the translation through email or Twitter, click Share translation . Important: Some words may have different meanings. To help the translation capture your intended meaning, write your word in a phrase or sentence. Translate longer text You can translate up to 5,000 characters at a time when you copy and paste your text. - On your computer, open Google Translate. - At the top of the screen, choose the language that you want to translate to and from. - From: Choose a language or select Detect language. - To: Select the language that you want the translation in. - Copy and paste your text into the text box. - You can review sections of translated text. At the bottom bar, click Back or Forward . Tip: You can also translate documents and websites."
}