{
  "url": "https://www.windowscentral.com/how-get-started-snipping-tool-app-windows-11",
  "title": "How to get started with the Snipping Tool app in Windows 11 | Windows Central",
  "text": "How to get started with the Snipping Tool app in Windows 11 Do you need to capture anything on your screen? Use the Snipping Tool in Windows 11. Here's how. All the latest news, reviews, and guides for Windows and Xbox diehards. You are now subscribed Your newsletter sign-up was successful On Windows 11, you can use the Snipping Tool to take screenshots, extract text, and pick color codes without resorting to third-party utilities. In this guide, I will outline the steps to get started and get the most out of the app. The new Snipping Tool app replaces the old Snipping Tool and Snip & Sketch (still available on Windows 10) with a new experience that combines the best of both. The app lets you take screenshots in different ways. You can select a rectangle, use free mode, or quickly capture a window or the entire screen. The second part of the experience is the new editor, which lets you crop, annotate, add extra text, redact sensitive information, and save or share screenshots. You can even use the app to screen-record videos with or without audio, access Copilot for help, and use a color picker to identify the color code on the screen. In this how-to guide, I will explain how to take screenshots, screen record videos, and more using the Snipping Tool app on Windows 11. These instructions have been updated to ensure accuracy and reflect changes to the process in the application. How to use Snipping Tool to take screenshots The Snipping Tool is a straightforward app that lets you take screenshots in Windows 11 via the app or a shortcut. The app also includes settings you can configure, including the ability to use the \"Print screen\" key instead of the \"Windows key + Shift + S\" shortcut. Screen capture via app To take screenshots through the Snipping Tool app, use these steps: All the latest news, reviews, and guides for Windows and Xbox diehards. - Open Start. - Search for Snipping Tool and click the top result to open the app. - Select one of the available screen capture modes, including: - Rectangle mode: creates a rectangle screenshot using the mouse. - Window mode: saves a screenshot of a window. - Full-screen mode: takes a screenshot of the entire screen. - Free-form mode: allows you to use the mouse to select any form you want from the screen. - (Optional) Use the Delay option to delay the capture for up to 10 seconds. - Quick note: This option can be handy when trying to capture a specific action. - Click the New button. - Create the screenshot with the mode you selected. - Click the \"Capture\" button if you're using the \"Rectangle\" option. Once you complete the steps, the screenshot will open in the Snipping Tool editor, where you can save the capture or annotate it before sharing it. It's worth noting that when using the \"Rectangle\" option, after selecting the area to capture, you'll notice different actions, including Share, Visual Search with Bing, and Copilot. You'll also have access to the different tools to annotate even before taking the screenshot. Screen capture via shortcut Alternatively, you can use a keyboard shortcut to quickly open the tools for taking a screenshot in Windows 11. Here's how: - Use the \"Windows key + Shift + S\" keyboard shortcut. - Select one of the screen capture modes: - Rectangle mode - Window mode - Full-screen mode - Free-form mode - Create the screenshot with the mode you selected. - Click the \"Capture\" button if you're using the \"Rectangle\" option. After you complete the steps, the capture will open with the Snipping Tool editor. Basic screenshot editing To edit and save the screenshot, use these steps: - Click the Image Crop tool in the command bar. - Use the edges to crop and resize the screenshot. - Click the Apply button to apply the changes. - Use the \"Ballpoint pen, Highlighter,\" or \"Touch Writing\" features to annotate the image. - Quick tip: The Ballpoint pen and Highlighter offer different options to change the color and stroke size for annotating the image. - Use the Eraser tool to delete strokes. - (Optional) Click the Copy button from the top right to copy the image to the clipboard and paste it into a document. - Click the Save button from the top right to save the screenshot as an image file (.jpg, .png, or .gif). - Click the Share button in the top-right corner to share the capture with other people using different apps. Once you complete the steps, the screenshot will be saved on the computer. Adding shapes to screenshot To add shapes to the screenshot, use these steps: - Click the Shapes button from the command bar. - Choose the shape (square, circle, straight line, or arrow). - Open the Fill menu and choose the color (if applicable). - Open the Outline menu and choose the outline color and size. - Create the shape on the image. - Click the Save button. - Choose the location to store the video recording. - Click the Save button one more time. Once you complete the steps, the shape will be added to the screenshot. Redact or extract text on screenshot To redact text to hide sensitive information on a screenshot, use these steps: - Click the Text actions button from the command bar. - (Option 1) Select the desired text, right-click the selection, and choose the Copy text option. - Quick tip: You can also use the \"Copy all text\" option from the \"Text actions\" menu. - (Option 2) Select the desired text, right-click the selection, and choose the Redact text option. - Quick tip: You can also use the \"Quick redact\" option from the \"Text actions\" menu to redact emails and numbers automatically. Also, from the drop-down menu, you can choose the details the app can redact automatically. Once you complete the steps, the sensitive information will be redacted on the screenshot. How to use Snipping Tool to screen recording To record the screen with the Snipping Tool app, use these steps: - Open Start. - Search for Snapping Tool and click the top result to open the app. - Click the Record button. - Click the New button. - Choose an area of the screen to record. - Click the Microphone menu and select the voice capture device. (You can also choose the \"Mute\" button to disable audio capture.) - (Optional) Click the \"Mute system audio\" button to prevent the app from recording audio from your computer. - Click the Start button. - Continue with the interaction you want to capture. - Click the Stop button. - Quick note: You can click the \"Delete\" (trash) button to discard the recording and start over. - (Optional) Click the Play button to playback the screen recording. - Click the Save button. - Choose the location to store the video recording. - Click the Save button one more time. Once you complete the steps, Snipping Tool will create a video file with the screen recording. Create an animated GIF with Snipping Tool In addition to recording videos, the Snipping Tool also includes an option to create GIFs through the screen recording feature. To create an animated GIF, use these steps: - Open Start. - Search for Snapping Tool and click the top result to open the app. - Click the Record button. - Click the New button. - Choose an area of the screen to record. - Choose the \"Mute\" button. - Click the \"Mute system audio\" button. - Click the Start button. - Capture the action you want in the GIF file. - Click the Stop button. - Click the GIF button from the top-right. - Choose the quality of the GIF file. - Click the Export button. How to change settings on Snipping Tool The Snipping Tool lets you configure various settings. To change the app settings, use these steps: - Open Start. - Search for Snipping Tool and click the top result to open the app. - Click the See more (three-dotted) menu and select the Settings option. - In the Settings page, enable or disable the \"Snipping\" options as needed: - Automatically copy changes: Copies the capture to the clipboard for easy pasting onto documents. - Automatically save original screenshots: Saves the capture into the Screenshots folder automatically. - Ask to save edited screenshots: Ask to save the capture as you close the editor. - Multiple windows: Launches a new instance of the app for each capture. - Add border to each screenshot: Inserts borders to each snip automatically. - HDR screenshot color corrector: Adjusts colors for screenshots taken on HDR monitors. - On this page, you can also adjust the \"Screen recording\" settings: - Automatically copy changes: Copies the capture in the clipboard for easy pasting onto documents. - Automatically save original screen recordings: Saves capture into the Screen recording folder automatically. - Ask to save edited screen recordings: Ask to save the capture as you close the editor. - Include microsoft input by default when a screen recording starts. - Include system audio by default when a screen recording starts. - Select the App theme setting under the \"Appearance\" section. - Select the color theme. Options available: - Light. - Dark. - Use system setting. - Click the \"Use the Print screen key to open Snipping Tool\" button under the \"Shortcuts\" section. - Click the Yes button. - Turn on the \"Use the Print screen button to open screen snipping\" toggle switch to use the Print screen key instead of the \"Windows key + Shift + S\" keyboard shortcut to open the tool. After you complete the steps, the settings will apply automatically. How to use Snipping Tool toolbar as a color picker The Snipping Tool also includes a feature that allows to determine the color code for any pixel on the screen with the \"Color Picker\" tool. To use the Snipping Tool Color Picker, use these steps: - Open the Snipping Tool toolbar (Windows key + Shift + S). - Click the Color Picker button. - Select the color code, including HEX, RGB, or HSL. - Hover and click over the color you want to identify. Once you complete the steps, the color code will be copied to the clipboard. How to use Snipping Tool toolbar as a text extractor In addition to extracting text from the screenshot editor, you can also use the toolbar's \"Text extractor\" option to extract text from anything on the screen. To extract text from the screen, use these steps: - Open the Snipping Tool toolbar (Windows key + Shift + S). - Click the Text extractor button. - Select the area with text that you want to copy. - Select the text or click the \"Copy all text\" button. After you complete the steps, the extracted text will be copied to the clipboard. More resources Explore more in-depth how-to guides, troubleshooting advice, and essential tips to get the most out of Windows 11 and 10. Start browsing here: - Windows 11 on Windows Central — All you need to know - Windows 10 on Windows Central — All you need to know Follow Windows Central on Google News to keep our latest news, insights, and features at the top of your feeds! Mauro Huculak has been a Windows How-To Expert contributor for WindowsCentral.com for nearly a decade and has over 22 years of combined experience in IT and technical writing. He holds various professional certifications from Microsoft, Cisco, VMware, and CompTIA and has been recognized as a Microsoft MVP for many years. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name."
}