{
  "url": "https://www.britannica.com/place/Russia/Novgorod",
  "title": "Russia - Novgorod, History, Culture | Britannica",
  "text": "- The 18th century Novgorod arose in the 9th century as one of the earliest centres of the exploitation of the forest hinterland and remained the most important commercial centre of the Kievan period. The changes of the latter Kievan period did not diminish the town’s importance, for it benefited both from the increased activity of the Hanseatic League and from the development of the upper Volga region, for which it was a major trade outlet. Although Novgorod was an early base for the Rurikids, the princely traditions characteristic of Kiev and other post-Kievan centres never developed there. When Kiev declined, Novgorod soon (1136) declared its independence from princely power, and, although it accepted princely protectors from various neighbouring dynasties, it remained a sovereign city until conquered by Muscovy (Moscow). News • During the 13th century, Novgorod’s burghers easily found an accommodation with the invading Mongols. In the Mongol period its energetic river pirates pushed farther north and east toward the Urals and even down the Volga, and Novgorod’s prosperity was generally unbroken until the commercial revolution of the 16th century. Its absorption by the growing principality of Muscovy in 1478 ended its political independence and changed its social structure, but Novgorod’s characteristic economic and cultural life did not end with that catastrophe. Novgorod was governed by an oligarchy of great trading boyar families who controlled the exploitation of the hinterland. They chose (from among themselves) a mayor, a military commander, and a council of aldermen, who controlled the affairs of the city and its territories. The town itself was divided into five “ends,” which seem to have corresponded to the “fifths” into which the hinterland was divided. There was in addition a veche (council), apparently a kind of town meeting of broad but indeterminate composition whose decisions, it would appear, were most often controlled by the oligarchy. A major role in politics was played by the archbishop, who after 1156 controlled the lands and incomes previously owned by the Kievan princes and who appears throughout Novgorod’s history as a powerful, often independent figure. The northwest During this period, much of the territory of the principalities of Smolensk, Polotsk, Turov, and Pinsk was controlled by the grand duchy of Lithuania, which was essentially an international or nonnational formation led by a foreign dynasty (of eastern Lithuanian pagan origins) ruling over predominantly Belarusian and Ukrainian populations. By the 15th century the dynasty had become Slavic in culture (a version of Belarusian was the official language of the realm), and at its height under Vytautas (1392–1430) it controlled all the old Kievan territory outside Russia proper—that is, most of present-day Lithuania, Belarus, Moldova, and Ukraine. In 1385 the grand duchy joined the kingdom of Poland, and the union was sealed shortly thereafter by the marriage of Grand Prince Jogaila (see Władysław II Jagiełło) to Jadwiga, the Polish queen. The northeast The region bounded by the Oka and Volga rivers, later to be the heartland of the Grand Principality of Moscow, was settled before the arrival of Slavs from Novgorod and the Baltic area by a Finnic tribe. Rostov, the earliest princely centre, was from Vladimir’s time included in the princely rotation system. In the 12th century it became the patrimony of the younger branch of Vladimir II Monomakh’s family (who founded the new princely centre Vladimir in 1108). Under his son Yury Dolgoruky (1125–57) and grandson Andrew I (1157–74), the principality reached a high political and cultural development, which it retained through much of the succeeding century. Early in the 13th century the principality of Moscow was created as an appanage (royal grant) within the grand principality of Vladimir, and this new seat grew in importance when Michael Khorobrit, brother of Alexander Nevsky, conquered Vladimir (1248) and made himself prince of both centres. Daniel, Nevsky’s son and the progenitor of all the later Rurikid princes of Moscow, had a long and successful reign (1276–1303), but at his death the principality still embraced little more than the territory of the present Moscow province (an area of 140 miles [225 km] in length and width). The beginning of Moscow’s rise to its later preeminence came during the reign of Daniel’s son Ivan (1328–41), who, by cooperating with Öz Beg, khan of the Golden Horde, and also by his shrewd purchases (probably of tax-farming rights), greatly expanded the influence of his principality. The southwest The lands of Galicia and Volhynia were always ethnically and economically distinct from the Kievan region proper, as well as from more distant regions. Agriculture was highly developed, and trade, particularly in the valuable local salt, tended to take westward and overland routes. Galicia, already a separate principality by 1100, grew as Kiev declined. Later, Roman Mstislavich of Volhynia (ruled 1199–1205) conquered Galicia and united the two principalities. Under his son Daniel (1201–64), difficulties with the Galician landed magnates and the interference of the Hungarians weakened the principality, and it was subjugated in 1240 by the Mongol invasion. Eventually this region came under the domination of Lithuania (Volhynia) and Poland (Galicia). The Mongol period The Mongol invasion In 1223, when the first Mongol reconnaissance into former Kievan territory led to the disastrous defeat of a Volhynian-Galician-Polovtsian army on the Kalka River, the Rurikid principalities had for generations been intermittently at war. Kiev was in ruins, Novgorod was preoccupied with commerce and with its northern neighbours, Galicia was being torn internally and drawn increasingly into Polish and Hungarian dynastic affairs, and Vladimir-Suzdal, apparently the leading principality, was unable to resist the finely organized and skillful mounted bowmen of the steppe, the greatest military force of the age. Pious tradition, born of the works of monkish annalists and court panegyrists, has exaggerated both the destructiveness of the first Mongol conquests and the strength of the resistance. The Mongols aimed to revive, under a unified political system, the trade that had traditionally crossed the Central Asian steppe and vitalized the economy of the pastoral nomads. As they moved westward, they gained the collaboration of groups of Turkic nomads and the predominantly Iranian and Muslim traders in the towns of the old Silk Road; they encountered the greatest resistance in sedentary political centres and among landowning elites. The lands of the Rus presented numerous similarities with the Central Asian areas that the Mongols had already conquered. There too, a former commercial empire had fallen apart into an aggregation of warring principalities. There too, ready recruits were to be found—in the Polovtsians, who controlled the lower Dnieper and Volga and Don, and in the Muslim merchants, who dealt in the towns on the Crimean Peninsula and the upper Volga. These merchants showed the way, first (1223) to the Crimean Peninsula and up the Volga to the old centre of Bulgar, later to Ryazan, Rostov, and the Suzdalian towns, and still later (1240) to Kiev and Galicia. Many of the conquered cities made a striking recovery and adjustment to the new relationships. Some towns, such as Kiev, never fully recovered in Mongol times, but the cities of the Vladimir-Suzdal region clearly prospered. New centres, such as Moscow and Tver, hardly mentioned in any source before the Mongol period, arose and flourished in Mongol times. Thus, the Mongol invasion was not everywhere a catastrophe. The local princely dynasties continued unchanged in their traditional seats; some princes resisted the new authority and were killed in battle, but no alien princes ever became established in Slavic territory. Few Mongols remained west of the Urals after the conquest; political and fiscal administration was entrusted to the same Turkic clan leaders and Islamic merchants who had for generations operated in the area. The whole of the Novgorodian north remained outside the sphere of direct Tatar control, although the perspicacious burghers maintained correct relations with the khans."
}