{
  "url": "https://www.podravka.com/company/",
  "title": "Company ♥ Podravka",
  "text": "Our core values are courage, innovation, heritage, quality, sustainability and caring! These have been our guiding values for the past 75 years on over 60 markets. News - MIRNA d.d. General Assembly held - notice - Notice on Sessions of the Management and the Supervisory Board of Podravka Inc. - Podravka Group business results for 01.-09.2014. In the first nine months 2014 Podravka Group increased its export by 3.6 percent - Announcement regarding sessions of the Management and Supervisory Board of Podravka Inc. - Notice Investors - Transactions by persons discharging managerial responsibilities and persons closely associated with them - notice on 20.1.2026. - Closing of the transaction for the sale of Deltis Pharm Pharmacies - Transactions by persons discharging managerial responsibilities - notice - Signing of the Deltis Pharm Pharmacies sale and purchase agreement - Transactions by persons discharging managerial responsibilities - notice on 24.12.2025. Share Responsibility - Environment Promoting application of norms of socially responsible behavious and alignment of the economy with the development goals of the community and preserving the environment for future generations. In its business Podravka operates on the principles of preserving, protection and advancement the quality of the environment in which it creates new economic, environmental and social values for its stakeholders. - Consumers Podravka is basically oriented towards the production of high quality and sanitary valid products based on good production practice and the principles of quality and food safety management. R&D Research and development activities are the pillars of our company's development. They contain the values of prof. Bartl and her teams - passion, creativity, innovativity, excellence, trust and consumer health. If you want to become a part of our teams, and you are also creative, dynamic, communicative, open for cooperationa and have a spirit of entrepreneurship ...."
}