{
  "url": "https://support.microsoft.com/pt-br/windows/emparelhar-um-dispositivo-bluetooth-no-windows-2be7b51f-6ae9-b757-a3b9-95ee40c3e242",
  "title": "Emparelhar um dispositivo Bluetooth no Windows - Suporte da Microsoft",
  "text": "Emparelhar um dispositivo Bluetooth no Windows Aplica-se a Todos os tipos de dispositivos Bluetooth podem ser emparelhados com um dispositivo Windows, incluindo: - Teclados e mouses. - Telefones. - Alto-falantes e fones de ouvido. - Impressoras e scanners. - Muitos outros tipos de dispositivos. Para emparelhar um dispositivo Bluetooth com o Windows, o dispositivo Windows precisa ter Bluetooth. A maioria dos dispositivos Windows já tem Bluetooth integrado. Se um dispositivo Windows não tiver Bluetooth, um adaptador Bluetooth USB poderá ser conectado a uma porta USB no dispositivo Windows para adicionar Bluetooth. Antes de iniciar, verifique se o dispositivo Windows 11 dá suporte a Bluetooth. Para obter mais informações sobre como marcar, consulte Corrigir problemas de Bluetooth no Windows. Para obter ajuda com a adição de dispositivos não Bluetooth, consulte Adicionar um dispositivo de hardware a um dispositivo Windows. Está com problemas para reproduzir o vídeo? Assista no YouTube. Depois de verificar se o dispositivo Windows dá suporte a Bluetooth, o Bluetooth precisa ser ativado. Veja como: No aplicativo Configurações: Para ativar o Bluetooth no aplicativo Configurações : - No dispositivo Windows, selecione Iniciar e selecione Configurações > dispositivos Bluetooth & .Abrir dispositivos bluetooth & dispositivos Ou Selecione os seguintes dispositivos Bluetooth & atalho: - Na janela dispositivos Bluetooth &, ao lado do Bluetooth, verifique se o Bluetooth está ativado. Em configurações rápidas: Para encontrar a configuração rápida para Bluetooth: - Selecione o ícone Rede , Som ou Bateria ao lado da hora e da data. - Selecione o bloco Bluetooth para ativar e desativar o Bluetooth. - Se o Bluetooth estiver desativado, o bloco não será realçado e poderá dizer Desativado. - Se o Bluetooth estiver ativado, o bloco será realçado e diz Conectado, Não conectado ou mostra o dispositivo ao qual está conectado via Bluetooth. - Importante: A ação Bluetooth pode precisar ser adicionada se não estiver visível em configurações rápidas. Para obter mais informações, consulte Notificações e Não Incomodar no Windows. - Ative o dispositivo Bluetooth e torne-o detectável. A maneira de tornar o dispositivo Bluetooth detectável depende do dispositivo. Para saber como tornar o dispositivo Bluetooth detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - No dispositivo Windows, selecione o ícone Rede , Som ou Bateria ao lado da hora e da data na barra de tarefas. - Selecione o chevron Gerenciar dispositivos Bluetooth na configuração rápida do Bluetooth e selecione o dispositivo em Novos dispositivos. Talvez seja necessário percorrer seus dispositivos para que novos dispositivos fiquem disponíveis. - Siga instruções adicionais se elas aparecerem e selecione Concluído. Quando o Bluetooth é ativado, o dispositivo Bluetooth e o dispositivo Windows se conectam automaticamente sempre que os dois dispositivos estão no intervalo um do outro. Dica: Se o dispositivo Bluetooth não for exibido na lista, a configuração de descoberta de dispositivos Bluetooth poderá precisar ser definida como Avançado. Para saber como, confira Corrigir problemas de Bluetooth no Windows. - Ative a impressora Bluetooth ou o scanner e torne-a detectável. A maneira de tornar uma impressora Bluetooth ou scanner detectável depende do dispositivo. Para saber como tornar a impressora Bluetooth ou o scanner detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - No dispositivo Windows, selecione Iniciar e selecione Configurações > dispositivos & Bluetooth > Impressoras & scanners .Abrir dispositivos & Bluetooth > Impressoras & scanners Ou Selecione os seguintes dispositivos Bluetooth & > Impressoras & atalho : - Na janela Dispositivos & Bluetooth > Impressoras & scanners , ao lado de Adicionar uma impressora ou scanner, selecione o botão Adicionar dispositivo . - O Windows pesquisa e exibe todas as impressoras locais ou scanners encontrados. Esse processo pode levar alguns minutos. - Depois que as impressoras ou scanners forem encontrados, selecione o botão Adicionar dispositivo ao lado da impressora ou scanner desejado. Se houver problemas para instalar uma impressora ou um scanner, consulte Corrigir problemas de impressora ou Instalar e usar um scanner no Windows. O Swift Pair no Windows permite que um dispositivo Bluetooth com suporte seja emparelhado rapidamente com um dispositivo Windows. Se o dispositivo Bluetooth for compatível com o Swift Pair, uma notificação será exibida no Windows quando: - O dispositivo Bluetooth está próximo. - Está no modo de emparelhamento e detectável. - Ative um dispositivo Bluetooth que aceite o Emparelhamento Rápido e torne-o detectável. A maneira de tornar o dispositivo Bluetooth detectável depende do dispositivo. Para saber como tornar o dispositivo Bluetooth detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - Se for a primeira vez que o dispositivo usa o Swift Pair, uma notificação será exibida solicitando para permitir o uso do Swift Pair. Selecione Sim para usar o Swift Pair. - Quando aparecer uma notificação de que um novo dispositivo Bluetooth foi encontrado, selecione Conectar. O suporte ao Windows 10 terminará em outubro de 2025 Após 14 de outubro de 2025, a Microsoft não fornecerá mais atualizações gratuitas de software do Windows Update, assistência técnica ou correções de segurança para Windows 10. Seu computador ainda funcionará, mas recomendamos mudar para o Windows 11. Antes de iniciar, verifique se o dispositivo Windows 10 dá suporte a Bluetooth. Para mais informações sobre como verificar, veja Correção de problemas com o Bluetooth no Windows 10. Para obter ajuda com a adição de dispositivos não Bluetooth, consulte Adicionar um dispositivo de hardware a um dispositivo Windows. Depois de verificar se o dispositivo Windows dá suporte a Bluetooth, o Bluetooth precisa ser ativado. Veja como: Em Configurações: Para ativar o Bluetooth em Configurações: - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos .Abrir Bluetooth & outros dispositivos Ou Selecione o seguinte Bluetooth & outros dispositivos atalho: - Na janela Bluetooth & outros dispositivos, em Bluetooth, verifique se o Bluetooth está ativado. No centro de ações: A central de ações ( ou ) pode ser encontrada ao lado da hora e da data na barra de tarefas. - Na barra de tarefas, selecione o ícone da central de ações ( ou ). - Selecione o bloco Bluetooth para ativar e desativar o Bluetooth. Se o bloco Bluetooth não estiver visível, selecione Expandir acima dos blocos. - Se o Bluetooth estiver desativado, o bloco não será realçado e poderá dizer Desativado. - Se o Bluetooth estiver ativado, o bloco será realçado e diz Conectado, Não conectado ou mostra o dispositivo ao qual está conectado via Bluetooth. - Se o bloco Bluetooth não estiver no centro de ações mesmo depois de selecionar Expandir, siga estas etapas para adicioná-lo: - No dispositivo Windows, selecione Iniciar e selecione Configurações > Notificações do Sistema > & ações .Abrir Notificações & ações Ou Selecione as seguintes notificações & ações atalho: - Na janela Notificações & ações, em Ações rápidas, selecione Editar suas ações rápidas. - No painel lateral que é aberto, selecione Adicionar e, em seguida, selecione Bluetooth . - Se desejar, organize o bloco Bluetooth recém-adicionado ao local desejado. Observação: Para obter mais informações sobre como alterar os aplicativos e as configurações que aparecem no centro de ações, confira Alterar notificação e configurações rápidas no Windows. - Ative o dispositivo Bluetooth e torne-o detectável. A maneira de tornar o dispositivo Bluetooth detectável depende do dispositivo. Para saber como tornar o dispositivo Bluetooth detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos > Bluetooth & outros dispositivos .Abrir Bluetooth & outros dispositivos Ou Selecione o seguinte Bluetooth & outros dispositivos atalho: - Na janela Bluetooth & outros dispositivos , selecione Adicionar Bluetooth ou outro dispositivo. - Na janela Adicionar um dispositivo que aparece, selecione Bluetooth. - O Windows preenche a janela Adicionar um dispositivo com os dispositivos Bluetooth detectáveis no momento. Selecione o dispositivo Bluetooth desejado e siga as instruções adicionais se elas aparecerem. - Depois que o dispositivo Bluetooth for emparelhado com êxito, selecione o botão Concluído . Quando o Bluetooth é ativado, o dispositivo Bluetooth e o dispositivo Windows se conectam automaticamente sempre que os dois dispositivos estão no intervalo um do outro. Observação: Se o dispositivo Bluetooth não estiver visível, consulte o artigo Corrigir problemas de Bluetooth no Windows para tentar resolve o problema. - Ative a impressora Bluetooth ou o scanner e torne-a detectável. A maneira de tornar a impressora Bluetooth ou o scanner detectável depende do dispositivo. Para saber como tornar a impressora Bluetooth ou o scanner detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - No dispositivo Windows, selecione Iniciar e selecione Configurações > Dispositivos > Impressoras & scanners .Abrir impressoras & scanners Ou Selecione os seguintes scanners de & impressoras : - Na janela Impressoras & scanners , em Adicionar impressoras ou scanners, selecione Adicionar uma impressora ou scanner . - O Windows pesquisa e exibe todas as impressoras locais ou scanners encontrados. Esse processo pode levar alguns minutos. - Depois que as impressoras ou scanners forem encontrados, selecione a impressora ou o scanner desejado e selecione o botão Adicionar dispositivo . Para problemas de instalação com impressoras ou scanners, consulte Corrigir problemas de impressora ou Instalar e usar um scanner no Windows 10. O Swift Pair no Windows permite que um dispositivo Bluetooth com suporte seja emparelhado rapidamente com um dispositivo Windows. Se o dispositivo Bluetooth for compatível com o Swift Pair, uma notificação será exibida no Windows quando: - O dispositivo Bluetooth está próximo. - Está no modo de emparelhamento e detectável. - Ative o dispositivo Bluetooth que dá suporte ao Swift Pair e o torne detectável. A maneira de tornar o dispositivo Bluetooth detectável depende do dispositivo. Para saber como tornar o dispositivo Bluetooth detectável, marcar a documentação do dispositivo ou visite o site do fabricante. - Se for a primeira vez que o dispositivo usa o Swift Pair, uma notificação será exibida solicitando para permitir o uso do Swift Pair. Selecione Sim para usar o Swift Pair. - Quando aparecer uma notificação de que um novo dispositivo Bluetooth foi encontrado, selecione Conectar. - Depois que o dispositivo Bluetooth se conectar, selecione Fechar. Dica: Se você for um proprietário de pequeno negócio procurando mais informações sobre como configurar o Microsoft 365, visite Auxílio e aprendizado para pequenos negócios."
}