{
  "url": "https://en.wikipedia.org/wiki/Pringles",
  "title": "Pringles - Wikipedia",
  "text": "Pringles Pringles is an American brand of stackable potato-based chips invented by Procter & Gamble (P&G) in 1968 and marketed as \"Pringle's Newfangled Potato Chips\". Pringles are technically considered an extruded snack because of the manufacturing process. The brand was sold in 2012 to Kellanova, but in 2024, Kellanova, Kellogg's parent company, agreed to be purchased by Mars Inc. As of 2011,[update] Pringles were sold in more than 140 countries.[1] In 2012, Pringles were the fourth most popular snack brand after Lay's, Doritos, and Cheetos (all manufactured by Frito-Lay), with 2.2% market share globally.[2] History In 1956, Procter & Gamble assigned a task to chemist Fredric J. Baur (1918–2008): to develop a new kind of potato chip to address consumer complaints about broken, greasy, and stale chips, as well as air in the bags.[3] Baur spent two years developing saddle-shaped chips from fried dough, and selected a tubular can as the chips' container. The saddle-shape of Pringles chips is mathematically known as a hyperbolic paraboloid.[4] However, Baur could not figure out how to make the chips palatable, and was pulled off the task to work on another brand. In the mid-1960s another P&G researcher, Alexander Liepa of Montgomery, Ohio, restarted Baur's work and succeeded in improving the taste.[5] Although Baur designed the shape of the Pringles chip, Liepa's name is on the patent.[6] Gene Wolfe, a mechanical engineer and author known for science fiction and fantasy novels, helped develop the machine that cooked them.[7][8] In 1968, P&G first marketed Pringles in Indiana.[9][10] The earliest mention in an advertisement was on October 3, 1968, where a newspaper in Evansville, Indiana advertised \"Pringle Potato Chips\" as being \"New at Kroger\".[11] Afterward, they were gradually distributed around the rest of the country and by 1975, were available across most of the US. By 1991, Pringles were distributed internationally.[10] Almost simultaneous with the Pringles test-marketing, competitor General Foods first marketed its popcorn-based snack, \"Pringle's Pop Chips,\" in the U.S.[12][13] But because Procter & Gamble had gotten its product to retailers first, General Foods had to discontinue marketing under its chosen name.[14] There are several theories behind the origin of the product's name. One theory refers to Mark Pringle, who filed a US Patent 2,286,644 titled \"Method and Apparatus for Processing Potatoes\" on March 5, 1937.[15] Pringle's work was cited by P&G in filing their own patent for improving the taste of dehydrated processed potatoes.[5] Another theory suggests that two Procter advertising employees lived on Pringle Drive in Finneytown (north of Cincinnati, Ohio), and the name paired well with \"potato chips\".[5][16] Another theory says that P&G chose the Pringles name from a Cincinnati telephone book.[17] Another source says that the name Pringles was \"chosen out of a hat\" to promote a family name appeal.[18] The product was originally known as Pringle's Newfangled Potato Chips, but other snack manufacturers objected, saying Pringles failed to meet the definition of a potato \"chip\" since they were made from a potato-based dough rather than being sliced from potatoes. The US Food and Drug Administration weighed in on the matter, and in 1975 they ruled Pringles could only use the word \"chip\" in their product name within the phrase: \"potato chips made from dried potatoes\".[19] Faced with such a lengthy and unpalatable appellation, Pringles eventually renamed their product potato \"crisps\", instead of chips. In July 2008, in the London High Court, P&G lawyers successfully argued that Pringles were not crisps (the term by which potato chips are known in British English), even though labelled \"Potato Crisps\" on the container, as the potato content was only 42% and their shape, P&G stated, \"is not found in nature\". This ruling, against a United Kingdom value added tax (VAT) and Duties Tribunal decision to the contrary, exempted Pringles from the then 17.5% VAT for potato crisps and potato-derived snacks.[20] In May 2009, the Court of Appeal reversed the earlier decision. A spokesman for P&G stated it had been paying the VAT proactively and owed no back taxes.[21][22] In April 2011, P&G agreed to the US$2.35 billion sale of the brand to Diamond Foods of California, a deal which would have more than tripled the size of Diamond's snack business.[23] However, the deal fell through in February 2012 after a year-long delay due to issues over Diamond's accounts. On May 31, 2012, Kellogg's officially acquired Pringles for $2.695 billion as part of a plan to grow its international snacks business.[24] The acquisition of Pringles made Kellogg's the second-largest snack company in the world.[25] In 2024, Kellanova, Kellogg's parent company, agreed to be purchased by Mars Inc.[26] As of 2015, there were five Pringles factories worldwide: in Jackson, Tennessee; Mechelen, Belgium; Johor, Malaysia; Kutno, Poland;[27] and Fujian, China.[28] Ingredients Pringles have about 42% potato content, the remainder being wheat starch and flours (corn and rice) combined with vegetable oils, an emulsifier, salt, and seasoning.[20] Other ingredients can include sweeteners such as maltodextrin and dextrose, monosodium glutamate (MSG), disodium inosinate, disodium guanylate, sodium caseinate, modified food starch, monoglyceride and diglyceride, autolyzed yeast extract, natural and artificial flavorings, malted barley flour, wheat bran, dried black beans, sour cream, cheddar cheese, etc.; Pringles varieties vary in their ingredients.[29] Pringles also produces several \"tortilla\" and \"multi-grain\" varieties which have some of their base starch ingredients replaced with corn flour, rice, wheat bran, black beans,[30] and barley flour.[31] At one point in the early 1990s, \"Corn Pringles\" were available; the canister was black and had cartoon images of corn. The chips were made of corn and resembled a corn chip in flavor and texture. Rice Pringles were also available in the UK although they have since been discontinued.[citation needed] Nutrition One serving of about 15 Pringles (Original flavor) contains 150 kilocalories, 2.5 g of saturated fat, 150 mg of sodium, 110 mg of potassium, and 1 g of protein.[32] Flavors Pringles are available in several flavors. Until the 1980s, only the original flavor was available in the US. Standard flavors in the US as of 2020[update] include original, salt and vinegar, sour cream and onion, cheddar cheese, ranch dressing, barbecue, hot and spicy, and loaded baked potato. Some flavors are distributed only to limited market areas; for example, prawn cocktail, wasabi, and curry flavors have been available in the United Kingdom and the Republic of Ireland.[33] Occasionally, P&G has produced limited edition runs. Seasonal flavors, past and present, include ketchup, zesty lime and chili, chili cheese dog, \"pizzalicious\", paprika, Texas BBQ sauce, buffalo wing, and cajun. A \"low-fat\" variety was also sold. Examples of limited edition flavors include jalapeño, honey mustard, cheesy fries, onion blossom, mozzarella cheese stick, screamin' dill pickle, and Mexican-layered dip. In 2012, the seasonal flavors \"peppermint white chocolate\", cinnamon sugar, and \"pumpkin pie spice\" were introduced.[34] Other examples of limited runs only in certain parts of the world include mozzarella stick with marinara in North America and jalapeño in Latin America,[1] also soft-shelled crab, grilled shrimp, seaweed, \"blueberry and hazelnut\", and \"lemon and sesame\" in Asia in early 2010s. The grilled shrimp chips are pink in color, while the seaweed variety is green.[35][36] Two limited-market flavors, cheeseburger and \"Taco Night\", were recalled in March 2010 as a safety precaution after Salmonella was found in a Basic Food Flavors plant which produced the flavor-enhancing hydrolyzed vegetable protein used in those flavors.[37] Marketing Pringles is advertised in the United States, Canada, the United Kingdom, Australia and Ireland with the slogan \"Once you pop, the fun don't stop\"[38] along with the original slogan \"Once you pop, you can't stop!\"[39] The original Pringles television commercials were written, produced and directed by Thomas Scott Cadden (composer of the original Mr. Clean jingle) in 1968, while working at Tatham-Laird and Kudner Advertising Agency in Chicago. Throughout its history, Pringles used its print and television advertising campaigns to compare their products to conventional potato chips. In its early years, they were marketed as \"Pringles Newfangled Potato Chips\" and had a small silver pull-top to open the can. Unlike the current advertising, they only mentioned that, with their pull-top cans (which have been replaced with foil tops since the late 1980s), their chips remain fresh and unbroken, the can holds as many chips as a typical large bag, and their curvy shape allows them to be stackable; thus inspiring the slogan, \"Other potato chips just don't stack up.\"[citation needed] Pringles, as a product brand, is especially known for its packaging, a tubular paperboard can with a foil-lined interior (until the 1980s, the cans also contained a removable pleated paper liner which held the chips in place) and a resealable plastic lid, which was invented by Fredric J. Baur, an organic chemist and food storage technician who specialized in research and development and quality control for Cincinnati-based Procter & Gamble. Baur's children honored his request to bury him in one of the cans by placing part of his cremated remains in a Pringles container in his grave.[40] The can has been criticized for being difficult to recycle due to the multiple materials used in its construction.[41] In 2013, Lucasfilm and Pringles jointly commissioned crowdsourcing video studio Tongal for a commercial,[42] with a total of $75,000 in prize money distributed to seven finalists.[43] In January 2021, a Pringles campaign took the character Frank out of the Raw Fury video game West of Dead in a live Twitch stream. Leahviathan, a gaming influencer, was playing the game and Frank reached through the screen, entered the real world and interacted with players.[44] The aerodynamics of Pringles chips (as well as other consumer products) have been optimized for food processing using supercomputers.[45] Kellogg's has used this fact in a 2022 Pringles advertisement campaign.[46][better source needed] Logo and mascot The Pringles logo is a stylized cartoon caricature of the head of a male figure designed by Louis R. Dixon, with a large mustache and parted bangs (until 2001, the character had eyebrows and his bow tie framed the product name; in 1998, the bangs and lips were removed from the logo, and his head was widened a little). In 2020, the character was again revised with a minimalistic approach to generally negative reception.[47] The mascot originally had no name, and the name originated with a Wikipedia hoax; in 2006, an editor inserted the then-hoax \"Julius\" into the Pringles Wikipedia article, which was subsequently picked up by other news outlets. The editors supported and promoted their claim through creating a Facebook page to raise awareness of Julius Pringles being his name.[48] Prior to this the mascot was officially known only as \"Mr. P\", no first name. By 2013, the name had spread and in a case of citogenesis-turned-real, Kellogg's formally acknowledged Julius Pringles (abbreviated as \"Mr. P\"[49]).[50][51] See also References - ^ a b Chapman, Michelle (6 April 2011). \"Pringles sold to growing empire\". The Sun News. Associated Press. Archived from the original on 4 February 2013. Retrieved 6 April 2011. - ^ Culliney, Kacey (17 June 2013). \"Kellogg inks Pringles EMEA expansion plan\". Bakeryandsnacks.com. Archived from the original on 1 August 2016. Retrieved 21 January 2016. - ^ \"Pringles – Bidding Farewell to a P&G Original\". P&G Corporate Newsroom. Procter & Gamble. 31 May 2012. Archived from the original on 6 May 2019. Retrieved 28 April 2015. - ^ \"Pringles\". Procter & Gamble. Archived from the original on 24 December 2009. Retrieved 28 April 2015. - ^ a b c Martin, Andrew (5 April 2011). \"Once a Great Flop, Now Sold for Billions\". The New York Times. Archived from the original on 20 June 2022. Retrieved 28 April 2015. - ^ US 3998975, Liepa, Alexander L., \"Potato chip products and process for making same\", published 21 December 1976, assigned to Procter & Gamble - ^ Person, Lawrence (Fall–Winter 1998). \"Suns New, Long, and Short: An interview with Gene Wolfe\". Nova Express. 5 (1). Archived from the original on 16 September 2009. Retrieved 28 April 2015. - ^ Gevers, Nick (7 April 2002). \"Could a former engineer who helped invent Pringles be our greatest living writer?\". The Washington Post. ISSN 0190-8286. Archived from the original on 6 January 2019. Retrieved 10 December 2019. - ^ \"Progress Report Given On Jackson P&G Plant\". The Jackson Sun. 3 February 1971. Archived from the original on 10 January 2021. Retrieved 8 January 2021. - ^ a b \"Pringles\". Procter & Gamble UK. 2007. Archived from the original on 4 January 2010. Retrieved 28 April 2015. - ^ The Evansville (IN) Press, October 3, 1968, p.35 - ^ \"Schulte's Early Week Specials\" (advertisement). Jefferson City Post-Tribune, 6 January 1969, 7. - ^ \"Fuller Market Baskets\" (advertisement). The Daily Chronicle (Centralia, WA), 4 May 1969, 7. - ^ Wilson, M.J. \"Name Game: How Product Names Picked.\" Anderson (IN) Sunday Herald, 16 November 1969, 37. - ^ US 2286644, Pringle, Mark & Lame, Herman F., \"Method and apparatus for processing potatoes\", published 16 June 1942, assigned to George A. Brace - ^ \"How Pringles got its name\". Procter & Gamble Everyday Solutions Canada. 2012. Archived from the original on 14 July 2012. Retrieved 1 March 2012. - ^ Trex, Ethan (27 July 2010). \"Where Did 'Pringles' Come From? The Stories Behind 7 Salty Snacks\". Mental Floss. Archived from the original on 11 March 2022. Retrieved 14 July 2015. - ^ Lazarus, George (13 February 1969). \"Big Firms Wrestle Over Chips Name\". Fort Worth Star-Telegram. Archived from the original on 10 January 2021. Retrieved 7 January 2021. - ^ \"Non-Crunch on Pringle's\". Time. 8 December 1975. Archived from the original on 8 March 2008. Retrieved 28 April 2015. - ^ a b \"Pringles 'are not potato crisps'\". BBC. 4 July 2008. Archived from the original on 6 November 2013. Retrieved 28 April 2015. - ^ \"Pringles lose Appeal Court case\". BBC. 20 May 2009. Archived from the original on 9 November 2020. Retrieved 28 April 2015. - ^ \"British court rules yes, Pringles are in fact chips\". NBC News. Associated Press. 20 May 2009. Archived from the original on 12 March 2018. Retrieved 28 April 2015. - ^ \"Pringles sold by P&G to Kettle Chips firm Diamond Foods\". BBC News. 5 April 2011. Archived from the original on 1 April 2022. Retrieved 28 April 2015. - ^ de la Merced, Michael J. (15 February 2012). \"Kellogg Wins Pringles After Diamond Deal Falls Apart\". The New York Times. Archived from the original on 1 October 2019. Retrieved 28 April 2015. - ^ \"Kellogg Company Completes Pringles Acquisition\" (Press release). Kellogg Company. 31 May 2012. Retrieved 28 April 2015. - ^ \"Mars strikes $36bn deal to buy Pringles maker Kellanova\". Financial Times. 14 August 2024. - ^ \"Kellogg's oficjalnie otwiera fabrykę w Kutnie i zapowiada jej rozbudowę. Trwa rekrutacja pracowników\". www.biznes.newseria.pl. Archived from the original on 15 October 2019. Retrieved 4 January 2016. - ^ \"Merger of Pringles Snack Business with Diamond Foods\" (PDF). Procter & Gamble. April 2011. p. 14. Archived from the original (PDF) on 6 May 2019. Retrieved 28 April 2015. - ^ Liles, Valerie (18 February 2015). \"Nutritional Information for Pringles Chips\". LiveStrong. Archived from the original on 18 September 2020. Retrieved 28 April 2015. - ^ Olson, Elizabeth (1 July 2010). \"The Chip That Stacks Adds a Multigrain Twist\". The New York Times. Archived from the original on 16 May 2021. Retrieved 28 April 2015. - ^ \"Multigrain\". Procter & Gamble. Archived from the original on 24 May 2013. Retrieved 28 April 2015.[failed verification] - ^ \"Pringles Smart Label\". Kelloggs. Archived from the original on 11 November 2020. Retrieved 3 February 2020. - ^ \"Pringles Light Aromas Range\". Archived from the original on 31 December 2007. Retrieved 22 November 2010. - ^ Guthrie, Dana (28 November 2012). \"Holiday Pringles and 9 other weird and wonderful holiday flavors\". Houston Chronicle. Archived from the original on 4 September 2019. Retrieved 28 April 2015. - ^ Moors, John (12 March 2010). \"Uhhhhh... Pringles?\". Epicportions.com. Archived from the original on 26 March 2015. Retrieved 28 April 2015. - ^ McGlynn, Katla (2 August 2010). \"Funky Mustard, Blueberry, And Braised Pork: Ridiculous Pringles Flavors From Around The Globe\". Huffington Post. Archived from the original on 2 June 2017. Retrieved 28 April 2015. - ^ \"P&G recalls 2 Pringles flavors\". Salon.com. Associated Press. 9 March 2010. Archived from the original on 13 March 2010. Retrieved 28 April 2015. - ^ Bokale, Jemima (28 September 2005). \"Brand Health Check: Pringles\". Marketing Magazine. Archived from the original on 4 March 2016. Retrieved 28 April 2015. - ^ \"Pringles\". Procter & Gamble. 2007. Archived from the original on 12 April 2008. Retrieved 14 October 2007. - ^ Caplan, Jeremy (4 June 2008). \"The Man Buried in a Pringles Can\". Time. Archived from the original on 5 June 2008. Retrieved 28 April 2015. - ^ Harrabin, Roger (19 May 2017). \"Recycling body criticises Pringles and Lucozade packaging\". BBC News. Archived from the original on 15 August 2022. Retrieved 21 June 2018. - ^ DeJulio, James (11 January 2013). \"Call for Star Wars Commercial By Fans, for Fans\". StarWars.com. Archived from the original on 1 March 2015. Retrieved 15 May 2015. - ^ Dishman, Lydia (2013). \"See The Winners of Tongal's Star Wars-Pringles Campaign\". Fast to Create. Archived from the original on 5 December 2015. Retrieved 15 May 2015. - ^ \"Creativity Best of 2021: A countdown of last year's 10 best ads and creative marketing ideas, as chosen by Ad Age's Creativity editors\". Ad Age. Vol. 93, no. 1. 10 January 2022. p. 10. - ^ Feldman, Michael (5 May 2006). \"High Performance (Potato) Chips\". HPCwire. Archived from the original on 12 November 2021. Retrieved 8 May 2022. - ^ \"Pringles 'Supercomputer'\". aaronandchris.com. 16 May 2022. Archived from the original on 13 February 2023. Retrieved 13 February 2023. - ^ \"Pringles packaging outrage reminds companies of the value of brand familiarity\". Packaging Gateway. 28 September 2021. - ^ Hern, Alex (30 March 2022). \"TechScape: When Wikipedia fiction becomes real life fact\". The Guardian. ISSN 0261-3077. Retrieved 19 July 2023. - ^ \"Kellogg Company 2021 Annual Report\" (PDF). Kellogg. p. 5. Archived (PDF) from the original on 25 March 2022. Retrieved 22 March 2022. - ^ Paul, Andrew (25 March 2022). \"Pringles accidentally named its mascot after a harmless Wikipedia hoax\". Input Mag. Archived from the original on 28 March 2022. Retrieved 25 March 2022. - ^ Morse, Jack (25 March 2022). \"The secret Wikipedia prank behind the Pringles mascot's first name\". Mashable. Archived from the original on 27 March 2022. Retrieved 25 March 2022. External links - Official website - \"Are Pringles 'real food'?\"—Opinion piece at The New York Times"
}