{
  "url": "https://www.howtogeek.com/436985/how-to-open-the-control-panel-on-windows-10/",
  "title": "How to Open the Control Panel on Windows 10",
  "text": "Summary - Easily access the Control Panel on Windows 10 by opening the Start Menu, searching for \"Control Panel,\" and clicking \"Open.\" Pin it to your taskbar for future convenience. - The Control Panel is still present on Windows 10, with some settings only available in the Control Panel, some in the Settings app, and some in both. - You can also type \"Control\" in a Run box to launch Control Panel from anywhere. Windows 10 still contains the Control Panel. Some settings appear only in the Control Panel, some in the Settings app, and some in both. Here's how to find the Control Panel, which is a little more hidden than it was on Windows 7. Open the Control Panel with the Start Menu Still, launching the Control Panel on Windows 10 is very easy: click the Start button or press the Windows key, type \"Control Panel\" into the search box in the Start menu, and press Enter. Windows will search for and open the Control Panel application. If you use the Control Panel frequently, right-click the Control Panel's taskbar icon after launching it and select \"Pin to Taskbar.\" You can then easily launch it from your taskbar. You can create a desktop shortcut to the Control Panel, too. Open the Start menu, scroll down to the bottom of the Apps list in the left pane, and click the \"Windows System\" folder. Drag and drop the \"Control Panel\" shortcut to your desktop. On Windows 7, you could click the Start button and click \"Control Panel.\" On Windows 8 and 8.1, you could right-click the Start button or press Windows+X and click \"Control Panel.\" Neither of those methods works on the latest version of Windows. Open the Control Panel with a Run Box You also have other ways to run the Control Panel. For example, you can press Windows+R to open a Run dialog and then type either \"control\" or \"control panel\" and press Enter. This command can be run from a Command Prompt or PowerShell window, too. You often won't need to access the Control Panel directly — that's what Microsoft is counting on. Even while you're using the Settings application, many settings pages link to individual Control Panel applets that offer additional settings. Even the new Add or Remove Programs pane in Settings links to the classic Programs and Features tool, also known as the \"Uninstall or change a program\" pane."
}