{
  "url": "https://www.citi.com/credit-cards/citi-llbean-credit-card",
  "title": "L.L.Bean® Mastercard® | Citi.com",
  "text": "No annual fee1 $0 liability on unauthorized charges You will not be responsible for unauthorized charges (charges which were not made by you or anyone allowed to use the account). No annual fee1 $0 liability on unauthorized charges You will not be responsible for unauthorized charges (charges which were not made by you or anyone allowed to use the account). The L.L.Bean® Mastercard® offers cardmembers opportunities to earn rewards in the form of Bean Bucks2 they can redeem at L.L. Bean. Cardmembers earn Bean Bucks® on every purchase including 4% at L.L.Bean, 2% at restaurants, and 1% for all other purchases. Use Bean Bucks® to make purchases at L.L.Bean. You can use your L.L.Bean Mastercard® anywhere Mastercard is accepted. Use your card to get outfitted for your next adventure at L.L. Bean, pay for groceries, dining, or other expenses, and earn Bean Bucks2 on every eligible purchase. The L.L.Bean® Mastercard has no annual fee1. Cardmembers can use their Bean Bucks® to pay for purchases at L.L.Bean. 1 Bean Buck = $1 in savings on L.L. Bean purchases. You can easily redeem Bean Bucks at L.L.Bean on llbean.com, by phone, or in stores Online shopping: When you’re ordering from llbean.com, simply select the available Bean Bucks Balance provided on the site. In-store: Ask your sales associate to apply your Bean Bucks to pay for your purchases. Phone: If you're placing an L.L.Bean order over the phone, let the L.L.Bean customer service representative know that you want to redeem your Bean Bucks. Your Bean Bucks never expire as long as you keep using your card2. With the L.L.Bean® Mastercard® you can earn Bean Bucks2 on eligible purchases at L.L.Bean and everywhere Mastercard is accepted. 4% at L.L.Bean. 2% at restaurants 1% on all other purchases You can apply for your L.L.Bean® Mastercard® online, in-store, or over the phone (call 800.221.4221). You will be required to provide both personal and financial information to be considered for the card, and you must meet our credit qualification criteria. 1As of 12/16/2025, the APR for purchases and the APR for balance transfers is % - % based on your creditworthiness and the APR for cash advances is %. These APRs will vary with the market based on Prime Rate. The Minimum Interest Charge is $. The cash advance fee is % of each transaction; minimum $. The balance transfer fee is % of each transaction, minimum $, and the transaction fee for foreign purchases is % of each purchase transaction in U.S. dollars. See card agreement for details."
}