{
  "url": "https://www.reddit.com/r/Windows11/comments/16ty13l/blown_away_by_copilot/",
  "title": "Reddit - The heart of the internet",
  "text": "Blown away by CoPilot The recent update to Windows 11 that puts ChatGPT based AI directly onto your desktop is astonishing, and it is only going to get better. While its not dissimilar to the ChatGPT in Edge Bing Chat, it will be able to escape some of the security challenges that Microsoft undoubtedly face when ChatGPT is in the walled security garden that a browser represents. With ChatGPT (or Copilot for Windows) embedded we have an AI that can take advantage of visibility into whatever we are doing on a PC - not simply browsing the web. I was using it yesterday and was reading an article that said a university had calculated that an extra 7% of people under 75 would die each year in urban areas of the UK because of the cost of living crisis - and I wondered how many actual people that would be. Historically my instinct would be to jump on a search and start trying to gather the numbers - but with CoPilot - I just press Windows+C and dragged the text over to CoPilot and added the question - How many people will die each year. CoPilot on its own went off and searched the current population of the UK - then it went off and searched what percentage of the population lived in urban areas, then it performed the calculation and gave me an answer, explaining how it had got there. That is mind blowing. CoPilot/ChatGPT works at its best when you dont try and break a problem down, dont try to correct your mistakes - but just throw the question at it. About an hour later Im watching a movie 'Support Your Local Sheriff' and I think one of the characters looks a little like the lead in a SciFi movie I watched as a kid. I could remember the name of that movie, only the names of the robots. And here is the answer - It performed two searches, and then matched the actors name. Yes it makes mistakes, but CoPilot/ChatGPT is an engine - which does away entirely with almost your need to SEARCH for anything. By doing the search for you - and combining it across several different sites, removing the duplicates and cleaning up the information - it is just getting to the information you need.No wonder Google issued the Red Alert - and has tried to head off this attack on search, by their half-baked Google Bard product. Google by revenue is 90% a marketing company. The product they sell is us, and they sell us to their customers the marketing agencies. They can only do that - because of what Google manages to glean about our behaviour from watching our activities across all of the free interfaces they offer us. Microsoft have a serious opportunity here to massively disrupt the way that we use our devices and the internet. When we search for something we invariably want an answer, we don't want to wade through 'suggested sites' or adverts, we don't want to have vendors purchasing the top spot in the search algorithm or websites sucking up our cookies to see what things we have an interest in - What we want is just an answer to a question. So whst do we need search for - if you can get someone or something to do your searching on your behalf. The other game changer will be in all of those hundreds of features in applications and operating systems which we dont use frequently enough to have learnt. Excel has decades of updates of features which Im sure are useful but are masked from me, due to the complexity of learning something I might use once, and that is true of hundreds of applications. If CoPilot can behave the same way with our data and our applications as it can with the above examples, then all our apps become more powerful. This is what we are starting to see in CoPilot for Microsoft 365. You'll be able to say things like \"Get the tasks and meeting minutes from the meeting I had last week with our vendor, and email all the project leads, asking them for an update on where they are with their tasks, and schedule a meeting for all of us on Tuesday - and prepare a deck for us to review\". So because CoPilot has access to all of your emails, your chat, your calendar, your documents, your intranet, your schedule, your tasks - It's just as capable of doing the same sort of magic as above, but instead of looking up actors from IMDB and comparing them, its recording your meetings, transcribing them and then turning that into action items, or searching your documents for particular phrases. I asked ChatGPT 4 to summarize what I have written above, and it produced this: It's indeed a significant change in the way we interact with technology and the internet. Here's a summary of the key points you've outlined: - AI Integration in Windows: Windows 11 embedding ChatGPT into the operating system itself allows the AI to provide more personalized and efficient assistance, surpassing the constraints of browser-based models. - Elimination of Search Need: By conducting searches autonomously and filtering the results, ChatGPT or CoPilot virtually eliminates the need for users to manually search for information online, posing a potential threat to search engine giants like Google. - Efficiency in Problem-Solving: CoPilot/ChatGPT works best when users present it with direct queries without breaking them down, showcasing its ability to analyze and solve complex problems efficiently. - Google's Response: The launch of Google Bard can be seen as an attempt to counter this threat to Google's core business model, which heavily relies on user data gathered through search activities. - Transforming Application Use: CoPilot's potential extends to making complex software features in applications like Excel more accessible by handling queries and tasks that would otherwise require a learning curve. - Impact on Microsoft 365: CoPilot can automate and streamline multiple professional tasks by leveraging its deep integration with the entire Microsoft 365 suite. This could include setting up meetings, transcribing conversations, preparing presentations, and much more. - Data-Driven Capabilities: With access to a plethora of user data, CoPilot can automate tasks that involve a range of services, from email and calendar to documents and intranet, making it a versatile tool for both personal and professional use. This integrated AI technology has the potential not only to disrupt the status quo but also to redefine our interaction with computers and the internet. It's particularly fascinating to see how this can intersect with other Microsoft services and tools, given the company's extensive software ecosystem."
}