{
  "url": "https://www.curejm.org/",
  "title": "Cure JM Foundation",
  "text": "Your JM Support Community Cure JM is powered by a community of families who have successfully navigated the JM journey and are here to help you do the same. Get connected with a network of support, encouragement, and resources. Cure JM is the global leader in juvenile myositis (JM) research. We are paving the way to better treatments for JM while improving the lives of families affected by the disease. About Juvenile Myositis Juvenile myositis involves a run-away immune response where the body’s immune system attacks its own cells and tissues. With proper treatment and care, children can go on to live their best lives. We are honored to share our new short film, “Our Mission, Our Impact,” highlighting the key aspects of our mission, working together to make life-changing impacts for the patients and families we serve. Please join us in celebrating the impacts of this progress by making a gift and sharing this video. Resources Getting the Diagnosis It often takes a bit of time for children with juvenile myositis (JM) to get a proper diagnosis. This is due to the fact that Video Resources At Cure JM, we want all our information to be accessible to you and your family. We have compiled all of our video resources in What Parents Should Know About IVIg (Intra-Venous ImmunoGlobulin) The questions about what to do before and post-IVIg to prevent side effects come up often. We know that IVIg can be a very beneficial Get Involved Discover the many ways you can support and connect with Cure JM. We invite you to get involved with Cure JM. We hope you’ll join us in helping make our mission a success. Cure JM families and friends are joining forces to Walk Strong together. Join the hundreds of Cure JM families who have taken steps toward better treatments and a cure. Each walk features food, fun, and friendship as Cure JM families come together to celebrate the power of community and walk for a brighter future. Walks feature fun for the whole family including children, teens, and young adults. Your participation drives our mission and helps ensure no promising research goes unfunded. Finding a Cure and Better Treatments for Juvenile Myositis Cure JM is accelerating juvenile myositis research at an unprecedented pace. We are pursuing promising new treatments, funding clinical trials, and improving care for patients. Research New Treatments Trials Care Network Current Research Updates It started with a small bet on a big idea. A few years ago, Cure JM took a chance, providing seed funding to Dr. Lauren Covert and her team at Duke University. Their goal? To build something no one had seen before: a living, lab-grown replica of human muscle that could mimic the effects of juvenile myositis (JM). Backed by funding from the Cure JM Foundation, scientists at the UK’s Nucleic Acid Therapy Accelerator (NATA) are creating tiny medicines that press the “quiet” button on the immune system’s mistaken alarm that causes myositis. In a study funded by the Cure JM Foundation and led by Dr. Younghun Han of the Baylor College of Medicine, scientists compared the DNA of more than three thousand people living with myositis to nearly twelve thousand healthy volunteers and found something striking. The major forms of myositis share much of the same genetic wiring… Caring for a child with juvenile myositis (JM) goes beyond managing flares and medications—it means supporting their whole well-being, including mental and emotional health. Research shows that children with chronic illnesses like JM are at a significantly higher risk for anxiety, depression, and emotional distress. These challenges can affect not just day-to-day life, but also treatment outcomes and long-term health. Cure JM is proud to fund pioneering research by Dr. Sara Sabbagh at the University of Wisconsin, who is working to solve one of the most urgent mysteries in juvenile myositis (JM). Why does inflammation spiral out of control—and why can’t muscles bounce back like they should? Cabaletta Bio Presents Promising Early Data for CAR-T in Myositis Exciting news from the European Congress of Rheumatology (EULAR) 2024 last month in Vienna, Austria! Cure JM partner Cabaletta Bio, presented encouraging results from their CAR-T cell therapy, CABA-201, in treating myositis. “Cure JM has provided us so much support and connected us to so many families that were experiencing or had experienced the exact same thing. That sense of community helped us get through the ups and downs.”"
}