{
  "url": "https://gemini.google/br/about/?hl=pt-BR",
  "title": "Conheça o Gemini, seu assistente de IA criado pelo Google para o dia a dia",
  "text": "O Gemini 3 é nosso modelo mais inteligente Gemini 3 Google’s most intelligent AI. Explore new capabilities like Agent, Visual Layout, Nano Banana Pro and more. Now free & unlimited in the app. Transforme palavras em vídeos Crie vídeos de 8 segundos em alta qualidade usando nosso modelo de geração de vídeos de última geração. É só descrever o que você pensou e ver suas ideias tomarem forma em movimento. Faça perguntas complexas Quer entender o processo de replicação do DNA ou aprender a construir algo à mão? O Gemini usa a Pesquisa Google como base, então você pode pedir qualquer coisa e depois fazer mais perguntas até entender o assunto. Crie imagens em segundos Com o Nano Banana, nosso modelo mais recente de geração de imagens, você se inspira para criar logotipos, brinca com estilos variados (de anime a pinturas a óleo) e faz imagens com apenas algumas palavras. Além disso, pode baixar ou compartilhar o conteúdo quando ele fica pronto. Converse com o Gemini Live Converse em voz alta, pratique perguntas para uma entrevista de emprego, troque ideia sobre um arquivo ou foto e fale à vontade com o Gemini Live. Escrita eficiente Da ideia ao produto final com mais rapidez. Use o Gemini para resumir textos, gerar rascunhos e enviar arquivos para receber feedback sobre o que você escreveu. Turbine seu aprendizado Crie planos de estudos, resumos de tópicos e testes para avaliar seus conhecimentos. Você pode até praticar apresentações em voz alta com o Gemini Live. Receba ajuda simultânea em todos os seus apps O Gemini conecta seu conteúdo do Gmail, Google Agenda, Maps, YouTube e Google Fotos para você encontrar o que precisa sem precisar sair de app para outro. Use o Gemini para definir alarmes, controlar músicas e fazer ligações sem usar as mãos. Economize horas de pesquisa com o Deep Research Com o Deep Research, em questão de minutos, você recebe um relatório com a análise de informações de centenas de sites. É como se você tivesse um pesquisador personalizado que deixa tudo mais rápido e eficiente. Crie especialistas personalizados com os Gems Com instruções detalhadas e a capacidade de enviar documentos informativos, você cria seus próprios especialistas de IA para temas específicos. Os Gems podem agir como um consultor de carreira, um parceiro para discutir ideias, um ajudante de programação e muito mais. Analise grandes arquivos e repositórios de código Equipado com uma janela de contexto de 1 milhão de tokens, o Gemini Pro consegue entender e analisar livros inteiros, relatórios detalhados e muito mais. Ele pode processar até 1.500 páginas ou 30 mil linhas de código de uma vez. Planos Receba ajuda no dia a dia: com a IA do Google, você lida com as atividades do trabalho, da escola e de casa, sem esforço. Acesso ao 3 Flash Acesso variável ao 3 Pro Geração e edição de imagens Deep Research Gemini Live Canvas Gems Tenha acesso ampliado a recursos novos e avançados para aumentar sua produtividade e criatividade. O Google AI Plus está disponível em mais de 160 países. Confira a lista completa. Tenha acesso ampliado a recursos novos e avançados para turbinar sua produtividade e criatividade. O Google AI Pro está disponível em mais de 150 países e territórios. Confira a lista completa. Aproveite o acesso completo ao que a IA do Google tem de melhor, além de recursos exclusivos. O Google AI Ultra está disponível em mais de 140 países. Confira a lista completa. O plano individual do YouTube Premium está disponível em mais de 40 países. Confira a lista completa. Gemini no Instagram Upgrades específicos para o que você precisa - 1. O Google AI Plus está disponível em mais de 160 países. Confira a lista completa. - 2. O Google AI Pro está disponível em mais de 150 países e territórios. Confira a lista completa. - 3. O Google AI Ultra está disponível em mais de 140 países. Confira a lista completa. - 4. Os créditos mensais são compartilhados entre o Flow e o Whisk. - 5. O Flow está disponível em mais de 140 países. Confira a lista completa. - 6. O Veo 3.1 está disponível em mais de 140 países e territórios. Confira a lista completa. - 7. O Whisk está disponível em mais de 140 países e territórios. Confira a lista completa. - 8. O plano individual do YouTube Premium está disponível em mais de 40 países. Confira a lista completa."
}