{
  "url": "https://flutrackers.com/forum/forum/local-regional-communities-and-organizations/cidrap/1021943-cidrap-news-briefs-october-28-2025",
  "title": "CIDRAP- NEWS BRIEFS October 28, 2025 - FluTrackers News and Information",
  "text": "https://www.cidrap.umn.edu/all-news International team to investigate natural human resistance to Salmonella News brief 11 minutes ago. Chris Dall, MA Topics Salmonella Antimicrobial Stewardship An international team of scientists led by researchers from the University of Liverpool has received an award of £4.56 million (US $6.06 million) for a 5-year research program that will explore natural human protection against Salmonella. The award from Wellcome Discovery will enable the team to investigate the role that microbial composition, nutrient use, and dietary factors play in resistance to colonization by Salmonella Typhimurium, which typically causes gastroenteritis but is also a leading cause of invasive non-typhoidal Salmonella (iNTS) disease, a severe bloodstream infection. The work will build on the findings from a previous study, in which some healthy volunteers who were deliberately exposed to a beverage containing Salmonella Typhimurium showed complete resistance to colonization. Modeling studies estimate that iNTS caused 594,000 infections and 79,000 deaths in 2019, primarily in young children in sub-Saharan Africa. The researchers say one of the ultimate objectives of the study is to develop microbiota-based therapies that could prevent infection and reduce reliance on antibiotics. \"This award allows us to explore the invisible defenders—the gut microbiota—and understand why some healthy people never become colonised when deliberately exposed to Salmonella bacteria,\" molecular microbiologist Blanca Perez-Sepulveda, PhD, of the University of Liverpool, said in a news release. \"Eventually, we hope it might be possible to modify the microbiota in susceptible children in Africa to prevent iNTS disease.\" Louisiana officials waited months to alert public about deadly pertussis outbreak, investigation finds News brief 10 minutes ago. Jim Wappes Topics Pertussis Public Health Childhood Vaccines Louisiana officials waited 2 months after the state's first pertussis (whooping cough)-related deaths in years—which occurred by late January—to encourage vaccination and more than 3 months to issue a statewide health alert on May 1 this year, NPR, in conjunction with KFF Health News, reported today. Such delays for a record outbreak are not typical, according to Georges Benjamin, MD, executive director of the American Public Health Association. \"Particularly for these childhood diseases, we usually jump all over these,\" said Benjamin. \"These are preventable diseases and preventable deaths.\" Missed opportunities In late January, physicians at a Louisiana hospital warned their colleagues that two infants had died in the pertussis outbreak. Shortly thereafter, on February 13, Louisiana Surgeon General Ralph Abraham, MD, ended the state's general promotion of vaccines and vaccination events. Local media reported the pertussis deaths on February 17. They were the state's first pertussis-related deaths since 2018. In March, after inquiries from NPR and KFF Health News about the growing number of pertussis cases, the health department put out its first social media communications about the outbreak. Then on May 1, the health department issued what appears to be its only official alert to physicians. The next day, it issued its first press release, and then officials held a press conference about pertussis on May 14. When you have two infant deaths it's a really good opportunity to communicate that this is a real threat to the health of children. By then, 42 people had been hospitalized for pertussis since the outbreak began, three fourths of them unvaccinated. More than two thirds of those hospitalized were babies under 1 year old. As of September 20, the state had 387 pertussis cases in 2025, eclipsing the previous 35-year high of 214 cases in 2013. \"The risk of pertussis is always there, but when you have two infant deaths it's a really good opportunity to communicate that this is a real threat to the health of children,\" said Joshua Sharfstein, MD, of Johns Hopkins. Third Wyoming hunt area in past month tests positive for CWD News brief 27 minutes ago. Mary Van Beusekom, MS Topics Chronic Wasting Disease For the third time this month, Wyoming has documented a first-time chronic wasting disease (CWD) detection in another hunting area. Yesterday, the Wyoming Game and Fish Department confirmed that a hunter-harvested mule deer buck tested positive for CWD in Mule Deer Hunt Area 153 in the Pinedale Region, located in the western part of the state. \"Mule Deer Hunt Area 153 is bordered by CWD-positive Mule Deer Hunt Areas 142 (detected in 2023), 144 (detected in 2021), 152 (detected in 2019) and 154 (detected in 2023),\" the press release said. \"Mule Deer Area 153 is part of the Sublette Mule Deer Herd. CWD was first detected in this herd in 2017.\" Other recent detections in elk hunt areas The previous detections announced this month were noted in cow elks in Elk Hunt Area 116 in the northeastern corner of Wyoming, near Casper, and in Elk Hunt Area 61 in the northwestern part of the state, near Cody. A fatal neurologic disease affecting cervids such as elk, deer, and moose, CWD spreads via infectious misfolded proteins called prions, which can be transmitted from animal to animal and through environmental contamination. Quick takes: More Rift Valley fever in Senegal, mpox clade 1b threat, avian flu on California duck farm News brief 56 minutes ago. Stephanie Soucheray, MA Topics Rift Valley Fever Avian Influenza (Bird Flu) Mpox Viral Hemorrhagic Fever ALL BRIEFS International team to investigate natural human resistance to Salmonella News brief 11 minutes ago. Chris Dall, MA Topics Salmonella Antimicrobial Stewardship An international team of scientists led by researchers from the University of Liverpool has received an award of £4.56 million (US $6.06 million) for a 5-year research program that will explore natural human protection against Salmonella. The award from Wellcome Discovery will enable the team to investigate the role that microbial composition, nutrient use, and dietary factors play in resistance to colonization by Salmonella Typhimurium, which typically causes gastroenteritis but is also a leading cause of invasive non-typhoidal Salmonella (iNTS) disease, a severe bloodstream infection. The work will build on the findings from a previous study, in which some healthy volunteers who were deliberately exposed to a beverage containing Salmonella Typhimurium showed complete resistance to colonization. Modeling studies estimate that iNTS caused 594,000 infections and 79,000 deaths in 2019, primarily in young children in sub-Saharan Africa. The researchers say one of the ultimate objectives of the study is to develop microbiota-based therapies that could prevent infection and reduce reliance on antibiotics. \"This award allows us to explore the invisible defenders—the gut microbiota—and understand why some healthy people never become colonised when deliberately exposed to Salmonella bacteria,\" molecular microbiologist Blanca Perez-Sepulveda, PhD, of the University of Liverpool, said in a news release. \"Eventually, we hope it might be possible to modify the microbiota in susceptible children in Africa to prevent iNTS disease.\" Louisiana officials waited months to alert public about deadly pertussis outbreak, investigation finds News brief 10 minutes ago. Jim Wappes Topics Pertussis Public Health Childhood Vaccines Louisiana officials waited 2 months after the state's first pertussis (whooping cough)-related deaths in years—which occurred by late January—to encourage vaccination and more than 3 months to issue a statewide health alert on May 1 this year, NPR, in conjunction with KFF Health News, reported today. Such delays for a record outbreak are not typical, according to Georges Benjamin, MD, executive director of the American Public Health Association. \"Particularly for these childhood diseases, we usually jump all over these,\" said Benjamin. \"These are preventable diseases and preventable deaths.\" Missed opportunities In late January, physicians at a Louisiana hospital warned their colleagues that two infants had died in the pertussis outbreak. Shortly thereafter, on February 13, Louisiana Surgeon General Ralph Abraham, MD, ended the state's general promotion of vaccines and vaccination events. Local media reported the pertussis deaths on February 17. They were the state's first pertussis-related deaths since 2018. In March, after inquiries from NPR and KFF Health News about the growing number of pertussis cases, the health department put out its first social media communications about the outbreak. Then on May 1, the health department issued what appears to be its only official alert to physicians. The next day, it issued its first press release, and then officials held a press conference about pertussis on May 14. When you have two infant deaths it's a really good opportunity to communicate that this is a real threat to the health of children. By then, 42 people had been hospitalized for pertussis since the outbreak began, three fourths of them unvaccinated. More than two thirds of those hospitalized were babies under 1 year old. As of September 20, the state had 387 pertussis cases in 2025, eclipsing the previous 35-year high of 214 cases in 2013. \"The risk of pertussis is always there, but when you have two infant deaths it's a really good opportunity to communicate that this is a real threat to the health of children,\" said Joshua Sharfstein, MD, of Johns Hopkins. Third Wyoming hunt area in past month tests positive for CWD News brief 27 minutes ago. Mary Van Beusekom, MS Topics Chronic Wasting Disease For the third time this month, Wyoming has documented a first-time chronic wasting disease (CWD) detection in another hunting area. Yesterday, the Wyoming Game and Fish Department confirmed that a hunter-harvested mule deer buck tested positive for CWD in Mule Deer Hunt Area 153 in the Pinedale Region, located in the western part of the state. \"Mule Deer Hunt Area 153 is bordered by CWD-positive Mule Deer Hunt Areas 142 (detected in 2023), 144 (detected in 2021), 152 (detected in 2019) and 154 (detected in 2023),\" the press release said. \"Mule Deer Area 153 is part of the Sublette Mule Deer Herd. CWD was first detected in this herd in 2017.\" Other recent detections in elk hunt areas The previous detections announced this month were noted in cow elks in Elk Hunt Area 116 in the northeastern corner of Wyoming, near Casper, and in Elk Hunt Area 61 in the northwestern part of the state, near Cody. A fatal neurologic disease affecting cervids such as elk, deer, and moose, CWD spreads via infectious misfolded proteins called prions, which can be transmitted from animal to animal and through environmental contamination. Quick takes: More Rift Valley fever in Senegal, mpox clade 1b threat, avian flu on California duck farm News brief 56 minutes ago. Stephanie Soucheray, MA Topics Rift Valley Fever Avian Influenza (Bird Flu) Mpox Viral Hemorrhagic Fever - Senegal has now recorded 302 confirmed cases, including 26 deaths, in its growing Rift Valley fever outbreak. In total, 227 patients have recovered, the Ministry of Health said in its most recent update. The outbreak has now spread to eight regions in the country, most recently Thies. Last week, the Africa Centres for Disease Control and Prevention estimated the outbreak’s case-fatality rate as 7.9%. Rift Valley fever usually affects livestock but can spread to people via contact with the body fluids of infected animals or through mosquito bites. - The UK Health Security Agency (UKHSA) has published an updated technical assessment for mpox clade 1b, saying the probability of importation into the United Kingdom has increased from medium to high as person-to-person transmission has now been documented outside of Africa (Europe and North America.) But officials said onward transmission in the United Kingdom is likely to be controlled somewhat by some levels of immunity from natural infection or vaccination among the at-risk population of men who have sex with men. - The US Department of Agriculture's (USDA's) Animal and Plant Health Inspection Service (APHIS) announced one new highly pathogenic avian flu (HPAI) detection on a commercial duck farm in Sonoma County, California. A total of 57,300 birds were affected. ALL BRIEFS"
}