{
  "url": "https://www.pbs.org/articles/who-was-julius-caesar",
  "title": "Who Was Julius Caesar? | PBS",
  "text": "Who Was Julius Caesar? Julius Caesar, an accomplished military general and cunning politician, is perhaps remembered as one of the most consequential figures who rose to power during the Roman Republic – and led to its eventual downfall. While his name is inextricably linked to his infamous assassination, his life and legacy are noteworthy for closer study. In the PBS documentary series, Julius Caesar: The Making of a Dictator, historians and experts highlight the dramatic story of how nearly five centuries of ancient Roman democracy was overthrown in just 16 years by none other than Julius Caesar. Read on below to discover the moments and decisions that defined him. Official Trailer Early Life & Family Born Gaius Julius Caesar in 100 BCE, Caesar is born to a lineage of Roman aristocrats. However, over the course of his life, Caesar notably positions himself against the nobility, making himself a popular figure among the common people of Rome. Throughout his life, Caesar marries three different times: Cornelia (84–69 BCE), with whom he shares his only child, Julia; Pompeia (67–62 BCE); and Calpurnia (59–44 BCE). From a young age, Caesar has his eyes set on holding higher office – and by the time he turns 31, Caesar had fought in multiple wars and was active in the political sphere. Caesar obtains the governorship of Farther Spain from 61 - 6o BCE. While serving this position, he manages to build upon his political credibility – setting the stage for his higher governmental ambitions upon his return to Rome in 60 BCE. Caesar Forms the Triumvirate In 59 BCE, Caesar wins the election of consulship. Although the position is shared between two men, it ranks as the highest office in the Roman Senate. Caesar’s co-consul is Marcus Calpurnius Bibulus who is a close ally of Cato, one of Caesar’s chief adversaries in the republic. Caesar soon recognizes that the conservatives in the Senate will do as much as they can to prevent him from passing legislation or making political gains. Caesar devises a plan to strengthen his power: creating an informal alliance with two of the most powerful men in Rome. One of the men, Pompey (born Gnaeus Pompeius Magnus), is a revered military general who has led successful conquests across Roman territory; the other is Marcus Licinius Crassus who, at the time, is arguably the wealthiest man in Rome. Together, the three men form the “First Triumvirate.” While Crassus and Pompey are notoriously long-term enemies, both of them see the benefit of unifying their collective power. To officially solidify his alliance with Pompey, Caesar marries his only daughter, Julia, to the formidable military commander. Now that he is consul, Caesar has to make good on his promise to Pompey by proposing a bill to grant land to Pompey’s veterans. However, as expected, the conservatives demonstrate no interest in letting the bill receive a majority vote in the Senate. Yet, while it looks like the bill has been killed off, Caesar decides to break from governmental rules… and bypass the Senate entirely, instead bringing it to the public forum for the people to have their vote. The Forum is an intimidating atmosphere filled with thugs, groups of Caesar supporters, and cohorts of Pompey’s veterans. Caesar takes center stage on the rostrum and incites the crowd in an effort to rally support for the bill. It is at this moment, too, where the people of Rome first learn of the First Triumvirate. Pompey joins Caesar on stage, and soon after, Crassus makes his entrance. The crowd is astonished at how Caesar has managed to align the most powerful men in Rome together, and Cato and his supporters can’t help but gaze on in horror. When Caesar finally presents the land bill to the people, he’s interrupted by a voice of opposition: Marcus Calpurnius Bibulus, Caesar’s co-consul. But Caesar is not interested in hearing any dissent, and calls on the mob to assault Bibulus. For Caesar, this moment is a declaration of his burgeoning power – and in the end, he is able to pass the land bill for Pompey’s men as well as offer Crassus lucrative tax breaks. Military Campaign in Gaul When Caesar finishes his year as consul of Rome in 58 B.C., he sets his sights on daring plans: conquering Gaul. Gaul, or what is mostly now considered modern-day France, stretches from northern Italy to the English Channel. Caesar serves as governor of a small Roman territory in the south, and he is as confident as ever that he can conquer all of Gaul – a feat that the majority of Romans would consider confounding. However, Caesar is determined to acquire the fame and status that such an achievement would bring him. While Caesar embarks on his military campaign in Gaul, back in Rome, a group of senators, led by Caesar’s long-term nemesis Cato, seek to prosecute Caesar for the violent, aggressive behavior he carried out during his tenure as consul. However, as long as Caesar is away in Gaul, his role as governor ensures him immunity from prosecution. The only power the Senate has is the ability to recall him… Desperate to avoid potential litigation, Caesar calls on his allies, Crassus and Pompey, to meet him in the Italian town of Luca in 56 BCE. During Caesar’s absence in Gaul, Crassus and Pompey’s relationship has become strained. Caesar knows that the security of his future relies on the Triumvirate’s stability, so he approaches the meeting with a proposal that will satisfy both men’s desires: Pompey and Crassus should run as co-consuls, giving them the power to deliver what each of them wants. In return for Caesar, he requests an extension of his command so that he can complete his conquest of Gaul as well as remain immune to prosecution. The three men agree to the plan. Co-consuls rarely run as a ticket, but soon after both men kick off their campaigns, it is clear to the Roman people that Crassus and Pompey are working together. Cato, alarmed at the Triumvirate’s intentions, tries to stand up against them by having his brother-in-law run for consul. But when word gets back to Caesar of the opposition toward the Triumvirate, he sends men from his legions to Rome to register their votes. These men dispel violence and intimidation throughout the streets, and on the morning of the consulship election, Crassus and Pompey hire thugs to assault Cato. Pompey and Crassus end up running unopposed and win the election by a landslide. In doing so, they secure Caesar another five years in Gaul. Caesar pounces on this opportunity and accelerates his conquest – but his opponents back home are still waiting to take him down. When word gets back to Rome that Caesar has broken a peace treaty and has slaughtered more than 400,00 men, women, and children in Gaul, the conservatives know they have their chance to punish Caesar finally. Cato pushes the case in front of the Senate: Caesar has committed war crimes and should be handed over to the enemy. But Cato soon discovers that no one wants to side against Caesar; he’s far too popular a figure. Caesar’s power, even when away from Rome, only continues to grow. Caesar Suffers Two Losses By the end of 55 BCE, Caesar is reveling in the fame and glory brought on by his military achievements – but unbeknownst to him, imminent tragedy soon awaits him. Julia, Caesar’s only daughter and Pompey’s wife, is prepared to give birth. But not long after going into labor, Julia suffers medical complications and dies; a few days later, her newborn passes away as well. Pompey is devastated over Julia and his child’s death, and when Caesar receives the news, he too, is in despair. Julia’s death marks the end of Caesar’s lineage… as well as the collapse of his alliance with Pompey. While Julia was alive, she maintained her role as a mediator between her father and husband – but now with her gone, there is no longer any official link tying the two men together. A few months after Julia’s passing, Caesar learns of other devastating news: Crassus, his long-term ally and third member of the Triumvirate, was beheaded following his invasion of Parthia. Crassus’ death marks the beginning of the Triumvirate’s disintegration. Caesar, desperate to renew his relationship with Pompey, offers his great niece to him as a prospective wife… but Pompey turns Caesar down. Caesar is no longer calling all the shots… and the alliance he once relied on trembles in a precarious state. Support your local PBS station in our mission to inspire, enrich, and educate. Rome Burns By 52 BCE, the state of the Roman Republic has fallen into disarray. Violence ensues in the streets, and taking advantage of this moment is a senator named Clodius. Notorious for his sociopathic tendencies, Clodious also holds the rank of tribune, a position created to serve as a check on the government’s authority and protect the interests of the Roman people. Many Roman citizens have pledged their allegiance to Clodius due to popular legislation he’s passed, and because of this, Clodius is able to recruit men for his paramilitary gangs. As Clodius’ violent influence strengthens across Rome, some senators hire men to take out Clodius. One morning, on a road outside of Rome, Clodius is found in a ditch. His corpse is taken back to his wife Fulvia, who opts to break away from the traditional nature of a Roman aristocratic funeral: rather than clean Clodius’ body and dress him before displaying him publicly, she allows the public to see his battered, bloodied corpse. Anger festers, and soon a rumor circulates that Clodius was murdered by a notable senator. In the fallout, an angry mob, led by Fulvia, marches to the Senate house. They break into the building, carrying Clodius’ body, and set his body aflame on the pyre. In doing so, the entire Senate house burns down – a symbolic moment of the collapse of the republic as well as a sight of horror for many onlookers. In a desperate move, Cato decides to ally himself with Pompey in the hopes that the popular general can use his influence to quell Rome’s state of disorder. During times of crisis, the Senate has the power to elect a dictator, however, the Optimates are fully against the idea. A compromise is made – and Pompey is offered the role of sole consulship, a designation that has never happened before. The gamble on electing Pompey proves to pay off as his soldiers bring order back to the city. When his term comes to an end, Pompey gives up his power. Roman Civil War With Caesar’s 10-year governorship reaching its close, he’s left with the question of what he will do once he’s no longer protected from potential prosecution. For Caesar, the answer is clear: he will capitalize on the popularity he’s won from his success in Gaul to win the upcoming annual consulship. If he wins, he will once again be immune to legal action. Caesar’s adversaries have another plan in mind. The Senate becomes divided again over whether or not to terminate Caesar’s governorship and recall him back to Rome. Pompey possesses the decisive opinion in this matter – does he remain loyal to Caesar, his ally of many years, or does he re-align himself with the governmental body? In the end, Pompey decides to stand with the Optimates, and on the 1st of March, 50 BCE, a vote in the Senate is called to order. But Caesar has bribed a tribune to bring the debate to a crashing halt and even offer a counterproposal: if Caesar loses his command, then Pompey should also lose his command in Spain. It’s a standoff between Caesar and Pompey that leads to growing tension. The senators are worried it could result in a possible civil war, so in an effort to de-escalate the crisis, they debate again the proposal that both Caesar and Pompey give up their armies and that Caesar be allowed to stand for the consulship. The final vote is 374 to and 22 against – Caesar is reprieved, but not all of his enemies are willing to give up their efforts. One of the current consuls is an outspoken Optimate and is willing to do something radical. Rather than first approaching the Senate for approval, the consul goes to Pompey and offers him a sword. He tells Pompey that he is in command and must take arms against Caesar. While Pompey should refuse this proposal, he accepts the sword, furthermore declaring his willingness to fight Caesar. Mark Antony, one of Caesar’s most loyal soldiers and a tribune, comes to the Senate with a letter that outlines Caesar’s wishes to find a way toward peace… but that if such a road is not an option, then Caesar will take it upon himself to protect his honor and the freedom of the Roman people. Caesar will declare civil war. The Senate responds hastily and brings forth an emergency bill called the “Ultimate Decree of the Senate.” which would make Caesar an outlaw of the state. Antony is warned that if he interferes with the bill’s passing, then he should be concerned for his safety. As such, Antony flees Rome and sends Caesar notice that he is in danger. When Caesar gets word of this, he acts decisively and rallies up his army. On the 10th of January, 49 BCE, after a long evening of deliberation, Caesar decides to cross the Rubicon River – in effect, declaring civil war. Caesar is Named Dictator Following three years of brutal carnage endured during the Roman Civil War, Caesar returns to Rome in 46 B.C., victorious. But the Rome that Caesar comes back to is one that is ravaged by poverty, food shortages, and civilian unrest. Caesar sees himself as the man to tackle Rome’s crisis, but in order to do so, he needs to persuade the Senate to his cause. While Caesar has his allies, his political opponents remain deeply suspicious of his potential tyrannical intentions. To help win over the support of the Republicans, Caesar turns to Marcus Junius Brutus, a young politician who is the descendant of the Roman Republic’s founder. Caesar and Brutus’ relationship actually extends beyond the political sphere: Brutus’ mother is notoriously one of Caesar’s long-term lovers, and Caesar is known to have looked after Brutus throughout his life. Caesar promises Brutus the governorship of a Roman territory in exchange for his help on advancing his political allegiances. Brutus agrees, and by the fall of 46 B.C., the Senate reconvenes… for Caesar to lay out his plans. Caesar reveals he has no intention of restoring the Senate’s full authority. Instead, he makes the case for elevating himself to the role of a dictator, a position within the Roman system of government that is utilized only during a time of extreme crisis and held for a maximum of six months. This position of dictator contrasts with the standard two-consul rule where two politicians are elected by legislative assemblies. Instead, a dictator is granted greater centralized power, in the hopes that he is able to address the gamut of pressing issues more effectively. While the title of “dictator,” conjures up negative connotations in the present-day, the Roman Republic sees it, at times, as a necessary provision. But Caesar wants to shake things up a bit more. Rather than holding the role of dictator for six months, he suggests his tenure should extend to a full 10 years. By this point, Caesar possesses enough political sway within the government, and in the end, the Senate agrees, on the condition that they will review his position every year. Following his ascension to the dictatorship, Caesar implements a wide-ranging series of legislation and reforms, from improving infrastructure and rebuilding the Senate House to recalibrating the Roman calendar, the same system that is still used today. However, for all of the immediate developments he addresses, Caesar is still fixated on maintaining his political power. For one, he increases the size of the Senate from 600 to 900 men, furthermore ensuring his loyalists outnumber his political opponents. Even more aggressively, Caesar suspends the right for people to vote for magistrates. A Turning Point As many of Caesar’s rivals fear, his rapidly expanding power goes straight to his head… and quickly. But because the senators now need to win Caesar’s approval to be appointed magistrates, many of them flood their leader with generous honors. Most notably, Caesar receives a special wreath with gold leaves to wear on his head. In ancient Rome, wreaths represented paramount significance as they were typically reserved for winners of special games or generals returning in triumph. The fact that Caesar claims neither of these honors exemplifies how big his ego has grown. However, the turning point in Caesar’s fate comes when a delegation of senators approaches him in his forum. The men greet Caesar, prepared to flower him with more honors – but Caesar does something shocking. As is Roman custom to stand up when equals greet each other, Caesar remains seated. His actions speak loud volumes: by refusing to stand up, he in effect makes it clear that he views the entire Senate as beneath him. Caesar’s blatant disregard for honoring such a basic rule of the Senate sends shock waves throughout Rome. Some senators see it as a step too far. If Caesar is willing to dismiss what is such a long-held, understood custom, how far is he willing to go? Amid Caesar’s continuous indifference to republican conventions, Cassius, a long-time opponent of Caesar’s, steps forth to challenge Caesar in open view, emphasizing that they have managed to create a monster. Cassius knows his outspoken political dissent is risky, but he senses the tide is turning against Caesar. Caesar, too, can detect the growing resentment, but his focus is on other things: conquering the Parthian Empire, the one great foe Rome has so far failed to claim. He decides he will leave in three months to lead conquest, but in the meantime, he will call on his supporters in the Senate to create a role that will centralize his power not just for ten years… but indefinitely. For Caesar, there’s no going back now. He has made it clear to everyone that he has no intention of restoring the Roman Republic to what it once was. By accepting the role of dictator in perpetuity, no one can challenge his power. The Lupercalia One month before leaving for Parthia, Caesar attends the festival called the Lupercalia, where he uses the occasion to test out the people’s interest in a one-man rule system. The Lupercalia kicks off with a sacrifice performed in front of a sizable crowd in the public forum. With Caesar presiding over the ritual, and Mark Antony serving as the festival’s chief priest, the stage is set: Antony approaches Caesar with a diadem, a symbol of kingship or monarchical rule. If Caesar sees that the crowd is agreeable with him wearing the diadem, then perhaps he has a better chance of fully securing his long-term, singular rule. But the people show their unequivocal dismay at the display. Caesar notices the disapproval, and quickly tells Antony to remove the diadem and says, \"Take it away and give it to Jupiter, for in Rome there can be only the one king. Jupiter, king of the gods.\" This moment is the tipping point for Brutus, for while he still considers Caesar as someone who has done nothing but support him, he can’t help but see Caesar for what he is: a tyrant. Caesar must be stopped. On the same day of the Lupercalia, Caesar attends another ritual sacrifice where the omens reveal the mood of the gods. A priest named Spurinna is the man in charge of overseeing the sacrifice to Jupiter. As a man in tune with public opinion, he knows this ceremony is an opportunity to show Caesar the animosity he’s up against. When inspecting the insides of a slaughtered animal, Spurinna looks for the heart of the bull – however, there is no heart to be found. The omen is a warning. Spurrina tells Caesar, “Beware of the Ides of March.\" But Caesar appears deterred by it – who would truly dare to challenge his authority? Plotting Caesar’s Assassination Following Caesar’s behavior at the Lupercalia, there’s no longer any denying his intentions to warp the Roman Republic back into a monarchy. Even the common people express their repugnance toward Caesar’s audacity. With Caesar’s public favorability on the decline, Cassius knows this is the moment to jump on Caesar. He needs to persuade the senators that action must be taken to stop Caesar, but in order to accomplish this, he needs the help of Brutus. Despite Brutus’ extensive history with Caesar, he’s come to terms with the threat Caesar imposes on Rome’s democracy. Cassius and Brutus meet in private – and the two of them begin devising their plan. While Caesar tends to Parthia's preparations, Cassius and Brutus host a dinner party where they invite a group of Rome’s most influential men. It doesn’t take much effort to win over the men to Brutus and Cassius’ cause; even friends of Caesar are convinced action must be taken. But what is agreed upon quickly is that their options appear limited. Caesar has all of the Roman army at his disposal. The best option forward appears to be…assassination. Brutus and Cassius are successful in recruiting more than 20 senators who agree to participate in the tyrannicide. They pitch the act of political violence as the best and only way to ensure Rome is saved from tyrannical rule. Yet, in order for this assassination to broadcast its intended message, it must take place in broad daylight. The spectacle must take place in the Senate. The Ides of March On March 15th, 44 BCE, Caesar’s wife, Calpurnia, wakes up in a state of anguish: in her dream, she witnessed Caesar murdered. That morning, Caesar is expected to preside over a sacrifice. It is there where he runs into Spurinna, who reminds Caesar that while the Ides of March have arrived, they have not yet passed. Later that day, Caesar is to make his presence at the Senate, but Calpurinia begs Caesar to stay at home, so Caesar reluctantly obliges. When word gets out that Caesar will not be in attendance at the Senate, Brutus and Cassius rush to problem-solve. There’s no Plan B for their scheme: they need Caesar to come. The conspirators decide to send Decimus, one of Caesar’s long-term supporters and loyal generals. Decimus, after shaming Caesar for displaying coward-like behavior, convinces Caesar to show his face at the Senate. By the time Caesar steps foot in the Senate, the group of conspirators has managed to isolate him from his supporters, most notably, Mark Antony. As Caesar settles down in his seat, he’s approached by different senators who deluge him with favors and questions. One persistent senator consumes Caesar’s attention with a petition… but only shortly afterward, Caesar is stabbed in the neck. Caesar, naturally, is in shock. More knives are drawn. Every conspirator understands he must participate in the act of violence. One of the final blows comes from none other than Brutus, a man whom Caesar loved and looked after for countless years. The betrayal is devastating, to which Caesar mutters the famous words to Brutus, “ \"And you, my boy?\" While Caesar’s bloody corpse lays out on display, an immediate sense of panic kicks in among the senators. Everyone flees – and soon after, Rome is thrown into a state of violence. The Fallout The conspirators, many of whom thought they could liberate Rome from tyranny, end up propelling the Roman Republic into further disarray. Not long after Caesar's assassination, a second Triumvirate is formed in an attempt to maintain control of the Roman Republic, but things quickly fall apart, and the Roman Republic descends yet again into civil war. In the end, the Roman Republic falls and from its ashes rises Octavian, Caesar's adopted heir, as the sole ruler of what will come to be known as the Roman Empire. As emperor, Octavian takes on the title of Caesar Augustus, in honor of his adopted father, and future Roman emperors continue the tradition, honoring the man who signaled the end of the Republic. Interested in more ancient history content? Stream \"Julius Caesar: The Making of a Dictator\" on PBS and check out our other great Roman history documentaries! The best of PBS, straight to your inbox. Be the first to know about what to watch, exclusive previews, and updates from PBS."
}