{
  "url": "https://www.kartoslo.com/",
  "title": "Oslo bykart - Veikart over Oslo med gater",
  "text": "Oslo er hovedstaden og den mest befolkede byen i Norge. Oslo utgjør både et fylke og en kommune. Oslo er det økonomiske og statlige sentrum i Norge. Byen er også et knutepunkt for norsk handel, shopping, banknæring og industri. Det er et viktig midtpunkt for maritime industrier og maritim handel i Europa. Fra og med Januar 2014 har Oslo by en befolkning på 634,000. Det metropolitanske området i Oslo har en befolkning på 1,502,604, hvorav 951,582 bor i de sammenvevde konurbasjonene. Befolkningen øker for tiden med rekordfart, noe som gjør den til den raskest voksende storbyen i Europa. Oslo inntar en bue av land på den nordligste enden av Oslofjorden. Fjorden, som nesten er delt i to av halvøya Nesodden på motsatt side av Oslo, ligger i sør; i alle andre retninger er Oslo omringet av grønne åser og fjell. Det finnes 40 øyer innenfor bygrensen, der den største er Malmøya (0.56 km2), og flere rundt omkring i Oslofjorden. Oslo har 343 innsjøer, der den største er Maridalsvannet (3.91 km2). Dette er også en hovedkilde av drikkevann til store deler av Oslo. Selvom Øst-Norge har et flertall av elver, renner ingen av disse ut i havet ved Oslo. Istedenfor har Oslo to mindre elver: Akerselva (som drenerer Maridalsvannet, som renner ut i fjorden i Bjørvika), og Alna. Det høyeste punktet er Kirkeberget, på 629 meter. Selvom byens befolkning er liten sammenlignet til de fleste Europeiske hovedstader, okkuperer den et uvanlig stort areal av land, hvorav to tredjedeler er verneområder av skog, åser og innsjøer. Dens grenser omfatter mange parker og åpne områder, noe som gir det et luftig og grønt inntrykk. Oslo transport Oslo har Norges mest omfattende offentlige transportsystem. Dette inkluderer den seks-linjede T-banen i Oslo, verdens mest omfattende T-bane per innbygger, den seks-linjede trikken i Oslo og det åtte-linjede togsystemet i Oslo. Trikken opererer innenfor områdene nær sentrum av byen, mens T-banen, som kjører under bakken gjennom byens sentrum, opererer til forsteder lenger unna; dette inkluderer to linjer som opererer til Bærum, og T-baneringen som er koblet til områdene nord for sentrum. Oslo er også dekket med et bussnettverk bestående av 32 bylinjer, såvel som lokale busser til nabofylket Akershus. Oslo Sentralstasjon fungerer som midtpunktet, og tilbyr togforbindelser til mesteparten av de store byene i Sør-Norge såvel som Stockholm og Gøteborg i Sverige. Flytoget opererer langs høyhastighetslinjen Gardermobanen. Drammenbanen kjører under byens sentrum i Oslotunnelen. Noen av byens øyer og nabokommunen Nesodden er forbundet med ferge. Daglige cruiseferge tjenester opererer til København og Federikshavn i Danmark, og til Kiel i Tyskland. Mange av motorveiene passerer gjennom sentrum og andre deler av byen via tunneler. Konstruksjonen av veiene er delvis støttet gjennom en bomring. De store motorveiene gjennom Oslo er Europaveien E6 og E18. Det er tre ringveier, den innerste som er gater og den ytterste, Ring 3 som er en motorvei. Hovedflyplassen som betjener byen er Gardermoen Lufthavn, som ligger i Ullensaker, 47 kilometer fra sentrum av Oslo. Den fungerer som den viktigste internasjonale inngangsporten til Norge, og er den sjette største innenlandske flyplassen i Europa. Gardermoen er et knutepunkt for Scandinavian Airlines, Norwegian Air Shuttle og Widerøe. Oslo er også betjent med to sekundære flyplasser, som tilbyr noen lavprisselskaper, slik som Ryanair: Rygge Lufthavn og Torp Lufthavn, den sistnevnte er 110 kilometer fra byen."
}