{
  "url": "https://www.newworldencyclopedia.org/entry/Vaishnavism",
  "title": "Vaishnavism - New World Encyclopedia",
  "text": "Vaishnavism Vaishnavism (Sanskrit for \"belonging to Vishnu\") is one of the principal traditions of Hinduism that is distinguished from other schools by its acknowledgement of Vishnu (and his associated avatars) as the supreme divinity. The beliefs and practices of Vaishnavism are based largely upon Vedic and Puranic texts such as the Bhagavad Gita, Vishnu Purana, and Bhagavata Purana. Practice in Vaishnavism is also informed by bhakti, an intense form of devotionalism to a personal god, and its history is largely linked to the development of this type of religiosity in India. The followers of Vaishnavism are referred to as 'Vaishnava(s)', sometimes 'Vaishnavites' in English. Vaishnavism is a prominent faction within Hinduism, with the vast majority of adherents situated in India. The Gaudiya Vaishnava branch increased the worldwide distribution of the tradition, largely through the activities of the International Society for Krishna Consciousness (ISKCON). History Early Vasudevism and Krishnaism Vishnu is mentioned in the Vedas but bears little resemblance to the god who is so widely worshipped today. In the Vedas, Vishnu appears as a god of sun and light, and was not widely worshipped. However, by the time of the Upanishads (eighth to sixth centuries B.C.E.), the authority of Vedic religion began to decline, making way for the rise of several non-Vedic cults. Around this time there developed a bhakti cult centered around Vasudeva, a hero of the Vrsni tribe, which seems to mark the first stirrings of Vaishnavism. Another important precursor to Vaishnavism was a cult dedicated to a deified hero in the person of Krishna, religious leader of the Yadavas. This may very well be the same character who is presented in the Chandogya Upanishad by the name of Devakiputra Krishna, a the pupil of the great sage Ghora Angirasa who receives a teaching which he himself would disseminate in the Bhagavad Gita: that life is a sacrifice. Another non-Vedic religious group which would come to wield great impact on Vaishnavism is the cult of Gopala-Krishna, which developed among the cowherding Abhira people. This group attempted to cultivate sensuous love for Krishna parallel to that which was experienced by the mythological gopis, cowherding girls who enjoyed lavish amorous encounters with Krishna. During the seventh to fourth centuries B.C.E., philosophical stagnation within the Vedic tradition engendered the growth of Jainism and Buddhism, and so attempts were made to revivify Vedism. Having already garnered its own heterodox following, the growing Krishnite movement opportunistically made attempts to reconnect with its Vedic roots. Hence, the tradition appropriated the Vedic deity Vishnu, who, although insignificant in the Rg Veda, had been identified as the supreme godhead in the Aitareya Brahmana. The belief that Vishnu took on physical incarnation for purposes of restoring flagging dharma was already long since established by this time, and so Krishna came to be identified as one of these incarnations. Meanwhile, the Vrshis and Yadavas grew closer together, and as a result Krishna and Vasudeva came to be identified with one another as early as the fourth century B.C.E. The truly syncretistic deity that resulted was given the moniker “Bhagavan Vasudeva-Krishna,” and the names Vasudeva and Krishna were eventually used interchangeably to refer to the same figure. Elements of the Gopala-Krishna cult were also subsumed within the growing religion dedicated to Bhagavan Vasudeva-Krishna. Together, Vasudevism and Krishnaism seem to have also synthesized elements of devotional cults dedicated to Arjuna, hero of the Mahabharata, as well as those of Balarama, who is portrayed in the great epic as Krishna's brother. The synthesis of these various elements of Vasudevism, Krishnaism and ultimately Vaishnavism proper is most obvious in the Bhagavadgita. This text affirms the equivalence of Vasudeva and Krishna in its the tenth chapter (v. 37), where Lord Krishna claims his identity with Vasudeva. Krishna's status as an incarnation of the supreme god Vishnu is also well-established at numerous instances in Gita, perhaps no more lucidly than in verses 4.6-7, when Krishna states: - Though (I am) unborn, and My self (is) imperishable, though (I am) the lord of all creatures, yet establishing Myself in My own nature, I come into (empiric) being through my power (maya). - Whenever there is a decline of righteousness and a rise of unrighteousness, O Bharata (Arjuna), then I send forth (reincarnate) Myself.[1] The Narayana Cult Early Vaishnavism further strengthened its connection to the Vedic tradition with the absorption of the Narayana cult, which originated in the region of Badari, the northern ridge of the Hindu Kush arc.[2] Narayana is considered the founder of the Pancaratras, a form of Tantric Vaishnavism and one of the earliest Vaishnava sects along with the Bhagavatas, the name given to worshipers of Vasudeva/Krishna. Pancharatas worshipped Narayana, and believed in the notion of vyuhas, a doctrine comparable to that of the avataras in which the highest Self, the individual self, mind and egoism are all considered emanations (rather than incarnations per se) of God. The Bhakti Movement While Vaishnavism seems to have been largely ignored or rejected by the kingdoms of the Vakatakas and Bharasivas in the second and third centuries C.E., by the time of the Guptas (fourth to seventh centuries CE), it had been adopted as the royal religion. During this time Vaishnava literature in its Puranic and the Tantric forms flourished. By the time the Gupta dynasty had been dissolved, Vaishnavism had divided into numerous sects and subsects, every one of which popularized distinct variations of bhakti, constant with the rise of that movement which was building in South India. The writings of the the 63 Nayanars and the 12 Alvars nurtured the incipient bhakti movement in this region under the Pallavas and Pandyas in the fifth to seventh centuries C.E. Of these two foundational groups, the Alvars were explicitly Vaishnavite, devoting the majority of their writings to Vishnu and his incarnations. Their poems in praise of Vishnu in the vernacular Tamil are collectively known as Naalayira (Divya Prabandha), and are still recited in temple rituals today. The path of devotion as expounded by these mystics would later be incorporated into the Visistadvaita and Dvaita philosophical systems of Ramanuja and Madhva respectively, both of which held Vishnu as the supreme personal divine. With the outgrowth of the bhakti movement there arose the proliferation of devotional literature in vernacular prose and poetry in a number of other ethnic languages of the various Indian states or provinces. In what is now Karnataka, for instance, the Bhakti movement engendered a burst of poetic Kannada literature in praise of Lord Vishnu. Some of its leaders include Purandara Dasa and Kanaka Dasa, whose contributions were essential to the development of Carnatic music. In the period between the fourteenth-seventeenth centuries, the bhakti movement spread northward into Muslim-dominated India due to the efforts of a loosely associated group of Vaishnavite teachers including Caitanya, Vallabha, Mirabai, Kabir, Tulsidas, Tukaram and several others. Their teachings cast aside the heavy burdens of ritual and caste, along with the traditionally subtle complexities of philosophy in favor of the simpler expressions of their overwhelming love for God. While devotional religion in the South was centered upon both Shiva and Vishnu (in all his forms), the Northern devotional movement was more or less centered on Rama and Krishna (as well as the latter's spouses, Radha and Rukmini), both of whom were incarnations of Vishnu. Particularly was Tulsidas' Ramacharitmanas, a recasting of the Rama story in primarily devotional terms. Such works allowed Vaishnavism to gain popularity among the masses, and eventually even royal patronage. Although initially considered unorthodox as it rebelled against caste distinctions and disregarded Brahmanic rituals, Vaishnavism in the course of time became 'orthodox' for these reasons, and continues to be one of the most important modes of religious expression in modern India. Due to the recent efforts of Bhaktivedanta Swami Prabupadha and the International Society for Krishna Consciousness which he founded, Vaishnvaism has spread beyond India and can now be found throughout the globe. Theology Vishnu: The Supreme The principal belief of Vaishnavism is the recognition of Vishnu (also known as Narayana) as the supreme deity. This principle is also distributive to the many avatars (incarnations) of Vishnu as listed within the Puranas, especially Krishna and Rama, and sometimes their consorts, but excludes all other personalities referred to as gods in the Vedas or similar texts (i.e Ganesha, Surya, Durga and so forth). These dieties are instead classified as 'demi-gods' or devas. Shiva, the other major male deity to whom monotheistic devotion is dedicated in the Hindu pantheon, is also viewed as subservient to Vishnu, although it is understood within the tradition that he is also above the category of an ordinary living being (jiva) or demi-god. Bhakti Worship Any Hindu religious movements in which the main spiritual practice involves the development of deep loving devotion to God is classified under the heading of the Bhakti movement. These movements are usually monotheistic in their overarching purview, and generally involve worship of Shiva or Shakti if not Vishnu. Although Vaishnava theology includes the central beliefs of Hindusim such as reincarnation, samsara, karma, and the various Yoga systems in order to escape the cycle of rebirth, the greatest emphasis is placed upon on personal devotion to Vishnu. This personalistic approach is largely based in the Vaishnava relationship between human beings and god, in which the devotee is most always conceived of as at least partially if not fully distinct from Lord Vishnu during their acts of worship. Unlike other schools of Hinduism such as those based in Advaita Vedanta, whose primary goal is liberation (moksha) via union with the Supreme Brahman, the ultimate goal of Vaishnava practice lies in the eternal life of bliss (ananda) in service to Vishnu or one of his many avatars in the heavenly realm of 'Vaikuntha'. Initiation Membership within a group of followers and under the tutelage of a guru is indispensable in Vaishnavism. Vaishnavas commonly follow a process of initiation (diksha) given by a guru under whom they are trained in order to fully understand Vaishnava practices. At the time of initiation the disciple is traditionally given a specific mantra, which they will then repeat, either out loud or within the mind, as an act of worship to Vishnu or one of his avatars. The system of receiving initiation and training from a spiritual master is based on injunctions throughout scriptures held as sacred within the Vaishnava traditions: Just try to learn the truth by approaching a spiritual master. Inquire from him submissively and render service unto him. The self-realized souls can impart knowledge unto you because they have seen the truth.(Bhagavad Gita)[3] This process is absolutely essential for proper devotion: One who is initiated into the Vaishnava mantra and who is devoted to worshiping Lord Vishnu is a Vaishnava. One who is devoid of these practices is not a Vaishnava. (Padma Purana)[4] Scriptures As an orthodox Hindu tradition, Vaishnavism is largely based in the Vedas. In addition, a number of other texts have rose to prominence, including the two great Epics and various Puranas and Upanishads. While many schools like Smartism and Advaitism encourage philosophical and metaphorical interpretations of these important texts, Vaishnavism stresses their literal meaning (mukhya v_itti) as primary, while indirect meaning (gau_a v_itti) is decidedly secondary. In addition to these texts listed here, Vaishnava traditions also consider the writings of previous teachers in their respective lineage or sampradya (see below) as authoritative interpretations of scripture. Epics The most important text in the broad corpus of Vaishnava scripture is the Mahabharata, India's \"Great Epic\" which centers upon the life of Krishna and details the story of a dynastic war between two sets of cousins, the Pandavas and the Kauravas. Krishna is aligned with the former, who embody righteousness. The Mahabharata includes such fundamental texts as the Narayaniya and the Harivamsa, and most importantly a portion individually known as the Bhagavad Gita. The philosophical and spiritual highlight of the epic, the Gita details a conversation between Arjuna and Krishna prior to the final conflict on the battlefield of Kurukshetra. Because it summarizes virtually every major Vaishnava teaching, the Bhagavad Gita is widely studied as the definitive theological textbook of Vaishnavism. The Ramayana describes the story of Vishnu as Rama or Ramachandra, and is taken as a history of the 'ideal king', who rules based upon the principles of dharma, that is, morality and ethics. Rama's wife Sita (herself an incarnation of Lakshmi, his brother Lakshman and his anthropomorphic monkey-servant Hanuman all play key roles within the Vaishnava tradition as examples of proper Vaishnava morality, devotion and comportment. Meanwhile, Ravana, the evil king of Lanka who plays antagonist to Rama, is considered the archetypal anti-Vaishnava. The two great epics are essential to Vaishnava philosophy and culture, since they recount key events in the earthly lives of two of Vishnu's most important incarnations, Rama and Krishna, respectively. As a result of their influence, both works are often re-enacted in part as dramas by followers of Vaishnavism, especially on festival days concerning each of the specific avatars. In fact, television versions of both the Ramayana and Mahabharata are among the most popular broadcasts ever shown on Indian stations. Puranas Of the 18 Puranas, six (the Vishnu, Narada, Bhagavata, Garuda, Padma and Varaha Puranas) are identified as specifically Vaishnava in scope. The Bhagavata Purana is by far the most important among these for followers of Vaishnavism, as it lovingly recounts the exploits and deeds of Vishnu's Avataras. For this reason, certain aspects of the text have been elaborated at length in the Bhakti tradition, such as the tenth canto which narrates Krishna's childhood. This text marks the first appearance of the devotionalism in Sanskrit literature, particular that dedicated to Vishnu. In fact, the text seems to have been heavily influenced by the works of the Alvars, with some portions of the text appearing to be direct translations from the original Tamil into Sanskrit. All of the famous Vaishnava sects which followed, most notably the four sampradayas (see below) provided commentaries upon this text. Upanishads Of the 108 Upanishads listed in the Muktika, fourteen are considered Vaishnava Upanishads. These are the Narayana Nṛsiṃhatāpanī, Mahānārāyaṇa, Rāmarahasya, Rāmatāpaṇi, Vāsudeva, Avyakta, Tārasāra, Gopālatāpani, Kṛṣṇa, Hayagrīva, Dattātreya, Gāruḍa and Kali-Santarana Upanishads. These texts generally expound the nature of Brahman from the Vaishnava perspective and also promote practices such as meditation and, of course, the worship of Vishnu. Notable among these are the Hayagrīva Upanishad, wherein Brahma explains to Narada the kind of benefits received by those who worship Vishnu, and the Gopālatāpani Upanishad, in which Lord Brahma explains to sages the proper procedures for worshipping the Krishna avatar. Divya Prabandha The Nalayira Divya Prabandha is a divine collection of 4,000 verses composed before the eighth century C.E.[5] by the 12 Alvars, and was compiled in its present form by Nathamuni during the ninth to tenth centuries. The songs were purportedly sung by the Alvars at sacred shrines known as Divya Desams, and so the content centres upon the praise of Sriman Narayana and his various forms. The work represents the first attempt at canonization of the works of the 12 Vaishnava poet saints, and is still popular today in South India. Throughout this region, especially in Tamil Nadu, the Divya Prabhandha is considered to be equal to the Vedas, and has been awarded the epithet Dravida Veda. In many temples, the chanting of the Divya Prabhandham remains a focus of the daily service. Orders and Lineages Vaishnavas are typically divided into two major (though not mutually exclusive) sects: that of the Bhagavatas and that of the Pancharatas. Bhagavatas Bhagavatas (from the Sanskrit \"having shares\") usually refers to Vaishnavite bhaktas, or followers of bhakti who are dedicated specifically to Vishnu. Under this term are included many diverse groups of practicioners who together do not have a specific set of ritual, but share the characteristic emphasis upon the cultivation of a personal relationship with the godhead. Historically, Bhagavatas seem to follow from the tradition of Vasudeva-Krishna-Vishnu worship, with early inscriptional references dating back as far as 115 B.C.E.[6] Within Bhagavatism there are four main disciplic lineages (or sampradayas), which follow subtly different philosophical systems regarding the relationship between the soul (jiva) and God (Vishnu), although each of which traces its roots back to a specific Vedic personality. Within the Bhagavata fold are also included such Vaishnava revivalists as Caitanya Mahaprabhu and Ramanandi. Four Sampradayas The Four major sampradayas include the: - Lakshmisampradaya, also known as Srivaishnavism, represents one of the most important extant Vaishnaiva traditions, having retained its prominence until the present. The tradition was espoused most notably by the mystic saint Ramanuja (1017–1137), who perfected the philosophy of Yamunacharya. Ramanuja propounded a system of Visistadvaita or \"qualified nondualism,\" which connects the self to Brahman as in Advaita, but as an incomplete part rather than a full equivalent. The soul is characterized by its own independent reality and as such, remains subordinate to the supreme cosmic principal, the qualities of which it can to experience as a result of its devotion. Vishnu bestows moksha upon the devotee by his grace, though it is through Vishnu's consort Sri (Lakshmi) that grace is bestowed; that is, Lakshmi serves as a mediatrix between god and human, using her compassion in order to win Vishnu's forgiveness for the devotee. By the fourteenth century, the Srivaishnava tradition had bifurcated into two branches, the northern Vadagali group which was based upon the Sanskritic tradition, and the Tengali group, which maintains a balance of Sanskrit and Tamil influence. These branches have been labeled the \"school of the monkey\" (Markatanyaya) and \"school of the cat\" (Marjanyaya) respectively because of their contrasted conceptualizations of faith and grace. The Vadagali group believes that one must cling to god much like an infant monkey clings to it's mother—that is, by putting forth effort to receive god's grace. The Tengali, meanwhile, believe that one must put forth no effort to acquire god's grace—like a kitten, they must rely entirely on the mother-cat to pick them up and carry them to safety. - Rudrasampradaya was reputedly founded by the dualist Visnusvamin, a thirteenth-century philosopher and saint who taught that loneliness was the sole factor which impelled Brahma to create the universe. It was Vallabhacharya (1479-1531) who gave Visnuvamin's teachings new life, expounding the philosophy of Shuddhadvaita (\"pure nondualism\"). This philosophy represented a correction of Sankara's Advaita since it held that maya, the power of illusion, is not separate from Brahman bur rather is a necessary part of it. Individuals are lost in the folly of ego, and it is by God's grace alone that one can obtain release from this bondage, thereby attaining Krishna's heaven. This heaven is far above the so-called \"heavens\" of Brahma, Vishnu and Shiva, for Krishna is himself the eternal Brahman, according to Vallabhacharya. Vallabha decried rote ritualism, and instead claimed that all spiritual actions should be characterized by a sense of playful effortlessness. This inspired the raslila dramatic performances which were associated with the Vallabhacaris. - Brahmasampradaya was founded by Madhvacharya (1238-1317) and was based almost solely upon the Bhagavata Purana. Apparently, a formal Brahmasampradaya which descended from a line of Vishnu-worshipping Smarta Brahmans predated Madhva's school in western Karnataka, and probably influenced his thought. Madhva's position was thoroughly dualistic (and therefore dubbed Dvaita), in that he asserted an irreconcilable differentiation between the individual soul the ultimate Godhead, who he held to be Vishnu. The goal of a practicioner of this system should not be union with the divine, but rather participation in the divine. Great leaders of the Vaishnava Bhakti movement in Karnataka like Purandara Dasa, Kanaka Dasa, Raghavendra Swami, and many others as distant as the Bengali Caitanya Mahaprabhu were influenced by Madhva's dualist teachings. - Sanakadisampradaya was founded by Nimbarka, a Telegu brahman who inhabited Vrndavan during what was probably the thirteenth century. Nimbarka expanded upon Shankara, Ramanuja and Madhva by way of his dvaitadvaita doctrine, the teaching of \"duality in unity.\" Here difference refers to the existence of soul and matter as separate but dependent upon God, while “non-difference” refers to the fact that it is impossible for soul and matter to exist independently of God. Central to the soteriological aspects of Nimbarka's teachings was the concept of prapatti or \"surrender,\" which was the first step toward rectifying one's relationship with God. Devotees must fully surrender to the grace of god, thus doing way with any notion of personal efficacy. With this in place, the Bhagavan will then grant the devotee direct perception of his glory. Although the Sanakadisampradaya's popularity was exclusive to an area surrounding Mathura as well as Agra and Bengal, it did manage to wield some influence on later thinkers, particularly on Caitanya. Gaudiya Vaishnavism (referring to the geographical region of Gauda-desh, present day Bengal/Bangladesh where the movement developed) is another important Bhagavata branch originally set in motion by Caitanya Mahaprabhu (1486-1534) in sixteenth-century Bengal. Caitanya's religious sensibilities were marked by fervent love for the personalized god Krishna, sublimated in the form of sankirtana: public dancing, chanting, singing and ranting upon the god-man as well as his consort Radha and his incarnations. The philosophical basis of Gaudiya Vaishnavism is largely rooted in the Bhagavad Gita and Bhagavata Purana, as well as other Puranic and Upanishadic scriptures such as the Isha Upanishad. The school classifies itself as a monotheistic tradition, since the incarnation of Krishna actually transcends the very deity from which he was originally said to emanate. That is, even Vishnu is considered an incarnation of the one Supreme God, Krishna in his personal form. This tradition expanded beyond India due to the efforts of A.C. Bhaktivedanta Swami Prabhupada, a member of the Gaudiya disciplic lineage and founder of the the International Society for Krishna Consciousness (ISKCON). He arrived on the shores of New York City in 1965 at the age of 69, founding his first ISKCON center there in the summer of the following year. This group maintained the Gaudiya focus on singing Krishna's holy names, such as 'Hare', 'Krishna' and 'Rama', which it afforded it the moniker of the Hare Krishna movement. The following years saw the construction of numerous ISKCON throughout North America and Europe as the movement gained a dedicated following. Prabhupada eventually returned to India in 1970 with a troupe of disciples from the west, and established further ISKCON temples in major Indian centers such as Bombay and Vrindavan, as well as international headquarters in Mayapura. The Ramanandi movement The Ramanandi movement is named for its main proponent, Ramananda (c. fourteen-fifteenth century), originally a successor of Ramanuja. Ramananda eventually placed devotional focus upon Rama, whom he considered supreme Lord, and his wife Sita. He taught that liberation from the cycle of rebirth could be attained only through love for and devotion to Rama and his consort, and so devotional activity was largely based upon repetition of Rama's sacred name. Ramananda's ashram in Varanasi became a powerful centre of religious influence, from which his ideas spread far and wide among Indians of all ranks. One of the reasons for the great popularity of Ramananda's movement was precisely this equalitarian ethic, as well as his denunciation of Sanskrit. In it's place, Ramananda used vernacular language for the composition of his hymns, laying the foundations for the tendency among northern Indians to produce literary texts in local languages. Among the group's most prominent members were Tulsidas, Kabir, Mirabai and Raidas. The movement has survived until today and is currently centered in Ayodhya. Pancharatras The other major Vaishnaiva movement or sect is the Pancharatras, who are typically thought to have been focused upon the worship of Narayana, and are just as often considered a manifestation of Tantric Vaishnavism. The name is of obscure derivation (much like the movement itself), literally translating as \"five nights,\" perhaps referring to the ascetic practice of spending five nights in the wilderness for every one night spent in city or town.[7] This would seem to be in accordance with the typical scholarly opinion that followers of the Pancaratras existed on the fringes of Aryan culture, as opposed to the Bhagavatas who were more firmly rooted in Vedism. It has also been proposed that the Pancatantrikas were actually among the first Bhagavata sects, and so any solid distinction between the two groups may be spurious. One of the distinguishing features of the Pancharata school is their philosophical stance, which is concerned with affording god a monistic presence within the physical world without having the physical world exert any limitation upon him. One doctrine describing such a balance in god is that of the vyuhas or emanations of the divine. These include: the Vasudeva (the highest Self), Samkarsana (the individual self), Pradyumna (mind) and Aniruddha (egoism). This teaching is based upon appropriations of Samkhya philosophy whereby Vasudeva is the supreme purusha which gives rise to the Samkarsana when brought into contact with the material (prakriti) body. The Samkarsana is responsible for the production of the Pradyumna, and from the Pradyumna comes the Aniruddha, the creative agent. The highest spiritual attainment is not a metaphysical union with god, but rather a profound experience of devotion during which the separation of the individual of god is not dissolved. Pancharatra practice is based upon a corpus of texts known as the Pancharatra Agamas, which propound the importance of image worship and prescribe the specific means by which to construct and consecrate temples and icons. As such, devotees of this group placed particular emphasis upon visual representations of Vishnu and his various incarnations. Cultivating devotion via reverence for these images, Pancharatras are blessed with more and more knowledge by the grace of Vishnu. Such understanding is also aided by guru, who guides the student until they are ready for full initiation into the Pancharatra fold. Pancaratra ideas such as the notion of unity but not equivalence between god and humans, as well as the focus upon devotion, wielded considerable influence upon the Srivaisnava and subsequently the Ramanandi traditions. Worship Considering the focus upon devotion to a personal god, it is not surprising the importance afforded to ritual image worship in Vaishnavism. Representations of Vishnu in images and rituals are not simply symbolic in nature but are considered actual realities. The same goes for images of his avatars, particularly those of Rama and Krishna, who are also offered reverence as the supreme godhead. Pujas often call upon Vishnu and his various avatars as helpers who can assist devotees in escaping any given form of distress or evil. Worshipping such images by prostration and offerings of incense and light is considered essential for gaining such grace. Material objects are considered a necessary means for communion with Vishnu, particularly when they are touched by the image of the diety. Also, Vaishnavas may eat leftovers of food offerings made to their god. All devotions must be dedicated to Vishnu; unlike many other schools of Hinduism, Vaishnavas who worship other gods are considered heretics, as it is considered only Vishnu who can grant liberation. In addition to anthropomorphic murtis, Vishnu is also worshipped via natural phenomena such as the Tulasi plant (see below) and the salagrama, a granite pebble from the Gandaki river in Nepal. Another important aspect of worship is the mantra-japa, the practice of repetitive prayer. Most popular for Vaishnavas is the Vishnu-mantra, which involves repitition of the name of Vishnu. Vaishnavas also perform highly emotive congregational singing known as Sankirtana, and so gatherings of devotees commonly involve the singing of Vishnu's name's (bhajan), as well as the performance of hymns which recount the mythological feats of Vishnu and his avatars. Festivals Popular Vaishnavite festivals include: - Vaikunta Ekadasi occurs in the month of Dhanurmasa (December-January), and is centered around the necessity of devotion and austerity in service of Vishnu. Thus, Vaishnavites enter into strict fasting and abstinence on this day, along with prayer and meditation. Devotees consider their austerities to be among the most important means in reaching the ultimate destination of Vaikuntha. Some schools of thought believe that it was on this day that Sri Krishna delivered his sermon as it is presented in the Gita to Arjuna. While Vaikunta Ekadasi is observed in all Vaishnava temples, the day is particularly special at the Sri Ranganatha temple at Srirangam in Tamil Nadu, where Lord Ranganatha is thought to appear for the purpose of delivering blessings upon the congregation. - Rama Navami is a festival dedicated specifically to Vishnu's avatar Rama, though it is still widely celebrated by all Vaishnavas. This event, occuring on the ninth day of the month of Chaitra (March-April), commemorates Vishnu's birth through the womb of Kaushalya as Rama. Temples are ornately decorated and the image of Lord Rama is lavishly adorned, as the god-man is said to fulfill the all prayers directed toward him on this day. Excerpts from Tulsidas' \"Ramacharitamanas\" are recited aloud in temples and to large public gatherings. Devotees also observe a strict fast on this day. At Ayodhya, the birthplace of Sri Rama, an immense fair is held on this day; in South India, meanwhile, the festival is stretched over nine days. - Krishnajanmastami is another important celebration commemorating the birthday of an avatar, in this case Krishna. Janmashtami is celebrated on the eighth day of the dark fortnight in the month of Bhadon (August-September) throughout the whole of north India. Appropriately, cribs, dolls, and other decorations are used to depict stories of Krishna's childhood. As is typical of Vaishnava festivals, devotees fast for the duration of the day. In the evening songs are sung in honor of the deity and end promptly at midnight, the moment at which Lord Krishna is said to have been born. At this point, an elaborate ceremony replicates the birth of Lord Krishna. Those keeping the fast may eat only after this ritual has concluded. Janmashtami is celebrated with particular zeal at Mathura, the traditionally accepted birthplace of Lord Krishna.[8] Symbols Tilak The tilak is a mark of sectarian affiliation worn by Hindus upon the forehead. Tilak varies in design according to the group an affiliate belongs to, and so the various Vaishnava sampradayas each have their own distinctive marking which depict the siddhanta of their particular lineage. In the Vallabha Rudra-sampradaya, for instance, the tilak worn is generally a single vertical red line which represents Yamuna devi, a consort of one of Krishna's incarnations. The Madhva sampradaya mark is composed of two vertical lines representing Krishna's 'lotus feet' with a vertical black line in between. This intermediary line is made from the daily coal of the yajna-kunda (fire sacrifice) performed for the benefit of Narayana or Krishna. In the Gaudiya Vaishnava tradition, the tilak is basically identical to that of the Madhva lineage, with the exception that it is usually made out of mud from Vrindavan. Members of the Sri Vaishnava tradition form tilak with two lines representing the feet of Narayana, with a red line in the middle which represents Lakshmi. In the Nimbarka Sampradaya, the tilak starts at the bridge of the nose and continues as two vertical lines to the top of the forehead, and must be made with the clay from Gopi Kunda lake in Dwarka, Gujarat, as is prescribed in the Vasudeva Upanishad. Within these lines, between the eyebrows is a black dot, made from the slate found in Barsana, Uttar Pradesh, the sacred birthplace of Radha. This is said to represent God as the union of Radha and Krishna. Tulasi Tree A recurrent symbol in Vaishnavism, particularly the Gaudiya lineage, is the Tulasi tree. This tree is named for Tulasi-devi, one of Krishna’s most devoted gopis, of whom the Tulasi plant is considered a manifestation or expansion. The Tulasi plant and its leaves figure prominently in Vaishnava services, wherein devotees water the Tulasi tree as an illustration of faith in its healing power. Ritual waterings occur daily. Also, Tulasi leaves are collected and given to icons of Krishna as an offering. Outside of the temple, the Tulasi tree can be found in virtually all Vaishnava homes. Chakra One of the earliest ways in which to identify Vishnu was the circular sudarsana-cakra, from the Sanskrit term for \"wheel.\" In the specific context of Vishnu, this refers to the sharp, spinning disk used by Vishnu as a weapon. It is almost always pictured in one of the many arms of Vishnu or those of any of his incarnations. Vishnu often employs the cakra to decapitate demons and other agents of evil; accordingly, the weapon has been associated by Vaishavas with Vishnu's capacity as preserver and protector of the universe. More generally, the wheel is probably a solar symbol, and so it links the later Vishnu with his precursors in the Vedas. The spinning nature of the disk may suggest Vishnu's status as the axis of the universe around which everything else rotates. Significance Vaishnavism represents one of the largest branches of contemporary Hinduism. Vaishnavism stands out among the other major branches in that it represents the closest continuation of the Vedic tradition, and therefore speaks to the staying power of that ancient system of thought. The sheer quantity and variety of religious practices and mythological figures subsumed under the divine personage of Vishnu speaks to the remarkable synthetic ability of the Vaishnava tradition. Due in no small part to its syncretistic history, Vaishnavism has been of particular interest to scholars, both religious and secular, for centuries. In recent decades Vaishnava scholarship has also been taken on by a number of academic institutions in Europe, such as the Oxford Centre for Hindu Studies and Bhaktivedanta College, and has even spawned an academic journal, the Journal of Vaishnava Studies (JVS). And, thanks to the efforts of the Hare Krishna movement, Vaishnavism has proven itself not just to be a religion of Hindus of India and in the diaspora, but truly a religion of the world. Notes - ↑ S. Radhakrishnan (trans.) The Bhagavadgita (Thorsons, 1995). - ↑ R.N. Dandekar, \"Vaishnavism: An Overview.\" In Mircea Eliade (ed.), Encyclopedia of Religion, 170. - ↑ Bhagavad Gita 4.34 Bhaktivedanta Vedabase. - ↑ Swami B.G. Narasingha, Who is a Vaishnava? Retrieved July 4, 2020. - ↑ Nalayira divya prabandham in tamil script Naalaayira Divya Prabandham. Retrieved July 4, 2020. - ↑ G.R. Welbon, \"Vaishnavism: Bhagavatas\" Encyclopedia of Religion. Edited by Mircea Eliade, (New York: MacMillan Publishing, 1987, ISBN 0029098505), 172. - ↑ J.A.B. van Buitenen (trans.). Y_muna’s _gama pr_m__yam (Madras: Ramanuja Research Society, 1971), 14-15. - ↑ Shreya Suresh Kumar, Janmashtami Celebrations in Mathura India.com, August 24, 2016. Retrieved July 4, 2020. ReferencesISBN links support NWE through referral fees - Bhargava, P.L. India in the Vedic Age. Lucknow: Upper India Publishing, 1971. ASIN B000ZU5N52 - Dallapiccola, Anna. Dictionary of Hindu Lore and Legend. London, UK: Thames and Hudson, 2002. ISBN 0500510881 - Dandekar, R.N. \"Vaishnavism: An Overview.\" Encyclopedia of Religion. Edited by Mircea Eliade. New York: MacMillan Publishing, 1987. 168-171. ISBN 0029098505 - Dimmitt, Cornelia, and J.A.B. van Buitenen. Classical Hindu Mythology: A Reader in the Sanskrit Puranas. Philadelphia, PA: Temple University Press, 1978. ISBN 0877221170 - Doniger, Wendy (ed.). Pur__a Perennis: Reciprocity and Transformation in Hindu and Jaina Texts. Albany, NY: State University of New York, 1993. ISBN 0791413829 - Famighetti, Robert. The World Almanac and Book of Facts. Mahwah, NJ: World Almanac Books, 1997. ISBN 0886878012 - Flood, Gavin. An Introduction to Hinduism. Cambridge, UK: Cambridge University Press, 1996. ISBN 0521438780 - Handoo, Jawaharlal (ed.). Folklore in Modern India. Mysore, IN: Central Institute of Indian Languages, 1998. ISBN 817342053X - Hardy, Friedhelm. Viraha-Bhakti - The Early History of Krsna Devotion in South India. Delhi: Oxford, 1983. ISBN 0195612515 - Jagadeesan, N., N.N. Bhattacharya (ed.). \"The Life and Mission of Karaikkal Ammaiyar,\" Medieval Bhakti Movements in India. New Delhi: Munishiram Manoharlal, 1989. - Kaushal, Molly (ed.). Chanted Narratives - The Katha Vachana Tradition. New Delhi, IN: Indira Gandhi National Centre for the Arts, 2001. ISBN 8124601828 - Mackenzie, Brown. The Triumph of the Goddess - The Canonical Models and Theological Visions of the DevI-BhAgavata PuraNa. Albany, NY: State University of New York Press, 1990. ISBN 0791403637 - Majumdar, R.C. and A.D. Pusalker. (eds.). The history and culture of the Indian people. Volume I, The Vedic age. Bombay: Bharatiya Vidya Bhavan, 1951. - Moghe, S.G. (ed.). Professor Kane's contribution to Dharmasastra literature. New Delhi, IN: D.K. Printworld (P) Ltd, 1997. ISBN 8124600759 - Monier-Williams, Monier. A Sanskrit-English Dictionary. New Delhi: Asian Educational Services, 1999. ISBN 8120603699 - Pargiter, F.E. Ancient Indian Historical Tradition. Motilal Banarsidass, 1997. ISBN 978-8120814875 - Schouten, Jan Peter. Goddelijke vergezichten - mystiek uit India voor westerse lezers. Baarn, NL: Ten Have, 1996. ISBN 9025946445 - Shulman, David Dean. Tamil Temple Myths - Sacrifice and Divine Marriage in the South Indian Saiva Tradition. Princeton, NJ: Princeton University Press, 1980. ISBN 0691064156 - Thapan, Anita Raina. Understanding Ga_apati: Insights into the Dynamics of a Cult. New Delhi: Manohar Publishers, 1997. ISBN 8173041954 - Thurston, Edgar. Castes and Tribes of Southern India BiblioLife, 2009. ISBN 978-1113560308. - Radhakrishnan, S. (trans.). Bhagavad-gita. Thorsons, 1995. ISBN 978-1855384576 - van Buitenen, J.A.B., (trans.). Y_muna’s _gama pr_m__yam. Madras: Ramanuja Research Society, 1971. - Welbon, G.R. \"Vaishnavism: Bhagavatas.\" Encyclopedia of Religion. Edited by Mircea Eliad"
}