{
  "url": "https://css-tricks.com/",
  "title": "CSS-Tricks - A Website About Making Websites",
  "text": "No Hassle Visual Code Theming: Publishing an Extension You’d think that publishing a VS Code extension is an easy process, but it’s not. You have to publish your theme in at least two places. You’d think that publishing a VS Code extension is an easy process, but it’s not. You have to publish your theme in at least two places. Powered by DigitalOcean I’ve always thought that creating a VS Code theme was a lot of work. But lo and behold, it took less than six hours to get it working, then a day or two to polish up my final tweaks. Neither Chrome, Safari, nor Firefox have shipped new features in the last couple of weeks, but fear not because leading this issue of What’s !important is some of the web development industry’s best educators with, frankly, some killer content. The new ::search-text pseudo (Chrome 144) matches are yellow while the current target (::search-text:current ) is orange, but ::search-text enables us to change that. Stu Robson’s ReliCSS (clever name!) tool can excavate outdated CSS in your codebase that have modern CSS solutions. Accessibility advice around modals have commonly taught us to trap focus within the modal. Upon further research, it seems like we no longer need to trap focus within the <dialog> (even in modal mode). # Soon we’ll be able to implement multiple, comma-separated borders and outlines for a single element. # Chrome Canary trials <meta name=text-scale> , making OS-level text scaling work on the web. # Introducing: CodePen 2.0! # .element { width: abs(-200px); } .element { view-timeline-axis: x; /* horizontal axis */ } .element { view-timeline-inset: 200px 20%; } .element { animation-range: cover; } .element { filter: blur(5px); } .element { corner-shape: superellipse(2); } .element { corner-shape: scoop; } .element { rotate: asin(-0.5); } .element { rotate: acos(0.5) } .element { rotate: atan(1); } .element { background-image: cross-fade(url(a), url(b)); }"
}