{
  "url": "https://www.sportingnews.com/us/nascar/news/nascar-clash-channel-time-schedule-stream-2025-race-bowman-gray/5c09beb5928ba6c505fadb36",
  "title": "What channel is the NASCAR Clash on today? Start time, TV schedule, live streams to watch 2026 race at Bowman Gray | Sporting News",
  "text": "NASCAR fanatics, the wait is finally over. The 2026 Cup Series is kicking off at Bowman Gray Stadium with the Cook Out Clash. After relocating to Winston-Salem, North Carolina last year, the Clash remains a highly anticipated event on the racing schedule. While the competition will be hot, the temperatures will be cold after a winter storm hit the Carolinas this weekend and pushed the race to Wednesday. The Clash will be the perfect debut to the 2026 NASCAR Cup Series, bringing all the best racers together for 200 laps at historic Bowman Gray Stadium. Chase Elliott is the defending champion, but who will take the checkered flag this year? Here's everything you need to know about NASCAR Clash 2026, including TV channel and streaming options for the race at Bowman Gray. What channel is the NASCAR Clash at Bowman Gray on today? - TV channel: Fox - Live stream: Fubo Fans can watch the 2026 Cook Out Clash live on Fox or stream the race on Fubo. Fubo offers a free trial for new subscribers, so you can try the service before you buy. Stream ESPN, ABC, CBS, Fox and 100+ top channels of live TV and sports without cable. (Participating plans only. Taxes and fees may apply.) NASCAR Clash at Bowman Gray start time - Date: Wednesday, Feb. 4 - Time: 6 p.m. ET The NASCAR Cook Out Clash's main event takes place on Wednesday, Feb. 4 at 6 p.m. ET at Bowman Gray Stadium in Winston-Salem, North Carolina. NASCAR Clash 2026 radio station Fans can listen to the NASCAR Clash 2026 on SiriusXM. The race will be broadcast on channel 90. New subscribers can listen to SiriusXM for free for four months. Listen to live NFL, MLB, NBA and NHL games, plus NASCAR, college sports and more. Stay updated with all the news and get all the analysis on multiple sport-specific channels. NASCAR Clash at Bowman Gray schedule 2026 Wednesday, Feb. 4 NASCAR Cup Series schedule 2026 (All times Eastern) NASCAR Cup Series playoff race schedule 2026 (All times Eastern)"
}