{
  "url": "https://people.howstuffworks.com/what-is-friendship.htm",
  "title": "What Is Friendship? | HowStuffWorks",
  "text": "For all the attention we pay to love stories, some of the most compelling tales (both fiction and not) are those of very best friends, like Thelma and Louise, Woody and Buzz and even Captain Kirk and Spock. No matter what, these besties had each other's backs through thick and thin, despite so many bumps in the road along the way. But, much like romance, if you've ever tried to make a new friend and things just didn't click, it's likely because one of the basic components of friendship simply wasn't there. \"Friendships are relationships that involve two very critical dimensions – interdependence and voluntary participation,\" explains Northern Illinois University psychologist and friendship expert Dr. Suzanne Degges-White in an email interview. As anyone who's ever been in a friendship knows, it's a complex process and experience. \"True friendships are hallmarked by each member's desire to engage with the other – it's about mutual interest in one another's experiences and thoughts, as well as a sense of 'belongingness' and connection,\" she says. \"Friendships require reciprocity – of admiration, respect, trust, and emotional and instrumental support.\" Advertisement That's all well and good, but if a potential new friend doesn't see the same joyous charms in you, it's unlikely that anything deep and lasting will come of it. That said, there's no telling when and where a friendship will develop. Often, they arise from a shared interest or hobby, and people are typically drawn together because they're in the same stage of life, like new parents or retirees. People of similar backgrounds and cultures also tend to come together by bonding over shared lifelong experiences. Although most of these relationships take time to get really deep, occasionally friendship is more like a lightning strike. \"Sometimes you can be in a big group of new people and you catch someone's eye and it's like 'boom!' – instant friendship,\" Degges-White says about an experience she's termed the \"clicking phenomenon.\" \"It's kind of like that burst of 'love at first sight,' but it's a friendship, not romance.\" Indeed, quality friendships are extremely important to our general happiness. A 2017 study in the journal Personal Relationships found that the presence of strong friendships is actually more indicative of overall health and happiness in old age than even family involvement and support! The benefits of friendship in general, however, are lifelong. Research has shown that people with good friends often feel happier, less stressed and more like they belong than those without. Having a strong network of buddies also increases self-confidence, plus they provide much-needed emotional support during trying times, like illness, loss of a loved one or divorce [source: Mayo Clinic Staff]. In other words, friendship is wonderful, and much ink has been spilled in citing the virtues of having friends. That's not to say friendship is easy, though. It demands time and effort, and it requires that people put someone other than themselves first sometimes. But in exchange for that work, a friend can provide an immense amount of support and comfort in good times and in bad. Keep reading to learn more about the various types of friendship. Advertisement"
}