{
  "url": "https://www.hollywoodreporter.com/tv/tv-news/pete-davidson-saturday-night-live-ice-alexander-skarsgard-1236491064/",
  "title": "Pete Davidson Returns to Saturday Night Live to Lecture ICE Agents",
  "text": "The 1,000th regular episode of Saturday Night Live saw alum Pete Davidson return to lecture Immigration and Customs Enforcement amid ongoing tensions in Minneapolis. Davidson joined the cold open to portray White House border czar Tom Homan, who was sent there “in response to the chaotic situation in Minnesota” to meet with “ICE unit commanders to clarify the mission objectives.” “My name is Tom Homan,” Davidson began. “Now I’m sure a lot of you are wondering why Greg Bovino, the last guy, was dismissed. I wanna stress that it wasn’t because he did a bad job or publicly lied about the shooting of an American citizen or even, oh, dressed like a Nazi. It was that he was filmed doing these things.” Related Stories The King of Staten Island star continued, “I’m here now and we need to tighten up. That starts with remembering the mission objective. Now, who could tell me why we’re here in Minneapolis?” One faux ICE agent merely said, “Pass,” while another responded, “This could be wrong, but Army.” Davidson’s Homan responded, “That’s close. We’re here to detain and deport illegal immigrants who have committed crimes.” “That is literally the first I’m hearing of that,” one ICE agent offered as a response. Still, Davidson’s Homan tried to steer the group back on track. “Forget everything you were told before. We’re not here to intimidate, racially profile or violate anyone’s rights. So again, what are we looking for?” he questioned, to which an agent responded, “Epstein files.” “Nope, we actually just released those to distract from this, you know, which is ironic because we did this to distract from those,” he replied. Davidson served as an SNL castmember from 2014-2022. He has since returned to host the sketch comedy series and has made several cameos over the years. The comedian’s surprise appearance came as his second of season 51 — he previously joined the “Weekend Update” segment during the Nov. 8 show. There, he and Colin Jost traded jokes about the ferry they purchased together years ago. Alexander Skarsgard made his SNL hosting debut during the Jan. 31 show, while Cardi B returned for her sophomore appearance on the sketch-comedy series. (The “Up” rapper previously appeared on the April 7, 2018, episode alongside Chadwick Boseman.) During his monologue, the Pillion actor joked about his Swedish heritage: “Now, when I was a kid, I loved watching this show from my igloo back in Stockholm.” “But during these monologues, I would never focus on the host,” he continued. “I was more interested in the band back there in the background, sometimes laughing, more often not.” Alexander went on to join the SNL band to play the saxophone. And in another surprise moment, Alexander’s father, Stellan Skarsgard made a cameo during two separate sketches. The first saw the Moment actor and Chloe Fineman play a Swedish sibling duo who, in between takes of the faux film, laugh at their character’s story of their family problems. Toward the end of the bit, they meet with their father, played by Stellan, in a bathtub, where he is ready to die. In the second bit, a new iteration of SNL‘s “Immigrant Dad Talk Show” bit, Stellan appeared once more. They were also joined by Cardi B, who served as the night’s musical performer, to play Marcello Hernández’s character’s wife. After the first bit the Oscar nominee appeared in was over, SNL announced that Heated Rivalry star Connor Storrie will serve as the next host for the Feb. 28 episode, with Mumford & Sons as musical guest. SNL also shared a tribute to Catherine O’Hara at the end of the episode. A plethora of season 51 episodes have already aired, as Bad Bunny, Amy Poehler, Sabrina Carpenter, Miles Teller, Nikki Glaser, Glen Powell, Melissa McCarthy, Josh O’Connor, Ariana Grande, Finn Wolfhard and Teyana Taylor all took turns in the leading role. THR Newsletters Sign up for THR news straight to your inbox every day"
}