{
  "url": "https://www.photovoltaikforum.com/thread/199750-deye-wechselrichter-keine-verbindung-zum-wlan-oder-solarman-app-möglich/",
  "title": "Deye Wechselrichter keine Verbindung zum WLan oder Solarman App möglich - Wechselrichter - Photovoltaikforum",
  "text": "Hallo zusammen, am Dienstag habe ich mein Balkonkraftwerk mit dem Deye Wechselrichter aufs Garagendach gesetzt. Leider hab ich das Problem dass ich den Wechselrichter nicht ins WLan bekomme (oder mit der Solarman App). Habe schon hier nach Lösungsmöglichkeiten gesucht doch noch keine gefunden. Also fang ich mal ganz vorn an. Dienstag Anlage aufgebaut (strahlender Sonnenschein, keine Wolke am Himmel). Panels mit dem Wechselrichter verbunden (Led blinkt rot), anschließend Wechselrichter mit dem Wechselstrom verbunden (Led blinkt blau). Soweit so gut. Dann mit AP_***** verbinden, konnte ich im WLan vom Handy finden (5GHz hatte ich schon deaktiviert). Dann über Ip 10.10.100.254 verbunden und den Wizard gestartet, mein WLan rausgesucht und das Wlan Passwort eingegeben und beim 4ten Schritt mit Ok bestätigt. Danach konnte ich nicht mehr über die IP 10.10.100.254 eine Verbindung herstellen. Auch in der Fritzbox taucht nichts auf. Habe weitergemacht mit der Solarman App. Anlage angelegt. Anschließend den Logger mittels QR-Code gescannt und mit dem Heimnetz verbunden. Das Netz wird überprüft (so wie hier im Bild). Dann bin ich zum AP connect gekommen. Dort habe ich dann unter WLan das AP_***** ausgewählt das Passwort 12345678 eingegeben und bekam die Meldung das keine Internetverbindung. Von da an ging es nicht weiter. Ich lande immer wieder hier. Ein Abschluss der Einrichtung gelingt nicht. Hab die App neu gestartet, das Handy neu gestartet hat alles nichts gebracht. Nach gut 2 Stunden und min. 20 Versuchen hab ich aufgehört (Sonne ging auch unter). Mittwoch beim wolkenlosen Himmel und Sonnenschein weiter gemacht. Aber ich finde den AP_**** nicht mehr im WLan, weder mit Handy noch mit Tablet. Also Wechselrichter vom Wechselstrom getrennt, dann die Panels vom Wechselrichter und 20 Minuten gewartet. Die Panels mit dem Wechselrichter verbunden (Led blinkt rot), anschließend Wechselrichter wieder mit dem Wechselstrom verbunden (Led blinkt blau). Doch AP_ ist nicht mehr im WLan zu finden. Auch aufrufen mit der IP 10.10.100.254 kann ich nicht mehr. AP ist nicht mehr zu finden, ebenso ist in der Fritzbox kein Wechselrichter. Hatte mich direkt neben den Wechselrichter gesetzt doch kein AP zu finden. Nach ein paar Stunden dann Wechselstrom getrennt und dann bis heute morgen vom Netz getrennt. Wieder alles verbunden und immer noch nichts zu finden. Bin mehr als nur noch ratlos (und gefrustet). Hat jemand noch eine Idee was ich machen kann? Oder weiß wie ich einen Reset durchführen kann (dazu hab ich nicht gefunden)? Viele Grüße"
}