{
  "url": "https://en.wikipedia.org/wiki/Nexus_Mods",
  "title": "Nexus Mods - Wikipedia",
  "text": "Nexus Mods Nexus Mods is an online platform centred around the hosting of computer game modifications and other user-created content related to video game modding. Founded in 2001 as Morrowind Chronicles, a fan site for The Elder Scrolls III: Morrowind,[1] it later became known as Morrowind Source with the addition of hosting mods for Morrowind. It continued to rebrand as it expanded to support additional games, going by the names TESSource, TESNexus, the Nexus, and finally Nexus Mods.[1][2][3] It features a dedicated forum and wiki for site and mod-related topics.[4][5] Nexus Mods has received particular coverage for the hosting and publication of particular mods by gaming and computer-related news publications.[6] As of February 2026[update], Nexus Mods has over 70.7 million registered users with 4,297 games supported,[7] and has seen over 21 billion file downloads since its initial launch. History [edit]Nexus Mods was founded by Robin Scott (Dark0ne) and a friend in August 2001 as a fan site for the Bethesda Softworks game The Elder Scrolls III: Morrowind under the name \"Morrowind Chronicles\".[1] After the success of Morrowind Chronicles, Scott and the friend he was working with founded a company by the name of GamingSource and created the website TESSource, which allowed users to upload their modifications and custom content for games in The Elder Scrolls video game series. Scott soon became tired with the revenue of the websites being split when he was operating the websites by himself, and made the decision to break away from TESSource in 2007 and founded his own website under the name of TESNexus. Scott made use of the TESSource website with his new venture. This resulted in more than 200 additional games being supported by early 2017.[2][failed verification] Scott indicated in 2013 that the Nexus sites would remain free of corporate investment in the foreseeable future, also avoiding direct ads. Revenue instead came from premium memberships, with the site otherwise free.[8] In December 2015, the website reported a possible security breach of account names,[9] and recommended that its members change their passwords. Financial information was not breached, as the website uses PayPal for all transactions.[10] In 2016, following an extensive survey of existing users, the website received its biggest redesign to date.[11] The redesign saw the introduction of a responsive viewport allowing seamless browsing on a mobile device, an intuitive navigation bar and the ability to pin games to the user's profile. In June 2021, in a series of announcements in Nexus's developer forums followed by a lengthy public announcement on 1 July,[12] Nexus Mods stated that they would no longer be deleting mods at mod authors' request, but instead retaining archival copies for use in a new Collections feature. The initial announcements sparked complaints by numerous mod authors, causing Nexus to allow a one-month grace period for mod authors to either accede to the policy change or pull all of their mods from the site.[13] The response by mod-authors was mixed, with some announcing that they would be pulling or ceasing support for their mods, while others supported the move.[12] On 16 June 2025, Robin Scott announced he had sold Nexus Mods to a yet-named buyer, as to step back from the stress of managing the site. Scott did not name the new owner but expressed that he had carefully selected them for operating the site. While he will continue to support the site, he planned to relinquish administrative duties to two long-time moderators of the site.[14] The owner was later revealed to be Chosen, a growth-focused gaming company. In light of previous statements by Victor Folmann, a co-founder of Chosen, who previously has advocated for in-app purchases, NFTs, and cryptocurrencies, Scott reassured that they are not introducing monetization schemes or paid mods to the website.[15][16] Controversies [edit]In August 2022, an account by the username \"Mike Hawk\", who was labeled by Nexus Mods as a sockpuppet account for Internet trolling, uploaded a texture modification for Marvel's Spider-Man called \"Non-Newtonian New York\", replacing the rainbow flag with the flag of the United States,[17][18] with the description \"changes the stupid pride flags with american flags\" [sic] in an apparent effort to sow controversy. The modification was removed by Nexus Mods moderators shortly thereafter, and the offending user was banned from the site. This was not without garnering backlash from some users who were displeased with the ban; the site later went on to state that, \"we are for inclusivity, we are for diversity. If we think someone is uploading a mod on our site with the intent to deliberately be against inclusivity and/or diversity then we will take action against it\", also advising users who disagreed with the ban to delete their accounts in advance.[18] A similar announcement was also made by ModDB when a Twitter user informed the site that the flag modification was mirrored on ModDB, which the site's moderators promptly removed before banning the user, similar to Nexus.[19][20][21] On 23 April 2025, a mod was released for The Elder Scrolls IV: Oblivion Remastered that changes the game's labeling of body types from \"body type 1\" and \"body type 2\" to \"male\" and \"female\", the same as it was in the original 2006 game. The mod did not alter any other content in the game. Nexus Mods moderators removed the mod soon after its release and banned the creator, citing \"posting an intentionally antagonistic mod with intention to evade the rules\" as the reason for the ban. The mod was later restored with a community notice, stating that the mod was not taken down for its content and that the uploader \"expressed an intent to incite drama and endorsed an external site explicitly designed to host inflammatory content.\"[22][23] Notable mods [edit]Mods hosted on the site can change games in a number of ways, from adding a first-person perspective[24] to adding fully developed worldspaces with voice-acted quests.[25] Mods for The Witcher have been built for improving immersion,[26] and Nexus Mods is highly noted for its support of the game The Elder Scrolls V: Skyrim and is often regarded as the largest website supporting modifications for games in The Elder Scrolls series of games, with sites like PC Gamer and Kotaku referencing Nexus in multiple articles regarding modifications for The Elder Scrolls series.[27][28] The website's hosting and publication of various mods has been covered in the gaming and computer press.[6] In 2016, Forbes praised the \"Alternate Start - Live Another Life\" mod posted to Nexus for The Elder Scrolls V: Skyrim - Special Edition in a feature article.[29] In January 2017, a Fallout 4 mod on Nexus Mods was covered in the Daily Express,[6] with other Fallout 4 mods reported on by WWG,[30] Paste Magazine,[31] the Christian Times,[32] and PC Gamer.[33][34] Website [edit]Features [edit]Nexus Mods requires users to register before uploading any files or downloading files over a certain size.[35] User accounts integrate across all of the available sites, meaning a user only needs one account to make use of all of the Nexus websites. Each account and file page is also integrated with the Nexus Forums.[citation needed] The website gives users the ability to:[citation needed] - Upload files to their modification's webpage - Create and display an information page about their modification - Upload images of their modification - Comment on file pages - Browse categories to find modifications for their games - Search for a specific modification for their games In June 2016, wide-ranging theft of Nexus Mods content for other corporate mod websites was noted in the press, with Nexus founder and owner Robin Scott (Dark0ne) criticizing Bethesda's lack of response to the issue.[36] That month, Nexus added an extra permissions system to the website so that stolen mods on other websites were easier to see. Although there was already an extensive permissions system for mods, the addition to the system for console modding allowed users to select what their intent for the mod was in terms of use, and where they would allow it to be available. It also allowed \"console players to search the Nexus system for mods they can find via their console's Bethesda.net browser if they like the look of them.\"[37] Supported games [edit]Nexus Mods supports 4,297 games as of February 2026[update], and features a single forum and a wiki for site and mod-related topics.[4] The main Nexus Mods web page lists the various games for which mods are available, along with the number of files, authors and downloads. As of January 2026, the top 20 games on Nexus Mods by mod count are:[38] - The Elder Scrolls V: Skyrim Special Edition - The Elder Scrolls V: Skyrim - Fallout 4 - Fallout: New Vegas - The Elder Scrolls IV: Oblivion - Stardew Valley - Cyberpunk 2077 - Fallout 3 - Baldur's Gate 3 - The Elder Scrolls III: Morrowind - Starfield - Star Wars Battlefront II (2017) - Blade & Sorcery - The Witcher 3: Wild Hunt - Helldivers 2 - Mount & Blade II: Bannerlord - 7 Days to Die - Elden Ring - Monster Hunter: World - Red Dead Redemption 2 Mod management [edit]Nexus Mod Manager (NMM) is an open-source program associated with Nexus Mods and was the original mod manager promoted by Nexus Mods.[39] Available only for Microsoft Windows, it automates the download and installation of mods for 30+ games as of May 2022, among them The Elder Scrolls V: Skyrim and Fallout 3.[40] Advantages of using NMM over manual mod installation include easy organization, installation, and uninstallation of mods. According to t, NMM \"integrates with the Nexus sites to provide you with a fast, efficient, and much less hassled modding experience.\"[40][failed verification] In early 2018, it was superseded by a new and improved dedicated mod manager called Vortex, with support for NMM being discontinued and the mod manager archived. Nexus Mods App, a purported successor to Vortex, was in active development as of January 2026. On the 14th, development of the app was discontinued in favor of shifting all focus back to Vortex, while integrating into it some of the principles and planned features of the App.[41][42] See also [edit]Notes [edit]- ^ Required for file downloads, image uploads, mod publishing, forum participation, and other features offered by Nexus Mods that require user registration. References [edit]- ^ a b c d \"Interview with DarkOne\". Bethesda Softworks. Archived from the original on 3 April 2013. Retrieved 3 February 2013. - ^ a b \"Nexus Mods Forums\". Black Tree Gaming Ltd. Retrieved 3 February 2013. - ^ Scott, Robin (18 August 2008). \"TESNexus 7 year anniversary\". Nexus Mods. Black Tree Gaming Ltd. Retrieved 26 April 2024. - ^ a b \"Nexus Mods\". Black Tree Gaming Ltd. Retrieved 10 June 2022. - ^ \"Nexus Mods :: Games\". Nexus Mods :: Games. Retrieved 1 October 2024. - ^ a b c Martin, Liam (27 January 2017). \"Fallout 4 mods UPDATE: Epic battle comes to Xbox One but it's bad news for PS4 owners\". Daily Express. Retrieved 3 January 2017. - ^ \"Network statistics\". NexusMods. Retrieved 24 January 2026. - ^ Hamilton, Kirk (3 February 2013). \"Nexus Mods Owner Says 'F That' To Bringing On Investors\". Kotaku. Archived from the original on 5 February 2013. Retrieved 5 February 2013. - ^ Morrison, Angus (8 December 2015). \"Nexus Mods gets the all-clear—but change your password anyway\". PCGamer. Retrieved 17 January 2026. - ^ Morrison, Angus (7 December 2015). \"Nexus Mods user database may have been breached\". PCGamer. Retrieved 17 January 2026. - ^ \"BlindJudge Shares a Sneak Peek at the Nexus Mods Redesign\". Blindjudge. 9 August 2016. Retrieved 26 April 2021. - ^ a b \"An important notice and our future plans for collections\". July 2021. - ^ \"Major Modding Site Pisses off Tons of Users, Sparking Revolt\". 2 July 2021. - ^ \"Nexus Mods is being sold after 24 years by burned-out owner\". Polygon. - ^ Warren, Mark (17 June 2025). \"Nexus Mods' new owner is a company whose co-founder has already had to reassure folks that NFTs and crypto aren't incoming\". Rock Paper Shotgun. Gamer Network. Retrieved 17 June 2025. - ^ Makar, Connor (17 June 2025). \"End of an era: Nexus Mods has change in ownership after 24 years following \"stress-related health issues\"\". Eurogamer. Gamer Network. Retrieved 17 June 2025. - ^ \"'Spider-Man' modification scene turns into Pride flag battlefield\". Washington Post. Retrieved 27 August 2022. - ^ a b Dustin Bailey (17 August 2022). \"Mod site deletes anti-Pride mod for Spider-Man, encourages angry users to delete their accounts\". gamesradar. Retrieved 27 August 2022. - ^ Quintos, Nichole (19 August 2022). \"Spider-Man Remastered: Anti-LGBTQ controversy explained\". Spiel Times. Retrieved 27 August 2022. - ^ DINSDALE, RYAN (18 August 2022). \"Modding Websites Take Stance Against Anti LGBTQ+ Content\". IGN. Retrieved 13 August 2024. - ^ \"Modding Websites Take Stance Against Anti LGBTQ+ Content- IGN Daily Fix\". IGN. 18 August 2022. - ^ Valens, Ana (23 April 2025). \"Is 'Oblivion Remastered' Too Woke? Right-Wing Gamers Are Trying to Mod Out This Feature\". VICE. Retrieved 27 April 2025. - ^ Andy Chalk (25 April 2025). \"Nexus Mods decides to allow an Oblivion Remastered mod that changes 'body type' options to male/female, declares it's not 'a battleground for broader cultural or political debates'\". PC Gamer. Retrieved 27 April 2025. - ^ Megan Farokhmanesh (12 January 2015). \"Play Metal Gear Solid 5: Ground Zeroes in first-person mode with this PC mod\". Polygon. - ^ Birnbaum, Ian (16 July 2013). \"Behind Falskaar, a massive new Skyrim mod, and the 19-year-old who spent a year building it\". PC Gamer. - ^ Chalk, Andy (22 July 2016). \"The Witcher 3 first-person mod gives gamers a Geralt's-eye view of the world\". PC Gamer. Retrieved 3 January 2017. - ^ Livingston, Christopher (12 January 2022). \"The 50 best Skyrim mods\". PC Gamer. - ^ Kirk Hamilton (19 April 2012). \"How To Get Skyrim Looking As Awesome As Computationally Possible\". Kotaku. Gawker Media. - ^ Kain, Erik (31 October 2016). \"One 'Skyrim Special Edition' Mod You Need If You've Already Played 'Skyrim'\". Forbes. Retrieved 3 January 2017. - ^ Hayes, Matthew (11 January 2017). \"Fallout 4 Mod Turns the Game Into a Classic 90s Shooter\". WWG. Retrieved 3 January 2017. - ^ McKenney, Kyle (21 June 2016). \"Fallout 4 Console Mods Are Frustrating the Modding Community\". Paste Magazine. Archived from the original on 2 February 2017. Retrieved 3 January 2017. - ^ Villegas, Jackie (27 October 2016). \"'Fallout 4' mods update: Nexus mods improve gameplay; Bethesda clarifies restrictions on PS4 mods\". Christian Times. Retrieved 3 January 2017. - ^ Livingston, Christopher (January 2017). \"This mod lets you play a badass '90s-style corridor shooter inside Fallout 4\". PC Gamer. Retrieved 3 January 2017. - ^ Livingston, Christopher (January 2017). \"Watch me die a lot in Frost, a mod that turns Fallout 4 into a true survival game\". PC Gamer. Retrieved 3 January 2017. - ^ \"Site statistics\". NexusMods. Retrieved 26 April 2021. - ^ Domirez, Darren (20 June 2016), 'Skyrim', 'Fallout 4' Mods Hold Nexus Mod Owner Security Amid Apathetic Bethesda; Fallout 4 Mods Now Requires Steam-Linked Accounts, University Herald - ^ Higgins, Chris (18 June 2016), Nexus Mods owner takes Bethesda.net mod theft into own hands, PCGamesN, retrieved 3 January 2017 - ^ \"Games - Nexus Mods\". Nexus Mods. Retrieved 11 January 2026. - ^ \"Nexus Mod Manager\". NMM on Github. Retrieved 16 November 2021. - ^ a b \"NMM\". NMM on NexusMods.com. Retrieved 16 November 2021. - ^ Dawe, Liam (14 January 2026). \"Nexus Mods retire their in-development cross-platform app to focus back on Vortex\". GamingOnLinux. Retrieved 18 January 2026. - ^ \"Why We're Focusing on Vortex Going Forward\". Nexus Mods :: News :: Site News. 14 January 2026. Retrieved 15 January 2026."
}