{
  "url": "https://techcommunity.microsoft.com/blog/MicrosoftTeamsBlog/what’s-new-in-microsoft-teams--microsoft-ignite-2025/4470387",
  "title": "What’s New in Microsoft Teams | Microsoft Ignite 2025 | Microsoft Community Hub",
  "text": "Welcome to What’s new in Teams, Ignite 2025 edition! This year at Microsoft Ignite we’re excited to share all the ways that Teams + Copilot are amplifying collaboration, automating workflows, and enhancing productivity. With Copilot and agents in chats, meetings, and channels, Teams and Copilot together provide a powerful solution. One new feature I’m excited to share is Teams Mode for Microsoft 365 Copilot. This powerful new capability lets you bring coworkers into your Copilot conversations, essentially turning an individual AI chat into a shared, group AI collaboration. You can choose which messages you’d like to share with the group; any prompts or responses not selected are kept private. Then, your team can brainstorm and create with Copilot together, with everyone able to ask questions and see suggestions in a group chat. Copilot is also now seamlessly integrated into Teams channels and chats, so you can ask it to recap lengthy conversation threads, extract decisions and tasks, or answer questions based on the conversation context – a huge time saver for your busy schedule. We’re also proud to announce new enhancements to Channel Agent, Facilitator, and meeting recap notes that make them even more powerful and useful. Channel agents can generate status reports and workback plans – keeping your team on track. Facilitator can recognize when you share an agenda in the chat and use it to generate a meeting progress bar, ping meeting invitees who’ve been mentioned twice but not joined yet, and draft documents during your meeting. Meeting recaps are now more versatile too. You can choose from a variety of templates or customize your own to fit your team’s style. All of the new Teams + Copilot features debuting at Ignite 2025 underline a simple message: AI in Teams is driving tangible improvements that can help you and your team achieve more together. So read on for a look at all of the new features being released this month! Feature categories: (All features listed are generally available unless otherwise noted) Meetings, webinars, and townhalls Chat and Collaboration Copilot experience in Teams The Copilot experience in Teams is being unified across chats, channels, and meetings for users with a Microsoft 365 Copilot license, matching the experience in the Microsoft 365 Copilot app. Beyond the updated interface, Copilot in Teams can analyze chat history, meeting transcripts, and calendar content to generate smart recaps, rewrite messages, and surface relevant insights. Whether reviewing a thread or following up after a call, Copilot delivers context-aware summaries and suggestions based on your activity and goals. This experience is now generally available for chat and channels, and is rolling out to public preview for meetings. Teams Mode for Copilot [Public preview] Teams Mode for Microsoft 365 Copilot is a simple, secure way to bring your co-workers into Copilot conversations, turning individual AI chats into group AI chats in Microsoft Teams. Now, the same Copilot you use for individual work supports group work as well. When you’d like to extend your 1:1 Copilot conversation into a group conversation, select “start a group chat” in the top-right corner of the Microsoft 365 Copilot app. This creates a group chat in Teams with your colleagues and Copilot, making it easy for others to build on your work. You choose which messages you’d like to bring forward to the group, ensuring any prompts or responses you don’t want to share are kept private. You can also add Copilot to any existing Teams group chat, just like adding a teammate, to help your team research, draft, coordinate, and complete tasks with AI. Then, within the chat, each member of the group can request help from Copilot by typing copilot in the group chat and making their request. Now in public preview. See Introducing Teams Mode for Microsoft 365 Copilot for more details. Enhancements to Channel Agent [Public preview] Each channel can have a Channel Agent that draws on its conversations, files, and meetings to act as a domain expert for the team. These agents adopt the channel’s name and help with common tasks – for example, flagging important deadlines that are buried in conversations, and summarizing progress with succinct status reports. Channel Agent is available with a Copilot license. New enhancements now available in public preview: - Status report update: stay on top of projects by at-mentioning the agent with queries like “create a status report.” Status reports will now post directly in the channel for all users. Workback Plan: share your objective and deadline with the agent, and it will automatically create a sequenced list of tasks with due dates. You can review and adjust the plan before tasks are added to Planner, making project planning simple and collaborative. Enhancements to external collaboration [Public preview] We've reimagined external collaboration in Teams to make it easier and more secure to connect with partners, vendors, and customers. These new features are designed to reduce friction, increase security, and enhance how you work with people outside your organization, while helping admins manage external collab. These features are now in public preview. - Chat with anyone: users in SMB organizations can start a conversation from Teams with anyone using just their email address, even if they’re not on Teams. Whether you're working with a vendor, client, or partner, simply type their email, send your message, and they’ll receive an invitation to join the chat as a guest. From there, they both reply and start a call—just like they would if they were part of your organization. And because this experience is built on Teams’ existing guest access framework, IT admins retain control. External access policies, multifactor authentication, and organizational compliance settings are respected. - Sharing a file or a Loop: Now you can share a file or a Loop component in an external chat. Whether you drag and drop, attach from your device, or paste a link, Teams recognizes the file, unfurls it in the compose box and shares it with the chat participants when you send the message. You can also adjust permissions before sending. As a recipient, you can now view the content right from the chat - no account switching required. Sharing is controlled by an admin toggle, which is off by default, giving organizations flexibility to enable or disable external sharing as needed. - Trust Indicators: External users are now labeled with clear trust indicators, helping users quickly assess who they’re working with. Group chats and Meeting chats that have external users are also marked as External to drive clarity and security. Labels include external-familiar, external-unfamiliar, guest, or unverified. - Activity in other accounts and organizations: users can view and respond to activity across multiple tenants without switching accounts. You can triage notifications, reply to chats, and pin tenants to the left rail for quick access. This reduces context switching and makes cross-org collaboration feel native—especially useful for users working with multiple vendors or clients. - Admin Presets: Admins have access to a new overview page in the Teams admin center under the external collaboration section. This page allows admins to review and modify their organization's external collaboration settings. To make changes, admins can use a guided flow and select either the open or controlled preset modes, or choose to customize the settings. Pop out your core Teams functions into a new window [Public preview] You can now organize your work environment to fit your needs by opening Teams chat, calls, calendar, activity, and more in separate windows. This gives you the flexibility to multitask and organize your workspace the way you want. Whether you're catching up on chats while reviewing call history or managing notifications alongside your calendar, this update helps you stay productive without switching tabs. Just right-click an app icon or use the app flyout to pop it out into its own window. Forwarded Messages Links When someone forwards a message in Teams, you'll now be able to click a link that takes you straight to the original chat or channel where it came from. Note: the link works only if the recipient has access to the original conversation. This enhancement improves message traceability and helps users quickly understand the context of forwarded messages. Search in Teams Settings Teams now has a new search bar at the top of its Settings menu to help you quickly find any setting by name. Just type a keyword (like “Notifications” or “Dark mode”) to jump straight to that option without digging through menus. This saves time and makes adjusting your settings faster and easier. Collaborative space in chat and channels A persistent collaborative space is now available directly from your Teams chat and channels, helping you organize key information, co-create content, and reduce message clutter. Pages in channels are flexible collaboration pages. You can add as many pages as you need to your channels. You can also add existing Loop components or pages as their own tabs, making it easy to centralize work and keep everyone aligned. Notes in chat is available in 1:1 and group chats and is accessible only to the chat members. Use this editable collaborative space effectively by adding images, formatting text, sharing Loop components, and @mentioning chat members when you require their attention. Emojis in section names You can now choose an emoji to accompany section names in your chats and channels list, helping you organize content with a splash of personality. Whether it’s a smiley for your “Fun Projects” section or a star for “Priority Tasks,” emojis make navigation easier and more engaging, so your sections stand out at a glance. Platform Channel agents in Teams connect to Asana, Atlassian, GitHub [Public preview] Channel Agent can now connect with Asana, Atlassian, and GitHub via MCP server to execute workflows on the behalf of users. By unlocking the power of agent to MCP server communication, agents can now handle more complex tasks that involve subjects outside of their domain so they can seamlessly coordinate tasks, bridge gaps between tools, and accelerate complex projects. Security and Compliance information for more Apps and Agents Today, IT admins in the Teams admin center can view security and compliance data for apps and agents that are Microsoft 365 certified or publisher attested. This enhancement expands that visibility to include apps and agents that are not certified or attested. Where available, this data is sourced from Microsoft Defender for Cloud Apps (MDA) and helps admins more easily and quickly evaluate whether an app or agent meets their organization’s trust requirements. Agent and bot support for Entra authentication in group chats Agents and bots in group chats can now use Entra for secure authentication. If an agent/bot needs your Entra token in a group chat and you haven’t installed the agent/bot or granted permission yet, you’ll receive a private message that only you can see. This message will guide you through installing the Teams app and granting Entra permission, making the process simple and secure. Once you’ve completed both steps, the agent/bot will be able to access the permissions it needs—such as Microsoft Graph—so you can get the full experience without any hassle. This update gives you more control over your permissions and makes it easier for agents/bots to work smoothly in group chats. Permission and privilege level of Apps and Agents IT admins can now see which permissions an app or agent requires in the Teams admin center, along with each permission risk rating and the app's overall privilege level. This helps admins protect organizational data and make quicker, more informed approval choices. Speed up app reviews with trust-based filters Trust-based filters enable IT Administrators using Teams admin center to view and easily filter apps and agents by specific industry standards, certifications and compliance attributes such as SOC 2, ISO 27001, HIPAA, GDPR, and more. This will help to streamline app evaluation workflows, enabling broader access to trusted apps across the organization. Performance Audit Tool on Teams Mobile Performance Report is a mobile-first, self-serve tool that gives developers instant visibility into critical performance metrics such as app load latency, app package size, content paint times and more, alongside actionable guidance on Teams best practices. By surfacing these performance indicators with recommended thresholds, this tool streamlines diagnostics, ensures consistent benchmarking, and helps deliver higher-quality Teams Mobile apps—all on the go. Agent Analytics and App Validation Enhancements in Developer Portal The Developer Portal is expanding analytics coverage for custom engine agents to help developers track adoption and engagement with real-time insights, providing key metrics to refine and optimize agent performance. You can also validate your agent and apps in Developer Portal with new AI insights helping resolve common bugs prior to publishing. Meetings, webinars, and town halls Enhancements to Facilitator Agent Earlier this year, we introduced Facilitator to help teams run meetings that stay focused, productive, and on track. Today, we’re taking that a step further with a new set of skills designed to help your team stay aligned without extra effort. These updates combine richer context awareness with proactive support, so your team can move faster without juggling extra tools or tasks. Here’s what’s new: - Facilitator can now recognize an agenda shared directly in the meeting chat, in addition to the meeting invite and meeting notes. Once detected, it automatically builds a live progress tracker at the top of the meeting, giving everyone a shared sense of where they are and what’s next. Now generally available. - If someone who’s invited hasn’t joined yet, and their name comes up twice in conversation, the agent politely pings them in chat and nudges them to hop in, helping you bring the right people into the discussion at the right time. Coming next quarter. - And when it’s time to turn discussion into action, you can ask Facilitator to draft documents in Word or Loop based on what was said in the meeting. It can shape the conversation into whatever output you need, whether that’s a blog, a whitepaper, or a project brief, helping your team turn ideas into action faster. This capability is currently in public preview and will be generally available in early December. - As tasks are mentioned, the agent captures and assigns them. You can also direct it through chat to add, update, or reassign tasks. This capability is currently in public preview and will be generally available in early December. These new skills build on our commitment to make meetings smarter, smoother, and more collaborative, with AI that works alongside you and your team every step of the way. Meeting recap templates Staying aligned after a meeting shouldn’t mean settling for a one-size-fits-all recap. With our new customizable recap templates, you can shape your AI-generated notes to match exactly how your team works. Choose from two ready-made templates, a Speaker Summary that organizes insights by participant, or an Executive Summary that highlights key takeaways at a glance. And for teams who prefer their own style, you can design custom templates using a simple free-text prompt: just describe the structure you want—even paste in a format you’ve used before—and your AI notes will instantly adapt. You can also save your custom templates for future reuse, giving every meeting the same level of clarity, consistency, and efficiency. Available in public preview on both desktop and mobile in December. Branded reactions [Private preview] Visual identity shapes how your organization shows up. Whether it's a client presentation, an internal milestone, or a seasonal event, the right visuals set the tone and reinforce your brand. With new branded reactions, organizations can now extend their visual identity directly into meetings. IT admins simply upload custom reaction icons reflecting brand elements or event themes, and these instantly become available for meeting participants. Every clap, thumbs-up, or celebration now aligns with your organization's look and feel. A simple way to create more cohesive, on-brand meeting experiences. Branded reactions will be available in private preview in December. Screen & Window Sharing on Mac via Mac OS Native Picker Mac users can now share their screen or specific windows using the standard native picker experience. By opting in through settings, users can enjoy a fully integrated sharing flow that leverages macOS’s default desktop interface—ensuring a familiar, secure, and streamlined experience. Enhancements to Teams Town hall Recent updates to Teams Town hall make it easier than ever for organizers to create professional and polished experiences that engage audiences. Enhanced presenter controls, integrated Q&A and polls, and robust moderation tools ensure smooth delivery, while advanced production capabilities, like custom branding and rich layouts, help elevate the look and feel of a town hall. New experiences for town hall in Microsoft Teams Rooms help foster collaboration whether participants join in-person or remotely. For more information on Teams town hall, click here to learn more. Front-of-room view control for Town Hall in Teams Rooms on Android When a Teams Rooms on Android is invited as a meeting presenter, the front-of-room display defaults to the attendee view. Presenters always have full control from the console, including green room and off-stage management, and can switch the front-of-room display to presenter view without impacting attendees. This feature was released for Teams Rooms on Windows in October 2025. Available in Teams Rooms Pro. Learn more here. Teams Town hall insights – Presenter analytics Presenter analytics for town hall provides organizers with visibility into the health of the presenter’s stream, providing insights covering video quality, audio clarity, and connection stability. Whether it’s a town hall, live training session, or an all-hands meeting, organizers can now proactively ensure presenters deliver their content without interruptions, boosting confidence and elevating the attendee experience. Presenter analytics is generally available today for all town hall organizers with a Teams Premium license. Immersive events in Teams Immersive events in Teams allow organizers to host customizable 3D events where people can connect, interact as avatars, and have natural conversations. This experience is now generally available and has additional new features to enhance user experience. Immersive event attendees and presenters can now join from Meta Quest VR headsets, enabling full 360-degree immersion. Immersive events are also easier to participate in and navigate thanks to text-to-speech and keyboard navigation in event instances. Teams Phone Microsoft 365 Copilot chat in Calls app post-calling experience [Public Preview] The post-call Copilot experience for Teams Phone on desktop and in mobile is now powered by Microsoft 365 Copilot Chat. After a call ends, users can open Microsoft 365 Copilot Chat as a side panel in the Teams ‘Calls’ app to generate summaries, surface key insights, and get suggested next steps. By using data from Microsoft Graph and the web—not just the call transcript—Microsoft 365 Copilot Chat delivers responses that are more personalized, relevant, and actionable, helping users quickly move from conversation to follow-up. Teams mobile: Shared call line pickup indicators Delegates can resume a Teams Phone call placed on hold from any shared line directly from Teams on their mobile phone. Clear line labels and “answered/resumed by” indicators show who is handling the call and from which line, so teammates can step in to resume a call on hold without confusion. For example, in a retail store, if a customer call is put on hold at the front desk, a floor associate can pick it up from their mobile device, ensuring the customer doesn’t wait long and the call isn’t abandoned. This helps teams keep calls moving and maintain service continuity across shifts. Set Teams Mobile as Your Default Calling App We’re making it easier for Teams Phone users to stay connected and productive on the go. With this update, you can now set Teams mobile as your iPhone’s default calling app. This means every call you initiate—from Contacts, Call History, or any app—will automatically route through Teams mobile instead of the native dialer. For organizations with regulatory requirements, this capability supports more calls occurring under the enterprise-grade security and compliance policies set up for Teams. Fundamentals and Security Copilot in Teams admin center Copilot in Teams admin center streamlines administrative tasks like setting up protected meetings or confirming who has a phone number assigned, provides insights into policy configurations and call quality, and recommends configurations to optimize Teams. It empowers IT admins to troubleshoot issues, save time, and enhance the overall Microsoft Teams experience. Teams Admin Agent in Teams admin center [Now in Technical Acceptance Program (Coming soon to TAP)] The Teams Admin Agent delivers AI-powered assistance to simplify admin tasks, automate workflows, and provide actionable insights—helping IT teams manage Teams environments efficiently and confidently. This feature is currently in the Technical Acceptance program. Meeting troubleshooting enhancements [Public Preview] Administrators can quickly diagnose and resolve meeting and call issues with a simplified troubleshooting flow in Teams admin center. This experience provides clear guidance, actionable insights, and detailed telemetry to pinpoint quality problems—helping IT teams restore performance faster and keep collaboration running smoothly. Meeting best practice configurations [Public Preview] Now in Teams admin center, administrators can monitor which locations and users are experiencing meeting quality issues caused by unoptimized Virtual Desktop Infrastructure (VDI) setups. By pinpointing these VDI-related problem areas, IT can take targeted action to optimize configurations—ensuring smoother, high-quality audio and video in meetings across the organization. Tenant-Owned Domain Impersonation Protection for Teams Messaging [Public Preview] Own domain Impersonation Detection in Teams helps protect users from spoofed domains by analyzing sender identity and domain authenticity in real time, alerting users to suspicious activity and reducing phishing risks across messaging. New VDI solution for Teams optimization in Amazon WorkSpaces [Public Preview] The New VDI solution for Teams introduces multimedia offloading and optimization solution for Microsoft Teams when running in Amazon WorkSpaces (Personal and Pooled). Users of the WorkSpaces Client for Windows can enjoy a high-definition experience in virtual desktops, where audio/video/screensharing are offloaded to the user's device and processed by the SlimCore media engine. This entry applies to WorkSpaces only. AppStream, a separate application streaming service, is not supported. Weaponizable File Type Protection for Teams chat and channels Security in Teams chat and channels just got stronger, with increased protection against malware and other file-based attacks. With weaponizable file type protection, Teams now automatically detects and blocks file types that could pose a security risk—such as executable or script-based files—before they reach your chat or channel. This proactive safeguard helps keep your organization’s data and conversations secure, without disrupting collaboration. Malicious URL Protection for Teams chat and channels Microsoft Teams is introducing enhanced protection against phishing attacks by detecting and warning users about malicious URLs shared in Teams chats and channels. This feature helps users make safer decisions before clicking potentially harmful links. It is on by default for users of Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android. User reporting for incorrectly identified security concerns We’re giving users more control over security alerts in Teams. With user reporting for incorrectly identified security concerns, you can now flag false positives directly from your chat or channel. This feedback helps improve detection accuracy while ensuring your conversations stay secure without unnecessary interruptions. This feature is available in one-on-one chats, group and meeting chats, as well as public and private channels. Teams in the Windows Jump List experience On Windows, the Jump List in the taskbar provides quick access to key Teams actions. Now you can instantly view and join ongoing or upcoming meetings, schedule new meetings, or start a chat—all without opening the full app. Menu bar extension for meetings for Mac The Teams Mac menu bar extension lets users view and join imminent meetings directly from the menu bar, streamlining access to daily schedules and chats. With instant meeting visibility and join options, the menu bar extension boosts productivity and engagement, reflecting user feedback and supporting efficient workflows for busy professionals. Intelligent App shortcuts and workflows for Mac Teams now integrates with macOS Spotlight and Shortcuts, enabling users to quickly start chats and meetings. This unlocks advanced AI-powered workflows, streamlines daily tasks, and showcases Teams’ commitment to seamless, native Mac experiences for power users. Screen sharing improvement for Mac [Public Preview] Teams for Mac OS 15 (Sequoia) introduces Native Picker integration for screen sharing, streamlining permissions approvals. Users benefit from seamless sharing and Presenter Preview, while maintaining privacy and compliance with Apple’s new model—improving usability and satisfaction for Mac users in video meetings. Frontline Worker Solutions BYOD (Bring your own device) Simplify frontline onboarding on personal devices with the Teams BYOD Onboarding Wizard. Workers can use this self-serve, web-based onboarding wizard on shared PCs and kiosks for a guided experience that helps them easily set up the Teams mobile app on their personal device in compliance with organizational security policies. Reduce the need for manager assistance and IT support and deliver a low-friction experience that helps save time, cut IT overhead, and accelerate adoption, so frontline teams stay connected from day one. Pilots Kickstart frontline innovation with the Frontline Hub in Teams admin center. Create pilots in just a few clicks—choose the capabilities you want to test, select workers and managers, and monitor adoption through real-time usage insights. With built-in management controls, you can easily iterate as you learn: adjust features, update participants, and expand channels—all without slowing down your rollout. Teams Devices and Peripherals Yealink MP66W Wi-Fi based Teams device The MP66W Wi-Fi based wireless Teams device gives you the freedom to connect wherever work takes you. Designed for organizations with a mobile workforce, the Yealink MP66W wireless Teams device enhances wireless communication for the modern workplace. Currently undergoing certification as a Teams Device, this will be one of the industry’s first Wi-Fi-enabled wireless devices for Microsoft Teams, delivering greater mobility and reliability for frontline and hybrid workers. Built with a durable casing for demanding environments, such as construction job sites, it enables native Teams wireless calling—your desk is wherever there’s Wi-Fi. AI-powered noise cancellation ensures clear conversations even in noisy settings, and its long-lasting battery keeps you powered through extended shifts. Plus, a dedicated emergency alert button provides instant safety when every second counts. MAXHUB XBar W70 The MAXHUB XBar W70 Kit with console is a flagship Windows-based Teams videobar engineered for small to medium rooms. It features the industry-first MAXHUB Quad Sight lens with up to 200MP clarity, 16 beamforming microphones, AI-enhanced audio and video, and FlexMount for effortless installation. Out of the box, W70 Kit pairs with a dedicated Teams console for intuitive room control and seamless Teams integration. Built for enterprise scalability, W70 Kit supports extension to third-party AV devices and includes 3-year service coverage with remote management via MAXHUB Pivot — simplifying deployment and ongoing maintenance for IT teams. Owl Labs Lenovo & Owl Labs Microsoft Teams Rooms Bundles - ThinkSmart Core + IP or USB Controller Kit with Meeting Owl 4+, and ThinkSmart Tiny Kit Power seamless and immersive hybrid collaboration in any space with the Lenovo ThinkSmart Core and the Meeting Owl 4+. Available with IP or USB controller, The Owl Labs Meeting Owl 4+ and the Owl Labs 16' USB-C to USB-A cable. For productive and hassle-free collaboration in small Microsoft Teams Rooms, the Owl Labs ThinkSmart Tiny Kit bundle includes: the Lenovo i3 ThinkSmart Tiny Kit (Premium), the Lenovo ThinkSmart USB Controller, the Owl Labs Meeting Owl 4+, and the Owl Labs 16'/5 USB-C to USB-A cable. Logitech Express Install for Teams Rooms: Four Fast Solutions for Any Space Logitech’s new Express Install kits make setting up Teams Rooms easier than ever—no specialist required, and installation takes less than an hour. Choose from four variations: 1) Rally Bar Mini with Heckler Rolling Stand (Android), 2) Rally Bar Mini with Salamander Designs Acadia Tabletop Stand (Windows), 3) MeetUp 2 with Salamander Designs Acadia Tabletop Stand (Windows), and 4) Rally Bar Huddle with Heckler Rolling Stand (Android). All kits include a Logitech video bar, Teams Room controller, and LG display, delivering seamless Teams integration and flexible deployment for huddle and small rooms. Windows kits feature compute devices and Salamander stands, while Android kits offer mobile Heckler stands. Whether you need mobility or a sleek tabletop setup, there’s an Express Install kit for every collaboration need. Yealink LinkHub smart dock The Yealink LinkHub helps employees to find and reserve available desks with a clear LED indicator and intuitive touch display. Its screen syncs with Microsoft Teams to show real-time booking details, and it also works with Microsoft Places so employees can reserve a desk remotely before arriving onsite. Integrated with the Teams Pro Management Portal, LinkHub provides IT admins with centralized control and insights into workspace usage, helping organizations optimize space and enhance the hot-desking experience. This device is currently undergoing the process to be certified as a Certified for Teams device. Logitech Zone Wired 2 and Wireless 2ES for Business Zone Wired 2 for Business with adaptive hybrid ANC (active noise cancelation) helps employees stay focused and productive by dynamically adjusting sound to minimize background noise. 40 mm drivers and dual noise-canceling microphones are designed for open spaces and optimize ANC capabilities. Because it’s certified for Microsoft Teams and a variety of other calling solutions, you can be confident it will work with your calling platform. Intuitive controls, plug-and-play USB cable, and comfortable, gaming-inspired headband make the headset easy to use and wear all day. It’s also designed for sustainability and product longevity, including easily replaceable components for extended use and recycled plastics, fabric, and magnets. The Zone Wireless 2 ES for Business Native Bluetooth and with Receiver versions feature the same Adaptive hybrid ANC and proprietary 40 mm drivers as the Zone Wired 2, and also provide: - Premium microphones, specifically designed for open office environments that deliver crystal-clear sound quality. - Smart enumeration and multipoint Bluetooth to enable seamless audio switching - Freedom of movement with a remarkable 50 m wireless range and long battery life. Available colors for the Wireless 2 ES with receiver are: graphite, off-white, and rose. The Wireless 2 ES -Native Bluetooth is available in graphite."
}