{
  "url": "https://revistapesquisa.fapesp.br/en/luciana-santos-we-need-new-arrangements/",
  "title": "Luciana Santos: We need new arrangements : Revista Pesquisa Fapesp",
  "text": "Electrical engineer Luciana Barbosa de Oliveira Santos is the first woman to head the Brazilian Ministry of Science, Technology, and Innovation (MCTI). A graduate from the Federal University of Pernambuco (UFPE), she was secretary of Science, Technology, and Environment for Pernambuco between 2009 and 2010 and has a long political career in the state. A member of the Brazilian Communist Party, she was mayor of Olinda between 2001 and 2008 and federal deputy for two mandates, from 2011 to 2018. In charge of the MCTI, she has established the initial priorities as recovering public funding for science, technology, and innovation and combating gender inequalities in science. On February 10, she was in São Paulo to take part in the Carolina Bori Science & Woman Award, given by the Brazilian Society for the Advancement of Science (SBPC) for the past four years. The next day, she gave an interview to Pesquisa FAPESP: At the Carolina Bori Award, you said that the MCTI will tackle gender inequality in the distribution of scholarships. What are the plans? These things require immersion in the objective reality of girls that are graduating or even before graduation. This was the focus of what we tried to develop in an initiative in Pernambuco, Future Scientists, through the Center for Strategic Technologies of the Northeast, CETENE. Future Scientists is a program directed towards female students in public high school. The results are extraordinary: 70% of them passed the ENEM [national high school exam] in areas related to engineering, mathematics, and physics. But, when you go and analyze careers or participation in master’s and PhDs, the adhesion of the girls is more complicated. Lots of them stop to have children and end up struggling, for example, in career evaluations. Women are responsible for the family. Our objective is to improve the experiences, maybe join them in a single program and try to trace a flow that responds to the concrete contradictions that women experience. With regards to the funding of research, the provisional measure (MP) that set aside money from the National Scientific and Technological Development Fund (FNDCT) expired on February 5, but the funds approved in the budget do not take this into account. How do you ensure more funds? There was a blackout in science under the previous government that went way beyond the denialist narrative of dealing with Covid-19. There was a drastic reduction in funding. The ministry’s discretionary resources went from R$11 billion to R$2.7 billion. The FNDCT, composed of private sector funding in exchange for exemptions, which is a great solution that has worked in Brazil for decades, was set aside. The MEI [Business Mobilization for Innovation] joined with academia and it was possible to approve a law that prohibited the reduction of funds in 2021. Despite that, the provisional measure, No. 1.136, appeared to block this funding in a staggered form until 2026. The measure expired and there is a commitment from the government to submit a bill opening credit to recover this set-aside part of R$4.2 billion, reaching an expected total of R$9.9 billion for the fund. We are focused on increasing funding. And we need new arrangements. What type of arrangement? I debated with the president of Petrobras, Jean Paul Prates, about the need to look after the energy transition. We want to invest in renewable energy. We have a positive heritage of hydroelectric plants, as well as considerable wind and solar farms. We need to have the capacity to produce the inputs for the solar panels. The big hope at the moment is green hydrogen. This was all discussed with the president of Petrobras and we want the BNDES to also get involved in this investment package. Besides that, we have the “Lei do Bem” [a set of tax incentives for R&D to boost innovation] and the Lei da Informática [information technology law], which include private sector investments. We have to create a situation in which, for every R$1 that the ministry puts in, Petrobras and the BNDES also put in R$1, as well as the companies from the production chain sector that will benefit from the investment in science. We are among the 10 countries that most produce scientific papers, but this does not translate into innovation. Public investment in research and development in Brazil is not small when compared to that made in many countries, but the participation of companies is relatively lower. How do you involve them in this effort? Historically, encouraging some production chains has been done through exemption. You remove some taxes and the companies invest in innovation. It’s a bit like, for example, what happens in the electro-electronics industry. PADIS, a support plan for development of the semiconductor industry, foresaw this. We still don’t have the technological expertise of high-complexity chips, but there are conditions to develop skills in the country. The experience of CEITAC [National Center of Advanced Electronic Technology] revealed this. We have managed to occupy almost half of the national market for vehicle chips. The logic has been one of exemption, but I believe that, in some more dynamic sectors, we should encourage actions of sharing. We need to promote the participation of companies in innovation. The demonstration of this could be seen in the mobilization to preserve the FNDCT. The zero contingency law only came about because the industry got involved. Significant portions of the production sector are convinced of this path. You mentioned CEITEC, a production center for semiconductors that was in the process of liquidation because, according to the government, it was making a loss. How do you intend to recover this experience in a sustainable form? CEITEC did not have a policy of purchasing from the State and this needs to exist, because it makes a big difference in any production chain. Look at the example of oil and gas: if Petrobras buys Brazilian ships, we have national shipyards. If they don’t, the shipyards close down. A purchasing policy increases science and technology investments and warms up the production chain. The decision to liquidate CEITEC because it was making a loss was a mistake. Countries such as China and the USA, which have enormous competition in semiconductors, invest about US$10 billion in the sector. We have created a working group to discuss the medium- and long-term viability of CEITEC. It’s the first step towards updating the policy of semiconductors, which is part of the reindustrialization agenda. In which other areas of industry are more comprehensive projects and actions needed? We have the foundations to make the first steps and rethink the policy of science and technology in Brazil. One of them are the indications from the transition working group, which joined teams that accompany the sector; the other is the National Science and Technology Plan—the last one in Brazil was 12 years ago. A national strategy needs to guarantee sovereignty and autonomy for the country. It is necessary to reduce our dependence. Covid-19 revealed how harmful this is across the world. What can be recovered from the strategy from 12 years ago? We have defined 13 strategic areas geared towards the strengthening of emerging technologies, such as biotechnology and nanotechnology, the climate change agenda, the energy transition, or the biodiversity of the Amazon. We already have good insertion in many of these areas. In aerospace, we have a constellation of satellites, which are the CBERS [China–Brazil Earth Resources Satellites], launched in partnership with China. We want to develop the CBERS-6. This is one of the agendas for the president on his trip to China. We have the industrial health complex. We produce vaccines against Covid-19 at Butantan and Fiocruz, but not the inputs. The strategic axes need to be updated. We are going to hold a National Science and Technology Conference with this aim. The CNPq and CAPES scholarships will be readjusted by 40%, but will this be enough to revert the loss of interest of young people in a scientific career? This is a global phenomenon, but in Brazil it can also be explained by a recent process of disqualification of our scientific base. Under the previous government, universities were treated like spaces of disorder. Our universities unite the excellence that exists in teaching, in research, in extension. I think that one of the key points of the question is the lack of a national development project. If there was a bold project, based on the use of Brazilian intelligence, people would be attracted. It is necessary to emulate, boast, show how science is transformative, and how beautiful and invigorating it is, so people are proud to be scientists."
}