{
  "url": "https://www.ams.usda.gov/services/organic-certification/organic-basics",
  "title": "USDA Certified Organic: Understanding the Basics | Agricultural Marketing Service",
  "text": "Resources for Consumers and Retailers This page provides consumers and retailers information on the organic label. Retailers can download a toolkit of displays they can use in their stores or online platforms to increase consumer awareness of, and trust in, the organic label. Retailer Toolkit - View the resource toolkit and individual graphics to use in stores or online marketplaces to increase consumer awareness and understanding of the USDA organic label. What is organic? Organic is a label that indicates that a food or agricultural product has been produced according to the USDA organic standards, which require operations to use practices that cycle resources, conserve biodiversity, and preserve ecological balance. The USDA’s National Organic Program develops and enforces the standards for organic crops, livestock, and agricultural products so consumers can feel confident purchasing organic goods. The organic standards set specific requirements for different types of products. The following list provides an overview of requirements for different types of organic products. View more information on organic practice standards. See below to learn how organic is protected by law, inspected by experts, traced from farm to store, and shaped by public input. Organic is…Protected by law - The USDA organic label is the only government-backed marketing claim for organic food sold in the United States. Only foods produced according to the USDA organic standards can display the organic seal. - USDA develops and strictly enforces specific standards for organic food to clarify what practices and inputs can and cannot be used in organic production and handling. - The USDA organic seal is a registered trademark, which allows USDA to enforce criminal penalties against uncertified operations falsely using the seal to misrepresent products as organic. This protects the integrity of the organic seal and keeps fraudulent products out of the U.S. organic market. - NOP investigates complaints and takes action against businesses that violate the regulations. Organic is…Inspected by experts - Organic farms and business are certified and inspected by USDA-accredited certifiers. - Specially trained organic inspectors visit organic farms and business yearly to confirm they still meet the organic standards. Every organic operation is also subject to additional, unannounced inspections and testing. - USDA regularly audits certifiers to make sure that they are correctly inspecting farms and upholding the integrity of the organic label. - To become certified organic, operations go through a rigorous process to show that their practices follow the organic standards. Organic is…Traced from farm to store - The Strengthening Organic Enforcement rule increases the USDA’s ability to oversee and enforce the organic standards and trace organic products from the store all the way back to the farm. - Farms and businesses must keep detailed records of the organic products they produce, buy, and sell. This allows businesses to choose trusted suppliers and verify that what they sell is organic. - Certifiers audit organic supply chains to detect and deter fraud before it reaches stores. - NOP manages the Organic INTEGRITY Database, which contains up-to-date and accurate information about organic operations. These systems and processes confirm that what consumers buy is truly organic. Organic is…Shaped by public input - Stakeholders and the public can provide feedback (public comments) on proposed regulations to shape final policy decisions. - The organic standards are developed with recommendations from an advisory board—the National Organic Standards Board (NOSB)—composed of volunteers from the organic community. - Stakeholders and the public can attend bi-annual NOSB public meetings and provide input to the NOSB."
}