{
  "url": "https://www.familysearch.org/en/help/helpcenter/article/together-by-familysearch",
  "title": "Together by FamilySearch • FamilySearch",
  "text": "Together by FamilySearch is an exciting new way for youth to connect with their parents, grandparents, and other family members. Users will find ways to develop stronger family bonds and create lasting memories through interactive games and activities. Activities specific to Together help you earn points to compete with those in your family group. Points are added when activities are completed. Learn about FamilySearch privacy practices here. Note: Users must have their own FamilySearch account. - For instructions on how to create a free account for children ages 13 and up, click here. - For instructions on how to create a free account for children ages 8-12, click here. - Youth under age 8 can work on activities with a parent in the parent's account. Steps (website): - Sign in to FamilySearch.org. - Click the Activities tab at the top of the screen. - Click Together App from the drop-down menu. - Click Get Started. You may be prompted to create a family group. Choose Create Family Group or Skip for Now. Look through the tabs at the top of the Together page and choose from any of the following options: - Stories - My Favorites: Enjoy easy and fun activities where you choose your favorite foods, animals, sports, entertainment, travel, and more. - About Me: Answer the question of the week, record information about your hobbies, talents, heroes, education, life goals, and more. Or create your own journal entry. - My Family Members: Record memories, funny experiences, things you admire, and more about your deceased family members. - My Living Family Members: Record memories, hopes and dreams, funny experiences, and more about your living family members. - My Family Stories: Record memories about family vacations, family recipes, holiday memories, hobbies, and more. - Feed: - View recent activity: Memories about your family members added to their records will be shown in the feed. Activities and stories can be shared with your family groups and will be seen in the group feed. To view the feed of a specific family group instead of all of your family groups at once, click the All Family Groups down arrow and select the desired family group. - Create a post: Share something important to you in the feed. Enter what you want to share in the text box and click the blue paper icon to add a memory to your post. From within the Create Post window, click the down arrow under your username to choose the privacy of the post. You can choose for the post to be seen publicly, visible only to you, visible to your friends, or click the down arrow to the right of Family Groups to make it visible to those in your family group. Then, click the blue arrow to submit the post. - Activities: - Participate in a variety of interactive, family-friendly experiences that help you explore your heritage, share personal stories, and connect with relatives. These activities are designed to make family history engaging and accessible for all ages—create avatars for your family, discover what was happening in the world when you were born, compare your face to your ancestors, and much more! - More: - Add and manage family groups, adjust notification settings and theme options, submit feedback, and learn more about FamilySearch apps. Steps (mobile app): - Download Together by FamilySearch from your mobile device store. - Once the mobile app is installed, tap the icon to open it. - Tap Get Started. - Choose from one of the tabs at the bottom of the screen. The mobile app has the same features as the website. Please see the above descriptions for more information about each feature of Together by FamilySearch. Related Articles Where do I find the family history activities? Does FamilySearch have mobile apps?"
}